<HTML>
<HEAD>
<TITLE>TERM Como: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
<A HREF="Term-Como-1.html">Anterior</A>
<A HREF="Term-Como-3.html">Siguiente</A>
<A HREF="Term-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Introducci&oacute;n</A></H2>



<H2><A NAME="ss2.1">2.1 Sobre este Documento</A></H2>

<P> </P>
<P>Este COMO intenta aclarar algunas de las confusiones al usar
<CODE>term</CODE>, el gran programa de Michael O'Reilly que permite
multiplexar tu l&iacute;nea serie y establecer una conexi&oacute;n de red. De principio a
fin, los documentos que vienen con el <CODE>term</CODE> son bastante buenos,
y este COMO no pretende reemplazarlos.  La intenci&oacute;n de este documento es
dar una idea de fondo de c&oacute;mo trabaja el <CODE>term</CODE> y detallar los
pasos para conseguir algunos de los servicios de red m&aacute;s comunes
trabajando bajo <CODE>term</CODE>. Se debe hacer hincapi&eacute; en que este
documento no cubre todo lo que se debe saber sobre el <CODE>term</CODE>.
Despu&eacute;s de leerlo, deber&iacute;an leerse las <I>manpages</I> sobre <CODE>term</CODE>, 
ya que &eacute;stas incluyen informaci&oacute;n que no se encuentra aqu&iacute;.</P>


<H2><A NAME="ss2.2">2.2 ¿Qu&eacute; es el <CODE>TERM?</CODE></A></H2>


<P><CODE>term</CODE> es un programa, escrito por Michael O'Reilly,
<CODE>
<A HREF="mailto:michael@iinet.com.au">michael@iinet.com.au</A></CODE>
, que corre sobre una l&iacute;nea serie para permitir a
conexiones m&uacute;ltiples operar de forma concurrente --es decir, puedes estar
recibiendo un fichero con tu m&oacute;dem mientras trabajas en un sistema remoto
(distinto)-- a trav&eacute;s de la misma conexi&oacute;n m&oacute;dem. El <CODE>term</CODE> tambi&eacute;n
se puede usar para abrir ventanas de cliente X sobre una conexi&oacute;n serie. 
Por medio de las utilidades <CODE>tredir</CODE> y <CODE>tupredir</CODE> de las
versiones <CODE>2.0.x</CODE> y superiores del <CODE>term</CODE>, &eacute;ste puede proporcionar
muchos de los servicios de red ``tradicionales'':<CODE>  mail, news, ftp, telnet,
xarchie</CODE>, etc. En esencia, <CODE>term</CODE> es muy parecido a otros protocolos
serie como <CODE>SLIP</CODE> o <CODE>PPP</CODE>. La ventaja de <CODE>term</CODE> es que puede correr
enteramente desde el espacio de usuario, sin requerir soporte del kernel
ni del sistema o administradores de red.</P>
<P>A diferencia de <CODE>SLIP</CODE> o <CODE>PPP</CODE>, tu m&aacute;quina no llega a tener su propia
direcci&oacute;n IP. Todo el tr&aacute;fico deber&aacute; ir dirigido al host remoto, y
ser&aacute; redirigido a tu m&aacute;quina mediante <CODE>TERM</CODE>.</P>


<HR>
<A HREF="Term-Como-1.html">Anterior</A>
<A HREF="Term-Como-3.html">Siguiente</A>
<A HREF="Term-Como.html#toc2">Indice</A>
</BODY>
</HTML>
