<HTML>
<HEAD>
<TITLE>TERM Como: C&oacute;mo funciona el TERM</TITLE>
</HEAD>
<BODY>
<A HREF="Term-Como-2.html">Anterior</A>
<A HREF="Term-Como-4.html">Siguiente</A>
<A HREF="Term-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. C&oacute;mo funciona el <CODE>TERM</CODE></A></H2>


<P>Antes de experimentar con <CODE>term</CODE> es altamente aconsejable leer
primero este cap&iacute;tulo completo y el fichero <CODE>INSTALLATION</CODE> que viene con el
paquete. Tambi&eacute;n conviene echar una ojeada a las p&aacute;ginas de manual de
<CODE>linecheck</CODE>, <CODE>(term)test</CODE> y <CODE>term</CODE>. Esto te ayudar&aacute; a
trabajar m&aacute;s f&aacute;cil y m&aacute;s r&aacute;pido. </P>

<H2><A NAME="ss3.1">3.1 Nomenclatura</A></H2>


<P>Asumo que est&aacute;s llamando a un sistema a trav&eacute;s de alg&uacute;n tipo de servidor
de terminal. Utilizo los t&eacute;rminos <I>``local''</I> y <I>``remoto''</I>
para referirme a los sistemas conectados en casa y en la red
respectivamente (a no ser que los use para referirme a alguna otra cosa :-).</P>
<P><CODE>term</CODE> proporciona a la m&aacute;quina local, que no tiene conexi&oacute;n de
red, pero que est&aacute; conectada por una l&iacute;nea serie a una m&aacute;quina remota, la
cual a su vez est&aacute; conectada a una red, servicios de red. Observemos c&oacute;mo
una m&aacute;quina con una conexi&oacute;n de red ``tradicional'' proporciona estos
servicios. </P>
<P>Primero el usuario invoca un programa, como <CODE>telnet</CODE> o <CODE>ftp</CODE>,
que requiere un servicio de red. Lo que estos programas hacen es hacer una
llamada del sistema solicitando servicios de red. El sistema operativo
obtiene entonces estos servicios a trav&eacute;s de su interface de red (por
ejemplo, manda y recibe paquetes sobre la ethernet). </P>
<P><CODE>SLIP</CODE> y <CODE>PPP</CODE> hacen exactamente esto, convirtiendo la l&iacute;nea m&oacute;dem
en un interface de red, lo cual en principio no es diferente de una
ethernet. La pega est&aacute; en que estos protocolos hacen de la m&aacute;quina
conectada por m&oacute;dem parte de la red, justo como cualquier otra m&aacute;quina.
Esto exige toda la tarea administrativa asociada al hecho de ser un nodo
de la red (m&aacute;s a&uacute;n, ya que el enlace m&oacute;dem tambi&eacute;n hay que administrarlo). </P>
<P>En ausencia de una conexi&oacute;n de red como <CODE>SLIP</CODE> o <CODE>PPP</CODE>, ¿qu&eacute; es lo
que se hace t&iacute;picamente?. Bien, llamas a tu m&aacute;quina conectada a la red,
lees tu correo, tus news, etc, si necesitas un fichero, primero te lo
transfieres a la m&aacute;quina remota y entonces te lo env&iacute;as a la m&aacute;quina local
usando el <CODE>kermit</CODE> o alg&uacute;n otro programa de comunicaciones.</P>
<P>Esto es una pena, especialmente porque en realidad s&oacute;lo puedes hacer que
una cosa use el enlace m&oacute;dem a la vez. La idea que hay detr&aacute;s del
<CODE>term</CODE> es b&aacute;sicamente automatizar y <I>multiplexar</I> este proceso.
El <CODE>term</CODE> se invoca en ambas m&aacute;quinas, local y remota, y los dos
procesos se comunican entre s&iacute; por la l&iacute;nea m&oacute;dem.  Cuando necesitas un
servicio de red, haces una solicitud al <I>daemon</I> del <CODE>term</CODE>
local, el cual transmite la petici&oacute;n al <I>daemon</I> del <CODE>term</CODE> en
la m&aacute;quina remota (conectada a la red). El resultado se devuelve a trav&eacute;s
de la l&iacute;nea m&oacute;dem.</P>
<P>Para ser m&aacute;s precisos, pongamos que quieres conseguir un fichero por
<CODE>ftp</CODE>. Primero necesitas una versi&oacute;n de <CODE>ftp</CODE> que pueda hablar con
<CODE>term</CODE>.  Invocas <CODE>termftp</CODE> como lo haces con un <CODE>ftp</CODE>
normal, pongamos <CODE>'termftp nethost.gov'</CODE>, pero esta versi&oacute;n
especial hace su solicitud de red al daemon del <CODE>term</CODE> local en vez
de al kernel. El <CODE>term</CODE> local transfiere esta petici&oacute;n, a trav&eacute;s de
la l&iacute;nea del m&oacute;dem, al <CODE>term</CODE> remoto, el cual establece una
conexi&oacute;n con <CODE>nethost.gov</CODE>, y transmite los datos de vuelta sobre el enlace
m&oacute;dem. </P>
<P><CODE>term</CODE> es lo suficientemente listo como para tener muchas cosas
diferentes funcionando a la vez, por lo que puedes tener varias sesiones
de red distintas usando el mismo enlace m&oacute;dem; por ejemplo puedes estar
dentro de otra m&aacute;quina lejana v&iacute;a <CODE>termtelnet</CODE> mientras contin&uacute;a la
transferencia del <CODE>termftp</CODE>.</P>
<P>Si esto es demasiado abstracto (o engorroso) no te preocupes; la
informaci&oacute;n importante que hay que extraer de esta secci&oacute;n es que hay
<I>dos copias</I> del <CODE>term</CODE> corriendo, una a cada lado del
enlace m&oacute;dem.</P>


<HR>
<A HREF="Term-Como-2.html">Anterior</A>
<A HREF="Term-Como-4.html">Siguiente</A>
<A HREF="Term-Como.html#toc3">Indice</A>
</BODY>
</HTML>
