<HTML>
<HEAD>
<TITLE>TERM Como: Portando software para usarlo con term.</TITLE>
</HEAD>
<BODY>
<A HREF="Term-Como-9.html">Anterior</A>
<A HREF="Term-Como-11.html">Siguiente</A>
<A HREF="Term-Como.html#toc10">Indice</A>
<HR>
<H2><A NAME="s10">10. Portando software para usarlo con <CODE>term</CODE>.</A></H2>


<P>En principio, todos los programas que se puedan usar sobre una red pueden
usarse en combinaci&oacute;n con <CODE>term</CODE>. Algunos de ellos podr&aacute;
encontrarlos ya como binarios con soporte para <CODE>term</CODE>. Esto incluye
<CODE>telnet, (nc)ftp, mosaic</CODE> y muchos otros. La mayor&iacute;a de estos
programas se han compilado para <CODE>term</CODE> 1.17 o anteriores. A pesar
de eso, a&uacute;n deber&iacute;an funcionar con versiones m&aacute;s nuevas de <CODE>term</CODE>.</P>
<P>Otra forma de hacer que los programas funcionen con <CODE>term</CODE> es
portarlos usted mismo. Este proceso es el que se describe en la siguiente
subsecci&oacute;n. </P>
<P>El &uacute;ltimo modo de compatibilizar sus programas con <CODE>term</CODE> es
<I>termific&aacute;ndolos</I>. </P>

<H2><A NAME="ss10.1">10.1 Portar y compilar los fuentes. </A></H2>


<P>Portar software a <CODE>term</CODE> se puede hacer usando un procedimiento bastante 
sencillo:</P>
<P>Si est&aacute; instalado en <CODE>/usr/local</CODE> por <CODE>root</CODE>:</P>
<P>
<OL>
<LI> A&ntilde;ada a los flags de compilaci&oacute;n <CODE>-include
/usr/local/include/termnet.h</CODE>
</LI>
<LI> y a&ntilde;ada a la lista de librer&iacute;as <CODE>-ltermnet</CODE></LI>
</OL>
</P>
<P>Si est&aacute; instalado en su directorio <I>home</I>:</P>
<P>
<OL>
<LI> A&ntilde;ada a los par&aacute;metros de compilaci&oacute;n
<CODE>-include $HOME/term/termnet.h</CODE>
</LI>
<LI> y a&ntilde;ada a la lista de librer&iacute;as 
<CODE>-L$HOME/term -ltermnet</CODE>
</LI>
</OL>
</P>
<P>Ahora compile el software como se describe en el documento <CODE>INSTALL</CODE> o
<CODE>README</CODE> que venga con el software. ¡Ya estar&iacute;a todo! </P>
<P>En este momento los comandos deber&iacute;an funcionar con y sin <CODE>term</CODE>.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
telnet localhost
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>no usa <CODE>term</CODE> para conectar, pero</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
telnet bohr.physics.purdue.edu
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>usar&aacute; <CODE>term</CODE> s&oacute;lo si no hay otro tipo de conexi&oacute;n de red.</P>
<P>Algunos comandos, como <CODE>rlogin</CODE>, s&oacute;lo pueden ser usados por
<CODE>root</CODE> y por el propietario de la conexi&oacute;n <CODE>term</CODE> (personas
privilegiadas). </P>
<P>Algunos comandos <CODE>term</CODE> ser&aacute;n transparentes a <CODE>term</CODE> y s&oacute;lo
usar&aacute;n <CODE>term</CODE> cuando no haya otra opci&oacute;n. Algunos ejemplos t&iacute;picos
son <CODE>telnet</CODE> y <CODE>ftp</CODE>. </P>
<P>Otros requieren un par&aacute;metro externo para indicarles que les es posible
usar <CODE>term</CODE>. En estos programas se incluyen <CODE>xarchie, fsp</CODE> e
<CODE>ytalk</CODE>. </P>
<P>Se puede poner el par&aacute;metro a estos programas para que usen <CODE>term</CODE>,
bien colocando la variable de entorno <CODE>TERMMODE</CODE> como se especifica en
<CODE>README.security</CODE>, o bien, ejecutando <CODE>make installnet</CODE>. 
Eventualmente, el fichero <CODE>termnet</CODE> creado contendr&aacute; instrucciones de
red espec&iacute;ficas, pero por ahora s&oacute;lo est&aacute; probada su existencia.</P>
<P>Si se a&ntilde;ade una <I>conexi&oacute;n ethernet</I>, puede simplemente quitar el
fichero <CODE>termnet</CODE> y ¡continuar usando los mismos binarios! </P>
<P>NOTA: Aquellos programas que fueron portados en los tiempos del <CODE>client.a</CODE>,
a&uacute;n pueden ser recompilados para usarlos con versiones nuevas de <CODE>term</CODE> 
cambiando simplemente la referencia a <CODE>client.a</CODE> por <CODE>libtermnet.a</CODE>.</P>


<H2><A NAME="ss10.2">10.2 <I>Termificar</I> (<CODE>termify</CODE>).</A></H2>


<P>Este paquete convertir&aacute; los binarios enlazados din&aacute;micamente para usar
<CODE>term</CODE>. </P>
<P>Antes de poder <I>termificar</I> deber&aacute; asegurarse de que tiene una
versi&oacute;n 2.2i (en esta versi&oacute;n 2.2.8?) de <CODE>term</CODE> o posterior y
<CODE>libc.so.4.5.26</CODE> o posterior.  Entonces hay que crear el fichero
<CODE>libt.so.4</CODE> en el directorio <CODE>/lib</CODE> (ver el fichero <CODE>README</CODE>
del paquete).</P>
<P>El problema en este momento es que hay que rehacer el fichero <CODE>libt.so.4</CODE> 
cada vez que renueve la versi&oacute;n de <CODE>term</CODE>.</P>
<P>Despu&eacute;s de crear la librer&iacute;a podr&aacute; dejar que <CODE>termify</CODE>
<I>``digiera''</I> al programa que se quiere hacer <I>term-compatible</I>,
usando el comando: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
termify &lt;programa&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si no le gusta el resultado puede <I>des-termificar</I> el programa que
acaba de termificar, usando el comando: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
termify -u &lt;programa&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Por fin, el paquete tambi&eacute;n contiene un <I>script</I> para <I>termificar</I>
completamente <CODE>smail</CODE>; de modo que no son necesarias definiciones
especiales de transporte. La &uacute;nica cosa que quiz&aacute; quiera cambiar es la
direcci&oacute;n del <CODE>From:</CODE>. </P>


<HR>
<A HREF="Term-Como-9.html">Anterior</A>
<A HREF="Term-Como-11.html">Siguiente</A>
<A HREF="Term-Como.html#toc10">Indice</A>
</BODY>
</HTML>
