<HTML>
<HEAD>
<TITLE>Dosemu COMO: Los Preliminares</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Dosemu-Como-2.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Los Preliminares</A></H2>



<H2><A NAME="ss1.1">1.1 ¿Qu&eacute; es dosemu?</A></H2>


<P>Siguiendo el manual, "dosemu es un programa a nivel de usuario que utiliza
algunas caracter&iacute;sticas especiales del kernel de Linux y del procesador
80386 para correr MS-DOS en lo que podr&iacute;a llamarse una ventana del DOS o
Dos <I>box</I>". </P>
<P>Dicha ventana, una  combinaci&oacute;n milagrosa de hardware y software, tiene
las siguientes capacidades: </P>
<P>
<UL>
<LI>La habilidad de virtualizar todas las entradas/salidas y las
instrucciones de control del procesador.
</LI>
<LI>La habilidad de soportar el tama&ntilde;o de palabra y los modos de
direccionamiento del "modo real" de la familia de procesadores iAPX86
mientras que se ejecute entre los l&iacute;mites del modo protegido.
</LI>
<LI>La habilidad de canalizar todas las llamadas al sistema del DOS y la
BIOS y emular dichas llamadas de forma que funcionen de la forma apropiada
y se obtenga un buen rendimiento. 
</LI>
<LI>La habilidad de simular un esquema <I>hardware</I> sobre el que las
aplicaciones del DOS est&aacute;n acostumbradas a tener control.
</LI>
<LI>La habilidad de proporcionar servicios propios del MS-DOS a trav&eacute;s
de los servicios nativos del Linux; por ejemplo, dosemu puede proporcionar
un disco duro virtual pertenececiendo &eacute;ste a la jerarqu&iacute;a de directorios
de Linux.
</LI>
</UL>
</P>


<H2><A NAME="ss1.2">1.2 ¿Cu&aacute;l es la &uacute;ltima versi&oacute;n de dosemu y d&oacute;nde puedo conseguirla?</A></H2>


<P>La versi&oacute;n m&aacute;s reciente de dosemu es <CODE>dosemu0.64</CODE> y puede
encontrarla (por <CODE>ftp</CODE>) en: </P>
<P><CODE>
<A HREF="ftp://tsx-11.mit.edu/pub/linux/ALPHA/dosemu/">ftp://tsx-11.mit.edu/pub/linux/ALPHA/dosemu/</A></CODE></P>
<P><CODE>
<A HREF="ftp://dspsun.eas.asu.edu/pub/dosemu/">ftp://dspsun.eas.asu.edu/pub/dosemu/</A></CODE></P>
<P>Sin embargo, las versiones reci&eacute;n salidas (<I>pre-release</I>) tambi&eacute;n est&aacute;n
disponibles para los desarrolladores y ALPHA testers.</P>
<P>Puede encontrar dichas versiones en:</P>
<P><CODE>
<A HREF="ftp://tsx-11.mit.edu/pub/linux/ALPHA/dosemu/Development">ftp://tsx-11.mit.edu/pub/linux/ALPHA/dosemu/Development</A></CODE></P>
<P><CODE>
<A HREF="ftp://dspsun.eas.asu.edu/pub/dosemu/Development">ftp://dspsun.eas.asu.edu/pub/dosemu/Development</A></CODE></P>
<P>teniendo nombres de la forma <CODE>pre0.61.*.tgz</CODE>. Estas versiones
tienen la ventaja de que son compatibles con las versiones m&aacute;s recientes
del kernel de Linux. Adem&aacute;s, incluyen nuevas caracter&iacute;sticas.  Recuerde
que es c&oacute;digo en fase ALPHA, de forma que puede tener <I>bugs</I> serios y
muy poca informaci&oacute;n sobre las nuevas caracter&iacute;sticas. </P>


<H2><A NAME="ss1.3">1.3 ¿D&oacute;nde puedo seguir el desarrollo?</A></H2>


<P>Si quiere seguir el desarrollo de dosemu, deber&iacute;a considerar
subscribirse a <CODE>linux-msdos-digest</CODE>. </P>
<P>Para ello, env&iacute;e un mensaje a <CODE>
<A HREF="mailto:majordomo@vger.rutgers.edu"> majordomo@vger.rutgers.edu</A></CODE> con el siguiente comando en el cuerpo
de su mensaje electr&oacute;nico: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
subscribe linux-msdos-digest su_nombre@su.direccion.electronica
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si alguna vez desea darse de baja de esta lista de correo, (<I>mailing
list</I>), env&iacute;e un mensaje a <CODE>
<A HREF="mailto:majordomo@vger.rutgers.edu">majordomo@vger.rutgers.edu</A></CODE> con el siguiente comando en el
cuerpo del mensaje: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
unsubscribe linux-msdos-digest su_nombre@su.direccion.electronica
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss1.4">1.4 ¿Qu&eacute; documentaci&oacute;n hay disponible para dosemu?</A></H2>


<P>El manual del dosemu (<CODE>dosemu.texinfo</CODE>) escrito por Robert Sanders
no ha sido actualizado durante alg&uacute;n tiempo, pero todav&iacute;a es una buena
fuente de informaci&oacute;n. Se distribuye con dosemu. </P>
<P>La "<I>Gu&iacute;a de principiantes de dosemu</I>" ("<I>Dosemu Novice's Altering
Guide</I>") tambi&eacute;n llamada <I>DANG</I> es el mapa de carreteras de los
entresijos de dosemu. </P>
<P>Est&aacute; dise&ntilde;ada para los aventureros, aquellos que desean modificar el
c&oacute;digo fuente por s&iacute; mismos. </P>
<P>La <I>DANG</I> es mantenida por Alistair MacDonald (<CODE>
<A HREF="mailto:am20@unix.york.ac.uk">am20@unix.york.ac.uk</A></CODE>)  y se
anuncia de vez en cuando en el canal MSDOS de los activistas de Linux
<I>Linux Activists</I>).</P>
<P>La lista de &eacute;xitos EMU (<CODE>EMUsuccess.txt</CODE>) es una lista de todos los
programas que se ha comprobado que funcionan bajo dosemu. </P>
<P>Se publica de vez en cuando en la lista de correo. La versi&oacute;n m&aacute;s reciente
puede encontrarse en <CODE>
<A HREF="ftp://dspsun.eas.asu.edu/pub/dosemu">ftp://dspsun.eas.asu.edu/pub/dosemu</A></CODE>. </P>
<P>Y tambi&eacute;n, por supuesto, est&aacute;n los <I>PUF</I>s y <I>COMO</I>s
<SL>En
cuanto a traducciones, ver la secci&oacute;n 
<A HREF="Dosemu-Como-13.html#Grupos">Grupos</A></SL>

de dosemu. Pero esto ya lo sabe, ¿no?. ;-) Tambi&eacute;n se anuncian de vez en
cuando en la lista de correo. La versi&oacute;n m&aacute;s reciente puede encontrarla
en <CODE>
<A HREF="ftp://dspsun.eas.asu.edu/pub/dosemu">ftp://dspsun.eas.asu.edu/pub/dosemu</A></CODE>.</P>


<H2><A NAME="ss1.5">1.5 ¿C&oacute;mo puedo incluir cambios o adiciones al HOWTO?</A></H2>

<P> </P>
<P>El m&eacute;todo mas usual es editar el fichero
<SL>Referido al <I>HOWTO</I>
original en ingl&eacute;s</SL>
, <CODE>dosemu-HOWTO-xx.x.sgml</CODE> para
incorporar los cambios, crear un fichero <CODE>diff</CODE> escribiendo algo como</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
diff archivo_original archivo_nuevo
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y enviarlo a <CODE>
<A HREF="mailto:deisher@dspsun.eas.asu.edu">deisher@dspsun.eas.asu.edu</A></CODE>.  Si no conoce SGML, es una buena
forma de hacerlo. Los cambios o nueva informaci&oacute;n de cualquier forma ser&aacute;n
aceptada. Creando el fichero <CODE>diff</CODE> lo hace m&aacute;s f&aacute;cil para para el
editor del HOWTO. :-) </P>


<H2><A NAME="ss1.6">1.6 Copyright</A></H2>

<P> </P>
<P><I>Unless
<SL>Nota del traductor: A continuaci&oacute;n expongo el texto sobre
el copyright en su versi&oacute;n original para respetar las condiciones que &eacute;ste
impone, su traducci&oacute;n se acompa&ntilde;a a continuaci&oacute;n.</SL>
 otherwise
stated, Linux HOWTO documents are copyrighted by their respective authors. 
Linux HOWTO documents may be reproduced and distributed in whole or in
part, in any medium physical or electronic, as long as this copyright
notice is retained on all copies. Commercial redistribution is allowed and
encouraged; however, the author would like to be notified of any such
distributions.</I></P>
<P><I>All translations, derivative works, or aggregate works incorporating any
Linux HOWTO documents must be covered under this copyright notice.  That
is, you may not produce a derivative work from a HOWTO and impose
additional restrictions on its distribution. Exceptions to these rules may
be granted under certain conditions; please contact the Linux HOWTO
coordinator at the address given below. </I></P>
<P><I>In short, we wish to promote dissemination of this information through as
many channels as possible. However, we do wish to retain copyright on the
HOWTO documents, and would like to be notified of any plans to
redistribute the HOWTOs. </I></P>
<P><I>If you have questions, please contact Greg Hankins, the Linux HOWTO
coordinator, at</I> <CODE>
<A HREF="mailto:gregh@cc.gatech.edu">gregh@cc.gatech.edu</A></CODE>. </P>
<P>A menos que se diga lo contrario, los COMO de Linux est&aacute;n bajo el
copyright de sus respectivos autores. Los COMO de Linux pueden ser
reproducidos y distribuidos en parte o de forma completa, en cualquier
medio f&iacute;sico o electr&oacute;nico, con tal de que la nota sobre el copyright se
mantenga en todas las copias. Las distribuciones comerciales est&aacute;n
permitidas y alentadas; sin embargo, al autor le agradar&iacute;a ser informado
sobre cualesquiera de tales distribuciones. </P>
<P>En todas las traducciones, trabajos derivados, o inclusiones de cualquier
COMO de Linux en otro trabajo, debe aparecer dicho aviso sobre el
copyright.</P>
<P>Eso significa, que <B>no</B> se puede crear un trabajo derivado de un COMO e
imponer restricciones adicionales sobre su distribuci&oacute;n y uso.  Se puede
otorgar excepciones a esta regla bajo ciertas condiciones; por favor,
contacte con el coordinador de los COMOs de Linux en la direcci&oacute;n dada m&aacute;s
adelante. </P>
<P>Resumiendo, nos gustar&iacute;a promover la difusi&oacute;n de esta informaci&oacute;n a trav&eacute;s
del mayor n&uacute;mero de canales posibles. Sin embargo, nos gustar&iacute;a mantener
el copyright en los documentos COMO, y ser&iacute;a de agradecer el ser
notificado de cualquier plan de distribuir los COMOs. </P>
<P>Si tiene preguntas, por favor contacte con Greg Hankins, el coordinador
de los COMOs de Linux, en <CODE>
<A HREF="mailto:gregh@cc.gatech.edu">gregh@cc.gatech.edu</A></CODE>.</P>


<HR>
Anterior
<A HREF="Dosemu-Como-2.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc1">Indice</A>
</BODY>
</HTML>
