<HTML>
<HEAD>
<TITLE>Dosemu COMO: V&iacute;deo y sonido</TITLE>
</HEAD>
<BODY>
<A HREF="Dosemu-Como-8.html">Anterior</A>
<A HREF="Dosemu-Como-10.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc9">Indice</A>
<HR>
<H2><A NAME="s9">9. V&iacute;deo y sonido</A></H2>



<H2><A NAME="ss9.1">9.1 ¿Puedo ejecutar videojuegos de 32-bit bajo dosemu?</A></H2>


<P>Mark Rejhon (<CODE>
<A HREF="mailto:mdrejhon@magi.com">mdrejhon@magi.com</A></CODE>) comentaba (4/8/95) lo siguiente</P>
<P>Con las recientes mejoras sobre el DPMI introducidas en la versi&oacute;n 0.60,
ya se puede ejecutar algunos videojuegos de 32-bit bajo dosemu. Si el
juego se puede ejecutar en una ventana de DOS en <I>OS/2</I>, hay muchas
posibilidades de que funcione bajo dosemu. (Algunos ejemplos de juegos de
32-bit que se ha comprobado que funcionan en la &uacute;ltima versi&oacute;n de dosemu
son <I>Descent</I>, <I>Dark Forces</I>, <I>Mortal Kombat II</I> y <I>Rise of
The Triad</I>.)</P>
<P>Antes de que intente ejecutar un videojuego, deber&aacute; tener configurado el
teclado en modo <I>raw</I> y haber activado los modos gr&aacute;ficos de la VGA, en
el archivo <CODE>/etc/dosemu.conf</CODE>. Si ha podido ejecutar programas
gr&aacute;ficos bajo dosemu y &eacute;stos han funcionado bien, y quiere arriesgarse a
que posiblemente se cuelgue el sistema (debido a que est&aacute; dejando que
dosemu se ejecute con los permisos de <CODE>root</CODE> a la hora de acceder a la
tarjeta de v&iacute;deo, y por ello a dejar a la tarjeta de v&iacute;deo en un estado en
el cual es dif&iacute;cil luego de recuperar) entonces puede seguir adelante y
tratar de ejecutarlo. </P>
<P>D&eacute;se cuenta, sin embargo, de que tendr&aacute; que desactivar el sonido del
juego. (Alguien tendr&aacute; que trabajar en la emulaci&oacute;n de las tarjetas de
sonido para que podamos evitar esto). Tambi&eacute;n debe comprender que el
juego ir&aacute; un poco m&aacute;s lento, debido a la multitarea de Linux. De forma que
el juego deber&iacute;a ejecutarse entre un 5 y 100 por ciento de su velocidad.
Normalmente, la velocidad est&aacute; en un 50 por ciento en la versi&oacute;n actual
del dosemu y se espera que se vaya mejorando dentro de poco.</P>
<P>Quien sabe, a lo mejor igual funciona. ¡Por favor env&iacute;e un mensaje
(e-mail)  al encargado del <CODE>EMUsuccess.txt</CODE> si el juego funciona
correctamente!</P>


<H2><A NAME="ss9.2">9.2 Al salir de dosemu se me llena la pantalla de basura. </A></H2>

<P> </P>
<P>(4/8/95)</P>
<P>El problema est&aacute; en que la informaci&oacute;n de la fuente para la pantalla de
texto de la VGA no se ha grabado. Consiga una copia del paquete
<CODE>svgalib</CODE>. Actualmente puede encontrarlo en:</P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/libs/graphics/svgalib125.tar.gz">ftp://sunsite.unc.edu/pub/Linux/libs/graphics/svgalib125.tar.gz</A></CODE></P>
<P>Tambi&eacute;n deber&iacute;a estar disponible en forma de paquete pre-compilado en su
distribuci&oacute;n de Linux favorita ( ej., Slackware, etc.). Utilice
<CODE>savetextmode</CODE> para grabar el modo texto y la fuente actual en un
fichero en <CODE>/tmp</CODE> antes de ejecutar dosemu. Luego, al salir de
dosemu, escriba <CODE>textmode</CODE> para restaurar el modo de v&iacute;deo grabado.</P>


<H2><A NAME="ss9.3">9.3 ¿C&oacute;mo puedo hacer que funcione correctamente mi tarjeta de v&iacute;deo</A>Trident/Actix/otra? </H2>


<P>La pantalla fluct&uacute;a violentamente, muestra el mensaje de inicio de la BIOS
de v&iacute;deo y se cuelga. </P>
<P>Andrew Tridgell (<CODE>
<A HREF="mailto:tridge@nimbus.anu.edu.au">tridge@nimbus.anu.edu.au</A></CODE>) comentaba (1/29/94) lo siguiente:</P>
<P>He conseguido que me funcione con versiones antiguas utilizando:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
   ports { 0x42 }
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>a pesar de ello algunas veces mi m&aacute;quina se colgaba cuando merodeaba la
BIOS de v&iacute;deo en dosemu. Esto es debido a que est&aacute; permitiendo a la BIOS
de la VGA a que reprograme su reloj, lo cual no sienta nada bien al Linux. </P>
<P>Esto me sugiri&oacute; el escribir los parches de enmascaramiento de s&oacute;lo lectura
para dosemu, que puede encontrar todav&iacute;a en la &uacute;ltima versi&oacute;n. Ahora
utilizo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
   ports { readonly 0x42 }
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>de esta forma se ejecutar&aacute; dosemu m&aacute;s lentamente, pero con mayor
seguridad.</P>
<P>Tim Shnaider (<CODE>
<A HREF="mailto:tims@kcbbs.gen.nz">tims@kcbbs.gen.nz</A></CODE>) tambi&eacute;n comentaba (1/18/94) que:</P>
<P>Una forma de arreglar esto es utilizar el programa <CODE>GETROM</CODE> para volcar
su BIOS de V&Iacute;DEO a un archivo y editar luego el archivo de configuraci&oacute;n
en el directorio <CODE>/etc/dosemu</CODE>. Aqu&iacute; est&aacute; mi l&iacute;nea sobre el v&iacute;deo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
   video { vga console graphics chipset trident memsize 1024 vbios_file /etc/dosemu/vbios }
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>donde <CODE>vbios</CODE> es el archivo generado al teclear:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
   getrom &gt; vbios
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Douglas Gleichman (<CODE>
<A HREF="mailto:p86884@tcville.edsg.hac.com">p86884@tcville.edsg.hac.com</A></CODE>)  comentaba (9/1/94) 
(respecto a la ATI Graphics Ultra): </P>
<P>Para la versi&oacute;n 0.52 de dosemu necesita a&ntilde;adir la siguiente l&iacute;nea a su
archivo <CODE>dosemu.conf</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 ports  { 0x1ce 0x1cf 0x238 0x23b 0x23c 0x23f 0x9ae8 0x9ae9 0x9aee 0x9aef }
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La misma placa mostrar&aacute; un error pero podr&aacute;n trabajar bien los programas
que utilicen gr&aacute;ficos. </P>


<H2><A NAME="ss9.4">9.4 ¿Por qu&eacute; no funciona el software de mi tarjeta de sonido con dosemu?</A></H2>


<P>Hannu Savolainen (<CODE>
<A HREF="mailto:hsavolai@cs.Helsinki.FI">hsavolai@cs.Helsinki.FI</A></CODE>) escrib&iacute;a (3/21/94) lo siguiente:</P>
<P>Dosemu y cualquier programa de DOS se ejecutan bajo el control de un
sistema operativo que funciona en modo protegido. Esto quiere decir que la
memoria no se mapea como espera el programa. Si de alguna manera el
programa comienza a utilizar el DMA para grabar sonido con la
SoundBlaster, el sonido grabado no encontrar&aacute; forma de llegar a la
aplicaci&oacute;n. &Uacute;nicamente destruir&aacute; algunos datos en la memoria. </P>
<P>James B. MacLean (<CODE>
<A HREF="mailto:jmaclean@fox.nstn.ns.ca">jmaclean@fox.nstn.ns.ca</A></CODE>) comentaba (6/19/94):</P>
<P>Perdone que discrepe, pero actualmente dosemu no tiene soporte para
interceptar las interrupciones necesarias ni el DMA, siendo esto preciso
para acceder a las tarjetas de sonido mediante dosemu <CODE>:-(</CODE>.</P>
<P>Aunque se dar&aacute; soporte en el futuro :-),  </P>


<HR>
<A HREF="Dosemu-Como-8.html">Anterior</A>
<A HREF="Dosemu-Como-10.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc9">Indice</A>
</BODY>
</HTML>
