<HTML>
<HEAD>
<TITLE>Dosemu COMO: Otro Hardware</TITLE>
</HEAD>
<BODY>
<A HREF="Dosemu-Como-9.html">Anterior</A>
<A HREF="Dosemu-Como-11.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc10">Indice</A>
<HR>
<H2><A NAME="s10">10. Otro Hardware</A></H2>



<H2><A NAME="ss10.1">10.1 ¿C&oacute;mo puedo hacer que trabaje mi dispositivo xxxxx bajo dosemu?</A></H2>


<P>Corey Sweeney (<CODE>
<A HREF="mailto:corey@bbs.xnet.com">corey@bbs.xnet.com</A></CODE>) comentaba (5/30/94) lo siguiente:</P>
<P>Aqu&iacute; tiene un registro de mis aventuras tratando de que los dispositivos
trabajen bajo dosemu. Sin ir m&aacute;s lejos he conseguido que funcionen mi  
sistema de correo de voz y mi scanner (a medias). Aqu&iacute; est&aacute; c&oacute;mo lo he 
hecho:  </P>
<P>
<OL>
<LI>Mire en su manual si la placa utiliza alg&uacute;n puerto.  Si el manual le
indica algunos, p&oacute;ngalos en el archivo de configuraci&oacute;n, en la l&iacute;nea
"<CODE>ports</CODE>". Recuerde que algunas veces necesitar&aacute; tener bastantes
puertos en una fila, y el primero debe ser el &uacute;nico documentado.
</LI>
<LI>Int&eacute;ntelo. Si no funciona, o bien no tiene un manual (o contiene
tan poca informaci&oacute;n como mi manual de la AT&amp;T :) entonces ejecute
dosemu con:

<BLOCKQUOTE><CODE>
<PRE>
dos -D+i 2&gt; /tmp/io.debug
</PRE>
</CODE></BLOCKQUOTE>


Ejecute el software del dispositivo, y salga de dosemu. &Eacute;chele un vistazo
a <CODE>/tmp/io.debug</CODE> y busque algunos n&uacute;meros de puertos que deber&iacute;a
haber. Pruebe a a&ntilde;adir &eacute;stos a las l&iacute;neas de puertos e intente cargar
dosemu de nuevo. 
</LI>
<LI>Si todav&iacute;a produce errores entonces ser&aacute; que necesita
interrupciones. Busque la interrupci&oacute;n que utilice la tarjeta y h&aacute;gase con
el archivo <CODE>SIG.tgz</CODE> (<I>Silly Interrupt Generator</I>) de alg&uacute;n lugar de
<CODE>
<A HREF="ftp://tsx-11.mit.edu">ftp://tsx-11.mit.edu</A></CODE>. 
Inst&aacute;lelo como se indica en las instrucciones. </LI>
</OL>
</P>
<P>y eso es todo lo que hay...</P>
<P>Pregunta: <I>¿Qu&eacute; ocurre si mi tarjeta usa DMA?</I> Respuesta: 
<I>La hemos fastidiado</I>.</P>


<HR>
<A HREF="Dosemu-Como-9.html">Anterior</A>
<A HREF="Dosemu-Como-11.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc10">Indice</A>
</BODY>
</HTML>
