<HTML>
<HEAD>
<TITLE>Dosemu COMO: Problemas y soluciones</TITLE>
</HEAD>
<BODY>
<A HREF="Dosemu-Como-10.html">Anterior</A>
<A HREF="Dosemu-Como-12.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc11">Indice</A>
<HR>
<H2><A NAME="s11">11. Problemas y soluciones</A></H2>



<H2><A NAME="ss11.1">11.1 Dosemu se ha ca&iacute;do y ahora no puedo escribir nada.</A></H2>


<P>Daniel Barlow(<CODE>
<A HREF="mailto:jo95004@sable.ox.ac.uk">jo95004@sable.ox.ac.uk</A></CODE>) comentaba (4/8/95) lo siguiente:</P>
<P>Si no tiene acceso a trav&eacute;s de un terminal o de una red por el que pueda
entrar, no le queda m&aacute;s remedio que pulsar el bot&oacute;n de reset. Si todav&iacute;a
puede utilizar alguna shell por alguna parte, ejecute "<CODE>kbd_mode -a</CODE>"
para quitar el modo <I>raw</I> del teclado, y/o "<CODE>stty sane</CODE>" en la
consola para que pueda ver lo que est&eacute; tecleando.</P>
<P>Algo que resulta &uacute;til es el hacer un script para ejecutar dosemu, que
ejecute autom&aacute;ticamente "<CODE>kbd_mode -a</CODE>" al terminar &eacute;ste. Cuando dosemu
caiga, el script normalmente seguir&aacute; corriendo, y ejecutar&aacute; el comando
"<CODE>kbd_mode -a</CODE>". </P>


<H2><A NAME="ss11.2">11.2 He activado la memoria EMS en el <CODE>dosemu.conf</CODE> pero no</A>ayuda. </H2>


<P>Rob Janssen (<CODE>
<A HREF="mailto:rob@pe1chl.ampr.org">pe1chl.ampr.org</A></CODE>) comentaba (7/11/94): </P>
<P>No olvide cargar el <CODE>ems.sys</CODE> que se proporciona, en el archivo
<CODE>config.sys</CODE>. </P>


<H2><A NAME="ss11.3">11.3 ¿C&oacute;mo me deshago de todos esos molestos mensajes de "<CODE>disk</A>change</CODE>"?</H2>


<P>(8/11/94)</P>
<P>Consiga e instale <CODE>klogd</CODE>.  Pruebe en</P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/Daemons/sysklogd1.2.tgz">ftp://sunsite.unc.edu/pub/Linux/system/Daemons/sysklogd1.2.tgz</A></CODE></P>


<H2><A NAME="ss11.4">11.4 Por qu&eacute; no se puede volver a ejecutar dosemu tras salir de modo</A>consola?</H2>


<P>Aldy Hern&aacute;ndez (<CODE>
<A HREF="mailto:aldy@sauron.cc.andrews.edu">aldy@sauron.cc.andrews.edu</A></CODE>)  comentaba (7/8/94) lo siguiente:</P>
<P>Debe deshabilitar la cach&eacute; de v&iacute;deo y/o de la BIOS.</P>


<H2><A NAME="ss11.5">11.5 Por qu&eacute; se puede ejecutar dosemu en un <CODE>xterm</CODE> pero no en la</A>consola?</H2>


<P>JyiJiin Luo (<CODE>
<A HREF="mailto:jjluo@casbah.acns.nwu.edu">jluo@casbah.acns.nwu.edu</A></CODE>) comentaba (4/19/94):</P>
<P>Yo he pasado por el mismo problema anteriormente. Lo he resuelto
desactivando la <I>shadow</I> del v&iacute;deo en mi BIOS AMI. Ahora dosemu se
ejecuta bien en mi sistema.</P>


<H2><A NAME="ss11.6">11.6 ¿C&oacute;mo puedo hacer que dosemu se ejecute m&aacute;s r&aacute;pido?</A></H2>


<P>En algunos casos resulta &uacute;til el jugar con los valores de la variable
<CODE>HogThreshold</CODE> en el archivo <CODE>dosemu.conf</CODE>. </P>
<P>Daniel Barlow(<CODE>
<A HREF="mailto:jo95004@sable.ox.ac.uk">jo95004@sable.ox.ac.uk</A></CODE>) comentaba (4/8/95) lo siguiente:</P>
<P>La variable <CODE>HogThreshold</CODE> debe valer aproximadamente la mitad de
los <CODE>BogoMips</CODE> que el sistema muestre al arrancar. </P>


<H2><A NAME="ss11.7">11.7 Mi unidad de CDROM tiene problemas a la hora de leer algunos archivos</A>bajo dosemu.</H2>


<P>Vinod G Kulkarni (<CODE>
<A HREF="mailto:vinod@cse.iitb.ernet.in">vinod@cse.iitb.ernet.in</A></CODE>) comentaba (4/7/94):</P>
<P>Cuando se monta el CDROM desde Linux y se utiliza dentro de dosemu (unidad
mapeada), puede dar algunos problemas. El controlador del CD-ROM (iso9660)
que est&aacute; en el kernel trata de encontrar el tipo del fichero (ej., binario
o texto). Si no puede encontrarlo, intenta adivinar el tipo del archivo a
trav&eacute;s de m&eacute;todos heur&iacute;sticos. Este m&eacute;todo falla bajo ciertas
circustancias como cuando un archivo de texto (que parece binario) se
trata como binario. (No s&eacute; si esto es un error o una car&aacute;cter&iacute;stica de
Linux).</P>
<P>El resultado de todo esto est&aacute; en que si copia tal archivo desde el CD-ROM
(desde el mismo Linux, y no necesariamente desde dosemu), el archivo
resultante ser&aacute; mayor que el original. (Se han a&ntilde;adido espacios en blanco
antes de <CODE>^J</CODE>,<CODE>^M</CODE>). De forma que un programa que se est&eacute; ejecutando
bajo dosemu da un error o se cuelga, lo que se confunde con un error de
dosemu. </P>
<P>Rob Janssen (<CODE>
<A HREF="mailto:pe1chl@rabo.nl">pe1chl@rabo.nl</A></CODE>) comenta (8/10/94): </P>
<P>La forma de resolverlo es desactivando totalmente la conversi&oacute;n. 
Introduzca la opci&oacute;n "<CODE>-o conv=binary</CODE>" al comando <CODE>mount</CODE>
cuando monte el CD-ROM, o inserte lo siguiente en el <CODE>/etc/fstab</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/dev/cdrom      /cdrom          iso9660 conv=binary,ro
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>No se necesita parchear el kernel.</P>


<H2><A NAME="ss11.8">11.8 ¿C&oacute;mo puedo ver los datos de salida de la depuraci&oacute;n</A>(<I>debugger</I>)? </H2>


<P>Daniel Barlow(<CODE>
<A HREF="mailto:jo95004@sable.ox.ac.uk">jo95004@sable.ox.ac.uk</A></CODE>) comentaba (4/8/95) lo siguiente:</P>
<P>En el caso de la versi&oacute;n 0.60 de dosemu, los datos de salida del debugger
se redireccionan a un archivo especificado en la l&iacute;nea de comandos.</P>
<P>Utilice "<CODE>dos -D+a -o /tmp/debug</CODE>" para volcar los datos de salida
del <I>debugger</I> al archivo <CODE>/tmp/debug</CODE>. No deber&iacute;a existir
ninguna necesidad de redireccionar <CODE>stderr</CODE>.</P>


<H2><A NAME="ss11.9">11.9 ¿Por qu&eacute; aparecen duupliicaadoos mis pulsaciones de teclado?</A></H2>


<P>Nick Holloway (<CODE>
<A HREF="mailto:alfie@dcs.warwick.ac.uk">alfie@dcs.warwick.ac.uk</A></CODE>) comentaba (2/22/94) lo siguiente:</P>
<P>Tras haber ejecutado dosemu despu&eacute;s de haber toqueteado algunos valores
del <CODE>stty</CODE>, se me duplicaban los caracteres al escribir. ¡Ahora ya he
descubierto cu&aacute;l es la raz&oacute;n!</P>
<P>S&oacute;lo sucede cuando dosemu se est&aacute; ejecutando en la consola con
'<CODE>istrip</CODE>' establecido. Esto es as&iacute; (creo) porque los c&oacute;digos en bruto
generados por las pulsaciones de teclado son mutilados por <CODE>istrip</CODE>, de
modo que los eventos de liberaci&oacute;n de una tecla parecen realmente eventos
de pulsaci&oacute;n. </P>
<P>Por tanto, es preciso desactivar el procesamiento de entrada cuando se
usen c&oacute;digos de pulsaci&oacute;n en modo consola (No debe ser muy buena idea
hacerlo en l&iacute;neas <CODE>tty</CODE>). </P>


<HR>
<A HREF="Dosemu-Como-10.html">Anterior</A>
<A HREF="Dosemu-Como-12.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc11">Indice</A>
</BODY>
</HTML>
