<HTML>
<HEAD>
<TITLE>RDSI COMO : Colof&oacute;n</TITLE>
</HEAD>
<BODY>
<A HREF="RDSI-Como-10.html">Anterior</A>
<A HREF="RDSI-Como-12.html">Siguiente</A>
<A HREF="RDSI-Como.html#toc11">Indice</A>
<HR>
<H2><A NAME="s11">11. Colof&oacute;n</A></H2>


<P>Y bueno, por ahora esto es todo. Como una primera versi&oacute;n que es, estar&aacute;
plagada de peque&ntilde;os (igual otros no tan peque&ntilde;os) fallos, incorrecciones y
seguro que nos dejamos un mont&oacute;n de temas en el tintero. </P>
<P>Eso s&iacute;, como hemos mencionado varias veces, nuestro buz&oacute;n de correo est&aacute;
abierto a todo tipo de sugerencias, correcciones, dudas (que si
humildemente podemos, intentaremos responder), as&iacute; como desinteresadas
donaciones para adquirir otras tarjetas... <CODE>};)</CODE> Lo que se os ocurra. 
En cualquier caso, prometemos contestar.</P>

<H2><A NAME="ss11.1">11.1 ¿Y no ten&eacute;is nada que agradecer a nadie?</A></H2>


<P>Ufff... Al contrario. No acabar&iacute;amos nunca. Pero vamos a intentarlo; 
adem&aacute;s, es la parte m&aacute;s relajada de todo esto.</P>

<H3>De Antonio Verdejo</H3>


<P>Mi lista es interminable (tengo tanto que agradecer a tanta gente, y esta es
<I>la m&iacute;a</I> ;-), pero intentar&eacute; ser breve.</P>
<P>Para empezar, a Francisco Jos&eacute; Montilla, mi <I>apa&ntilde;ero</I>, porque fue quien
me introdujo en esto de la RDSI y el Linux, gracias por tus "SOfritos", y
por la paciencia que tienes conmigo y el Quake. Recuerdos a quien ya
sabes.  Gracias por todo, de verdad. ¡Ah!</P>
<P>y vigila tu espalda, un d&iacute;a aparecer&eacute; por <I>DM4</I> con un bazoca y... ;-)) </P>
<P>A toda la gente del Lucas, Insflug e HispaLinux. Inmejorable trabajo el
vuestro. A la gente de Enred (saludos <I>ZoR</I>) por organizar lo
<I>inorganizable</I> y darle forma de Party.</P>
<P>A Jes&uacute;s Fuentes Saavedra, por sus consejos. A Enrique Melero por id&eacute;ntica
raz&oacute;n. A I&ntilde;aki Arenaza por estar trabajando tambi&eacute;n en el tema RDSI. A
Miguel Armas del Rio, por mantener la (creo) mejor lista de Linux en
castellano.  A todos los contertulios de dicha lista por sus sugerencias y
&aacute;nimo, ¡seguid as&iacute;!</P>
<P>A Alvaro Villalva (aka <I>unsCAred</I>) por que siempre est&aacute; ah&iacute; con su
compilador preparado
<SL>FJM <BR> Y su bazoka...</SL>
 y su
buscador a punto... ;-)</P>
<P>A toda (TODA) la pe&ntilde;a del canal linux del IRC Hispano (la lista no tendr&iacute;a
fin, prometo -prometemos- citaros a todos en una pr&oacute;xima revisi&oacute;n de este
documento, aunque sea en un anexo exclusivo ;-) por ser como son, por ser
como sois, ¡maj&iacute;simos!... y a las <I>linuxeras</I>, por tener ese par de...
<CODE>O:-)</CODE> </P>
<P>A mi hermano David, y en general a toda mi familia, por su apoyo. Gracias
especiales a Isa, Regi y Basi por cuidarme tan bien (¡qu&eacute; har&iacute;a yo sin
vosotras!). </P>
<P>A mis amigos, mis mejores amigos (Jero, Javi, Alberto) porque siempre se
puede contar con ellos, y porque comprenden que a veces pase m&aacute;s tiempo
con Linux que con ellos... </P>
<P>A mis amigas, mis mejores amigas. A Bego&ntilde;a, por todo. A Ana Roc&iacute;o, en la
distancia, porque s&iacute;. </P>
<P>A N. S. (``no s&eacute;'') por su mirada. Siempre. A Alberto (aka <I>Case</I>) por
sus cumplea&ntilde;os.</P>
<P>A Marc, por la tarjeta que dio el empuj&oacute;n definitivo a este Como. Y a la
gente, que, junto a &eacute;l (``1 para to2 y to2 para 1''), me hacen pensar
<I>diferente</I>...  Are U dudez? </P>
<P>A ``el gremio del cuervo'' por su m&uacute;sica (<I>cojonuda</I>) por su directo
(<I>destroyer</I>) y por darme una idea de lo larga que puede ser (y no
cortarme ante ello) una lista de agradecimientos... ;-) Y a Pepe, por
supuesto, por descubrirme este <I>pedaso</I> grupo. <I>Hello man, I am the
Sun...</I></P>
<P>A tod@s l@s que me dejo (y de l@s que sin duda tendr&eacute; noticias).</P>
<P>Y en general, a toda la gente que hace que, cada d&iacute;a que me levanto, no
piense como S&eacute;neca, que dec&iacute;a <I>Ma&ntilde;ana ser&aacute; peor...</I> ;-) </P>
<P>¡Gracias!</P>

<H3>De Francisco J. Montilla</H3>


<P>A mi <I>apa&ntilde;ero</I> Toni, por compartir esas madrugadas linuxeras, por
tenerme al d&iacute;a de lo que pasa en el mundo Linux, y por dejarme masacrarle
al Quake tan generosamente <CODE>:P</CODE>. </P>
<P>Y por dejarme sin nadie a quien agradecer. Abusooon!!!!!</P>
<P>A mi mujer, por aguantar estoicamente mis trasnochadas Linuxeras, mi
apegamiento <I>ordenadoril</I>, y animarme todav&iacute;a a darle duro a esto.</P>


<HR>
<A HREF="RDSI-Como-10.html">Anterior</A>
<A HREF="RDSI-Como-12.html">Siguiente</A>
<A HREF="RDSI-Como.html#toc11">Indice</A>
</BODY>
</HTML>
