<HTML>
<HEAD>
<TITLE>RDSI COMO : Integraci&oacute;n f&iacute;sica</TITLE>
</HEAD>
<BODY>
<A HREF="RDSI-Como-2.html">Anterior</A>
<A HREF="RDSI-Como-4.html">Siguiente</A>
<A HREF="RDSI-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Integraci&oacute;n f&iacute;sica</A></H2>


<P>Aparte de las precauciones con la est&aacute;tica, (ag&aacute;rrese antes a alg&uacute;n objeto
con bastante masa y conexi&oacute;n a tierra, como una tuber&iacute;a o radiador, para
descargarla) es conveniente familiarizarnos con el dispositivo, anotar
cuando proceda qu&eacute; chipset tiene, si tiene o no <I>jumpers</I>, si es as&iacute;
para qu&eacute; valen, etc.</P>
<P>Aseg&uacute;rese de que la tarjeta queda firmemente asentada, m&aacute;s de un problema
<I>inexplicable</I> se ha debido muchas veces a esto.</P>
<P>En algunas placas base, especialmente las de 486, no da completamente
igual d&oacute;nde se pincha la tarjeta. Familiar&iacute;cese con su Placa Base. </P>
<P>Los dispositivos RDSI suelen conectarse mediante cables de pares
pin-a-pin, si bien no es estrictamente necesario que el cable sea de
pares. El conector suele ser un RJ-45, id&eacute;ntico a los usados para redes. 
Normalmente la tarjeta traer&aacute; un cable, pero si no es as&iacute;, o lo necesita
m&aacute;s largo, con un cable de red UTP corriente valdr&aacute;. Te&oacute;ricamente, y en
configuraciones del bus pasivo (instalaci&oacute;n telef&oacute;nica propiamente dicha) 
t&iacute;picas, el cable puede ser de unos centenares de metros, si bien no hemos
comprobado nunca de forma pr&aacute;ctica este particular. </P>
<P>Una &uacute;ltima advertencia, para aquellos que est&aacute;n leyendo esto para instalar
en una empresa: los dispositivos RDSI suelen llevarse <B>muy mal</B> con
las centralitas, especialmente con las Siemens. </P>
<P>Si quiere ahorrarse quebraderos de cabeza, malos funcionamientos,
interminables actualizaciones del firmware de la centralita, y en la
mayor&iacute;a de los casos, para que simplemente funcione, exija que el bus
pasivo RDSI para la tarjeta sea <B>dedicado</B> y <B>directo</B>. Se ahorrar&aacute;
infinidad de problemas, y el funcionamiento ser&aacute; el que un entorno de
producci&oacute;n exige.</P>

<HR>
<A HREF="RDSI-Como-2.html">Anterior</A>
<A HREF="RDSI-Como-4.html">Siguiente</A>
<A HREF="RDSI-Como.html#toc3">Indice</A>
</BODY>
</HTML>
