<HTML>
<HEAD>
<TITLE>RDSI COMO : Problemas Frecuentes</TITLE>
</HEAD>
<BODY>
<A HREF="RDSI-Como-7.html">Anterior</A>
<A HREF="RDSI-Como-9.html">Siguiente</A>
<A HREF="RDSI-Como.html#toc8">Indice</A>
<HR>
<H2><A NAME="s8">8. Problemas Frecuentes</A></H2>




<H2><A NAME="ss8.1">8.1 Al lanzar la conexi&oacute;n miro el <CODE>/var/log/messages</CODE> y s&oacute;lo veo</A>(una vez tras otra): </H2>


<P>
<BLOCKQUOTE><CODE>
<PRE>
Apr 15 10:34:08 wanda kernel: ippp0: dialing 0 055...
Apr 15 10:34:08 wanda kernel: ippp0: dialing 1 055...
Apr 15 10:34:08 wanda kernel: ippp0: dialing 2 055...
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>pero no veo nada m&aacute;s, ¿a qu&eacute; puede ser debido? </P>
<P>Es un problema f&iacute;sico. Revise la conexi&oacute;n del cable tanto en la tarjeta
como en el TR1. Revise la continuidad del cable as&iacute; mismo. C&aacute;mbielo en
&uacute;ltimo t&eacute;rmino. Aseg&uacute;rese de que su TR1 tiene servicio... <CODE>;-)</CODE> y
Aseg&uacute;rese de no estar pasando por ninguna centralita. </P>


<H2><A NAME="ss8.2">8.2 La conexi&oacute;n se corta tras un mensaje como:</A></H2>


<P>
<BLOCKQUOTE><CODE>
<PRE>
Apr 15 15:58:28 wanda pppd[208]: Could not determine remote IP address
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y seguidamente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Apr 15 15:58:28 wanda pppd[208]: LCP terminated at peer's request
Apr 15 15:58:28 wanda kernel: isdn_net: local hangup ippp0
Apr 15 15:58:28 wanda kernel: ippp0: Chargesum is 0
Apr 15 15:58:28 wanda pppd[208]: Modem hangup
Apr 15 15:58:28 wanda pppd[208]: Connection terminated.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Es un problema bastante com&uacute;n debido a que Infov&iacute;a (en el supuesto de que
la use para conectar) no nos asigna, ---o no lo hace con suficiente
rapidez--- una direcci&oacute;n remota del enlace PPP.  Hay un <I>soluci&oacute;n</I> que
funciona tanto en conexiones RDSI como RTC que consiste en pasarle
nosotros una direcci&oacute;n en el establecimiento de la conexi&oacute;n. En el caso de
conexiones v&iacute;a RTC (m&oacute;dem corriente y moliente)  incluya una l&iacute;nea en el
<CODE>/etc/ppp/options</CODE> tal que: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
:172.16.1.96
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y deje el par&aacute;metro que le indica que, a pesar de todo, aceptaremos la IP
que el extremo nos asigne como remota (<CODE>ipcp-accept-remote</CODE>). La IP que
pongamos puede ser cualquiera, pero como siempre, y por seguir una regla,
ponga una de las que normalmente nos asigna Infov&iacute;a de su rango
(<CODE>172.16.x.x</CODE> por ejemplo). </P>
<P>Gracias a Horacio J. Pe&ntilde;a por este detalle (el primero al que se lo leimos
en la lista del SLUG). </P>
<P>El caso de conexiones v&iacute;a RDSI (sobre todo en el caso de que usemos el
primer m&eacute;todo) se puede proceder de la misma forma, pues aunque se le
pasen par&aacute;metros al (i)pppd, el demonio leer&aacute; el fichero
<CODE>/etc/ppp/options</CODE>.</P>


<H2><A NAME="ss8.3">8.3 Al inicializar el demonio ipppd obtengo el mensaje ``<CODE>Can't find</A>usable ippp device''</CODE>. ¿A qu&eacute; es debido?</H2>


<P>Seg&uacute;n Frank Meyer, del grupo de desarrollo <I>isdn4linux</I>, se debe a que
al lanzar el <CODE>ipppd</CODE>, este calcula un n&uacute;mero aleatorio bas&aacute;ndose en la
funci&oacute;n <CODE>gethostid()</CODE> que provoca una resoluci&oacute;n DNS, usando para ello
el servidor de nombres que aparezca en <CODE>/etc/resolv.conf</CODE>.</P>
<P>Si no tenemos la conexi&oacute;n activa, esto l&oacute;gicamente no es posible y el DNS
no puede ser alcanzado (y hablamos en el caso general de que no se
disponga de un DNS local, como suele suceder com&uacute;nmente). </P>
<P>Para solucionarlo, incluya el nombre de su m&aacute;quina (incluido
<CODE>localhost</CODE>)  en el <CODE>/etc/hosts</CODE> con el dominio completo que
haya especificado en <CODE>/etc/resolv.conf</CODE>. Hay otra soluci&oacute;n basada
en un parche no oficial para evitar este comportamiento por parte del
<CODE>ipppd</CODE>; el fichero <CODE>syncPPP FAQ</CODE> inclu&iacute;do en el directorio de
documentaci&oacute;n de las utilidades ISDN ampl&iacute;a este tema. </P>


<HR>
<A HREF="RDSI-Como-7.html">Anterior</A>
<A HREF="RDSI-Como-9.html">Siguiente</A>
<A HREF="RDSI-Como.html#toc8">Indice</A>
</BODY>
</HTML>
