<HTML>
<HEAD>
<TITLE>RDSI COMO : Hardware Soportado - Recomendado </TITLE>
</HEAD>
<BODY>
<A HREF="RDSI-Como-1.html">Anterior</A>
<A HREF="RDSI-Como-3.html">Siguiente</A>
<A HREF="RDSI-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="hard"></A> <A NAME="s2">2. Hardware Soportado - Recomendado </A></H2>


<P>Pese a que las conexiones RDSI se pueden llevar a cabo tanto mediante
adaptadores externos como tarjetas pasivas internas, en este documento nos
centraremos en (y recomendamos) las tarjetas pasivas, por considerarlas
una opci&oacute;n mejor respecto a adaptadores externos RDSI, ya que: </P>
<P>
<OL>
<LI>Su coste es generalmente 5 o 6 veces menor.</LI>
<LI>La diferencia de rendimiento es inexistente.
</LI>
<LI>Es independiente de los puertos serie, no afectando al rendimiento o
incluso viabilidad, el tipo de <I>UART</I> que se tenga (esto es muy
importante si pensamos montar una pasarela a Internet con ese <I>viejo</I>
486 que rueda por la oficina).
</LI>
<LI>El software y los drivers para las tarjetas pasivas internas
permiten hacer aut&eacute;nticas <I>virguer&iacute;as</I>, con una perfecta integraci&oacute;n, a
diferencia de los m&oacute;dems RDSI. 
</LI>
</OL>
</P>

<H2><A NAME="soportadas"></A> <A NAME="ss2.1">2.1 Modelos de tarjetas pasivas </A></H2>


<P>La gran mayor&iacute;a de los modelos que se listan a continuaci&oacute;n son tarjetas
internas pasivas. El n&uacute;mero de tarjetas soportadas crece casi con la misma
velocidad que se suceden versiones del n&uacute;cleo. Tenga en cuenta que si
posee un adaptador externo (Zyxel o USR) el m&eacute;todo que se emplear&aacute; ser&aacute; el
primero descrito en este documento (usando los scripts levemente
modificados que se usan en una conexi&oacute;n con un m&oacute;dem anal&oacute;gico). </P>
<P>Por fortuna, este tipo de dispositivos suelen ser poco comunes (por su
alto precio y nula diferencia en rendimiento en comparaci&oacute;n con una
tarjeta interna, adem&aacute;s de no soportar el <I>dial on demand</I> ---llamada
bajo demanda, en adelante DoD--- integrado directamente en el <CODE>ipppd</CODE>
que s&iacute; soportan los dispositivos <CODE>ipppX</CODE>).  </P>
<P>En cualquier caso, los problemas de configuraci&oacute;n que presentan se reducen
al m&iacute;nimo, y pasan por ajustar (en determinados casos) la cadena de
inicializaci&oacute;n del gui&oacute;n de chat.</P>
<P>Nos centraremos pues, casi en exclusiva, en las tarjetas internas. </P>
<P>La lista est&aacute; sacada de los ficheros <CODE>README.*</CODE> que acompa&ntilde;an a la
parte del arbol de fuentes correspondientes al soporte RDSI que modifica
un fichero <CODE>.tar.gz</CODE> del que hablaremos m&aacute;s adelante en este documento:</P>
<P>
<UL>
<LI>Teles 8.0/16.0/16.3 y compatibles</LI>
<LI>Teles 16.3c</LI>
<LI>Teles S0/PCMCIA</LI>
<LI>Teles PCI</LI>
<LI>Teles S0Box</LI>
<LI>Creatix S0Box</LI>
<LI>Creatix PnP S0</LI>
<LI>Compaq ISDN S0 ISA </LI>
<LI>AVM A1 (Fritz, Teledat 150)</LI>
<LI>ELSA Microlink PCC-16, PCF, PCF-Pro, PCC-8</LI>
<LI>ELSA Quickstep 1000</LI>
<LI>ELSA Quickstep 1000PCI</LI>
<LI>ELSA Quickstep 3000 (igual que una QS1000)</LI>
<LI>ELSA Quickstep 3000PCI</LI>
<LI>ELSA PCMCIA</LI>
<LI>ITK ix1-micro Rev.2</LI>
<LI>Eicon.Diehl Diva 2.0 ISA y PCI (S0 y U, PRO no soportada)</LI>
<LI>Eicon.Diehl Diva Piccola</LI>
<LI>ASUSCOM NETWORK INC. ISDNLink 128K PC adapter (c&oacute;digo I-IN100-ST-D)</LI>
<LI>Dynalink IS64PH (versi&oacute;n OEM de ASUSCOM NETWORK INC. ISDNLink 128K
adapter)</LI>
<LI>Tarjetas basadas en HFC-2BS0 (TeleInt SA1)</LI>
<LI>Sedlbauer Speed Card (Speed Win, Teledat 100)</LI>
<LI>Sedlbauer Speed Star (PCMCIA)</LI>
<LI>USR Sportster internal TA (compatible Stollmann tina-pp V3)</LI>
<LI>ith Kommunikationstechnik GmbH MIC 16 ISA card</LI>
<LI>Traverse Technologie NETjet PCI S0 card</LI>
<LI>Dr. Neuhaus Niccy PnP/PCI

<I>Notas</I>:  PCF, PCF-Pro: por ahora, solo la parte ISDN est&aacute; soportada</LI>
<LI>PCC-8: sin testear</LI>
<LI>Teles PCMCIA es EXPERIMENTAL</LI>
<LI>Teles 16.3c es EXPERIMENTAL</LI>
<LI>Teles PCI es EXPERIMENTAL</LI>
<LI>Teles S0Box es EXPERIMENTAL</LI>
<LI>Eicon.Diehl Diva U interface sin testear</LI>
<LI>ICN-ISDN-card</LI>
<LI>PCBIT</LI>
<LI>ISDN ISA SpellCaster</LI>
</UL>
</P>
<P>Tenga en cuenta que esta es una lista general. Muchos de los modelos que
aqu&iacute; aparecen, no se encuentran en el mercado espa&ntilde;ol. La mayor&iacute;a de las
tarjetas son de origen alem&aacute;n. La PCBIT es un "honrosa" excepci&oacute;n: est&aacute;
fabricada en Portugal. </P>
<P>De las tarjetas distribuidas por Telef&oacute;nica y manufacturadas por Alcatel
(si no recordamos mal), las infames <I>SPC-2</I> en cualquiera de sus
versiones (y sobre todo en la primera), ni hablaremos. </P>
<P>Ninguno de los que suscriben tienen noticia (pese a utilizar en parte de
su circuiter&iacute;a los chips Siemens) de que alguien haya conseguido hacerla
funcionar bajo Linux. En cualquier caso, su funcionamiento (bajo un SO que
incluya soporte para la misma) deja mucho que desear.</P>
<P>Y como siempre, visita obligada a la documentaci&oacute;n que incluye el c&oacute;digo
fuente del n&uacute;cleo (m&aacute;xime si se aventura a usar un kernel de la serie 2.1) 
bajo <CODE>Documentation/isdn</CODE> para obtener una lista lo m&aacute;s actualizada
posible. </P>


<H2><A NAME="ss2.2">2.2 Soy muy precavido, y estoy leyendo esto antes de comprar la</A>tarjeta. ¿Cu&aacute;l recomend&aacute;is? </H2>


<P>Como dec&iacute;amos en la secci&oacute;n 
<A HREF="#hard">hard</A>, ante todo, tarjetas pasivas
internas (que est&eacute;n soportadas, claro est&aacute;) frente a adaptadores RDSI
externos. </P>
<P>En general, las tarjetas pasivas con circuiter&iacute;a Siemens, y especialmente
las que integran el juego de chipsets <I>HSCX</I> e <I>ISAC</I>, dado que el
driver HiSax es el m&aacute;s desarrollado y el que m&aacute;s <I>empuje</I> tiene.</P>
<P>Teniendo como criterios lo anterior, el rendimiento, la calidad, y la
colaboraci&oacute;n que las marcas tienen con Linux en general, y con los
desarrolladores de <CODE>isdn4linux</CODE> en particular:</P>
<P>
<OL>
<LI>ELSA</LI>
<LI>Creatix</LI>
<LI>Resto de tarjetas soportadas</LI>
</OL>
</P>
<P>La <I>Creatix PnP</I> es casi equivalente a la <I>Teles 16.3
PnP</I>
<SL>Ojo, <B>NO</B> la <I>Teles 16.3c PnP</I>, que pese a estar
soportada experimentalmente, no tiene nada que ver en cuanto a
calidad</SL>
, si bien ha sido desarrollada &iacute;ntegramente por
<I>Creatix</I>; adem&aacute;s de la actitud positiva de <I>Creatix</I> respecto
Linux, a diferencia de <I>Teles</I>. </P>
<P>¡Apoye a los fabricantes que apuestan por Linux!</P>


<HR>
<A HREF="RDSI-Como-1.html">Anterior</A>
<A HREF="RDSI-Como-3.html">Siguiente</A>
<A HREF="RDSI-Como.html#toc2">Indice</A>
</BODY>
</HTML>
