<HTML>
<HEAD>
<TITLE>RPM COMO : Visi&oacute;n general</TITLE>
</HEAD>
<BODY>
<A HREF="RPM-Como-1.html">Anterior</A>
<A HREF="RPM-Como-3.html">Siguiente</A>
<A HREF="RPM-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Visi&oacute;n general</A></H2>


<P>Primero, perm&iacute;tame expresar parte de la filosof&iacute;a tras RPM. Uno de los
objetivos del dise&ntilde;o fue permitir el uso de fuentes
``pr&iacute;stinas
<SL>N.T.: originales</SL>
''.</P>
<P>Con RPP (nuestro anterior sistema de empaquetado del cual RPM <EM>no
deriva</EM> en absoluto), nuestros paquetes de fuentes deb&iacute;an ser
``hackeados
<SL>N.T.: retocados</SL>
'' para poder construir las
aplicaciones desde ellos. Te&oacute;ricamente, se pod&iacute;a instalar un paquete
fuente RPP y efectuarle un <CODE>make</CODE> sin problemas.  Pero los fuentes no
eran las originales, y no hab&iacute;a referencia alguna a los cambios que
hab&iacute;amos hecho para que pudieran compilar. Se hac&iacute;a pues necesario bajarse
los fuentes originales de forma separada. </P>
<P>Con RPM, tiene los fuentes originales junto al ``parche
<SL>N.T.:
<EM>patch</EM> en el original</SL>
'' que hemos usado para poder
compilarlo. Vemos en esto una gran ventaja. ¿Por qu&eacute;? Son varias las
razones. La primera es que si sale disponible una nueva versi&oacute;n de un
programa, usted no necesita empezar desde la nada para conseguir que
compile bajo RHL. Puede examinar el parche para saber qu&eacute; <EM>podr&iacute;a</EM>
necesitar hacer. De esta manera toda la configuraci&oacute;n por defecto de
compilaci&oacute;n queda f&aacute;cilmente a la vista. </P>
<P>RPM tambi&eacute;n est&aacute; dise&ntilde;ado para disponer de potentes par&aacute;metros de
consulta.  Usted puede hacer b&uacute;squedas de paquetes a lo largo de toda la
base de datos o s&oacute;lo de ciertos ficheros. Tambi&eacute;n puede encontrar
f&aacute;cilmente a qu&eacute; paquete pertenece un fichero y de d&oacute;nde proviene. Los
ficheros RPM en s&iacute; mismos son archivos comprimidos, pero puede consultar
paquetes independientes f&aacute;cil y <EM>r&aacute;pidamente</EM>, gracias a una cabecera
binaria a medida a&ntilde;adida al paquete con toda la informaci&oacute;n que puede
necesitar, almacenada sin comprimir. Esto permite consultas <EM>r&aacute;pidas</EM>. </P>
<P>Otra poderosa caracter&iacute;stica es la habilidad de verificar paquetes. Si
est&aacute; preocupado por haber borrado alg&uacute;n fichero importante, s&oacute;lo tiene que
verificar el paquete. Quedar&aacute; cumplidamente informado de cualquier
anomal&iacute;a.  Llegados a ese punto, podr&aacute; reinstalar el paquete si lo
considera necesario.  Cualquier fichero de configuraci&oacute;n que usted tenga
quedar&aacute; a salvo. </P>
<P>Queremos agradecer a los colegas de la distribuci&oacute;n BOGUS por muchas de
sus ideas y conceptos que han sido incluidos en RPM. Aunque RPM est&aacute;
completamente escrito por Red Hat Software, su funcionamiento est&aacute; basado
en c&oacute;digo escrito por BOGUS (PM y PMS). </P>

<HR>
<A HREF="RPM-Como-1.html">Anterior</A>
<A HREF="RPM-Como-3.html">Siguiente</A>
<A HREF="RPM-Como.html#toc2">Indice</A>
</BODY>
</HTML>
