<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <TITLE>lf153, Applications: Aprendiendo a utilizar el editor VI</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/white.gif" width="61" height="41" align="bottom" heigth="10" alt="[Foto of the Auteur]" >
<BR>por  <A HREF="mailto:ben@wiliki.eng.hawaii.edu">Ben Y. Yoshino</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Ben Yoshinori Yoshino trabaja en la universidad de Hawai. Su p&aacute;gina personal se encuentra en la
siguiente direcci&oacute;n: <A HREF="http://www.eng.hawaii.edu/~ben/">www.eng.hawaii.edu/~ben</A></P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Signos utilizados</A></LI>
  <LI><A HREF="#lfindex1">Antes de empezar</A></LI>
  <LI><A HREF="#lfindex2">Iniciando el editor VI</A></LI>
  <LI><A HREF="#lfindex3">C&oacute;mo salir de VI</A></LI>
  <LI><A HREF="#lfindex4">Los dos modos de VI</A></LI>
  <LI><A HREF="#lfindex5">C&oacute;mo utilizar las funciones del modo comando</A></LI>
  <LI><A HREF="#lfindex6">Algunas &oacute;rdenes sencillas en VI</A></LI>
  <LI><A HREF="#lfindex7">B&uacute;feres de texto en VI</A></LI>
  <LI><A HREF="#lfindex8">Cortar y extraer</A></LI>
  <LI><A HREF="#lfindex9">Pegar</A></LI>
  <LI><A HREF="#lfindex10">C&oacute;mo dar forma y verificar su c&oacute;digo</A></LI>
  <LI><A HREF="#lfindex11">C&oacute;mo buscar palabras o caracteres</A></LI>
  <LI><A HREF="#lfindex12">Opciones en VI (y EX)</A></LI>
  <LI><A HREF="#lfindex13">Abreviaturas y cambio de funci&oacute;n de las teclas</A></LI>
  <LI><A HREF="#lfindex14">La variable de entorno EXINIT y el archivo .exrc</A></LI>
  <LI><A HREF="#lfindex15">C&oacute;mo recuperar su trabajo cuando algo no va bien en la terminal</A></LI>
  <LI><A HREF="#lfindex16">Advertencia acerca del uso de VI en estaciones de trabajo</A></LI>
  <LI><A HREF="#lfindex17">Sumario de &oacute;rdenes de VI</A></LI>
  <LI><A HREF="#lfindex18">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=153&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Aprendiendo a utilizar el editor VI</H2>
 <img src="../../common/images/illustration153.gif" width="77" height="37" align="bottom" PUBDIR="Aprendiendo_editor_VI.doc.html.htg/" PUBDIR="../../common/images/" alt="[VIM the edtitor]" >
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>Este es un tutorial de vi escrito por <A HREF="mailto:ben@wiliki.hawaii.edu">Ben Y. Yoshino</A>. El original se encuentra en
<A HREF="http://www.eng.hawaii.edu/Tutor/vi.html">www.eng.hawaii.edu/Tutor/vi.html</A>. Se pueden examinar otros tutoriales del mismo autor en:
<A HREF="http://www.eng.hawaii.edu/Tutor/">www.eng.hawaii.edu/Tutor/</A>. Vimos este art&iacute;culo en <A HREF="http://www.rootprompt.org">www.rootprompt.org</A> y lo publicamos aqu&iacute; con permiso
del autor.</P><P>El editor VI es un editor que opera en modo consola, utilizado por muchos usuarios de Unix. El editor VI
posee caracter&iacute;sticas muy &uacute;tiles para los programadores, pero muchos principiantes evitan emplearlo
porque se ven abrumados por sus variadas funciones. Este tutorial ha sido escrito con el prop&oacute;sito de
ayudar a los principiantes a familiarizarse con el uso del editor VI, pero tambi&eacute;n contiene apartados de
inter&eacute;s para quienes ya lo utilizan habitualmente. Se ofrecer&aacute;n algunos ejemplos: la mejor forma de
aprender es ponerlos en pr&aacute;ctica uno mismo, y tambi&eacute;n idear nuevos ejemplos... No hay mejor modo de
aprender que experimentar las cosas por uno mismo.</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Signos utilizados</H2>


<P>En este tutorial adoptamos la siguiente convenci&oacute;n en cuanto al uso de signos:</P>

<P><STRONG>^X</STRONG> indica <STRONG>CTRL + X</STRONG>. Por ejemplo, si en el tutorial aparece <STRONG>^d</STRONG>, eso significa que se ha de pulsar la tecla<STRONG>
control </STRONG>y, sin soltarla, a continuaci&oacute;n la letra correspondiente. En este ejemplo habr&iacute;a que pulsar la tecla
<STRONG>control</STRONG>, y seguidamente teclear <STRONG>d</STRONG>.</P>
<A NAME="lfindex1">&nbsp;</A>
<H2><A NAME="before">Antes de empezar</A></H2>


<P>Este apartado no es relevante para aquellos usuarios de Linux que dispongan de emuladores de terminales
modernos tales como xterm, gnome-terminal, kvt o aterm. Con esas ventanas de terminal, la variable del<EM>
shell</EM> $TERM tendr&aacute; siempre por defecto el valor correcto, de modo que no tendr&aacute; que preocuparse de ello.</P>

<TABLE WIDTH="40%" align=right BGCOLOR="#AA8888"><TR><TD>
N. del T.: <EM>wiliki</EM> es el nombre del servidor principal del departamento de
ingenier&iacute;a de la universidad de Hawai. Como se ve, este tutorial iba en principio dirigido a los estudiantes
y profesores de esa universidad.
</TD></TR></TABLE>

<P>El editor VI utiliza toda la pantalla, por lo que necesita saber qu&eacute; clase de terminal va a utilizarse. Cuando
introduzca su nombre de usuario, <EM>wiliki</EM> deber&iacute;a preguntarle qu&eacute; tipo de terminal tiene usted. En la
pantalla debe aparecer lo siguiente:
</P>

<PRE>
	TERM = (vt100)
</PRE>

<P>Si sabe que su terminal es del tipo vt100 (o un emulador de la misma), al ser preguntado por el tipo de
terminal, simplemente pulse <STRONG>Enter</STRONG>. Si tiene una terminal HP, teclee "<TT>hp</TT>" y pulse <STRONG>Enter</STRONG>. Si no sabe a
ciencia cierta qu&eacute; tipo de terminal tiene, pregunte a alguien que trabaje en el laboratorio o pida a alguien
que le ayude a determinar el tipo de terminal correcto.</P>

<P>Si al entrar comete un error e indica un tipo de terminal incorrecto, no se alarme y salga del sistema. Para
solucionarlo puede hacer lo siguiente:</P>

<P>En primer lugar, ind&iacute;quele a su <EM>shell</EM> qu&eacute; tipo de terminal tiene. (Si no sabe bien qu&eacute; shell tiene, teclee la
siguiente orden: <TT>echo $SHELL</TT>). En los ejemplos propuestos el tipo de terminal utilizada es "vt100".
Sustit&uacute;yalo por la que usted tenga. Para el <EM>shell</EM> C (/bin/csh), la orden es &eacute;sta:<BR>
</P>
<PRE>
        set term=vt100
</PRE>

<P>Para el <EM>Bourne Shell</EM> (/bin/sh) o el <EM>Korn Shell</EM> (/bin/ksh), las &oacute;rdenes son las siguientes:<BR>
</P>
<PRE>
        TERM=vt100
        export TERM
</PRE>

<P>A continuaci&oacute;n, reinicie su terminal mediante esta orden:<BR>
</P>
<PRE>
        tset
</PRE>

<P>Ahora que (esperamos) ya hemos seleccionado el tipo de terminal correcto, estamos preparados para
comenzar a utilizar el VI.</P>
<A NAME="lfindex2">&nbsp;</A>
<H2><A NAME="start">Iniciando el editor VI</A></H2>


<P>El editor VI permite al usuario crear nuevos archivos o editar los ya existentes. La orden para iniciar el
editor VI editor es <TT>vi</TT>, seguida del nombre del archivo. Por ejemplo, para editar un archivo denominado
<EM>temporal</EM>, deber&iacute;amos teclear <TT>vi temporal</TT> y pulsar <STRONG>Enter</STRONG>. Puede tambi&eacute;n iniciar el VI sin indicar
ning&uacute;n nombre de archivo, pero en ese caso, cuando quiera guardar su trabajo tendr&aacute; qu&eacute; indicarle al VI el
nombre de archivo en que desea guardarlo.</P>

<P>Cuando inicie VI por vez primera, se encontrar&aacute; con una pantalla cuyo margen izquierdo aparecer&aacute; lleno
de virgulillas como la que en castellano va sobre la letra e&ntilde;e (~). As&iacute; es como se representan las l&iacute;neas
vac&iacute;as tras el fin del archivo. En la base de la pantalla se mostrar&aacute; el nombre del archivo -en el caso en
que se haya especificado uno- y su tama&ntilde;o, del siguiente modo:<BR>
</P>
<PRE>
"filename" 21 lines, 385 characters
</PRE>

<P>Si el archivo especificado no existe, VI le indicar&aacute; que se trata de una archivo nuevo, del siguiente modo:<BR>
</P>
<PRE>
"newfile" [New file]
</PRE>

<P>Si inici&oacute; VI sin indicar un nombre de archivo, la l&iacute;nea al fondo de la pantalla aparecer&aacute; vac&iacute;a. Si la
pantalla no le muestra los resultados esperados, que acabamos de mencionar, es posible que la terminal no
est&eacute; configurada correctamente. En ese caso, pulse <TT>q</TT> y <STRONG>Enter</STRONG>, para salir de VI, y <A HREF="#before">corrija el tipo de
terminal</A>. Si no sabe c&oacute;mo hacerlo pregunte a alguien que trabaje en el laboratorio.</P>
<A NAME="lfindex3">&nbsp;</A>
<H2><A NAME="quit">C&oacute;mo salir de VI</A></H2>


<P>Ahora que sabe c&oacute;mo entrar en VI, no estar&iacute;a de m&aacute;s conocer el modo de salir. El editor VI tiene <A HREF="#modes">dos
modos</A> y, para salir de VI, tiene que estar en el modo <EM>comando</EM>. Para entrar en modo <EM>comando</EM> pulse la
tecla <STRONG>Esc</STRONG> (Si su terminal carece de esa tecla, haga la prueba pulsando <STRONG>^[</STRONG>. Si estaba ya en modo <EM>comando</EM>
cuando puls&oacute; <STRONG>Escape</STRONG>, no se preocupe. Podr&iacute;a emitir un "bip", pero seguir&iacute;a encontr&aacute;ndose en el modo
<EM>comando</EM>.</P>

<P>La orden para salir de VI es <TT>:q </TT>; es decir, que una vez se encuentre en modo <EM>comando</EM>, ha de teclear
dos puntos, seguido de 'q', y continuaci&oacute;n pulsar <STRONG>Enter</STRONG>. Si el archivo ha sufrido alguna modificaci&oacute;n, el
editor le avisar&aacute; de esa circunstancia y no le permitir&aacute; cerrarlo. Si quiere eludir ese mensaje, la orden para
salir de VI sin guardar los cambios es <TT>:q!</TT>.</P>

<P>Naturalmente, lo habitual en un editor es que usted desee guardar los cambios que ha hecho. La orden para
hacerlo es <TT>:w</TT>. Tambi&eacute;n puede combinar esta orden con la de salir, del siguiente modo <TT>:wq</TT>. Y si lo desea
puede guardar los cambios en un archivo diferente, especificando el nombre de &eacute;ste tras <TT>:w</TT>. Por ejemplo,
si quiere guardar el archivo en el que est&aacute; trabajando con otro nombre, digamos <EM>archivo2</EM>, entonces tendr&iacute;a
que escribir : <TT>w archivo2 </TT>y <STRONG>Enter</STRONG>.</P>

<P>Otro modo de guardar los cambios y salir de VI es la orden <TT>ZZ</TT>. Cuando se encuentre en el modo
<EM>comando</EM>, escriba <TT>ZZ</TT>; obtendr&aacute; el mismo resultado que con <TT>:wq</TT>. De ese modo se guardar&iacute;a cualquier
cambio que se hubiera operado en el archivo. Esta es la forma m&aacute;s sencilla para salir del editor: con s&oacute;lo
dos pulsaciones.</P>
<A NAME="lfindex4">&nbsp;</A>
<H2><A NAME="modes">Los dos modos de VI</A></H2>


<P>Lo primero que la mayor parte de los usuarios aprenden del editor VI es que cuenta con dos modos:
<EM>comando</EM> e <EM>insertar</EM>. El modo <EM>comando</EM> permite introducir &oacute;rdenes para manipular el texto.
Normalmente estas &oacute;rdenes no tienen m&aacute;s que uno o dos caracteres, pudiendo as&iacute; introducirse con pocas
pulsaciones. El modo <EM>insertar</EM> hace que todo lo que se pulse en el teclado se incorpore al archivo.</P>

<P>VI se inicia en el modo <EM>comando</EM>. Hay varias formas de pasar al modo <EM>insertar</EM>. La m&aacute;s com&uacute;n consiste
en teclear <TT>a</TT> o <TT>i</TT>. M&aacute;s abajo se describen ambas &oacute;rdenes. Una vez se encuentre en el modo <EM>insertar</EM>, podr&aacute;
salir de &eacute;l pulsando la tecla <STRONG>escape</STRONG> (si su terminal no tiene esa tecla, deber&iacute;a funcionar <STRONG>^[</STRONG> ). Puede pulsar
<STRONG>escape</STRONG> dos veces seguidas y de esa manera no habr&aacute; duda de que se encuentra en modo <EM>comando</EM>. Pulsar
<STRONG>escape</STRONG> mientras se encuentra en modo <EM>comando</EM> no hace que el editor salga de dicho modo<EM>;</EM> sonar&aacute; un
pitido para confirmarle que se encuentra ya en ese modo.</P>
<A NAME="lfindex5">&nbsp;</A>
<H2><A NAME="commands">C&oacute;mo utilizar las funciones del modo <EM>comando</EM></A></H2>


<P>En el modo <EM>comando</EM> las &oacute;rdenes siguen normalmente el siguiente esquema (entre corchetes aparecen las
variables optativas):<TT>[<EM>cifra</EM>] <EM>comando</EM> [<EM>d&oacute;nde</EM>]</TT></P>

<P>La mayor parte de las instrucciones constan de un solo car&aacute;cter, incluidas aquellas en las que es preciso
pulsar la tecla <STRONG>Ctrl</STRONG>. En el siguiente apartado describiremos las instrucciones que m&aacute;s suelen emplearse en
el editor VI.</P>

<P>La <EM>cifra</EM> es cualquier n&uacute;mero que comience por un car&aacute;cter entre 1 y 9. Por ejemplo, la instrucci&oacute;n <TT>x</TT> borra
el car&aacute;cter que se encuentra en el lugar del cursor. Si, dentro del modo <EM>comando</EM>, se teclea <TT>23x</TT>, se
borrar&aacute;n 23 caracteres.</P>

<P>Algunas &oacute;rdenes utilizan un par&aacute;metro optativo -<EM>d&oacute;nde</EM>-, en el que puede especificarse cu&aacute;ntas l&iacute;neas o a
qu&eacute; parte del documento afecta la orden. El par&aacute;metro <EM>d&oacute;nde</EM> puede ser tambi&eacute;n cualquier orden que
mueva el cursor.</P>
<A NAME="lfindex6">&nbsp;</A>
<H2><A NAME="simple">Algunas &oacute;rdenes sencillas en VI</A></H2>


<P>He aqu&iacute; una sencilla colecci&oacute;n de &oacute;rdenes para comenzar a utilizar el VI. Hay muchos otras, muy &uacute;tiles,
de las que nos ocuparemos m&aacute;s adelante.</P>

<DL>
  <DT>a</DT>
    <DD>nos coloca en el modo <EM>insertar</EM>. Los caracteres pulsados se ir&aacute;n insertando tras el cursor. Si se
especifica una cifra, el texto que haya sido insertado se repetir&aacute; ese n&uacute;mero de veces.</DD>
  <DT>h</DT>
    <DD>mueve el cursor una posici&oacute;n hacia la izquierda.</DD>
  <DT>i</DT>
    <DD>nos coloca en el modo <EM>insertar</EM>. Los caracteres pulsados se ir&aacute;n insertando tras el cursor. Si se
especifica una cifra, el texto que haya sido insertado se repetir&aacute; ese n&uacute;mero de veces.</DD>
  <DT>j</DT>
    <DD>mueve el cursor una l&iacute;nea hacia abajo.</DD>
  <DT>k</DT>
    <DD>mueve el cursor una l&iacute;nea hacia arriba.</DD>
  <DT>l</DT>
    <DD>mueve el cursor una posici&oacute;n hacia la derecha.</DD>
  <DT>r</DT>
    <DD>sustituye el car&aacute;cter sobre el que se encuentra el cursor. Especifique la <EM>cifra</EM> para sustituir un
n&uacute;mero determinado de caracteres.</DD>
  <DT>u</DT>
    <DD>deshace el &uacute;ltimo cambio operado en el archivo. Si pulsa <TT>u</TT> de nuevo, se rehar&aacute; el cambio.</DD>
  <DT>x</DT>
    <DD>Borra el car&aacute;cter que se halla bajo el cursor. <EM>Cifra</EM> especifica cu&aacute;ntos caracteres han de borrarse.
Se borrar&aacute;n los caracteres que se encuentran tras el cursor.</DD>
</DL>
<A NAME="lfindex7">&nbsp;</A>
<H2><A NAME="buffers">B&uacute;feres de texto en VI</A></H2>


<P>El editor VI cuenta con 36 b&uacute;feres para almacenar fragmentos de texto, y tambi&eacute;n un b&uacute;fer de uso general.
Siempre que un fragmento de texto es borrado o extra&iacute;do (copiado) del archivo, queda colocado en el
b&uacute;fer de uso general. La mayor&iacute;a de los usuarios de VI apenas hacen uso de los otros b&uacute;feres, y pueden
arregl&aacute;rselas sin ellos. El fragmento de texto se almacenar&aacute; tambi&eacute;n en otro b&uacute;fer si se especifica uno. El
b&uacute;fer se especifica mediante la orden <TT>"</TT>. Tras pulsar <TT>"</TT>, hay que introducir una letra o d&iacute;gito para
especificar el b&uacute;fer. Por ejemplo, la orden: <TT>"mdd</TT> utiliza el b&uacute;fer <STRONG>m</STRONG>, y los dos &uacute;ltimos caracteres significan
que se va a borrar la l&iacute;nea entera. Del mismo modo, es posible pegar texto mediante la instrucci&oacute;n <TT>p</TT> o <TT>P</TT>.
<TT>"mp</TT> pega el contenido del b&uacute;fer <STRONG>m</STRONG> tras el lugar en el que se encuentra el cursor. En el caso de cualquiera
de las instrucciones mencionadas en los dos apartados siguientes, estos b&uacute;feres pueden utilizarse para
almacenar temporalmente palabras o p&aacute;rrafos.</P>
<A NAME="lfindex8">&nbsp;</A>
<H2><A NAME="cut">Cortar y extraer</A></H2>


<P>La orden que habitualmente se usa para cortar es <TT>d</TT>. Esta instrucci&oacute;n borra texto del archivo. La orden
puede ir precedida de una <EM>cifra</EM> y seguida de la indicaci&oacute;n de un movimiento. Si duplica la orden pulsando
<TT>dd</TT>, se borrar&aacute; la l&iacute;nea entera. He aqu&iacute; algunas combinaciones de este tipo:</P>

<DL>
  <DT>d^</DT>
    <DD>borra desde la posici&oacute;n del cursor hasta el comienzo de la l&iacute;nea.</DD>
  <DT>d$</DT>
    <DD>borra desde la posici&oacute;n del cursor hasta el fin de la l&iacute;nea.</DD>
  <DT>dw</DT>
    <DD>borra desde la posici&oacute;n del cursor hasta el fin de la palabra.</DD>
  <DT>3dd</DT>
    <DD>borra tres l&iacute;neas desde la posici&oacute;n del cursor hacia abajo.</DD>
</DL>

<P>Existe tambi&eacute;n la orden <TT>y</TT> (copiar) que opera de forma parecida a la orden <TT>d</TT>, s&oacute;lo que sin borrar el texto
del archivo.</P>
<A NAME="lfindex9">&nbsp;</A>
<H2><A NAME="paste">Pegar</A></H2>


<P>Las &oacute;rdenes para pegar son <TT>p</TT> y <TT>P</TT>. La &uacute;nica diferencia entre ellas es el lugar en que pegan respecto del
cursor. <TT>p</TT> pega el contenido del b&uacute;fer general o espec&iacute;fico tras la posici&oacute;n del cursor, mientras que <TT>P</TT> lo
pega delante del cursor. Si se especifica una <EM>cifra</EM> antes de la orden pegar, el texto se pegar&aacute; el n&uacute;mero de
veces que se haya indicado.</P>
<A NAME="lfindex10">&nbsp;</A>
<H2><A NAME="indent">C&oacute;mo dar forma y verificar su c&oacute;digo</A></H2>


<P>El editor VI posee una serie de funciones que ayudan al programador a dar a sus c&oacute;digos una forma
pulcra. Existe una variable para determinar la tabulaci&oacute;n que se da a los distintos niveles del c&oacute;digo. Para
disponerlo a su gusto, consulte el <A HREF="#settings">apartado de personalizaci&oacute;n</A> de este tutorial. Por ejemplo, la orden para
hacer que la tabulaci&oacute;n tenga una anchura de cuatro espacios es <TT>:set sw=4</TT>.</P>

<P>Las siguientes &oacute;rdenes sirven para marcar las tabulaciones de una l&iacute;nea o para quitarlas, y pueden
modificarse con <EM>cifra</EM>:</P>

<DL>
  <DT>&lt;&lt;</DT>
    <DD>Corre la l&iacute;nea una tabulaci&oacute;n hacia la izquierda.</DD>
  <DT>&gt;&gt;</DT>
    <DD>Corre la l&iacute;nea una tabulaci&oacute;n hacia la derecha.</DD>
</DL>

<P>El editor VI dispone tambi&eacute;n de una funci&oacute;n muy &uacute;til para verificar que en su c&oacute;digo fuente no han
quedado par&eacute;ntesis o corchetes sin cerrar. La orden <TT>%</TT> buscar&aacute; el par&eacute;ntesis o corchete izquierdo
correspondiente a un determinado signo de par&eacute;ntesis o corchete derecho, y viceversa. Coloque el cursor
encima de un par&eacute;ntesis o corchete y pulse <STRONG>%</STRONG> para llevar el cursor al par&eacute;ntesis o corchete que le
corresponde. Si hay un par&eacute;ntesis o corchete desparejado, VI emitir&aacute; un pitido para indicarle que no se ha
encontrado el s&iacute;mbolo correspondiente.</P>
<A NAME="lfindex11">&nbsp;</A>
<H2><A NAME="search">C&oacute;mo buscar palabras o caracteres</A></H2>


<P>El editor VI permite dos tipos de b&uacute;squedas: secuencia de caracteres o car&aacute;cter. En el caso de las
secuencias de caracteres se utilizan las &oacute;rdenes <TT>/</TT> y <TT>?</TT>. Cuando se emplean estas &oacute;rdenes, la orden que se
acaba de activar se mostrar&aacute; en la &uacute;ltima l&iacute;nea de la pantalla, donde se mostrar&aacute; tambi&eacute;n la secuencia que
se va a buscar. La &uacute;nica diferencia entre ambas instrucciones es la direcci&oacute;n de la b&uacute;squeda. La orden <TT>/</TT>
busca hacia delante (hacia abajo) en el archivo, mientras que la orden <TT>?</TT> busca hacia atr&aacute;s (hacia arriba).
Las &oacute;rdenes <TT>n</TT> y <TT>N</TT> sirven para repetir la b&uacute;squeda anterior en la misma o en la direcci&oacute;n opuesta,
respectivamente. Algunos caracteres tienen para VI un significado particular, por lo que para ser incluidos
como parte de la b&uacute;squeda han de ir precedidos de una barra invertida (\).</P>

<P>Caracteres especiales:</P>

<DL>
  <DT><tt>^</tt></DT>
    <DD>Comienzo de la l&iacute;nea. (Al comienzo de una secuencia de b&uacute;squeda.)</DD>
  <DT><tt>.</tt></DT>
    <DD>Una aparici&oacute;n de cualquier caracter.</DD>
  <DT><tt>*</tt></DT>
    <DD>Varias (o ninguna) repeticiones del caracter detr&aacute;s del que va situado.</DD>
  <DT><tt>$</tt></DT>
    <DD>Fin de la l&iacute;nea. (Al final de una secuencia de b&uacute;squeda.)</DD>
  <DT><tt>[</tt></DT>
    <DD>Indica el comienzo de un conjunto de elementos a incluir o excluir de la b&uacute;squeda. Por ejemplo:
/f[iae]t buscar&aacute; cualquiera de estas secuencias: 'fit', 'fat', 'fet'. En la forma que sigue lo que har&aacute;
es excluir lo que aparece entre corchetes: /a[^bcd]. En este caso, buscar&aacute; toda &aacute;' que no vaya
seguida de 'b', 'c' o 'd'.</DD>
  <DT><tt>&lt;</tt></DT>
  <DT><tt>&gt;</tt></DT>
    <DD>Estos signos, combinados con la barra invertida, sirven para buscar el comienzo o el final de una
palabra. Por ejemplo: /\&lt;en\&gt; buscar&iacute;a &uacute;nicamente la palabra &eacute;n'; no buscar&iacute;a '<EM>en</EM>tre' ni 'd<EM>en</EM>tro'.</DD>
</DL>

<P>El segundo tipo de b&uacute;squeda busca el car&aacute;cter introducido tras la orden correspondiente. Las &oacute;rdenes <TT>f</TT> y
<TT>F</TT> buscan un car&aacute;cter &uacute;nicamente en la l&iacute;nea en la que se encuentra el cursor. <TT>f</TT> busca hacia adelante y <TT>F</TT>
hacia atr&aacute;s, desplaz&aacute;ndose el cursor a la posici&oacute;n del car&aacute;cter encontrado.</P>

<P>Las &oacute;rdenes <TT>t</TT> y <TT>T</TT> buscan tambi&eacute;n un car&aacute;cter &uacute;nicamente en la l&iacute;nea en la que se encuentra el cursor,
pero en el caso de <TT>t</TT> el cursor se desplaza a la posici&oacute;n anterior al car&aacute;cter hallado, y <TT>T</TT> busca en la l&iacute;nea
hacia atr&aacute;s, desplaz&aacute;ndose el cursor hasta la posici&oacute;n inmediatamente posterior al car&aacute;cter.</P>

<P>Ambas parejas de &oacute;rdenes pueden repetirse mediante las &oacute;rdenes <TT>;</TT> o <TT>,</TT>. La orden <TT>;</TT> repite la b&uacute;squeda del
car&aacute;cter en la misma direcci&oacute;n, mientras que <TT>,</TT> la repite en la direcci&oacute;n opuesta.</P>

<P>Con la opci&oacute;n "ic" (<EM>ignorecase</EM>) activada (teclee <TT>:set ic</TT>) puede hacer que la b&uacute;squeda no discrimine
may&uacute;sculas y min&uacute;sculas.</P>
<A NAME="lfindex12">&nbsp;</A>
<H2><A NAME="settings">Opciones en VI (y EX)</A></H2>


<P>Usted puede personalizar el VI antes de comenzar. Hay varias opciones de edici&oacute;n, disponibles utilizando
la orden :set. Las opciones de los editores VI y EX disponibles en Wiliki son las siguientes (puede obtener
una lista completa tecleando <TT>:set all</TT> y <STRONG>Enter</STRONG>, dentro del modo <EM>comando</EM>):</P>
<PRE>
noautoindent        magic                               noshowmatch
autoprint           mesg                                noshowmode
noautowrite         nomodelines                         noslowopen
nobeautify          nonumber                            tabstop=8
directory=/tmp      nonovice                            taglength=0
nodoubleescape      nooptimize                          tags=tags
/usr/lib/tags
noedcompatible      paragraphs=IPLPPPQPP LIpplpipnpbp   term=xterm
noerrorbells        prompt                              noterse
noexrc              noreadonly                          timeout
flash               redraw                              timeoutlen=500
hardtabs=8          remap                               ttytype=xterm
noignorecase        report=5                            warn
keyboardedit        scroll=11                           window=23
keyboardedit!       sections=NHSHH HUuhsh+c             wrapscan
nolisp              shell=/bin/csh                      wrapmargin=0
nolist              shiftwidth=8                        nowriteany
</PRE>

<P>A algunas de estas opciones se les pueden asignar valores con el signo '=', mientras que otras simplemente
est&aacute;n activadas o desactivadas. (Estas opciones de tipo <EM>on - off</EM> se denominan <STRONG>booleanas</STRONG>, y, para indicar
que no est&aacute;n activadas, llevan un "no" delante.) Las opciones mostradas aqu&iacute; son las que se tienen por
defecto, sin personalizar. A continuaci&oacute;n describimos algunas de ellas, a&ntilde;adiendo sus abreviaturas. Por
ejemplo, en el caso de la orden <EM>set autoindent</EM>, puede teclear <TT>:set autoindent</TT>, o bien <TT>:set ai</TT>. Y
para desactivarla <TT>:set noautoindent</TT> o <TT>:set noai</TT>.</P>

<DL>
  <DT>autoindent (ai)</DT>
    <DD>Esta opci&oacute;n hace que las l&iacute;neas siguientes a una dada tengan su misma tabulaci&oacute;n. Si quiere
volver a la tabulaci&oacute;n anterior, no tiene m&aacute;s que pulsar <TT>^D</TT> en la posici&oacute;n del primer car&aacute;cter. La
orden <TT>^D</TT> funciona s&oacute;lo en el modo <EM>insertar</EM>, no en modo <EM>comando</EM>. Tambi&eacute;n es posible
determinar la anchura de las tabulaciones mediante la opci&oacute;n <STRONG>shiftwidth</STRONG>, descrita m&aacute;s abajo.</DD>
  <DT>exrc</DT>
    <DD>El archivo <EM>.exrc</EM> del directorio actual es le&iacute;do al comenzar una sesi&oacute;n. &Eacute;ste debe encontrarse en la
variable de entorno <STRONG>EXINIT</STRONG> o en el archivo <EM>.exrc,</EM> en su directorio personal.</DD>
  <DT>mesg</DT>
    <DD>Desactive esta opci&oacute;n mediante <TT>:set nomesg</TT>, si no quiere que aparezca ning&uacute;n mensaje en
pantalla.</DD>
  <DT>number (nu)</DT>
    <DD>Muestra el n&uacute;mero de l&iacute;nea en el margen izquierdo.</DD>
  <DT>shiftwidth (sw)</DT>
    <DD>Esta opci&oacute;n requiere que se le asigne un valor, y determina la anchura de las tabulaciones
(&oacute;rdenes <TT>&lt;&lt;</TT> y <TT>&gt;&gt;</TT>). Por ejemplo, para que la tabulaci&oacute;n sea de cuatro espacios escribir&aacute; lo
siguiente <TT>:set sw=4</TT>.</DD>
  <DT>showmode (smd)</DT>
    <DD>Esta opci&oacute;n sirve para mostrar el modo actual del editor. Si se encuentra en el modo <EM>insertar</EM>, en
la &uacute;ltima l&iacute;nea de la pantallas aparecer&aacute; <STRONG>INPUT MODE</STRONG>. </DD>
  <DT>warn</DT>
    <DD>Esta opci&oacute;n le avisa si ha modificado el archivo pero todav&iacute;a no lo ha guardado.</DD>
  <DT>window (wi)</DT>
    <DD>Esta opci&oacute;n determina el n&uacute;mero de l&iacute;neas que VI usar&aacute; en pantalla. Por ejemplo, para hacer que
VI utilice &uacute;nicamente 12 l&iacute;neas de su pantalla (si su modem es lento), indicar&iacute;a lo siguiente:
<TT>:set wi=12</TT>.</DD>
  <DT>wrapscan (ws)</DT>
    <DD>Esta opci&oacute;n afecta al comportamiento de la b&uacute;squeda de palabras. Cuando <TT>wrapscan</TT> est&aacute;
activado, si no se encuentra la palabra al llegar al final del archivo, tratar&aacute; de buscarla desde el
comienzo.</DD>
  <DT>wrapmargin (wm)</DT>
    <DD>Si esta opci&oacute;n tiene un valor mayor que cero, se activar&aacute; el retorno manual. Es decir, si alcanza
el n&uacute;mero de espacios indicados a partir del extremo derecho de la pantalla, la palabra pasar&aacute; a
la l&iacute;nea siguiente sin necesidad de pulsar <STRONG>Enter</STRONG>. Por ejemplo, para mantener un margen derecho
de dos espacios, tendr&iacute;a que dar la orden: <TT>:set wm=2</TT>.</DD>
</DL>
<A NAME="lfindex13">&nbsp;</A>
<H2><A NAME="map">Abreviaturas y cambio de funci&oacute;n de las teclas</A></H2>


<P>Una orden del editor EX de utilidad en VI es la orden ab (abreviatura). Esto le permite asignar abreviaturas a
determinadas secuencias de caracteres. La orden tiene la siguiente forma <TT>:ab &lt;abreviatura&gt;
&lt;secuencia_que_debe_sustituirla&gt;</TT>. Por ejemplo, si tuviera que escribir la palabra
"<STRONG>Humuhumunukunukuapua`a</STRONG>", pero no quisiera tener siempre que teclearla entera, podr&iacute;a usar una
abreviatura. En este caso, podr&iacute;a introducir una orden como la siguiente: <BR>
<TT>:ab 9u Humuhumunukunukuapua`a</TT><BR>
As&iacute;, siempre que pulse <TT>9u</TT> separadamente, VI escribir&aacute; la palabra completa. Eso no suceder&aacute; si usted
teclea 9universidad, por ejemplo.</P>

<P>Para borrar una abreviatura previamente definida, utilizar&aacute; la orden &uacute;nabbreviate' (desabreviar). En el caso del ejemplo
anterior, la orden ser&iacute;a ":una 9u". Para obtener un listado de las abreviaturas que ha definido, teclee
simplemente :ab, sin nada detr&aacute;s.</P>

<P>Otra orden del editor EX que es &uacute;til para personalizar el VI es la que sirve para cambiar la funci&oacute;n de las
teclas. La hay de dos tipos: una para el modo <EM>comando</EM> y otra para el modo <EM>insertar</EM>. Estas dos &oacute;rdenes
son <TT>:map</TT> y <TT>:map!</TT>, respectivamente. Su funcionamiento es similar al de las abreviaturas: se pulsa una
secuencia de teclas, y continuaci&oacute;n otra secuencia de teclas que debe sustituir a la anterior. (Por lo general,
las secuencias de teclas sustituidas son &oacute;rdenes de VI.)</P>
<A NAME="lfindex14">&nbsp;</A>
<H2><A NAME="setup">La variable de entorno EXINIT y el archivo <EM>.exrc</EM></A></H2>


<P>Existen dos formas de personalizar el editor VI. Si crea un archivo de nombre <EM>.exrc</EM> en su directorio
personal, todas las &oacute;rdenes ah&iacute; especificadas ser&aacute;n le&iacute;das al arrancar el editor VI. El otro m&eacute;todo consiste
en crear una variable de entorno denominada <STRONG>EXINIT</STRONG>. Las opciones se grabar&aacute;n el archivo de
configuraci&oacute;n de su<EM> shell</EM>. Si utiliza el shell C (/bin/csh), la orden, que se grabar&aacute; en el archivo <EM>.cshrc</EM> es la
siguiente:<BR>
</P>
<PRE>
    setenv EXINIT '...'
</PRE>

<P>Si utiliza /bin/sh o /bin/ksh, la orden. que se grabar&aacute; en el archivo the <EM>.profile</EM>, ser&aacute; la siguiente:<BR>
</P>
<PRE>
    export EXINIT
    EXINIT='...'
</PRE>

<P>No ponga <TT>...</TT> como en el ejemplo. En ese lugar deber&aacute; poner las &oacute;rdenes que desea activar. Por ejemplo, si
quiere tabulaci&oacute;n autom&aacute;tica, numeraci&oacute;n de l&iacute;neas y un margen derecho de tres caracteres, en tal caso la
orden <EM>setenv</EM> deber&aacute; aparecer (para el shell C) como sigue:<BR>
</P>
<PRE>
    setenv EXINIT 'set ai nu wm=3'
</PRE>

<P>Si quiere poner m&aacute;s de una orden en el <TT>setenv EXINIT</TT>, sep&aacute;relas por medio de una barra vertical (|).
Por ejemplo, para hacer que el car&aacute;cter 'G' haga las veces de la orden '/g' en el modo <EM>comando</EM>, tendr&aacute;
que escribir <TT>:map g G</TT>, lo que combinado con la instrucci&oacute;n anterior ser&iacute;a:</P>
<PRE>
setenv EXINIT 'set ai nu wm=3|map g G'
</PRE>

<P>Si desea crear el archivo <EM>.exrc</EM>, puede escribir ah&iacute; exactamente lo mismo que se ha mostrado entre
comillas, tras el <STRONG>EXINIT</STRONG>.</P>
<A NAME="lfindex15">&nbsp;</A>
<H2><A NAME="recover">C&oacute;mo recuperar su trabajo cuando algo no va bien en la terminal</A></H2>


<P>El editor VI edita una copia temporal de su archivo, y, una vez que la edici&oacute;n ha finalizado o cuando
usted le da la orden de guardar, el contenido de la copia temporal se graba en el archivo original. Si algo
va mal durante la edici&oacute;n del archivo, el editor VI tratar&aacute; de guardar el trabajo que usted estaba haciendo
y lo almacenar&aacute; para su posterior recuperaci&oacute;n. (Nota: Si VI se cierra s&uacute;bitamente mientras usted estaba
trabajando con un archivo, le enviar&aacute; un mensaje indic&aacute;ndole c&oacute;mo recuperarlo. Para su recuperaci&oacute;n se
utiliza la opci&oacute;n <STRONG>-r</STRONG>. Si estaba usted editando el archivo <EM>vitalinfo</EM> y ha salido del sistema accidentalmente, la
opci&oacute;n <STRONG>-r</STRONG> del editor 'vi' puede serle de ayuda. Esta orden tiene la forma siguiente: <TT>vi -r vitalinfo</TT>
No obstante, una vez se ha hecho uso de la opci&oacute;n <STRONG>-r</STRONG>, DEBE guardar inmediatamente el trabajo, pues
dicha opci&oacute;n s&oacute;lo funciona una vez por cada sesi&oacute;n fallida de VI.)</P>
<A NAME="lfindex16">&nbsp;</A>
<H2><A NAME="warning">Advertencia acerca del uso de VI en estaciones de trabajo</A></H2>


<P>Hay dos cosas a tener en cuenta cuando se utiliza una estaci&oacute;n de trabajo: la edici&oacute;n de un mismo archivo
varias veces y el cambio de tama&ntilde;o de la pantalla.</P>

<P>Dado que VI edita una copia de su archivo original y guarda los contenidos de esa copia sobre el archivo
original, si arranca el editor m&aacute;s de una vez y est&aacute; editando el mismo archivo varias veces, si guardara el
trabajo en una ventana y luego lo volviera a guardar en otra, los cambios operados en la primera ventana
desaparecer&iacute;an, sobrescritos por los de la segunda ventana. As&iacute; pues, aseg&uacute;rese de abrir una sola copia de
VI por archivo.</P>

<P>Si utiliza un programa de terminal dentro de una estaci&oacute;n de trabajo, puede cambiar el tama&ntilde;o de la
pantalla corriendo los lados de la ventana. Si tiene problemas con el tama&ntilde;o de la ventana, la orden a
teclear es la siguiente:<BR>
</P>
<PRE>
    eval `resize`
</PRE>

<P>Si esto no funciona la orden podr&iacute;a ser &eacute;sta:<BR>
</P>
<PRE>
    eval `/usr/bin/X11R6/resize`
</PRE>

<P>&Eacute;ste es un problema que raras veces se producir&aacute; en versiones modernas de VI, tales como, por ejemplo,
Vim.</P>
<A NAME="lfindex17">&nbsp;</A>
<H2><A NAME="summary">Sumario de &oacute;rdenes de VI</A></H2>


<P>La siguiente lista es un resumen de &oacute;rdenes de VI, clasificadas seg&uacute;n su funci&oacute;n. Existen muchas otras:
puede echar un vistazo al <A HREF="/cgi-bin/man-gateway?vi">manual en l&iacute;nea de VI</A>. Para disponer de un esquema sencillo, puede guardar este
archivo en formato de texto, borrar las &oacute;rdenes que crea que no va a utilizar e imprimir el archivo
resultante.</P>

<UL>
  <LI><A HREF="#s-cut">Cortar y pegar/Borrar texto</A> </LI>
  <LI><A HREF="#s-insert">Insertar nuevo texto</A> </LI>
  <LI><A HREF="#s-mvcur">Desplazar el cursor dentro de un archivo</A> </LI>
  <LI><A HREF="#s-mvscr">Desplazar el cursor por la pantalla</A> </LI>
  <LI><A HREF="#s-repl">Reemplazar texto</A> </LI>
  <LI><A HREF="#s-srch">Buscar texto o caracteres</A> </LI>
  <LI><A HREF="#s-fmt">Manipulaci&oacute;n de caracteres/Formateo de l&iacute;neas</A> </LI>
  <LI><A HREF="#s-save">Guardar y salkr</A> </LI>
  <LI><A HREF="#s-misc">Miscel&aacute;nea</A> </LI>
  <LI><A HREF="#s-excmd">&Oacute;rdenes de EX</A> </LI>
</UL>
<H4><A NAME="s-cut">Cortar y pegar/Borrar texto</A></H4>

<DL>
  <DT>"</DT>
    <DD>Especifica un b&uacute;fer para ser utilizado por cualquiera de las &oacute;rdenes que se sirven de ellos. A&ntilde;ada
una letra o n&uacute;mero tras el signo " para signarle un b&uacute;fer.</DD>
  <DT>D</DT>
    <DD>Borra desde la posici&oacute;n actual del cursor hasta el final de la l&iacute;nea.</DD>
  <DT>P</DT>
    <DD>Pega el b&uacute;fer especificado delante de la l&iacute;nea o posici&oacute;n actual del cursor. Si no se especifica
ning&uacute;n b&uacute;fer (con la orden " ), entonces 'P' hace uso del b&uacute;fer general.</DD>
  <DT>X</DT>
    <DD>Borra el car&aacute;cter anterior al cursor.</DD>
  <DT>Y</DT>
    <DD>Graba la l&iacute;nea actual en el b&uacute;fer especificado. Si no se especifica ninguno la grabar&aacute; en el b&uacute;fer
general.</DD>
  <DT>d</DT>
    <DD>Borra hasta <EM>d&oacute;nde</EM>. "dd" borra la l&iacute;nea actual. Una cifra indica el n&uacute;mero de l&iacute;neas a borrar.
Cualquier cosa borrada se grabar&aacute; en el b&uacute;fer especificado con la orden ". Si no se especifica
ning&uacute;n b&uacute;fer, utilizar&aacute; el b&uacute;fer general.</DD>
  <DT>p</DT>
    <DD>Pega el contenido del b&uacute;fer especificado tras la l&iacute;nea o posici&oacute;n actual del cursor. Si no se
especifica ning&uacute;n b&uacute;fer (con la orden " ), entonces 'p' hace uso del b&uacute;fer general.</DD>
  <DT>x</DT>
    <DD>Borra el car&aacute;cter sobre el que se halla el cursor. Una cifra indicar&aacute; cu&aacute;ntos caracteres han de
borrarse. Los caracteres se borrar&aacute;n tras el cursor.</DD>
  <DT>y</DT>
    <DD>Graba hasta <where>, coloc&aacute;ndolo en un b&uacute;fer. "yy" graba la l&iacute;nea actual. Una cifra indicar&aacute; cu&aacute;ntas
l&iacute;neas han de grabarse. El b&uacute;fer puede especificarse con la orden ". Si no se especifica ninguno,
se utilizar&aacute; el b&uacute;fer general.</DD>
</DL>
<H4><A NAME="s-insert">Insertar nuevo texto</A></H4>

<DL>
  <DT>A</DT>
    <DD>A&ntilde;ade el texto al final de la l&iacute;nea actual.</DD>
  <DT>I</DT>
    <DD>Inserta el texto desde el comienzo de la l&iacute;nea.</DD>
  <DT>O</DT>
    <DD>Introduce el modo <EM>insertar</EM> en una nueva l&iacute;nea encima de la posici&oacute;n actual del cursor.</DD>
  <DT>a</DT>
    <DD>Cambia al modo <EM>insertar</EM>. Los caracteres escritos se insertar&aacute;n tras la posici&oacute;n actual del cursor.
Una cifra insertar&aacute; el texto a&ntilde;adido la cantidad de veces indicada.</DD>
  <DT>i</DT>
    <DD>Cambia al modo <EM>insertar</EM>. Los caracteres escritos se insertar&aacute;n delante de la posici&oacute;n actual del
cursor. Una cifra insertar&aacute; el texto a&ntilde;adido la cantidad de veces indicada.</DD>
  <DT>o</DT>
    <DD>Introduce el modo <EM>insertar</EM> en una nueva l&iacute;nea bajo la posici&oacute;n actual del cursor.</DD>
</DL>
<H4><A NAME="s-mvcur">Desplazar el cursor dentro de un archivo</A></H4>

<DL>
  <DT>^B</DT>
    <DD>Nos lleva una p&aacute;gina atr&aacute;s. Con una cifra, nos desplazar&aacute; el n&uacute;mero de p&aacute;ginas indicado.</DD>
  <DT>^D</DT>
    <DD>Nos lleva media ventana hacia delante. Con una cifra, nos desplazar&aacute; el n&uacute;mero de l&iacute;neas
indicado.</DD>
  <DT>^F</DT>
    <DD>Nos lleva una p&aacute;gina hacia delante. Con una cifra, nos desplazar&aacute; el n&uacute;mero de p&aacute;ginas indicado.</DD>
  <DT>^H</DT>
    <DD>Mueve el cursor un espacio hacia la izquierda. Con una cifra, nos desplazar&aacute; el n&uacute;mero de
espacios indicado.</DD>
  <DT>^J</DT>
    <DD>Mueve el cursor una l&iacute;nea hacia abajo en la misma columna. Con una cifra, lo har&aacute; descender el
n&uacute;mero de l&iacute;neas indicado.</DD>
  <DT>^M</DT>
    <DD>Lleva el cursor al primer car&aacute;cter de la l&iacute;nea siguiente.</DD>
  <DT>^N</DT>
    <DD>Mueve el cursor una l&iacute;nea hacia abajo en la misma columna. Con una cifra, lo har&aacute; descender el
n&uacute;mero de l&iacute;neas indicado.</DD>
  <DT>^P</DT>
    <DD>Mueve el cursor una l&iacute;nea hacia arriba en la misma columna. Con una cifra, lo har&aacute; subir el
n&uacute;mero de l&iacute;neas indicado.</DD>
  <DT>^U</DT>
    <DD>Nos lleva media ventana hacia atr&aacute;s. Con una cifra, nos desplazar&aacute; el n&uacute;mero de l&iacute;neas indicado.</DD>
  <DT>$</DT>
    <DD>Desplaza el cursor hasta el final de la l&iacute;nea actual. Con una cifra, nos llevar&aacute; cuantas l&iacute;neas
adelante indiquemos.</DD>
  <DT>%</DT>
    <DD>Desplaza el cursor hasta el par&eacute;ntesis o comillas correspondientes.</DD>
  <DT>^</DT>
    <DD>Lleva el cursor hasta el primer lugar que no est&aacute; en blanco.</DD>
  <DT>(</DT>
    <DD>Lleva el cursor al comienzo de una frase.</DD>
  <DT>)</DT>
    <DD>Lleva el cursor al comienzo de la frase siguiente.</DD>
  <DT>{</DT>
    <DD>Lleva el cursor al p&aacute;rrafo anterior.</DD>
  <DT>}</DT>
    <DD>Lleva el cursor al siguiente p&aacute;rrafo.</DD>
  <DT>|</DT>
    <DD>Lleva el cursor a la columna especificada por la cifra.</DD>
  <DT>+</DT>
    <DD>Lleva el cursor hasta el primer lugar de la l&iacute;nea siguiente que no est&aacute; en blanco.</DD>
  <DT>-</DT>
    <DD>Lleva el cursor hasta el primer lugar de la l&iacute;nea anterior que no est&aacute; en blanco.</DD>
  <DT>_</DT>
    <DD>Lleva el cursor hasta el primer lugar de la l&iacute;nea actual que no est&aacute; en blanco.</DD>
  <DT>0</DT>
    <DD>(Cero) Lleva el cursor a la primera columna de la l&iacute;nea actual.</DD>
  <DT>B</DT>
    <DD>Lleva el cursor una palabra hacia atr&aacute;s, incluyendo los signos de puntuaci&oacute;n.</DD>
  <DT>E</DT>
    <DD>Lleva el cursor al final de la palabra actual, incluyendo los signos de puntuaci&oacute;n.</DD>
  <DT>G</DT>
    <DD>Nos lleva al n&uacute;mero de l&iacute;nea especificado en la cifra. Si no se indica una cifra, nos llevar&aacute; al
final del archivo.</DD>
  <DT>H</DT>
    <DD>Lleva el cursor hasta el primer lugar de la parte superior de la pantalla que no est&aacute; en blanco.</DD>
  <DT>L</DT>
    <DD>Lleva el cursor hasta el primer lugar de la parte inferior de la pantalla que no est&aacute; en blanco.</DD>
  <DT>M</DT>
    <DD>Lleva el cursor hasta el primer lugar del centro de la pantalla que no est&aacute; en blanco.</DD>
  <DT>W</DT>
    <DD>Lleva el cursor hacia delante hasta el comienzo de una palabra, incluyendo los signos de
puntuaci&oacute;n.</DD>
  <DT>b</DT>
    <DD>Lleva el cursor una palabra hacia atr&aacute;s. Si el cursor se encuentra en medio de una palabra,
desplazar&aacute; el cursor hasta el primer car&aacute;cter de esa palabra.</DD>
  <DT>e</DT>
    <DD>Lleva el cursor una palabra hacia delante. Si el cursor se encuentra en medio de una palabra,
desplazar&aacute; el cursor hasta el &uacute;ltimo car&aacute;cter de esa palabra.</DD>
  <DT>h</DT>
    <DD>Mueve el cursor una posici&oacute;n hacia la izquierda.</DD>
  <DT>j</DT>
    <DD>Lleva el cursor una l&iacute;nea hacia abajo.</DD>
  <DT>k</DT>
    <DD>Lleva el cursor una l&iacute;nea hacia arriba.</DD>
  <DT>l</DT>
    <DD>Mueve el cursor una posici&oacute;n hacia la derecha.</DD>
  <DT>w</DT>
    <DD>Lleva el cursor una palabra hacia delante. Si el cursor se encuentra en medio de una palabra,
desplazar&aacute; el cursor hasta el primer car&aacute;c&atilde;er de la siguiente palabra.</DD>
</DL>
<H4><A NAME="s-mvscr">Desplazar el cursor por la pantalla</A></H4>

<DL>
  <DT>^E</DT>
    <DD>Nos lleva una l&iacute;nea hacia delante. Con una cifra, nos desplazar&aacute; el n&uacute;mero de l&iacute;neas indicado.</DD>
  <DT>^Y</DT>
    <DD>Nos lleva una l&iacute;nea hacia atr&aacute;s. Con una cifra, nos desplazar&aacute; el n&uacute;mero de l&iacute;neas indicado.</DD>
  <DT>z</DT>
    <DD>Rehace la pantalla con las opciones que se especifiquen a continuaci&oacute;n. "z&lt;enter&gt;" coloca la
l&iacute;nea actual en el extremo superior de la pantalla; "z." coloca la l&iacute;nea actual en el centro de la
pantalla; y "z-" coloca la l&iacute;nea actual en el extremo inferior de la pantalla. Si especifica una cifra
antes de la orden 'z', trasladar&aacute; la l&iacute;nea especificada al lugar se&ntilde;alado. Por ejemplo, "16z." coloca
la l&iacute;nea 16 en el centro de la pantalla.</DD>
</DL>
<H4><A NAME="s-repl">Reemplazar texto</A></H4>

<DL>
  <DT>C</DT>
    <DD>Para cambiar lo que hay a partir de la posici&oacute;n actual del cursor hasta el fin de la l&iacute;nea.</DD>
  <DT>R</DT>
    <DD>Sustituye los caracteres en pantalla por los que continuaci&oacute;n se introduzcan; para finalizar hay
que pulsar la tecla <STRONG>Esc</STRONG>.</DD>
  <DT>S</DT>
    <DD>Para cambiar una l&iacute;nea entera.</DD>
  <DT>c</DT>
    <DD>Para cambiar hasta <where>. "cc" cambia la l&iacute;nea actual. Si se especifica una cifra, cambiar&aacute; el n&uacute;mero
de l&iacute;neas especificado.</DD>
  <DT>r</DT>
    <DD>Para sustituir el car&aacute;cter sobre el que se encuentra el cursor. Especifique una cifra para sustituir
un determinado n&uacute;mero de caracteres.</DD>
  <DT>s</DT>
    <DD>Para sustituir el car&aacute;cter sobre el que se encuentra el cursor y pasar a modo <EM>insertar</EM>. Especifique
una cifra para sustituir un determinado n&uacute;mero de caracteres. Un signo de dollar ($) aparecer&aacute; en
el &uacute;ltimo car&aacute;cter a sustituir.</DD>
</DL>
<H4><A NAME="s-srch">Buscar texto o caracteres</A></H4>

<DL>
  <DT>,</DT>
    <DD>Repite las &uacute;ltimas &oacute;rdenes f, F, t or T en la direcci&oacute;n opuesta.</DD>
  <DT>/</DT>
    <DD>Busca hacia abajo, en el archivo, la secuencia especificada tras /.</DD>
  <DT>;</DT>
    <DD>Repite las &uacute;ltimas &oacute;rdenes f, F, t or T.</DD>
  <DT>?</DT>
    <DD>Busca hacia arriba, en el archivo, la secuencia especificada tras ?.</DD>
  <DT>F</DT>
    <DD>Busca en la l&iacute;nea actual, hacia atr&aacute;s, la secuencia especificada tras la orden 'F'. Si la encuentra, el
cursor se desplaza hasta ella.</DD>
  <DT>N</DT>
    <DD>Repite la &uacute;ltima b&uacute;squeda realizada mediante '/' o ¿', en la direcci&oacute;n opuesta.</DD>
  <DT>T</DT>
    <DD>Busca en la l&iacute;nea actual, hacia atr&aacute;s, el car&aacute;cter especificado tras la orden 'T'. Si lo encuentra, el
cursor se desplaza a la columna posterior a &eacute;l.</DD>
  <DT>f</DT>
    <DD>Busca en la l&iacute;nea actual el car&aacute;cter especificado tras la orden 'f'. Si lo encuentra, el cursor se
desplaza hasta &eacute;l.</DD>
  <DT>n</DT>
    <DD>Repite la &uacute;ltima b&uacute;squeda realizada mediante '/' o ¿'.</DD>
  <DT>t</DT>
    <DD>Busca en la l&iacute;nea actual el car&aacute;cter especificado tras la orden 't'. Si lo encuentra, el cursor se
desplaza hasta la columna que lo precede.</DD>
</DL>
<H4><A NAME="s-fmt">Manipulaci&oacute;n de caracteres/Formateo de l&iacute;neas</A></H4>

<DL>
  <DT>~ </DT>
    <DD>Cambia el car&aacute;cter que se encuentra bajo el cursor de may&uacute;scula a min&uacute;scula o viceversa.</DD>
  <DT>&lt;</DT>
    <DD>Desplaza el n&uacute;mero de l&iacute;neas especificado una tabulaci&oacute;n hacia la izquierda. "&lt;&lt;" desplaza la
l&iacute;nea actual hasta la izquierda, pudiendo especificarse tambi&eacute;n una cifra.</DD>
  <DT>&gt;</DT>
    <DD>Desplaza el n&uacute;mero de l&iacute;neas especificado una tabulaci&oacute;n hacia la derecha. "&gt;&gt;" desplaza la l&iacute;nea
actual hasta la derecha, pudiendo especificarse tambi&eacute;n una cifra.</DD>
  <DT>J</DT>
    <DD>Junta la l&iacute;nea actual con la siguiente. Puede especificarse una cifra para juntar un determinado
n&uacute;mero de l&iacute;neas.</DD>
</DL>
<H4><A NAME="s-save">Guardar y salir</A></H4>

<DL>
  <DT>^\</DT>
    <DD>Salir del modo "VI" y entrar en modo "EX". El editor EX es un editor de l&iacute;neas sobre el que se
ha construido el editor VI. La orden de EX para regresar a VI es ":vi".</DD>
  <DT>Q</DT>
    <DD>Salir del modo "VI" y entrar en modo "EX". El editor EX es un editor l&iacute;nea-a-l&iacute;nea. La orden de
EX para regresar a VI es ":vi".</DD>
  <DT>ZZ</DT>
    <DD>Salir del editor guardando los cambios que se hubieran hecho.</DD>
</DL>
<H4><A NAME="s-misc">Miscel&aacute;nea</A></H4>

<DL>
  <DT>^G</DT>
    <DD>Muestra el nombre del archivo actual y su estado.</DD>
  <DT>^L</DT>
    <DD>Para limpiar y rehacer la pantalla.</DD>
  <DT>^R</DT>
    <DD>Para rehacer la pantalla eliminando las l&iacute;neas err&oacute;neas.</DD>
  <DT>^[</DT>
    <DD>Igual que la tecla <STRONG>Esc</STRONG>. Cancela las &oacute;rdenes parcialmente escritas.</DD>
  <DT>^^</DT>
    <DD>Regresar al &uacute;ltimo archivo editado.</DD>
  <DT>!</DT>
    <DD>Ejecutar un <EM>shell</EM>. Si se especifica una cifra el programa que se ejecuta utilizando<where> !, tomar&aacute; la(s)
linea(s) especificadas como entrada (<EM>input</EM>) y reemplazar&aacute; dichas l&iacute;neas con el resultado obtenido
(<EM>output</EM>) del programa ejecutado. "!!" ejecuta un programa utilizando como entrada la l&iacute;nea actual.
Por ejemplo, "!4jsort" tomar&aacute; la l&iacute;nea en que se encuentra el cursor m&aacute;s las cuatro siguientes y
ejecutar&aacute; <EM>sort</EM>. Tras activar la orden aparecer&aacute; un signo de exclamaci&oacute;n donde usted podr&aacute;
escribir las instrucci&oacute;n completa.</DD>
  <DT>&amp; </DT>
    <DD>Repite la orden previa ":s".</DD>
  <DT>.</DT>
    <DD>Repite la &uacute;ltima orden que modific&oacute; el archivo.</DD>
  <DT>:</DT>
    <DD>Para comenzar a escribir una orden del editor EX. La orden se ejecutar&aacute; una vez que el usuario
pulse <STRONG>Enter</STRONG>. (V&eacute;ase el siguiente apartado.)</DD>
  <DT>@</DT>
    <DD>Imprime el comando almacenado en el b&uacute;fer especificado.</DD>
  <DT>U</DT>
    <DD>Devuelve la l&iacute;nea actual al estado en que se encontraba antes de que el cursor se colocara en ella.</DD>
  <DT>m</DT>
    <DD>Marca la posici&oacute;n actual con el car&aacute;cter especificado tras la orden 'm'.</DD>
  <DT>u</DT>
    <DD>Deshace el &uacute;ltimo cambio operado en el archivo. Pulsando &uacute;' de nuevo rehar&aacute; el cambio.</DD>
</DL>
<H4><A NAME="s-excmd">&Oacute;rdenes de EX</A></H4>

<P>El editor VI est&aacute; construido sobre otro editor, denominado EX. El editor EX s&oacute;lo edita por l&iacute;neas. Para
introducir una orden de EX desde el editor VI, deber&aacute; utilizar la orden :. La lista que ofrecemos a
continuaci&oacute;n no es completa, pero aparecen ah&iacute; las &oacute;rdenes que habitualmente m&aacute;s se emplean. Si se
quiere que una orden -como ":s" o ":w" modifique m&aacute;s de una l&iacute;nea, hay que especificar el intervalo al
que afectar&aacute; dicha orden. Por ejemplo, para hacer alguna sustituci&oacute;n entre las l&iacute;neas 3 y 15, la orden ser&iacute;a
":3,15s/<EM>esto</EM>/<EM>estotro</EM>/g".</P>

<DL>
  <DT>:ab <EM>secuencia1 secuencia2</EM></DT>
    <DD>Abreviatura. De este modo, si en VI se escribe la secuencia 1, ewl editor insertar&aacute;
autom&aacute;ticamente las palabras correspondientes (<EM>secuencia2</EM>). Por ejemplo, la orden ":ab lup
Licencia de Uso P&uacute;blico" har&iacute;a que siempre que se escribiese "lup" se insertara la expresi&oacute;n
"Licencia de Uso P&uacute;blico".</DD>
  <DT>:map <EM>teclas nueva_secuencia_de_teclas</EM></DT>
    <DD>Esto le permite que una tecla o secuencia de teclas desempe&ntilde;e la misma funci&oacute;n que determinada
tecla o secuencia de teclas.</DD>
  <DT>:q</DT>
    <DD>Salir de VI. Si se ha hecho alg&uacute;n cambio, el editor producir&aacute; un mensaje de aviso.</DD>
  <DT>:q!</DT>
    <DD>Salir de VI sin guardar los cambios.</DD>
  <DT>:s/<EM>secuencia</EM>/<EM>nueva_secuencia</EM>/<EM>opci&oacute;n</EM></DT>
    <DD>Sustituci&oacute;n. Esta orden sustituye la secuencia especificada por la <EM>nueva_secuencia</EM>. Si no se a&ntilde;ade
ninguna <EM>opci&oacute;n</EM>, s&oacute;lo sustituir&aacute; la primera aparici&oacute;n de la secuencia. Si se indica la opci&oacute;n 'g', la
sustituci&oacute;n se har&aacute; en todos los lugares en que aparezca. Por ejemplo, la orden
":1,$s/Dwayne/Dwight/g" sustituir&aacute; todo "Dwayne" por "Dwight".</DD>
  <DT>:set [all]</DT>
    <DD>Configura algunas opciones para personalizar VI y EX. La orden ":set all" muestra todas las
opciones posibles. (Cons&uacute;ltese el apartado de personalizaci&oacute;n de VI para ver algunas de ellas.)</DD>
  <DT>:una <EM>secuencia</EM></DT>
    <DD>Borra la abreviatura previamente definida por ":ab".</DD>
  <DT>:unm <EM>teclas</EM></DT>
    <DD>Borra la asignaci&oacute;n de funciones a nuevas teclas, definidas a trav&eacute;s de ":map".</DD>
  <DT>:vi <EM>nombre_de_archivo</EM></DT>
    <DD>Comienza la edici&oacute;n de un nuevo archivo. Si no han sido guardados los cambios, el editor le
avisar&aacute; de ello.</DD>
  <DT>:w</DT>
    <DD>Guarda el trabajo en el archivo actual.</DD>
  <DT>:w <EM>nombre_de_archivo</EM></DT>
    <DD>Escribe el contenido del b&uacute;fer en el archivo especificado.</DD>
  <DT>:w &gt;&gt; <EM>nombre_de_archivo</EM></DT>
    <DD>A&ntilde;ade el contenido del b&uacute;fer en el archivo especificado.</DD>
  <DT>:wq</DT>
    <DD>Escribe el contenido del b&uacute;fer y cierra el editor.</DD>
</DL>
<A NAME="lfindex18">&nbsp;</A>
<H2>Referencias</H2>


<UL>
  <LI>URL original: <A HREF="http://www.eng.hawaii.edu/Tutor/vi.html">www.eng.hawaii.edu/Tutor/vi.html</A><BR>
</LI>
  <LI>Puede bajarse VIM, una popular version de VI, en <A HREF="http://www.vim.org">www.vim.org</A><BR>
</LI>
  <LI>Puede dirigir sus preguntas y comentarios a <A HREF="mailto:ben@wiliki.eng.hawaii.edu">ben@wiliki.eng.hawaii.edu</A> (Ben Y. Yoshino)<BR>
</LI>
</UL>

<P>&Uacute;ltima actualizaci&oacute;n: 10 de diciembre de 1996<BR>
Actualizado el 27 de julio de 1995<BR>
Actualizado el 3 de octubre de 1994<BR>
Copyright &copy; 1996 University of Hawaii, College of Engineering, Computer Facility<BR>
All rights reserved.<!-- vim: set sw=4 ts=4 et: --></P>




<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=153&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Ben Y. Yoshino, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article153.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:ben@wiliki.eng.hawaii.edu"><FONT COLOR="#FFFFFF">Ben Y. Yoshino</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:inignaga@teleline.es"><FONT COLOR="#FFFFFF">Javier Fdez. Retenaga </FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-03-30, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
