<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <TITLE>lf149, Applications: Arkeia, una soluci&oacute;n comercial y profesional de almacenamiento para redes</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="[Photo of the Author]" HEIGHT=147 WIDTH=126>
<BR>por  <A HREF="mailto:gete@wanadoo.fr">Georges Tarbouriech</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Georges es un usuario viejo de Unix (comercial y gratuito).
Utiliza Arkeia para almacenar una red muy heterog&eacute;nea.
</P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Presentaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex2">Un ejemplo real</A></LI>
  <LI><A HREF="#lfindex3">M&aacute;s caracter&iacute;sticas</A></LI>
  <LI><A HREF="#lfindex4">&iquest;Entonces qu&eacute;?</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=149&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Arkeia, una soluci&oacute;n comercial y profesional de almacenamiento para redes</H2>
 <IMG SRC="../../common/images/article149/arkeia.jpg" ALT="[Illustration]" HSPACE=10 HEIGHT=64 WIDTH=64>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

Arkeia 4.2.3-1 es la &uacute;ltima versi&oacute;n de la
soluci&oacute;n de almacenamiento de redes de Knox Software
(<a href="http://www.arkeia.com">http://www.arkeia.com</A>).
Tambi&eacute;n hay una versi&oacute;n personal y gratuita disponible
con varias distribuciones de Linux.
Probablemente piensen que un software comercial no tiene
nada que hacer en LinuxFocus.
Este producto est&aacute; dedicado a los profesionales, y Linux es cada d&iacute;a m&aacute;s
utilizado en asuntos profesionales. Entonces...
<br></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>


<p>
La administraci&oacute;n de redes es un trabajo que consta de mil tareas. Una de
ellas es el almacenamiento. La cantidad de datos va aumentando,
particularmente hoy que tenemos
discos duros muy gordos, aplicaciones de tama&ntilde;o importante y muchos m&aacute;s usuarios.
La estrategia de almacenamiento ha tenido que evolucionar
hacia algo m&aacute;s sofisticado, si comparamos
con lo que era hace diez a&ntilde;os.
En esa &eacute;poca era posible utilizar un streamer (lector de cintas) conectado
a un servidor, usando para almacenar mandatos de
como dump, cpio o find (-cpio es una opci&oacute;n de find).
Esa es todav&iacute;a una soluci&oacute;n si el n&uacute;mero de servidores, clientes o
aplicaciones no se han visto multiplicados.

<P>
Si la red ha "crecido" tendr&aacute;n que encontrar una soluci&oacute;n mejor.
Y cuando decimos mejor, tendr&iacute;amos que decir m&aacute;s r&aacute;pida.
Hay que encontrar una buena manera de hacer este trabajo.
Si la red tiene muchos sistemas
operativos diferentes, vuelve a ser bastante dif&iacute;cil
encontrar la
"mejor". &iexcl;Como de costumbre, la "mejor" tiene que ser buena, bonita y
barata! Siempre es un compromiso, y lo mejor para uno no lo es para otro.
As&iacute;, lo primero a considerar son las necesidades: software, hardware...
Hay muchos productos disponibles, pero la mayor&iacute;a es software propietario y
muy caro (lo que es un eufemismo). Y no olvidemos
la parte hardware: por lo menos necesitan algun streamer o autom&aacute;ta.
Para acabar, tienen que saber qu&eacute; m&aacute;quina podr&aacute; desempe&ntilde;ar el papel de
servidor de almacenamiento.
 Este servidor necesita un disco duro gordo, muchos recursos (memoria,
CPU) y puertos SCSI.
Tiene que ser capaz de administrar varios almacenamientos al mismo tiempo.
<br>
&iquest;A donde ir desde aqu&iacute;?
</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>Presentaci&oacute;n</H2>

<p>
<strong>La elecci&oacute;n de Arkeia</strong>
</p>
Muchas empresas importantes "ofrecen" soluciones de almacenamiento de redes como
hemos mencionado antes.
Arkeia ha sido seleccionado primero por su soporte de muchos SO.
Los servidores de almacenamiento pueden ser: AIX 4.1,
DEC Alpha Unix 4.0, HP-UX 10, IRIX 6.2 (y posteriores),
Linux 2.* (x86), Solaris 2.5 (y posteriores) y NT 4.0 Server (Intel).
Clientes de almacenamiento pueden ser los mismos que los servidores m&aacute;s otros tal como
SCO v5 (Intel), BSD 3.0, 4.0, Novell 4.11, FreeBSD 2.2.6, Windows 95, 98, NT 4.0 Server (Alpha)
y NT 4.0 Workstation (Intel).
Esta lista no es exhaustiva y puede cambiar en todo momento.
Consultar <a href="http://www.arkeia.com">http://www.arkeia.com</A> para tener m&aacute;s informaci&oacute;n.
La mayor&iacute;a de los servidores tienen un interf&aacute;z gr&aacute;fico,
basado en Xlib (librer&iacute;as propietarias)
para Unix, y en Java para los productos Microsoft.
</P>

<P>
La segunda raz&oacute;n para elegir Arkeia fue el precio. No podemos dar ninguno porque
depende de la red, del n&uacute;mero y del tipo de servidores y clientes, si tienen autom&aacute;tas o no
(en &eacute;ste caso, tendr&aacute;n que comprar una licencia para la librer&iacute;a que administra
el autom&aacute;ta).
Conectar con el site de Arkeia permite obtener un presupuesto seg&uacute;n la configuraci&oacute;n
de la red.
La raz&oacute;n final era la administraci&oacute;n de los streamers. Arkeia puede administrar casi
cualquier tipo de streamer: DAT. EXABYTE, QIC...
Y como ten&iacute;amos varios streamers QIC, &eacute;ste era un problema menos.
</p>

<p>
<strong>&iquest;A qu&eacute; parece?</strong>
</p>

<p>
<A HREF="../../common/images/article149/adm.jpg"><IMG SRC="../../common/images/article149/adm.jpg" ALT="adm.jpg" ALIGN=TEXTTOP></A></TD>
<br>
La ventana principal
</p>
<p>
Como hemos visto antes, Arkeia utiliza una GUI en el servidor.
Se entra en Arkeia con una ventana de login que permite el acceso a las
ventanas espec&iacute;ficas que administran el
almacenamiento. Estas ventanas se pueden abrir desde un
men&uacute;, un men&uacute; contextual o
pinchando en iconos.
Todo eso puede ser configurado seg&uacute;n los propios gustos (fondos de
pantallas
predefinidos, colores preferidos).
No hay mucho m&aacute;s que decir, puesto que todo es evidente y muy amigable.
En Unix, el GUI funciona con casi todos los gestores de ventanas.
En las cosas de Microsoft, tendr&aacute;n que instalar la JVM (Java Virtual
Machine) del mismo Microsoft
antes de poder utilizar el GUI.
Para concluir, el GUI es muy pr&aacute;ctico, les guste su aparencia o no.
</p>

<p>
<strong>&iquest;C&oacute;mo funciona?</strong>
</P>
<p>
Arkeia utiliza una technolog&iacute;a de almacenamiento paralelo tr&aacute;s una red TCP/IP.
Un servidor de almacenamiento administra los streamers y recoge los datos
de los clientes usando multi-flujo. Funciona seg&uacute;n el modelo
cliente/servidor usando  memoria repartida y cola de mensaje. IPC (Inter
Process Communication) tiene que estar perfectamente configurado en el
servidor de almacenamiento. El manual avanzado ense&ntilde;ar&aacute; c&oacute;mo refinar la
configuraci&oacute;n del servidor. La instalaci&oacute;n es muy l&oacute;gica: tienen
que colocar el software servidor y cliente en el servidor de
almacenamiento, y el software cliente en los clientes.&iexcl;Hasta ah&iacute;, todo va
bien!
En el servidor tienen que definir todo lo relacionado con streamers,
conjuntos de pilotos (drivepacks),  conjuntos de cintas (tape pools),
cintas y conjuntos de almacenamiento (savepacks).
</P>

<p>
- Conjuntos de pilotos: la primera etapa del proceso de configuraci&oacute;n.
<font colour="red">(Definicion de dispositivos)</FONT>
<br>
Seleccionando "Drives management" desde el men&uacute; "Devices", tienen que dar
un nombre al streamer, sus autorizaciones (leer, escribir, limpiar y
suprimir) y por supuesto su piloto. Eso depende del sistema: por ejemplo
/dev/rmt/1h en Solaris o /dev/rmt/tps1d2 en Irix o /dev/st0 en Linux.
Tienen que definir cada streamer y el piloto correspondiente.
Supongamos que tenemos cuatro streamers QIC conectados a un servidor O2
(Irix 6.5): El primero podr&iacute;a ser llamado QICuno con el piloto
/dev/rmt/tpd1d2, el segundo QICdos con el piloto /dev/rmt/tps1d3, etc.
El "1" despu&eacute;s de "tps" es el n&uacute;mero del  controlador SCSI y el "2"
despu&eacute;s de "d" es la ID del streamer. Por eso tendr&aacute;n que conocer todo lo
que concierne ID SCSI, "daisy chains"... Si tienen un autom&aacute;ta, el proceso
de configuraci&oacute;n es casi igual, y la documentaci&oacute;n informa de todo
lo necesario.
<br>
- Conjuntos de pilotos (Drivepacks):
<br>
Desde el mismo men&uacute;, se selecciona "Drivepacks" y se crea un drivepack
correspondiente al streamer. Siguiendo con el ejemplo precedente, tienen
un streamer llamado QICuno. Pueden llamar el drivepack
QICuno Pack. Hagan lo mismo por cada streamer ya definido.
Ahora, cada drivepack tiene que corresponder a su streamer. Basta con seleccionar el streamer y el drivepack
correspondiente.
<br>
- Conjuntos de cintas (Tape pool):
<br>
Esta etapa permite crear tantos conjuntos como sea
necesario. Desde el men&uacute; "Tapes management", seleccionen
"Pools management". Pinchando en el icono "New"
y llenando el campo se crea un conjunto.
<br>
- Cintas:
<br>
Cada conjunto necesita contener una o m&aacute;s cintas. La ventana "Tapes in
pool" puede ser llamada con un  doble-pinchando en el pool. Seleccionar
"New" abre la ventana "Create tape". Basta con llenar los campos. Por
cierto, hay una ayuda en linea muy pr&aacute;ctica (una por cada ventana)
indicando qu&eacute; hacer.
<br>
- Conjuntos de almacenamiento (Savepacks):
<br>
Por &uacute;ltimo, se necesita crear uno o m&aacute;s savepacks. Estos contienen el
&aacute;rbol a almacenar por un cliente dado. Se puede circular por el &aacute;rbol con
un navegador para seleccionar directorios o ficheros. Hay que repetir
la operaci&oacute;n
por cada cliente y cada &aacute;rbol que almacenar.

<p>
Ahora, est&aacute;n listos por un almacenamiento interactivo de varios clientes
al mismo tiempo.
<br>
Vamos a la cruda realidad.
</p>

<A NAME="lfindex2">&nbsp;</A>
<H2>Un ejemplo real</H2>


<p>
Tenemos una red un poco rara con cuatro servidores que almacenar.
El servidor de almacenamiento es un SGI O2, y los clientes son un servidor de aplicaciones
Sun con Solaris 2.6, un servidor de communicaciones Linux con RH6.0, y dos servidores de
aplicaciones bajo NT4.0 Server.
Vamos a almacenar interactivamente las cuatro m&aacute;quinas.
Creamos los cuatro streamers: los llamamos QIC Sun, QIC Linux, QIC Pcsvr y QIC Pcdev.
&iquest;Muy original, no?
Ahora definimos los cuatro pilotos: QIC Sun en /dev/rmt/tps1d4, QIC Linux en /dev/rmt/tps1d5,
QIC Pcsvr en /dev/rmt/tps1d3 y QIC Pcdev en /dev/rmt/tps1d2.
Pueden ver que la originalidad va creciendo.
Les damos todos los derechos: somos el administrador y trabajamos como root.
Muy feo, &iquest;no?
Despu&eacute;s creamos los drivepacks correspondientes: Sun Pack, Linux Pack, Pcsvr Pack and Pcdev Pack,
una vez m&aacute;s con mucha imaginaci&oacute;n.
Ahora, los conjuntos de cintas: como de costumbre, Sun Pool, Linux Pool, Pcsvr Pool and Pcdev Pool.
Creamos un conjunto para cada pack. Eso es una elecci&oacute;n personal. Podr&iacute;an crear s&oacute;lo un conjunto
con cuatro cintas.
Si el conjunto contiene varias cintas, Arkeia administra los streamers. Es decir, si no dan una prioridad
a cada streamer, Arkeia selecciona lo que quiere almacenar y donde lo almacena.
Es probablemente lo que menos me gusta.
Por fin, definimos una cinta en cada conjunto: otra vez, Sun Tape, Linux
Tape, Pcsvr Tape and Pcdev Tape.
No se preocupen, eso se hace s&oacute;lo una vez. Podr&aacute;n usarlo todo cada vez que
lo necesiten. Queremos un almacenamiento completo para cada servidor, y
definimos los savepacks: Sun, Linux, Pcsvr and Pcdev ser&aacute;n los apellidos.

<p>
Arkeia esta correctamente instalado en los clientes. As&iacute; pueden ver cada
m&aacute;quina en el navegador. Para seleccionarlas, pinchen en la caja
correspondiente. Ahora arrancamos el almacenamiento interactivo.
Seleccionen el men&uacute; "Interactive backup". En la nueva ventana, elijan un
savepack, un drivepack y un pool para cada servidor.
En nuestro ejemplo, para almacenar el Sun, el savepack es Sun, el drivepack es Sun Pack y
el pool es Sun Pool. Seleccionen un tipo de almacenamiento (total en el ejemplo, pero hubieramos
podido decir incremental), la estrategia para la cinta (nueva cinta en &eacute;ste caso, pero una
alternativa  ser&iacute;a completar una cinta) y utilizar email o no (como le
de la gana).
Pinchar en el icono de validaci&oacute;n arranca el almacenamiento del Sun.
Repiten esa etapa esa por cada servidor y ya est&aacute;. Cuatro
almacenamientos se hacen al mismo tiempo
y pueden ir a tomar un caf&eacute;.
<p>
<A HREF="../../common/images/article149/linux.jpg"><IMG SRC="../../common/images/article149/linux.jpg" ALT="linux.jpg" ALIGN=TEXTTOP></A></TD>
<br>
La ventana de almacenamiento
</p>

<p>
Unos 40 minutos m&aacute;s tarde ya acab&oacute;.
Cosas importantes: la red es una categor&iacute;a 5... pero en obras. Significa: los cables no son todos de cat 5,
los hubs son 10 o 10/100Mb, s&oacute;lo unas m&aacute;quinas tienen verdaderas tarjetas
de 100Mb... Sin embargo, hemos almacenado alrededor de 3Gb y unos 150000
ficheros en unos 40 minutos. En una verdadera red cat 5, eso hubiera sido
por lo menos 3 veces m&aacute;s r&aacute;pido. La velocidad depende de muchos
elementos: red, ordenadores, streamers, tama&ntilde;o de las cintas.
Nuestro ejemplo es un caso particular y no refleja la fant&aacute;stica velocidad que pueden alcanzar
en ciertas configuraciones. Si la red es una verdadera cat 5, si tienen autom&aacute;tas, si utilizan DAT,
si los ordenadores s&oacute;n muy r&aacute;pidos... pueden esperar unos 70 Mb/min. En nuestro ejemplo, la media
es alrededor de 25 Mb/min.
Eso para cada almacenamiento. Considerando que est&aacute;n hechos al mismo tiempo da unos 100Mb/min.
</p>

<p>
<A HREF="../../common/images/article149/linuxlog.jpg"><IMG SRC="../../common/images/article149/linuxlogth.jpg" ALT="linuxlog.jpg" HEIGHT=120 WIDTH=180 ALIGN=TEXTTOP></A></TD>
<A HREF="../../common/images/article149/pcdevlog.jpg"><IMG SRC="../../common/images/article149/pcdevlogth.jpg" ALT="pcdevlog.jpg" HEIGHT=120 WIDTH=180 ALIGN=TEXTTOP></A></TD>
<A HREF="../../common/images/article149/pcsvrlog.jpg"><IMG SRC="../../common/images/article149/pcsvrlogth.jpg" ALT="pcsvrlog.jpg" HEIGHT=120 WIDTH=180 ALIGN=TEXTTOP></A></TD>
<A HREF="../../common/images/article149/sunlog.jpg"><IMG SRC="../../common/images/article149/sunlogth.jpg" ALT="sunlog.jpg" HEIGHT=120 WIDTH=180 ALIGN=TEXTTOP></A></TD>
<br>
Logs
</p>

<p>
No obstante, una manera interesante de entender la eficiencia de Arkeia es comparar con la
estrategia precedente con el mismo hardware. Antes de utilizar Arkeia, los
almacenamientos se hac&iacute;an desde cada ordenador, con cada streamer conectado
al puerto SCSI. Hablando de los mismos ordenadores y de los mismos
streamers, el beneficio representa un 50%. Almacenamiento del Sun con su
propio streamer: 1 hora; con Arkeia: 38 minutos.
Almacenamiento de Pcdev con su propio streamer: m&aacute;s de 1 hora; con Arkeia: 32 minutos. Etc...
No olvidemos almacenar el servidor de almacenamiento: &eacute;sta vez no usamos la red, y es un poco
m&aacute;s lento (alrededor de 22Mb/min).
Seg&uacute;n Arkeia, con el hardware correcto, se puede almacenar
128 m&aacute;quinas en 32 streamers en paralelo. No pude probar tal
configuraci&oacute;n... Donde trabajo somos muy pobres.

<p>
No se puede hablar de almacenamiento sin mencionar restauraci&oacute;n.
Podemos comentarla con una frase muy corta:
es tan  f&aacute;cil y r&aacute;pida como el almacenamiento. Usando el navegador
pueden restaurar lo que quieran y
donde quieran. Es decir, pueden restaurar en otros directorios o
m&aacute;quinas.
</p>

<p>
<A NAME="lfindex3">&nbsp;</A>
<H2>M&aacute;s caracter&iacute;sticas</H2>

<p>
No hemos hablado de los almacenamientos peri&oacute;dicos. Obviamente, Arkeia
es capaz de administrar almacenamientos
programados para arrancar a una hora espec&iacute;fica. Bajo Unix, usar&aacute; cron y con los productos Microsoft ser&aacute;
un servicio. Pueden definir intervalos diferentes para almacenamiento
peri&oacute;dico: d&iacute;a, semana, mes... Es posible administrar tres niveles para
cada almacenamiento. Por ejemplo, quieren programar un almacenamiento
peri&oacute;dico para un mes. Nivel 1 corresponde a un almacenamiento mensual,
nivel 2 es semanal y nivel 3 es diario. Eso quiere decir, el nivel 3
funcionar&aacute; 6 veces a la semana, el nivel 2 lo har&aacute; 3 veces al mes, y  el
1 s&oacute;lo una vez. El resultado: necesitar&aacute;n muchas cintas y tantos
streamers como servidores que almacenar. A menos que ense&ntilde;an al perro c&oacute;mo
cambiar las cintas de noche entre los almacenamientos... Aparte de eso,
funciona como el almacenamiento interactivo. Hay mucho que decir sobre almacenamiento peri&oacute;dico,
pero necesitar&iacute;amos un art&iacute;culo entero. Podemos decir, es probablemente una de las carater&iacute;sticas m&aacute;s
importante de Arkeia. Otro punto de inter&eacute;s concierne a los logs. Tienen logs
para todo: cintas, streamers, almacenamientos... Eso emplea bastante
espacio en el disco, pero es muy &uacute;til. Estos logs est&aacute;n muy
bien organizados y dan mucha informaci&oacute;n. Arkeia los administra de una
manera muy pr&aacute;ctica archivandolos por mes.
</p>

<p>
<br>
<A HREF="../../common/images/article149/avlog.jpg"><IMG SRC="../../common/images/article149/avlog.jpg" ALT="avlog.jpg" ALIGN=TEXTTOP></A></TD>
<br>
La ventana de los logs disponibles
</p>

<p>
La ayuda en l&iacute;nea tambi&eacute;n merece ser mencionada. Pueden trabajar con Arkeia sin
leer toda la documentaci&oacute;n, salvo que quieran entrar en administraci&oacute;n
avanzada, por supuesto. La documentaci&oacute;n est&aacute; contenida en el CD-Rom del
programa en formato PDF, permitiendo imprimirla f&aacute;cilmente para
crear sus propios manuales. Esta documentaci&oacute;n contiene informaci&oacute;n
importante sobre configuraci&oacute;n espec&iacute;fica de m&aacute;quinas, seguridad,
problemas, utilidades, librer&iacute;as de autom&aacute;tas... Si necesitan m&aacute;s, hay una
lista de correo dedicada a Arkeia.
</p>

<A NAME="lfindex4">&nbsp;</A>
<H2>&iquest;Entonces qu&eacute;?</H2>

<p>
Este art&iacute;culo no puede ser exhaustivo. Habr&iacute;a muchas cosas
que decir sobre el software.  Arkeia no ha intentado reinventar la rueda,
pero usa todo lo que permite mejorar el rendimiento. IPC es una de las
llaves. Otra vez, gracias a Unix. Tenemos que mencionar la versi&oacute;n
personal y shareware para Linux. Est&aacute; dedicada a uso no comercial. Nada
impide que la prueban en su red privada. Es shareware, y debemos decir que
si mandan una contribuci&oacute;n de 20$ o m&aacute;s, el 25% ser&aacute;n dado a Software in
the Public Interest. Otra cosa que mencionar: compr&eacute; Arkeia en la Divisi&oacute;n
Europea. La persona encargada sabe muy bien de qu&eacute; habla y hace un trabajo
estupendo (hola Sandy). Esta empresa es la primera entre las numerosas con
que trabajo, que ha tratado todo el asunto por e-mail. Ni fax, ni correo
postal excepto para el paquete del software. &iexcl;&iexcl;&iexcl;Y por fin, s&oacute;lo mandando
TEXTO!!!
<br>
Totalmente fuera del asunto, pero estoy hasta las narices de todos estos
documentos Word o Excel circulando a trav&eacute;s de Internet. Primero,
est&aacute;n llenos de macro viruses potenciales. Segundo, todo el mundo en esta
tierra NO es obligado a tener Word o Excel (&iquest;C&oacute;mo trabaj&aacute;bamos antes?).
Tercero, un texto es 10 o 100 veces m&aacute;s peque&ntilde;o que su equivalente
documento Word, y a una &eacute;poca en la cual el "bandwidth" en Internet es
cuando menos muy estrecho, el tama&ntilde;o parece una cosa importante.
<br>
&iexcl;Perd&oacute;n por la digresi&oacute;n esa! Ahora que voy a tener muchos amigos nuevos,
volvemos a Arkeia. Creo que Arkeia es una buena soluci&oacute;n de almacenamiento
de redes. No me gusta todo, pero &eacute;sta gente trabaja muy duro para mejorar
el producto. Personalmente, me gustar&iacute;an m&aacute;s funcionalidades en lo que
respecta a la administraci&oacute;n de cintas, como la posibilidad de decidir
cuantas cintas quiero utilizar en una estrategia o la de escribir encima
del contenido de una cinta durante el almacenamiento. &iexcl;En una palabra, me
gustar&iacute;a ser el jefe! El precio tambi&eacute;n es un elemento importante a la
hora de elegir. Arkeia parece muy competitivo en este aspecto. Si buscan
este tipo de herramientas, no olviden probar &eacute;sta. Si ya conocen Arkeia
a trav&eacute;s de alguna distribuci&oacute;n Linux, pueden ir a
<a href="http://www.arkeia.com">http://www.arkeia.com</A>
para aprender m&aacute;s sobre el producto.
<br>
&iexcl;Vivimos una &eacute;poca tremenda!
</p>


<!-- vim: set sw=2 ts=2 et: -->

<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=149&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article149.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:gete@wanadoo.fr"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:gete@wanadoo.fr"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>es</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-03-30, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
