<HTML>
<HEAD>
<TITLE>C&oacute;mo pasar de DOS a Linux.: Ficheros y Programas</TITLE>
</HEAD>
<BODY>
<A HREF="Dos-a-Linux-Como-1.html">Anterior</A>
<A HREF="Dos-a-Linux-Como-3.html">Siguiente</A>
<A HREF="Dos-a-Linux-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Ficheros y Programas</A></H2>

<H2><A NAME="ss2.1">2.1 Ficheros: Nociones preliminares</A></H2>


<P>Linux tiene un sistema de ficheros ---la estructura de directorios y los
ficheros que contienen--- muy similar al del DOS. Los ficheros tienen
nombres que obedecen unas normas especiales, est&aacute;n guardados en
directorios y algunos son ejecutables, y entre &eacute;stos , la mayor&iacute;a tiene
opciones en la l&iacute;nea de comandos. Incluso puede utilizar comodines,
redirecci&oacute;n y tuber&iacute;as como en DOS. S&oacute;lo hay unas pocas diferencias: </P>
<P>
<UL>
<LI>bajo DOS, los nombres de ficheros est&aacute;n en el llamado formato 8.3; 
por ejemplo <CODE>NOTENOUG.TXT</CODE>. Bajo Linux podemos hacerlo mejor. Si
instal&oacute; Linux usando un sistema de ficheros tal como <I>ext2</I> o
<I>umsdos</I>, puede utilizar nombres m&aacute;s largos (hasta 255 caracteres), y
con m&aacute;s de un punto en ellos: por ejemplo,
<CODE>Este.es.un.nombre.de.fichero.MUY.largo</CODE>.  D&eacute;se cuenta de que he
utilizado tanto may&uacute;sculas como min&uacute;sculas: en efecto... 
 </LI>
<LI>Linux es sensible a las may&uacute;sculas y las min&uacute;sculas en los nombres
de ficheros o comandos. De hecho, <CODE>FICHERO.tar.gz</CODE> ,
<CODE>Fichero.tar.gz</CODE> y <CODE>fichero.tar.gz</CODE> son tres ficheros distintos.
<CODE>ls</CODE> es un comando, <CODE>LS</CODE> ser&iacute;a un error; 
</LI>
<LI>no hay extensiones obligadas como <CODE>.COM</CODE> y <CODE>.EXE</CODE> para los
programas, o <CODE>.BAT</CODE> para los ficheros de procesamiento por lotes. Los
ficheros ejecutables se marcan con un asterisco. Por ejemplo: 

<BLOCKQUOTE><CODE>
<PRE>
$ ls -F
cindy.jpg    cjpg*    Soy_un_directorio/  mi_1er_script*  old~
</PRE>
</CODE></BLOCKQUOTE>


Los ficheros <CODE>cjpg*</CODE> y <CODE>mi_1er_script*</CODE> son "programas" 
ejecutables. Bajo DOS, las copias de seguridad de los ficheros suelen
acabar en <CODE>.BAK</CODE>, mientras que bajo Linux acaban con un gurru&ntilde;o
~. Un fichero cuyo nombre empieza con un punto es considerado como
oculto. Ejemplo: el fichero <CODE>.Soy.un.fichero.oculto</CODE> no se mostrar&aacute;
a un comando <CODE>ls</CODE>; 
</LI>
<LI>Las opciones de los programas bajo DOS se obtienen con
<CODE>/opci&oacute;n</CODE>. En Linux se obtienen con <CODE>-opci&oacute;n</CODE> o <CODE>--opci&oacute;n</CODE>. 
Ejemplo: <CODE>dir /s</CODE> se convierte en <CODE>ls -R</CODE>. F&iacute;jese en que
muchos programas DOS (como <CODE>PKZIP</CODE> o <CODE>ARJ</CODE>) utilizan opciones de
tipo Unix.
</LI>
</UL>
</P>
<P>Puede ahora saltar a las Secci&oacute;n 
<A HREF="#Traduciendo">Traduciendo</A>, pero yo de usted
seguir&iacute;a leyendo.</P>


<H2><A NAME="ss2.2">2.2 Enlaces simb&oacute;licos</A></H2>


<P>Unix tiene un tipo de fichero que no existe bajo DOS: el enlace simb&oacute;lico. 
Puede pensar que es un puntero o enlace a un fichero o a un directorio y
que puede utilizarse en lugar del fichero o del directorio al que apunta;
es similar a los "Accesos Directos" de Windows 95. Ejemplos de enlaces
simb&oacute;licos son <CODE>/usr/X11</CODE>, que apunta a <CODE>/usr/X11R6</CODE>; 
<CODE>/dev/modem</CODE>, que apunta a <CODE>/dev/cua0</CODE> o a
<CODE>/dev/cua1</CODE>, seg&uacute;n donde est&eacute; el m&oacute;dem.</P>
<P>Para crear un enlace simb&oacute;lico:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ ln -s &lt;fichero_o_directorio&gt; &lt;nombre_del_enlace&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ejemplo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ ln -s /usr/doc/g77/DOC g77manual.txt
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ahora puede referirse a <CODE>g77manual.txt</CODE> en lugar de
<CODE>/usr/doc/g77/DOC</CODE>. </P>


<H2><A NAME="Permisos"></A> <A NAME="ss2.3">2.3 Permisos y Propiedades</A></H2>


<P>Los ficheros y directorios de DOS tienen los siguientes atributos: <CODE>A</CODE>
(fichero), <CODE>H</CODE> (oculto), <CODE>R</CODE> (s&oacute;lo-lectura), y <CODE>S</CODE> (sistema). 
S&oacute;lo <CODE>H</CODE> y <CODE>R</CODE> tienen sentido bajo Linux: los ficheros ocultos
comienzan con un punto, y los de s&oacute;lo lectura, tienen activado el permiso
"<CODE>r</CODE>". </P>
<P>Bajo Unix un fichero tiene <I>permisos</I> y un propietario, que pertenece a
un grupo. Mire este ejemplo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ ls -l /bin/ls
-rwxr-xr-x  1  root  bin  27281 Aug 15 1995 /bin/ls*
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El primer campo contiene los permisos del fichero <CODE>/bin/ls</CODE>, que
pertenece a <CODE>root</CODE>, del grupo <CODE>bin</CODE>. Dejando la informaci&oacute;n restante
a un lado (el libro de Matt esta ah&iacute; para ese prop&oacute;sito), s&oacute;lo recordar&eacute;
lo que significa <CODE>-rwxr-xr-x</CODE> (de izquierda a derecha):</P>
<P><CODE>-</CODE> es el tipo de fichero (<CODE>-</CODE> = fichero normal, <CODE>d</CODE> =
directorio, <CODE>l</CODE> = enlace, etc.); <CODE>rwx</CODE> son los permisos del
propietario del fichero (leer, escribir, ejecutar); <CODE>r-x</CODE> son los
permisos para el grupo del propietario del fichero (leer y ejecutar); (no
tocar&eacute; el concepto de grupo, puede pasar sin &eacute;l mientras sea un novato ;-) 
<CODE>r-x</CODE> son los permisos para todos los dem&aacute;s usuarios (leer, ejecutar).</P>
<P>A eso se debe el porqu&eacute; no puede borrar el fichero <CODE>/bin/ls</CODE> a
menos que sea root:  no tiene el permiso de escritura para hacer eso. Para
cambiar los permisos de un fichero, el comando es: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        
$ chmod &lt;quienXperm&gt; &lt;fichero&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>donde <CODE>quien</CODE> podr&iacute;a ser:</P>
<P>
<UL>
<LI><CODE>u</CODE> usuario, que es el propietario,</LI>
<LI><CODE>g</CODE> (grupo), </LI>
<LI><CODE>o</CODE> (otros).</LI>
</UL>
</P>
<P><CODE>X</CODE> puede ser tanto <CODE>+</CODE> como <CODE>-</CODE>, y  <CODE>perm</CODE> puede ser:</P>
<P>
<UL>
<LI><CODE>r</CODE> (lectura), </LI>
<LI><CODE>w</CODE> (escritura)</LI>
<LI><CODE>x</CODE> (ejecuci&oacute;n). </LI>
</UL>
</P>
<P>Ejemplos: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ chmod u+x fichero
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>esto habilita el permiso de ejecuci&oacute;n para el propietario del fichero.
Atajo: <CODE>chmod +x fichero</CODE>. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ chmod go-wx fichero
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>esto quita el permiso de escritura y de ejecuci&oacute;n para todo el mundo menos
al usuario. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ chmod ugo+rwx fichero
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>esto le da a todo el mundo el permiso de lectura, escritura y ejecuci&oacute;n. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ chmod +s fichero
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>esto convierte al fichero en <I>setuid</I> o <I>suid</I>, esto es, un fichero
que al ejecutarse lo hace con privilegios de root. </P>
<P>Una manera m&aacute;s corta de referirse a los permisos es con n&uacute;meros: 
<CODE>rwxr-xr-x</CODE> puede ser expresado como <CODE>755</CODE> (cada letra corresponde a
un bit: <CODE>---</CODE> es <CODE>0</CODE>, <CODE>--x</CODE> es <CODE>1</CODE>, <CODE>-w-</CODE> es <CODE>2</CODE>,
<CODE>-wx</CODE> es <CODE>3</CODE>...). Parece dif&iacute;cil, pero con algo de pr&aacute;ctica el
concepto se domina.</P>
<P><CODE>root</CODE>, al ser superusuario, puede cambiar los permisos de los ficheros
de todo el mundo. Hay mucha m&aacute;s informaci&oacute;n acerca de esto:  LPM. </P>


<H2><A NAME="Traduciendo"></A> <A NAME="ss2.4">2.4 Traduciendo comandos de DOS a Linux</A></H2>


<P>A la izquierda, los comandos de DOS; a la derecha, sus correspondientes de
Linux. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
COPY:         cp
DEL:          rm
MOVE:         mv
REN:          mv
TYPE:         more, less, cat
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Operadores de redirecci&oacute;n y de tuber&iacute;as: </P>
<P><CODE>&lt; &gt; &gt;&gt;  |</CODE></P>
<P>Comodines: <CODE>* ?</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
nul: /dev/null

prn, lpt1:  /dev/lp0 o /dev/lp1; lpr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>EJEMPLOS</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
DOS                                     Linux
---------------------------------------------------------------------

C:\GUIDO&gt;copy joe.txt joe.doc           $ cp joe.txt joe.doc
C:\GUIDO&gt;copy *.* total                 $ cat * &gt; total
C:\GUIDO&gt;copy fractals.doc prn          $ lpr fractals.doc
C:\GUIDO&gt;del temp                       $ rm temp
C:\GUIDO&gt;del *.bak                      $ rm *~
C:\GUIDO&gt;move paper.txt tmp\            $ mv paper.txt tmp/
C:\GUIDO&gt;ren paper.txt paper.asc        $ mv paper.txt paper.asc
C:\GUIDO&gt;print letter.txt               $ lpr letter.txt
C:\GUIDO&gt;type letter.txt                $ more letter.txt
C:\GUIDO&gt;type letter.txt                $ less letter.txt
       idem                             $ more *.txt *.asc
       idem                             $ cat section*.txt | less
C:\GUIDO&gt;type letter.txt &gt; nul          $ cat letter.txt &gt; /dev/null
</PRE>
</CODE></BLOCKQUOTE>

Notas:</P>
<P>
<UL>
<LI><CODE>*</CODE> es m&aacute;s inteligente bajo Linux: <CODE>*</CODE> equivale a todos los
ficheros excepto los ocultos; <CODE>.*</CODE> equivale a todos los ficheros
ocultos;  <CODE>*.*</CODE> equivale s&oacute;lo a aquellos ficheros que tienen un punto
en medio del nombre, seguido de otros caracteres; <CODE>p*r</CODE> equivaldr&iacute;a
tanto a <CODE>peor</CODE> como a <CODE>por</CODE>;  <CODE>*c*</CODE> equivaldr&iacute;a tanto a
<CODE>pecado</CODE> como a <CODE>peca</CODE>. 
</LI>
<LI>cuando se usa <CODE>more</CODE>, pulse espacio para ir leyendo a trav&eacute;s del
fichero, <CODE>q</CODE> o Ctrl-C para salir. <CODE>less</CODE> es m&aacute;s intuitivo y permite
utilizar las teclas del cursor;
</LI>
<LI>no hay <CODE>UNDELETE</CODE>, as&iacute; que pi&eacute;nselo dos veces antes de borrar
cualquier cosa;
</LI>
<LI>adem&aacute;s de los &lt; &gt; &gt;&gt; del DOS, Linux tiene el operador
<CODE>2&gt;</CODE> para redirigir los mensajes de error (stderr); m&aacute;s a&uacute;n, el
operador <CODE>2&gt;&amp;1</CODE> redirige stderr a stdout (la salida est&aacute;ndar),
mientras que <CODE>1&gt;&amp;2</CODE> redirige stdout a stderr;
</LI>
<LI>Linux tiene otro comod&iacute;n: los corchetes <CODE>[]</CODE>. Usar <CODE>[abc]*</CODE>
equivale a los ficheros que empiezan por <CODE>a</CODE>, por <CODE>b</CODE> o por <CODE>c</CODE>; 
<CODE>*[I-N,1,2,3]</CODE> equivale a los ficheros que acaban por <CODE>I, J, K, L,
M, N, 1, 2, 3</CODE>;
</LI>
<LI>no hay un <CODE>RENAME</CODE> como en DOS; esto es, <CODE>mv *.xxx *.yyy</CODE> no
funciona;
</LI>
<LI>use <CODE>cp -i</CODE> y <CODE>mv -i</CODE> para ser avisado cuando un fichero vaya
a ser sobreescrito. </LI>
</UL>
</P>


<H2><A NAME="ss2.5">2.5 Ejecuci&oacute;n de programas: Multitarea y Sesiones</A></H2>


<P>Para ejecutar un programa, escriba su nombre tal y como lo har&iacute;a bajo DOS. 
Si el directorio (Secci&oacute;n 
<A HREF="Dos-a-Linux-Como-3.html#Directorios">Directorios</A>) donde el programa est&aacute;
guardado est&aacute; incluido en la variable de entorno <CODE>PATH</CODE> (Secci&oacute;n 
<A HREF="Dos-a-Linux-Como-5.html#Inicializacion">Inicializacion</A>), el programa comenzar&aacute; a ejecutarse. Excepci&oacute;n: al
contrario que bajo DOS, en Linux un programa localizado en el directorio
actual no se ejecutar&aacute; a manos que el directorio actual (simbolizado por
``<CODE>.</CODE>'') est&eacute; incluido en el PATH. Para evitarlo, suponiendo que el
programa se llame <CODE>prog</CODE>, teclee <CODE>./prog</CODE>.</P>
<P>&Eacute;ste es el aspecto t&iacute;pico de una l&iacute;nea de comandos:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ comando -o1 -o2 ... -on par1 par2 ... parn  &lt; input &gt; output
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>donde <CODE>-o1</CODE>, ..., <CODE>-on</CODE> son las opciones del programa, <CODE>par1</CODE>,
..., <CODE>parn</CODE> son los par&aacute;metros del programa. Puede encadenar varios
comandos en la l&iacute;nea de comandos: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ comando1 ; comando2 ; ... ; comandoN
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto es todo acerca de ejecutar comandos, pero es f&aacute;cil ir un paso m&aacute;s
all&aacute;. Una de las principales razones para usar Linux es que es un sistema
operativo multitarea ---puede ejecutar varios programas (a partir de
ahora, procesos) a la vez---. Puede lanzar procesos en segundo plano
(<I>background</I>)  y seguir trabajando inmediatamente. M&aacute;s a&uacute;n, Linux
permite tener varias sesiones abiertas simult&aacute;neamente: es como tener
muchos ordenadores en los que trabajar a la vez. </P>
<P>
<UL>
<LI>Para cambiar a la sesi&oacute;n 1..6:

<BLOCKQUOTE><CODE>
<PRE>
$ Alt-F1 ... Alt-F6
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Para comenzar una nueva sesi&oacute;n sin dejar la actual:

<BLOCKQUOTE><CODE>
<PRE>
$ su - &lt;mi_nombre_de_usuario&gt;
</PRE>
</CODE></BLOCKQUOTE>


Ejemplo:

<BLOCKQUOTE><CODE>
<PRE>
$ su - root
</PRE>
</CODE></BLOCKQUOTE>


Esto es &uacute;til, por ejemplo, cuando se necesita montar un disco (Secci&oacute;n
<A HREF="Dos-a-Linux-Como-4.html#Disquetes">Disquetes</A>): normalmente, s&oacute;lo <CODE>root</CODE> puede hacer eso. 
</LI>
<LI>Para acabar una sesi&oacute;n:

<BLOCKQUOTE><CODE>
<PRE>
$ exit
</PRE>
</CODE></BLOCKQUOTE>


Si hay trabajos parados (ver m&aacute;s abajo), ser&aacute; avisado.
</LI>
<LI>Para lanzar un proceso en primer plano:

<BLOCKQUOTE><CODE>
<PRE>
$ nomprog [-opciones] [parametros] [&lt; input] [&gt; output]
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Para lanzar un proceso en segundo plano, a&ntilde;ada un <I>ampersand</I>:
<CODE>&amp;</CODE>, al final de la l&iacute;nea de comandos:

<BLOCKQUOTE><CODE>
<PRE>
$ nomprog [-opciones] [parametros] [&lt; input] [&gt; output] &
[1] 123
</PRE>
</CODE></BLOCKQUOTE>


el shell o int&eacute;rprete de comandos identifica el proceso con un n&uacute;mero de
trabajo (p.e. <F>1</F>; ver m&aacute;s abajo), y con un PID (123 en nuestro ejemplo).
</LI>
<LI>Para ver cu&aacute;ntos procesos hay:

<BLOCKQUOTE><CODE>
<PRE>
$ ps -a
</PRE>
</CODE></BLOCKQUOTE>


Esto generar&aacute; una lista de procesos actualmente en ejecuci&oacute;n.
</LI>
<LI>Para matar un proceso:

<BLOCKQUOTE><CODE>
<PRE>
$ kill &lt;PID&gt;
</PRE>
</CODE></BLOCKQUOTE>


Puede necesitar matar un proceso cuando no sabe c&oacute;mo cerrarlo de la manera
correcta... ;-). A veces, un proceso solo podr&aacute; ser matado con alguna de
las siguientes instrucciones:

<BLOCKQUOTE><CODE>
<PRE>
$ kill -15 &lt;PID&gt;
$ kill -9 &lt;PID&gt;
</PRE>
</CODE></BLOCKQUOTE>
</LI>
</UL>
</P>
<P>Adem&aacute;s, el int&eacute;rprete de comandos permite suspender temporalmente (parar) 
un proceso, mandar un proceso al segundo plano, y traer un proceso del
segundo plano al primer plano. En este contexto, los procesos son
denominados <I>trabajos</I>. </P>
<P>
<UL>
<LI>Para ver cu&aacute;ntos trabajos hay:

<BLOCKQUOTE><CODE>
<PRE>
$ jobs
</PRE>
</CODE></BLOCKQUOTE>


aqu&iacute; los trabajos son identificados por su n&uacute;mero de trabajo, no por su
PID. 
</LI>
<LI>Para parar un proceso ejecut&aacute;ndose en primer plano (no siempre
funciona): 

<BLOCKQUOTE><CODE>
<PRE>
$ Ctrl-C
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Para suspender un proceso ejecut&aacute;ndose en primer plano:

<BLOCKQUOTE><CODE>
<PRE>
$ Ctrl-Z
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Para mandar un proceso suspendido al segundo plano (convirti&eacute;ndolo
en trabajo): 

<BLOCKQUOTE><CODE>
<PRE>
$ bg &lt;trabajo&gt;
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Para traer un trabajo al primer plano:

<BLOCKQUOTE><CODE>
<PRE>
$ fg &lt;trabajo&gt;
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Para matar un trabajo:

<BLOCKQUOTE><CODE>
<PRE>
$ kill &lt;%trabajo&gt;
</PRE>
</CODE></BLOCKQUOTE>


donde <CODE>trabajo</CODE> puede ser 1, 2, 3; el <CODE>%</CODE> indica que nos
referimos a un n&uacute;mero de trabajo, y no a un PID. Usando estos comandos
puede formatear un disco, comprimir un pu&ntilde;ado de ficheros, compilar un
programa, y descomprimir un fichero simult&aacute;neamente, y todav&iacute;a tener la
l&iacute;nea de comandos a su disposici&oacute;n. Int&eacute;ntelo con el DOS. Int&eacute;ntelo con
Windows, s&oacute;lo para ver la diferencia de prestaciones (siempre que no se le
cuelgue, claro). 
</LI>
</UL>
</P>


<H2><A NAME="ss2.6">2.6 Ejecutando Programas en Ordenadores Remotos</A></H2>


<P>Para ejecutar un programa en una m&aacute;quina remota cuya direcci&oacute;n IP es
<CODE>remote.bigone.edu</CODE>, teclee: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ slogin remote.bigone.edu -l &lt;login_en_maquina_remota&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Tras meter su password, arranque su programa favorito. Obviamente, debe
tener una cuenta en la m&aacute;quina remota. </P>
<P>Si tiene X11, puede incluso ejecutar una aplicaci&oacute;n X en un ordenador
remoto, mostr&aacute;ndolo en su pantalla de X. Supongamos <CODE>remote.bigone.edu</CODE>
la m&aacute;quina X remota y <CODE>local.linux.box</CODE> su m&aacute;quina Linux. Para ejecutar
desde <CODE>local.linux.box</CODE> un programa X que reside en
<CODE>remote.bigone.edu</CODE>, haga lo siguiente: </P>
<P>
<UL>
<LI>arranque las X, arranque un xterm o un emulador de terminal
equivalente, y entonces teclee: 

<BLOCKQUOTE><CODE>
<PRE>
$ xhost +remote.bigone.edu
$ slogin remote.bigone.edu -l &lt;login_en_maquina_remota&gt;
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>tras meter su password, teclee:

<BLOCKQUOTE><CODE>
<PRE>
remote:$ DISPLAY=local.linux.box:0.0
remote:$ programa &
</PRE>
</CODE></BLOCKQUOTE>


(en vez de <CODE>DISPLAY...</CODE>, puede que tenga que escribir <CODE>setenv
DISPLAY local.linux.box:0.0</CODE>. Depende del shell remoto). 
</LI>
</UL>
</P>
<P>Ahora <CODE>programa</CODE> comenzar&aacute; en <CODE>remote.bigone.edu</CODE> y se mostrar&aacute; en
su m&aacute;quina. Aunque mejor no intente esto en una l&iacute;nea ppp.</P>


<HR>
<A HREF="Dos-a-Linux-Como-1.html">Anterior</A>
<A HREF="Dos-a-Linux-Como-3.html">Siguiente</A>
<A HREF="Dos-a-Linux-Como.html#toc2">Indice</A>
</BODY>
</HTML>
