<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE> C&oacute;mo pasar de DOS/Windows a Linux: Trabajo en red: conceptos</TITLE>
 <LINK HREF="Dos-Win-Linux-Como-11.html" REL=next>
 <LINK HREF="Dos-Win-Linux-Como-9.html" REL=previous>
 <LINK HREF="Dos-Win-Linux-Como.html#toc10" REL=contents>
</HEAD>
<BODY>
<A HREF="Dos-Win-Linux-Como-11.html">Página siguiente</A>
<A HREF="Dos-Win-Linux-Como-9.html">Página anterior</A>
<A HREF="Dos-Win-Linux-Como.html#toc10">Índice general</A>
<HR>
<H2><A NAME="s10">10. Trabajo en red: conceptos</A></H2>

<P>
<P>No solo est&aacute; disponible bajo Linux un «Acceso telef&oacute;nico a redes», sino que
tambi&eacute;n es m&aacute;s estable y m&aacute;s r&aacute;pido. El nombre clave es «PPP», el protocolo
empleado para conectarse a Internet utilizando m&oacute;dems.  Necesita un n&uacute;cleo que
de soporte a PPP y una herramienta que marque y realice la conexi&oacute;n.
<P>Para recoger el correo de su proovedor de servicios Internet necesita una
herramienta llamada «recolector de correo» (email fetcher) que utiliza el
protocolo POP; cuando recoja el correo, parecer&aacute; como si hubiera sido enviado
directamente a su sistema Linux. Entonces deber&aacute; utilizar un gestor de correo
de usuario como <CODE>pine</CODE>, <CODE>mutt</CODE>, <CODE>elm</CODE> u otros muchos para
administrarlo.
<P>Mientras que bajo Windows, siempre que lanza una aplicaci&oacute;n de Internet se
ejecuta el programa de conexi&oacute;n, bajo Linux el proceso es al rev&eacute;s.  Primero se
conecta, y despu&eacute;s se lanza la aplicaci&oacute;n. Un programa llamado <CODE>diald</CODE>
proporciona el acceso usual. Instalar y configurar una red sol&iacute;a ser una de las
cosas m&aacute;s dif&iacute;ciles de hacer bajo Linux, pero ya no lo es: por favor, consulte
el documento COMO configurar Linux.
<P>Finalmente, acerca del «Entorno de red»: puede hacer que su m&aacute;quina Linux
aparezca como un Windows NT/9x en una red local de m&aacute;quinas Windows. La palabra
m&aacute;gica es Samba: no el baile brasile&ntilde;o, sino una implementaci&oacute;n del protocolo
SMB para Linux. Visite <CODE>
<A HREF="http://samba.anu.edu.au/samba">http://samba.anu.edu.au/samba</A></CODE>.
<P>
<HR>
<A HREF="Dos-Win-Linux-Como-11.html">Página siguiente</A>
<A HREF="Dos-Win-Linux-Como-9.html">Página anterior</A>
<A HREF="Dos-Win-Linux-Como.html#toc10">Índice general</A>
</BODY>
</HTML>
