<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE> C&oacute;mo pasar de DOS/Windows a Linux: Un poco de programaci&oacute;n</TITLE>
 <LINK HREF="Dos-Win-Linux-Como-12.html" REL=next>
 <LINK HREF="Dos-Win-Linux-Como-10.html" REL=previous>
 <LINK HREF="Dos-Win-Linux-Como.html#toc11" REL=contents>
</HEAD>
<BODY>
<A HREF="Dos-Win-Linux-Como-12.html">Página siguiente</A>
<A HREF="Dos-Win-Linux-Como-10.html">Página anterior</A>
<A HREF="Dos-Win-Linux-Como.html#toc11">Índice general</A>
<HR>
<H2><A NAME="s11">11. Un poco de programaci&oacute;n</A></H2>

<P>
<P>
<H2><A NAME="Scripts"></A> <A NAME="ss11.1">11.1 Rutinas del Int&eacute;rprete de Comandos: Ficheros .BAT con esteroides </A>
</H2>

<P>
<P>Si ha utilizado ficheros <CODE>.BAT</CODE> para crear atajos de largas l&iacute;neas de orden
(yo sol&iacute;a hacerlo), el objetivo puede ser obtenido insertando las l&iacute;neas de
alias convenientes (ver ejemplo de m&aacute;s arriba) en el <CODE>profile</CODE> o en el
<CODE>.bash_profile</CODE>. Pero si sus ficheros <CODE>.BAT</CODE> son m&aacute;s complicados, le
encantar&aacute; el lenguaje de Script (guionado) que el shell pone a su disposici&oacute;n:
es tan potente como el viejo Qbasic (o m&aacute;s).  Tiene variables, estructuras como
<CODE>while</CODE>, <CODE>for</CODE>, <CODE>case</CODE>, <CODE>if-then-else</CODE>, y montones de nuevas
caracter&iacute;sticas: puede ser una buena alternativa a un lenguaje de programaci&oacute;n
«de verdad». 
<P>Para escribir una rutina (script) ---el equivalente a un fichero
<CODE>.BAT</CODE> bajo DOS--- todo lo que tiene que hacer es escribir un fichero
ASCII est&aacute;ndar que contenga las instrucciones, guardarlo, y entonces
hacerlo ejecutable con la orden <CODE>chmod +x fichero</CODE>. Para
ejecutarlo, teclee su nombre. 
<P>Aviso: el editor del sistema se llama <CODE>vi</CODE>, y es un hecho probado que
la mayor parte de los nuevos usuarios lo encuentran muy dif&iacute;cil de usar.
No voy a explicar c&oacute;mo usarlo; por favor, consulte el libro de Matt Welsh
o busque un cursillo en la red. Suficiente decir por ahora que:
<P>
<UL>
<LI>para insertar texto, pulse `i' y despu&eacute;s el texto;</LI>
<LI>para borrar caracteres, teclee <CODE>ESC</CODE> y despu&eacute;s `x';</LI>
<LI>para salir de <CODE>vi</CODE> sin guardar, pulse <CODE>ESC</CODE> y despu&eacute;s <CODE>:q!</CODE></LI>
<LI>para guardar y salir, pulse <CODE>ESC</CODE> y luego <CODE>:wq</CODE></LI>
</UL>
<P><CODE>joe</CODE> es un buen editor para novatos: ll&aacute;melo tecleando <CODE>jstar</CODE>
y tendr&aacute; los mismos atajos de teclas que en el editor de DOSWin.
<CODE>jed</CODE> en modo WordStar o IDE es incluso mejor. Por favor, consulte
la secci&oacute;n 
<A HREF="Dos-Win-Linux-Como-12.html#Programas">D&oacute;nde encontrar aplicaciones</A> para
ver d&oacute;nde conseguir estos editores.
<P>Escribir rutinas bajo bash es una materia tan extensa que requerir&iacute;a un
libro para abarcarla toda, y no voy a profundizar m&aacute;s all&aacute; en este tema.
S&oacute;lo dar&eacute; un ejemplo de script, del cual se pueden extraer las reglas
b&aacute;sicas: 
<P>
<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh
# ejemplo.sh
# Soy un comentario
# no cambie la primera linea: debe estar ahi
echo "Este sistema es: `uname -a`" # usa la salida de la orden
echo "Me llamo $0" # variables intrinsecas
echo "Usted me dio $# parametros: "$*
echo "El primer parametro es: "$1
echo -n "¿Como se llama? " ; read su_nombre
echo fijese en la diferencia: "Hola, $su_nombre" # entrecomillando con "
echo fijese en la diferencia: 'Hola, $su_nombre' # entrecomillando con '
DIRS=0 ; FILES=0
for fichero in `ls .` ; do
  if [ -d ${fichero} ] ; then # si el fichero esta en el directorio
    DIRS=`expr $DIRS + 1`  # DIRS = DIRS + 1
  else if [ -f ${fichero} ] ; then
   FILES=`expr $FILES + 1`
  fi
  case ${fichero} in
    gif|*jpg) echo "${fichero}: fichero grafico" ;;
    *.txt|*.tex) echo "${fichero}: fichero de texto" ;;
    *.c|*.f|*.for) echo "${fichero}: fichero de codigo fuente" ;;
    *) echo "${fichero}: fichero generico" ;;
  esac
done
echo "Hay ${DIRS} directorios y ${FILES} ficheros"
ls | grep "ZxY--!!!WKW"
if [ $? != 0 ] ; then # Sacar el codigo del ultimo orden
  echo "ZxY--!!!WKW no encontrado"
fi
echo "ya es suficiente... Para mas informacion teclee 'man bash'." 
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss11.2">11.2 Sus programas en C</A>
</H2>

<P>
<P>Bajo Unix, el lenguaje del sistema es C, le guste o no. Pero tambi&eacute;n est&aacute;n a su
disposici&oacute;n otros lenguajes como FORTRAN, Pascal, Lisp, Basic, Perl,
awk...
<P>Suponiendo que usted sepa C, hay un par de gu&iacute;as para aquellos que han
utilizado Turbo C++ o uno de sus hermanos bajo DOS. El compilador de C se
denomina gcc y carece de todas las florituras que normalmente acompa&ntilde;an a sus
an&aacute;logos bajo DOS: no tiene IDE, ni ayuda en l&iacute;nea, ni debugger integrado,
etc... Es s&oacute;lo un r&uacute;stico compilador de l&iacute;nea de &oacute;rdenes, muy potente y
eficiente. Esto es lo que debe teclear para compilar el t&iacute;pico programa
<CODE>hello.c</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gcc hello.c
</PRE>
</CODE></BLOCKQUOTE>
<P>lo que crear&aacute; un fichero ejecutable llamado <CODE>a.out</CODE>. Para cambiar el
nombre del ejecutable a otro nombre: 
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gcc -o hola hello.c
</PRE>
</CODE></BLOCKQUOTE>
<P>Para enlazar una librer&iacute;a al programa, a&ntilde;ada la opci&oacute;n
<CODE>-lnombre_de_librer&iacute;a</CODE>. Por ejemplo, para enlazar la librer&iacute;a
<CODE>math</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gcc -o mathprog mathprog.c -lm
</PRE>
</CODE></BLOCKQUOTE>
<P>(<CODE>-lnombre_libreria</CODE> fuerza a gcc a enlazar la librer&iacute;a
<CODE>/usr/lib/libnombre_librer&iacute;a.a</CODE>; por lo tanto <CODE>-lm</CODE> enlaza
<CODE>/usr/lib/libm.a</CODE>). 
<P>Bien. Pero cuando su programa est&aacute; compuesto por varios ficheros de c&oacute;digo
fuente, necesitar&aacute; usar la utilidad <CODE>make</CODE>. Supongamos que ha escrito un
evaluador de expresiones: su c&oacute;digo fuente se denomina <CODE>parser.c</CODE> e tiene un
<CODE>#include</CODE> de dos ficheros en su cabecera: <CODE>parser.h</CODE> y <CODE>xy.h</CODE>.
Entonces, desea utilizar las rutinas de <CODE>parser.c</CODE> en otro programa,
<CODE>calc.c</CODE>, que hace un <CODE>#include</CODE> de <CODE>parser.h</CODE>. ¡Vaya l&iacute;o! ¿C&oacute;mo se
puede compilar <CODE>calc.c</CODE>? 
<P>Debe escribir un fichero llamado <CODE>Makefile</CODE>, el cual muestra al compilador
las dependencias entre los ficheros de c&oacute;digo fuente y los ficheros de c&oacute;digo
objeto. En nuestro ejemplo: 
<P>
<BLOCKQUOTE><CODE>
<PRE>
# Este es el Makefile utilizado para compilar calc.c
# ¡Pulse la tecla &lt;TAB> en las posiciones marcadas!

calc: calc.o parser.o
&lt;TAB>gcc -o calc calc.o parser.o -lm
# calc depende de dos ficheros de codigo objeto: calc.o and parser.o

calc.o: calc.c parser.h
&lt;TAB>gcc -c calc.c
# calc.o depende de dos ficheros de codigo fuente

parser.o:  parser.c parser.h xy.h
&lt;TAB>gcc -c parser.c
# parser.o depende de tres ficheros de codigo fuente

# fin de Makefile.
</PRE>
</CODE></BLOCKQUOTE>
<P>Guarde esto como <CODE>Makefile</CODE> y teclee
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ make
</PRE>
</CODE></BLOCKQUOTE>
<P>para compilar su programa. Gu&aacute;rdelo como <CODE>calc.mak</CODE> de forma
alternativa y teclee
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ make -f calc.mak
</PRE>
</CODE></BLOCKQUOTE>
<P>Y, por supuesto, LPM.
<P>Puede pedir ayuda acerca de las funciones de C, que se encuentra en las
p&aacute;ginas <CODE>man</CODE>, secci&oacute;n 3; por ejemplo: 
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ man 3 printf
</PRE>
</CODE></BLOCKQUOTE>
<P>Hay muchas librer&iacute;as disponibles por ah&iacute;; entre las primeras que desear&aacute; usar
est&aacute;n las <CODE>ncurses</CODE> (efectos en modo texto) y <CODE>svgalib</CODE>, (gr&aacute;ficos para
consola). Si se siente suficientemente valiente para atacar la programaci&oacute;n
bajo X (no es tan dif&iacute;cil), hay muchas bibliotecas que har&aacute;n mucho m&aacute;s f&aacute;cil
escribir programas para X11. Eche un vistazo a <CODE>
<A HREF="http://www.xnet.com/~blatura/linapp6.html">http://www.xnet.com/~blatura/linapp6.html</A></CODE>, teniendo en cuenta el
hecho de que Gtk se est&aacute; volviendo un est&aacute;ndar.
<P>Muchos editores pueden actuar como IDE. <CODE>emacs</CODE> y <CODE>jed</CODE>, por ejemplo,
proporcionan marcado de sintaxis, indentaci&oacute;n autom&aacute;tica, y cosas similares. De
manera alternativa, consiga el paquete <CODE>rhide</CODE> de <CODE>
<A HREF="ftp://sunsite.unc.edu:/pub/Linux/devel/debuggers/">ftp://sunsite.unc.edu:/pub/Linux/devel/debuggers/</A></CODE>.  Es un clon del
IDE de Borland, y cabe la posibilidad de que le guste.
<P>
<HR>
<A HREF="Dos-Win-Linux-Como-12.html">Página siguiente</A>
<A HREF="Dos-Win-Linux-Como-10.html">Página anterior</A>
<A HREF="Dos-Win-Linux-Como.html#toc11">Índice general</A>
</BODY>
</HTML>
