<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE> C&oacute;mo pasar de DOS/Windows a Linux: Introducci&oacute;n</TITLE>
 <LINK HREF="Dos-Win-Linux-Como-2.html" REL=next>

 <LINK HREF="Dos-Win-Linux-Como.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Dos-Win-Linux-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Dos-Win-Linux-Como.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>

<P>
<P>
<H2><A NAME="ss1.1">1.1 ¿Es Linux adecuado para usted?</A>
</H2>

<P>
<P>¿Quiere pasar del mundo DOS (esta definici&oacute;n incluye Windows) a Linux?
Buena idea: Linux es t&eacute;cnicamente superior a DOS, Windows 95 e incluso
Windows NT. Pero cuidado: puede no ser &uacute;til para usted. Estas son las
diferencias principales entre DOS y Linux:
<P>
<UL>
<LI> Windows ejecuta Microsoft Office y muchos juegos; est&aacute; claro que
es f&aacute;cil de instalar y configurar; es notablemente inestable; su
rendimiento es pobre; los bloqueos del ordenador son frecuentes.
</LI>
<LI> Linux ejecuta StarOffice, mucho software t&eacute;cnico y unos pocos
juegos; puede ser dif&iacute;cil de instalar y configurar; es s&oacute;lido como una roca;
rinde al m&aacute;ximo; los bloqueos de la m&aacute;quina son muy raros.
</LI>
</UL>
<P>De usted depende el decidir qu&eacute; necesita. Linux le da potencia, pero lleva
alg&uacute;n tiempo aprender a aprovecharla. Es decir, si necesita software comercial,
o si no le apetece aprender &oacute;rdenes y conceptos nuevos, ser&iacute;a mejor que buscara
en otra parte. Sepa que muchos novatos lo dejan debido a las dificultades
iniciales.
<P>Se est&aacute; trabajando para hacer Linux m&aacute;s facil de usar, pero <EM>no espere ser
un experto en Linux a menos que lea mucha documentaci&oacute;n y lo use durante al
menos unos meses</EM>. Linux no le dar&aacute; resultados instant&aacute;neos.  A pesar de
estas advertencias, tengo un 100% de seguridad en que si usted es el
usuario correcto, entonces encontrar&aacute; en Linux su Nirvana inform&aacute;tico. Por
cierto, Linux + DOS/Win pueden coexistir sin problemas en la misma m&aacute;quina.
<P>Requisitos previos para la lectura de este C&oacute;mo. Asumir&eacute; que:
<P>
<UL>
<LI> conoce las &oacute;rdenes y conceptos b&aacute;sicos del DOS;
</LI>
<LI> Linux, posiblemente con el sistema X Window (X11 para abreviar), est&aacute;
adecuadamente instalado en su ordenador;
</LI>
<LI> su int&eacute;rprete de &oacute;rdenes (el equivalente de <CODE>COMMAND.COM</CODE>) es
<CODE>bash</CODE>;
</LI>
</UL>
<P>A menos que se especifique lo contrario, toda la informaci&oacute;n de este
trabajo est&aacute; dirigida al antiguo DOS. Hay informaci&oacute;n acerca de Windows en
algunos lugares de este documento, pero tenga en cuenta que Windows y
Linux son completamente distintos, al contrario que DOS, que es una
especie de hermano pobre de UNIX.
<P>Dese cuenta tambi&eacute;n de que este trabajo no es ni una gu&iacute;a de configuraci&oacute;n ni
un manual completo para los no iniciados.
<P>La &uacute;ltima versi&oacute;n de este documento est&aacute; disponible en muchos formatos en
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/howto">ftp://sunsite.unc.edu/pub/Linux/docs/howto</A></CODE>.
<P>
<H2><A NAME="ss1.2">1.2 Ya est&aacute;. Ahora cu&eacute;nteme m&aacute;s.</A>
</H2>

<P>
<P>Ha instalado Linux y los programas que necesita en su ordenador. Se ha
proporcionado una cuenta (si no, ¡teclee <CODE>adduser suNombre</CODE> <EM>ahora
mismo</EM>!) y Linux est&aacute; ejecut&aacute;ndose. Acaba de introducir su nombre y su
contrase&ntilde;a, y ahora est&aacute; mirando a la pantalla pensando...
<I>¿Y ahora qu&eacute;?</I>
<P>Bien, no se desespere. Puede hacer casi las mismas cosas que sol&iacute;a hacer
con DOS/Win, y muchas m&aacute;s. Si estuviera ejecutando DOS/Win en lugar de Linux,
realizar&iacute;a alguna de las siguientes tareas: 
<P>
<UL>
<LI> ejecutar programas y crear, copiar, ver, borrar, imprimir, renombrar
ficheros; 
</LI>
<LI> cambiar de directorio, crearlos, borrarlos y listar sus contenidos;
</LI>
<LI> formatear disquetes y copiar ficheros de/hacia ellos;
</LI>
<LI> configuraci&oacute;n del sistema;
</LI>
<LI> navegar por Internet;
</LI>
<LI> escribir ficheros <CODE>.BAT</CODE> y programas en su lenguaje favorito;
</LI>
<LI> el restante 1%.</LI>
</UL>
<P>Estar&aacute; contento al saber que todas esas tareas pueden llevarse a cabo bajo
Linux de una manera similar a como se hacen bajo DOS. Bajo DOS, el usuario
medio usa muy pocos de las m&aacute;s de 100 &oacute;rdenes disponibles: lo mismo,
hasta cierto punto, sucede con el Linux.
<P>
<H3>Conceptos introductorios</H3>

<P>
<P>La mejor manera de aprender algo es moj&aacute;ndose los pies. Desde aqu&iacute; le
animo a experimentar y «jugar» con Linux: a menos que entre como usuario
«root», no puede llegar a da&ntilde;ar el sistema de esa manera. Unos cuantos
conceptos:
<P>
<UL>
<LI>Primero, c&oacute;mo salir de Linux de manera segura. Si ve una pantalla en
modo texto, pulse &lt;Ctrl-Alt-Supr&gt;, espere a que el sistema realice
unas tareas y le diga que todo est&aacute; bien, y entonces apague el ordenador.
Si est&aacute; trabajando bajo el sistema X Window, pulse primero
&lt;Ctrl-Alt-Retroceder&gt;, y despu&eacute;s &lt;Ctrl-Alt-Supr&gt;. <EM>Nunca</EM>
apague o reinicie el ordenador directamente: podr&iacute;a da&ntilde;ar el sistema de
ficheros;
</LI>
<LI>Al contrario que en DOS o Windows, Linux tiene mecanismos de
seguridad intr&iacute;nsecos, debido a su naturaleza multiusuario. Los ficheros y
los directorios tienen permisos asociados, y por lo tanto el
usuario normal puede no tener acceso a alguno de ellos; vea la secci&oacute;n
<A HREF="Dos-Win-Linux-Como-4.html#Permisos">Permisos</A>. DOS y Windows, por el contrario, le
dejar&iacute;an machacar todo el contenido de su disco duro;
</LI>
<LI>Hay un usuario especial denominado «root»: el administrador del
sistema, que tiene todo el poder sobre la m&aacute;quina. Si usted trabaja con
su propio PC, tambi&eacute;n ser&aacute; root. Trabajar como root es <EM>peligroso</EM>:
cualquier error puede da&ntilde;ar seriamente o destruir el sistema de la misma
manera que con DOS/Win. No trabaje como root a menos que sea
absolutamente necesario;
</LI>
<LI>Mucha de la complejidad de Linux viene de su extrema configurabilidad:
pr&aacute;cticamente cada caracter&iacute;stica y aplicaci&oacute;n puede ser configurada mediante
uno o m&aacute;s archivos de configuraci&oacute;n. La complejidad es el precio a pagar por la
potencia;
</LI>
<LI>La redirecci&oacute;n y el entubamiento (<I>piping</I>) son caracter&iacute;sticas
«secundarias» de DOS. En Linux pasan a ser muy importantes y mucho m&aacute;s
potentes. Se pueden enlazar &oacute;rdenes para ejecutar tareas complejas.
Le recomiendo sobremanera que aprenda a usarlas.
</LI>
</UL>
<P>
<H3>Obtenci&oacute;n de ayuda</H3>

<P>
<P>Hay muchas maneras de conseguir ayuda con Linux. Las m&aacute;s importantes son:
<P>
<UL>
<LI><EM>Leyendo la documentaci&oacute;n</EM> Aunque el documento C&Oacute;MO que est&aacute; leyendo
puede servir como introducci&oacute;n a Linux, hay unos cuantos libros que deber&iacute;a
leer: <I>Linux: Instalaci&oacute;n y Primeros Pasos</I> de Matt Welsh (<CODE>
<A HREF="http://sunsite.unc.edu/mdw/LDP/gs/gs.html">http://sunsite.unc.edu/mdw/LDP/gs/gs.html</A></CODE>), la <I>Gu&iacute;a del
Usuario de Linux</I> de Larry Greenfield (<CODE>
<A HREF="http://sunsite.unc.edu/pub/Linux/docs/linux-doc-project/users-guide">http://sunsite.unc.edu/pub/Linux/docs/linux-doc-project/users-guide</A></CODE>),
y la lista PUF de Linux (respuestas a Preguntas de Uso Frecuente) (<CODE>
<A HREF="http://sunsite.unc.edu/mdw/FAQ/Linux-FAQ.html">http://sunsite.unc.edu/mdw/FAQ/Linux-FAQ.html</A></CODE>.  Todos ellos pueden
conseguirse en <CODE>
<A HREF="http://lucas.hispalinux.es">http://lucas.hispalinux.es</A></CODE> en su versi&oacute;n traducida. Mantenga un
sentimiento de culpabilidad hasta haber le&iacute;do al menos uno de ellos;
</LI>
<LI>La documentacion de los paquetes instalados en la m&aacute;quina puede
encontrarse usualmente en los directorios bajo <CODE>/usr/doc/</CODE>;
</LI>
<LI>Para conseguir ayuda acerca de las «&oacute;rdenes internas» del int&eacute;rprete
de &oacute;rdenes, teclee <CODE>help</CODE> o, mejor, <CODE>man bash</CODE> o <CODE>info bash</CODE>;
</LI>
<LI>Para conseguir ayuda acerca de una orden, teclee <CODE>man orden</CODE>, lo
cual invoca a la p&aacute;gina del manual («man») correspondiente a <CODE>orden</CODE>.
Alternativamente, teclee <CODE>info orden</CODE>, lo cual mostrar&aacute; la p&aacute;gina info
relativa a <CODE>orden</CODE>. info es un sistema de documentacion basado en
hipertexto. Quiz&aacute; no es intuitivo en un principio. Finalmente, puede
intentar con <CODE>apropos orden</CODE> o <CODE>whatis orden</CODE>. Con todas estas
&oacute;rdenes, pulse 'q' para salir.
</LI>
<LI>Finalmente, en Internet: el lugar m&aacute;s adecuado para conseguir ayuda
es Usenet, en el foro <CODE>
<A HREF="news:comp.os.linux.setup">news:comp.os.linux.setup</A></CODE>. Por favor, no me env&iacute;e mensajes
solicitando ayuda, porque tengo bastante trabajo.
</LI>
</UL>
<P>
<H2><A NAME="ss1.3">1.3 Convenciones</A>
</H2>

<P>
<P>A lo largo de este documento, los ejemplos seguir&aacute;n el siguiente formato:
<CODE>&lt;...&gt;</CODE> significa algo que debe ser especificado, mientras que
<CODE>[...]</CODE> es algo opcional. Ejemplo:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ tar -tf &lt;fichero.tar> [> fichero_redir]
</PRE>
</CODE></BLOCKQUOTE>
<P>Debe indicar <CODE>fichero.tar</CODE>, pero la redirecci&oacute;n a
<CODE>fichero_redir</CODE> es opcional.
<P>Desde ahora «LPM» significa «para m&aacute;s informaci&oacute;n Lea las P&aacute;ginas del Manual».
No puedo dejar de recordar lo importante que es leer la documentaci&oacute;n. «DosWin»
significa «DOS/Windows».
<P>Cuando el simbolo de la l&iacute;nea de &oacute;rdenes en un ejemplo sea '#', la
orden solo puede ser ejecutada por el root.
<P>
<HR>
<A HREF="Dos-Win-Linux-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Dos-Win-Linux-Como.html#toc1">Índice general</A>
</BODY>
</HTML>
