<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_0.6">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>System Administration : VXE,una herramienta para la seguridad en Linux</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Serge-Lozovsky.jpg" ALT="[Photo of the Author]" HEIGHT=160 WIDTH=120>
<BR>por  <a href="mailto:serge@intes.odessa.ua">Serge Lozovsky</a>
<BR><BR><I>Sobre el Author:</I><BR><P>
Veinte a&ntilde;os de experiencia en Sistemas de Informaci&oacute;n
como programador/administrador en total. 5 a&ntilde;os en tecnolog&iacute;a
internet, 9 a&ntilde;os en UNIX, 4 a&ntilde;os en Inteligencia
Artificial (conocimiento y representaci&oacute;n de datos).
</P><P><FONT COLOR="#336633">Contenidos</FONT>:
<OL>
  <LI><A HREF="#lfindex0">Descripci&oacute;n y activaci&oacute;n de VXE.</A></LI>
  <LI><A HREF="#lfindex1">El sistema de desarrollo de VXE.</A></LI>
  <LI><A HREF="#lfindex2">Desempe&ntilde;o</A></LI>
</OL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>VXE,una herramienta para la seguridad en Linux</H2>
 <IMG SRC="../../common/images/illustration133.jpg" ALT="[Illustration]" HSPACE=10 ><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
Serge Lozovski presenta un paquete de software el cual dise&ntilde;&oacute;
para hacer los sistemas UNIX m&aacute;s seguros. Este software est&aacute;
disponible bajo una licencia no-libre. Lo pueden utilizar sin costo
para prop&oacute;sitos educacionales no comerciales.El problema m&aacute;s grande con la seguridad en UNIX es que el
superusuario puede hacer con el sistema cualquier cosa que el quiera.
Hay programas (demonios) que trabajan con privilegios del
superusuario, por ejemplo <I>popd </I><SPAN STYLE="font-style: normal">o</SPAN><I>sendmail</I>, y son accesibles desde la red (Internet/Intranet).
Dentro de esta pueden existir bugs en cualquier programa, as&iacute;
que los intrusos se conectan al programa v&iacute;a la red,
aprovech&aacute;ndose as&iacute; de todos los errores existentes y
tomar de esta forma tomar el control de todos los hosts.VXE(Virtual eXecuting Enviroment, <I>Ambiente Virtual de
Ejecuci&oacute;n</I>) protege servidores UNIX de estos intrusos,
ataques de crackers desde la red entre otros. VXE protege los
subsistemas.As&iacute;, VXE soluciona el problema siguiente: protege a los
hosts y subsistemas particulares, los cuales trabajan en modo
superusuario y donde los mismos pueden tener una serie de bugs. Este
es un problema que se presenta en la vida real.</P><HR size="2" noshade><BR>
<!-- BODY OF THE ARTICLE -->


<P>Un ambiente virtual de ejecuci&oacute;n como el que proporciona
VXE protege al host y subsistemas particulares los cuales trabajan en
modo superusuario y donde estos pueden presentar bugs en sus
programas. Cuando el programa trabaja en modo superusuario, este
puede acceder a todos los recursos del sistema operativo. VXE crea un
ambiente virtual para cada subsistema.</P>

<P>Dentro de este ambiente, solamente los recursos necesitados para
la operaci&oacute;n normal del sistema son visibles y est&aacute;n
disponibles para el subsistema. El subsistema soporta (apoya) el
programa de inicio y todos los subprocesos iniciados (bifurcados) por
este. Cualquier subproceso corre en el mismo VXE como el padre. Para
atender cualquier requerimiento del sistema, el programa usa llamadas
al sistema operativo (syscalls). VXE tiene arbitrio para describir
que llamada del sistema atender y con que par&aacute;metros est&aacute;
disponible para cada subsistema. Por ejemplo, este puede ser descrito
(para llamadas al sistema de operaci&oacute;n de archivos) que
algunos archivos son le&iacute;bles y algunos ejecutables, las
operaciones de la red no disponibles (en caso del servidor POP-este
maneja conexiones a la red, pero no crean nuevas conexiones), y estas
restricciones no pueden ser violadas por ning&uacute;n programa con
privilegios de superusuario.</P>

<P>Estas restricciones pueden estar listas mientras sean necesitadas.
Si un intruso obtiene el control de cada uno de los subsistemas, no
podr&aacute; utilizar m&eacute;todos ordinarios para olfatear
informaci&oacute;n o afectar el sistema. El puede hacer cualquier
cosa en teor&iacute;a usando m&eacute;todos sofisticados, -esto para
afectar la operaci&oacute;n del sistema violado, pero no el sistema
operativo en si mismo, ni otros subsistemas. Aqu&iacute; los m&eacute;todos
ordinarios son aquellos donde un intruso toma el control de los
privilegios del superusuario y ejecuta comandos del shell
(int&eacute;rprete) y dem&aacute;s utilidades de uso ordinario como
un editor de texto entre otros m&aacute;s. El no puede hacer nada sin
estas utilidades. Por ejemplo, un servidor POP no necesita un editor
de texto y la utilidad <I>copiar </I><SPAN STYLE="font-style: normal">para
realizar su trabajo, as&iacute; que all&iacute; no esta tal programa
en ambiente VXE, creado para protecci&oacute;n del POPD.</SPAN></P>

<P>M&aacute;s espec&iacute;ficamente, VXE protege el sistema y sus
subsistemas desde la interferencia del subsistema violado (al cual
trabaja bajo el control de VXE). As&iacute; tambi&eacute;n, proporciona protecci&oacute;n a los
subsistemas en si (en la forma como se describi&oacute;
anteriormente). Para mas sencillo de comprender, en el siguiente
texto se describir&aacute; ese subsistema de protecci&oacute;n VXE.</P>

<A NAME="lfindex0">&nbsp;</A>
<H2>Descripci&oacute;n y activaci&oacute;n de VXE.</H2>

<P>La <I>descripci&oacute;n VXE</I> (VXED) es un peque&ntilde;o
programa elaborado el LISP (un conjunto de funciones) el cual usa una
descripci&oacute;n declarativa de par&aacute;metros aceptables para
diferentes llamadas al sistema. Este VXED es cargado por el kernel
(n&uacute;cleo) donde este controla los par&aacute;metros de llamadas
al sistema desde el subsistema especificado. As&iacute;, VXED es un
conjunto de m&oacute;dulos din&aacute;micos cargables, manejados por
un peque&ntilde;o int&eacute;rprete LISP insertado en el kernel. La
versi&oacute;n actual de VXE contiene vxelisp, derivado de RefLisp
(de Bill Birch, <A HREF="mailto:bbirch@ctp.com">bbirch@ctp.com</A>).
vxelisp contiene una nueva representaci&oacute;n de cadena larga,
soporta un gran numero de cadenas (strings) y otras cuantas
funciones. La versi&oacute;n del kernel de vxelisp est&aacute; por
venir, la cual permitir&aacute; manejar diferentes VXEDs
simult&aacute;neamente.</P>

<P>Existen dos m&eacute;todos para activar VXED. De manera expl&iacute;cita
y de manera impl&iacute;cita (autom&aacute;tica). La activaci&oacute;n
expl&iacute;cita se da mediante el uso del programa VXE. Los
par&aacute;metros son: el nombre de la ruta del VXED, la ruta y
par&aacute;metros del ejecutable, los cuales ser&aacute;n ejecutados
con sus respectivas restricciones. Para el m&eacute;todo autom&aacute;tico,
la utilidad vxed pre-carga todo lo que necesita VXED dentro del
kernel. Cada VXED tiene un patr&oacute;n de activaci&oacute;n.
Durante el inicio del programa (ejecutable), el kernel verifica la
ruta del ejecutable contra los patrones y posteriormente VXED es
activado. Este m&eacute;todo puede ser usado para activar la
protecci&oacute;n al inicio del cualquier programa en un directorio
especificado (y todos sus subdirectorios). Por ejemplo, para proteger
scripts CGI elaborados por usuarios, VXED puede estar definido para
cada subdirectorio de usuario.</P>

<A NAME="lfindex1">&nbsp;</A>
<H2>El sistema de desarrollo de VXE.</H2>


<P>Cualquier VXED sofisticado puede ser creado manualmente usando el
gran poder de vxelisp. Pero sin embargo, VXE no puede forzar a los
administradores a aprender a utilizar LISP. Uno puede pensar acerca
de VXE como un sistema de auto-aprendizaje. El sistema de desarrollo
de VXE (llamado DS) ejecuta VXE en modo trazado.</P>

<P>Cabe destacar que como en otro tipo de servicios, la creaci&oacute;n
y modificaci&oacute;n de VXED es dada v&iacute;a una interface <A HREF="http://WWW/">WWW</A>.
</P>

<P>El sistema de desarrollo soporta dos tipos de VXED. Tipo <I>estricto</I>
y tipo <I>sistema de archivos</I>. VXED estricto describe
expl&iacute;citamente todas las llamadas al sistema permitidas. VXED
sistema de archivos describe los permisos de lectura, escritura y
ejecuci&oacute;n para una ruta definida. Las restricciones
especificadas aplican a las llamadas al sistema del sistema de
archivos, todas las dem&aacute;s llamadas al sistema son permitidas.
Despu&eacute;s de que VXED ha sido creado para un subsistema
particular, este trabaja en modo <I>suave</I>. En este modo todas las
violaciones de VXED est&aacute;n registradas, pero las llamadas al
sistema est&aacute;n ejecutadas. VXE DS puede respaldar VXED
autom&aacute;ticamente, usando la informaci&oacute;n registrada.</P>

<P>Seguramente, cualquier cambio que necesite hacerse al VXED, puede
realizarse usando el editor VXED. Las violaciones pueden ser causadas
por la actividad de un intruso o por el comportamiento de los
subsistemas en ciertas circunstancias. El administrador VXE revisa el
registro con la ayuda del DS y toma una decisi&oacute;n en cuanto a
si un respaldo es razonable. Si no hay violaciones entonces el VXED
puede ser cambiado al modo <I>producci&oacute;n</I>. En este modo,
las violaciones son registradas y las llamadas al sistema son
bloqueadas. Una vez m&aacute;s, el registro puede ser usado para la
detecci&oacute;n de intrusos o para la afinaci&oacute;n del VXED.</P>

<P>Por razones de seguridad, todas las acciones de control sobre VXE
pueden ser hechas solamente por el superusuario y fuera de cualquier
VXE</P>

<A NAME="lfindex2">&nbsp;</A>
<H2>Desempe&ntilde;o</H2>


<P>VXE afecta el desempe&ntilde;o de la siguiente forma. Si el
programa corre fuera de cualquier VXE, cualquier llamado al sistema
ejecuta dos instrucciones montadas (verifica si VXE esta en efecto
por un proceso actual, y salta si no es as&iacute;). Para cualquier
llamada al sistema de un ejecutable, una peque&ntilde;a subrutina en
lenguaje C verifica si hay alg&uacute;n correspondiente VXED a&uacute;n
disponible en el n&uacute;cleo. Para programas que corren en VXE,
unas cuantas lineas de c&oacute;digo C determinan si la verificaci&oacute;n
del par&aacute;metro es necesaria. Algunas llamadas al sistema pueden
ser se&ntilde;aladas en VXED como no-verificables (por ejemplo,
se&ntilde;alar por default las operaciones de lectura y escritura).
As&iacute;, solamente el resto de las llamadas al sistema son
verificadas por algunas funciones LISP. Estas funciones est&aacute;n
localizadas dentro de VXED y pueden ser f&aacute;cilmente observadas
por el administrador.</P>

<P>SoporteVXE en:
<A HREF="mailto:vxe@intes.odessa.ua">vxe@intes.odessa.ua</A></P>
<P>P&aacute;gina Web de VXE en:
<A HREF="http://www.intes.odessa.ua/vxe">http://www.intes.odessa.ua/vxe</A>
</P>



<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Serge Lozovsky <BR>LinuxFocus 1999</FONT></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:serge@intes.odessa.ua"><FONT COLOR="#FFFFFF">Serge Lozovsky</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:aniux@yahoo.com"><FONT COLOR="#FFFFFF">Ana Pimentel</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>1999-11-07, generated by lfparser version 0.6</font></p></BODY></HTML>
