<HTML>
<HEAD>
<TITLE>BogoMIPS mini-COMO: Qu&eacute; son los BogoMIPS</TITLE>
</HEAD>
<BODY>
<A HREF="BogoMIPS-mini-Como-1.html">Anterior</A>
<A HREF="BogoMIPS-mini-Como-3.html">Siguiente</A>
<A HREF="BogoMIPS-mini-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Qu&eacute; son los BogoMIPS</A></H2>


<P>De un mensaje de Lars Wirzenius <CODE>
<A HREF="mailto:wirzeniu@kruuna.Helsinki.fi">wirzeniu@kruuna.Helsinki.fi</A></CODE> del 9 de Septiembre de 1993,
explicando qu&eacute; los BogoMIPS, con informaci&oacute;n detallada adicional de Wim
van Dorst: </P>
<P><I>``MIPS'' es la abreviatura de ``<I>Millions of Instructions Per
Second</I>
<SL>Millones de Instrucciones Por Segundo</SL>
''. Es
una medida de la velocidad de ejecuci&oacute;n de un programa. Como la mayor&iacute;a de
tales medidas, frecuentemente se abusa de ella en vez de usarse
correctamente (es dif&iacute;cil comparar con justicia MIPS para diferentes tipos
de ordenadores).</I> </P>
<P>Los <I>BogoMIPS</I> son una invenci&oacute;n de Linus. El n&uacute;cleo (¿o era un
controlador de dispositivo?) necesita un bucle de temporizaci&oacute;n (el tiempo
es demasiado corto y/o necesita ser demasiado exacto para poder emplear un
m&eacute;todo de espera no basado en bucles de retardo), que tiene que ser
calibrado con la velocidad de procesador de la m&aacute;quina. Por lo tanto, el
n&uacute;cleo mide durante la secuencia de arranque c&oacute;mo de r&aacute;pido se ejecuta en
el ordenador un determinado tipo de bucle de retardo. ``<I>Bogo</I>'' viene
de ``<I>bogus</I>'', que significa ``algo que es enga&ntilde;oso, incorrecto,
falso''. Por consiguiente, el valor de los BogoMIPS da una cierta
indicaci&oacute;n acerca de la velocidad del procesador, pero de forma
escasamente cient&iacute;fica como para ser llamado de otra manera m&aacute;s que
``BogoMIPS''.</P>
<P>Las razones (hay dos) por las cuales se muestra durante el arranque son:</P>
<P>
<UL>
<LI>Es moderadamente &uacute;til para la depuraci&oacute;n y para comprobar que las
cach&eacute;s y el bot&oacute;n de turbo funcionan; y</LI>
<LI>A Linus le encanta re&iacute;rse un poco cuando ve a la gente confundida en
las news. </LI>
</UL>
</P>
<P>Los BogoMIPS est&aacute;n definidos en <CODE>/usr/src/linux/init/main.c</CODE> (un
algoritmo simple en C), y la variable correspondiente del n&uacute;cleo
<CODE>loops_per_sec</CODE> se usa en varios controladores de dispositivo en
las secciones <CODE>net</CODE>, <CODE>scsi</CODE> y <CODE>char</CODE>. Las verdaderas funciones de
retardo est&aacute;n en ensamblador, y por lo tanto cada plataforma tiene su
propia funci&oacute;n en <CODE>include/asm/delay.h</CODE>. Esta variable
<CODE>loops_per_sec</CODE> se usa en varios controladores para los dispositivos
<CODE>char</CODE>, <CODE>net</CODE> y <CODE>scsi</CODE> (ver</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
find /usr/src/linux -name '*.[hcS] -print -exec fgrep
loops_per_sec {} \;
</PRE>
</CODE></BLOCKQUOTE>

)</P>

<HR>
<A HREF="BogoMIPS-mini-Como-1.html">Anterior</A>
<A HREF="BogoMIPS-mini-Como-3.html">Siguiente</A>
<A HREF="BogoMIPS-mini-Como.html#toc2">Indice</A>
</BODY>
</HTML>
