<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.7.4">
 <TITLE>Lenguajes de programaci&oacute;n Mini-COMO.: Lenguajes de programaci&oacute;n</TITLE>
 <LINK HREF="Lenguajes-Programacion-miniCOMO-3.html" REL=next>
 <LINK HREF="Lenguajes-Programacion-miniCOMO-1.html" REL=previous>
 <LINK HREF="Lenguajes-Programacion-miniCOMO.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Lenguajes-Programacion-miniCOMO-3.html">Página siguiente</A>
<A HREF="Lenguajes-Programacion-miniCOMO-1.html">Página anterior</A>
<A HREF="Lenguajes-Programacion-miniCOMO.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2.</A> <A HREF="Lenguajes-Programacion-miniCOMO.html#toc2">Lenguajes de programaci&oacute;n</A></H2>

<H2><A NAME="ss2.1">2.1 Conceptos en la Tabla</A>
</H2>

<P>
<DL>

<DT><B>Lenguaje</B><DD><P>Indica el nombre com&uacute;n del lenguaje.</P>

<DT><B>Principiante</B><DD><P>Indica lo apropiado que es el lenguaje para personas con poca
experiencia en programaci&oacute;n. Un lenguaje que se encuentre marcado por
un ``s&iacute;'' deber&iacute;a ser viable como primer lenguaje de programaci&oacute;n para
un principiante.</P>

<DT><B>Rendimiento</B><DD><P>La probable velocidad de ejecuci&oacute;n de sus aplicaciones cuando se usen
comercialmente. Las prestaciones dependen m&aacute;s de sus habilidades
algor&iacute;tmicas de programaci&oacute;n que del propio lenguaje.  Emp&iacute;ricamente,
C, C++ y Fortran son necesarios a veces porque pueden dar mejores
prestaciones que otros lenguajes -otras veces pueden ser pesados para
el proposito original. (Una idea para las pruebas de rendimiento de
los lenguajes ser&iacute;a la implementaci&oacute;n de un sencillo algoritmo de
ordenaci&oacute;n en todos ellos y la comparaci&oacute;n posterior de los tiempos de
ejecuci&oacute;n.  ¿Alguien querr&iacute;a ayudarme con &eacute;sto?</P>


<DT><B>POO, Progamaci&oacute;n Orientada a Objetos vs. otros paradigmas</B><DD><P>La Programaci&oacute;n Orientada a Objetos es un paradigma de programaci&oacute;n
importante que est&aacute; ganando popularidad.  En la programaci&oacute;n orientada
aobjetos, las estructuras de datos y los algoritmos se integran en
unidades, a menudo llamadas clases. La POO contrasta con la
programaci&oacute;n procedimental (que usa algoritmos y estructuras de datos
separados). No depende estrictamente del lenguaje: se puede hacer POO
con lenguajes no clasificados como tales (por ejemplo C), y se puede
programar en estilo procedimental con lenguajes clasificados como
Orientados a Objetos. He clasificado como de POO a lenguajes que
tienen caracter&iacute;sticas especiales o a&ntilde;adidos que facilitan la POO. Los
lenguajes funcionales (LISP, por ejemplo) son de una clase un poco
diferente -entre otras cosas, los lenguajes funcionales son un
superconjunto de POO. La programaci&oacute;n l&oacute;gica (Prolog), tambi&eacute;n llamada
programaci&oacute;n declarativa, por otro lado, no tiene relaci&oacute;n con otros
tipos de programaci&oacute;n en un sentido similar.</P>

<DT><B>RAD, Rapid Application Development (Desarrollo r&aacute;pido de
aplicaciones)</B><DD><P>M&aacute;s dependientes de las herramientas que se usan que del lenguaje
propiamente dicho. Hay un COMO de herramientas de desarrollo para GUI
(Interfaz gr&aacute;fico de susuario), aunque est&aacute; desfasado. Con una buena
herramienta gr&aacute;fica se pueden realizar RAD. A veces los RAD se basan
en la reutilizaci&oacute;n de c&oacute;digo tambi&eacute;n, por lo que el software libre
nos puede proporcionar un buen punto de partida.</P>

<DT><B>Ejemplos</B><DD><P>Describe los campos de programaci&oacute;n en los que normalmente se usa el
lenguaje. Se dan otros tipos de usos, buenos y malos, aunque no son
tan frecuentes.</P>



<DT><B>Comentarios</B><DD><P>Informaci&oacute;n adicional sobre el lenguaje, como son sus capacidades y
dialectos.</P>

</DL>
</P>
<H2><A NAME="ss2.2">2.2 Lenguajes Principales</A>
</H2>

<P>
<PRE>

PERL
Principiantes: S&iacute; - POO: S&iacute;
Ejemplos: Scripts, administraci&oacute;n de sistemas, www
Comentarios: Potente para la manipulaci&oacute;n de textos y cadenas

Python
Principiantes: S&iacute; - POO: S&iacute;
Ejemplos: Scripts, scripts de aplicaciones, www
Comentarios:

TCL
Principiantes: S&iacute; - POO: No
Ejemplos: Scripts, administraci&oacute;n de sistemas, aplicaciones
Comentarios:

PHP
Principiantes: S&iacute; - POO: S&iacute;
Ejemplos: Www
Comentarios: Popular para las bases de batos basadas en web

Java
Principiantes: S&iacute; - POO: S&iacute;
Ejemplos: Aplicaciones para plataformas cruzadas, www
Comentarios:

Lisp
Principiantes: S&iacute; - POO: Funcional
Ejemplos: Modos de Emacs (para elisp), AI
Comentarios: Variantes Elisp, Clisp y Scheme

Fortran
Principiantes: No  - POO: No
Ejemplos: Aplicaciones matem&aacute;ticas
Comentarios: Variantes f77 y f90/95

C
Principiantes: No  - POO: No
Ejemplos: Programaci&oacute;n de sistemas, aplicaciones
Comentarios: Muy popular

C++
Principiantes: No  - POO: S&iacute;
Examples: Aplicaciones
Comentarios:
</PRE>
</P>
<H2><A NAME="ss2.3">2.3 Programaci&oacute;n del shell</A>
</H2>

<P>Los shell son tambi&eacute;n unos entornos de programaci&oacute;n importantes. No
los cubro aqu&iacute; porque no domino el tema con la suficiente profundidad
a&uacute;n. El conocimiento de los shell es importante para quien trabaje con
Linux regularmente, y m&aacute;s aun para los administradores de
sistemas. Hay similitudes entre la programaci&oacute;n del shell y los
scripts -a menudo consiguen los mismos prop&oacute;sitos y tenemos la
oportunidad de elegir entre los shell nativos o un lenguaje de
scripts. Entre los m&aacute;s populares est&aacute;n los shell bash, tcsh, csh, ksh
y zsh.  Puede obtener informaci&oacute;n acerca de su shell con <EM>man</EM>
comando, <EM>man bash</EM> por ejemplo.</P>
<H2><A NAME="ss2.4">2.4 Otros Lenguajes</A>
</H2>

<P>Otros lenguajes dignos de menci&oacute;n: AWK, SED, Smalltalk, Eiffel, ADA,
Prolog, assembler, Objective C, Logo, Pascal (p2c converter)</P>
<H2><A NAME="ss2.5">2.5 Enlaces</A>
</H2>

<P>
<UL>
<LI>
<A HREF="http://www.tunes.org/Review/Languages.html">Un sitio de informaci&oacute;n general</A> sobre lenguajes de programaci&oacute;n, mucha informaci&oacute;n y opiniones</LI>
<LI>
<A HREF="http://www.scriptics.com/">TCL</A></LI>
<LI>
<A HREF="http://www.perl.org/">PERL</A></LI>
<LI>
<A HREF="http://www.python.org/">Python</A></LI>
<LI>
<A HREF="http://www.php.net">PHP</A></LI>
<LI>
<A HREF="http://www.javasoft.com/">Java</A></LI>
<LI>
<A HREF="http://clisp.cons.org/~haible/packages-clisp.html">clisp</A></LI>
</UL>
</P>
<HR>
<A HREF="Lenguajes-Programacion-miniCOMO-3.html">Página siguiente</A>
<A HREF="Lenguajes-Programacion-miniCOMO-1.html">Página anterior</A>
<A HREF="Lenguajes-Programacion-miniCOMO.html#toc2">Índice general</A>
</BODY>
</HTML>
