<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.7.4">
 <TITLE>Lenguajes de programaci&oacute;n Mini-COMO.: Introducci&oacute;n</TITLE>
 <LINK HREF="Lenguajes-Programacion-miniCOMO-2.html" REL=next>

 <LINK HREF="Lenguajes-Programacion-miniCOMO.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Lenguajes-Programacion-miniCOMO-2.html">Página siguiente</A>
Página anterior
<A HREF="Lenguajes-Programacion-miniCOMO.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1.</A> <A HREF="Lenguajes-Programacion-miniCOMO.html#toc1">Introducci&oacute;n</A></H2>

<P>Linux es un sistema operativo fascinante porque permite a cualquier
usuario participar en su desarrollo. La variedad de lenguajes
disponibles, sin embargo, puede llevar a la confusi&oacute;n a los
desarrolladores principiantes. Este documento hace un listado de las
opciones m&aacute;s comunes existentes para el desarrollo diario. (Bueno, el
m&aacute;s com&uacute;n y el principal, seg&uacute;n yo lo veo). Mi prop&oacute;sito no es ni el
de rese&ntilde;ar los lenguajes ni el de determinar cu&aacute;l es el mejor. Cada
lenguaje es una herramienta que sirve para determinados trabajos y
gustos. Puede obtener m&aacute;s informaci&oacute;n (a menudo conflictiva) con
facilidad, si pregunta por ah&iacute; o si mantine los o&iacute;dos alerta. La
secci&oacute;n de enlaces en este documento le dar&aacute; indicaciones para que
pueda investigar por su cuenta.</P>


<P>Hay una pl&eacute;yade de lenguajes y librer&iacute;as de programaci&oacute;n para
Linux, as&iacute; que este documento solamente cubre los lenguajes m&aacute;s
comunes y los conjuntos de herramientas para la construcci&oacute;n de
interfaces gr&aacute;ficas de usuario del momento. N&oacute;tese tambi&eacute;n que, tanto
los lenguajes como las herramientas para construcci&oacute;n de interfaces de
usuario, se ver&aacute;n desde el punto de vista de Linux: no se tratar&aacute;n sus
caracter&iacute;sticas para otras plataformas.</P>
<P>Este documento se ha sumado recientemente al LDP (Linux
Documentation Project: Proyecto de Documentaci&oacute;n de Linux), de modo
que no ha habido muchas oportunidades de recibir comentarios por parte
de la comunidad. Sin embargo, se saca a la luz con la esperanza de que
pueda ser &uacute;til a los que est&eacute;n interesados en programar en Linux. Un
signo de interrogaci&oacute;n en las tablas indica que se carece de
informaci&oacute;n. Si puede completarla, por favor, contacte con el
autor.</P>
<H2><A NAME="ss1.1">1.1 Copyright</A>
</H2>

<P>Copyright (c) 2000 Risto Varanka.</P>
<P>Copyright (c) de la traducci&oacute;n 2000 Antonio &Aacute;lvarez.</P>
<H2><A NAME="ss1.2">1.2 Licencia</A>
</H2>

<P>Los siguientes t&eacute;rminos de licencia son de aplicaci&oacute;n a todos los
documentos de LDP, a menos que as&iacute; se especifique en el documento. Los
documentos de LDP pueden ser reproducidos y redistribuidos por
completo o parcialmente, en cualquier medio f&iacute;sico o electr&oacute;nico,
siempre que se reproduzca este aviso de licencia en dicha
reproducci&oacute;n. Se permite y se anima a su redistribuci&oacute;n comercial. En
caso de redistribuci&oacute;n, se agradecer&aacute; la comunicaci&oacute;n de la misma, v&iacute;a
correo electr&oacute;nico, a los autores con treinta d&iacute;as de antelaci&oacute;n, para
darles tiempo a poner al d&iacute;a los documentos.</P>
<H3>Requisitos para los documentos modificados.</H3>

<P>Todos los documentos que sean modificados, incluyendo traducciones,
antolog&iacute;as o documentos parciales, deben cumplir los siguientes
requisitos:</P>
<P>
<OL>
<LI>La versi&oacute;n modificada debe estar etiquetada como tal.</LI>
<LI>La persona que haga las modificaciones debe identificarse.</LI>
<LI>Se debe conservar el reconocimiento al autor original.</LI>
<LI>Se debe identificar la localizaci&oacute;n del documento original no modificado.</LI>
<LI>El nombre (o nombres) del autor (o autores) originales, no puede
ser utilizado para afirmar o implicar la aprobaci&oacute;n del
documento resultante sin el permiso del (o de los) autor (o
autores) originales.
    </LI>
</OL>
</P>
<P>Ademas se pide que:</P>
<P>
<OL>
<LI>Las modificaciones (incluidas las supresiones) sean comunicadas.</LI>
<LI>El autor sea notificado por correo electr&oacute;nico de las
modificaciones antes de su redistribuci&oacute;n, si se da direcci&oacute;n
electr&oacute;nica en el documento.</LI>
</OL>
</P>
<P>Como excepci&oacute;n especial, las antolog&iacute;as de documentos de LDP pueden
incluir una &uacute;nica copia de estos t&eacute;rminos de licencia en un lugar
visible dentro de la antolog&iacute;a y reemplazar otras copias de esta
licencia haciendo refrencia a esta &uacute;nica copia de la licencia sin que,
por ello, el documento sea considerado modificado para los prop&oacute;sitos
de esta secci&oacute;n.</P>
<P>El hecho de agregar documentos de LDP a otros documentos o
programas en el mismo medio no conlleva a que esta licencia se aplique
a esos otros trabajos</P>
<P>Todas las traducciones, documentos derivados, o documentos
modificados que incorporen cualquier documento LDP no pueden tener
t&eacute;rminos de licencia m&aacute;s restrictivos que &eacute;stos, excepto en el caso de
requerir a los distribuidores que hagan disponible el c&oacute;digo fuente
del documento resultante.</P>
<H2><A NAME="ss1.3">1.3 Exenci&oacute;n de Responsabilidad</A>
</H2>

<P>ESTE DOCUMENTO CUBRE UN CAMPO AMPLIO Y EN CONSTANTE CAMBIO. AS&Iacute;
PUES, LA INFORMACI&Oacute;N QUE CONTIENE PUEDE SER INCORRECTA O ESTAR
DESFASADA. EL USO QUE SE HAGA DE ESTE DOCUMENTO Y TODA INFORMACI&Oacute;N EN
&Eacute;L CONTENIDA, QUEDA BAJO SU RESPONSABILIDAD. EL AUTOR (Y EL TRADUCTOR)
NO DA NING&Uacute;N TIPO DE GARANT&Iacute;A EXPL&Iacute;CITA O IMPL&Iacute;CITA.</P>
<H2><A NAME="ss1.4">1.4 Autor</A>
</H2>

<P>Se agradece el env&iacute;o de comentarios al autor en: 
<A HREF="mailto:risto.varanka@helsinki.fi">risto.varanka@helsinki.fi</A>.</P>
<P>La p&aacute;gina del autor se encuentra en:
<A HREF="http://www.helsinki.fi/~rvaranka/">http://www.helsinki.fi/~rvaranka/</A>.</P>
<H2><A NAME="ss1.5">1.5 Agradecimientos</A>
</H2>

<P>Quiero expresar mi agradecimiento a todas las personas que han
remitido sus comentarios sobre temas de lenguajes de
programaci&oacute;n. Esta informaci&oacute;n me ha proporcionado una mejor visi&oacute;n de
los diferentes lenguajes, y espero que en el futuro ayuden a este
mini-COMO a madurar con el tiempo.  Quisiera, sobre todo, agradecer a
las personas de IRCnet channel #linux: Morphy, Bluesmurf, Vadim,
Zonk^, Rikkus y otros cuyos nombres haya olvidado. Agradecimientos
tambi&eacute;n pra Stig Erik Sandoe por sus &uacute;tiles consejos.</P>
<H2><A NAME="ss1.6">1.6 Enlaces</A>
</H2>

<P>Listas exhaustivas de librer&iacute;as y herramientas de desarrollo en Linux:</P>
<P>
<UL>
<LI>
<A HREF="http://www.freshmeat.net/appindex/development/">Freshmeat</A></LI>
<LI>
<A HREF="http://www.hotfeet.ch/~gemi/LDT/">Linux Development Tools</A></LI>
<LI>
<A HREF="http://www.linuxprogramming.com/">linuxprogramming.com</A></LI>
</UL>
</P>
<P>El 
<A HREF="http://www.tuxedo.org/~esr/faqs/hacker-howto.html">Hacker FAQ</A> de Eric S.  Raymond es otro texto interesante para
los desarrolladores principiantes en Linux. Se centra an aspectos
culturales y sicol&oacute;gicos del desarrollo del c&oacute;digo libre.</P>
<P>Otros 
<A HREF="http://www.linuxdoc.org/">documentos LDP</A>
que cubren temas generales de programaci&oacute;n incluyen el Reading List
HOWTO and the Linux Programmer's Guide - se han escrito algunos m&aacute;s
para temas espec&iacute;ficos.</P>
<HR>
<A HREF="Lenguajes-Programacion-miniCOMO-2.html">Página siguiente</A>
Página anterior
<A HREF="Lenguajes-Programacion-miniCOMO.html#toc1">Índice general</A>
</BODY>
</HTML>
