<HTML>
<HEAD>
<TITLE>Servidor De Ra&iacute;ces NFS Mini-COMO: Derechos</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Servidor-Raices-NFS-Como-2.html">Siguiente</A>
<A HREF="Servidor-Raices-NFS-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Derechos</A></H2>


<P>(c) 1996 Ofer Maor
<CODE>
<A HREF="mailto:ofer@hadar.co.il">ofer@hadar.co.il</A></CODE></P>
<P>Se puede encontrar la &uacute;ltima versi&oacute;n de este Mini-COMO (HTML o texto) en
<CODE>
<A HREF="http://www.hadar.co.il/ofer/nfs-root-client/">http://www.hadar.co.il/ofer/nfs-root-client/</A></CODE></P>
<P>Salvo que exista una aclaraci&oacute;n en contra, los documentos COMO de Linux
son propiedad de sus respectivos autores. Los documentos COMO de Linux
pueden ser reproducidos o distribuidos en su totalidad o en parte, en
cualquier medio f&iacute;sico o electr&oacute;nico, siendo estas declaraciones de
derechos aplicables a todas las copias.  Se permite y fomenta las
redistribuciones comerciales, pero en esos casos el autor debe ser
notificado.</P>
<P>Todas las traducciones y trabajos derivados que incorporen cualquier
documento COMO de Linux est&aacute;n cubiertos por esta declaraci&oacute;n de derechos.
Esto es, Usted no puede producir trabajos derivados de un COMO e imponerle
restricciones adicionales.  Pueden ser concedidas excepciones a estas
reglas bajo ciertas condiciones; por favor, contacte con el coordinador de
los COMO de Linux en la direcci&oacute;n que se indica m&aacute;s adelante. </P>
<P>En resumen, deseamos promover la diseminaci&oacute;n de esta informaci&oacute;n a trav&eacute;s
de tantos canales como sea posible.  Sin embargo, se desea retener los
derechos sobre los documentos COMO, y nos gustar&iacute;a estar informados de
cualquier plan de redistribuir los COMOs. </P>
<P>Si tiene preguntas, por favor, contacte con Ofer Maor <CODE>
<A HREF="mailto:ofer@hadar.co.il">ofer@hadar.co.il</A></CODE>, o Greg
Hankins, el coordinador de los Linux COMO, <CODE>
<A HREF="mailto:gregh@sunsite.unc.edu">gregh@sunsite.unc.edu</A></CODE> v&iacute;a
correo electr&oacute;nico.</P>
<P>Si tiene cualquier cosa para agregar a este Mini-COMO, por favor env&iacute;e un
email al autor (Ofer Maor <CODE>
<A HREF="mailto:ofer@hadar.co.il">ofer@hadar.co.il</A></CODE>), con la informaci&oacute;n. Toda informaci&oacute;n nueva
que sea relevante ser&aacute; bienvenida.</P>

<H2><A NAME="ss1.1">1.1 Agradecimientos</A></H2>


<P>Me gustar&iacute;a expresar mi agradecimiento al autor de <I>Linux Con Ra&iacute;z NFS
Mini-COMO</I>, Andreas Kostyrca, <CODE>
<A HREF="mailto:andreas@medman.ag.or.at">andreas@medman.ag.or.at</A></CODE>.
A partir de su Mini-COMO pude dar los primeros pasos para montar mis
clientes con directorio ra&iacute;z por NFS.  Este Mini-Como no pretende, de
ninguna forma, suplantar dicho trabajo; lo ampl&iacute;a usando mi experiencia en
este proceso.</P>
<P>Tambi&eacute;n quiero agradecer a Mark Kushinsky, <CODE>
<A HREF="mailto:mark026@ibm.net">mark026@ibm.net</A></CODE> por pulir el
ingl&eacute;s y las expresiones de este Como, hasta lograr hacerlo mucho m&aacute;s
legible. </P>


<HR>
Anterior
<A HREF="Servidor-Raices-NFS-Como-2.html">Siguiente</A>
<A HREF="Servidor-Raices-NFS-Como.html#toc1">Indice</A>
</BODY>
</HTML>
