<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (Win95; I) [Netscape]">
   <TITLE>	LinuxFocus el 1999 de enero: "Trabajando feliz" el Teclado--la Revisi&oacute;n del Producto 

</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#336633" VLINK="#336633" ALINK="#336633">
<STYLE TYPE="text/css"> 
 <!--

	P { text-indent: 1em } 

	--> 
</STYLE>
<MAP name="top"><AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../"><AREA shape="rect" coords="423, 9, 457, 30" alt="Map" href="../map.html"><AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="../indice.html"><AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../search.html"></MAP><MAP name="bottom"><AREA shape="rect" coords="78, 0, 163, 15"   alt="News" href="../News/"><AREA shape="rect" coords="189, 0, 284, 15"  alt="Archives" href="../Archives/"><AREA shape="rect" coords="319, 0,  395, 15" alt="Links" href="../Links"><AREA shape="rect" coords="436, 0,  523, 15" alt="About LF" href="../aboutus.html"></MAP>
<CENTER><IMG ISMAP SRC="../../common/images/Topbar-es.gif" ALT="[Top Bar]" BORDER=0 usemap="#top" HEIGHT=40 WIDTH=600></CENTER>

<CENTER><IMG ISMAP SRC="../../common/images/Bottombar-es.gif" ALT="[Bottom Bar]" BORDER=0 usemap="#bottom" HEIGHT=21 WIDTH=600></CENTER>

<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Miguel-S.jpg" ALT="[Photo of the Author]" HEIGHT=168 WIDTH=129>&nbsp;
<BR><!-- -------------------------------- Nombre del autor  --><FONT COLOR="#336633"><FONT SIZE=+2>Miguel
Angel Sepulveda&nbsp;</FONT></FONT>&nbsp;
<BR><FONT COLOR="#336633">Sobre el Autor:</FONT>&nbsp;
<BR><!-- -------------------------------- Biografía -->Graduado de la Universidad
de Washington (EE.UU.) en 1993. Trabaja en investigaci&oacute;n cient&iacute;fica
en Espa&ntilde;a, Israel, Jap&oacute;n y EE.UU.. Descubri&oacute; Linux
por primera vez bajo el kernel 0.98 (Amor a primera vista). Ahora es 
Editor en Jefe de la revista de LinuxFocus en su tiempo libre.&nbsp;<!-- ------------------------ Dirección electrónica  -->&nbsp;

<P><A HREF="mailto:sepulveda@linuxfocus.org">sepulveda@linuxfocus.org</A>&nbsp;
<BR><!-- Tabla de contenidos ____________________________ --></TD>
</TR>
</TABLE>
<!--   BODY OF THE ARTICLE    -->
<H2>
<!-- Otra vez el título del artículo -->Teclado "Happy Hacking"<BR>
Revisi&oacute;n del producto</H2>
<IMG SRC="../../common/images/illustration27.jpg" ALT="[Ilustration]" HSPACE=10 HEIGHT=100 WIDTH=100>

<P><FONT COLOR="#336633"><FONT SIZE=-1>Abstract:</FONT></FONT> <FONT FACE="Helvetica,Arial,Roman"><FONT SIZE=+1>"Happy
Hacking" es un Teclado producido por PFU Am&eacute;rica Inc y sometido
a revisi&oacute;n por LinuxFocus. Este art&iacute;culo describe algunas
de las impresiones creadas por este peque&ntilde;o y robusto teclado.</FONT></FONT>
<BR>
<HR size="0" noshadow><MARQUEE style="background-color:black"><FONT COLOR="#FFFFFF"><FONT SIZE=+1>Seing
peor con Explorador. Pruebe Netscape en cambio.&nbsp;</MARQUEE><A NAME="seccion1"></A></FONT></FONT>
<H2>
Introducci&oacute;n</H2>
<p>Ésta es la primera vez que una compa&ntilde;&iacute;a comercial hace contacto
con LinuxFocus para revisar uno de sus productos. &iexcl;Las &eacute;pocas
est&aacute;n cambiando r&aacute;pidamente! Nosotros estamos felices al
ver que los fabricantes de hardware ya entienden la importancia del mercado
de Linux y se preocupan por atender a los usuarios del mismo. LinuxFocus
ayudar&aacute; complacido en este papel de medio de comunicaci&oacute;n
p&uacute;blico para revisar productos y traerles nuestro an&aacute;lisis
a los usuarios de Linux. Nuestra esperanza es que este tipo de iniciativa
animar&aacute; a m&aacute;s fabricantes a elaborar productos para Linux.</p>
<A NAME="seccion2"></A>
<H2>
Acerca de "Happy Hacking"</H2> <p>Hace unas semanas recibimos un
peque&ntilde;o paquete de <A HREF="http://pfuca.com">PFU
Am&eacute;rica Inc </A>, una sucursal de la fabrica Japonesa de
computadoras PFU Ltda. PFU Ltda. fabrica computadoras y tambi&eacute;n
ha publicado software desde los 60's y es el resultado casual de la
unión entre Fujitsu Ltda y Matsushita.</p>
<TABLE ALIGN=RIGHT BORDER=0 CELLSPACING=5 CELLPADDING=5 WIDTH="150" BGCOLOR="#F8DCA8" >
<TR>
<TD>
<CENTER><FONT FACE="helvetica"><FONT COLOR="#004080"><FONT SIZE=+2>PFU
Am&eacute;rica ha creado un teclado muy fuerte para uso pesado.&nbsp;</FONT></FONT></FONT></CENTER>
</TD>
</TR>
</TABLE>
<p>El paquete conten&iacute;a el teclado "Happy Hacking"&nbsp; (modelo PD-KB02).
El propio teclado pesa 1.1 Lb y mide 11.6 Pulgadas de ancho, 4.3 pulgadas
de profundidad&nbsp; y 1.2 de altura. Hay s&oacute;lo 60 teclas en &eacute;l.
Entre los accesorios disponibles se encuentran: cableado para Sun, PC(PS/2)
y computadoras Macintosh.</p>

<P>Las dimensiones de este teclado son su característica principal. Es PEQUE&Ntilde;O!.
Sin embargo se siente como un teclado normal. Esto se debe a que el tama&ntilde;o
y ubicaci&oacute;n de las teclas son exactamente id&eacute;nticos a un
teclado 101 est&aacute;ndard. Para imagin&aacute;rselo, simplemente piense
en un teclado 101 est&aacute;ndard sin las teclas de Funci&oacute;n, de
Cursor y de NumLock, s&oacute;lo la secci&oacute;n central.

<P>Al comienzo pens&eacute; que el teclado era extra&ntilde;o. &iquest;Qui&eacute;n
se interesar&iacute;a por un teclado que carece de la mayor&iacute;a de
las teclas normales? Entonces comprend&iacute; que yo era el candidato
perfecto. Programo bastante en casa, mi escritorio es solo un escritorio
de una computadora com&uacute;n. Sin embargo, tambi&eacute;n hago algo
del trabajo en papel y &aacute;lgebra mientras programo, es muy inc&oacute;modo
estar cambiando escritorios o moviendo el teclado por todas partes. El
teclado "Happy Hacking" se adecu&oacute; muy bien en mi escritorio para
mis h&aacute;bitos particulares de trabajo. Realmente me gusta tener mucho
espacio disponible en mi escritorio para tomar notas y para los libros
de consulta mientras programo.

<P>Realmente tardé un poco de tiempo en acostumbrarse a la falta de
las teclas comunes.  La mayor&iacute;a de las teclas que faltan se han 
 sustituido por multiples combinaciones de teclas. Hay
teclas "Opt", "Fn" y "Meta" para generar otras secuencias de tecla. En
la parte posterior del teclado encontramos un conjunto de
interruptores que cambian el modo del teclado entre Sun, PC(PS/2) o al
modo de operaci&oacute;n del Mac. Cada modo convierte las teclas DEL,
BS, Meta y Fn. La posibilidad de tener varios modos de
operaci&oacute;n ofrecidos por el mismo esquema del teclado hace que
no importe a que sistema es conectado, ya que en cierto sentido es un
teclado multiplataforma.

<P>Los usuarios con sistemas PC-AT todav&iacute;a pueden usar el teclado
pero necesitan un cable extra. En mi opini&oacute;n esta es una limitante.

<P>Us&eacute; el teclado durante tres semanas aproximadamente. Al principio
me sent&iacute;a muy raro. Las flechas tienen que ser llamadas tecleando
"Fn"+" \&lt;-."&nbsp; Ambas teclas son localizadas estrategicamente cerca
y en corto tiempo tal que me acostumbr&eacute; a usar mi mano derecha para
mover las flechas. De manera similar para el "PageUp", "PageDown", "Home",
"End", "Insert", "Stop", "PrScrn", "ScrollLock", "Pause/Break", "Clear",
"Enter" y todas las teclas de funci&oacute;n programables "F1-F12". Las
teclas F1-F12 se localizan desde la tecla "1"&nbsp; hasta&nbsp; " =."

<P>En t&eacute;rminos de calidad podemos apreciar que PFU Am&eacute;rica
ha creado un teclado muy fuerte para uso pesado. Se siente poderoso.
Yo dir&iacute;a que toma aproximadamente dos semanas acostumbrarse al nuevo
esquema de las teclas. Es dif&iacute;cil ir en contra de 20 a&ntilde;os
de costumbre con el teclado PC-AT.

<P>La principal limitaci&oacute;n que observo es que el teclado carece
de la tecla&nbsp; "Caps Lock".&nbsp; No siempre es posible acceder a
ella usando las funciones&nbsp; "Fn" o "Meta". Envi&eacute; una nota
de email al fabricante preguntando sobre este problema y ellos
respondieron que es un rasgo del dise&ntilde;o. Asumieron que los
"Hackers" realmente nunca utilizan la tecla "Caps Lock" por lo que es
necesario agregarla.  Sin embargo aclararon que bajo Linux
ser&iacute;a f&aacute;cil agregar una "Caps Lock" usando un mapeado de
teclas a trav&eacute;s de xmodmap o a&uacute;n m&aacute;s
f&aacute;cil&nbsp; <A
HREF="http://www.jwz.org/xkeycaps/">xkeycaps&nbsp;</A> (un front end
gr&aacute;fico). No obstante ser&iacute;a bueno si PFU considerara
extender su teclado en alg&uacute;n punto para a&ntilde;adir esa tecla
com&uacute;n en una de las "Fn" + combinaciones de tecla.  <BR><A
NAME="seccion3"></A>
<H2>
Referencias</H2>

<UL>
<LI>
PFU Am&eacute;rica, Inc.</LI>

<BR>2099 Gateway, Suite 750,
<BR>San Jos&eacute;, CA 95110-1017,
<LI>
<A HREF="http://www.pfuca.com/products/hhkb">www.pfuca.com/products/hhkb</A></LI>

<LI>
<A HREF="mailto:kaori@pfuca.com">Kaori Chiba, </A>Mercadeo T&eacute;cnico<A HREF="mailto:kaori@pfuca.com">,</A></LI>
</UL>

<HR noshade="noshade" size="1">
<p ALIGN=right><I>Originalmente escrito
en ingl&eacute;s. Revisado por <A HREF="mailto:jquesada@umich.edu">Jos&eacute; Quesada</A><br>
Traducido por <a href="mailto:hectorc@pasto.cetcol.net.co">Herman Rodriguez</a></i></p>

</DIV>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%" >
<TR>
<TD ALIGN=CENTER BGCOLOR="#666666"><FONT COLOR="#FFFFFF">Webpages mantained
by Miguel Angel Sep&uacute;lveda&nbsp;</FONT>&nbsp;
<BR><FONT COLOR="#FFFFFF">&copy; Miguel Angel Sepulveda 1998</FONT>&nbsp;
<BR><B><FONT COLOR="#FFFFFF">LinuxFocus 1998</FONT></B>&nbsp;</TD>
</TR>
</TABLE></CENTER>
</lu>
</BODY>
</HTML>
