<HTML>
<HEAD>
<TITLE>Unidad ZIP: mini-COMO: Uso de la unidad ZIP </TITLE>
</HEAD>
<BODY>
<A HREF="ZIP-Como-3.html">Anterior</A>
<A HREF="ZIP-Como-5.html">Siguiente</A>
<A HREF="ZIP-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="uso"></A> <A NAME="s4">4. Uso de la unidad ZIP </A></H2>


<P>Si ha compilado todos los componentes necesarios, el kernel deber&iacute;a
reconocer la controladora y unidad al arrancar. Si est&aacute; usando m&oacute;dulos,
lo siguiente se aplicar&aacute; cuando el m&oacute;dulo sea cargado.</P>
<P>La unidad versi&oacute;n SCSI y la de puerto paralelo en se comportan de forma
id&eacute;ntica, excepto que la versi&oacute;n paralelo es mas lenta. </P>

<H2><A NAME="ss4.1">4.1 Identificando la unidad al arrancar</A></H2>


<P>Cuando el sistema arranca deber&iacute;a mostrar varios fragmentos de informaci&oacute;n
sobre la controladora, unidad y el disco dentro de la unidad
<SL>Si
hemos compilado el soporte modularmente, dicha informaci&oacute;n aparecer&aacute; al
cargarse los m&oacute;dulos correspondientes</SL>
. Si no hay disco en la
unidad, parte de esta informaci&oacute;n se perder&aacute; y s&oacute;lo aparecer&aacute; cuando se
inserte un disco y haga alg&uacute;n tipo de acceso al disco. Se aconseja a
usuarios noveles arrancar con un disco metido en la unidad, ¡las cosas
resultan menos confusas de esta forma! </P>
<P>En d&oacute;nde aparecer&aacute;n estos mensajes exactamente depende de c&oacute;mo est&eacute;
configurado el sistema. A menudo ser&aacute;n mostrados en la pantalla, pero
pueden ser enviados a un fichero de registro como por ejemplo
<CODE>/var/log/messages</CODE> o <CODE>/var/adm/messages</CODE>. Normalmente, se
puede volver a visualizar el &uacute;ltimo par de pantallas de mensajes del
kernel con el comando <CODE>dmesg</CODE>, si no lo encuentra en ning&uacute;n otro
lugar, o verlo conforme se va generando (&uacute;til por ejemplo si hemos
compilado soporte modular, cuando procedamos a cargar el m&oacute;dulo las
primeras veces) con el comando <CODE>tail -f /var/log/messages</CODE></P>
<P>Si necesita ayuda por parte de alguien, una copia de este registro de
informaci&oacute;n es vital. Trate de enviar tanto como pueda de los mensajes
relevantes registrados, junto con alg&uacute;n informe sobre el fallo.</P>
<P>Aqu&iacute; se puede ver un ejemplo de lo que deber&iacute;a aparecer en los mensajes
del kernel: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
scsi0 : PPA driver version 0.26 using 8-bit mode on port 0x378.
scsi : 1 host.
  Vendor: IOMEGA    Model: ZIP 100           Rev: N*32
  Type:   Direct-Access                      ANSI SCSI revision: 02
Detected scsi disk sda at scsi0, channel 0, id 6, lun 0
scsi : detected 1 SCSI disk total.
SCSI device sda: hdwr sector= 512 bytes. Sectors= 196608 [96 MB] [0.1 GB]
  sda: Write Protect is off
Partition check:
  sda: sda1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esta salida es de un kernel 1.3.87 con una unidad ZIP paralela. La salida
exacta puede variar dependiendo de la controladora y si existe otro
dispositivo SCSI en el sistema. </P>
<P>La primera l&iacute;nea muestra el mensaje de inicializaci&oacute;n del <I>driver</I> de
bajo nivel para la controladora, en este caso <CODE>PPA</CODE>. Lo siguiente
es informaci&oacute;n de la identificaci&oacute;n de la unidad retornado por cada
dispositivo encontrado en el bus SCSI. La l&iacute;nea 5 muestra el nombre del
dispositivo asignado a la unidad, en este caso <CODE>/dev/sda</CODE>.  y la
&uacute;ltima l&iacute;nea el estado de la partici&oacute;n del disco en la unidad. Esta caso
solo tiene una partici&oacute;n, <CODE>/dev/sda1</CODE>. Esta informaci&oacute;n viene de
diferentes m&oacute;dulos del kernel, si tiene m&aacute;s de una controladora SCSI, o
varios discos, cada secci&oacute;n contendr&aacute; m&aacute;s informaci&oacute;n.</P>
<P>Por ejemplo, para la unidad SCSI, con un kernel 2.0.33, conectada a la
controladora ZIP-Zoom, con el identificativo SCSI 5: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
aha152x: BIOS test: passed, detected 1 controller(s)
aha152x0: vital data: PORTBASE=0x340,
IRQ=11, SCSI ID=7, reconnect=enabled, parity=enabled,
synchronous=disabled, delay=100, extended translation=disabled
aha152x: trying software interrupt, ok.
scsi0 : Adaptec 152x SCSI driver; $Revision: 1.18 $
scsi : 1 host.
  Vendor: IOMEGA   Model: ZIP 100          Rev: E.08
  Type:   Direct-Access                    ANSI SCSI revision: 02
Detected scsi removable disk sda at scsi0, channel 0, id 5, lun 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si utiliza otra controladora, la informaci&oacute;n ser&aacute; similar a partir de la
l&iacute;nea 8. </P>
<P>Y por &uacute;ltimo, si la unidad es IDE:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
hdc: IOMEGA ZIP 100 ATAPI, ATAPI FLOPPY drive
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Que en este caso est&aacute; como dispositivo maestro del segundo canal IDE. </P>
<P>Si est&aacute; usando un disco <EM>virgen</EM> (sin usar), directamente de
Iomega, el chequeo de partici&oacute;n deber&iacute;a mostrar una partici&oacute;n,
<CODE>/dev/sda4</CODE>.  Si tiene otros dispositivos SCSI la unidad ZIP podr&iacute;a
aparecer en otro nombre de dispositivo como <CODE>/dev/sdb</CODE>, por eso es
interesante comprobar estos mensajes.</P>
<P>Si estas l&iacute;neas no aparecen, entonces algo esta mal configurado: o el
hardware en s&iacute;, o el kernel. Compruebe todo cuidadosamente antes de enviar
emails. </P>
<P>Si la l&iacute;nea <CODE>scsi0:</CODE> no aparece, entonces esta mal configurada la
controladora y su driver correctamente. Algunos drivers dan una pista de
lo que esta mal. Si el driver no es detectado, probablemente haya un
problema con el cable. Si no es asignado el nombre de unidad probablemente
olvid&oacute; incluir soporte para discos SCSI cuando recompil&oacute; el kernel. </P>
<P>Compruebe los ficheros <CODE>README</CODE> en <CODE>drivers/scsi</CODE> y los
<I>SCSI HOWTO</I> para otros aspectos relativos a la depuraci&oacute;n de la
instalaci&oacute;n.</P>


<H2><A NAME="ss4.2">4.2 <CODE>Fdisk, mke2fs, mount,</CODE> etc.</A></H2>


<P>Una vez conozca el nombre de la unidad ZIP, estar&aacute; listo. Puede manipular
la unidad con los comandos t&iacute;picos del gesti&oacute;n de discos del Linux.
<CODE>fdisk</CODE> (o quiz&aacute;s <CODE>cfdisk</CODE>) es usado para manipular las
tablas de partici&oacute;n en el disco.  <CODE>mke2fs</CODE> puede ser usado para
formatear una partici&oacute;n con el sistema de ficheros <EM>ext2</EM> el m&aacute;s
usado en Linux.  <CODE>mount</CODE> es usado para conectar una partici&oacute;n
formateada a la jerarqu&iacute;a de directorios. </P>
<P>Deber&iacute;a estudiar las p&aacute;ginas del manual de estas herramientas si no est&aacute;
familiarizado con ellas. Tenga cuidado: hay varias versiones diferentes
del programa <CODE>fdisk</CODE>, sea cuidadoso. </P>
<P>Describir&eacute; dos situaciones comunes:</P>

<H3>Un disco formateado con DOS</H3>


<P>Si tiene un disco ZIP con una estructura de ficheros DOS que fue creado
originalmente por las herramientas de <I>Iomega</I>, la detecci&oacute;n de la
partici&oacute;n deber&iacute;a decir que en el disco hay una partici&oacute;n,
<CODE>/dev/sda4</CODE>.</P>
<P>Cree un directorio donde montar el disco, como por ejemplo <CODE>/zip</CODE>,
y m&oacute;ntelo como un sistema de ficheros DOS:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mkdir /zip
mount -t msdos /dev/sda4 /zip
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ahora, los ficheros en el disco deber&iacute;an aparecer en <CODE>/zip</CODE>. 
Mientras el disco est&eacute; montado, no debe poder sacar el disco de la unidad.
Cuando termines con el disco puede desmontarlo para extraer el disco y
liberarlo de la jerarqu&iacute;a de directorios:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
umount /zip
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Una vez que haya creado un punto de montaje <CODE>/zip</CODE> no necesitas
hacerlo otra vez, as&iacute; puedes m&aacute;s tarde volver a montar cualquier otra
cosa.</P>

<H3>Re-formatear como disco nativo de Linux</H3>


<P>Si quiere borrar un disco ZIP y hacer un sistema de ficheros nativo de
Linux, deber&aacute; usar <CODE>fdisk</CODE> en el disco entero:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
fdisk /dev/sda
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y borrar cualquier partici&oacute;n (con el comando <CODE>d</CODE>). Cree una nueva
partici&oacute;n con el comando <CODE>n</CODE>, que sea partici&oacute;n primaria
<CODE>1</CODE>, usar <CODE>w</CODE> para escribir la tabla de particiones al disco
y salir con <CODE>q</CODE>. </P>
<P>Formateo de la partici&oacute;n:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mke2fs /dev/sda1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(El <CODE>1</CODE> es el n&uacute;mero que dio a esta partici&oacute;n con el
<CODE>fdisk</CODE>).  Ahora podr&aacute; montar el disco: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mount -t ext2 /dev/sda1 /zip
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(re-usando el punto de montaje que antes creamos).</P>

<H3>El disco <I>ZIP Tools</I>.</H3>


<P>Hay trabajo extra que hacer si quiere usar el disco que viene con la
unidad ZIP. De f&aacute;brica, el disco est&aacute; protegido contra escritura por
software. La mayor&iacute;a de la gente ha desprotegido el disco bajo DOS antes
de intentar usarlo desde Linux
<SL>Y con una unidad de puerto
paralelo, con la SCSI <B>no</B> suele poder hacerse</SL>
. Linux no
puede acceder a un disco protegido, y <EM>debe</EM> ser desprotegido con
la herramientas de Iomega.</P>
<P>Se espera que pronto est&eacute; disponible un programa nativo de Linux para
manejar la protecci&oacute;n de escritura.</P>

<H3>Eliminaci&oacute;n de la protecci&oacute;n software desde Linux</H3>


<P><B>Nota del Revisor:</B> <BR></P>
<P>Mi experiencia es que a menos que se use tanto un zip paralelo, y las
herramientas windows, es imposible desproteger un zip <I>por software</I> o
civilizadamente.</P>
<P>Pero hay un <I>truco</I>: </P>
<P>
<OL>
<LI>Inserte un disco no protegido. (El <I>Zip-Tools</I>, por ejemplo.) 
</LI>
<LI>Extr&aacute;igalo mediante el sistema de eyecci&oacute;n de emergencia,
introduciendo una aguja o similar por el orificio que hay en la esquina
superior izquierda de la unidad. 
</LI>
<LI>Introduzca el disco protegido y haga con &eacute;l lo que quiera; la unidad
zip no notar&aacute; el cambio.</LI>
</OL>
</P>
<P><CODE>:-)</CODE> Por supuesto, todo ello bajo su cuenta y riesgo; a m&iacute; y a otros
nos ha funcionado, pero no asumo ninguna responsabilidad... </P>


<H2><A NAME="ss4.3">4.3 Expulsi&oacute;n del disco</A></H2>


<P>Solo se puede expulsar un disco cuando no est&eacute; montado. Actualmente, no
hay un comando Linux para expulsar el disco, as&iacute; que se debe pulsar el
bot&oacute;n que tiene la unidad para expulsar el disco.</P>
<P>Linux se asegura de que todos los datos est&eacute;n grabados en el disco antes
de desbloquearlo. </P>
<P>Se espera un nuevo programa <I>ZIP Tools</I> para Linux que soportar&aacute;
algunas posibilidades especiales de Iomega (incluyendo la expulsi&oacute;n por
software y la protecci&oacute;n contra escritura) tanto en versi&oacute;n SCSI como
paralela.</P>


<HR>
<A HREF="ZIP-Como-3.html">Anterior</A>
<A HREF="ZIP-Como-5.html">Siguiente</A>
<A HREF="ZIP-Como.html#toc4">Indice</A>
</BODY>
</HTML>
