<HTML>
<HEAD>
<TITLE>Unidad ZIP: mini-COMO: La unidad ZIP</TITLE>
</HEAD>
<BODY>
<A HREF="ZIP-Como-1.html">Anterior</A>
<A HREF="ZIP-Como-3.html">Siguiente</A>
<A HREF="ZIP-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. La unidad ZIP</A></H2>


<P>Hay cuatro versiones de la unidad Iomega ZIP. Todas ellas aceptan
cartuchos especiales parecidos a los diskettes de 3.5" con capacidad de
<EM>100 megas</EM>.  Los discos normalmente tienen 96 cilindros de 2048
sectores conteniendo 512 bytes cada uno. Esto ser&iacute;a normalmente llamado 96
megas.</P>
<P>Una versi&oacute;n es una unidad interna de media altura 5.25", con interfaz
SCSI, otras dos son unidades externas en peque&ntilde;as unidades de pl&aacute;stico
azules de poco peso, alimentadas mediante un transformador. Las unidades
externas vienen en versi&oacute;n SCSI y puerto paralelo, y las internas en SCSI
e IDE. </P>
<P>Todas las unidades tienen un bot&oacute;n redondo en el frontal de la unidad. 
Este bot&oacute;n es para expulsar el disco. Linux impide la expulsi&oacute;n mientras
se la unidad est&eacute; montada, pero si el bot&oacute;n es pulsado mientras est&eacute;
bloqueada, la unidad ZIP recordar&aacute; y expulsar&aacute; el disco tan pronto como el
software desbloquee (desmonte) la unidad. </P>

<H2><A NAME="ss2.1">2.1 Versi&oacute;n IDE</A></H2>


<P>Con esta versi&oacute;n, todo lo aplicable a dispositivos IDE entra en juego: 
b&aacute;sicamente, la unidad puede colocarse como maestra o esclava del bus IDE
en donde se ubique, y para ello habr&aacute; que hacer uso de los <EM>jumpers</EM> o
puentes correspondientes, situados en la parte trasera de la unidad. Por
defecto viene configurada como esclava; si la coloca en el mismo bus que
su disco duro, o en el que ya tenga un CD-Rom configurado como maestro, no
tendr&aacute; que hacer modificaci&oacute;n alguna. Si la coloca como &uacute;nico dispositivo
en alguno de los buses, deber&aacute; colocar los puentes (<I>jumpers</I>) en la
posici&oacute;n <I>master</I>. </P>


<H2><A NAME="ss2.2">2.2 Versi&oacute;n SCSI</A></H2>


<P>La versi&oacute;n SCSI externa de la unidad ZIP tiene 2 conectores DB25F, y dos
interruptores de configuraci&oacute;n. Un interruptor selecciona la direcci&oacute;n de
la unidad: esta elecci&oacute;n esta limitada a 5 y 6. El otro activa un
terminador interno, en caso de que la unidad sea la &uacute;ltima de la cadena.
Los conectores SCSI de 25 patillas son del estilo de <EM>Macintosh</EM>.</P>
<P>La unidad viene con cable tipo <EM>Macintosh</EM>, pero el cable y los
convertidores est&aacute;ndar son f&aacute;ciles de obtener
<SL>N del T: Los cables
no son TAN f&aacute;ciles de conseguir y son MUY caros.  Un cable con mini-SCSI y
DB25M a los extremos cuesta +8.000.</SL>
 si tu tarjeta SCSI viene
con conector Centronics o conector mini SCSI. </P>
<P>No he visto la unidad SCSI interna, pero esperar&iacute;a que tuviese un conector
est&aacute;ndar de 50 patillas DIP.
<SL>N. del Revisor <BR> Soy propietario
de una y lo certifico, tiene un conector est&aacute;ndar SCSI II, y dos grupos de
puentes o <EM>jumpers</EM>; uno de ellos, de cuatro puentes, sirve para
seleccionar combin&aacute;ndolos el ID SCSI, que es el 5 por defecto, y el otro
es para activar o desactivar la terminaci&oacute;n en el caso en que el ZIP fuese
o no la &uacute;ltima unidad de la cadena SCSI.</SL>
</P>
<P>Aseg&uacute;rese de que la direcci&oacute;n que elija no entra en conflicto con
cualquier otro dispositivo SCSI que pueda tener en el mismo bus. 
Aseg&uacute;rese tambi&eacute;n de que la &uacute;ltima unidad en la cadena tiene el terminador
activado, o un terminador instalado.</P>
<P>Si tiene un disco o CD-Rom SCSI interno, y conecta su unidad ZIP al
adaptador existente, deber&iacute;a comprobar si existe alg&uacute;n terminador en la
tarjeta que se debiera quitar. Solo los dos extremos del bus SCSI deben
estar terminados. Si el bus es parcialmente interno y parcialmente
externo, deber&iacute;a haber un terminador en el &uacute;ltimo dispositivo externo y
otro en el &uacute;ltimo dispositivo interno, pero ninguno en la propia tarjeta
SCSI. </P>
<P>Aseg&uacute;rese de que todos los cables est&aacute;n firmemente conectados. </P>


<H2><A NAME="ss2.3">2.3 La controladora ZIP <I>Zoom</I></A></H2>


<P>Iomega vende una controladora bajo el nombre <EM>ZIP Zoom</EM>. &Eacute;sta est&aacute;
basada en el dise&ntilde;o de la familia de controladoras <EM>Adaptec
AHA1520</EM>. Tiene un conector DB25F externo tipo Macintosh, compatible
con el cable que viene con la unidad ZIP. </P>
<P>Linux Soporta esta controladora con el driver <CODE>aha152x</CODE>. Ver secci&oacute;n
<A HREF="ZIP-Como-3.html#aha152x">aha152x</A></P>


<H2><A NAME="ss2.4">2.4 Versi&oacute;n de puerto Paralelo</A></H2>


<P>La unidad Zip de puerto paralelo tambi&eacute;n tiene dos conectores DB25, el
macho (DB25M) debe conectarse mediante el cable suministrado al puerto
paralelo del ordenador. El otro (hembra, DB25F) es para conectar una
impresora <EM>en cadena</EM>. Actualmente, Linux no soporta el uso
simult&aacute;neo de ambos, unidad ZIP e impresora. Es posible cargar m&oacute;dulos. No
hay interruptores de configuraci&oacute;n. </P>
<P>La unidad ZIP de puerto paralelo es compatible con varios tipos de puertos
paralelos, pero actualmente el driver de Linux solo soporta los puertos
<EM>est&aacute;ndar</EM> y <EM>bi-direccional</EM>. Si su puerto paralelo tiene
interruptores de configuraci&oacute;n (en hardware o en pantallas del setup de la
CMOS) aseg&uacute;rese de configurar el puerto en uno de los soportados.</P>
<P>Aseg&uacute;rese de que todos los cables est&aacute;n firmemente conectados.</P>


<HR>
<A HREF="ZIP-Como-1.html">Anterior</A>
<A HREF="ZIP-Como-3.html">Siguiente</A>
<A HREF="ZIP-Como.html#toc2">Indice</A>
</BODY>
</HTML>
