<HTML>
<HEAD>
<TITLE>Unidad ZIP: mini-COMO: Preguntas de Uso Frecuente</TITLE>
</HEAD>
<BODY>
<A HREF="ZIP-Como-4.html">Anterior</A>
<A HREF="ZIP-Como-6.html">Siguiente</A>
<A HREF="ZIP-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Preguntas de Uso Frecuente</A></H2>


<P>Estas son algunas de las preguntas que se hacen. Por favor, ¡lea las
respuestas aqu&iacute; antes de volver a preguntarlas ! </P>

<H2><A NAME="ss5.1">5.1 ¿Puedo arrancar desde la unidad ZIP?</A></H2>


<P>Esto depende de su controladora. Si la unidad es SCSI interna, y le
asignamos las IDs 0 o 1 a la unidad, la controladora lo arrancar&aacute;
autom&aacute;ticamente. Si tiene la unidad SCSI externa, y la controladora tiene
BIOS ROM con c&oacute;digo que permita arrancar desde los <I>IDs</I> 5 &oacute; 6,
entonces s&iacute;, podr&aacute; arrancar desde su unidad ZIP. No puede arrancar desde
una unidad de puerto paralelo (directamente. s&iacute; usando un disquete de
arranque). </P>
<P>Si tiene DOS en su disco principal y quiere arrancar Linux desde un disco
ZIP, puede usar el cargador de arranque LOADLIN. La imagen del kernel debe
estar en alg&uacute;n lugar en el disco DOS, pero el resto del sistema Linux
puede estar en el ZIP. Aseg&uacute;rese de que el kernel que va a usar tiene
incluidos los drivers necesarios.</P>
<P>Por lo que yo conozco, no hay discos de arranque de instalaci&oacute;n para
ninguna de la distribuciones m&aacute;s populares que contengan el driver para la
unidad ZIP de puerto paralelo, pero esto puede cambiar cuando la versi&oacute;n
2.0 salga. </P>


<H2><A NAME="ss5.2">5.2 ¿Por qu&eacute; Iomega usa la partici&oacute;n n&uacute;mero 4 ?</A></H2>


<P>Esta es la pregunta m&aacute;s realizada, pero creo que nadie tiene una respuesta
definitiva a esta pregunta. Quiz&aacute;s no haya una buena raz&oacute;n. </P>


<H2><A NAME="ss5.3">5.3 ¿C&oacute;mo puedo montar el disco al arrancar?</A></H2>


<P>Todo lo que se necesita es a&ntilde;adir una l&iacute;nea al fichero
<CODE>/etc/fstab</CODE>. Por ejemplo, si siempre se tiene un disco DOS en la
unidad cuando se arranca, podr&iacute;a ser: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/dev/sda4   /zip  msdos  defaults  0 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Dependiendo en la distribuci&oacute;n, los scripts de inicializaci&oacute;n pueden
intentar ejecutar <CODE>fsck</CODE> en las particiones listadas en el fichero
<CODE>/etc/fstab</CODE>.  Cuidado ya que esto podr&iacute;a causar problemas si no
hay un disco metido en la unidad cuando se arrancar Linux, o si hay un
disco err&oacute;neo
<SL>N del T: Respecto a lo indicado en
<CODE>/etc/fstab</CODE> en cuanto a particiones y sistema de
ficheros</SL>
. </P>


<H2><A NAME="ss5.4">5.4 ¿Qu&eacute; ocurre si no hay un disco metido cuando arranco?</A></H2>


<P>El kernel intentar&aacute; leer la tabla de particiones, pero la operaci&oacute;n
expirar&aacute;.  No hay nada por que preocuparse. Una vez insertado el disco, e
intentando hacer algo con &eacute;l, el kernel se dar&aacute; cuenta de que hay un disco
ahora y re-escanear&aacute; la tabla de particiones. </P>
<P>AYUDA: Cuando cambie de disco, es una buena idea que uses fdisk para
chequear la estructura de la partici&oacute;n en el nuevo disco. </P>
<P>La BIOS de algunas controladoras SCSI intentar&aacute;n leer la tabla de
particiones en el disco durante el arranque. Si no puedes desactivar este
chequeo, siempre puedes forzar el arranque con un disco metido en la
unidad. </P>


<H2><A NAME="ss5.5">5.5 ¿Qu&eacute; controladoras SCSI son compatibles con la unidad ZIP?</A></H2>


<P>Iomega tiene una lista de las controladoras compatibles en:</P>
<P><CODE>
<A HREF="http://www.iomega.com/techs/zip/what063.html">http://www.iomega.com/techs/zip/what063.html</A></CODE></P>


<H2><A NAME="ss5.6">5.6 ¿Puedo usar la unidad de puerto paralelo como un disco SCSI real?</A></H2>


<P>El adaptador PPA-3 parallel-to-SCSI esta implementado como un chip ASIC
&uacute;nico que Iomega llama <EM>VPI0</EM>.  Est&aacute; integrado en la controladora
de la unidad ZIP. Hay un bus SCSI presente, pero no en una forma &uacute;til. </P>
<P>Aunque he intentado comparar las dos controladoras, parece l&oacute;gico que el
VPI0 reemplace los circuitos de <I>buffer</I> el&eacute;ctricos convencionales que
ser&iacute;an necesarios si el bus SCSI estuviese extendido fuera de la caja. </P>


<H2><A NAME="ss5.7">5.7 ¿Puedo conectar una impresora con la unidad de puerto paralelo?</A></H2>


<P>S&iacute;, pero actualmente, no se puede tener los drivers <CODE>lp</CODE> y
<CODE>ppa</CODE> activos a la vez en el mismo puerto paralelo. Se ha dise&ntilde;ado
un protocolo de compartici&oacute;n y esta en las primeras etapas de
implementaci&oacute;n, pero no estar&aacute; disponible antes de que salga el kernel
2.0. </P>
<P>Mientras tanto, se puede conectar a la vez la impresora y la unidad ZIP
sin tener que rearrancar el sistema, si se tienen los drivers <CODE>lp</CODE>
y <CODE>ppa</CODE> como <EM>m&oacute;dulos</EM>. Si se tienen as&iacute;, entonces cuando se
quiera imprimir se carga el m&oacute;dulo (<CODE>insmod lp</CODE>), y cuando se
quiere utilizar la unidad ZIP se carga el driver <CODE>ppa</CODE>. </P>
<P>Por supuesto, si se tienen <EM>dos</EM> puertos paralelos, se puede usar
uno para imprimir y otro para la unidad ZIP. Se compila el kernel con
ambos drivers <CODE>lp</CODE> y <CODE>ppa</CODE> incluidos, a&ntilde;adiendo entonces los
par&aacute;metros de configuraci&oacute;n apropiados en la l&iacute;nea de comandos del kernel. 
Por ejemplo, si se usa LILO y se tiene la impresora en <CODE>0x378</CODE> y el ZIP
en <CODE>0x3bc</CODE> se puede a&ntilde;adir la siguiente l&iacute;nea en el fichero
<CODE>/etc/lilo.conf</CODE>. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
append = &quot;lp=0x378 ppa=0x3bc&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss5.8">5.8 ¿Hay alg&uacute;n plan de soportar los puertos EPP/ECP en PPA?</A></H2>


<P><CODE>ppa</CODE> fue inicialmente desarrollado sin contar con el beneficio de
ninguna especificaci&oacute;n t&eacute;cnica para el protocolo de comandos en el bus
paralelo. Sin embargo, se us&oacute; el emulador del DOS para reunir informaci&oacute;n
a fin de tratar de averiguar mediante ingenier&iacute;a inversa c&oacute;mo funcionaba
dicho protocolo. Fue imposible conseguir que la unidad funcionase en el
modo mejorado bajo el emulador.</P>
<P>El manual de referencia t&eacute;cnica de Iomega se encuentra ahora disponible, y
he localizado la hoja del chip de puerto paralelo mejorado, as&iacute; que es
posible mejorar el driver. </P>


<H2><A NAME="ss5.9">5.9 ¿Puede usarse el PPA con unidades de cinta de puerto paralelo de</A>Iomega?</H2>


<P>No. Esas son unidades de cinta de disquetera, el SCSI no esta involucrado.</P>
<P>Varias personas han mostrado inter&eacute;s en aplicar mis m&eacute;todos para intentar
determinar el protocolo y desarrollo de un driver para esas unidades de
cinta. El primer paso en ese proceso es conseguir un driver para DOS que
funcione bajo DOSemu. No he o&iacute;do a&uacute;n que nadie lo haya conseguido. </P>


<H2><A NAME="ss5.10">5.10 ¿Funcionar&aacute; el <CODE>PPA</CODE> con la unidad <I>SyQuest EZ135</I> de puerto</A>paralelo ? </H2>


<P>No. La <I>EX135</I> es una unidad <I>IDE</I> con un conversor de puerto
paralelo <EM>ShuttlePort</EM> a IDE integrado. </P>
<P>La labor ha comenzado por decodificar el protocolo, con la intenci&oacute;n de
escribir un driver para Linux del EZ135 de puerto paralelo. Tengo el
protocolo b&aacute;sico funcionando, pero no tengo idea de cuando estar&aacute;
disponible un driver completo. </P>
<P>Eche un vistazo a mi <CODE>
<A HREF="http://www.torque.net/ez135.html">http://www.torque.net/ez135.html</A></CODE>, Buscar&eacute; eventualmente alg&uacute;n
<I>beta tester</I>. </P>


<HR>
<A HREF="ZIP-Como-4.html">Anterior</A>
<A HREF="ZIP-Como-6.html">Siguiente</A>
<A HREF="ZIP-Como.html#toc5">Indice</A>
</BODY>
</HTML>
