<HTML>
<HEAD>
<TITLE>CDROM-COMO: Instalaci&oacute;n</TITLE>
</HEAD>
<BODY>
<A HREF="CDRom-Como-3.html">Anterior</A>
<A HREF="CDRom-Como-5.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Instalaci&oacute;n</A></H2>


<P>La instalaci&oacute;n de un CD-ROM bajo Linux incluye los siguientes pasos:</P>
<P>
<OL>
<LI>Instalar el hardware</LI>
<LI>Configurar y recompilar el n&uacute;cleo</LI>
<LI>Crear los ficheros de dispositivo (<I>device files</I>) y ajustar los
par&aacute;metros temporales de arranque (<I>boot time parameters</I>) </LI>
<LI>Arrancar con el nuevo n&uacute;cleo</LI>
<LI>Montar la unidad</LI>
</OL>
</P>
<P>Vamos a seguir paso a paso este proceso:</P>

<H2><A NAME="ss4.1">4.1 Instalaci&oacute;n del Hardware</A></H2>


<P>Siga detenidamente la gu&iacute;a de instalaci&oacute;n del fabricante o consiga que su
distribuidor, o alg&uacute;n amigo, le instale la unidad. Los detalles variar&aacute;n
dependiendo de si la unidad es interna o externa, y seg&uacute;n el tipo de
interfase empleada. Linux no requiere ning&uacute;n tipo de instalaci&oacute;n especial.
Aseg&uacute;rese de ajustar correctamente los jumpers (puentes) de la unidad y/o
de la interfase; algunos controladores del n&uacute;cleo proporcionan informaci&oacute;n
al respecto en sus archivos README. </P>
<P>Tal y como viene explicado en el fichero <CODE>ide-cd</CODE>, las unidades
ATAPI deben de estar configuradas como "single" o "master", y nunca como
"slave" cuando solamente hay un dispositivo IDE conectado a la interfase
(aunque esta limitaci&oacute;n desaparece con los n&uacute;cleos m&aacute;s recientes).</P>


<H2><A NAME="ss4.2">4.2 Configuraci&oacute;n y Construcci&oacute;n del N&uacute;cleo</A></H2>


<P>Para instalar Linux desde un CDROM, seguramente emplee un disco llamado
"boot" y otro llamado "root" (o similares) que vienen incluidos en la
distribuci&oacute;n. Si es posible, escoja un disco de arranque (boot) que posea
el controlador adecuado para su unidad. Si le resulta imposible encontrar
un disco de arranque con el controlador preciso, tiene varias opciones:</P>
<P>
<OL>
<LI>Instalar Linux a trav&eacute;s de una red.</LI>
<LI>Arrancar el DOS, y volcar los ficheros de Linux al disco duro.</LI>
<LI>Arrancar DOS, y crear una serie de discos que utilizar&aacute; para
instalar Linux. </LI>
<LI>Encontrar a alguien que le construya un disco de arranque con el
controlador que Vd. necesita. </LI>
</OL>
</P>
<P>En <CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/Installation-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/Installation-HOWTO.html</A></CODE>
encontrar&aacute; m&aacute;s informaci&oacute;n sobre la instalaci&oacute;n de Linux.</P>
<P>Si ha adquirido una distribuci&oacute;n de Linux en CDROM, seguramente incluir&aacute;
las instrucciones precisas para su instalaci&oacute;n (impresas en el follet&iacute;n de
la caja y/o en alg&uacute;n fichero del disco). </P>
<P>Una vez que Linux ha sido instalado, probablemente querr&aacute; recompilar el
n&uacute;cleo. Hay varias razones para ello: </P>
<P>
<UL>
<LI>para el habilitar el soporte del CDROM  y dem&aacute;s hardware</LI>
<LI>para actualizarse a una nueva versi&oacute;n del n&uacute;cleo</LI>
<LI>para liberar recursos de memoria, minimizando el tama&ntilde;o del n&uacute;cleo</LI>
</UL>
</P>
<P>Consulte el <CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/Kernel-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/Kernel-HOWTO.html</A></CODE> o su
traducci&oacute;n al castellano, el <CODE>
<A HREF="http://www.insflug.org/howtos/online/kernel/Kernel-Como.html">http://www.insflug.org/howtos/online/kernel/Kernel-Como.html</A></CODE>
para m&aacute;s informaci&oacute;n al respecto. Aqu&iacute; nos limitaremos a los aspectos
relacionados con el CDROM. </P>
<P>Obviamente, deber&aacute; compilar el soporte para su unidad de CD-ROM al hacer
"<CODE>make config</CODE>". </P>
<P>Si tiene una unidad ATAPI, deber&aacute; contestar afirmativamente, es decir,
<CODE>y(es)</CODE> a las siguientes preguntas: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Enhanced IDE/MFM/RLL disk/cdrom/tape support (CONFIG_BLK_DEV_IDE) [Y/n/?]
Include IDE/ATAPI CDROM support (CONFIG_BLK_DEV_IDECD) [Y/n/?]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para unidades SCSI CD-ROM, ser&aacute;n las opciones:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
SCSI support (CONFIG_SCSI) [Y/n/m/?]
SCSI CD-ROM support (CONFIG_BLK_DEV_SR) [Y/n/m/?]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>No olvide configurar el soporte para la controladora SCSI, p.e:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Adaptec AHA152X support (CONFIG_SCSI_AHA152X) [Y/n/m/?]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para las unidades propietarias, seleccione el controlador correspondiente.
Puede servirse de la tabla anterior para determinar el controlador que ha
de emplear. </P>
<P>Virtualmente, todos los CDROM trabajan con el sistema de ficheros
ISO-9660, por lo que ser&aacute; imprescindible habilitar la opci&oacute;n: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ISO9660 cdrom filesystem support (CONFIG_ISO9660_FS) [Y/n/m/?]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Aunque no es imprescindible (en lo que al funcionamiento del CDROM
respecta), si tiene una tarjeta de sonido soportada por Linux,
probablemente desear&aacute; habilitarla y configurar el controlador de sonido. 
Para ello, le ser&aacute; de gran inter&eacute;s y utilidad consultar el <CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/Sound-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/Sound-HOWTO.html</A></CODE>;  o su
traducci&oacute;n, <CODE>
<A HREF="http://www.insflug.org/howtos/online/sonido/Sonido-Como.html">http://www.insflug.org/howtos/online/sonido/Sonido-Como.html</A></CODE>. </P>
<P>Luego, contin&uacute;e con el procedimiento habitual de compilaci&oacute;n e
instalaci&oacute;n del n&uacute;cleo. No arranque el nuevo n&uacute;cleo hasta que haya creado
los ficheros de dispositivo y ajustado los par&aacute;metros temporales de
arranque, tal y como se describe en la siguiente secci&oacute;n.</P>
<P>El sistema de ficheros ISO-9660 y la pr&aacute;ctica totalidad de los
controladores se pueden compilar como m&oacute;dulos cargables. Ello har&aacute; que los
controladores se carguen y descarguen de la memoria sin tener que
reinicializar el sistema, con lo que liberaremos memoria. Al principio,
recomendar&iacute;a incluir los controladores de CD-ROM compilados en el n&uacute;cleo. 
Para m&aacute;s informaci&oacute;n acerca de c&oacute;mo utilizar los m&oacute;dulos, le vuelvo a
referir al <CODE>
<A HREF="http://www.insflug.org/howtos/online/kernel/Kernel-Como.html">http://www.insflug.org/howtos/online/kernel/Kernel-Como.html</A></CODE>.</P>
<P>Si su n&uacute;cleo no soporta alguna de las unidades detalladas, quiz&aacute;s deber&iacute;a
actualizarse a una versi&oacute;n m&aacute;s reciente. </P>
<P>Si necesita alguno de los controladores que no vienen incluidos con el
n&uacute;cleo, seguramente lo podr&aacute; encontrar como parche: de nuevo le remito al
<CODE>
<A HREF="http://www.insflug.org/howtos/online/kernel/Kernel-Como.html">http://www.insflug.org/howtos/online/kernel/Kernel-Como.html</A></CODE></P>
<P>Hay un programa que le ayudar&aacute; a configurar el n&uacute;cleo por medio de men&uacute;s: 
<CODE>make menuconfig</CODE>. Y otro basado en las X11: <CODE>make xconfig</CODE>. Los
tres m&eacute;todos proporcionan las indicaciones oportunas.</P>


<H2><A NAME="ss4.3">4.3 Creaci&oacute;n de los Ficheros de Dispositivo (<I>device files</I>) y Ajuste</A>de los Par&aacute;metros Temporales de Arranque</H2>


<P>El n&uacute;cleo utiliza los ficheros de dispositivo para identificar el
controlador con el que va a trabajar. En una distribuci&oacute;n de Linux
est&aacute;ndar, dichos ficheros de dispositivo se crean durante el proceso de
instalaci&oacute;n. En la distribuci&oacute;n Slackware hay una <I>utilidad de
configuraci&oacute;n</I> por medio de men&uacute;s que incluye la configuraci&oacute;n del
CD-ROM. Casi todos los sistemas cuentan con el script
<CODE>/dev/MAKEDEV</CODE>. O puede seguir el procedimiento que se detalla a
continuaci&oacute;n. Si emplea alguno de los m&eacute;todos anteriores, tambi&eacute;n le sera
de gran utilidad confrontar sus ficheros de dispositivo con la informaci&oacute;n
de esta secci&oacute;n. </P>
<P>Para crear los ficheros de dispositivo, tendr&aacute; que introducir desde el la
l&iacute;nea de comandos las &oacute;rdenes adecuadas para su unidad. Esta tarea habr&aacute;
de ser realizada en modo <CODE>root</CODE> (superusuario). T&eacute;ngase en cuenta
que algunas distribuciones utilizan nombres distintos a los citados para
los dispositivos de CD-ROM.</P>
<P>Tambi&eacute;n es recomendable que cree un enlace simb&oacute;lico a la unidad; as&iacute;, le
ser&aacute; m&aacute;s f&aacute;cil acordarse. Por ejemplo, para una unidad IDE que sea el
segundo dispositivo y se halle conectada a la interfase secundaria, el
enlace se har&iacute;a de la siguiente manera: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ln -s /dev/hdd /dev/cdrom
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si va a reproducir CDs de audio, bueno ser&aacute; que proteja el fichero de
dispositivo (no el enlace simb&oacute;lico) antes de permitir su lectura a todos
los usuarios, as&iacute;: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
chmod 664 /dev/hdd
ls -l /dev/hdd
brw-rw-r--   1 root     disk      22,  64 Feb  4  1995 /dev/hdd
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Cuando arranca Linux, los distintos controladores tratan de determinar si
los dispositivos correspondientes se encuentran disponibles. Por lo
general, lo hacen probando diferentes direcciones. La mayor&iacute;a realizan la
autoprueba (autoprobe) con muchas direcciones, pero a causa de las
diferentes configuraciones posibles, conflictos entre dispositivos y
limitaciones del hardware, los controladores necesitan a veces ayuda para
poder identificar las direcciones y dem&aacute;s par&aacute;metros. Casi todos los
controladores soportan alguna opci&oacute;n en la l&iacute;nea de comandos del n&uacute;cleo,
desde la cual se transfiere dicha informaci&oacute;n al controlador. Esta
operaci&oacute;n podemos realizarla de manera interactiva o, m&aacute;s frecuentemente,
a trav&eacute;s del gestor de arranque (<I>boot loader</I>). Si utiliza LILO, deber&aacute; 
a&ntilde;adir el comando <CODE>append</CODE>, tal y como sigue, en el fichero
<CODE>/etc/lilo.conf</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
append = &quot;sbpcd=0x230,SoundBlaster&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Consulte la documentaci&oacute;n de LILO para mas informaci&oacute;n.</P>
<P>A continuaci&oacute;n se detallan los aspectos relativos a los diferentes
controladores, incluyendo los ficheros de dispositivo, los par&aacute;metros de
arranque y las posibilidades de &eacute;stos. Es probable que s&oacute;lo necesite leer
el apartado referido a su unidad. Los archivos README se encuentran
habitualmente en el directorio 
<CODE>/usr/src/linux/Documentation/cdrom</CODE>. </P>

<H3>Controlador <CODE>sbpcd</CODE></H3>


<P>
<PRE>
          Autor principal: Eberhard Moenkeberg (emoenke@gwdg.de)
     Soporta Multi-sesion: si (pero no todas las unidades)
  Soporta Varias Unidades: si
  Soporta Carga en Modulo: si
         Lectura de Audio: si (la CR-562, CR-563 y CD-200 unicamente)
              Auto-prueba: si
   Fichero de Dispositivo: /dev/sbpcd, mayor 25
 Fichero de Configuracion: sbpcd.h
        Opcion del Nucleo: Matsushita/Panasonic CDROM support?
           Archivo README: sbpcd
</PRE>
</P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
sbpcd=&lt;direccion-E/S&gt;,&lt;tipo-de-interfase&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El primer par&aacute;metro es la direcci&oacute;n base del dispositivo (p.e. 
<CODE>0x230</CODE>), y el tipo-de-interfase podr&aacute; ser "<CODE>SoundBlaster</CODE>",
"<CODE>LaserMate</CODE>", o "<CODE>SPEA</CODE>".  Consulte el archivo <CODE>sbpcd.h</CODE>
para m&aacute;s informaci&oacute;n acerca del tipo de interfase empleada. Con
<CODE>sbpcd=0</CODE> desactivar&aacute; la auto-prueba, as&iacute; como la unidad. </P>
<P>Creaci&oacute;n del Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# mknod /dev/sbpcd b 25 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El SBPCD es capaz de soportar hasta cuatro unidades por controlador. Las
otras tres unidades del primer controlador utilizar&aacute;n por orden los
n&uacute;meros 1, 2 y 3 (en vez de 0). Con m&aacute;s de un controlador, los archivos de
dispositivo tendr&aacute;n como n&uacute;mero m&aacute;ximo 26, 27, y 28, as&iacute; hasta un m&aacute;ximo
de cuatro controladores (osea, 16 CDROM en total; afortunadamente, suele
ser suficiente para la mayor parte de los usuarios :-). </P>
<P>M&aacute;s informaci&oacute;n acerca de este controlador en el archivo <CODE>sbpcd</CODE>.</P>
<P><EM>Si ha comprado su CDROM recientemente, no presuponga que ha de emplear
este controlador s&oacute;lo porque se conecte a una tarjeta SoundBlaster. Casi
todas las unidades que se venden actualmente son IDE/ATAPI.</EM></P>

<H3>Controlador Sonycdu535</H3>


<P>
<PRE>
          Autor Principal: Ken Pizzini (ken@halcyon.com)
     Soporta Multi-Sesion: no
  Soporta Varias Unidades: no
  Soporta Carga en Modulo: si
         Lectura de Audio: no
              Auto-Prueba: no
   Fichero de Dispositivo: /dev/sonycd535, mayor 24              
 Fichero de Configuracion: sonycd535.h
        Opcion del Nucleo: Sony CDU535 CDROM support?
          Archivo  README: sonycd535
</PRE>
</P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
sonycd535=&lt;direccion-E/S&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>donde direccion-E/S es la direcci&oacute;n base del controlador (p.e.. 
<CODE>0x320</CODE>).  Tambi&eacute;n puede fijarla dentro del fichero
<CODE>sonycd535.h</CODE> y compilarlo con ella. </P>
<P>Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/sonycd535 b 24 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Algunas distribuciones utilizan <CODE>/dev/sonycd</CODE> para dicha unidad. 
Las versiones m&aacute;s antiguas del controlador usan como mayor de dispositivo
21; compruebe si el fichero de dispositivo est&aacute; correctamente fijado. </P>
<P>Antiguamente, este controlador se distribu&iacute;a como parche, pero ahora se
incluye en el n&uacute;cleo est&aacute;ndar. Para m&aacute;s informaci&oacute;n, lea el archivo
<CODE>sonycd535</CODE>. </P>

<H3>Controlador Cdu31a</H3>


<P>
<PRE>
          Autor Principal: Corey Minyard (minyard@-rch.cirr.com)
     Soporta Multi-Sesion: si
  Soporta Varias Unidades: no
  Soporta Carga en Modulo: si
         Lectura de Audio: si
              Auto-Prueba: no
   Fichero de Dispositivo: /dev/cdu31a, mayor 15
 Fichero de Configuracion: cdu31a.h
        Opcion del Nucleo: Sony CDU31A/CDU33A CDROM support?
          Archivo  README: cdu31a
</PRE>
</P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdu31a=&lt;direccion-E/S&gt;,&lt;interrupcion&gt;,PAS
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El primer n&uacute;mero es la direcci&oacute;n base E/S de la tarjeta (p.e. <CODE>0x340</CODE>). 
El segundo es el n&uacute;mero de interrupci&oacute;n empleada (0 para polled E/S). El
tercer par&aacute;metro, opcional, deber&aacute; ser "<CODE>PAS</CODE>" si la unidad esta
conectada a una tarjeta Pro-Audio Spectrum 16; si no, d&eacute;jese en blanco. </P>
<P>Si carga el controlador como m&oacute;dulo, el formato variar&aacute; ligeramente. Para
cargarlo, mediante el comando <CODE>modprobe</CODE> o <CODE>insmod</CODE>, los par&aacute;metros
ser&aacute;n:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdu31a_port=&lt;direccion-E/S&gt; cdu31a_irq=&lt;interrupcion&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La direcci&oacute;n base de E/S es imprescindible. El n&uacute;mero de interrupci&oacute;n es
opcional. </P>
<P>Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/cdu31a b 15 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para m&aacute;s informaci&oacute;n, consulte el fichero <CODE>cdu31a</CODE>.</P>
<P>Tambi&eacute;n puede visitar la p&aacute;gina de Jeffrey Oxenreider (<CODE>
<A HREF="mailto:zureal@infinet.com">zureal@infinet.com</A></CODE>), donde se
describen los problemas m&aacute;s frecuentes que suelen ocurrir con unidades: 
<CODE>
<A HREF="http://www.infinet.com/~zureal/cdu31a.html">http://www.infinet.com/~zureal/cdu31a.html</A></CODE>.</P>

<H3>Controlador Aztcd</H3>


<P>
<PRE>
         Autor Principal: Werner Zimmermann (zimmerma@rz.fht-essliwgen.de)
    Soporta Multi-Sesion: si
 Soporta Varias Unidades: no
 Soporta Carga en Modulo: si
        Lectura de Audio: no
             Auto-Prueba: no
  Fichero de Dispositivo: /dev/aztcd0, mayor 29
Fichero de Configuracion: aztcd.h
       Opcion del Nucleo: Aztech/Orchid/Okano/Wearnes (non IDE) CDROM support?
          Archivo README: aztcd
</PRE>
</P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
aztcd=&lt;direccion-E/S&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...donde el par&aacute;metro no es otro que la direcci&oacute;n base de E/S de la
tarjeta (p.e. <CODE>0x340</CODE>). </P>
<P>Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/aztcd0 b 29 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>T&eacute;ngase en cuenta que este controlador funciona exclusivamente con la
unidad CDA268-01A. Otros modelos, como el CDA268-03I y CDA269-031SE no son
propietarios, y emplean el controlador del n&uacute;cleo IDECD (ATAPI). </P>
<P>Para mas informaci&oacute;n, consulte el archivo <CODE>aztcd</CODE></P>

<H3>Controlador Gscd</H3>


<P>
<PRE>
          Autor Principal: Oliver Raupach (raupach@nwfs1.rz.fh-hannover.de)
     Soporta Multi-Sesion: no
  Soporta Varias Unidades: no
  Soporta Carga en Modulo: si
         Lectura de Audio: no
              Auto-Prueba: no
   Fichero de Dispositivo: /dev/gscd0, mayor 16
 Fichero de Configuracion: gscd.h
        Opcion del Nucleo: Goldstar R420 CDROM support?
         Archivo   README: gscd
</PRE>
</P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
gscd=&lt;direccion-E/S&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...especificando la direcci&oacute;n base de E/S de la tarjeta (e.g. <CODE>0x340</CODE>).</P>
<P>Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/gscd0 b 16 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>M&aacute;s informaci&oacute;n en el archivo <CODE>gscd</CODE> y en la p&aacute;gina Web:
<CODE>
<A HREF="http://linux.rz.fh-hannover.de/~raupach/">http://linux.rz.fh-hannover.de/~raupach/</A></CODE>. </P>

<H3>Controlador Mcd</H3>


<P>
<PRE>
         Autor Principal: Martin  (martin@bdsi.com)
     Soporta Multi-Sesion: no
  Soporta Varias Unidades: no
  Soporta Carga en Modulo: si
         Lectura de Audio: no
              Auto-Prueba: no
   Fichero de Dispositivo: /dev/mcd, mayor 23
 Fichero de Configuracion: mcd.h
        Opcion del Nucleo: Standard Mitsumi CDROM support?
         Archivo   README: mcd
</PRE>
</P>
<P>Este es el controlador m&aacute;s antiguo para unidades Mitsumi. Quiz&aacute;s prefiera
probar otro m&aacute;s reciente, <CODE>mcdx</CODE>, que ofrece m&aacute;s prestaciones,
aunque probablemente sea menos estable. </P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mcd=&lt;direccion-E/S&gt;,&lt;irq&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...especificando la direcci&oacute;n base de E/S de la tarjeta (e.g. <CODE>0x340</CODE>) 
y el n&uacute;mero de la interruci&oacute;n IRQ. </P>
<P>Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/mcd b 23 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Encontrar&aacute; m&aacute;s informaci&oacute;n en el archivo <CODE>mcd</CODE>.</P>

<H3>Controlador Mcdx</H3>


<P>
<PRE>
          Autor Principal: Heiko Schlittermann
     Soporta Multi-Sesion: si
  Soporta Varias Unidades: si
  Soporta Carga en Modulo: si
         Lectura de Audio: no (el hardware lo soporta)
              Auto-Prueba: no
   Fichero de Dispositivo: /dev/mcdx0, mayor 20
 Fichero de Configuracion: mcdx.h
        Opcion del nucleo: Experimental Mitsumi support?
          Archivo  README: mcdx
</PRE>
</P>
<P>Es el controlador m&aacute;s reciente para unidades Mitsumi. El antiguo,
seguramente m&aacute;s estable, es el <CODE>mcd</CODE>. </P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mcdx=&lt;direccion-E/S&gt;,&lt;irq&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...especificando la direcci&oacute;n base de E/S de la tarjeta (e.g. <CODE>0x340</CODE>) 
y el n&uacute;mero IRQ. </P>
<P>Fichero de dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/mcdx0 b 20 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si ha comprado recientemente un CD-ROM Mitsumi, no presuponga que tenga
que usar este controlador. Hay muchos modelos Mitsumi que son EIDE/ATAPI,
por lo que emplean controlador <CODE>idecd</CODE>. </P>
<P>M&aacute;s informaci&oacute;n en el archivo <CODE>mcdx</CODE></P>

<H3>Controlador Cm206</H3>


<P>
<PRE>
          Autor Principal: David A. van Leeuwen (david@tm.tno.)
     Soporta Multi-Sesion: si
  Soporta Varias Unidades: no
  Soporta Carga en Modulo: si
         Lectura de Audio: no
              Auto-Prueba: si
  Fichero de Dispositivo: /dev/cm206cd, mayor 32
 Fichero de Configuracion: cm206.h
        Opcion del Nucleo: Philips/LMS CM206 CDROM support?
          Archivo  README: cm206
</PRE>
</P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cm206=&lt;direccion-E/S&gt;,&lt;interrupcion&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...donde el primer n&uacute;mero es la direcci&oacute;n base de E/S de la tarjeta (e.g.
<CODE>0x340</CODE>) y el segundo, el canal de interrupci&oacute;n.</P>
<P>Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/cm206cd b 32 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>M&aacute;s informaci&oacute;n en el archivo <CODE>cm206</CODE>.</P>

<H3>Controlador Optcd</H3>


<P>
<PRE>
          Autor Principal: Leo Spiekman (spiekman@dutette.et.tudelnt.nl)
     Soporta Multi-Sesion: si
  Soporta Varias Unidades: no
  Soporta Carga en Modulo: si
         Lectura de Audio: no
              Auto-Prueba: no
   Fichero de Dispositivo: /dev/optcd0, mayor 17
 Fichero de Configuracion: optcd.h
        Opcion del Nucleo: Experimental Optics Storage ... CDROM support?
          Archivo  README: optcd
</PRE>
</P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
optcd=&lt;direccion-E/S&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...donde especificar&aacute; la direcci&oacute;n base de E/S de la tarjeta (p.e.
<CODE>0x340</CODE>).</P>
<P>Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/optcd0 b 17 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>M&aacute;s informaci&oacute;n acerca de este controlador en el archivo <CODE>optcd</CODE>.</P>

<H3>Controlador Sjcd</H3>


<P>
<PRE>
          Autor Principal: Vadim V. Model (vadim@rbrf.msk.su)
     Soporta Multi-Sesion: no
  Soporta Varias Unidades: no
  Soporta Carga en Modulo: si
         Lectura de Audio: no
              Auto-Prueba: no
   Fichero de Dispositivo: /dev/sjcd, mayor 18
 Fichero de Configuracion: sjcd.h
        Opcion del Nucleo: Experimental Sanyo H94A CDROM support?
          Archivo README : sjcd
</PRE>
</P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
sjcd=&lt;direccion-E/S&gt;,&lt;interrupcion&gt;,&lt;dma&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...indicando la direcci&oacute;n base, interrupci&oacute;n, y canal DMA (p.e.
<CODE>sjcd=0x340,10,5</CODE>). </P>
<P>Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/sjcd b 18 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Lea el archivo <CODE>sjcd</CODE> para m&aacute;s informaci&oacute;n.</P>

<H3>Controlador Bpcd</H3>


<P>
<PRE>
          Autor Principal: Grant R. Guenther (grant@torque.net)
     Soporta Multi-sesion: desconocido
  Soporta Varias Unidades: no
  Soporta Carga en Modulo: si
         Lectura de Audio: no
              Auto-Prueba: si
   Fichero de dispositivo: /dev/bpcd, mayor 41
 Fichero de Configuracion: bpcd.h
        Opcion del Nucleo: MicroSolutions backpack CDROM support?
      Archivo README file: bpcd
</PRE>
</P>
<P>L&iacute;nea de comandos del n&uacute;cleo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
bpcd=&lt;direccion-E/S&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...indicando la direcci&oacute;n base empleada (p.e. <CODE>bpcd=0x3bc</CODE>).</P>
<P>Fichero de Dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/bpcd b 41 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Este controlador se incluye con la versi&oacute;n 2.1 del n&uacute;cleo.  Consulte
asimismo el archivo <CODE>bpcd</CODE>. </P>

<H3>Controlador SCSI</H3>


<P>
<PRE>
          Autor Principal: David Giller
     Soporta Multi-Sesion: si (dependiendo de la unidad)
  Soporta Varias Unidades: si
  Soporta Carga en Modulo: si
         Lectura de Audio: no
              Auto-Prueba: si
   Fichero de Dispositivo: /dev/scd0, mayor 11
 Fichero de Configuracion: cdrom.h
        Opcion del Nucleo: SCSI CDROM support?
           Archivo README: inexistente
</PRE>
</P>
<P>Hay una l&iacute;nea de comandos del n&uacute;cleo espec&iacute;fica para cada tipo de
controladora SCSI. M&aacute;s informaci&oacute;n en el documento <CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/SCSI-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/SCSI-HOWTO.html</A></CODE>. </P>
<P>S&iacute; se soportan m&uacute;ltiples unidades (el n&uacute;mero m&aacute;ximo de dispositivos
depender&aacute; de la capacidad del bus). Determine los ficheros de dispositivo
con un numero m&aacute;ximo de 11 y los m&iacute;nimos empezando desde cero: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mknod /dev/scd0 b 11 0
mknod /dev/scd1 b 11 1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Aunque el controlador de por s&iacute; no tiene capacidad de lectura de audio,
hay unidades SCSI que s&iacute; poseen dicha caracter&iacute;stica y funcionar&aacute;n con el
programa <CODE>cdda2wav</CODE> o <CODE>readcdda</CODE> (empleando la interfase SCSI
gen&eacute;rica del n&uacute;cleo).</P>

<H3>Controlador IDECD</H3>


<P>
<PRE>
           Autor Principal: Scott Snyder (snyder@fnald0.fnal.gov)
     Soporta Multi-Sesion: si
  Soporta Varias Unidades: si
  Soporta Carga en Modulo: no
         Lectura de Audio: si (si la unidad lo soporta)
              Auto-Prueba: si
   Fichero de Dispositivo: /dev/hd{a,b,c,d},  mayor 22
 Fichero de Configuracion: cdrom.h
        Opcion del Nucleo: Include support for IDE/ATAPI CDROMs?
          Archivo  README: ide-cd
</PRE>
</P>
<P>Este es el controlador para unidades ATAPI. Su l&iacute;nea de comandos del
n&uacute;cleo ser&aacute; de la forma: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
hdx=cilindros,cabezas,sectores,wpcom,irq
  o
hdx=cdrom
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...donde <CODE>hdx</CODE> ser&aacute; una de las siguientes: <CODE>hda,hdb,hdc,hdd</CODE>, o
"<CODE>hd</CODE>", para la "siguiente" unidad (en dicha secuencia). S&oacute;lo son
imprescindibles los tres primeros par&aacute;metros (cilindros,
cabezas,sectores). Por ejemplo <CODE>hdc=1050,32,64 hdd=cdrom</CODE>.</P>
<P>A veces puede ser complicado el que el controlador reconozca su unidad,
especialmente si posee m&aacute;s de 2 dispositivos o m&aacute;s de una controladora
IDE. Por lo general, basta con pasar la l&iacute;nea de comandos correcta desde
LILO. C&oacute;mo hacer esto se explica en el archivo
<CODE>/usr/src/linux/Documentation/ide-cd</CODE>. L&eacute;alo atentamente. </P>
<P>El soporte para m&uacute;ltiples dispositivos IDE ha ido mejorando con las
&uacute;ltimas versiones del n&uacute;cleo. Si tiene problemas con su antiguo n&uacute;cleo, le
puede ser de ayuda actualizarlo. </P>
<P>Algunas controladoras IDE presentan problemas de hardware que el
controlador del n&uacute;cleo es capaz de solucionar. Para ello deber&aacute; introducir
m&aacute;s par&aacute;metros adicionales. Le remito a la documentaci&oacute;n. </P>


<H2><A NAME="ss4.4">4.4 Arrancando el N&uacute;cleo</A></H2>


<P>Ahora ya puede reinicializar el sistema con el nuevo n&uacute;cleo. Deber&iacute;a leer
un mensaje indicando que el controlador ha identificado a la unidad (el
mensaje variar&aacute; con cada modelo): </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
hdd: NEC CD-ROM DRIVE:282, ATAPI CDROM drive
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si los mensajes del arranque se suceden demasiado r&aacute;pido para poder
leerlos, puede revisarlos tecleando <CODE>dmesg</CODE> o <CODE>tail
/var/adm/messages</CODE>. </P>
<P>Si no ha identificado la unidad, algo falla. Consulte la secci&oacute;n
<A HREF="#Problemillas">Problemillas</A>. </P>


<H2><A NAME="ss4.5">4.5 Montando, Desmontando y Extrayendo</A></H2>


<P>Para montar un CD-ROM, inserte el disco en la unidad y ejecute el comando
<CODE>mount</CODE> siendo <CODE>root</CODE> (asumo que ya ha creado el enlace
simb&oacute;lico a su fichero de dispositivo, como recomendaba anteriormente, y
que existe el directorio donde montarlo llamado <CODE>/mnt/cdrom</CODE>): </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mount -t iso9660 -r /dev/cdrom /mnt/cdrom
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ahora ya puede acceder al CD, en el directorio <CODE>/mnt/cdrom</CODE>. </P>
<P>El comando mount soporta m&aacute;s opciones. Consulte la p&aacute;gina
<CODE>mount(8)</CODE> del manual. </P>
<P>Puede a&ntilde;adir una l&iacute;nea en archivo <CODE>/etc/fstab</CODE> para que el CD-ROM
se monte autom&aacute;ticamente al arrancar o para especificar los par&aacute;metros a
emplear cuando se monte; consulte la p&aacute;gina man <CODE>fstab(5)</CODE>. </P>
<P>Ojo: para reproducir CDs de audio, <EM>no</EM> monte la unidad. </P>
<P>Para desmontar un CD-ROM, utilice el comando <CODE>umount</CODE> en modo
<CODE>root</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
umount /mnt/cdrom
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El disco podr&aacute; ser desmontado &uacute;nicamente si no hay ning&uacute;n proceso
accediendo a la unidad (lo que incluye el hecho de que el directorio en
que se encuentre sea del CD-ROM). Entonces ya podr&aacute; extraer el disco. Casi
todas las unidades tienen un bot&oacute;n de extracci&oacute;n; tambi&eacute;n hay un programa
que realiza esta tarea. Se llama <CODE>eject</CODE>: <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/eject-1.4.tar.gz">ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/eject-1.4.tar.gz</A></CODE>. </P>
<P>No intente extraer el disco mientras la unidad est&eacute; montada (lo cual ser&aacute;
o no posible, dependiendo del tipo de unidad). Algunos controladores
pueden extraer autom&aacute;ticamente el CD-ROM cuando se desmonta, e introducir
la bandeja cuando se monta. Esta caracter&iacute;stica puede desactivarse a la
hora de compilar el n&uacute;cleo, o bien mediante los comandos adecuados. </P>
<P>Es posible que no pueda montar ning&uacute;n CD-ROM despu&eacute;s de haber reproducido
un disco de audio. Debe antes enviar un comando "stop" mediante un
programa reproductor de CDs. Esto s&oacute;lo parece ocurrir con el controlador
SBPCD. </P>
<P>Stephen Tweedie (<CODE>
<A HREF="mailto:sct@dcs.ed.ac.uk">sct@dcs.ed.ac.uk</A></CODE>) ha escrito el paquete <CODE>Supermount</CODE>,
para gestionar de manera transparente el montado de dispositivos
extra&iacute;bles, incluyendo CD-ROM. Lo puede encontrar v&iacute;a ftp: <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/patches/diskdrives/">ftp://sunsite.unc.edu/pub/Linux/patches/diskdrives/</A></CODE>.</P>


<H2><A NAME="Problemillas"></A> <A NAME="ss4.6">4.6 Problemillas </A></H2>


<P>Si despu&eacute;s de seguir las instrucciones detalladas, a&uacute;n tiene problemas con
su unidad, es hora de hacer una serie de comprobaciones. Vienen descritas
en orden creciente de complejidad. Si detecta fallos a la hora de realizar
alguna de las comprobaciones, solucione ese problema antes de pasar a la
siguiente. </P>

<H3>Primero: Aseg&uacute;rese de haber arrancado con el n&uacute;cleo reci&eacute;n compilado</H3>


<P>Puede verificar la fecha del n&uacute;cleo para asegurarse de estar corriendo el
n&uacute;cleo que ha compilado con soporte para CD-ROM, con el comando
<CODE>uname</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
uname -a
Linux fizzbin 2.0.18 #1 Fri Sep 6 10:10:54 EDT 1996 i586
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...o tambi&eacute;n leyendo el archivo <CODE>/proc/version</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cat /proc/version
Linux version 2.0.18 (root@fizzbin) (gcc version 2.7.2) #1 Fri Sep 6 10:10:54 EDT 1996
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si ve que la fecha no coincide con la de construcci&oacute;n y compilaci&oacute;n del
n&uacute;cleo, es que todav&iacute;a esta corriendo la versi&oacute;n antigua. ¿Seguro que ha
reinicializado el sistema? Si utiliza LILO, ¿lo ha reinstalado (ejecutando
<CODE>/sbin/lilo</CODE>)? Si arranca desde un disco, ¿ha creado un nuevo disco
de arranque y lo ha estrenado? </P>

<H3>Segundo: Compruebe que los controladores est&eacute;n incluidos en eln&uacute;cleo.</H3>


<P>Puede ver una lista de los controladores compilados en el archivo
<CODE>/proc/devices</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cat /proc/devices
Character devices:
 1 mem
 2 pty
 3 ttyp
 4 ttyS
 5 cua
 7 vcs

Block devices:
 3 ide0
22 ide1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En primer lugar, busque el controlador de dispositivo de su CD-ROM: en la
columna <CODE>Block devices</CODE>. En el ejemplo, vemos el controlador
<CODE>idecd</CODE> cuyo n&uacute;mero mayor es 22.</P>
<P>Aseg&uacute;rese de que tambi&eacute;n ha compilado el soporte para el sistema de
ficheros ISO-9660, leyendo el archivo <CODE>/proc/filesystems</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cat /proc/filesystems
        ext2
        msdos
nodev   proc
        iso9660
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En el archivo <CODE>/proc/ioports</CODE> encontrar&aacute; las direcciones (E/S) de
los puertos utilizados por los controladores: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cat /proc/ioports
 ...
0230-0233 : sbpcd
 ...
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si alguno de los controladores que Ud. cre&iacute;a haber compilado no aparece,
es que algo ha ido mal durante el proceso de configuraci&oacute;n y/o
construcci&oacute;n del n&uacute;cleo. Tendr&aacute; que comenzar de nuevo. </P>

<H3>Tercero: Compruebe que el n&uacute;cleo detecta la unidad durante el arranque</H3>


<P>Cerci&oacute;rese de que el CD-ROM fue detectado durante el proceso de arranque
del n&uacute;cleo. Debiera leer alg&uacute;n mensaje al respecto. Si los mensajes se
suceden y salen de la pantalla, puede revisarlos con el comando
<CODE>dmesg</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
dmesg
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>o</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
tail /var/adm/messages
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si la unidad no fue detectada, algo ha fallado... <I>Houston</I> <CODE>:)</CODE>
Compruebe que est&aacute; enchufada y que los cables est&aacute;n bien conectados. Si
dispone de jumpers para las direcciones, verifique sus posiciones (p.e. 
drive 0 si s&oacute;lo tiene una unidad). Los CD-ROM ATAPI deben tener los
jumpers en modo "single" o "master", y nunca en "slave" cuando solamente
hay un dispositivo IDE conectado a la interfase. Si la unidad funciona
bajo DOS, es que no hay fallos en el hardware. </P>
<P>Muchos controladores llevan a cabo auto-prueba, pero los hay que no. En
cualquier caso, no es infalible. Tendr&aacute; que utilizar la l&iacute;nea de comandos
detallada para su unidad. Puede que tenga que probar con muchos valores de
direcciones de E/S si no est&aacute; seguro. Se puede configurar LILO (es lo m&aacute;s
frecuente) para poder introducir los par&aacute;metros manualmente al arrancar. </P>
<P>Otra posibilidad es que no est&eacute; utilizando el controlador adecuado.
Algunos manuales refieren sus interfases propietarias como IDE, induciendo
al error de suponer que se trata de unidades ATAPI. </P>
<P>Tambi&eacute;n es posible que su unidad (o la interfase de la tarjeta) sea una de
esas del tipo "compatible" que precisa inicializarse con el controlador
del DOS. Int&eacute;ntelo arrancando el DOS y cargando el controlador
suministrado con la unidad. Luego, arranque Linux presionando
<CODE>Control-Alt-Suprimir</CODE>. </P>
<P>Si su unidad no es ninguna de las citadas, puede que no haya ning&uacute;n
controlador disponible bajo Linux. Para m&aacute;s informaci&oacute;n al respecto, lea
las Referencias que encontrar&aacute; al final de este documento. </P>

<H3>Cuarto: Compruebe si puede leer informaci&oacute;n desde la unidad</H3>


<P>Vamos a intentarlo. Los siguientes comandos deber&iacute;an provocar el encendido
de la lucecita de la unidad (si la hay, claro) y no deber&iacute;a haber mensajes
de error. Utilice el fichero de dispositivo adecuado para su unidad y
aseg&uacute;rese de haber insertado un CD; </P>
<P>salga con Control-C.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
dd if=/dev/cdrom of=/dev/null bs=2048
^C
124+0 records in
124+0 records out
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si ha funcionado, es que el n&uacute;cleo se est&aacute; comunicando con la unidad y
puede pasar a la siguiente comprobaci&oacute;n. </P>
<P>Si no, puede que haya alg&uacute;n error en el fichero de dispositivo. Aseg&uacute;rese
de que &eacute;ste se encuentra en el directorio <CODE>/dev</CODE> y que sus n&uacute;meros
mayor y menor son correctos. Los permisos del fichero deben de estar
fijados tanto para lectura como para escritura.</P>
<P>Existe una posibilidad remota de fallo del hardware. Si es posible,
eval&uacute;ela desde el DOS. </P>

<H3>Quinto: Pruebe a montar un CD-ROM</H3>


<P>Si puede leer desde la unidad, pero no puede montarla, compruebe antes de
nada que ha compilado el sistema de ficheros ISO-9660, leyendo el archivo
<CODE>/proc/filesystems</CODE>, tal y como se ha descrito anteriormente. </P>
<P>Ha de montar la unidad con los par&aacute;metros "<CODE>-t iso9660</CODE>" y la opci&oacute;n
"<CODE>-r</CODE>". El CD debe estar formateado con el sistema de ficheros
ISO-9660. El montado de CDs ha de hacerse en siendo <CODE>root</CODE>.</P>
<P>Compruebe que el directorio en el cual se monta la unidad existe.  Si
monta la unidad durante el arranque, aseg&uacute;rese de que las instrucciones
del archivo <CODE>/etc/fstab</CODE> son correctas.  Si ha cargado el demonio
<CODE>syslog</CODE>, es probable que haya mensajes de error del n&uacute;cleo que no ha
visto.  Pruebe con "<CODE>dmesg</CODE>":</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
dmesg
SBPCD: sbpcd_open: no disk in drive
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Quiz&aacute;s hay alg&uacute;n mensaje de error en los ficheros en <CODE>/var/adm/</CODE>,
dependiendo de c&oacute;mo est&eacute; configurado su sistema.</P>

<H3>Problemas con el sonido</H3>


<P>Si la unidad funciona bien con CD-ROMs, pero no reproduce CDs de audio,
aqu&iacute; encontrar&aacute; algunas de las soluciones posibles.  En primer lugar,
necesitar&aacute; un programa para la reproducci&oacute;n de CDs de audio. Es posible
que no todos los programas sean compatibles con su unidad. Pruebe con otra
aplicaci&oacute;n, o intente recompilarla. Un buen sitio para buscar software es
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/cdrom/">ftp://sunsite.unc.edu/pub/Linux/apps/sound/cdrom/</A></CODE>.</P>
<P>Unos pocos controladores no tienen soporte para audio. Compruebe el
archivo README o el c&oacute;digo fuente para ver si se da el caso. </P>
<P>Compruebe si se escucha el audio por medio de unos auriculares conectados
a la salida externa de la unidad. Si se escucha, el problema est&aacute; en la
tarjeta de sonido. Con un programa mezclador (mixer) podr&aacute; ajustar tanto
la entrada como el volumen. Aseg&uacute;rese de que tiene instalado el cable de
audio que conecta el CD-ROM con la tarjeta de sonido. Verifique el
correcto funcionamiento del controlador de la tarjeta de sonido. M&aacute;s
informaci&oacute;n al respecto en <CODE>
<A HREF="http://www.insflug.org/howtos/online/sonido/Sonido-Como.html">http://www.insflug.org/howtos/online/sonido/Sonido-Como.html</A></CODE>.</P>

<H3>Nada, Que sigue fallando...</H3>


<P>Si a&uacute;n tiene problemas, puede:</P>
<P>
<UL>
<LI>releer meticulosamente el documento.
</LI>
<LI>consultar las referencias que hay al final de este escrito,
especialmente las que se refieren a los archivos README de los fuentes del
n&uacute;cleo.
</LI>
<LI>enviar una pregunta a alguno de los grupos de noticias
<CODE>comp.os.linux</CODE>, (en castellano <CODE>es.comp.os.linux</CODE>)
</LI>
<LI>enviar una pregunta a la Lista de Correo de Linux</LI>
<LI>probar con la &uacute;ltima versi&oacute;n del n&uacute;cleo</LI>
<LI>contactar con su distribuidor (del equipo)</LI>
<LI>contactar con el distribuidor del CD-ROM
</LI>
<LI>enviar un mensaje al responsable del controlador del n&uacute;cleo (busque
en el archivo <CODE>/usr/src/linux/MAINTAINERS</CODE>) 
</LI>
<LI>enviarme un mensaje</LI>
<LI>cargar el Emacs y teclear <CODE>Esc-x doctor :-)</CODE></LI>
</UL>
</P>


<HR>
<A HREF="CDRom-Como-3.html">Anterior</A>
<A HREF="CDRom-Como-5.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc4">Indice</A>
</BODY>
</HTML>
