<HTML>
<HEAD>
<TITLE>CDROM-COMO: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="CDRom-Como-2.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>Este es el CDROM-COMO. Pretende ser una gu&iacute;a de referencia r&aacute;pida,
abarcando todo lo que Vd. necesita saber para poder instalar y configurar
una unidad de CD-ROM bajo Linux. Tambi&eacute;n se da respuesta a las preguntas
m&aacute;s comunes acerca de el CD-ROM, y se incluyen notas de referencia a otras
fuentes de informaci&oacute;n relacionadas con las aplicaciones del CD-ROM y su
tecnolog&iacute;a. </P>

<H2><A NAME="ss1.1">1.1 Fuentes de Informaci&oacute;n</A></H2>


<P>La mayor parte de esta informaci&oacute;n proviene de los archivos de c&oacute;digo y
documentaci&oacute;n suministrados con el n&uacute;cleo de Linux, las FAQ del grupo de
noticias de Usenet <CODE>
<A HREF="news:alt.cd-rom">alt.cd-rom</A></CODE> y colaboraciones de usuarios linuxer*s.</P>
<P>Gracias al paquete <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/text/sgml-tools-0.99.0.tar.gz">ftp://sunsite.unc.edu/pub/Linux/utils/text/sgml-tools-0.99.0.tar.gz</A></CODE>,
este COMO est&aacute; disponible en numerosos formatos, todos ellos generados a
partir de un mismo fichero de texto.</P>


<H2><A NAME="ss1.2">1.2 Repaso Hist&oacute;rico</A></H2>


<P>
<DL>
<DT><B>Versi&oacute;n 1.0</B><DD><P>Primera versi&oacute;n de este documento disponible al
p&uacute;blico. </P>

<DT><B>Versi&oacute;n 1.1</B><DD><P>A partir de la versi&oacute;n 1.1.20 del n&uacute;cleo, queda
soportada de manera expl&iacute;cita la unidad CDU33A; Reveal FX; acerca de la
lectura de pistas de audio; versiones alfa de algunos controladores 
(<I>drivers</I>); a&ntilde;adida la secci&oacute;n Problemillas; otros a&ntilde;adidos de menor
importancia. </P>

<DT><B>Versi&oacute;n 1.2</B><DD><P>A partir del n&uacute;cleo 1.1.33, el sistema de ficheros
ISO-9660 ha de ser montado en modo s&oacute;lo-lectura; queda aclarado que la
SB16 SCSI s&iacute; est&aacute; soportada, mientras que las unidades Aztech no lo est&aacute;n;
referencias a los programas <CODE>photocd</CODE> y <CODE>xpcd</CODE>; comentarios acerca
de la nueva caracter&iacute;stica de auto-extracci&oacute;n del controlador SBPCD.</P>

<DT><B>Versi&oacute;n 1.3</B><DD><P>Notas sobre la auto-extracci&oacute;n del controlador SBPCD
a partir del n&uacute;cleo 1.1.49; acerca de los discos XA y su identificaci&oacute;n. </P>

<DT><B>Versi&oacute;n 1.4</B><DD><P>Traducciones de este documento a otros idiomas; el
SBPCD ofrece soporte para unidades IBM y Longshine; versi&oacute;n alfa del
controlador para unidades Aztech; controlador CDU-33 sin auto-prueba, y
con soporte para PhotoCD y audio; soporte para m&aacute;s de 2 unidades SCSI;
nuevo controlador para unidades IDE; se recomienda comprobar las
posiciones de los jumpers de la unidad; control de la auto-extracci&oacute;n del
controlador SBPCD a trav&eacute;s de las funciones <CODE>ioctl()</CODE>; lista de los
controladores con soporte para multi-sesi&oacute;n; pregunta acerca de el piloto
parpadeante de la CDU-33. </P>

<DT><B>Versi&oacute;n 1.5</B><DD><P>Esta nueva versi&oacute;n del documento viene con retraso
(he estado ocupado); el documento se sit&uacute;a bajo licencia p&uacute;blica GPL; 
nuevos controladores; m&aacute;s informaci&oacute;n sobre configuraci&oacute;n y problemas; 
montones de enlaces a documentos HTML; otros cambios de menor importancia. </P>

<DT><B>Versi&oacute;n 1.6</B><DD><P>Enlace al programa <CODE>eject</CODE> (extracci&oacute;n); parche
para los permisos de ficheros; enlace a la p&aacute;gina Web de Creative Labs; 
referencia al FTP y FAQs de ATA/EIDE; n&oacute;tese que muchas de las unidades
Creative Labs y Mitsumi m&aacute;s recientes son EIDE; <CODE>supermount</CODE>; la lista
de unidades con soporte para la lectura de CD-Audio est&aacute; obsoleta, con
relaci&oacute;n al cdda2wav; escritura de CDs; unidad EIDE multi-disco. </P>

<DT><B>Versi&oacute;n 1.7</B><DD><P>Nueva versi&oacute;n del n&uacute;cleo; muchos de los archivos
README (l&eacute;ame) son trasladados al directorio
<CODE>/usr/src/linux/Documentation</CODE>; finaliza la fase experimental de
algunos controladores; nuevas unidades soportadas; insistencia en que casi
todas las unidades comercializadas hoy en d&iacute;a son IDE/ATAPI; se a&ntilde;ade un
apartado sobre el soporte Plug and Play (Enchufar y Listo) e
identificaci&oacute;n de la velocidad de la unidad; cierre de las listas de
correo <CODE>vger</CODE>; otros peque&ntilde;os a&ntilde;adidos, miscel&aacute;nea.</P>

<DT><B>Versi&oacute;n 1.8</B><DD><P>Por qu&eacute; el CD-ROM deja de funcionar despu&eacute;s de
finalizar la instalaci&oacute;n de Linux; el controlador <CODE>aztcd</CODE> ofrece
soporte para dos unidades CyCDROM; se ruega no utilizar el controlador
SBPCD con unidades IDE; soporte para alguna intercambiadora multi-disco
ATAPI;  n&oacute;tese la carencia de soporte para unidades v&iacute;a puerto paralelo;
el &uacute;ltimo n&uacute;cleo estable es el 2.0; miscel&aacute;nea y a&ntilde;adidos de menor
importancia.</P>

<DT><B>Versi&oacute;n 1.9</B><DD><P>Han sido eliminadas una serie de cuestiones muy
antiguas y actualmente obsoletas; nueva direcci&oacute;n de correo electr&oacute;nico
del autor; ya est&aacute; disponible la traducci&oacute;n al Chino; enlaces a puntos
donde encontrar los paquetes de software m&aacute;s recientes; m&aacute;s informaci&oacute;n en
el libro multimedia; correcciones de sintaxis y ortograf&iacute;a. </P>

<DT><B>Versi&oacute;n 1.10</B><DD><P>Queda aclarado que las nuevas unidades Aztech son
ATAPI; CDU31A como controlador modular; opci&oacute;n de <CODE>mount</CODE> para la
lectura de ficheros ocultos; nueva URL de la p&aacute;gina web del libro;
correcciones sint&aacute;cticas y ortogr&aacute;ficas.</P>

<DT><B>Versi&oacute;n 1.11</B><DD><P>Unidades v&iacute;a puerto paralelo; controlador
<CODE>bpcd</CODE>;  nueva URL de la traducci&oacute;n al Chino; controlador alternativo
CR-56x; CDs de arranque; la API del CDROM; la Gu&iacute;a Linux Multimedia
(<I>Linux Multimedia Guide</I>) ya est&aacute; disponible en Franc&eacute;s y Japon&eacute;s. </P>

<DT><B>Versi&oacute;n 1.12</B><DD><P>Traducci&oacute;n al Polaco; el documento CD-Writing ya no
es un mini-HOWTO; dos puntos acerca del sistema de ficheros Joliet. </P>
</DL>
</P>


<H2><A NAME="ss1.3">1.3 Versiones nuevas de este documento</A></H2>


<P>Las versiones nuevas de este documento ser&aacute;n enviadas peri&oacute;dicamente al
grupo de noticias <CODE>
<A HREF="news:comp.os.linux.answers">comp.os.linux.answers</A></CODE> . Tambi&eacute;n se subir&aacute;n a varios puntos de
ftp an&oacute;nimo, inclu&iacute;do <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/">ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/</A></CODE>. </P>
<P>Las versiones hipertexto de &eacute;ste y otros HOWTOs/COMOs de Linux se
encuentran disponibles en numerosos servidores de la World-Wide-Web,
incluido <CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/">http://sunsite.unc.edu/LDP/HOWTO/</A></CODE>. Muchas de las
distribuciones de Linux en CDROM incluyen los HOWTOs, normalmente en el
directorio <CODE>/usr/doc</CODE>, y tambi&eacute;n los puede adquirir en formato
impreso. A veces los HOWTOs incluidos en CDROMs, ftps y copias impresas
vienen desfasados. Si la fecha de este COMO tiene m&aacute;s de 6 meses, es
probable que haya disponible una versi&oacute;n m&aacute;s reciente a trav&eacute;s de
Internet.</P>
<P>La traducci&oacute;n al Franc&eacute;s de este documento, realizada por Bruno Cornec
(<CODE>
<A HREF="mailto:cornec@stna7.stna.dgac.fr">cornec@stna7.stna.dgac.fr</A></CODE>) se encuentra en <CODE>
<A HREF="ftp://ftp.ibp.fr/pub2/linux/french/docs/HOWTO/">ftp://ftp.ibp.fr/pub2/linux/french/docs/HOWTO/</A></CODE>. </P>
<P>La traducci&oacute;n al Japon&eacute;s de este documento, realizada por Itsushi Minoura
(<CODE>
<A HREF="mailto:minoura@uni.zool.s.u-tokyo.ac.jp">minoura@uni.zool.s.u-tokyo.ac.jp</A></CODE>) se encuentra en
<CODE>
<A HREF="http://jf.linux.or.jp/JF/JF.html/">http://jf.linux.or.jp/JF/JF.html/</A></CODE>. </P>
<P>La traducci&oacute;n al Chino de este documento (en c&oacute;digo BIG-5), realizada por
Yung-kang Wu (<CODE>
<A HREF="mailto:yorkwu@ms4.hinet.net">yorkwu@ms4.hinet.net</A></CODE>) se encuentra en <CODE>
<A HREF="http://linux.ntcic.edu.tw/~yorkwu/linux/howto/cdrom/">http://linux.ntcic.edu.tw/~yorkwu/linux/howto/cdrom/</A></CODE>. </P>
<P>La traducci&oacute;n al Polaco, realizada por Bartosz Maruszewski (<CODE>
<A HREF="mailto:b.maruszewski@zsmeie.torun.pl">b.maruszewski@zsmeie.torun.pl</A></CODE>), se encuentra en <CODE>
<A HREF="http://www.jtz.org.pl/Html/CDROM-HOWTO.pl.html">http://www.jtz.org.pl/Html/CDROM-HOWTO.pl.html</A></CODE>. </P>
<P>Las traducciones de &eacute;ste y otros HOWTOs de Linux tambi&eacute;n se pueden
encontrar en <CODE>
<A HREF="http://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/">http://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/</A></CODE> y
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/">ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/</A></CODE> . 
Las traducciones al castellano, los COMOs, se encuentran, entre otros
puntos, en <CODE>
<A HREF="http://www.insflug.org">http://www.insflug.org</A></CODE> y <CODE>
<A HREF="http://www.infor.es/LUCAS">http://www.infor.es/LUCAS</A></CODE>.</P>


<H2><A NAME="ss1.4">1.4 Contacto con el autor</A></H2>


<P>Le conf&iacute;o a Vd, lector o lectora, la utilidad y provecho de este COMO. Si
tiene alguna sugerencia, correcci&oacute;n o comentario, por favor, h&aacute;gamelo
saber, <CODE>
<A HREF="mailto:jeff_tranter@pobox.com">jeff_tranter@pobox.com</A></CODE>, e intentar&eacute; incluirlo en una
futura revisi&oacute;n. </P>
<P>Responder&eacute; asimismo a toda pregunta general acerca del manejo del CD-ROM
bajo Linux, tan bien como me sea posible. Antes de hacerlo, por favor, lea
atentamente todo el documento y entonces, env&iacute;eme la informaci&oacute;n detallada
de su problema. Por favor, no me consulten sobre la utilizaci&oacute;n de
unidades de CD-ROM bajo otros sistemas operativos distintos de Linux. </P>
<P>Si publica este documento en un CDROM u otro tipo de almacenamiento,
agradecer&eacute; una copia del mismo; puede mandarme un e-mail para pedirme la
direcci&oacute;n postal. Considere tambi&eacute;n la posibilidad de hacer una donaci&oacute;n
al <I>Linux Documentation Project</I> (Proyecto de Documentaci&oacute;n de Linux). 
Contacte con el coordinador de los HOWTOs de Linux, Greg Hankins
(<CODE>
<A HREF="mailto:gregh@sunsite.unc.edu">gregh@sunsite.unc..edu</A></CODE>), para m&aacute;s informaci&oacute;n al respecto.</P>


<H2><A NAME="ss1.5">1.5 Pol&iacute;tica de Distribuci&oacute;n</A></H2>


<P>Copyright 1995-1997 Jeff Tranter.</P>
<P>Este COMO se distribuye gratuitamente; Vd. puede redistribuirlo y/o
modificarlo bajo los t&eacute;rminos de la GNU General Public License, tal como
ha sido publicado por la Free Software Foundation; a partir de la versi&oacute;n
2 de dicha Licencia, o (a su elecci&oacute;n) posteriores.</P>
<P>Este documento se distribuye con la esperanza de que ser&aacute; de utilidad,
pero <B>sin garant&iacute;a alguna</B>; carece de licencia <B>mercantil</B> o
de <B>beneficio particular</B>. Consulte la GNU General Public License
para m&aacute;s detalles.</P>
<P>Puede obtener una copia de la GNU General Public License escribiendo a la
la siguiente direcci&oacute;n: Free Software Foundation, Inc., 675 Mass Ave,
Cambridge, MA 02139, USA. </P>


<HR>
Anterior
<A HREF="CDRom-Como-2.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc1">Indice</A>
</BODY>
</HTML>
