<HTML>
<HEAD>
<TITLE>CDROM-COMO: La Tecnolog&iacute;a CD-ROM</TITLE>
</HEAD>
<BODY>
<A HREF="CDRom-Como-1.html">Anterior</A>
<A HREF="CDRom-Como-3.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. La Tecnolog&iacute;a CD-ROM</A></H2>


<P>
<BLOCKQUOTE><CODE>
<PRE>
&quot;El CD-ROM es una memoria de solo-lectura, y el sistema de audio de discos
compactos se halla en forma de paquetes de datos digitales para este
proposito. Para escuchar CD-Audio, por favor, inserte la clavija del
auricular.&quot;  --- extraido del manual de instrucciones de un CD-ROM
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>¡No se desespere! El mundo de la tecnolog&iacute;a del CD-ROM no es tan
incomprensible como el manual de instrucciones de su unidad. </P>
<P>CD-ROM es el acr&oacute;nimo de <EM>Compact Disc Read-Only Memory</EM>. Es un
medio de almacenamiento masivo de datos que se sirve de un l&aacute;ser &oacute;ptico
para la lectura de unas oquedades microsc&oacute;picas que est&aacute;n estampadas en
la superficie de un disco de aluminio recubierto de policarbonato. </P>
<P>Se basa en el mismo sistema que emplean los CDs de audio. Gracias a su
alta capacidad de almacenamiento, seguridad y bajo coste, el CD-ROM se
est&aacute; convirtiendo en un medio de almacenamiento cada vez m&aacute;s popular.</P>
<P>La capacidad de almacenamiento de un disco compacto es de unos 650
megabytes, o el equivalente a algo m&aacute;s de 500 discos de 3.5" de alta
densidad... algo as&iacute; como la friolera de unas 250.000 p&aacute;ginas de texto
mecanografiado. </P>
<P>Las unidades de primera generaci&oacute;n (conocidas como de velocidad sencilla; 
(<I>single speed</I>) proporcionaban una velocidad de transferencia de
aproximadamente 150 kilobytes/segundo. Luego los fabricantes de hardware
empezaron a desarrollar unidades de doble velocidad (2x, a 300Kb/seg.), de
cu&aacute;druple velocidad (4x, a 600Kb/seg.) y as&iacute;... A la hora de escribir este
documento, ya se est&aacute;n fabricando unidades de 24x y su precio es bastante
asequible. </P>
<P>Casi todas las unidades de CD-ROM emplean una de las siguientes
interfases: SCSI (<I>Small Computer Systems Interface</I>), IDE/ATAPI, o
alguna interfase propietaria del fabricante. Por lo general, pueden
reproducir CDs de audio. La salida del audio tiene lugar bien por medio de
una clavija (jack) que se inserta en un conector externo, a trav&eacute;s de la
tarjeta de sonido, u otro medio similar. Algunos CDROM permiten la
extracci&oacute;n de los datos de audio en formato digital.</P>
<P>Los CD-ROM suelen venir formateados con el sistema de ficheros ISO-9660
(tambi&eacute;n llamado <EM>High Sierra</EM>). En dicho formato, los nombres de
ficheros siguen el est&aacute;ndar del DOS (es decir, 8+3 caracteres). Una
extensi&oacute;n del mismo, denominada <EM>Rock Ridge Extensions</EM>, se vale de
una serie de campos indefinidos dentro del est&aacute;ndar ISO-9660 para poder
dar soporte a los nombres de ficheros m&aacute;s largos e informaciones
adicionales que se utilizan en Unix (p.e. permisos de lectura, escritura y
ejecuci&oacute;n, enlaces simb&oacute;licos, etc).</P>
<P>El <EM>PhotoCD</EM> es un est&aacute;ndar desarrollado por Kodak para almacenar
im&aacute;genes fotogr&aacute;ficas en CDROM. Con las aplicaciones adecuadas, Vd. podr&aacute;
ver las im&aacute;genes, manipularlas, imprimirlas, etc. La posibilidad de a&ntilde;adir
datos a un PhotoCD a posteriori se conoce como <EM>multi-sesi&oacute;n</EM>.</P>
<P>Las grabadoras de CD-ROM (CD-R) van siendo (poco a poco) cada vez m&aacute;s
asequibles para nuestros bolsillos. Utilizan un sistema diferente y
disponen de un hardware muy complejo para realizar la grabaci&oacute;n, pero los
discos resultantes son legibles con cualquier unidad de CDROM.</P>
<P>En el futuro, se desarrollar&aacute;n nuevas tecnolog&iacute;as que multiplicar&aacute;n la
capacidad de almacenamiento de los dispositivos actuales. </P>

<HR>
<A HREF="CDRom-Como-1.html">Anterior</A>
<A HREF="CDRom-Como-3.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc2">Indice</A>
</BODY>
</HTML>
