<HTML>
<HEAD>
<TITLE>CDROM-COMO: Aplicaciones</TITLE>
</HEAD>
<BODY>
<A HREF="CDRom-Como-4.html">Anterior</A>
<A HREF="CDRom-Como-6.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Aplicaciones</A></H2>


<P>En esta secci&oacute;n se describen brevemente algunas de las aplicaciones
relacionadas con el CD-ROM que hay disponibles para Linux. Vea tambi&eacute;n el
Mapa de Software de Linux (LSM). </P>

<H2><A NAME="ss5.1">5.1 Reproductores de CDs de Audio</A></H2>


<P>Hay muchos programas que sirven para la reproducci&oacute;n de discos compactos,
bien a trav&eacute;s de unos auriculares, o por la tarjeta de sonido. </P>
<P>
<DL>

<DT><B>Workman</B><DD><P>reproductor en modo gr&aacute;fico bajo las X11 con soporte
para base de datos de CDs y otras muchas caracter&iacute;sticas.</P>

<DT><B>WorkBone</B><DD><P>reproductor interactivo en modo texto</P>
<DT><B>xcdplayer</B><DD><P>sencillo reproductor basado en las X11</P>
<DT><B>cdplayer</B><DD><P>sencillo reproductor desde la l&iacute;nea de comandos</P>
<DT><B>Xmcd</B><DD><P>reproductor basado en las X11 y Motif</P>
<DT><B>xmitsumi</B><DD><P>otro reproductor basado en las X11 para unidades Mitsumi</P>

<DT><B>xplaycd</B><DD><P>otro reproductor basado en las X11, con utilidades de
mezcla y control de volumen</P>

<DT><B>cdtool</B><DD><P>reproductor de CDs desde la l&iacute;nea de comandos</P>
</DL>
</P>
<P>Alguno de estos programas vienen dise&ntilde;ados para utilizar alg&uacute;n fichero de
dispositivo concreto (p.e. <CODE>/dev/cdrom</CODE>). Deber&aacute; introducir el
adecuado como par&aacute;metro, o bien crear un enlace simb&oacute;lico en el directorio
<CODE>/dev</CODE>. Si la salida se realiza desde el CDROM a una tarjeta de
sonido, quiz&aacute;s quiera usar un programa mezclador para ajustar el volumen y
seleccionar la entrada del CDROM cuando desee grabar. </P>


<H2><A NAME="ss5.2">5.2 PhotoCD</A></H2>


<P>Los PhotoCD emplean el sistema ISO-9660. Los archivos de im&aacute;genes vienen
en formato propietario. No todos los lectores de CDROM soportan la lectura
de PhotoCD. </P>
<P><CODE>hpcdtoppm</CODE> es un programa escrito por Hadmut Danisch para la
conversi&oacute;n de archivos de PhotoCD a mapa de pixels (pixmap). Se encuentra
disponible v&iacute;a ftp en <CODE>
<A HREF="ftp://ftp.gwdg.de/pub/linux/hpcdtoppm">ftp://ftp.gwdg.de/pub/linux/hpcdtoppm</A></CODE> o bien inclu&iacute;do en el
paquete de utilidades PBM (<I>Portable Bit Map</I>) , disponible en muchos
bancos de archivos (b&uacute;squelo por "<CODE>pbm</CODE>" o "<CODE>netpbm</CODE>").</P>
<P><CODE>photocd</CODE>, un programa de Gerd Knorr, <CODE>
<A HREF="mailto:kraxel@cs.tu-berlin.de">kraxel@cs.tu-berlin.de</A></CODE>
para la conversi&oacute;n de PhotoCDs en archivos de mapa de bits: Targa, Windows
y OS/2. </P>
<P>Del mismo autor es el programa <CODE>xpcd</CODE>, basado en las X11, dise&ntilde;ado
para la gesti&oacute;n de im&aacute;genes de PhotoCD. Vd. puede seleccionar las im&aacute;genes
con el rat&oacute;n, hacer previsualizaciones en una peque&ntilde;a ventana y cargar la
imagen en alguna de las cinco resoluciones posibles. Tambi&eacute;n puede cargar
un determinado &aacute;rea de la imagen: <CODE>
<A HREF="ftp://ftp.cs.tu-berlin.de/pub/linux/Local/misc/">ftp://ftp.cs.tu-berlin.de/pub/linux/Local/misc/</A></CODE>. </P>
<P>ImageMagick permite la manipulaci&oacute;n de archivos de im&aacute;genes, tambi&eacute;n
soporta el formato PhotoCD. Lo puede encontrar v&iacute;a ftp <CODE>
<A HREF="ftp://ftp.x.org/contrib/applications/ImageMagick/">ftp://ftp.x.org/contrib/applications/ImageMagick/</A></CODE>. </P>


<H2><A NAME="ss5.3">5.3 <CODE>mkisofs</CODE></A></H2>


<P>Con el paquete <CODE>mkisofs</CODE>, de Eric Youngdale's, podr&aacute; crear una
partici&oacute;n del disco duro con el sistema de ficheros ISO-9660. Ello puede
serle de gran utilidad a la hora de desarrollar y verificar sistemas de
archivos de CD-ROM antes de hacer los masters.</P>
<P>Las utilidades para la escritura de CD-ROM suelen ser suministradas por el
fabricante. El proceso de escritura tiene que realizarse sin que haya
interrupciones, caracter&iacute;stica para la cual un sistema multitarea como
Linux est&aacute; particularmente bien dotado. </P>


<H2><A NAME="ss5.4">5.4 Utilidades ISO-9660</A></H2>


<P>Aqu&iacute; encontrara algunas utilidades para la verificaci&oacute;n del sistema de
ficheros ISO-9660 en discos formateados. Le ser&aacute; de gran inter&eacute;s a la hora
de hacer comprobaciones de CDs que puedan estar defectuosos. Puede
conseguir el paquete v&iacute;a ftp <CODE>
<A HREF="ftp://ftp.cdrom.com/pub/cdrom/ptf/">ftp://ftp.cdrom.com/pub/cdrom/ptf/</A></CODE>.
Est&aacute; escrito por Bill Siegmund y Rich Morin.</P>


<HR>
<A HREF="CDRom-Como-4.html">Anterior</A>
<A HREF="CDRom-Como-6.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc5">Indice</A>
</BODY>
</HTML>
