<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.1">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Forum">
 <TITLE>Forum : La secreta obsesi&oacute;n de Tux - Jugando con Linux</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Harald-Radke.gif" ALT="[Photo of the Author]" width=110 height=135>
<BR>por  <A HREF="mailto:harryrat@gmx.de">Harald Radke</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Harry estudia inform&aacute;tica en la <i>Universidad Tecnol&oacute;gica deAachen</i>, Alemania, desde 1994. Lleg&oacute; a Linux en 1995. Desde entoncesle anda dando vueltas, sorprendi&eacute;ndose constantemente de lo buensoftware que es. Programa un poco bajo X, le gustat los temas gr&aacute;ficosy, por supuesto, jugar. Otros hobbies son: los juegos de tablero, leerciencia ficci&oacute;n, tocar (mal) la guitarra, cocinar, practicar Ju-Jutsuy pasar el tiempo con su novia.</P>
<P><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Un poco de historia</A></LI>
  <LI><A HREF="#lfindex2">Las librer&iacute;as y los Kits de desarrollo </A></LI>
  <LI><A HREF="#lfindex3">Sobre Civilizaciones, Carreras y Flotas Estelares...</A></LI>
  <LI><A HREF="#lfindex4">Mundos ajenos - Juegos bajo Wine </A></LI>
  <LI><A HREF="#lfindex5">Juegos Comerciales</A></LI>
  <LI><A HREF="#lfindex6">El Futuro</A></LI>
  <LI><A HREF="#lfindex7">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=118&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>La secreta obsesi&oacute;n de Tux - Jugando con Linux</H2>
 <IMG SRC="../../common/images/article118/playingtux.gif" ALT="[Illustration]" HSPACE=10 HEIGHT=100 WIDTH=100><P><i>Resumen</i>:
<P>

Este es un peque&ntilde;o repaso al panorama de los juegos bajo Linux. Intentamostrar que en el sistema operativo de Tux hay m&aacute;s que internet oprocesamiento de datos. Actualmente hay mucho que descubrir sobre Linuxy los juegos.
</P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>


<p>Todos conocemos a Tux, el simp&aacute;tico ping&uuml;ino de Linux, como un gran trabajador enla comunidad internet. Un mont&oacute;n de sitios web, bases de datos, proveedores de internet,etc. se apoyan en sus hombros. Programas como <i>sendmail</i>, <i>mySQL</i>, ...,corriendo bajo Linux demuestran d&iacute;a a d&iacute;a que este sistema operativo es fiable,r&aacute;pido y eficiente. Recientemente, Tux ha empezado ha labrar su camino en losescritorios. <i>KDE</i>, <i>GNOME</i> o <i>GIMP</i> son ejemplos de software productivo,con el que el usuario t&iacute;pico es capaz de completar sus tareas diarias. Proporcionancaracter&iacute;sticas como un interfaz gr&aacute;fico atractivo que tanto ha sido echado de menosen el pasado. Y ahora hay otro aspecto de Linux que va siendo reconocido lentamentepor los usuarios, la prensa y las empresas: <i>juegos</i>.
</p>
<p>Este art&iacute;culo intenta dar una breve introducci&oacute;n a &eacute;ste &aacute;rea de Linux. Al final de &eacute;l encontrar&aacute;suna lista de referencias que deber&iacute;as mirar para obtener informaci&oacute;n m&aacute;s detallada sobre losjuegos y programas de los que habla el art&iacute;culo. Tambi&eacute;n se pretende comenzar una nueva categor&iacute;aen Linux<font color="#FF0000">Focus</font>, sobre aspectos l&uacute;dicos. Pedimos por tanto a los lectores que escriban sobre juegos. Sihas probado varios juegos o ya eres un jugador habitual, comparte tus experiencias con otrosescribiendo un art&iacute;culo.</p>
<p>
<center>
<table border=0>
<tr><td><a href="../../common/images/article118/gameshot1.jpg"><img src="../../common/images/article118/gameshot1_s.gif"
width=160 height=100></a><center>Abuse</center>
</td>
<td><a href="../../common/images/article118/gameshot2.jpg"><img src="../../common/images/article118/gameshot2_s.gif"
width=160 height=100></a><center>Civilisation: Call to Power</center>
</td></tr>
</table>
</center>

<A NAME="lfindex1">&nbsp;</A>
<H2>Un poco de historia</H2>

<p>Los primeros juegos para Linux fueron aquellos que puedes encontrar bajo casi cualquier otroUnix, por lo que portarlos fue relativamente f&aacute;cil. Tambi&eacute;n suced&iacute;a que los primeros usuarioslos conoci&aacute;n a partir de los sistemas operativos de su trabajo o escuela. Aquellos programaseran juegos simples con gr&aacute;ficos simples o inexistentes, sin comparaci&oacute;n con los juegos quetodo el mundo conoc&iacute;a de los PC con DOS o Windows. Las cajas en las que anteriormente corr&iacute;aUnix eran caras de equipar con hardware gr&aacute;fico suficiente y sencillamente eran usadas en&aacute;reas diferentes del entretenimiento.</p>

<p>Pero, al llegar a los PC caseros, Linux encontr&oacute; un entorno razonablemente potente y baratopara mostrar m&aacute;s que simple texto o gr&aacute;ficos primitivos. El desarrollo del sistema operativode Tux continu&oacute; y hoy d&iacute;a casi cualquier adaptador gr&aacute;fico se encuentra soportado bajo elsistema X Window. De esta forma se proporcion&oacute; un entorno gr&aacute;fico para bonitas aplicacionesy juegos. Por supuesto que sigue existiendo la consola, no s&oacute;lo en texto sino con gr&aacute;ficos.Pero la gran mayor&iacute;a de las aplicaciones que se desarrollan hoy d&iacute;a trabajan bajo X.</p>

<p>El siguiente problema para los programadores fue que X es complejo de progrmar y quelleva un mont&oacute;n de trabajo incluso mostrar una ventana sencilla. De forma que las cosasevolucionaron lentamente. El mismo X usa un mont&oacute;n de recursos del sistema, lo que haceque los juegos sean lentos y bastante sencillos. Pero seg&uacute;n el hardware se iba volviendom&aacute;s y m&aacute;s potente y los precios alcanzaban niveles aceptables, se iba podiendo escribirsofware m&aacute;s exigente. Y con el paso del tiempo, los programadores recibieron ayuda devarias librer&iacute;as y kits de desarrollo.</p>

<p>M&aacute;s y m&aacute;s vendedores de esta clase de hardware se dieron cuenta de la importancia de Linuxpara un grupo creciente de due&ntilde;os de ordenadores, sus clientes. Uno a uno empezaron a proporcionarinformaci&oacute;n o drivers, ya fuera en forma binaria o con fuente abierta, para sus productos:adaptadores gr&aacute;ficos, aceleradores 3D y tarjetas de sonido. Hoy d&iacute;a, Linux dispone de soportenativo para multitud de componentes multimedia.</p>

<p>Pero no s&oacute;lo las empresas de hardware reconocieron a Linux. La industria del juego tambi&eacute;nse percat&oacute; de este nuevo sistema operativo. Aunque la mayor parte de los juegos para Linuxeran gratis (p.e. los sujetos a la licencia p&uacute;blica GNU) hab&iacute;a algunos juegos comerciales.De esta forma las posibilidades de conseguir entretenimiento de alta calidad en Linuxcrecieron r&aacute;pidamente. Y aunque algunos podr&iacute;an pensar que la distribuci&oacute;n comercial noencaja bien con el esp&iacute;ritu de un Linux gratuito, yo personalmente considero que el buensoftware siempre puede llevar consigo un precio razonable. Y no deber&iacute;amos olvidar que sehace dinero con Linux, tal vez no tanto por vender el software como por ligarlo a hardware(servidores de red) o proporcionar soporte. Esto no se puede hacer con los juegos. Lo &uacute;nicoque puedes hacer es venderlos, y la presi&oacute;n del software libre puede obligar a las compa&ntilde;&iacute;asde juegos no s&oacute;lo a escribir buen sofware, sino tambi&eacute;n a hacer cosas realmente atractivaspara lograr que la gente las compre.</p>

<p>
<center>
<table border=0>
<tr><td><a href="../../common/images/article118/gameshot3.jpg"><img src="../../common/images/article118/gameshot3_s.gif"
width=160 height=100></a><center>Heretic</center>
</td>
<td><a href="../../common/images/article118/gameshot4.jpg"><img src="../../common/images/article118/gameshot4_s.gif"
width=160 height=100></a><center>Hopkins FBI</center>
</td></tr>
</table>
</center>

<A NAME="lfindex2">&nbsp;</A>
<H2>Las librer&iacute;as y los Kits de desarrollo </H2>

<p>Como dijimos antes, los programadores usan una mezcla de toolkits, librer&iacute;as, kitsde desarrollo (SDKs) e incluso motores de juego completos. Por supuesto, uno puedeusar los conjuntos de widgets para X como <i>qt</i>, <i>gtk</i>, <i>athena</i>,
<i>xforms</i> y otros. Estos conjuntos proporcionan una forma c&oacute;moda de crearinterfaces de usuario agradables, as&iacute; como un manejo sencillo de gr&aacute;ficos. Para unagran cantidad de juegos es suficiente. Programas que no realizen multitud de complejasoperaciones gr&aacute;ficas pueden ser escritos de forma bastante f&aacute;cil y presentar elaspecto que todos conocemos de otras aplicaciones X.</p>

<p>Pero, mientras que juegos como <i>buscaminas</i>, <i>Mahjong</i> o incluso <i>Tetris</i>pueden escribirse con estas librer&iacute;as, las cosas empeoran si llegamos a los juegos deestrategia en tiempo real como <i>Warcraft</i> o <i>Command & Conquer</i>. Los fusilerosde 3D tratan con texturas agradables, y deben proporcionar una alta velocidad de framespara atar al usuario a la pantalla (imaginemos <i>Unreal</i> o <i>Descent</i> con unoo dos frames por segundo). Para estas necesidades las librer&iacute;as de widgets de prop&oacute;sitogeneral de X son insuficientes. Afortunadamente hay otras librer&iacute;as dise&ntilde;adas paraabordar con f&aacute;cilidad gr&aacute;ficos veloces y complejos.</p>

<p>En el tema de gr&aacute;ficos 3D, <i>Mesa</i> es la n&uacute;mero uno de estas librer&iacute;as. Mesa es unaimplementaci&oacute;n gratuita de <i>OpenGL</i> especialmente dise&ntilde;ada para crear escenas 3D enbase a <i>primitivas</i> sencillas como v&eacute;rtices y pol&iacute;gonos. Uno de los aspectos m&aacute;simportantes de OpenGL es que existen juegos gen&eacute;ricos que lo usan. Por ello, es posible
portarlos a Linux sin necesidad de reescribirlos completamente. Una de las mayores deventajas
de Mesa es la ausencia de soporte de hardware de aceleraci&oacute;n de gr&aacute;ficos 3D, que es imprescindible
para juegos de primera l&iacute;nea con texturas, niebla, <em>alpha blending</em> y cosas similares.
Durante un largo tiempo, <i>3dfx</i> ha sido el &uacute;nico vendedor de hardware que ha proporcionado
ejecutables que permitieran acceder a su hardware bajo Mesa. Much&iacute;simas m&aacute;quinas que no usaban
dicho hardware se ve&iacute;an obligadas a usar la propia CPU para realizar los c&aacute;lculos, lo que reduce
dr&aacute;sticamente el rendimiento. Aunque actualmente, muchos usuarios de PC se pueden beneficiar de
su hardware 3D desde que NVidia liber&oacute; las fuentes para acceder a sus chipsets Riva128/ZX/TNT/TNT2.
Y tamb&iacute;en el Matrox G200 es actualmente soportado por Mesa. Muchas aplicaciones (y juegos) que usan
Mesa/OpenGL pueden encontrarse en internet. La mayor parte de sus nombres comienzan con <tt>GL</tt>.
</p>

<p>
Hay m&aacute;s liber&iacute;as y kits de desarrollo de software para temas gr&aacute;ficos, proporcioando el manejo de
eventos que fueren dise&ntilde;adas para juegos. Una es <i>SDL</i>, escritar por <i>Loki Entertainment</i>.
Loki porta a Linux juegos populares de PC. Han liberado sus librer&iacute;as y todo el mundo puede usarlas.
Hay listas de correo donde los ususarios y programadores de Loki hablan sobre SDL. Actualmente hay varios juegos desarrollados como fuente abierta y que usan SDL. <br>
Otras librer&iacute;as, aparte de SDL son: <i>PLib</i>, <i>ClanLib</i> o <i>PowerPakGame SDK</i>.

<p>
Pero los juegos necesitan m&aacute;s cosas aparte de gr&aacute;ficos. Hay kits de sonido disponibles para escuchar
m&uacute;sica y crear efectos sonoros m&aacute;s f&aacute;cilmente que a trav&eacute;s del sistema de sonido bajo Linux (ya sea OSS, ALSA o cualquier otro). ALgunas de las librer&iacute;as mencionadas que fueron desarrolladas
espec&iacute;ficamente para el desarrollo de juegos combinan estas caracter&iacute;sticas, proporcionando
gr&aacute;ficos y sonidos y, en ocasiones, incluso animaciones completas.
</p>

<p>
Hay otro grupo de asistentes para los creadores de juegos, llamados <i>motores</i>. Estos kits de
desarrollo de software intentan cubrir todos los aspectos de un g&eacute;nero de juegos e intentan abstraer
el proceso de creaci&oacute;n del juego de la programaci&oacute;n a bajo nivel. Hay motores como <i>Chrystal Space</i> para juegos de acci&oacute;n 3D y aventuras en primera persona, o aquellos para crear juegos
de rol (RPGs).
</p>

<p>
Como puede verse, no hay una librer&iacute;a/API/toolkit est&aacute;ndar como puede ser <i>directX</i> bajo Windows.
Esto obliga a los usuarios a hojear los requerimientos del juego para elegir todos los elementos
de software que necesita el juego. Y de esta forma, nuestra m&aacute;quina esta llena con docenas de
librer&iacute;as para estos juegos, sin los que no podemos parar. Por otra parte, la mayor&iacute;a de las cajas
Linux disponen hoy d&iacute;a de discos duros suficientemente grandes para todo este software.
</p>

<p>
<center>
<table border=0>
<tr><td><a href="../../common/images/article118/gameshot5.jpg"><img src="../../common/images/article118/gameshot5_s.gif"
width=160 height=100></a><center>mHockey</center>
</td>
<td><a href="../../common/images/article118/gameshot6.jpg"><img src="../../common/images/article118/gameshot6_s.gif"
width=160 height=100></a><center>Golgotha</center>
</td></tr>
</table>
</center>

<A NAME="lfindex3">&nbsp;</A>
<H2>Sobre Civilizaciones, Carreras y Flotas Estelares...</H2>

<p>
Puedes encontrar casi cualquier clase de juego que busques corriendo bajo Linux. Si buscas un
entretenimiento r&aacute;pido durante una pausa en el trabajo, neceistat un juego como <i>buscaminas</i>,
<i>tetris</i>, <i>go</i>, ...; O si sientes la necesidad de liberar al planeta de esos horrorosos
aliens o robots, tienes <i>doom</i>, <i>heretic</i>, <i>descent</i>. Necesitas algo m&aacute;s sofisticado, como liderar a una tribu desde el comienzo de los tiempos hasta ls cima del mundo?. No hay problema,
prueba <i>FreeCiv</i> o <i>Civilisation: Call To Power</i>. &iquest;Que no tienes carnet de conducir?. Ok,
subete al b&oacute;lido con <i>XRacer</i> o <i>GlRacer</i>. Ya ves, todo est&aacute; por ah&iacute;. La mayor parte de
los juegos, al correr bajo Linux, proporcionan capacidad multijugador, lo que hace las cosas incluso
m&aacute;s emocionantes
</p>

<p>
Tal vez ya conocieras algunos de estos juegos, mientras que los otros te resultan totalmente nuevos.
Algunos son clones o han sido portados a partir de juegos existentes para PC, o son juegos nuevos de
g&eacute;neros bien conocidos. Los <i>clones</i> son juegos desarrollados desde cero, con sus propios
gr&aacute;ficos, sonidos y datos (aunque obviamente son similares a los del programa original) con algunas
caracter&iacute;sticas m&aacute;s o menos nuevas. <i>FreeCiv</i> es un buen ejemplo. Los juegos portados suelen
comportarse exactamente como el original. Aunque la mayor parte se distribuyen de forma completa (como <i>Civilistion: Call To Power</i>), algunos son proyectos que s&oacute;lo se preocupan por las partes
del juego que necesitan ser re-escritas. <i>Descent</i>, <i>Doom</i> , <i>Heretic</i> y
<i>ALE Clone</i> son de este tipo. Para jugarlos necesitas disponer de la versi&oacute;n para DOS, que suministra los datos para el juego. Y, por supuesto, est&aacute;n los arcades y juegos de tablero, aventuras, simuladores y dem&aacute;s, que usan reglamentos de juegos existentes (a veces completamente nuevos), y sin ninguna relaci&oacute;n con juegos de PC existentes
</p>

<p>
Bueno, llegados a este punto, es hora de rebajar un poco las expectativas. Hay multitud de projectos
sobre juegos ah&iacute; fuera. Todo son diferentes respecto a los gr&aacute;ficos y a la calidad del juego.
Algunos son complejos, otros simples, todos est&aacute;n en constante desarrollo, tal vez ya son jugables,
tal vez no. De modo que no esperemos total satisfacci&oacute;n de todos ellos. Pero, para ser justos,
tengamos en cuenta que la mayor parte de ellos son escritos en el tiempo libre del autor, y sin
recibir nada por ellos. A menudo estos programadores trabajan por su cuenta, sin ayuda de otros
usuarios. Seamos pacientes con juegos sin acabar, con errorres o incluso complicados de instalar.
Puedes ayudar al desarrollo informando sobre errores, enviando sugerencias, tal vez incluso creando
gr&aacute;ficos y sonido o participando activamente en la programaci&oacute;n. Un juego no deja de ser un proyecto
de software bajo Linux, que requiere feedback y ayuda.
</p>

<p>
<center>
<table border=0>
<tr><td><a href="../../common/images/article118/gameshot7.jpg"><img src="../../common/images/article118/gameshot7_s.gif"
width=160 height=100></a><center>Pingus</center>
</td>
<td> <a href="../../common/images/article118/gameshot8.jpg"><img src="../../common/images/article118/gameshot8_s.gif"
width=160 height=100></a><center>World Forge</center>
</td></tr>
</table>
</center>

<A NAME="lfindex4">&nbsp;</A>
<H2>Mundos ajenos - Juegos bajo Wine </H2>

<p>Wine permite ejecutar aplicaciones Windows bajo X. Lo mismo puede hacer con tus juegos favoritos.
Existen varios informes de historias exitosas al usar varios juegos con wine. Aunque debes ser
consciente de que wine , aunque usable, est&aacute; a&uacute;n en construccion, y bastante lejos de ser
estable, especialmente al llegar a sofware para Win32. Aunque en cualquier caso es &uacute;til intentarlo,
y es una prueba adiciones de las capacidades que nos da Linux.

<p>
<center>
<table border=0>
<tr><td><a href="../../common/images/article118/gameshot9.gif"><img src="../../common/images/article118/gameshot9_s.gif"
width=160 height=100></a><center>X Racer</center>
</td>
<td><a href="../../common/images/article118/gameshot10.jpg"><img src="../../common/images/article118/gameshot10_s.gif"
width=160 height=100></a><center>Myth II</center>
</td></tr>
</table>
</center>

<A NAME="lfindex5">&nbsp;</A>
<H2>Juegos Comerciales</H2>

<p>
El comportamiento del mundo comercial respecto a Linux var&iacute;a desde la ignorancia absoluta hasta el
portar juegos. Incluso hay nuevas empresas fundadas especialmente para escribir juegos para Linux.
Unas pocas empresas liberan los c&oacute;digos fuente de sus productos m&aacute;s viejos, de forma que puedan
portarse sin coste. Algunas compa&ntilde;ias dejan portar sus juegos, mientras otras planean hacerlo ellas
mismas. Algunas dudan, portando tan s&oacute;lo algunas partes (por ejemplo, el software de servidor en
juegos multijugador). Hay peticiones de usuarios en la web, para intentar que las empresas publiquen
versiones para Linux de sus juegos. Esta es una buena forma de demostrar que hay un mercado para
el software bajo Linux.
</p>

<p>
Hay todo de todo. La parte comercial es a&uacute;n muy peque&ntilde;a, y la mayor parte de los programadores son
totalmente nuevos en Linux y el potencial del mercado de Linux a&uacute;n no les resulta importante. De todas formas, algunos se arriesgan a invertir tiempo y dinero en estos proyectos. Intentemos no s&oacute;lo
desear un final feliz. Si podemos elegir entre la versi&oacute;n <i>corriente</i> y la de Linux, usemos
la segunda, incluso aunque la instalaci&oacute;n pudiera no ser tan simple y nos resulte algo raro el pagar
por software para Linux.

<p>
<center>
<table border=0>
<tr><td><a href="../../common/images/article118/gameshot11.jpg"><img src="../../common/images/article118/gameshot11_s.gif"
width=160 height=100></a><center>Parsec</center>
</td>
<td><a href="../../common/images/article118/gameshot12.jpg"><img src="../../common/images/article118/gameshot12_s.gif"
width=160 height=100></a><center>Free Civ</center>
</td></tr>
</table>
</center>

<A NAME="lfindex6">&nbsp;</A>
<H2>El Futuro</H2>

<p>
De ls misma forma que el desarrollo de juegos seguir&aacute; adelante en general, lo mismo pasar&aacute; con
los juegos para Linux. Creo que las diferencias de calidad entre los juegos generales para PC y
los juegos para Linux se ir&aacute; reduciendo poco a poco. Gracias a las empresas comerciales podremos
jugar a los mimsmos juegos (bueno, no todos ellos) con la misma calidad y bajo Linux. Finalmente,
mi creencia personal es que depender&aacute; de &eacute;ste escenario (m&aacute;s que de otras &aacute;reas) el que Linux
se vaya introduciendo en los PC caseros. No solo como un juguete o conviviendo con otro sistema
operativo sino como una alternativa real a &eacute;l.
</p>

<p>
Y hablando sobre el futuro, planeo escribir algunas revisiones de juegos para LinuxFocus. Aunque,
por supuesto, invito a todo el mundo a hacer lo mismo. Creo que este tema es lo bastante
interesante como para gastar alg&uacute;n tiempo en el. Siendo honestos, &iquest;a quien no le gusta jugar? -:
</p>

<p>
<center>
<table border=0>
<tr><td><a href="../../common/images/article118/gameshot13.jpg"><img src="../../common/images/article118/gameshot13_s.gif"
width=160 height=100></a><center>BFRIS</center>
</td>
<td><a href="../../common/images/article118/gameshot14.jpg"><img src="../../common/images/article118/gameshot14_s.gif"
width=160 height=100></a><center>X Blast</center>
</td></tr>
</table>
</center>

<A NAME="lfindex7">&nbsp;</A>
<H2>Referencias</H2>


<ul>
<li>
<b>Recursos gen&eacute;ricos sobre juegos para Linux:</b>
 <ul>
   <li>El primer sitio para mirar: <a href="http://www.happypenguin.org/">The Linux Game Tome</a>
   <li><a href="http://www.linuxgames.com/">Linux Games</a>,
	noticias y discusiones relativas a juegos para Linux
   <li>El anillo sobre <a href="http://nav.webring.com/cgi-bin/navcgi?ring=linuxgp;index">
	Linux Game Programming(Programaci&oacute;n de juegos en Linux)</a>
   <li>LGDC, el <a href="http://sunsite.auc.dk/linuxgames/">Linux Game Development Center (Centro de desarrollo de juegos para Linux)</a>
 </ul>
<li><b>Librer&iacute;as, SDKs y m&aacute;s:</b>
 <ul>
   <li>SDL the Simple Direct Layer from Loki
   <li><a href="http://www.mesa3d.org/">Mesa</a>, a free OpenGL implementation
   <li><a href="http://crystal.linuxgames.com/">Chrystal Space</a>, a 3D engine
   <li><a href="http://www.clanlib.org/">ClanLib</a>
   <li><a href="http://www.woodsoup.org/projs/plib/">PLib</a>
   <li><a href="http://www.angelfire.com/va/powerpakgsdk/">PowerPak Game SDK</a>
   <li>Windows Software under Linux: <a href="http://www.winehq.com/">Wine</a>
 </ul>
<li><b>Compa&ntilde;&iacute;as de juegos que tratan con juegos para Linux: </b>
 <ul>
   <li><a href="http://www.lokigames.com">Loki Entertainment</a>, porta juegos a Linux
<li><a href="http://www.threeaxis.com/">Three Axis Interactive</a>
   <li><a href="http://www.aegistech.com">Aegis</a> Simulation Technologies
 </ul>
<li><b>Juegos de los que hemos obtenido pantallados:</b>
  <ul>
   <li><a href="http://www.jitit.com/abuse/">Abuse</a>
   <li><a href="http://www.aegistech.com/bfris-b.html">BFRIS</a>
   <li><a href="http://209.223.115.151/products/civctp/">Civilisation: Call To Power</a>
   <li><a href="http://www.freeciv.org/">FreeCiv</a>
   <li><a href="http://www.golgotha.org">Golgotha</a>
   <li><a href="http://www.cs.uni-potsdam.de/~wertmann/index.html">Heretic</a>
   <li><a href="http://hopkinsfbi.linuxgames.com/">Hopkins FBI</a>
   <li><a href="http://www.linuxgames.com/mhockey/">mHockey</a>
   <li><a href="http://209.223.115.151/products/myth2/">Myth II</a>
   <li><a href="http://www.parsec.org/">Parsec</a>
   <li><a href="http://dark.x.dtu.dk/~grumbel/pingus/index.html">Pingus</a>
   <li><a href="http://www.worldforge.org">WorldForge</a>
   <li><a href="http://www.ikp.uni-koeln.de/~vogel/xblast/xblast.html">XBlast</a>
   <li><a href="http://xracer.annexia.org/">XRacer</a>
  </ul>
</ul>



<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=118&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Harald Radke, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article118.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:harryrat@gmx.de"><FONT COLOR="#FFFFFF">Harald Radke</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2000-12-01, generated by lfparser version 2.1</font></p>
</BODY>
</HTML>
