<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_0.6">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Graphics">
 <TITLE>Graphics : Sketch, gr&aacute;ficos vectoriales bajo Linux</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Yves-Ceccone.jpg" ALT="[Photo de l&aacute;uteur]" HEIGHT=147 WIDTH=132>
<BR>por  <A HREF="http://perso.easynet.fr/~yeccoe/linux_infographie.htm">Yves Ceccone</A>
<BR><BR><I>Sobre el Author:</I><BR><P>

Formado como fot&oacute;grafo y migrado hacia la infograf&iacute;a, no ha dado descanso
al rat&oacute;n desde entonces.

</P><P><FONT COLOR="#336633">Contenidos</FONT>:
<OL>
  <LI><A HREF="#lfindex0">Instalaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Herramientas b&aacute;sicas</A></LI>
  <LI><A HREF="#lfindex2">Ventanas flotantes</A></LI>
  <LI><A HREF="#lfindex3">El disco flexible</A></LI>
  <LI><A HREF="#lfindex4">Puesta de sol</A></LI>
  <LI><A HREF="#lfindex5">Efectos de volumen y fusiones</A></LI>
  <LI><A HREF="#lfindex6">Texto siguiendo una curva</A></LI>
  <LI><A HREF="#lfindex7">Texto vectorizado</A></LI>
  <LI><A HREF="#lfindex8">Importando y enmascarando</A></LI>
  <LI><A HREF="#lfindex9">Lo que est&aacute; por llegar</A></LI>
</OL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Sketch, gr&aacute;ficos vectoriales bajo Linux</H2>
 <IMG SRC="../../common/images/illustration99.gif" ALT="[Illustration]" HSPACE=10 HEIGHT=100 WIDTH=100><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
<B>Sketch</B> es un progama de dibujo vectorial, lo que quiere decir que
representa las figuras, por ejemplo un c&iacute;rculo, como una f&oacute;rmula matem&aacute;tica,
por oposici&oacute;n a programas como <i>The GIMP</i>, de tipo bitmap, que usan puntos
(pixeles) para ello.
Las ventajas de una representaci&oacute;n vectorial frente a una de tipo bitmap son
que produce ficheros de menor tama&ntilde;o y que el gr&aacute;fico puede ser
considerablemente ampliado sin las p&eacute;rdidas de calidad que se producen con
las im&aacute;genes tipo bitmap.
No es posible representar una fotograf&iacute;a en modo vectorial, por lo que se
ha hecho posible integrar im&aacute;genes bitmap dentro de <i>skethc</i>
(eps, jpg, gif, tiff, ...) as&iacute; como importar otros formatos gr&aacute;ficos
(xfig, illustrator, corel, ...). Sin ninguna dificultad, es posible leer y
modificar gr&aacute;ficos creados con Illustrator 6 en un Mac, o con Illustrator 7
sobre un PC. Sketch tambi&eacute;n es capaz de escribir en el formato usado por
Illustrator (<tt>.ai</tt>). Este art&iacute;culo pretende revisar las herramientas
b&aacute;sicas de Sketch, aplicadas a la creaci&oacute;n de una representaci&oacute;n de un
disco flexible, y explicando alguno de los <i>efectos especiales</i> m&aacute;s
notables posibles gracias al dibujo vectorial.

This article reviews the principle tools of Sketch, details the
creation of a drawing of a floppy disk, and explains some "special"
effects worthy of the big shots of vector drawing.

</P><HR size="2" noshade><BR>
<!-- BODY OF THE ARTICLE -->
  
     
<A NAME="lfindex0">&nbsp;</A>
<H2>Instalaci&oacute;n</H2>


<P>
En la direcci&oacute;n web de 
<A href="http://www.online.de/home/sketch/Default.htm">Sketch</A>
podr&aacute;s encontrar las fuentes, as&iacute; como los binarios ya compilados y las
librer&iacute;as necesarias en formato RPM.
(No fui capaz de compilar el programa, y aparentemente no soy el &uacute;nico ;-)).
La versi&oacute;n usada en este art&iacute;culo es la 0.6.2, sobre RedHat 6.0.
</P>
 
<A NAME="lfindex1">&nbsp;</A>
<H2>Herramientas b&aacute;sicas</H2>


<P>
<img src="../../common/images/article120/image120_01.gif" width="62" height="34" border="1">
<UL>
<LI>Modo edici&oacute;n, para modificar un elemento.
<LI>Modo de selecci&oacute;n (para agrupar varios elementos mediante una caja, o
marc&aacute;ndolos combinando el rat&oacute;n y la tecla <i>shift</i>
</UL>
</P>

<P>
<IMG src="../../common/images/article120/image120_02.gif" width="92" height="34" border="1">
<P>
<UL>
<LI>Deshacer una o varias acciones (tambi&eacute;n sirve "ctrl+z")
<LI>O bien, repetirlas
<LI>Borrar un elemento
</UL>
</P>

<P>
<img src="../../common/images/article120/image120_03.gif" width="92" height="34" border="1">
<UL>
<LI>Duplicar un elemento
<LI>Flip horizontal
<LI>Flip vertical
</UL>
</P>

<P>
<IMG src="../../common/images/article120/image120_04.gif" width="62" height="34" border="1">
<P>
<UL>
<LI>Agrupar o desagrupar elementos
</UL>
</P>

<P>
<IMG src="../../common/images/article120/image120_05.gif" width="121" height="33" border="1">
<P>
<LI>Colocar un objeto al plano superior
<LI>Colocar un objeto sobre el plano actual
<LI>Colocar un objeto bajo el plano actual
<LI>Colocar un objeto en el plano inferior
</UL>
</P>

<P>
<IMG src="../../common/images/article120/image120_06.gif" width="62" height="35" border="1">
<P>
<UL>
<LI>Zoom
<LI>Ajustar a la rejilla (<i>snap-to</i>)
</UL>
</P>

<P>
<IMG src="../../common/images/article120/image120_07.gif" width="185" height="35" border="1">
<P>
<UL>
<LI>Rect&aacute;ngulo : Con la tecla "shift" pulsada, se dibuja desde el centro del
elemento, con la tecla "ctrl" se dibuja un cuadrado, y con "shift + ctrl"
se dibuja un cuadrado alrededor del centro.
<LI>Elipse : El mismo efecto que usando las teclas "shift" y "ctrl"
<LI>Curva de Bézier
<LI>Linea conectando puntos
<LI>Caja de texto (para conseguir que un texto siga una curva, primero se
crea el texto, luego la curva, y entonces se seleccionan ambos y se usa el
men&uacute; : effect -> path text). Con Sketch tambi&eacute;n se pueden vectorizar las
fuentes, lo que viene a ser transformar el texto en un conjunto de curvas
dede Bézier
<LI>Importar una imagen
</P>

<A NAME="lfindex2">&nbsp;</A>
<H2>Ventanas flotantes</H2>


<P>
Estas ventanas aparecen mediante comandos del men&uacute;, o con combinacones de
teclas.

<P>
<IMG src="../../common/images/article120/image120_08.jpg" width="133" height="240">
<P>
<B>Estilo de rellenado :</B> 
Se puede rellenar una figura con un fondo uniforme, gradado (lineal o
circularmente), cruces, con una imagen (obtenida de un fichero), o no
rellenarla en absoluto.
</P>

<P>
<IMG src="../../common/images/article120/image120_09.gif" width="138" height="187">
<P>
<B>Estilo de l&iacute;neas :</B> Para elegir el color de una l&iacute;nea, su grosor, y c&oacute;mo
de puntiagudos queremos sus v&eacute;rtices y extremos.
</P>

<P>
<IMG src="../../common/images/article120/image120_10.gif" width="170" height="155">
<P> 
<B>Alinear :</B> Alinear varios objetos (seg&uacute;n los lados o el
dentro) relativamente, respecto a la p&aacute;gina, o respecto a una selecci&oacute;n.
</P>

<P>
<IMG src="../../common/images/article120/image120_11.gif" width="113" height="109">
<P>
<B>Fundir :</B> Despu&eacute;s de seleccionar dos objetos de formas y colores diferentes
y crear gradaciones entre ellos, seleccionando el n&uacute;mero de pasos intermedios.
</P>

<P>
<IMG src="../../common/images/article120/image120_12.gif" width="107" height="142">
<P>
<B>Curvas :</B> 
A&ntilde;adir un punto, borrarlo, transformar una curva en dos, cambiar la tangente ...
</P>

<P>
<IMG src="../../common/images/article120/image120_13.gif" width="340" height="223">
<P>
  <B>Selector de fuentes</B>
</P>

<P>
<IMG src="../../common/images/article120/image120_14.gif" width="199" height="89">
<P>
<B>Rejillas :</B> Modificar la rejilla.<BR>
  Puede transformarse en una rejilla a la que ajustar los elementos.
</P>

<P>
<IMG src="../../common/images/article120/image120_15.gif" width="157" height="258">
<P>
<B>Planos :</B> El uso de planos facilita la creaci&oacute;n de gr&aacute;ficos complejos,
permitiendo restringir los cambios a un soo plano, cambiar el plano de un
objeto, reordenar los planos, ...<BR>
  Las rejillas y la gu&iacute;as pueden ser controladas con esta ventana.
</P>

<P>
<img src="../../common/images/article120/image120_16.gif" width="238" height="177">
<P>
<B>Dise&ntilde;o de la p&aacute;gina</B>
</P>

<P>
<IMG src="../../common/images/article120/image120_17.gif" width="178" height="143">
<P>
<B>Pol&iacute;gonos regulares</B>
</P>

<P>
<IMG src="../../common/images/article120/image120_18.gif" width="138" height="206">
<P>
<B>Estilos :</B> Crear un estilo (colores, anchos de l&iacute;neas) y aplicarlo a
varios objetos sin tener que aplicar los cambios uno a uno con las herramientas
espec&iacute;ficas.
</P>

<P>
<img src="../../common/images/article120/image120_19.jpg" width="174" height="165">
<P>
<b>Selecci&oacute;n de colores</b>
</P>

<A NAME="lfindex3">&nbsp;</A>
<H2>El disco flexible</H2>


<P>
<IMG src="../../common/images/article120/image120_20.jpg" width="408" height="395">
<P>
Los bordes escalonados que se ven, y especialmente en las partes circulares,
son un efecto de la pantalla. Este efecto disminuye al ampliar, y desaparece
completamente al imprimir. Puedes descargar la imagen del disco flexible en
formato sketch <a href="../../common/images/article120/disquette.sk">desde
aqu&iacute;</a>, en caso necesario.
</P>

<P>
Al arrancar Sketc, crea un documento vac&iacute;o, en tama&ntilde;o A4 por defecto.<BR>
"F5" abre la paleta de planos, y para hacer aparecer la rejilla, es necesario
asegurarse de que el ojo junto a la etiqueta "Grid" est&aacute; abierto.<BR>
opens the Layer palette, and to make the grid appear you must ensure
that the eye beside "Grid" is open.<BR>
Y para modificar el espaciado de la rejilla:
</P>

<P>
<IMG src="../../common/images/article120/image120_21.gif" width="199" height="89">
</P>

<P>
<B>El cuerpo (Body)</B>

<P>
Se activa el fijado a la rejilla ("snap-to"), y se dibuja un cuadrado del
tama&ntilde;o aproximado de la p&aacute;gina con la herramienta de dibujo de rectangulos
(manteniendo presionada la tecla "ctrl" para forzar el dibujo de un cuadrado),
empezando en un punto de la rejilla, y acabando en otro.<BR>
Despu&eacute;s de ampliar la esquina superior izquierda, y usando las herramientas
de edici&oacute;n en el punto de esa esquina, se empuja hacia adentro, para redondear
todas las esquinas a la vez:
</P>

<P>
<IMG src="../../common/images/article120/image120_22.gif" width="155" height="155" hspace="10" border="1">
<IMG src="../../common/images/article120/image120_23.gif" width="155" height="155" hspace="10" border="1"> 

<P>
En esa misma esquina, a&ntilde;adimos l&iacute;neas de g&uacute;ia 5 unidades a partir de la
esquina en las direcciones vertical y horizontal (arrastrando las l&iacute;neas
respectivas):
</P>

<P>
<IMG src="../../common/images/article120/image120_24.gif" width="155" height="155" hspace="10" border="1">
<IMG src="../../common/images/article120/image120_25.gif" width="155" height="155" hspace="10" border="1">
<IMG src="../../common/images/article120/image120_26.gif" width="155" height="156" hspace="10" border="1">
<IMG src="../../common/images/article120/image120_27.gif" width="155" height="155" hspace="10" border="1">
</P>

<P>
Seguimos bloqueando el plano "Guide Lines" (con el <i>padlock</i>)<BR>
Convertimos la l&iacute;nea en una curva de B&eacute;zier, usando el men&uacute; 
Curves -> Convert to Curve<BR>
Abrimos la paleta correspondiente a Windows -> Curves Commands<BR>
Y, con la herramienta de edici&oacute;n, marcamos en una de las l&iacute;neas de gu&iacute;a o
intersecciones del rect&aacute;ngulo, con lo que aparecer&aacute; un punto. Ahora marcamos
con "Cut Curves" en la parte superior derecha de la paleta de curvas.<BR>
Y hacemos lo mismo con las otras intersecciones<BR>
Entunces usamos Curves -> Split B&eacute;ziers para separarlas en dos partes
y seleccionar (con la herramienta de selecci&oacute;n) la parte con la esquina y
borrarla.<BR>
Se pueden unir los extremos, pero en este caso no es &uacute;til.
</P>

<P>
<IMG src="../../common/images/article120/image120_28.gif" width="700" height="162" border="1">
</P>

<P>
Con la herramienta "Insert Nodes" (en el centro de la paleta de Curvas),
a&ntilde;adimos 3 puntos a la l&iacute;nea.
</P>

<P>
<IMG src="../../common/images/article120/image120_29.gif" width="699" height="163" border="1">
</P>

<P>
Y ahora, usando la herramienta de edici&oacute;n para mover esos puntos, y con la
ayuda del modo "ajustar a la rejilla", se puede f&aacute;cilmente adaptar la forma
de la l&iacute;nea a las propias necesidades.
</P>

<P>
<IMG src="../../common/images/article120/image120_30.gif" width="742" height="166" border="1">
</P>

<P>
... Y el disco flexible ya est&aacute; complatamente delineado ...
</P>

<P>
Abrimos las paletas de estilo de rellenado y estilo de l&iacute;neas<BR>
Y, con el contorno del disco seleccionado, marcamos en "None" en la paleta
de estilo de l&iacute;nea, para eliminar el grosor del contorno.
</P>

<P>
<IMG src="../../common/images/article120/image120_31.gif" width="117" height="191" hspace="10"> <IMG src="../../common/images/article120/image120_32.jpg" width="132" height="243" hspace="10">
<IMG src="../../common/images/article120/image120_33.jpg" width="210" height="67" hspace="10">
</P>

<P>
En Estilo de rellenado, marcamos la primera columna con el tercer
bot&oacute;n (gradiente) y entonces, el tercer tipo de gradiente (circular), y acto
seguido marcamos en Editar Gradiente. Tambi&eacute;n se pueden cambiar los colores
del gradiene con los dos botones situados debajo de los tipos de gradientes.
<BR>
En la caja de di&aacute;logo de Editar Gradiente se puede modificar el color de un
punto del gradiente, a&ntilde;adir un nuevo punto y, por supuesto, mover los puntos.
<BR>
Con un gradiente ciercular, se puede seleccionar el centro del gradiente usando
el rat&oacute;n.
<BR>
Una vez que el gradiente ha sido creado y selecionada la figura sobre la que
se quiere usar, marcamos en Aplicar:
</P>

<P>
<IMG src="../../common/images/article120/image120_34.jpg" width="351" height="344">
</P>

<P>
En este momento podemos bloquear el plano "Body", y crear un nuevo plano con
el icono correspondiente, abajo a la derecha en la paleta de planos.<BR>
Este nuevo plano est&aacute; destinado a contener el centro del disco flexible.<BR>
Por defecto, cada plano reci&eacute;n creado se coloca sobre los dem&aacute;s, aunque
puedes modificar el nivel de un plano con las flechas situadas en la parte
inferior de la palete de planos.
</P>

<P>
<B>El eje (axis)</B>
</P>

<P>
<IMG src="../../common/images/article120/image120_35.gif" width="150" height="150" hspace="10"> <IMG src="../../common/images/article120/image120_36.gif" width="150" height="150" hspace="10">
</P>

<P>
Dibujamos un c&iacute;rculo en el centro del disco flexible (usando la caja de
alineamiento para centrarlo y lo rellenamos de negro.
<BR>
Duplicamos el c&iacute;rculo y lo rellenamos de color gris muy suave, colocandolo
bajo el primero mediante el icono "place underneath" de la paleta de
herramientas.
<BR>
Para conseguir el efecto de iluminaci&oacute;n desde la izquierda, es necesario
desplazar el c&iacute;rculo claro hacia la derecha, deform&aacute;ndolo ligeramente
moviendo los peque&ntilde;os recuadros situados a su alrededor que se ven cuando
est&aacute; seleccionado.
</P>

<P>
<IMG src="../../common/images/article120/image120_37.jpg" width="150" height="150" hspace="10"> <IMG src="../../common/images/article120/image120_38.jpg" width="150" height="150" hspace="10">
</P>

<P>
Duplicamos nuevamente el c&iacute;rculo negro, reduci&eacute;ndolo usando el rat&oacute;n junto
con la tecla "ctrl" (para conservar su forma).
<BR>
Lo rellenamos con un gradiente lineal que vaya desde un gris claro hasta uno
m&aacute;s intenso, duplic&aacute;ndolo y coloc&aacute;ndolo por debajo, rellenado de blanco,
elongado y desplazado hacia la izquierda.
</P>

<P>
<IMG src="../../common/images/article120/image120_39.jpg" width="150" height="150" hspace="10"> <IMG src="../../common/images/article120/image120_40.jpg" width="150" height="150" hspace="10">
</P>

<P>
Para los dos peque&ntilde;os cortes usaremos rect&aacute;ngulos con las esquinas
redondeadas, seg&uacute;n el m&eacute;todo usado para el cuerpo del disco, rellenando
uno de ellos de negro, y el otro con un gradiente, a&ntilde;adiendo las  reflexiones
que le dar&aacute;n volumen.
</P>

<P>
<B>La tapa deslizante (Slider)</B>
</P>

<P>
Obviamente, crearemos un nuevo plano para esta parte ...
</P>

<P>
<IMG src="../../common/images/article120/image120_41.jpg" width="518" height="240">
</P>

<P>
La tapa met&aacute;lica consta de un rect&aacute;ngulo co los bordes redondeados tan s&oacute;lo
en su parte inferior, hecho cortando la mitad superior de la figura, tal y como
vimos anteriormente, con la herramienta "Cut curve" de la paleta de curvas.
<BR>
Para dar un efecto de metal, rellenaremos el objeto con un gradiente circular
desde gris claro a gris oscuro, desplazando el centro del gradiente hacia la
izquierda.
</P>

<P>
<IMG src="../../common/images/article120/image120_42.jpg" width="518" height="240">
</P>

<P>
Y para dibujar el corte de la tapa, debemos usar el mismo gris que usamos en
el cuerpo del disco al rellenar los rect&aacute;ngulos de esta parte.
<BR>
Y, por supuesto, duplicaremos estos elementos, coloc&aacute;ndolos bajo los originales
y rellen&aacute;ndolos de gris claro/blanco, para dar el mismo efecto de separaci&oacute;n.
</P>

<P>
<IMG src="../../common/images/article120/image120_43.jpg" width="518" height="240">
</P>

<P>
Haremos una copia de la cubierta deslizante, que transformaremos para crear
el hueco y sus efectos luminosos, dibujando la ranura mediante un rect&aacute;ngulo
negro.
</P>

<P>
<IMG src="../../common/images/article120/image120_44.jpg" width="518" height="240">
</P>

<P>
Los restantes elementos se componen de semi c&iacute;rculos, c&iacute;rculos deformados y
rect&aacute;ngulos con las esquinas redondeadas.
<BR>
Un semic&iacute;rculo es f&aacute;cil de hacer seleccinando un c&iacute;rculo en modo de edici&oacute;n
y desplazando el punto que aparece.
</P>

<P>
<B>La parte de abajo y el texto</B> 
</P>

<P>
<IMG src="../../common/images/article120/image120_45.jpg" width="515" height="283">
</P>

<P>
Usamos el mismo m&eacute;todo que para los otros elementos, rect&aacute;nculos,
c&iacute;rculos ...
<BR>
Para el texto, marcamos con la herramienta de texto el lugar donde queremos
colocarlo, y con la paleta de textos, seleccionamos la fuente, el color, etc.
La regi&oacute;n alrededor del texto es un rect&aacute;nculo con las esquinas
redondeadas.
<BR>
El texto vertical de la derecha se hizo a trav&eacute;s del men&uacute; 
edit -> create -> LCD text, en el que debemos escribir el texto, el estilo, y
despu&eacute;s aplicarlo, aunque tambi&eacute;n podemos cambiar el tama&ntilde;o, el color ...
y rotarlo 90° haciendo un doble click en el objeto, lo que hace aparecer unas
flechas que permiten llevar a cabo la rotaci&oacute;n. Para ello debemos usar las
flechas en las esquinas, puesto que las otras se usan para deformar el objeto.
</P>

<A NAME="lfindex4">&nbsp;</A>
<H2>Puesta de sol</H2>
 

<P>
<IMG src="../../common/images/article120/image120_46.jpg" width="453" height="307"> <IMG src="../../common/images/article120/image120_47.jpg" width="157" height="259" hspace="15">
<P>
Una contribuci&oacute;n de <A href="mailto:andrepascual@cludinternet.fr">André
Pascual</A>. Se ve claramente la estructura del dibujo en la ventana de Planos
[y
mucho mejor a&uacute;n si sabes que feuilles=hojas, speculaire=reflexi&oacute;n especular,
tronc=tronco, nuages=nubes, soleil=sol, ciel=cielo].
</P>

<A NAME="lfindex5">&nbsp;</A>
<H2>Efectos de volumen y fusiones</H2>
 

<IMG src="../../common/images/article120/image120_48.jpg" width="329" height="333">
<IMG src="../../common/images/article120/image120_49.jpg" width="294" height="152" hspace="20" border="1">
<P>
Este efecto se realiza con las herramientas de fusi&oacute;n (effect -> blend), en
las que se puede pensar como un gradiente para formas.
<BR>
La idea se ve claramente a la derecha, donde un cuadrado se transforma en un
c&iacute;rculo paso a paso, a la vez que cambia su color en cada paso.
</P>

<P>
<IMG src="../../common/images/article120/image120_11.gif" width="113" height="109">
</P>

<P>
Se deben seleccionar dos objetos, y con la caja de di&aacute;logo de fusiones
("blend") se elige el n&uacute;mero de pasos para la fusi&oacute;n. Cuantos m&aacute;s pasos
hagamos, m&aacute;s suave y realista ser&aacute; el efeto. Con 200 pasos, se puede crear
la apariencia de una esfera a partir de un gran c&iacute;rculo coloreado, y un
c&iacute;rculo menor situado sobre el.
<BR>
Para el ejemplo mostrado ariba, he usado 3 efectos de fundido juntos (6 objetos,
2 a 2). El fundido s&oacute;lo funciona con dos objetos, y el resultado no puede
ser combinado con ning&uacute;n otro elemento. Pero es posible modificarlo
haci&eacute;ndolo en varias partes, para cambiar los pasos del color.
</P>

<A NAME="lfindex6">&nbsp;</A>
<H2>Texto siguiendo una curva</H2>
 

<P>
<IMG src="../../common/images/article120/image120_50.jpg" width="274" height="276" border="1">
<P>
Para lograr este efecto basta con selecciona una figura y un texto, usando el
men&uacute; Effects -> create path text,<BR> el texto seguir&aacute; autom&aacute;ticamente la
curva, sin importar su forma.
</P>

<A NAME="lfindex7">&nbsp;</A>
<H2>Texto vectorizado</H2>
 

<P>
<IMG src="../../common/images/article120/image120_51.gif" width="155" height="167" hspace="10" border="1"> <IMG src="../../common/images/article120/image120_52.gif" width="155" height="170" hspace="10" border="1">
<IMG src="../../common/images/article120/image120_53.gif" width="155" height="170" hspace="10" border="1"> <IMG src="../../common/images/article120/image120_54.jpg" width="155" height="168" hspace="10" border="1">
<P>
Vectorizar texto (mostramos una &quot;y&quot; seg&uacute;n las fuentes de s&iacute;mbolos)
es transformarlo en un elemento, esto es, en una curva vectorizada, modificable
moviendo sus puntos con ayuda de la caja de di&aacute;logo "Curves".<BR>
Para ello, una vez que el texto ha sido seleccionado, hay que usar el men&uacute;
Curve -> Convert to Curves, y convertirlo en editable, desagrup&aacute;ndolo con el
men&uacute; Arrange -> Ungroup.<BR>
Esto puede ser &uacute;til si te ves obligado a proporcionar un gr&aacute;fico a alguien
que no dispone de las fuentes que has usado: se puede vectorizar el texto y
esa persona ser&aacute; capaz de usar el gr&aacute;fico sin problemas<BR>
Para poder vectorizar una fuente, Sketch debe encontrar el fichero de fuentes
correspondiente (.pfb) para lo que es necesario colocar el fichero en el
directorio <tt>/usr/lib/sketch-0.6.2/Ressources/Fontmetrics</tt>.
</P>

<A NAME="lfindex8">&nbsp;</A>
<H2>Importando y enmascarando</H2>
 

<P>
<img src="../../common/images/article120/image120_55.jpg" width="348" height="262">
<P>
Con el menu Edit -> Create -> Load image (o con el icono situado m&aacute;s a la
izquierda en el men&uacute;), es posible importar una imagen en formato bitmap,
a la que es posible redimensionar.
</P>

<P>
<IMG src="../../common/images/article120/image120_56.jpg" width="348" height="262">
<P>
Mediante el men&uacute; File -> Insert Document, se puede insertar en un gr&aacute;fico un
fichero creado con Sketch, Corel, Svg, ... o con Illustrator como en el ejemplo
que mostramos.
</P>

<P>
<IMG src="../../common/images/article120/image120_57.jpg" width="348" height="262" border="1">
<P>
El cropping se realiza con el men&uacute; 
Effects -> Create Mask Group, sobre un rect&aacute;ngulo definido en el original.
image.
</P>

<A NAME="lfindex9">&nbsp;</A>
<H2>Lo que est&aacute; por llegar</H2>


<P>
Frecuentemente se compara <i>The GIMP</i> con Photoshop (con buenos resultados),
y en ese sentido puede &uacute;til pensar en Sketch como el <i>The GIMP</i> de los
programas de dibujo vectorial, comparable a
Illustrator, Freehand, o Corel Draw... Dentro de unos l&iacute;mites.
</P>





<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Yves Ceccone <BR>LinuxFocus 1999</FONT></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="http://perso.easynet.fr/~yeccoe/linux_infographie.htm"><FONT COLOR="#FFFFFF">Yves Ceccone</FONT></a></font></td>
</tr>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>en</font></td>
    <td><font size=2><a href="mailto:pkienzle@kienzle.powernet.co.uk"><FONT COLOR="#FFFFFF">Paul Kienzle</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>1999-11-15, generated by lfparser version 0.6</font></p></BODY></HTML>
