<HTML>
<HEAD>
<TITLE>Grabadoras de CD - Como: Sistemas de ficheros</TITLE>
</HEAD>
<BODY>
<A HREF="Grabadoras-Como-4.html">Anterior</A>
<A HREF="Grabadoras-Como-6.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Sistemas de ficheros</A></H2>


<P>Este apartado est&aacute; dedicado a explicar algunas cosas para familiarizarle
con la grabaci&oacute;n de CDs, de modo que le sea mas f&aacute;cil y r&aacute;pido
elaborarlos.</P>
<P>Una breve explicaci&oacute;n sobre los sistemas de ficheros de los CD-ROMs, para
que pueda elegir cu&aacute;l es el m&aacute;s conveniente en cada momento o CD: como ya
sabr&aacute;, se sigue un est&aacute;ndar para que todos los ordenadores puedan leer los
CD-ROMs sin ning&uacute;n problema, para eso se cre&oacute; el ISO9660 que especifica el
est&aacute;ndar.</P>
<P>Pero dentro de ese est&aacute;ndar existen algunas variantes, o m&aacute;s concretamente
<I>extensiones</I>, que permiten ampliar las posibilidades originales del
<I>ISO9660</I>, como son los nombres largos o incluso sistemas de arranque y
ciertas cosas m&aacute;s. </P>

<H2><A NAME="ss5.1">5.1 Joliet y Romeo</A></H2>


<P>Estos sistemas fueron dise&ntilde;ados por Microsoft para su plataforma Windows
95/NT. Permiten sistemas de archivos tipo <I>VFAT</I> pero con la limitaci&oacute;n
de longitud a 64 caracteres, en <I>Joliet</I>, y de 128 para <I>Romeo</I>. </P>
<P>Para que Linux sea capaz de ver estos sistemas de ficheros ---por ahora
s&oacute;lo <I>Joliet</I>--- Necesita tener dicho soporte en el kernel: hasta el
kernel <CODE>2.0.34</CODE> no lo hab&iacute;a, aunque es posible tenerlo gracias a
parches para el kernel que se encuentran en Internet. Estos mismos parches
permiten ver tambi&eacute;n particiones con FAT32, el sistema de archivos que usa
la <I>OSR2</I> de Windows 95 que le posibilita tener particiones de hasta 4
TeraBytes, limitaci&oacute;n inexistente en el sistema de ficheros de Linux,
<I>ext2</I>, que desde su aparici&oacute;n soporta precisamente 4 TeraBytes ;) </P>
<P>Para los que est&eacute;n usando un kernel de la serie <CODE>2.2.x</CODE>, decirles que
tanto el soporte <I>Joliet</I> como de <I>FAT32</I> vienen «de serie», y no
tienen m&aacute;s que compilar o cargar m&oacute;dulos cuando se necesite si el kernel
no los carga autom&aacute;ticamente. </P>


<H2><A NAME="ss5.2">5.2 Rock Ridge (High Sierra)</A></H2>


<P>Esta extensi&oacute;n se ide&oacute; para la plataforma UNIX, por lo que recoge una
serie de caracter&iacute;sticas y ventajas de las que nos podemos beneficiar m&aacute;s
que con los otros.</P>
<P>La primera ventaja es la de poder tener un sistema de ficheros con
atributos propios del UNIX en &eacute;l, es decir, puede haber archivos
ejecutables, de acceso restringido a un usuario, enlaces simb&oacute;licos y
dem&aacute;s aspectos t&iacute;picos de un sistema de archivos UNIX, en el CD. Otra de
las ventajas es que podemos tener nombres de hasta 128 caracteres, a
diferencia del Joliet. </P>
<P>Por otra parte hay un sistema de compatibilidad que permite a otros
sistemas operativos ver nombres de hasta 32 caracteres; no es mucho, pero
de algo sirve. Para aquellos que no ven este sistema de ficheros tenemos
la posibilidad de crear unas tablas de transcripci&oacute;n en forma de ficheros
llamados <CODE>TRANS.TBL</CODE>, que aparecer&aacute;n en cada directorio del CD,
transcribiendo el nombre visible por el que de verdad se encuentra en &eacute;l. </P>
<P>En algunos casos puede ayudar, pero unas veces por fallo del sistema
operativo for&aacute;neo, otras por sus controladores, la transcripci&oacute;n no
funciona muy bien, llegando incluso al reseteo sin previo aviso. </P>


<H2><A NAME="ss5.3">5.3 HFS (Hierarchical Filesystem)</A></H2>


<P>No s&eacute; mucho sobre este sistema de ficheros, s&eacute; que es el que utilizan los
Macintosh y es incompatible con el de los PC, por lo menos windows no sabe
lo que es. Como es habitual Linux se adapta y por supuesto hay un parche
para el kernel para ver este tipo de sistema de ficheros y tambi&eacute;n hay un
programa para crear im&aacute;genes con este sistema de ficheros para que podamos
grabar CDs a nuestros amigos los del mac.</P>
<P>Sobre las caracter&iacute;sticas de este sistema de ficheros no puedo decir nada,
puesto que de momento no las s&eacute;. Si alguien conoce las caracter&iacute;sticas de
este sistema por favor, env&iacute;emelas a mi direcci&oacute;n de correo y amablemente
le incluir&eacute; como colaborador.</P>


<H2><A NAME="ss5.4">5.4 UDF (Universal Disk Format)</A></H2>


<P>Este es el sistema de archivos que usan los DVD y tambi&eacute;n se puede usar en
los CD-ROM normales, de hecho el Adaptec DirectCD usa este sistema de
ficheros. Las caracter&iacute;sticas son muy interesantes, hasta 256 caracteres
en ASCII y 128 en unicodes, posibilidad de grabar los discos en modo
<I>packet writing</I>, lo cual elimina la posibilidad de un <I>buffer
underrun</I> (muy com&uacute;n cuando no llegan los datos de forma constante al CD y
acabamos por tirarlo a la basura). Es el sistema de ficheros que acabar&aacute;
por estandarizarse. En Linux este sistema de ficheros aun est&aacute; algo verde,
aunque ya se ha conseguido leer discos grabados con DirectCD con ciertas
limitaciones. </P>
<P>Hasta la fecha el parche para el kernel de Linux soporta hasta la versi&oacute;n
<I>1.5</I> del sistema <I>UDF</I> .</P>
<P>Para m&aacute;s informaci&oacute;n, consulte estas p&aacute;ginas web:  <CODE>
<A HREF="http://www.osta.org">http://www.osta.org</A></CODE> para obtener
toda la informaci&oacute;n sobre el sistema UDF y <CODE>
<A HREF="http://trylinux.com/projects/udf">http://trylinux.com/projects/udf</A></CODE> desde donde podemos acceder
a los parches para que el kernel vea este sistema de ficheros y no solo
eso, tambi&eacute;n hay utilidades para crear CDs con el sistema UDF. </P>
<P>Lo que todav&iacute;a no he conseguido es copiar un sistema UDF a mi regrabable y
poder grabar en &eacute;l. Si alguien sabe c&oacute;mo hacerlo, por favor, me lo
comunique con explicaciones claras, si no es mucha molestia. </P>


<H2><A NAME="ss5.5">5.5 EXT2 (Extended Filesystem II)</A></H2>


<P>S&iacute;, en efecto, <B>no</B> se trata de un formato de ficheros t&iacute;pico de CDRoms,
lo cual no significa que no pueda hacerse.</P>
<P>Consulte la secci&oacute;n 
<A HREF="Grabadoras-Como-6.html#mke2fs">mke2fs</A>. </P>


<H2><A NAME="ss5.6">5.6 El Torito</A></H2>


<P>El nombre en castellano puede llevar a confusiones pero es el nombre que se
le ha puesto al sistema para incluir un sistema de arranque en el CD.
La explicaci&oacute;n de c&oacute;mo hacer un CD arrancable con este sistema se describe
en la secci&oacute;n del 
<A HREF="Grabadoras-Como-6.html#mkisofs">mkisofs</A></P>


<HR>
<A HREF="Grabadoras-Como-4.html">Anterior</A>
<A HREF="Grabadoras-Como-6.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc5">Indice</A>
</BODY>
</HTML>
