<HTML>
<HEAD>
<TITLE>Grabadoras de CD - Como: Grabadoras soportadas</TITLE>
</HEAD>
<BODY>
<A HREF="Grabadoras-Como-1.html">Anterior</A>
<A HREF="Grabadoras-Como-3.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="soportadas"></A> <A NAME="s2">2. Grabadoras soportadas</A></H2>


<P>Podemos dividir el soporte a una grabadora bajo LiNUX en tres aspectos:</P>
<P>
<OL>
<LI>Que Linux tenga soporte gen&eacute;rico para el bus del que <I>cuelga</I>
la grabadora.
</LI>
<LI>Que el software espec&iacute;fico de grabaci&oacute;n soporte la utilizaci&oacute;n de dicho 
bus para grabar.
</LI>
<LI>Que adem&aacute;s de lo anterior, el software espec&iacute;fico de grabaci&oacute;n
soporte la grabadora en concreto.</LI>
</OL>
</P>
<P>Respecto al punto 1, Linux soporta gen&eacute;ricamente grabadoras CD-R, CD-RW, DVD-R,
DVD-RW y DVD-RAM con interfaces:</P>
<P>
<UL>
<LI>SCSI</LI>
<LI>IDE/ATAPI</LI>
<LI>IDE/ATAPI por puerto paralelo.</LI>
</UL>
 </P>
<P>Podemos decir por tanto que, a excepci&oacute;n de las grabadoras SCSI, con las
que <B>adem&aacute;s</B> es preciso que la <B>controladora SCSI</B> est&eacute; soportada por
Linux, hoy en d&iacute;a la capacidad de utilizar una grabadora en concreto
reside enteramente en el programa utilizado para grabar.</P>
<P>En la actualidad, el &uacute;nico programa con desarrollo activo es
<CODE>cdrecord</CODE>; por lo que la cuesti&oacute;n depender&aacute; enteramente de que
<CODE>cdrecord</CODE> la soporte o no; a grosso modo, podemos afirmar que casi
todas las grabadoras est&aacute;n soportadas.</P>
<P>En <CODE>
<A HREF="http://www.guug.de:8080/cgi-bin/winni/lsc.pl">http://www.guug.de:8080/cgi-bin/winni/lsc.pl</A></CODE> Winfried
Truemper mantiene un listado de las soportadas. Si entre ellas
est&aacute; la suya, hay un 99% de posibilidades de que pueda utilizarla
bajo Linux sin problemas.</P>
<P>No obstante, la &uacute;ltima palabra la tiene siempre la documentaci&oacute;n de
<CODE>cdrecord</CODE>:  vea la secci&oacute;n 
<A HREF="Grabadoras-Como-6.html#cdrecord">cdrecord</A>.</P>
<P>Aun en el caso de que su grabadora no estuviera soportada, le quedar&iacute;a la
opci&oacute;n de crear las im&aacute;genes bajo Linux, y grabarlas bajo cualquier otro
sistema operativo. </P>

<HR>
<A HREF="Grabadoras-Como-1.html">Anterior</A>
<A HREF="Grabadoras-Como-3.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc2">Indice</A>
</BODY>
</HTML>
