<HTML>
<HEAD>
<TITLE>Grabadoras de CD - Como: Programas necesarios para grabar</TITLE>
</HEAD>
<BODY>
<A HREF="Grabadoras-Como-5.html">Anterior</A>
<A HREF="Grabadoras-Como-7.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Programas necesarios para grabar</A></H2>


<P>Casi todos los programas que aqu&iacute; vamos a mencionar pueden obtenerse de
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/">ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/</A></CODE>; no
obstante, es posible que no est&eacute;n las &uacute;ltimas versiones de desarrollo, por
ello procuro adem&aacute;s dar en la secci&oacute;n de cada uno la direcci&oacute;n origen. </P>
<P>Aqu&iacute; hago una descripci&oacute;n de los programas que vamos a necesitar para
elaborar nuestros propios CDs, con ellos haremos las im&aacute;genes y las
grabaremos; podremos comprobar la diversidad que hay y las ventajas que
nos proporcionan.</P>
<P>S&oacute;lo voy a describir las &uacute;ltimas versiones de estos programas, que aunque
en algunos casos est&aacute;n en fase alpha o de desarrollo (s&oacute;lo algunos)
funcionan perfectamente.</P>
<P>En el caso concreto de <CODE>cdrecord</CODE>, resulta imprescindible para poder
usar grabadoras IDE, IDE-ATAPI de puerto paralelo y las regrabables, al
ser el &uacute;nico que de momento las soporta. </P>

<H2><A NAME="ss6.1">6.1 Programas para creaci&oacute;n de las im&aacute;genes</A></H2>


<P>La parte m&aacute;s importante es hacer una imagen, pero ¿porqu&eacute; hay que hacer
una imagen? Muy sencillo, la imagen es el <I>molde</I> con el que se crea el
futuro CD; y no s&oacute;lo eso, la imagen nos permite comprobar que el CD va a
salir como nosotros queremos, pudiendo evitar errores y ciertas cosas m&aacute;s,
dif&iacute;cilmente detectables en el momento de la grabaci&oacute;n si la generamos al
tiempo de grabar.</P>
<P>Adem&aacute;s, podemos montar las im&aacute;genes para comprobar c&oacute;mo han quedado, como
se explica en el apartado 
<A HREF="Grabadoras-Como-3.html#otraskernel">Otras opciones del Kernel recomendables</A></P>
<P>S&iacute;, ya lo s&eacute;, en windows puedo hacer CDs <I>perfectamente</I> sin necesidad
de hacer im&aacute;genes, si contin&uacute;a leyendo, luego explico c&oacute;mo podr&aacute; hacer CDs
sin necesidad de hacer im&aacute;genes. </P>

<H3><A NAME="mkisofs"></A> <CODE>mkisofs</CODE></H3>


<P>Puede obtener este programa de <CODE>
<A HREF="ftp://tsx-11.mit.edu/pub/linux/packages/mkisofs">ftp://tsx-11.mit.edu/pub/linux/packages/mkisofs</A></CODE>. </P>
<P>La &uacute;ltima versi&oacute;n estable disponible es la <CODE>1.11</CODE> y la de desarrollo
es la <CODE>1.12b5</CODE>.</P>
<P>Este es el principal programa que usaremos para crear nuestras im&aacute;genes,
ya que est&aacute; hecho especialmente para hacer im&aacute;genes ISO9660 a las que
a&ntilde;adir extensiones Rock Ridge, o im&aacute;genes Joliet (s&oacute;lo versiones
<CODE>1.12</CODE>).</P>
<P>Puede tambi&eacute;n combinar las dos, es decir, en un solo CD tener los dos
sistemas, <I>Rock Ridge</I> y <I>Joliet</I>, de tal forma que el CD sea
portable entre los sistemas operativos que usen uno u otro, manteniendo
los nombres largos (s&oacute;lo versi&oacute;n <CODE>1.12</CODE>).</P>
<P>Esta explicaci&oacute;n est&aacute; basada en la versi&oacute;n <CODE>1.12a5</CODE>, de la cual s&oacute;lo
voy a indicar los par&aacute;metros que son m&aacute;s utilizados.</P>
<P>La sintaxis de este programa y su uso se explica a continuaci&oacute;n: </P>
<P>
<DL>

<DT><B>-a o -all-file</B><DD><P>Este par&aacute;metro indica que queremos incluir todos los
archivos que se encuentran en el directorio especificado, ya que el
programa no incluye por defecto los archivos que contengan caracteres
<CODE>~</CODE> y <CODE>#</CODE> que son generalmente copias de seguridad creados
por la mayor&iacute;a de editores *nix.</P>

<DT><B>-A o -appid</B><DD><P>Este par&aacute;metro indica un comentario sobre la aplicaci&oacute;n
a la que va dirigido el CD, puede ser definido en un archivo
<CODE>.mkisofsrc</CODE> que se puede crear en el directorio ra&iacute;z de cada usuario,
con el que poder definir por defecto varias cosas. En concreto este
par&aacute;metro se identifica como <CODE>APPI=</CODE> especificando lo que quiera poner
mientras tenga una extensi&oacute;n no superior a 128 caracteres. En versiones
anteriores a la <CODE>1.12</CODE> se debe especificar en la l&iacute;nea de comandos con
el comentario entre comillas. </P>

<DT><B>-b o -eltorito-boot</B><DD><P>Este par&aacute;metro sirve para indicarle el nombre y
la ruta del archivo que contiene la imagen de arranque que ser&aacute; usada para
hacer un CD arrancable seg&uacute;n el est&aacute;ndar <I>El Torito</I>. De esta forma
creamos un CD arrancable para aquellas BIOS que acepten arrancar desde
CD-ROM. La imagen debe tener un tama&ntilde;o de 720, 1.44 o 2.88 Mbs, la de un
diskette de arranque, que contenga por ejemplo el LILO. Ojo que esto no
funciona muy bien con CDs SCSI aunque la controladora SCSI lo soporte
te&oacute;ricamente, por culpa generalmente de la controladora, no del est&aacute;ndar.</P>

<DT><B>-c o -eltorito-catalog</B><DD><P>Con este par&aacute;metro, que est&aacute; ligado al
anterior para hacer CDs arrancable, se especifica d&oacute;nde se crear&aacute; en
el CDROM el archivo del cat&aacute;logo para el arranque del CD-ROM. Por defecto
lo crea en el directorio ra&iacute;z de la imagen</P>

<DT><B>-f o -follow-links</B><DD><P>Con este par&aacute;metro hacemos que los enlaces que se
encuentren dentro del directorio <I>maestro</I> especificado no sean tomados
como tales, sino como ficheros o directorios reales, lo cual nos permite
incluir en el CD cosas que no est&eacute;n en el mismo sistema de ficheros donde
tenemos el <I>master</I>, es decir, le especificamos que <I>siga</I> los
enlaces que contenga.</P>

<DT><B>-help</B><DD><P>Nos muestra la ayuda del programa, muy &uacute;til si no nos
acordamos de alguno de los par&aacute;metros.</P>

<DT><B>-i</B><DD><P>Sirve para a&ntilde;adir archivos que no est&eacute;n en el directorio o
subdirectorio que hayamos indicado para hacer la imagen, para su adici&oacute;n a
la imagen del CD. Esta opci&oacute;n est&aacute; temporalmente deshabilitada, y parece
ser que da problemas, por lo que est&aacute; en espera de ser reescrita. </P>

<DT><B>-J</B><DD><P>Gracias a esta opci&oacute;n podremos crear CDs con sistema de ficheros
Joliet. No incluida en versiones anteriores a la <CODE>1.12</CODE>. </P>

<DT><B>-l</B><DD><P>Gracias a este par&aacute;metro podremos establecer el modo de
compatibilidad de ficheros de 32 caracteres para aquellos sistemas que no
aceptan la longitud de los ficheros para los que est&aacute; grabado el CD. Usar
con cuidado.</P>

<DT><B>-m o -exclude</B><DD><P>Con este par&aacute;metro indicamos un patr&oacute;n de archivos que
no queramos incluir en el CD, que puedan encontrarse dentro de alg&uacute;n
subdirectorio en la ruta desde la que vamos a hacer la imagen (ficheros
<CODE>core</CODE> etc...) Se pueden usar comodines o nombre completo. </P>

<DT><B>-o o -output</B><DD><P>Con esta opci&oacute;n indicamos el nombre que le queremos dar
al fichero, incluida su ruta, que contendr&aacute; la imagen, o el fichero de
dispositivo correspondiente a la partici&oacute;n donde queremos volcarla. </P>
<P>El volcar las im&aacute;genes (s&oacute;lo de datos) a partici&oacute;n es muy recomendable
para equipos lentos; dicha partici&oacute;n no ha de tener formato alguno, por
ello la lectura es m&aacute;s r&aacute;pida, ocurre como con la partici&oacute;n de swap. </P>
<P>Si utilizamos volcado a partici&oacute;n, conviene «resetearla» antes de generar
una imagen nueva con el comando:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
dd if=/dev/zero of=/dev/sda1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Suponiendo que <CODE>sda1</CODE> sea donde queremos volcar la imagen;  <B>OJO</B>
con especificar una partici&oacute;n equivocada, o se ir&aacute; a hacer g&aacute;rgaras...</P>

<DT><B>-p o -preparer</B><DD><P>Este es complementario al par&aacute;metro <CODE>-A</CODE>, con &eacute;l
podremos indicar el autor del CD, Tiene una extensi&oacute;n m&aacute;xima de 128
caracteres.  Corresponde al par&aacute;metro <CODE>PREP=</CODE> en el archivo
<CODE>.mkisofsrc</CODE>. </P>

<DT><B>-print-size</B><DD><P>Muestra por pantalla el tama&ntilde;o estimado que ocupar&aacute; la
imagen, sin hacer nada m&aacute;s.</P>

<DT><B>-P o -publisher</B><DD><P>Especifica el editor del CD. Su longitud m&aacute;xima son
128 caracteres. En el archivo <CODE>.mkisofsrc</CODE> se identifica como
<CODE>PUBL=</CODE>. </P>

<DT><B>-quiet</B><DD><P>No muestra mensajes por pantalla.</P>

<DT><B>-R</B><DD><P>Genera un sistema de ficheros con extensiones Rock Ridge. Esta es
la opci&oacute;n principal para generarlo, manteniendo los permisos tal y como
est&eacute;n.</P>

<DT><B>-r</B><DD><P>Esta opci&oacute;n es como la anterior pero resetea los permisos de modo
que todos los usuarios puedan acceder al CD por completo. </P>

<DT><B>-T o -translation-table</B><DD><P>Con esta opci&oacute;n generamos los archivos de
transcripci&oacute;n, llamados <CODE>TRANS.TBL</CODE> en cada directorio del CD-ROM, que
contendr&aacute;n todas las transcripciones de los nombres de fichero para que se
puedan ver por ejemplo en un sistema DOS (de tipo de nombres de fichero
8+3) y con su longitud correspondiente en el sistema Rock Ridge. Cuando
utilizamos la opci&oacute;n <CODE>-l</CODE> los archivos tendr&aacute;n nombres de 32 caracteres
y no de 8+3. </P>

<DT><B>-v</B><DD><P>Nos muestra la ayuda y la versi&oacute;n del programa. Y mientras se
genera la imagen nos va mostrando el porcentaje de la imagen generada y
una estimaci&oacute;n de tiempo para terminar. Muy &uacute;til.</P>

<DT><B>-V</B><DD><P>Esta opci&oacute;n nos permite darle un nombre de volumen al CD para
identificarlo. En el archivo <CODE>.mkisofsrc</CODE> se especifica con el
par&aacute;metro <CODE>VOLI=</CODE> con una extensi&oacute;n m&aacute;xima de 32 caracteres.</P>

<DT><B>-x</B><DD><P>Esta opci&oacute;n nos permite excluir un directorio espec&iacute;fico que se
encuentre dentro de la ruta de origen. Puede excluir hasta un m&aacute;ximo de
1000 directorios, ojo que hay que especificar el par&aacute;metro antes de cada
directorio, tantas veces como directorios a excluir haya: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mkisofs ... -x estedirectoriono -x yestetampoco -x nieste
</PRE>
</CODE></BLOCKQUOTE>
</P>

</DL>
</P>
<P>Estos son los par&aacute;metros m&aacute;s utilizados, si quiere m&aacute;s informaci&oacute;n o m&aacute;s
posibilidades siempre puede consultar la p&aacute;gina del manual. Ahora unos
pocos ejemplos de c&oacute;mo funcionan algunos par&aacute;metros: </P>
<P>Para generar un sistema de ficheros Rock Ridge simplemente tenemos hacer
esto:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mkisofs -a -r -T -o /cd/imagen.iso /ficheros
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Aqu&iacute; se indica un sistema de ficheros Rock Ridge al que se le incluyen
todos los archivos que se encuentren en el directorio <CODE>/ficheros</CODE>,
generando archivos <CODE>TRANS.TBL</CODE>, para el archivo de imagen
<CODE>/cd/imagen.iso</CODE>.</P>
<P>Para que al crear la imagen se establezca el nombre de volumen, la
identificaci&oacute;n, el editor y la aplicaci&oacute;n del CD, hay dos m&eacute;todos, uno
consiste en crear un archivo llamado <CODE>.mkisofsrc</CODE> en nuestro directorio
personal.  Recuerdo que este archivo s&oacute;lo sirve para la versi&oacute;n <CODE>1.12</CODE>,
con una sintaxis como &eacute;sta:</P>
<P>
<DL>
<DT><B>VOLI=</B><DD><P>El nombre de volumen.</P>

<DT><B>PUBL=</B><DD><P>Cualquier cosa que quiera poner, normalmente un peque&ntilde;a
descripci&oacute;n del CD.</P>

<DT><B>PREP=</B><DD><P>Aqu&iacute; puede poner sus datos o cualquier cosa para identificar el
CD como suyo. </P>

<DT><B>APPI=</B><DD><P>Aqu&iacute; puede poner una descripci&oacute;n del objetivo de este CD o su
destino. </P>
</DL>
</P>
<P>O bien puede especificarlo en la l&iacute;nea de comandos as&iacute;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mkisofs -a -R -l -T -V &quot;Volumen&quot; -P &quot;descripci&oacute;n CD&quot; -p  &quot;preparador&quot; \
 -A &quot;Aplicaci&oacute;n&quot; -o imagen.iso /ficheros
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Este &uacute;nico comando se ha introducido en dos l&iacute;neas, detr&aacute;s del car&aacute;cter
<CODE>\</CODE> hay que teclear <CODE>Enter</CODE>, y teclear el resto. Se ha hecho
as&iacute; por motivos de formato de este documento.</P>
<P>En &eacute;l podemos observar, aparte de c&oacute;mo poner el nombre de volumen al CD y
otras cosas, que estamos haciendo un CD con el modo de compatibilidad para
otros sistemas de 32 caracteres, tomando los permisos y la identificaci&oacute;n
que tiene cada archivo en el disco. </P>
<P>Un ejemplo de c&oacute;mo crear un sistema de ficheros con Joliet es:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mkisofs -a -J -f -m '*.o' -m core -x /master/excluir -o /cd/imagen.iso /master
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En este sistema de ficheros Joliet hemos excluido todos los archivos que
correspondan con la descripci&oacute;n <CODE>*.o</CODE> y <CODE>core</CODE> con la opci&oacute;n
<CODE>-m</CODE>, la opci&oacute;n <CODE>-f</CODE> indica que los enlaces que se encuentren ser&aacute;n
tomados como los archivos o directorios a los que apuntan. Por &uacute;ltimo,
excluimos el directorio <CODE>excluir</CODE> que se encuentra en la ruta de origen
desde donde queremos hacer la imagen.</P>
<P>Y por &uacute;ltimo un sistema de ficheros con Rock Ridge y Joliet, que recuerdo
que s&oacute;lo se puede hacer en la versi&oacute;n <CODE>1.12</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mkisofs -a -J -f -R -m '*.o' -m core -x /master/excluir -o /cd/imagen.iso /master
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para hacer un CD arrancable (para arrancar con &eacute;l es necesario que la BIOS
soporte arranque desde unidades CD-ROM) necesitamos la imagen de un
disquete de arranque de 720KB, 1.44MB o 2.88MB, de MS-DOS o Linux seg&uacute;n
queramos, que podemos encontrar en varios sitios ya hechos o hacernos
nosotros mismos. Una vez tenemos la imagen, la ponemos dentro del
directorio en donde se encuentran los archivos desde los que vamos a hacer
la imagen y procedemos a lo siguiente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mkisofs -a -b /cdboot/eltorito.img -c /cdboot/catalogo -R -T -o imagen.iso /master
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>N&oacute;tese que a los par&aacute;metros <CODE>-b</CODE> y <CODE>-c</CODE> le especificamos lo que
parece un path absoluto, pero el directorio <CODE>/cdboot</CODE> no se
encuentra en el directorio ra&iacute;z de su disco duro, sino que en realidad es
un subdirectorio de <CODE>/master</CODE>;  esto es as&iacute; porque <CODE>mkisofs</CODE>
para este par&aacute;metro se sit&uacute;a como si estuviera ya dentro del CD.</P>

<H3><CODE>mkhfs</CODE></H3>


<P>Puede obtener este programa de <CODE>
<A HREF="ftp://ftp.ge.ucl.ac.uk/pub/mkhfs">ftp://ftp.ge.ucl.ac.uk/pub/mkhfs</A></CODE>. </P>
<P>Es su hom&oacute;logo para el sistema de ficheros de los mac, HFS, no lo he
llegado a probar todav&iacute;a pero seguro que funciona bien. Su uso es muy
sencillo y no tiene mucha complicaci&oacute;n. </P>

<H3><CODE>mkhybrid</CODE></H3>


<P>Puede obtener este programa de <CODE>
<A HREF="ftp://ftp.ge.ucl.ac.uk/pub/mkhfs">ftp://ftp.ge.ucl.ac.uk/pub/mkhfs</A></CODE>. </P>
<P>Es la mezcla de los dos anteriores, la ultima versi&oacute;n usa c&oacute;digo del
<CODE>mkisofs 1.12</CODE> para mejor soporte de Joliet. La ayuda parece
exactamente la del <CODE>mkisofs</CODE>, salvo que incluye las siguientes opciones
para a&ntilde;adir el sistema de ficheros de los mac: </P>
<P>
<DL>

<DT><B>-g o -apple</B><DD><P>A&ntilde;ade la extensi&oacute;n ISO9660 de Apple, para la
compatibilidad con el est&aacute;ndar.</P>

<DT><B>-h o -hfs</B><DD><P>Crea el sistema HFS h&iacute;brido para la extensi&oacute;n ISO9660. </P>

<DT><B>-probe</B><DD><P>Prueba todos los archivos para el sistema Unix/HFS. </P>

<DT><B>-mac-name</B><DD><P>Crea todos los nombres seg&uacute;n el estilo de los mac para
ISO9660/Joliet/Rock Ridge</P>

<DT><B>-no-mac-name</B><DD><P>Evita lo anterior para los archivos Unix/Mac</P>
</DL>
</P>

<H3><A NAME="mke2fs"></A> <CODE>mke2fs</CODE></H3>


<P>¿C&oacute;mo? ¡Pero si este programa sirve para crear sistemas de ficheros en el
formato nativo de Linux, el <CODE>ext2</CODE>!</P>
<P>Pues s&iacute;, es posible crear CD-Roms en formato <CODE>ext2</CODE>, que por supuesto
no podr&aacute;n leerse en sistemas que no dispongan de alg&uacute;n tipo de soporte
para leer este tipo de sistema de archivos, b&aacute;sicamente Linux. </P>
<P>Su utilidad depender&aacute; de la creatividad de cada uno ;)</P>
<P>Para ello, hay que seguir el siguiente procedimiento:</P>
<P>
<OL>
<LI>Primero hay que calcular el tama&ntilde;o m&aacute;ximo que podemos usar en una
imagen para aprovechar la mayor cantidad de datos en el CD es f&aacute;cil y es
una operaci&oacute;n sencilla en la que intervienen dos programas y en la que no
hay ni que sacar la calculadora.

Primero utilizamos el <CODE>cdrecord</CODE> en su versi&oacute;n de desarrollo <CODE>1.8</CODE>
de la siguiente forma: 

<BLOCKQUOTE><CODE>
<PRE>
# cdrecord -v dev=3,0 -atip
Cdrecord release 1.8a29 Copyright (C) 1995-1999 J&ouml;rg Schilling
TOC Type: 1 = CD-ROM
scsidev: '3,0'
scsibus: 0 target: 3 lun: 0
Using libscg version 'schily-0.1'
atapi: 0
Device type    : Removable CD-ROM
Version        : 2
Response Format: 2
Capabilities   :
Vendor_info    : 'YAMAHA  '
Identifikation : 'CRW4260         '
Revision       : '1.0q'
Device seems to be: Generic mmc CD-RW.
Using generic SCSI-3/mmc CD-R driver (mmc_cdr).
Driver flags   : SWABAUDIO
Drive buf size : 1176000 = 1148 KB
Current Secsize: 512
ATIP info from disk:
  Indicated writing power: 5
  Is not unrestricted
  Is not erasable
  ATIP start of lead in:  -11324 (97:31/01)
  ATIP start of lead out: 359849 (79:59/74)
Disk type: Long strategy type (Cyanine, AZO or similar)
Manuf. index: 22
Manufacturer: Ritek Co.
</PRE>
</CODE></BLOCKQUOTE>


Una vez obtenida esta informaci&oacute;n nos fijamos en la siguiente linea:

<BLOCKQUOTE><CODE>
<PRE>
  ATIP start of lead out: 359849 (79:59/74)
</PRE>
</CODE></BLOCKQUOTE>


de la que nos interesa el numero <CODE>359849</CODE> el cual al multiplicarse por
<CODE>2048</CODE> nos dar&aacute; el tama&ntilde;o m&aacute;ximo de la imagen que puede ser grabada en
el CD. Si se fijan el tama&ntilde;o concuerda con un CD 80 minutos que corresponde
exactamente a 702 MegaBytes absolutos del tama&ntilde;o de la imagen.
</LI>
<LI>Crear un fichero imagen vac&iacute;o; con los datos anteriores:

<BLOCKQUOTE><CODE>
<PRE>
dd if=/dev/zero of=imagen-vacia.ext2 bs=2048 count=359849
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Formatearlo:

<BLOCKQUOTE><CODE>
<PRE>
mke2fs -m 0 -b 2048 imagen-vacia.ext2
</PRE>
</CODE></BLOCKQUOTE>


<CODE>mke2fs</CODE> advertir&aacute; de que <CODE>imagen-vacia.ext2</CODE> no es un fichero de
dispositivo de bloque, y le pedir&aacute; confirmaci&oacute;n:

<BLOCKQUOTE><CODE>
<PRE>
imagen-vacia.ext2 is not a block special device.
Proceed anyway? (y,n) y
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Montarlo, mediante <CODE>loopback</CODE>, en lo que va a ser nuestro
directorio «maestro»: 

<BLOCKQUOTE><CODE>
<PRE>
mount -o loop imagen-vacia.ext2 /mnt/master
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Copiamos a &eacute;l los ficheros que queramos, si por ejemplo queremos
hacer una r&eacute;plica de <CODE>/etc</CODE> : 

<BLOCKQUOTE><CODE>
<PRE>
cd /etc
find | cpio -pdamvu /mnt/master
</PRE>
</CODE></BLOCKQUOTE>
 
</LI>
<LI>Lo desmontamos, y grabamos normalmente.</LI>
</OL>
</P>
<P>Si queremos montar un CD-Rom de este tipo, habr&aacute; que especificarle a
<CODE>mount</CODE> que el tipo de sistema de ficheros es <CODE>ext2</CODE>, y de s&oacute;lo
lectura:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mount -t ext2 -o ro /dev/cdrom /mnt/cdrom
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>si queremos incluirlo en <CODE>/etc/fstab</CODE>, habr&aacute; que indicar adem&aacute;s de
su tipo de sistema de ficheros, y de ser s&oacute;lo lectura, que no sea
comprobado:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/dev/cdrom      /mnt/cdrom      ext2    defaults,ro     0 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El &uacute;ltimo <CODE>0</CODE> es el que hace que <CODE>fsck</CODE> no lo compruebe en cada
arranque.</P>


<H2><A NAME="audio"></A> <A NAME="ss6.2">6.2 Software de extracci&oacute;n de audio </A></H2>


<P><B>Aviso</B>: La mayor&iacute;a de las grabadoras requieren que el orden de palabra
de los ficheros de audio en formato CDDA o PCM raw sea <I>Big Endian</I>,
salvo las Yamaha, Sony y recientemente las &uacute;ltimas grabadoras que cumplen
el est&aacute;ndar <I>SCSI-3/MMC</I>, que lo necesitan <I>Little Endian</I>.</P>
<P>Casi todos los programas extractores de CD-Audio extraen por defecto en
<I>Big Endian</I>. </P>
<P>Si graba ficheros de audio con el orden de palabra equivocado para su
grabadora, cuando intente escuchar ese CD no oir&aacute; m&aacute;s que un horripilante
ruido, similar al sonido de una televisi&oacute;n sin sintonizar.</P>
<P>Dependiendo del software que utilice para grabar, esto se puede abordar de
dos maneras: </P>
<P>
<UL>
<LI><CODE>cdrecord</CODE>: Indistintamente de la grabadora que tenga, y del
software de extracci&oacute;n que use, extraiga <B>siempre</B> en <I>Big Endian</I>,
el formato por defecto. 

<CODE>cdrecord</CODE> sabe qu&eacute; formato necesita cada grabadora, e invertir&aacute; el
orden de palabra si es necesario;  notar&aacute; si lo invierte porque aparecer&aacute;
la palabra <CODE>swab</CODE> en el listado de pistas de audio a grabar. 
</LI>
<LI><CODE>cdwrite</CODE>: Aqu&iacute; no hay error posible, ha de saber qu&eacute; orden
necesita su grabadora, y tener los ficheros CDDA con el orden apropiado. </LI>
</UL>
</P>
<P>Otro concepto, que aunque es mencionado m&aacute;s veces posteriormente a lo
largo del documento, quiero recalcar, y que necesitar&aacute; especialmente con
los extractores, es el del dispositivo gen&eacute;rico SCSI, que es explicado en
la secci&oacute;n 
<A HREF="Grabadoras-Como-4.html#gener">Dispositivos gen&eacute;ricos</A>.</P>

<H3><CODE>readcdda</CODE></H3>


<P>Este programa es un poco dif&iacute;cil de encontrar, ya que las versiones
disponibles son modificaciones o <I>portings</I> del original a Linux.</P>
<P>Uno de los paquetes que lo trae modificado es el X-CDRoast, que es de
donde lo he obtenido, ver secci&oacute;n 
<A HREF="#xcdroast">X-CD-Roast</A>.</P>
<P>No hay p&aacute;gina man disponible, y tampoco certifico que los comandos que
aqu&iacute; explico correspondan a la versi&oacute;n que Vd. pueda conseguir; no
obstante lo expongo aqu&iacute; por su excepcional calidad y fiabilidad. Eso s&iacute;,
s&oacute;lo funciona con dispositivos SCSI. </P>
<P>Su sintaxis es un poco pesada, pero como dec&iacute;a antes, vale la pena. </P>
<P>El orden de palabra de los ficheros cdda creados con <CODE>readcdda</CODE> es
<I>Big Endian</I> por defecto.</P>
<P>
<DL>

<DT><B>-D dispositivo</B><DD><P>Para especificar el dispositivo gen&eacute;rico de la unidad
con la que vamos a extraer. </P>

<DT><B>-B dispositivo</B><DD><P>Dispositivo de bloque de la unidad con la que vamos a
extraer, son v&aacute;lidos tanto dispositivos <CODE>/dev/srX</CODE> como
<CODE>/dev/scdX</CODE>.</P>

<DT><B>-t</B><DD><P>Desde qu&eacute; pista a extraer</P>
<DT><B>-z</B><DD><P>Hasta qu&eacute; pista extraer (inclusive)</P>
<DT><B>-o</B><DD><P>desplazamiento del principio de la pista</P>
<DT><B>-s</B><DD><P>desplazamiento del final de la pista</P>
<DT><B>-d</B><DD><P>Tiempo total de grabaci&oacute;n</P>
<DT><B>-S</B><DD><P>Velocidad de extracci&oacute;n.</P>
<DT><B>-v</B><DD><P>imprimir informaci&oacute;n sobre el CD.</P>
<DT><B>-x</B><DD><P>Formato de salida <I>Little Endian</I></P>

</DL>
</P>
<P>As&iacute; que un ejemplo, utilizando el CDROM SCSI que estuviera en el ID SCSI
<CODE>3</CODE>, que fuese el primer CDROM disponible, extrayendo de la pista
<CODE>1</CODE> a la <CODE>15</CODE>, a velocidad 6x en un solo fichero <CODE>.cdr</CODE>, ser&iacute;a: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
readcdda -D /dev/sgd -B /dev/scd0 -t 1 -z 15 -o 0 -s 0 -S 6 audio.cdr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto es un poco latoso si queremos que cada pista tenga su fichero, para
ello podemos utilizar un bucle: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
for i in 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15; do
readcdda -D /dev/sgd -B /dev/scd0 -t $i -z $i -o 0 -s 0 -S 6 audio.$i.cdr ;
done
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3><CODE>cdda2wav</CODE></H3>


<P>Este programa es m&aacute;s reciente, y permite extraer de CDROMs IDE si &eacute;stos
soportan extracci&oacute;n. Puede obtenerlo de <CODE>
<A HREF="ftp://ftp.gwdg.de/pub/linux/misc/cdda2wav/">ftp://ftp.gwdg.de/pub/linux/misc/cdda2wav/</A></CODE>. Tambi&eacute;n se puede
encontrar incluido en el mismo paquete de las &uacute;ltimas versiones de
<CODE>cdrecord</CODE>. </P>
<P>Comentar&eacute; s&oacute;lo las opciones m&aacute;s habituales:</P>
<P>
<DL>

<DT><B>-D</B><DD><P>Dispositivo gen&eacute;rico de la unidad lectora; <CODE>/dev/sgX</CODE> o 
<CODE>0,1,0</CODE> si es SCSI; si es IDE, con el fichero de dispositivo de bloque
correspondiente: <CODE>/dev/hdb</CODE> por ejemplo para un CD esclavo del bus
primario, o el enlace simb&oacute;lico que apunte al apropiado. </P>

<DT><B>-A</B><DD><P>Dispositivo auxiliar: ser&aacute; un <CODE>/dev/scdX</CODE> si el lector es
SCSI o el mismo que le especificamos en <CODE>-D</CODE> si es IDE. </P>

<DT><B>-I</B><DD><P>Tipo de interfaz; <CODE>generic_scsi</CODE> para dispositivos SCSI o 
<CODE>cooked_ioctl</CODE> para IDE.</P>

<DT><B>-x</B><DD><P>Extracci&oacute;n a calidad CD: muestreo a 44100Hz, 16 bits est&eacute;reo. Esta
es la opci&oacute;n por defecto, asi que si quiere estas opciones no tendr&aacute; que
volver a ponerlas.</P>

<DT><B>-t primera+ultima</B><DD><P>Especificamos la pista o rango de pistas a
extraer.</P>

<DT><B>-O</B><DD><P>Formato del fichero de salida, opciones validas &uacute;tiles pueden ser
<CODE>raw</CODE> para formato cdr (CDDA)  o <CODE>wav</CODE>.</P>

<DT><B>-E</B><DD><P>Orden de la palabra binaria: <CODE>big</CODE> para <I>Big Endian</I>,
<CODE>little</CODE> para <I>Little Endian</I>.</P>

<DT><B>-B</B><DD><P>Extraer cada pista a un fichero separado.</P>

<DT><B>-S n&uacute;mero</B><DD><P>Velocidad de extracci&oacute;n.</P>

<DT><B>-P</B><DD><P>Desactivar overlap (utilizar si se obtienen mensajes de error
tipo <CODE>increase overlap (X) or decrease SYNC_SIZE (X)</CODE>.</P>

<DT><B>-H</B><DD><P>No crear ficheros informativos (<CODE>.inf</CODE>) por cada fichero de
audio creado.</P>

<DT><B>-e</B><DD><P>Permite la salida directa al dispositivo de audio del ordenador.
Por defecto <I>/dev/dsp</I>.</P>

<DT><B>-K dispositivo</B><DD><P>Cambia el dispositivo de audio por defecto
<I>/dev/dsp</I> por que se le especifique.</P>

<DT><B>-q</B><DD><P>No muesta informaci&oacute;n alguna mientras se realiza el proceso de
extracci&oacute;n.</P>
</DL>
</P>
<P>Supongamos que usamos un lector SCSI, que tiene el ID 2 del bus SCSI, que
queremos extraer las pistas de la 3 a la 8, en formato CDDA, <I>Big
Endian</I> (por defecto), en ficheros con el patr&oacute;n <CODE>audio_*.cdr</CODE>
separados, con sus correspondientes ficheros informativos:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdda2wav -D /dev/sgb -A /dev/scd0 -I generic_scsi -x -t 3+8 -B -O cdr -S 10 audio
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>tambien se puede escribir de forma m&aacute;s abreviada de la siguiente forma:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdda2wav -D 0,2,0 -I generic_scsi -x -t 3+8 -B -O cdr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si extraemos las pistas con la opci&oacute;n <CODE>-O wav</CODE> por defecto ser&aacute;n
<I>Little Endian</I>.</P>
<P>En la versi&oacute;n <CODE>1.0</CODE> de <I>cdda2wav</I> y en adelante para extraer las
pistas de audio directamente, aunque hayan otros tipos de pistas en el
disco, como por ejemplo una de datos al principio o al final, se ha de
poner tan s&oacute;lo esto:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdda2wav -D 0,2,0 -I generic_scsi -B
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>al mismo tiempo, esto nos puede servir de ejemplo de como se pueden
extraer pistas para la secci&oacute;n 
<A HREF="Grabadoras-Como-7.html#cdrecorddao">DAO con cdrecord</A>.</P>
<P>Existe una variante del <CODE>cdda2wav</CODE>, llamada <CODE>cdparanoia</CODE>, de
rendimiento much&iacute;simo menor, pero que como su nombre indica, es muy
<I>paranoica</I> con la calidad de las pistas extra&iacute;das, puede resultar &uacute;til
con CDs muy estropeados. </P>


<H2><A NAME="ss6.3">6.3 Software de grabaci&oacute;n</A></H2>



<H3><A NAME="cdrecord"></A> <CODE>cdrecord</CODE></H3>


<P>La p&aacute;gina principal de <CODE>cdrecord</CODE> es <BR>  <CODE>
<A HREF="http://www.fokus.gmd.de/research/cc/glone/employees/joerg.schilling/private/cdrecord.html">http://www.fokus.gmd.de/research/cc/glone/employees/joerg.schilling/private/cdrecord.html</A></CODE></P>
<P>Puede obtenerlo por FTP de <CODE>
<A HREF="ftp://ftp.fokus.gmd.de/pub/unix/cdrecord/">ftp://ftp.fokus.gmd.de/pub/unix/cdrecord/</A></CODE>. </P>
<P>Este programa es m&aacute;s avanzado y actual que <CODE>cdwrite</CODE>, al estar en
desarrollo e incorporar soporte para las novedades del mercado actual, a
pesar de no soportar algunas unidades antiguas que s&iacute; lo hace
<CODE>cdwrite</CODE>.</P>
<P>La mayor ventaja de este programa es que funciona perfectamente con las
grabadoras IDE (con emulaci&oacute;n SCSI activada, por supuesto) y SCSI,
incluyendo m&aacute;s opciones como el soporte para regrabables y sus comandos
espec&iacute;ficos, como borrar un CD-RW, una partici&oacute;n, etc.</P>
<P>Permite visualizar las tablas de contenido (<I>TOC</I>, <I>Table Of
Contents</I>), que es donde se almacena la informaci&oacute;n sobre las pistas y el
tama&ntilde;o de las mismas.</P>
<P>Esta tabla la genera el programa y se tiene que grabar para que se pueda
leer el CD, ya sea cuando haga un CD multisesi&oacute;n o al hacer un CD normal o
de CD-Audio.</P>
<P>Tambi&eacute;n puede grabar pistas CDI, en modo normal de datos <I>data 1</I> y
<I>data 2</I>, <I>multisesi&oacute;n xa1</I> y <I>xa2</I> de datos, y audio. </P>
<P>Otra funci&oacute;n muy &uacute;til es que puede realizar ciertas pruebas a la unidad
para comprobar sus capacidades y compatibilidad, etc.</P>
<P>Los comandos que m&aacute;s nos pueden interesar se detallan a continuaci&oacute;n:</P>
<P>
<DL>

<DT><B>-version</B><DD><P>Muestra la versi&oacute;n del programa. Recomendada la versi&oacute;n
<CODE>1.6.1 final</CODE>, las que llevan <CODE>a</CODE> despues del n&uacute;mero son alphas y no
es recomendable usarlas. Para unidades tanto IDE como SCSI se recomienda la
<CODE>1.8aXX</CODE>.</P>

<DT><B>-v</B><DD><P>Muestra informaci&oacute;n mientras se ejecuta el programa para conocer
el estado de la grabaci&oacute;n (Muy recomendable ya que indica los Mb grabados
y el porcentaje de llenado del buffer). </P>

<DT><B>-V</B><DD><P>Muestra los comandos SCSI mientras se ejecuta el programa. </P>

<DT><B>-debug</B><DD><P>Muestra mensajes para encontrar posibles fallos.</P>

<DT><B>dev=destino</B><DD><P>Especifica la situaci&oacute;n de la grabadora en el sistema
SCSI. Hay que especificarle el bus scsi, el ID SCSI del dispositivo, y el
<I>LUN</I> SCSI (<I>Logical Unit Number</I>, valor variable s&oacute;lo si se emplea
por ejemplo un lector m&uacute;ltiple de CDs, en donde <CODE>0</CODE> identificar&iacute;a a la
primera bandeja, <CODE>1</CODE> a la segunda, etc).</P>
<P>Un ejemplo frecuente ser&iacute;a <CODE>0,4,0</CODE> para el primer bus SCSI, el ID SCSI
<CODE>4</CODE> y el LUN de todo dispositivo no m&uacute;ltiple, <CODE>0</CODE>.  Si usamos la
emulaci&oacute;n SCSI o una unidad de puerto paralelo, siempre ser&aacute; <CODE>0,0,0</CODE>.</P>

<DT><B>-dummy</B><DD><P>Con este par&aacute;metro indicamos que vamos a hacer un test de la
unidad y del sistema, simulando una grabaci&oacute;n para comprobar si se realiza
adecuadamente. Durante este test el l&aacute;ser de la grabadora est&aacute; desactivado
por lo que no correremos el riesgo de perder un CD.</P>

<DT><B>-multi</B><DD><P>Esta opci&oacute;n es para indicar que vamos a hacer un CD
multisesi&oacute;n, es decir con varias pistas de datos. Este par&aacute;metro no puede
ser usado en unidades Sony ya que no llevan soporte hardware para CD-ROM
modo <I>XA 2</I> por lo que se deber&aacute; de usar el par&aacute;metro <CODE>-data</CODE> para
este fin.</P>

<DT><B>-msinfo</B><DD><P>Esta opci&oacute;n nos permite ver la informaci&oacute;n que hay grabada
en un CD multisesi&oacute;n o con al menos una pista, mientras el CD no se haya
cerrado. </P>

<DT><B>-toc</B><DD><P>Muestra informaci&oacute;n sobre la tabla de contenidos del CD, este
par&aacute;metro puede ser usado tanto en las grabadoras como en los lectores.</P>

<DT><B>-fix</B><DD><P>Esta opci&oacute;n es para cerrar un CD que no se haya cerrado antes,
si despu&eacute;s de haber grabado los datos no se ha escrito la tabla de
contenidos. De momento esto no funciona con las unidades TEAC.</P>

<DT><B>-nofix</B><DD><P>Esta opci&oacute;n, usada en la l&iacute;nea de comandos es para que al
grabar un CD no se escriba la tabla de contenidos, para que no lo
<I>cierre</I>. Puede ser &uacute;til para grabar un CD por pasos o para grabar un
CD-Audio ya que hay lectores de CD-Audio que pueden leer CDs sin cerrar,
siempre y cuando no contengan adem&aacute;s datos. Los CDs de datos sin cerrar no
pueden ser usados por unidades lectoras. </P>

<DT><B>-load</B><DD><P>Esta opci&oacute;n es para cerrar la bandeja, luego sale del
programa. </P>

<DT><B>-eject</B><DD><P>Esta opci&oacute;n permite expulsar el CD una vez grabado, hay
unidades como las Philips o las Yamaha que deben hacer esto. </P>

<DT><B>speed=X</B><DD><P>Esta opci&oacute;n es para indicarle a la unidad la velocidad a la
que debe grabar. El n&uacute;mero especifica el multiplicador de 150Kb/s para
datos y 172Kb/s para audio. </P>

<DT><B>blank=opcion</B><DD><P>Esta opci&oacute;n borra un CD-RW y sale, o bien borra antes
de continuar con una grabaci&oacute;n. S&oacute;lo puede ser usada por unidades
regrabables y con discos CD-RW. Las opciones se describen a continuaci&oacute;n:</P>
<P>
<UL>
<LI><CODE>help</CODE> Muestra la ayuda.</LI>
<LI><CODE>all</CODE> Borra totalmente un disco. Esta opci&oacute;n tarda bastante tiempo.</LI>
<LI><CODE>disc</CODE> o <CODE>disk</CODE> Borra un disco totalmente.</LI>
<LI><CODE>fast</CODE> o <CODE>minimal</CODE> Borrado r&aacute;pido del disco: Solo borra el TOC,
los pregaps y el PMA.</LI>
<LI><CODE>track</CODE> Borra una sola pista.</LI>
<LI><CODE>unreserve</CODE> Activa una pista reservada.</LI>
<LI><CODE>trtail</CODE> Borra la cola de una pista.</LI>
<LI><CODE>unclose</CODE> Abre una pista cerrada.</LI>
<LI><CODE>session</CODE> Borra la ultima sesi&oacute;n.</LI>
</UL>
</P>

<DT><B>fs=</B><DD><P>Esta opci&oacute;n especifica el buffer fifo para almacenamiento
intermedio de los datos, a fin de hacerlos llegar a la grabadora sin
retraso.  Para facilitar las cosas puede especificar este buffer con un
n&uacute;mero seguido de <CODE>b</CODE> para indicarle bytes, <CODE>k</CODE> para kilobytes,
<CODE>m</CODE> para megabytes. </P>
<P>Por defecto tiene un buffer de 4 Mb. La recomendaci&oacute;n para el tama&ntilde;o del
buffer es de entre 4 y 32 Megas, debiendo ser como m&iacute;nimo igual al tama&ntilde;o
de buffer interno de la grabadora y como m&aacute;ximo no superior a la mitad de
la RAM f&iacute;sica del ordenador. </P>
<P>Lo normal es que no necesite poner m&aacute;s de 8 MB que es lo que yo
recomiendo. Si a&uacute;n as&iacute; aparecen mensajes como <CODE>fifo empty count</CODE>, tiene
problemas de configuraci&oacute;n o hardware. Ej: <CODE>fs=8m</CODE>. </P>

<DT><B>driver=</B><DD><P>Esta opci&oacute;n es para especificarle un driver concreto; para
ver la lista de todos los drivers simplemente especifique
<CODE>driver=help</CODE>. Si no se indica opci&oacute;n, <CODE>cdrecord</CODE> tratar&aacute; de
encontrar el driver m&aacute;s apropiado para la unidad. Si no lo consigue,
tendr&aacute; que indic&aacute;rselo; sepa que si el driver no es absolutamente
compatible corre un riesgo muy grande de perder el CD.</P>

<DT><B>-checkdrive</B><DD><P>Esta opci&oacute;n busca el driver que corresponda a su unidad
y termina la ejecuci&oacute;n.</P>

<DT><B>-prcap</B><DD><P>Esta opci&oacute;n imprime las posibilidades de las unidades que
cumplan el est&aacute;ndar <I>SCSI-3/mmc</I> y sale. </P>

<DT><B>-inq</B><DD><P>Esta opci&oacute;n hace un examen de la unidad, imprime los resultados
en pantalla y sale. </P>

<DT><B>-scanbus</B><DD><P>Esta opci&oacute;n examina el bus SCSI en busca de unidades. Sirve
para buscar nuestra unidad.</P>

<DT><B>-reset</B><DD><P>Esta opci&oacute;n resetea el bus SCSI donde se est&eacute; nuestra
grabadora. </P>

<DT><B>-audio</B><DD><P>Detr&aacute;s de esta opci&oacute;n se indican los nombres de los archivos
de sonido que ser&aacute;n grabados como pistas de audio, siempre y cuando los
archivos tengan una calidad de muestreo 44.100 Khz a 16 Bits, est&eacute;reo en
alguna variante PCM; si no son as&iacute;, ser&aacute;n rechazados por <CODE>cdrecord</CODE>.
Acepta formato CDDA (tanto <CODE>.cdda</CODE> como <CODE>.cdr</CODE> son extensiones
v&aacute;lidas), <CODE>.wav</CODE>, <CODE>.au</CODE> y <CODE>.raw</CODE>. </P>
<P><CODE>cdrecord</CODE>, si no se le especifica lo contrario, asume que el orden de
palabra es <I>Big Endian</I>, y convertir&aacute; autom&aacute;ticamente a <I>Little
Endian</I> si detecta que la grabadora lo necesita. </P>

<DT><B>-data</B><DD><P>Tras de esta opci&oacute;n se indica el nombre del archivo que
corresponde a la imagen ISO9660 que anteriormente hemos creado con
<CODE>mkisofs</CODE> u otro de los anteriormente descritos. Esta opci&oacute;n viene por
defecto, lo que quiere decir que si no la indicamos grabaremos de esta
forma.</P>

<DT><B>-mode2</B><DD><P>Si esta opci&oacute;n esta presente, todas las pistas de datos que
la sigan se grabar&aacute;n en modo 2. </P>

<DT><B>-xa1</B><DD><P>Si esta opci&oacute;n esta presente, todas las pistas que la sigan se
grabar&aacute;n en modo XA 1. </P>

<DT><B>-xa2</B><DD><P>Si esta opci&oacute;n esta presente, todas las pistas que la sigan se
grabaran en modo XA 2. </P>

<DT><B>-cdi</B><DD><P>Si esta opci&oacute;n esta presente, todas las pistas que la sigan se
grabaran en CDI. </P>

</DL>
</P>
<P>Estos son los comandos que m&aacute;s se usan, para ampliar informaci&oacute;n puede
acudir al manual. Ahora unos ejemplos para que la cosa quede mas clara: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrecord -scanbus
cdrecord dev=0,0,0 -checkdrive
cdrecord dev=0,0,0 -prcap
cdrecord dev=0,0,0 -inq
cdrecord dev=0,0,0 -toc
cdrecord dev=0,0,0 -msinfo
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>As&iacute; se realizan los test; en el primero se escanea el bus SCSI para ver
nuestra unidad, en los dem&aacute;s se toma que tenemos la unidad en el
dispositivo que corresponde al bus 0, id 0 y lun 0 para hacerle los test a
los que corresponde la explicaci&oacute;n anterior. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrecord dev=0,0,0 fs=8m speed=2 -nofix -eject -xa1 imagen.iso -audio audio1.wav audio2.cdda audio3.au
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Aqu&iacute; podemos ver que le hemos puesto 8 Mb al buffer fifo, especificado que
grabe a doble velocidad, que expulse el CD una vez terminado, que la
primera pista es una imagen de datos en formato multisesi&oacute;n XA 1 y las
siguientes pistas ser&aacute;n de audio (este programa puede grabar varios
formatos de audio como el <CODE>.wav</CODE> de Microsoft, el <CODE>.cdda</CODE>, el PCM en
bruto o <CODE>.raw</CODE> y el <CODE>.au</CODE> siempre y cuando tengan una calidad de
muestreo de 44100 Hz a 16 bits, en est&eacute;reo). Y al final no ser&aacute; escrita la
TOC por lo que para hacerlo tenemos la siguiente l&iacute;nea: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrecord dev=0,0,0 -fix
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para grabar una sola pista de datos podemos usar esto:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrecord dev=0,0,0 fs=8m speed=2 -eject imagen.iso
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ya que como se dijo antes no hac&iacute;a falta especificar el par&aacute;metro
<CODE>-data</CODE>, que es el asumido por defecto.</P>
<P>Las nuevas opciones que incluye el 
<A HREF="Grabadoras-Como-7.html#cdrecorddao">cdrecord 1.8</A>
se describen en su secci&oacute;n.</P>

<H3>Par&aacute;metros configurables permanentemente de <B><CODE>cdrecord</CODE></B></H3>


<P>Como puede observar, es un poco <I>latoso</I> el tener que especificar datos
no cambiantes una y otra vez, como por ejemplo d&oacute;nde se encuentra la
grabadora, o la velocidad de grabaci&oacute;n ya que generalmente grabar&aacute; casi
siempre al m&aacute;ximo de velocidad.</P>
<P>Para no tener que especificarlo siempre en la l&iacute;nea de comandos,
<CODE>cdrecord</CODE> provee la posibilidad de establecer dichos par&aacute;metros por
defecto, mediante las variables de entorno <CODE>CDR_DEVICE</CODE>, <CODE>CDR_SPEED</CODE>
y <CODE>CDR_FIFOSIZE</CODE>.</P>
<P>Supongamos que su grabadora est&aacute; en el primer bus SCSI, y tiene el ID 4. 
(El LUN siempre va a ser 0). Y que quiere que la velocidad de grabaci&oacute;n
por defecto, a menos de que se especifique lo contrario mediante
par&aacute;metros de la l&iacute;nea de comandos, va a ser a doble velocidad (2x) y
el <I>buffer</I> de datos FIFO sea de 16 megabytes. </P>
<P>Establecer&iacute;amos dichas variables de entorno mediante la inserci&oacute;n,
generalmente en el fichero <CODE>/etc/profile</CODE>, de las siguientes
l&iacute;neas, suponiendo que utilice <CODE>bash</CODE> como int&eacute;rprete de comandos: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
CDR_SPEED=2
CDR_DEVICE=0,4,0
CDR_FIFOSIZE=16m
export CDR_SPEED CDR_DEVICE CDR_FIFOSIZE
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Dichas variables no estar&aacute;n disponibles hasta que el sistema relea el
fichero <CODE>/etc/profile</CODE>, lo mejor es reiniciar el terminal con un
<I>logout</I> o bien recargando el archivo con <I>source /etc/profile</I>.
Si esto no funciona, reinicie el sistema para salir de dudas.</P>

<H3>Grabacion sin imagen</H3>


<P>Ahora viene algo que puede interesar a m&aacute;s de uno, hacer un CD
directamente desde el disco sin necesidad de hacer una imagen previa. </P>
<P>He de advertir sobre este procedimiento y es que no se debe, por ninguna
circunstancia, acceder al disco que contenga el directorio maestro con los
ficheros a partir de los que se est&aacute; generando una imagen directa al CD,
ya que cualquier m&iacute;nimo retraso en la transferencia de datos puede
ocasionar que no se grabe el CD correctamente a pesar de que durante la
grabaci&oacute;n no aparezcan errores. </P>
<P>El problema de que no se genere correctamente la imagen puede no radicar
necesariamente en que su disco duro sea lento, hay otros factores como la
memoria disponible: tenga en cuenta que por ejemplo <CODE>mkisofs</CODE> necesita
al menos 12MB de memoria para generar las extensiones Rock Ridge. </P>
<P>Repito, no acceda al disco duro maestro durante la grabaci&oacute;n, peligro de
hacer un CD desde el que no se pueda leer ning&uacute;n dato sano, aunque
aparentemente se haya grabado bien; esto se puede comprobar editando un
archivo de texto y viendo como parte del archivo anterior o los gaps se
han introducido en ellos. </P>
<P>As&iacute; mismo recomiendo realizar esta operaci&oacute;n s&oacute;lo con versiones de
<CODE>cdrecord</CODE> superiores o iguales a la <CODE>1.6.1</CODE>, y <CODE>1.12b5</CODE> de
<CODE>mkisofs</CODE> , ya que he comprobado que funcionan y se entienden mucho
mejor, con mucho menor peligro de realizar CDs corruptos.</P>
<P>Antes de grabar el CD debe realizar primero la siguiente
operaci&oacute;n:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mkisofs -r -T -l -print-size -f /files
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>la cual nos facilitar&aacute; un n&uacute;mero, este n&uacute;mero se lo deberemos de pasar en
un par&aacute;metro al <CODE>cdrecord</CODE> para que nos reconozca el tama&ntilde;o de la
imagen a grabar, ya que si no, <CODE>cdrecord</CODE> no tiene forma de saber cu&aacute;l
es el tama&ntilde;o de la imagen. De esta forma, si por ejemplo, <CODE>mkisofs</CODE> nos
mostrar&aacute; la siguiente l&iacute;nea:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Total extents scheduled to be written = 290699
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para que <CODE>cdrecord</CODE> reconozca el tama&ntilde;o
de la imagen a grabar:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
nice --20 mkisofs -r -T -l -f /files | nice --20 cdrecord fs=16m \
tsize=290699*2048 -eject -
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>O bien para multisesi&oacute;n:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
nice --20 mkisofs -r -T -l -f /files | nice --20 cdrecord fs=16m \
tsize=290699*2048 -eject -multi - -audio audio1.wav audio2.wav audio3.au
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>N&oacute;tese que no especificamos ni la localizaci&oacute;n SCSI de la grabadora, ni la
velocidad de grabaci&oacute;n, ya que la hemos establecido con las variables de
entorno mencionadas anteriormente. </P>
<P>Seguramente se preguntar&aacute; el porqu&eacute; del <CODE>nice --20</CODE> que hay delante de
cada uno de los programas. El comando <CODE>nice</CODE> sirve para asignar la
prioridad de ejecuci&oacute;n, y en este caso concreto establecemos la m&aacute;xima
posible. </P>
<P>Se preguntar&aacute; por qu&eacute; en la opci&oacute;n <CODE>tsize</CODE> del <I>cdrecord</I> multiplico
por <CODE>2048</CODE> la cantidad dada por el <I>mkisofs</I>. La raz&oacute;n es muy
simple, a partir de la version <CODE>1.6.1</CODE> y <CODE>1.8</CODE> de <I>cdrecord</I>, hay
que pasarle el tama&ntilde;o en bytes de la imagen, y debido a que realiza la
multiplicaci&oacute;n &eacute;l mismo, s&oacute;lo lo tenemos que multiplicar por el tama&ntilde;o de
cada sector de un CD y listo. </P>
<P>Use esto con cuidado.</P>
<P>Y para terminar voy a indicar c&oacute;mo usar el programa con las grabadoras
IDE/ATAPI y de puerto paralelo, que por ejemplo al ejecutar la siguiente
linea nos muestre algo como lo siguiente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# cdrecord -scanbus
Cdrecord release 1.6 Copyright (C) 1995-1998 J&ouml;rg Schilling
scsibus0:
                  0) 'HP      ' 'CD-Writer+ 7200 ' '3.01' Removable CD-ROM
                  1) *
                  2) *
                  3) *
                  4) *
                  5) *
                  6) *
                  7) *
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>As&iacute; es como ve <CODE>cdrecord</CODE> nuestra grabadora, ya sea interna o externa,
por lo que para indicarle c&oacute;mo acceder a nuestra grabadora tendremos que
especificar el par&aacute;metro <CODE>dev=0,0,0</CODE>. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrecord dev=0,0,0 speed=2 fs=16m -v -dummy image.raw
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Recomiendo usar la grabadora con una version de <CODE>cdrecord 1.6.1</CODE>,
aunque como se aprecia en el escaneado de muestra anterior hecho con la
versi&oacute;n <CODE>1.6</CODE>, esta &uacute;ltima es capaz de usarla. Tambi&eacute;n es muy
recomendable hacer pruebas de grabaci&oacute;n para comprobar que no haya falta
velocidad en el puerto paralelo antes de proceder a la grabaci&oacute;n final de
CD-ROMs.</P>

<H3><CODE>cdwrite</CODE></H3>


<P>Puede obtener este programa (y casi todos los relativos a creaci&oacute;n de CDs) 
de <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/">ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/</A></CODE>. </P>
<P>Este programa era el m&aacute;s utilizado hasta hace un par de a&ntilde;os mas o menos,
(y el &uacute;nico que hab&iacute;a). Est&aacute; en actual desuso, ya que ha dejado de
desarrollarse y se ha quedado algo anticuado; de todas formas funciona
perfectamente en grabadoras SCSI a excepci&oacute;n de las <I>Sony</I>.</P>
<P>Si ha comprendido los comandos del <CODE>cdrecord</CODE> no tendr&aacute; problemas en
entender los de este programa ya que no tiene muchos. Una diferencia que
s&iacute; hay entre uno y otro es que para identificar la unidad grabadora
utiliza los dispositivos <CODE>/dev/srX</CODE> y no va directamente al bus
SCSI, lo cual puede resultar mas f&aacute;cil de usar. </P>
<P>Por defecto <CODE>cdwrite</CODE> busca <CODE>/dev/cdwriter</CODE> como dispositivo por
defecto de la grabadora, por lo que si hace un enlace simb&oacute;lico del
dispositivo <CODE>/dev/sgX</CODE> a <CODE>/dev/cdwriter</CODE> con el dispositivo
de acceso gen&eacute;rico correspondiente, (vea secci&oacute;n 
<A HREF="Grabadoras-Como-4.html#gener">Dispositivos gen&eacute;ricos</A>) se ahorrar&aacute; un par&aacute;metro m&aacute;s que poner.</P>
<P><CODE>cdwrite</CODE> necesita que se le especifique el tama&ntilde;o en bytes de la
imagen que va a grabarse; para saberlo, usamos el programa <CODE>isosize</CODE>
(lo podemos encontrar dentro del paquete de distribuci&oacute;n de <CODE>cdwrite</CODE>
con otras utilidades extra que nos pueden venir muy bien); si nuestra
imagen se llama <CODE>imagen.iso</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# isosize imagen.iso
382060544
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>nos informa de que el tama&ntilde;o es <CODE>382060544</CODE>, par&aacute;metro que le
especificaremos posteriormente con <CODE>-b</CODE>. </P>
<P>podemos usarlo tambi&eacute;n con CD-Roms o particiones, si hemos generado la
imagen directa a una partici&oacute;n en lugar de a fichero: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
isosize /dev/sda1
634986355
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si hemos volcado la imagen generada por <CODE>mkisofs</CODE> en la primera
partici&oacute;n del primer disco SCSI (con la opci&oacute;n <CODE>-o /dev/sda1</CODE>). </P>
<P>Algunos ejemplos de c&oacute;mo se usa <CODE>cdwrite</CODE> son: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdwrite -ve -s 2 -b 382060544 -D /dev/sgd -data /dev/scd0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Copiar&aacute; directamente el CD que est&eacute; en el primer CD-Rom SCSI del sistema a
la grabadora, expulsar&aacute; el CD una vez listo, e ir&aacute; informando del
transcurso de la grabaci&oacute;n; <CODE>382060544</CODE> es el tama&ntilde;o del CD en
cuesti&oacute;n, que hemos averiguado previamente mediante <CODE>isosize</CODE>. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdwrite -s 2 -e -D /dev/sgd -b 382060544 -data image.iso -audio *.cdr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Grabar&aacute; un CD mixto de datos y audio, en donde el par&aacute;metro <CODE>-s</CODE> indica
la velocidad de grabaci&oacute;n (equivale al <CODE>speed=2</CODE> del <CODE>cdrecord</CODE>), el
par&aacute;metro <CODE>-e</CODE> expulsa el CD al terminar (equivalente al <CODE>-eject</CODE>),
el <CODE>-D</CODE> indica la unidad grabadora, aunque si ha hecho un link de
<CODE>/dev/sgd</CODE> (por ejemplo) a <CODE>/dev/cdwriter</CODE> no hace falta que
lo especifique; y por &uacute;ltimo igual que en el anterior est&aacute;n los par&aacute;metros
<CODE>-data</CODE> y <CODE>-audio</CODE>, estando el formato de los ficheros de sonido en
<I>Compact Disc Digital Audio</I> (extensiones <CODE>.cdda</CODE> o <CODE>.cdr</CODE>);
podemos pasarlo de otros formatos a &eacute;ste mediante el programa <CODE>sox</CODE>. </P>
<P><CODE>cdwrite</CODE> necesita que el orden de la palabra del fichero de audio sea
el apropiado para su grabadora, u obtendr&aacute; un CD en el que s&oacute;lo se escuche
un desagradable <I>ruido</I>.</P>
<P>Consulte la secci&oacute;n 
<A HREF="#audio">Software de extracci&oacute;n de audio</A>.</P>
<P>No podr&aacute; hacer CDs multisesi&oacute;n con este programa. Para hacer CDs
multisesi&oacute;n tendr&aacute; que usar las opciones que lleva el <CODE>mkisofs</CODE> para
este fin, generando una imagen multisesi&oacute;n. </P>

<H3><CODE>cdrdao</CODE></H3>


<P>Parece ser que se ha conseguido que este programa haga lo que se quer&iacute;a, copiar
CDs al vuelo, incluso los mixtos, de m&uacute;sica, y ohhhhhhh, de ¡Playstation!.  No
dej&eacute;is de ver la secci&oacute;n dedicada a este programa porque merece la pena.  </P>


<H2><A NAME="ss6.4">6.4 Entornos Integrados</A></H2>



<H3><A NAME="xcdroast"></A> X-CD-Roast </H3>


<P>Puede obtener este programa de <CODE>
<A HREF="http://www.fh-muenchen.de/rz/xcdroast/">http://www.fh-muenchen.de/rz/xcdroast/</A></CODE>. </P>
<P>Este programa es el m&aacute;s sencillo de usar ya que est&aacute; hecho para las X con
un interfaz TCL/TK y se basa en modificaciones del <CODE>cdrecord</CODE> y
<CODE>mkisofs</CODE> para su funcionamiento. En versiones anteriores utilizaba un
derivado del <CODE>cdwrite</CODE>, pero tuvo que dejarlo ya que <CODE>cdwrite</CODE> ha
dejado de desarrollarse. </P>
<P>La mayor ventaja que tiene este programa es su facilidad de uso y que
detecta y configura los dispositivos autom&aacute;ticamente, adem&aacute;s de funcionar
correctamente y sin problemas. Con &eacute;l puede configurar y hacer las
im&aacute;genes de CD f&aacute;cilmente sin necesidad de ir a la l&iacute;nea de comandos, as&iacute;
como extraer pistas de audio y volver a grabarlas gracias a sus
modificaciones del <CODE>readcdda</CODE> y <CODE>playcdda</CODE> (que s&oacute;lo se pueden usar
con dispositivos SCSI). </P>
<P>Si quiere sacar pistas de audio con un lector IDE lector ha de usar el
<CODE>cdda2wav</CODE>, aunque no todas la unidades lectoras soportan la extracci&oacute;n
de pistas CDDA o de CD-Audio. </P>
<P>Puede hacer una copia directa de CD a CD, siempre que sean s&oacute;lo de datos,
y que las dos unidades, la grabadora y la lectora, sean dispositivos SCSI,
ya que con las IDE no funciona muy bien, debido no al programa en s&iacute;, sino
mas bien por las caracter&iacute;sticas de las unidades IDE, ya que no suelen
satisfacer las capacidades de carga de las grabadoras. Aun as&iacute; he llegado
a comprobar como unidades del tipo Philips IDE de 32x en adelante
funcionaban perfectamente.</P>
<P>Lo normal es que no tenga problemas para grabar con este programa siempre
y cuando su grabadora sea SCSI, cuando sea IDE o usa la ultima versi&oacute;n
<CODE>0.96d final</CODE> o superior o no conseguir&aacute; que salga ni un solo CD bien. </P>

<H3>Burn-It</H3>


<P>Este entorno utiliza las &uacute;ltimas versiones de <CODE>cdrecord</CODE>, <CODE>mkisofs</CODE>
y <CODE>cdda2wav</CODE>, lo m&aacute;s peculiar sin duda es que esta escrito &iacute;ntegramente
en java; su desarrollo es muy r&aacute;pido.</P>
<P>Puede obtenerlo de <CODE>
<A HREF="http://www.imada.ou.dk/~jews/BurnIT/">http://www.imada.ou.dk/~jews/BurnIT/</A></CODE>. </P>

<H3>CDR</H3>


<P>CDR son las siglas de <I>Create/Duplicate/Rip</I>
(<I>Crear/Duplicar/Extraer</I>). </P>
<P>Su utilidad actualmente es m&aacute;s que nada para la preparaci&oacute;n de audio que
posteriormente va a ser grabado con <CODE>cdrecord</CODE> o <CODE>cdwrite</CODE> desde la
l&iacute;nea de comandos. Provee una interfaz tipo <I>ncurses</I>. S&oacute;lo extrae de
unidades SCSI. </P>
<P>Puede obtenerlo de <CODE>
<A HREF="http://www.burdell.org/cdr.shtml">http://www.burdell.org/cdr.shtml</A></CODE>.</P>


<H2><A NAME="ss6.5">6.5 Otros programas y utilidades</A></H2>


<P>Hay varias utilidades entre las que tengo que destacar <CODE>sdir</CODE>,
<CODE>isovfy</CODE>, <CODE>cdinfo</CODE> y <CODE>isodetect</CODE>, que son peque&ntilde;as, de consola,
pero muy &uacute;tiles a la hora de comprobar y verificar CDs. Estas peque&ntilde;as
utilidades se pueden encontrar en el FTP de sunsite <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/">ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/</A></CODE> y
otras que se pueden encontrar tanto en el paquete de X-CD-Roast (secci&oacute;n
<A HREF="#xcdroast">X-CD-Roast</A>) como en el de <CODE>cdrecord</CODE> (
<A HREF="#cdrecord">cdrecord</A>).</P>
<P>Por ejemplo, <CODE>sdir</CODE> nos puede ayudar a saber el tama&ntilde;o total de un
directorio y sus subdirectorios lo cual resulta muy &uacute;til cuando queremos
evaluar y calcular el tama&ntilde;o del CD a copiar al vuelo; <CODE>isovfy</CODE> nos
sirve para verificar que no hayan errores en una imagen creada en el disco
duro; <CODE>cdinfo</CODE> nos puede ayudar a comprobar que se han copiado bien los
CDs y no s&oacute;lo eso, este peque&ntilde;o programa muestra la estructura de un CD en
minutos y segundos, nos dice si es arrancable, los sistemas de ficheros
que contiene, si lleva pistas de audio o es un v&iacute;deo CD, etc; por &uacute;ltimo,
con <CODE>isodetect</CODE> podemos ver la etiqueta del volumen de un CD as&iacute; como
los comentarios de los mismos. </P>
<P>Descripci&oacute;n de las utilidades:</P>
<P>
<DL>
<DT><B>sdir</B><DD><P>este programa muestra la capacidad de un directorio con
sus subdirectorios. Los par&aacute;metros a pasarle son directorios. </P>

<DT><B>isodetect</B><DD><P>programa para ver el volumen, el editor, el publicador y
la aplicaci&oacute;n de una imagen. Su sintaxis es la siguiente:</P>
<P>
<UL>
<LI><CODE>-h</CODE> Muestra la ayuda.</LI>
<LI><CODE>-d</CODE> y un nombre de un archivo de imagen o de un dispositivo le
indican en d&oacute;nde realizar la b&uacute;squeda; por defecto busca en
<I>/dev/cdrom</I>. Si no se indican mas par&aacute;metros indicar&aacute; el tipo de
imagen que es, iso9660 o HFS.</LI>
<LI><CODE>-V</CODE> muestra el nombre del volumen de la imagen o CD.</LI>
<LI><CODE>-P</CODE> muestra el comentario que hay como publicador.</LI>
<LI><CODE>-p</CODE> muestra el comentario que hay como preparador.</LI>
<LI><CODE>-A</CODE> muestra el comentario que hay como aplicaci&oacute;n.</LI>
</UL>
</P>
<P>S&oacute;lo se puede indicar un comando a la vez con <CODE>-d</CODE>. Este programa se
puede encontrar en el paquete <CODE>X-CD-Roast</CODE> (secci&oacute;n 
<A HREF="#xcdroast">X-CD-Roast</A>).</P>

<DT><B>cdinfo</B><DD><P>excelente y peque&ntilde;a utilidad que nos muestra la estructura de
un CD; en lo que a pistas se refiere, identifica CDs mixtos, arrancables,
con sistema HFS, CD Plus, etc. (Altamente recomendada y muy &uacute;til). La
&uacute;ltima versi&oacute;n se puede descargar desde <CODE>
<A HREF="http://www.in-berlin.de/User/kraxel/dl/cdinfo.c">http://www.in-berlin.de/User/kraxel/dl/cdinfo.c</A></CODE></P>
<P>Desgraciadamente, parece ser que se ha abandonado su desarrollo.</P>

<DT><B>isovfy</B><DD><P>Esta peque&ntilde;a utilidad nos servir&aacute; para encontrar posibles
errores en las im&aacute;genes. Su sintaxis es muy sencilla, solamente se le ha
de indicar un dispositivo de bloque o el nombre del fichero imagen.  Este
programa viene en el paquete de <CODE>X-CD-Roast</CODE> (secci&oacute;n 
<A HREF="#xcdroast">X-CD-Roast</A>).</P>

</DL>
</P>


<HR>
<A HREF="Grabadoras-Como-5.html">Anterior</A>
<A HREF="Grabadoras-Como-7.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc6">Indice</A>
</BODY>
</HTML>
