<HTML>
<HEAD>
<TITLE>Grabadoras de CD - Como: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Grabadoras-Como-2.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>Este documento pretende guiar al usuario, de forma que sepan qu&eacute; tienen
que hacer y c&oacute;mo solucionar los posibles problemas que puedan plantearse a
lo largo del camino de la grabaci&oacute;n de CDRoms.</P>
<P>Se da una peque&ntilde;a explicaci&oacute;n sobre los sistemas de ficheros para
los CDs (todo a su tiempo) y de c&oacute;mo se usan los programas m&aacute;s utilizados
para grabar en Linux. Por supuesto, y en &uacute;ltimo lugar, la omnipresente
<I>PUF</I> (<I>Preguntas de Uso Frecuente</I>) por si se escapa algo.</P>
<P>Recomiendo leer todos los apartados, uno detr&aacute;s de otro, para ampliar
conocimientos, que resultar&aacute; beneficioso a la hora de buscar posibles
irregularidades, fallos o errores en la elaboraci&oacute;n de este documento o en
lo que se refiere a conceptos en Linux en s&iacute;.</P>
<P>Y ya por &uacute;ltimo indicar que hasta la versi&oacute;n <CODE>1</CODE> de este documento
explicaremos c&oacute;mo se graban CDs normales, pero para la siguiente versi&oacute;n,
la <CODE>2.0</CODE> intentaremos ir mas all&aacute;, a las grabadoras DVD, momento que
bajo mi punto de vista no tardar&aacute; en llegar. </P>

<H2><A NAME="Aportaciones"></A> <A NAME="ss1.1">1.1 Aportaciones</A></H2>


<P>Recuerde que este documento est&aacute; en desarrollo y cualquiera que pueda
aportar su granito de arena con sus problemas y soluciones, correcciones
(ya que seguro que me he equivocado en alg&uacute;n sitio) o adici&oacute;n de detalles;
siendo adem&aacute;s amablemente incluido como colaborador. (Ver secci&oacute;n 
<A HREF="Grabadoras-Como-9.html#creditos">Cr&eacute;ditos</A>)</P>
<P>Para hacerlo s&oacute;lo tiene que o bien utilizar el sistema en l&iacute;nea de
Insflug, <CODE>
<A HREF="http://www.insflug.org/comos/comos.php3?accion=titulo&amp;tog=com&amp;parm=Grabadoras&amp;ini=x">http://www.insflug.org/comos/comos.php3</A></CODE> de adici&oacute;n al sistema
de fe de erratas, o sugerencias, para que inmediatamente est&eacute; disponible
para todos, y enviar un mail a <CODE>
<A HREF="mailto:lord_lt@retemail.es">lord_lt@retemail.es</A></CODE></P>
<P>Animo a leer este documento con paciencia, sin reparos en participar con
correcciones o a&ntilde;adiduras al mismo, para que toda la comunidad Linux se
beneficie de &eacute;l. Las felicitaciones y enhorabuenas tambi&eacute;n son bien
recibidas ;-). </P>


<HR>
Anterior
<A HREF="Grabadoras-Como-2.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc1">Indice</A>
</BODY>
</HTML>
