<HTML>
<HEAD>
<TITLE>Grabadoras de CD - Como: Software DAO y generadores de subc&oacute;digos.</TITLE>
</HEAD>
<BODY>
<A HREF="Grabadoras-Como-6.html">Anterior</A>
<A HREF="Grabadoras-Como-8.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc7">Indice</A>
<HR>
<H2><A NAME="s7">7. Software DAO y generadores de subc&oacute;digos.</A></H2>



<H2><A NAME="cdrecorddao"></A> <A NAME="ss7.1">7.1 <CODE>cdrecord 1.8</CODE></A></H2>


<P>Puede obtener la &uacute;ltima alpha del servidor FTP <CODE>
<A HREF="ftp://ftp.fokus.gmd.de/pub/unix/cdrecord/alpha/">ftp://ftp.fokus.gmd.de/pub/unix/cdrecord/alpha/</A></CODE>. </P>
<P>Descripci&oacute;n de los nuevos comandos para la nueva versi&oacute;n:</P>
<P>
<DL>
<DT><B>-useinfo</B><DD><P>Utiliza los archivos de extensi&oacute;n .inf sobreescribiendo las
opciones por defecto.</P>

<DT><B>-atip</B><DD><P>Muestra la informaci&oacute;n referente al CD y sale. Esta
informaci&oacute;n tambien la ofrecia la version anterior pero s&oacute;lo cuando se
disponia a grabar. </P>

<DT><B>-dao</B><DD><P>Graba el medio en Disc-At-Once.</P>
</DL>
</P>
<P>Ejemplo de como se usa la opci&oacute;n <CODE>-atip</CODE> se tiene en la secci&oacute;n referente
a crear un sistema <I>ext2</I> con el 
<A HREF="Grabadoras-Como-6.html#mke2fs">mke2fs</A> en un
archivo.</P>
<P>Para usar la opci&oacute;n <CODE>-useinfo</CODE> necesitamos primero haber extraido con el
<CODE>cdda2wav</CODE> un CD-Audio al disco duro sin poner la opci&oacute;n <CODE>-H</CODE>.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrecord -v dev=0,3,0 fs=16m speed=4 -useinfo *.wav
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Pues s&iacute;, <CODE>cdrecord</CODE> tambien graba en <I>DAO</I>, pero s&oacute;lo a partir de la
versi&oacute;n de desarrollo <CODE>1.8a20</CODE>. La forma de usar <CODE>cdrecord</CODE> es
pr&aacute;cticamente la misma solo que para usar las caracter&iacute;sticas de la
grabaci&oacute;n en DAO ha de tener una grabadora que soporte <I>MMC</I> y utilizar
la opci&oacute;n <CODE>-dao</CODE>; salvo esto, puede usarlo como har&iacute;a normalmente.</P>
<P>Cuando utilizemos esta opci&oacute;n notaremos una forma distinta de grabar los CDs.
En primer lugar veremos una nueva frase que nos muestra el <I>cdrecord</I>,
<CODE>Sending CUE Sheet.</CODE> que nos indica que lo primero que est&aacute; haciendo es
escribir las separaciones de las pistas, los gaps y pregap para luego grabar
todo, incluida la TOC sin desactivar el laser de grabaci&oacute;n. Gracias a esta
opci&oacute;n se puede ahorrar unos segundos o minutos si se tiene que grabar un CD
con muchas pistas de audio.</P>
<P>Un ejemplo podria ser:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrecord -v dev=3,0 fs=16m speed=4 -dao /imagen.iso /audio/*.wav
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y tambien si se pretende copiar directemente desde un CD</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrecord dev=3,0 speed=4 fs=16m -v -dao -isosize /dev/sr0 -audio /wavs/*.wav
</PRE>
</CODE></BLOCKQUOTE>
 </P>


<H2><A NAME="ss7.2">7.2 CD Builder</A></H2>


<P>Prometedora aplicaci&oacute;n, con entorno gr&aacute;fico en X-Window, que permitir&aacute;
generar escaletas (<I>cue sheets</I> para la creaci&oacute;n de CDs, as&iacute; como de
subc&oacute;digos, como CD-G, CD-TEXT, etc.</P>
<P>En la actualidad est&aacute; en su primera etapa (<I>alpha</I> de desarrollo,
aunque dotado de cierta funcionalidad.</P>
<P>Puede obtenerlo de <CODE>
<A HREF="http://www.ccs.neu.edu/home/bchafy/cdb/cdb.html">http://www.ccs.neu.edu/home/bchafy/cdb/cdb.html</A></CODE>. </P>
<P>Al parecer se ha abandonado el desarrollo de este programa.</P>


<H2><A NAME="cdrdao"></A> <A NAME="ss7.3">7.3 <CODE>cdrdao</CODE></A></H2>


<P>Este programa ha evolucionado tanto que la copia en <I>DAO</I> y al vuelo est&aacute;
empezando a dar sus frutos. Es posible copiar CDs al vuelo sin volcar los datos
al disco duro incluso con las pistas de audio; el problema en este &uacute;ltimo
aspecto es que no soporta todas las unidades lectoras a pesar de incorporar
c&oacute;digo del <I>CDParanoia</I> para realizar la extracci&oacute;n de audio.  </P>
<P>Ech&aacute;ndole un vistazo a la documentaci&oacute;n se puede ver qu&eacute; unidades est&aacute;n
soportadas; tanto unidades grabadoras, incluyendo modelos SCSI e IDE, como 
unidades lectoras que hayan sido probadas sin problema. </P>
<P>Tambi&eacute;n se pide que si su unidad est&aacute; soportada para extraer Audio con
<I>cdparanoia</I>, pero no con <CODE>cdrdao</CODE>, le env&iacute;e la informaci&oacute;n que se
obitene de ejecutar el comando <CODE>cdparanoia -v</CODE> a la direcci&oacute;n de correo del
autor, que tratar&aacute; de incorporarar su unidad lo antes posible.</P>
<P>Todo lo referente a las unidades soportadas se encuentra en el archivo
<CODE>README</CODE> del paquete del c&oacute;digo fuente. En el mismo paquete se encuentran
otras utilidades bastante interesantes que comentar&eacute; seguidamente una vez
explicados los comandos de esta utilidad. </P>
<P>La &uacute;ltima versi&oacute;n, recomendada y realmente funcional, la <CODE>1.1.3</CODE>, se puede
obtener de <CODE>
<A HREF="http://www.ping.de/sites/daneb/cdrdao.html">http://www.ping.de/sites/daneb/cdrdao.html</A></CODE>. </P>
<P>Descripci&oacute;n de los comandos del programa:</P>
<P>
<DL>
<DT><B>Utilizaci&oacute;n del programa:</B><DD><P>
<BLOCKQUOTE><CODE>
<PRE>
cdrdao comando [opciones] archivo-toc
</PRE>
</CODE></BLOCKQUOTE>
</P>

<DT><B>comando</B><DD><P>indicamos al programa qu&eacute; es lo que queremos hacer.  Los comandos
disponibles son:</P>
<P>
<UL>
<LI><CODE>show-toc</CODE> Muestra la TOC y sale.</LI>
<LI><CODE>toc-info</CODE> Muestra una peque&ntilde;a descripcion de la informaci&oacute;n del
archivo TOC extraido previamente.</LI>
<LI><CODE>toc-size</CODE> Muestra el n&uacute;mero total de bloques para la TOC.</LI>
<LI><CODE>read-toc</CODE> Crea un archivo TOC desde un CD.</LI>
<LI><CODE>read-cd</CODE> Crea el archivo TOC y extrae el contenido del CD.</LI>
<LI><CODE>show-data</CODE> Muestra el contenido de los datos y sale.</LI>
<LI><CODE>read-test</CODE> Realiza una prueba de lectura de todas las pistas y
sale.</LI>
<LI><CODE>disk-info</CODE> Mustra informaci&oacute;n sobre el disco que hay en unidad.</LI>
<LI><CODE>unlock</CODE> Desbloquea la unidad despues de un fallo de escritura.</LI>
<LI><CODE>simulate</CODE> Ya no se utiliza, ahora es <CODE>write --simulate</CODE>.</LI>
<LI><CODE>write</CODE> Graba un CD.</LI>
<LI><CODE>copy</CODE> Copia, esto se utiliza para la copia <I>al vuelo</I>.</LI>
</UL>
 </P>

<DT><B>opciones</B><DD><P>Aqui se describen las diferentes opciones que soporta el
programa.</P>
<P>
<UL>
<LI><CODE>--device (x,y,z)</CODE> Especifica el dipositivo de la grabadora.  Se
puede suprimir si existe un enlace simb&oacute;lico del dispositivo correspondiente a
su grabadora a <CODE>/dev/cdrecorder</CODE>. Se puede indicar tanto la del
dispositivo directo como el identificador SCSI, ejemplo: <CODE>0,3,0</CODE> o
<CODE>/dev/sr1</CODE>
</LI>
<LI><CODE>--source-device (x,y,z)</CODE> Aqu&iacute; especificamos la unidad desde la
cual tomaremos los datos para realizar la copia. Se puede especificar tanto un
dispositivo como un identificador SCSI. Es necesaria si usamos el comando
<I>copy</I>.
</LI>
<LI><CODE>--driver (id)</CODE> Forzamos al programa a usar un controlador
espec&iacute;fico para la grabadora.
</LI>
<LI><CODE>--source-driver (id)</CODE> Forzamos al programa a usar un controlador
espec&iacute;fico para la unidad lectora. Es necesaria si usamos el comando <CODE>copy</CODE>,
aunque no si el programa identifica correctamente esta unidad.
</LI>
<LI><CODE>--simulate</CODE> Para realizar una copia con el l&aacute;ser desactivado, en
modo de simulaci&oacute;n o prueba. 
</LI>
<LI><CODE>--multi</CODE> No cierra el CD, para poder crear un CD multisesi&oacute;n.</LI>
<LI><CODE>--eject</CODE> Expulsa el CD una vez grabado.</LI>
<LI><CODE>--swap</CODE> Invierte el orden de palabra de las pistas de audio.</LI>
<LI><CODE>--on-the-fly</CODE> Realiza una copia al vuelo, no crea imagen.
</LI>
<LI><CODE>--datafile (archivo)</CODE> Nombre del archivo de datos en donde se
encuentran los datos a los que hace referencia el archivo TOC. Usado por
<CODE>read-cd</CODE>, <CODE>read-toc</CODE> y <CODE>copy</CODE>.
</LI>
<LI><CODE>--buffers (n&uacute;mero)</CODE> Expecifica el tama&ntilde;o del buffer (min. 10).</LI>
<LI><CODE>--session (n&uacute;mero)</CODE> Selecciona la sesi&oacute;n para <CODE>read-toc/read-cd</CODE>.</LI>
<LI><CODE>--fast-toc</CODE> No extrae los <I>pre-gaps</I> ni las marcas &iacute;ndice.</LI>
<LI><CODE>--read-raw</CODE> Lee los sectores <I>raw</I> para <I>read-cd</I>.
</LI>
<LI><CODE>--paranoia-mode (n&uacute;mero)</CODE> nivel de <I>paranoia</I> para la
extracci&oacute;n de audio <I>(0..3)</I>.
</LI>
<LI><CODE>--reload</CODE> Relee el disco si es necesario para grabar.</LI>
<LI><CODE>--force</CODE> Fuerza la ejecuci&oacute;n de la operaci&oacute;n.</LI>
<LI><CODE>-v (n&uacute;mero)</CODE> Expecifica el nivel de muestra de datos.</LI>
<LI><CODE>-n (n&uacute;mero)</CODE> No hace una pausa despu&eacute;s de grabar.</LI>
</UL>
</P>
</DL>
 </P>
<P>De aqui hay que comentar que el comando <CODE>copy</CODE> s&oacute;lo se usa para copiar un CD
directamente, si tenemos una imagen y la queremos copiar hay que usar el
comando <I>write</I>. Un tama&ntilde;o muy recomendado del buffer es 64, y de ah&iacute; en
adelante, aunque con 64 creo que es m&aacute;s que suficiente.</P>

<H3>Copia al vuelo de CD-ROMs.</H3>


<P>Ahora una breve descripci&oacute;n de lo que m&aacute;s nos interesa del programa, la copia
directa (al vuelo) sin imagen.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrdao copy -v 2 --device 0,3,0 --source-device 0,1,0 --speed 4 --buffers 64 \
--reload --eject --on-the-fly --fast-toc
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Este es el comando que utilizo para duplicar cualquier tipo de CD al vuelo.  Al
ponerle la opci&oacute;n <I>--fast-toc</I> realiza una lectura r&aacute;pida de la tabla de
contenidos del CD, de lo contrario primero leer&aacute; y comprobar&aacute; el CD fuente, lo
que tardar&aacute; lo que necesite su lector, y luego lo copiar&aacute;. Si le indicamos el
susodicho par&aacute;metro, leer&aacute; la TOC de forma r&aacute;pida y empezar&aacute; enseguida a
copiar. El resto de par&aacute;metros no necesitan de una explicacion m&aacute;s detallada.</P>
<P>Es recomendable que cuando se copie un CD de m&uacute;sica o mixto se utilice de la
siguiente manera con la opci&oacute;n <CODE>--paranoia-mode</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrdao copy -v 2 --device 0,3,0 --source-device 0,1,0 --speed 4 --buffers 64 \
--reload --eject --on-the-fly --fast-toc --paranoia-mode 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Con la opci&oacute;n <CODE>--paranoia-mode</CODE> le especificamos en que modo ha de ser
paranoico a la hora de extraer las pistas de audio, si le especificamos <CODE>0</CODE>,
ser&aacute; lo menos posible y es el que se recomienda a la hora de grabar al vuelo ya
que se desactiva la verificacion de errores, que como es normal, reduce la
transeferencia de datos ya que la unidad lectora se dedica m&aacute;s tiempo a
comprobar los posibles defectos de las pistas e intentar corregirlos que a
pasarle los datos a la grabadora, por lo que si no le ponemos este modo es muy
posible que se produzca un <I>buffer underrun</I> y perder el CD. </P>
<P>Si lo que queremos es que los verifique le indicamos modo <CODE>3</CODE> y ser&aacute; tan
paranoico que para extraer una pista de audio en un lector 32X SCSI (como mi
TEAC) tardar&aacute; m&aacute;s tiempo que dura la misma cancion al reproducirla; con esto el
programa se asegura de que no pierda calidad y de correguir posibles errores en
el CD.  Este modo es recomendable cuando tengamos algun CD en mal estado y la
&uacute;nica forma de poder grabarlo sea volcando primero a disco duro.</P>

<H3>Extracci&oacute;n y grabaci&oacute;n de im&aacute;genes DAO con cdrdao.</H3>


<P>Otra de las funciones que nos puede interesar muchisimo es la de extraer una
imagen al disco duro, como por ejemplo para lo dicho anteriormente, para cuando
tengamos algun CD que no podamos grabar al vuelo por estar defectuoso, o bien,
para grabarlo mas tarde. El comando a utilizar es el siguiente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrdao read-cd -v 2 --device 0,1,0 --read-raw --datafile imagen.bin imagen.toc
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>De esta forma conseguimos extraer una imagen en el archivo <CODE>imagen.bin</CODE> del
contenido del CD-ROM fuente y el en archivo <CODE>imagen.toc</CODE> almacenamos la
informaci&oacute;n que nos servir&aacute; posteriormente para poder grabar y dejar el nuevo
CD tal y como estaba el original. El comando a utilizar es el siguiente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cdrdao write -v 2 --device 0,3,0 --speed 4 --buffers 64 imagen.toc
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Como habr&aacute; notado, no hemos indicado el nombre de la imagen ya que la toma del
archivo que contiene la informaci&oacute;n TOC. El indicarle la opci&oacute;n <CODE>--datafile</CODE>
con el nombre de la imagen es s&oacute;lo para identificarla, por si tenemos m&aacute;s de
una extraida en el disco duro; sino, por defecto la imagen se llamar&aacute;
<CODE>data.bin</CODE>.  Si diese la casualidad de que ya hubiera un archivo con el
mismo nombre, el programa detendr&aacute; el proceso mostrando una advertencia,
indicando de que ya existe el archivo.</P>
<P>Tambi&eacute;n se puede usar el <CODE>cdrdao</CODE> para copiar una imagen de datos que
hayamos hecho, pero no lo recomiendo; ya que primero tenemos que crear un
archivo TOC, cosa que resulta m&aacute;s laborioso que copiarla con el <I>cdrecord</I>.</P>

<H3>Scripts que acompa&ntilde;an a cdrdao.</H3>


<P>Se puede usar <CODE>cdrdao</CODE> para copiar archivo <CODE>.wav</CODE>, y que gracias a un
script en PERL que incluye en el directorio <CODE>/contrib/wav2dao/</CODE> del
paquete del c&oacute;digo fuente podamos copiar dichas pistas sin que al final de las
mismas nos ponga 2 segundos de silencio.</P>
<P>Para obtener la ayuda del programa ponemos:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 
wav2dao.pl -H
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Deberia funcionar simplemente con</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
wav2dao.pl -d /dev/sr0 -w -n *.wav
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En el directorio de los fuentes <CODE>/contrib/mp32dao/</CODE> encontramos otro
script en PERL para realizar de forma autom&aacute;tica la extracci&oacute;n de los archivo
<CODE>.mp3</CODE> a <CODE>.wav</CODE>, nos crea la TOC y nos graba el CD, interesante, ¿no?.
Debido a la falta de algunos archivos en la distribuci&oacute;n del PERL en mi sistema
no he podido probarlo.  Este script hace uso del programa <I>mpg123</I> que se
encuentra en la mayoria de distribuciones del mercado o bien por internet.</P>
<P>Puede que necesite completar su distribuci&oacute;n perl con m&oacute;dulos del CPAN
(<I>Comprehensive Perl Archive Network</I>) <CODE>
<A HREF="http://www.cpan.org">http://www.cpan.org</A></CODE> para hacer uso de
este script.</P>

<H3>Duplicado de CD-ROMs de PlayStation con CDRDAO.</H3>

<P> </P>
<P>Por &uacute;ltimo tenemos en el directorio <CODE>/contrib/psxcopy-x.y/</CODE> dos
programas y dos scripts para la extracci&oacute;n y copia de los dichosos CDs de
PlayStation. Lo siento por aquellos que quieran copiar dichos CDs al vuelo,
pero de momento no soportan dicha funci&oacute;n, tal vez mas adelante, pero hay que
reconocer que ya es un comienzo que por lo menos se puedan grabar, ¿no?.</P>
<P>Pues bien, lo primero es compilar los dos programas que son necesarios y luego
instalarlos. Una vez compilados sin errores hacemos que los scripts
<CODE>read-psx</CODE> y <CODE>write-psx</CODE> sean ejecutables. Como son dos scripts normales,
habr&aacute; que editarlos y modicicar los par&aacute;metros para que apunten a nuestra
unidad lectora y grabadora respectivamente en cada archivo. Una vez hecho eso
simplemente introducimos el CD fuente en la unidad lectora, tecleamos:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
read-psx cd1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y una vez extra&iacute;do</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
write-psx cd1
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>A tener en cuenta</H3>


<P>Hay m&aacute;s posibilidades pero las descritas anteriormente son las que son m&aacute;s
faciles de usar y que m&aacute;s nos pueden interesar. En pr&oacute;ximas versiones
ampliaremos el contenido dedicado a este fabuloso programa.</P>
<P>Tambien indicar que en el mismo paquete de las fuentes se encuentra un interfaz
para X, el problema es que no soporta la grabaci&oacute;n al vuelo.</P>
<P><B>ATENCION</B>: Durante la utilizaci&oacute;n del programa para la duplicaci&oacute;n de
un CD-ROM al vuelo, no se podr&aacute; acceder de ninguna de las maneras a la unidad.
Si se intenta montar la unidad fuente, por ejemplo, el proceso de grabaci&oacute;n
terminar&aacute; con errores y el CD origen no se completar&aacute;, perdiedo un disco. Esto
se puede comprobar grabando un disco en modo de pruebas o de simulaci&oacute;n y
accediendo a la unidad desde donde se obtienen los datos.</P>


<HR>
<A HREF="Grabadoras-Como-6.html">Anterior</A>
<A HREF="Grabadoras-Como-8.html">Siguiente</A>
<A HREF="Grabadoras-Como.html#toc7">Indice</A>
</BODY>
</HTML>
