<HTML>
<HEAD>
<TITLE>TERM Como: X y TERM</TITLE>
</HEAD>
<BODY>
<A HREF="Term-Como-5.html">Anterior</A>
<A HREF="Term-Como-7.html">Siguiente</A>
<A HREF="Term-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. X y <CODE>TERM</CODE></A></H2>


<P><CODE>term</CODE> permite a los usuarios abrir ventanas X en la m&aacute;quina local
desde clientes que est&aacute;n corriendo en una m&aacute;quina de la red. Esto se hace
usando el cliente <CODE>txconn</CODE>. <CODE>txconn</CODE> se ejecuta en el remoto, la
m&aacute;quina conectada en red; se invoca simplemente como <CODE>txconn</CODE>. Se
coloca en background y devuelve un n&uacute;mero a la salida est&aacute;ndard; este
n&uacute;mero es el n&uacute;mero de <I>display</I> que los clientes deben usar para
acceder al servidor X de la m&aacute;quina local. Un ejemplo aclarar&aacute; &eacute;sto. Estoy
accediendo a mi cuenta, v&iacute;a <CODE>trsh</CODE>, en mi host remoto, llamado
``<CODE>foo</CODE>''. En <CODE>foo</CODE> realizo lo siguiente: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
foo$ txconn
Xconn bound to screen 10
:10
foo$
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ahora, para cualquier host en el que quiera correr un cliente X, o sea, 
verlo en el servidor X de mi m&aacute;quina local, har&eacute;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
setenv DISPLAY foo:10
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(para <CODE>bash</CODE> deber&iacute;a usarse <CODE>export DISPLAY=foo:10</CODE>). En algunos
casos adem&aacute;s de eso puede ser necesario hacer un <CODE>xhost + foo</CODE> en la
m&aacute;quina local. Ahora, cuando arranque el cliente, intentar&aacute; conectar con la
pantalla 10 de la m&aacute;quina <CODE>foo</CODE>, pero <CODE>txconn</CODE> estar&aacute; escuchando en
esa pantalla, y pasar&aacute; todos los paquetes con protocolo X v&iacute;a
<CODE>term</CODE> al servidor X en el host local; es decir, la ventana se
abrir&aacute; en la m&aacute;quina local. </P>
<P>Es posible trabajar en el otro sentido - correr un cliente en la m&aacute;quina
local y tener abierta la ventana en una m&aacute;quina remota de la red; sin
embargo, retrasaremos esta explicaci&oacute;n hasta despu&eacute;s de haber comentado
<CODE>tredir</CODE>. </P>
<P><CODE>txconn</CODE> no es terriblemente seguro; cualquiera puede conectar con el
servidor local v&iacute;a <CODE>term</CODE> y provocar todo tipo de da&ntilde;os. Si este
tipo de cosas son preocupantes, podr&iacute;a ser una buena idea considerar el
uso de <CODE>xauth</CODE> para autorizar las conexiones. Consulte la p&aacute;gina de
manual sobre <CODE>xauth</CODE>. </P>
<P>El protocolo X no es muy eficiente; desperdicia algo de ancho de banda. 
Esto no suele ser un problema en una ethernet, pero puede ser un crimen
v&iacute;a m&oacute;dem. Se supone que X11R6 presenta una versi&oacute;n de bajo ancho de banda
del protocolo X, <I>LBX</I>. Si, por el contrario, se est&aacute; usando X11R5
puede recurrirse a una utilidad llamada <CODE>sxpc</CODE> que comprime el
protocolo X, mejorando la respuesta sobre l&iacute;neas serie. <CODE>sxpc</CODE> incluye
un texto sobre c&oacute;mo hacerlo funcionar con <CODE>term</CODE>, y est&aacute;
recomendado. El paquete <CODE>sxpc</CODE> tambi&eacute;n explica como usar <CODE>xauth</CODE>;
por lo que est&aacute; doblemente recomendado. </P>

<HR>
<A HREF="Term-Como-5.html">Anterior</A>
<A HREF="Term-Como-7.html">Siguiente</A>
<A HREF="Term-Como.html#toc6">Indice</A>
</BODY>
</HTML>
