<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.17">
 <META NAME="LFCATEGORY" CONTENT="Games">
<!-- this is used be a number of tools:
 =LF=AUTHOR: Harald Radk
 =LF=CAT___: Games
 =LF=TITLE_: Revisi&oacute;n del Juego - Tux Racer
 =LF=NUMBER: 189
 =LF=ANAME_: article189.html
 -->
 <TITLE>lf189, Games: Revisi&oacute;n del Juego - Tux Racer</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD">Home</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD">Map</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD">Index</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD">Search</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">News</FONT></A> </TD>
           <TD><FONT color="#FFFFFF">|</FONT> </TD>
           <TD><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Archives</FONT></A> </TD>
           <TD><FONT color="#FFFFFF">|</FONT> </TD>
           <TD><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Links</FONT></A> </TD>
           <TD><FONT color="#FFFFFF">|</FONT> </TD>
           <TD><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">About LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Harald-Radke.gif" ALT="[Foto del autor]" HEIGHT=135 WIDTH=110>
<BR>by  <A HREF="mailto:harryrat&#64;gmx.de">Harald Radk</A>
<BR><BR>
<I>About the author:</I><BR>
<p>
Harry estudia ciencias de la computaci&oacute;n en la Universidad de Tecnolog&iacute;a de Aachen, Alemania desde 1.994.
Lleg&oacute; a Linux en 1.995. Desde entonces lo us&oacute;, siempre sorprendido por la gran obra de software que es. Programa un poco bajo X, cosas tales como gr&aacute;ficos y de camino juega. Otros hobbies son: Juegos de mesa, Leer Ciencia Ficci&oacute;n, tocar la guitarra (mal), cocinar y practicar Ju-Jutsu.
</p>
<BR><i>Content</i>:
<UL>
  <LI><A HREF="#189lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#189lfindex1">Instalando el juego</A></LI>
  <LI><A HREF="#189lfindex2">&iquest;Compilando con m&uacute;sica?</A></LI>
  <LI><A HREF="#189lfindex3">Configuraci&oacute;n</A></LI>
  <LI><A HREF="#189lfindex4">Jugando</A></LI>
  <LI><A HREF="#189lfindex5">Conclusiones</A></LI>
  <LI><A HREF="#189lfindex6">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=189&lang=en">Talkback form for this article</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Revisi&oacute;n del Juego - Tux Racer</H2>
 <IMG SRC="../../common/images/illustration189.gif" ALT="[Ilustraci&oacute;n]" HSPACE=10 HEIGHT=82 WIDTH=190>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Abstract</i>:
<P>
<p>
Tux Racer es un juego arcade de carreras. Nuestra mascota favorita de Linux tiene que deslizarse hacia abajo por colinas cubiertas de nieve, recogiendo tantos arenques como le sea posible y terminando las carreras en un tiempo. Buenos gr&aacute;ficos, diferentes carreras (que se ir&aacute;n desbloqueando conforme avances) y diferentes (opcional) condiciones meterol&oacute;gicas garantizan un mont&oacute;n de diversi&oacute;n. La versi&oacute;n testeada en este art&iacute;culo es la 0.60.3.
</p></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="189lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

<p>Hay un mont&oacute;n de juegos para Linux en los que Tux juega el rol de heroe. Donde est&aacute; equipado con diferentes tipos de armas, sentado en un Kart, combatiendo al <i>imperio del mal</i> (localizado en el noroeste de los E.E.U.U.), resolviendo enigmas o desafiantes b&uacute;squedas (a veces solo o con ayudantes), Siempre est&aacute; tranquilamente ocupado entreteniendo a la comunidad Linux. Esta vez ha venido solo, sin equipo, sin ayudantes, solo &eacute;l, la nieve y las monta&ntilde;as.
Toma parte en un evento deportivo y chico, &iexcl;como lo hace!.
</p>
<p><i>Tux Racer</i> es un juego arcade de velocidad de <i>Sunspire Studios</i>.
Tienes que ayudar a Tux dominando los circuitos, corriendo por colinas cubiertas de nive, recogiendo sus queridos arenques, contrareloj.
Preciosos gr&aacute;ficos 3d, fisica real, y condiciones climatol&oacute;gicas opcionales aportan un mont&oacute;n de diversi&oacute;n para toda aquella gente que prefiera pac&iacute;ficos desaf&iacute;os deportivos a sangrientas masacres alien&iacute;genas.
</p>

<p><center>
<table border=0><tbody>
<tr>
<td><center><a href="../../common/images/article189/tuxracerfig1.jpg">
<img border=0 src="../../common/images/article189/tuxracerfig1_s.jpg" alt="IMG: targeting a herring"></a><br>
<i>Objetivo un arenque</i>
</center></td></tr></tbody></table></center>

<A NAME="189lfindex1">&nbsp;</A>
<H2>Instalando el juego</H2>

<P>
Tux Racer es c&oacute;digo abierto (open source). Por esta raz&oacute;n puedes obtener el c&oacute;digo fuente y los ficheros necesarios o decidir descargar los paquetes precompilados desde el website de <a href="http://www.tuxracer.com">Sunspire Studio</a>.
Bueno, mientras se escrib&iacute;a este art&iacute;culo, se prometian los paquetes precompilados, pero realmente no estaban disponibles. De todas formas, compilando el c&oacute;digo fuente no deber&iacute;as de tener problemas.
</p>
<center>
<table border=0>
<tbody>
<tr bgcolor="#006080">
 <td><center><font color="#ffffff"><b>Requerimientos</b></font></center></td>
</tr>
<tr bgcolor="#00a0c0">
<td>Sistema X window</td>
</tr>
<tr bgcolor="#00a0c0">
 <td>API OpenGL Versi&oacute;n 1.1 or mayor (p.ej. Mesa >= 3.2)</td>
</tr>
<tr bgcolor="#00a0c0">
 <td>GLUT Versi&oacute;n 3.7 o mayor (a menudo vienen junto con Mesa)</td>
</tr>
<tr bgcolor="#00a0c0">
 <td>Tcl Versi&oacute;n 8.0 o mayor</td>
</tr>
<tr bgcolor="#00a0c0">
 <td><i>Opcional</i>
<center>
<table border=0>
      <tbody>
<tr>
<td>SDL 1.1.1. (Soporta joystick)</td>
</tr>
<td>SDL mixer 1.0 (sonido y m&uacute;sica)</td>
</tr>
      </tbody>
        </table>
    </center>
 </td>
</tr>
</tbody>
</table>
</center>
Un magn&iacute;fico manual HTML viene junto con el paquete fuente. La documentaci&oacute;n cubre el proceso de instalaci&oacute;n muy bien (como tambi&eacute;n otros aspectos del juego...), no lo explicar&eacute; aqu&iacute; con demasiado detalle. B&aacute;sicamente, si tienes instalado todo el software necesario, el procedimiento de instalaci&oacute;n consiste en cambiar al directorio que contiene el c&oacute;digo fuente y ejecutar la siguiente secuencia de comandos</p>
<p>
<tt>./configure</tt><br>
<tt>make</tt><br>
<tt>make install</tt>
</p>
<p>
en el prompt.<br>
<i>(no olvides obtener los prilegios de <tt>root</tt> para ajustar la configuraci&oacute;n del juego)</i>
</p>
<p>Junto con los fuentes necesitar&aacute;s otro paquete con los datos del juego. Tambi&eacute;n lo encontrar&aacute;s en la secci&oacute;n de descarga del website mencionado anteriormente. Por defecto Tux Racer espera que esos ficheros se encuentren localizados en <tt>/usr/local/share/tuxracer</tt> pero seguro que esto se puede cambiar editando el
<i>fichero de configuraci&oacute;n</i> (despu&eacute;s m&aacute;s).</p>
<p>
<b>Nota:</b>
<ul>
<li><p>Si no tienes aceleradora 3d (soportada por X), no pienses siquiera ejecutar eljuego.  &iexcl;En su lugar ve y compra un adaptador gr&aacute;fico decente! (:</p>
<li><p>Aun teniendo y ejecutando el soporte 3d <i>puede</i> ser un poco dif&iacute;cil para aquellos usuarios de distribuciones antiguas. Lo mejor es tener XFree 4.0.X y las &uacute;ltimas librerias OpenGL ,suministradas desde el site del vendedor (si est&aacute;n disponibles).</p>
<li><p>El paquete fuente tiene un tama&ntilde;o de 630KB, el paquete de datos &iexcl;<b>7,5MB</b>! proximadamente No digas que no te lo advert&iacute;(: </p>
<li><p>No descargues el paquete de datos cada vez que se apliquen cambios menores de revisi&oacute;n al c&oacute;digo fuente (mira en los n&uacute;meros de versi&oacute;n particular de ambos paquetes)</p>
</ul>
Despu&eacute;s, cuando cada cosa est&eacute; en su sitio podr&aacute;s arrancar el juego escribiendo <tt>tuxracer</tt>.

<p><center><a href="../../common/images/article189/tuxracerfig2.jpg">
<img border=0 src="../../common/images/article189/tuxracerfig2_s.jpg" alt="Img: Penguin in the dark"></a><br>
<i>Ping&uuml;ino en la oscuridad</i>
</center>


<A NAME="189lfindex2">&nbsp;</A>
<H2>&iquest;Compilando con m&uacute;sica?</H2>

Bueno, la compilaci&oacute;n del sonido no fue cosa f&aacute;cil. &iquest;Por qu&eacute;?Why? Bien, despu&eacute;s de mi primera instalaci&oacute;n cada cosa estaba en su s&iacute;tio - excepto la m&uacute;sica. El programa me decia que no podia reconocer los ficheros de m&uacute;sica <tt>*.it</tt>. De forma que, como Tux Racer usa SDLmixer para ejecutar m&uacute;sica, comenc&eacute; a escarbar en los manuales y a navegar por los websites...
Mi actual distribuci&oacute;n de Linux es SuSE 7.0, que viene con SDL 1.1.2 y SDLmixer 1.0.5. As&iacute;, mi primera opci&oacute;n fue recompilar la librer&iacute;a mixer desde el paquete fuente de SuSE. Resultado: Ahora Tux Racer falla en una de las rutinas SDL. No ten&iacute;a ni idea de donde estaba el error. De todas formas, no me d&iacute; por vencido, desinstal&eacute; todos los paquetes SDL y los sustitu&iacute; por nuevas versiones obtenidas del <a href="http://www.libsdl.org">
website SDL</a>. Prob&eacute; los RPM's y... &iexcl;funcionaron!.<br>
Aqu&iacute; est&aacute;n los paquetes que descargu&eacute;:<p>
<ul>
<li>SDL-1.1.6-1.i386.rpm
<li>SDL-devel-1.1.6-1.i386.rpm
<li>SDL_mixer-1.1.0-1.i386.rpm
<li>SDL_mixer-devel-1.1.0-1.i386.rpm
<li>smpeg-0.4.2-1.i386.rpm
</ul>

<p><center><a href="../../common/images/article189/tuxracerfig3.jpg">
<img border=0 src="../../common/images/article189/tuxracerfig3_s.jpg" alt="Img: Bad weather "></a><br>
<i>Mal tiempo</i>
</center>


<A NAME="189lfindex3">&nbsp;</A>
<H2>Configuraci&oacute;n</H2>

<p>Despu&eacute;s de ejecutar el juego por primera vez, se crea un directorio llamado <tt>.tuxracer/</tt>
en tu directorio home. Navegando a trav&eacute;s del men&uacute; del juego, no encontrar&aacute;s entradas como <i>Options</i> o <i>Configure</i>. En su lugar tendr&aacute;s que ejecutar tu editor favorito y ajustar el fichero de configuraci&oacute;n <tt>.tuxracer/options</tt> manualmente. No es dif&iacute;cil, todas las entradas est&aacute;n en modo texto. De todos modos, ser&iacute;a una caracter&iacute;stica interesante porder cambiar las selecciones a trav&eacute;s del men&uacute; del juego y en un vistazo r&aacute;pido a la lista de cosas que hacer (TODO) en el website aparece como una de las cosas que aparecer&aacute;n en futuras versiones.
</p>
<p>Algunas opciones pueden ser configuradas en este fichero <tt>options</tt>, Por ejemplo el path a los datos del juego, tama&ntilde;o de ventana, selecciones de sonido y gr&aacute;ficos. Cada entrada tiene algunos comentarios, as&iacute; que no ser&aacute; dif&iacute;cil adaptar el fichero de acuerdo a tus necesidades. Echa un vistazo y juega con las selecciones.
</p>

<p><center><a href="../../common/images/article189/tuxracerfig6.jpg">
<img border=0 src="../../common/images/article189/tuxracerfig6_s.jpg" alt="Img: Spotting finish"></a><br>
<i>Linea de meta</i>
</center>

<A NAME="189lfindex4">&nbsp;</A>
<H2>Jugando</H2>

Como he dicho antes, tu objetivo es recoger tantos arenques como puedas mientras pruebas a ser lo m&aacute;s r&aacute;pido posible.<p>
Despu&eacute;s de escribir <tt>tuxracer</tt> El juego se inicia en modo de pantalla completa, de todas formas puedes ejecutarlo tambi&eacute;n en una ventana m&aacute;s peque&ntilde;a.
Si editas el fichero de configuraci&oacute;n y seleccionas otr resoluci&oacute;n, no te olvides de deshabilitar el <i>modo fullscreen</i>, o los valores introducidos se resetearan despu&eacute;s de comenzar el juego.
Pasando la pantalla de inicio, entrar&aacute;s en el men&uacute; del juego. Aqu&iacute; puedes entrar en cualquier competici&oacute;n o decidir que necesita practicar tu peque&ntilde;o ping&uuml;ino.
<p><b>Men&uacute; Practice</b><p>
En el &aacute;rea de pr&aacute;ctica puedes seleccionar una pista fuera de una larga pila de circuitos. Adicionalmente puedes modificar las condiciones de carrera tales como correr de dia o de noche, viento, nieve (futuras versiones) o el reflejo de la pista. Algunas de las pistas vienen con alg&uacute;n corto sumario describiendo sus caracter&iacute;sticas.

<p><b>Men&uacute; Event</b><p>
Tan pronto como pienses que puedes manejarlo, podr&aacute;s empezar con carreras <i>reales</i>. En el &aacute;rea de eventos, no podr&aacute;s simplemente seleccionar la pista que quieras para correr. En el &aacute;rea de eventos, no podr&aacute;s simplemente seleccionar la pista que quieras para correr. En su lugar tendr&aacute;s que completar las llamadas <i>cups</i>. Una cup (copa) consiste en varios eventos (actualmente uno solo - la carrera del arenque) y tendr&aacute;s que terminar todas las carreras y eventos de una cup (copa) antes de proceder al siguiente. Por cada carrera hay ciertas condiciones que tienes que reunir, de otra forma no podr&aacute;s avanzar, en otras palabras, tendr&aacute;s que alcanzar el final en un tiempo recogiendo como m&iacute;nimo un cierto n&uacute;mero de pescado.
<p><b>La Carrera</b></p>
Al comenzar una carrera, la vista seleccionada de Tux es por detr&aacute;s, deslizandose hacia las colinas de en frente. Con las teclas cursoras podr&aacute;s conducirlo (izquierda/derecha), acelerar(arriba) y frenar(abajo). Adem&aacute;s nuestro ingenioso amigo podr&aacute; saltar(e). Cuando frenemos y pulsemos una de las teclas de giro (izquierda/derecha), Tux har&aacute; un giro brusco y reducir&aacute; la velocidad. Si es necesario puedes &quot;resetear&quot; al pobre compa&ntilde;ero con la tecla <tt>retroceso</tt> si se queda atascado de alguna manera. Si no te gusta el control de teclado, puedes cambiar el mapeo de las teclas o usar un joystick.
</p>
<p>
El circuito est&aacute; marcado con banderas. Entre algunas banderas hay arenques que debes recoger. Supongo que tan pronto como haya m&aacute;s <tt>eventos</tt> habr&aacute; mas material adem&aacute;s de pescado. Duranque la carrera podr&aacute;s oir el silbido del viento, dependiendo del tipo de terreno en el se est&eacute; deslizando el ping&uuml;ino, se escuchar&aacute;n diferentes sonidos. Igual que si giras, frenas o te estrellas contra un &aacute;rbol (&iexcl;ouch!). Las acciones de Tux est&aacute;n animadas muy suavemente, tanto si aceleras, frenas o giras. Mientras bajamos deslizandonos por las colinas el pig&uuml;ino crea un surco en la nieve. Si activas la m&uacute;sica, te entretendr&aacute; durante la carrera (Tal vez debas ajustar los valores por defecto para m&uacute;sica y sonido para que sea posible escuchar el viento y el deslizamiento).
</p>
<p>Tienes cuatro &quot;vidas&quot;, que es, que puedes fallar tres veces, despu&eacute;s de la cuarta, terminas tu partida. Un pqeue&ntilde;o detalle es el hecho de que si reintentas una carrera que hayas fallado antes, puedes ver el anterior surco que creaste en la nieve.
</p>
<p>En la esquina superior izquierda del monitor se ve el tiempo transcurrido, ek n&uacute;mero de arenques recogido (&iquest;solo para el evento <i>carrera del arenque</i>?) se ve en la esquina superior derecha. El as&iacute; llamado <i>energ&oacute;metro</i> (energometer) en la esquina inferior derecha indica la potencia que Tux puede usar para saltar (altura y distancia). El c&iacute;rculo m&aacute;s azul indica la m&aacute;xima potencia de la que el ping&uuml;ino dispone (manteniendo pulsada la tecla de salto).
 Alrededor del energ&oacute;metro la velocidad est&aacute; representada de forma gr&aacute;fica. El veloc&iacute;metro Tux cambia, la barra indicadora cambia su color de verde a amarillo y finalmente a rojo. Para todos aquellos que quieran que sea f&aacute;cil usar los instrumentos, la velocidad tambi&eacute;n se muestra en n&uacute;meros. Finalmente en la esquina inferior izquierda se encuentra el indicador de estado, mostrando la cantidad completada del juego. Despu&eacute;s de terminar la carreram tendr&aacute;s algunos datos (tiempo, objetos recogidos) y ser&aacute;s informado de si has avanzado o fallado y debes intentarlo otra vez.</p>

<p><center><a href="../../common/images/article189/tuxracerfig4.jpg">
<img border=0 src="../../common/images/article189/tuxracerfig4_s.jpg" alt="Img: Practice menu"></a><br>
<i>Menu Practice</i>
</center>


<A NAME="189lfindex5">&nbsp;</A>
<H2>Conclusiones</H2>

<p>
<i>Tux Racer</i> es un simp&aacute;tico juego, con preciosos gr&aacute;ficos detallistas, sonido y m&uacute;sica. Hay diferentes pistas para competir. Algunas peque&ntilde;as imperfecciones, por ejemplo, no existe una opci&oacute;n multijugador y no puedes competir contra otros oponentes manejados por el ordenador. Pero estos puntos podr&aacute;n ser encontrados en la lista de futuras mejoras que afortunadamente seran implementadas pronto. Algunas como la posibilidad de cambiar las selecciones del juego via men&uacute;.
</p>
<p>Otro &quot;problema&quot; es el rendimiento. En mi ordenador que es una K6-3 a 450Mhz, una TNT2 M64, Xfree 4.0.1 y controladores Nvidia GL, versi&oacute;n 0.95, he alcanzado rendimientos entre 8-14 frames (fotogramas) por segundo (con las selecciones por defecto en el fichero de configuraci&oacute;n), dependiendo de la resoluci&oacute;n y el tama&ntilde;o de la ventana. Cambiando las selecciones de gr&aacute;ficos, puedo mejorar ligeramente el rendimiento, pero no se producen cambios considerables.
</p>
<p>De todas formas el juego es m&aacute;s que solo jugable, los fondos no se mueven suavemente cuando giramos &iexcl;la carrera resulta afectada en s&iacute; misma por el bajo rendimiendo! (ja, tal vez el medidor de frames est&eacute; roto, creo que 8fp/s es realmente bajo, pero, entonces, a lo mejor el juego es jugable...)
</p>
<p>Todo, en todo este juego es equivalente al esfuerzo para ser descargado, compilado e instalado. Para todo aquel de vosotros, que quiera divertirse, &iexcl;que vaya a por &eacute;l!
</p>

<p><center><a href="../../common/images/article189/tuxracerfig5.jpg">
<img border=0 src="../../common/images/article189/tuxracerfig5_s.jpg" alt="Img: Event menu"></a><br>
<i>Menu Event</i>
</center>


<A NAME="189lfindex6">&nbsp;</A>
<H2>Referencias</H2>

<ul>
<li>Website de Tux Racer: <a href="http://www.tuxracer.com">www.tuxracer.com</a> (todas las capturas de pantalla pueden encontrarse aqu&iacute;)<br>
<li>The <a href="http://www.tuxracer.com/manual.html">Online Manual</a> (viene con los fuentes)<br>
<li>Tux Racer <a href="http://www.tuxracer.com/faq.html">FAQ</a> (tambi&eacute;n en el paquete fuente)<br>
<li><a href="http://www.libsdl.org">p&aacute;gina SDL de Loki</a><br>
<li>M&aacute;s comentarios de la comunidad Linux en <a href="http://happypenguin.org/show?Tux%20Racer">Linux Game Tome</a>.
</ul>


<!-- vim: set sw=2 ts=2 et: -->




<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback form for this article</h2>
Every article has its own talkback page. On this page you can submit a comment or look at comments from other readers:
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=189&lang=en"><b>&nbsp;talkback page&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Webpages maintained by the LinuxFocus Editor team</A>
<BR><FONT COLOR="#FFFFFF">&copy; Harald Radk, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=en&article=article189.html" target="_TOP">Click here to report a fault or send a comment to LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:harryrat&#64;gmx.de"><FONT COLOR="#FFFFFF">Harald Radk</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:jbalmes&#64;teleline.es"><FONT COLOR="#FFFFFF">Jes&uacute;s Balmes Ruiz</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-07-19, generated by lfparser version 2.17</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
