<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.1">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <TITLE>Applications : Desarrollando herramientas bajo Linux para una cadena de &Oacute;pticas</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/JPRD_crazycomputer.png" NAME="Graphic1" ALT="El autor transformado despues de ser tocado por el Linux" ALIGN=TEXTTOP WIDTH=100 HEIGHT=100 BORDER=0>
<BR>por  <A HREF="mailto:hypatia@mail.internet.com.mx">Juan Pablo Rosas Duran</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Actualmente es Gerente de sistemas en &Oacute;ptica LUX en M&eacute;xico.
Esta involucrado con la inform&aacute;tica desde los 3 a&ntilde;os,
cuando revolv&iacute;a los lotes de tarjetas perforadas en el trabajo
de su padre y usaba los manuales de un Gamma10 como cuaderno de
dibujo. Cuando conoci&oacute; Linux su vida profesional fue
transformada, y desde entonces trata de aplicar (con cierto &eacute;xito)
el software de fuente abierta en cualquier problema donde se
requieren computadoras.
<BR>
Se encuentra promoviendo la formaci&oacute;n de un grupo para el
desarrollo de aplicaciones de negocios bajo licencia GPL:
<A HREF="http://www.pochtecah.org.mx/">http://www.pochtecah.org.mx/</A>.
<BR>
Agradece encarecidamente a Linux<font color="#FF0000">Focus</font> la oportunidad de compartir sus
experiencias sobre Linux y el software de fuente abierta.
</P>
<P><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Sobre &Oacute;ptica LUX.
</A></LI>
  <LI><A HREF="#lfindex1">Actividades de una &oacute;ptica.</A></LI>
  <LI><A HREF="#lfindex2">B&uacute;squedas infructuosas.</A></LI>
  <LI><A HREF="#lfindex3">Descubrimiento de Linux.</A></LI>
  <LI><A HREF="#lfindex4">Errores en la adopci&oacute;n de Linux.</A></LI>
  <LI><A HREF="#lfindex5">Desarrollo de la aplicaci&oacute;n.
</A></LI>
  <LI><A HREF="#lfindex6">Herramientas utilizadas para el an&aacute;lisis, dise&ntilde;o y
documentaci&oacute;n.</A></LI>
  <LI><A HREF="#lfindex7">Herramientas utilizadas para la construcci&oacute;n.</A></LI>
  <LI><A HREF="#lfindex8">La aplicaci&oacute;n en s&iacute;.</A></LI>
  <LI><A HREF="#lfindex9">La interface con el usuario.</A></LI>
  <LI><A HREF="#lfindex10">Duplicaci&oacute;n de la base de datos v&iacute;a correo
electr&oacute;nico encriptado.</A></LI>
  <LI><A HREF="#lfindex11">Computadoras light.</A></LI>
  <LI><A HREF="#lfindex12">Honor a quien honor merece.</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=145&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Desarrollando herramientas bajo Linux para una cadena de &Oacute;pticas</H2>
 <IMG SRC="../../common/images/illustration145.png" NAME="Graphic2" ALT="Tux con gafas" ALIGN=TEXTTOP WIDTH=128 HEIGHT=150 BORDER=0><P><i>Resumen</i>:
<P>
<P>En este art&iacute;culo conocer&eacute;is la historia de como una
empresa mediana dedicada a la comercializaci&oacute;n y fabricaci&oacute;n
de anteojos ha utilizado el linux y el software libre para atender
mejor a sus clientes.
</P></P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->

<A NAME="lfindex0">&nbsp;</A>
<H2>Sobre &Oacute;ptica LUX.
</H2>

<P>&Oacute;ptica LUX es una empresa dedicada a la fabricaci&oacute;n
y comercializaci&oacute;n de anteojos para sol y graduados. En Marzo
del a&ntilde;o 2000 cumplir&aacute; 58 a&ntilde;os de permanencia en
el mercado, y en los &uacute;ltimos ocho a&ntilde;os ha duplicado el
n&uacute;mero de sus sucursales hasta llegar a 40.
</P>
<P>Desde su fundaci&oacute;n &Oacute;ptica LUX ha desarrollado una
m&iacute;stica de trabajo orientada a la plena satisfacci&oacute;n de
los clientes, la cual exige el m&aacute;ximo conocimiento sobre los
gustos y necesidades &oacute;pticas de cada uno de ellos.
</P>
<P>Se estima que al cierre de 1999 se contaba con la preferencia de
varios cientos de clientes, los datos generales y optom&eacute;tricos
de todos ellos se han conservado en fichas de cart&oacute;n (Con las
limitaciones derivadas de su operaci&oacute;n manual).
</P>
<P STYLE="margin-bottom: 0in">El problema fue encontrar una soluci&oacute;n
viable que permitiera sistematizar la atenci&oacute;n a los clientes,
sin restar agilidad ni calidad al servicio, sino todo lo contrario,
que agregara m&aacute;s valor a cada anteojo entregado.
</P>
<HR>
<A NAME="lfindex1">&nbsp;</A>
<H2>Actividades de una &oacute;ptica.</H2>

<P>Para empezar, se debe rese&ntilde;ar brevemente el proceso general
de atenci&oacute;n a clientes en &Oacute;ptica LUX, con el fin de
comprender el alcance de la aplicaci&oacute;n que ser&aacute;
descrita m&aacute;s adelante. Cuando un cliente llega a cualquiera de
las &Oacute;pticas LUX, es atendido siguiendo los siguientes pasos:
</P>
<OL>
	<LI><P STYLE="margin-bottom: 0in">Son tomados los datos generales
	del cliente, entre otros su nombre, direcci&oacute;n y buz&oacute;n
	de correo electr&oacute;nico.
	</P>
	<LI><P STYLE="margin-bottom: 0in">El cliente es conducido a un
	gabinete, donde se le realizan distintos tipos de mediciones y
	ex&aacute;menes, entre ellos se encuentran la lensometr&iacute;a, la
	refracci&oacute;n, la queratometr&iacute;a, la medici&oacute;n de la
	agudeza visual, etc.
	</P>
	<LI><P STYLE="margin-bottom: 0in">Con base a las pruebas efectuadas
	se asesora al cliente sobre las tecnolog&iacute;as &oacute;pticas
	que pueden ayudarle en su problema de visi&oacute;n.
	</P>
	<LI><P STYLE="margin-bottom: 0in">El cliente selecciona tanto la
	tecnolog&iacute;a de lentes como el modelo de armaz&oacute;n que m&aacute;s
	le acomoden.
	</P>
	<LI><P>El cliente otorga un anticipo o la liquidaci&oacute;n de su
	trabajo, mismo que es remitido a la f&aacute;brica para su pronta
	elaboraci&oacute;n y entrega.
	</P>
</OL>
<P>Del estudio del proceso de atenci&oacute;n a clientes se derivaron
ciertas consideraciones, las cuales son cruciales para la
implementaci&oacute;n de cualquier aplicaci&oacute;n que pretenda
apoyarlo, a saber:
</P>
<UL>
	<LI><P STYLE="margin-bottom: 0in">Los pasos no son del todo
	secuenciales, dependiendo del tama&ntilde;o de la &oacute;ptica, y
	de la cantidad de personas que est&eacute;n esperando atenci&oacute;n.
	Se puede optar por tomar los generales dentro del gabinete o, si
	todos los gabinetes est&aacute;n siendo ocupados, preferir que el
	cliente seleccione primero el armaz&oacute;n antes de que se le
	apliquen los ex&aacute;menes.
	</P>
	<LI><P STYLE="margin-bottom: 0in">El personal de las &oacute;pticas
	es experto en optometr&iacute;a, m&aacute;s no est&aacute;n
	familiarizados con los sistemas de c&oacute;mputo.
	</P>
	<LI><P STYLE="margin-bottom: 0in">El espacio de cada &oacute;ptica
	es limitado, y el que existe se prefiere usarlo para mostrar a los
	clientes los armazones que se encuentran a su disposici&oacute;n.
	</P>
	<LI><P STYLE="margin-bottom: 0in">Deben ser almacenados una gran
	variedad de datos optom&eacute;tricos de cada cliente.
	</P>
	<LI><P>La atenci&oacute;n al cliente debe ser &aacute;gil y
	personalizada, las personas deben ser identificadas por su nombre,
	no por un n&uacute;mero.
	</P>
</UL>
<P STYLE="margin-bottom: 0in">De todo lo expuesto se ve que la
aplicaci&oacute;n para apoyar la atenci&oacute;n a clientes es
bastante especializada e innovadora.
</P>
<HR>
<A NAME="lfindex2">&nbsp;</A>
<H2>B&uacute;squedas infructuosas.</H2>

<P>Desde 1990 se han estudiado diferentes sistemas propietarios
especializados en puntos de venta para &oacute;pticas, pero ninguno
de ellos se apega completamente a los procesos de atenci&oacute;n a
clientes y fabricaci&oacute;n de anteojos de &Oacute;ptica LUX. De
haberlos adoptado hubiera implicado cambiar los procesos o pagar el
doble del costo original del software por concepto de adecuaciones y
modificaciones, sin mencionar el costo impl&iacute;cito de la
dependencia a una casa de software.
</P>
<P>En el a&ntilde;o 1995 se consider&oacute; la posibilidad de
desarrollar in-house el software justo a la medida de las necesidades
de &Oacute;ptica LUX. No obstante al proyectar los costos de
licenciamiento de la plataforma y herramientas que en aquel entonces
estaban en uso (SCO Unix e Informix), resultaba que se ten&iacute;a
que erogar un monto equivalente a la apertura de una nueva &oacute;ptica!!!,
incluyendo instalaciones, equipo de medici&oacute;n optom&eacute;trica
y mercanc&iacute;a.
</P>
<P>Fue entonces cuando se decidi&oacute; buscar soluciones viables
que no implicar&aacute;n inversiones multimillonarias en licencias.
Las plataformas que m&aacute;s llamaron la atenci&oacute;n fueron
coherent, qnx y Linux.
</P>
<P>Tratamos de contactar a coherent, pero en esa &eacute;poca cesaron
de operar.
</P>
<P STYLE="margin-bottom: 0in">Qnx contaba con un representante en
M&eacute;xico (en la ciudad de Monterrey N.L.). Su labor se concret&oacute;
a enviarnos folleter&iacute;a, pero el tiempo de respuesta y su
atenci&oacute;n dejaron mucho que desear.
</P>
<HR>
<A NAME="lfindex3">&nbsp;</A>
<H2>Descubrimiento de Linux.</H2>

<P>Se conoci&oacute; a Linux por medio de un art&iacute;culo titulado
``Linux una propuesta indecorosa'', escrito por Fernando Magari&ntilde;os
(mejor conocido en los grupos de correo como la m&iacute;tica
``Mancha de la Calabaza que ladra''). Le mandamos un correo, el cual
fue contestado por el mism&iacute;simo Miguel de Icaza (dudo que &eacute;l
lo recuerde). &Eacute;l dio sus puntos de vista, los cuales
reforzaron a&uacute;n m&aacute;s el inter&eacute;s hacia Linux.
</P>
<P>En un principio se vio a Linux s&oacute;lo como una plataforma
``Royalty free''. Sin embargo los principios en los que se basa, as&iacute;
como el dinamismo y esp&iacute;ritu de las comunidades alrededor del
mismo fueron impactantes y cautivadoras.
</P>
<P>El soporte t&eacute;cnico que se obtiene de las listas de correo
es m&aacute;s efectivo que cualquiera de sus contrapartes
comerciales. Linux es una plataforma estable en constante
perfeccionamiento y tiene gran cantidad de aplicaciones ampliamente
disponibles.
</P>
<P>Adem&aacute;s, la informaci&oacute;n sobre Linux y el software
libre es mucho m&aacute;s asequible que la de su contraparte
propietaria, haciendo factible un auto-aprendizaje de estas
herramientas.
</P>
<P>Actualmente Linux es usado en &Oacute;ptica LUX no s&oacute;lo en
las sucursales, sino tambi&eacute;n en las oficinas ejecutivas, sobre
todo en el lado del servidor, para compartir archivos e impresoras,
almacenar bases de datos y ejecutar aplicaciones desarrolladas para
otros Unix.
</P>
<P>Tambi&eacute;n es utilizado como base de la infraestructura de
comunicaciones, como servidor ppp, servidor de web, correo
electr&oacute;nico y ftp (nuestra peque&ntilde;a ``intranet''), as&iacute;
como para el control y segmentaci&oacute;n del tr&aacute;fico de la
red.
</P>
<P STYLE="margin-bottom: 0in">&Uacute;ltimamente se ha introducido el
Linux como plataforma de escritorio para usuarios finales, pero esa
es otra historia. :-)
</P>
<HR>
<A NAME="lfindex4">&nbsp;</A>
<H2>Errores en la adopci&oacute;n de Linux.</H2>

<P>Todo inicio es dif&iacute;cil, y el factor cr&iacute;tico en
&Oacute;ptica LUX fue el convencer a los Directivos no tanto de las
bondades t&eacute;cnicas de la plataforma, si no m&aacute;s bien el
que tomaran conciencia de que el costo de desarrollo de nuevos
sistemas, sobre todo altamente especializados, no es barato ni
r&aacute;pido.
</P>
<P>Fueron 7 empresas o grupos quienes cotizaron el desarrollo del
sistema sobre Linux, pero sus propuestas sobrepasaban el costo de las
soluciones propietarias de las que ya se ha hablado.
</P>
<P>Se intent&oacute; reclutar programadores para el desarrollo
in-house. Sin embargo a&uacute;n son pocas las personas que realmente
programan en esta plataforma, y quienes se encuentran disponibles
cobran (y con justa raz&oacute;n) m&aacute;s all&aacute; de la media
del mercado.
</P>
<P STYLE="margin-bottom: 0in">Hoy se reconoce que el desarrollo de
aplicaciones basadas en software de fuente abierta podr&iacute;a ser
m&aacute;s caro que el dependiente de herramientas propietarias, pero
los resultados son mucho mejores. De cualquier forma, los ahorros en
licenciamiento se pueden aplicar al desarrollo de este tipo de
aplicaciones.
</P>
<HR>
<A NAME="lfindex5">&nbsp;</A>
<H2>Desarrollo de la aplicaci&oacute;n.
</H2>

<P>A mediados de 1999 se contrat&oacute; a un grupo de consultores
para desarrollar la aplicaci&oacute;n de atenci&oacute;n a clientes
teniendo como base Linux y software GNU.
</P>
<P>El desarrollo se abord&oacute; con un enfoque de prototipos
incrementales. Primero se elabor&oacute; un an&aacute;lisis donde se
obtuvieron :
</P>
<OL>
	<LI><P STYLE="margin-bottom: 0in">El dise&ntilde;o detallado de la
	base de datos.
	</P>
	<LI><P STYLE="margin-bottom: 0in">Los casos de uso de la aplicaci&oacute;n.
		</P>
	<LI><P>Las interfaces de usuario.
	</P>
</OL>
<P>Con base en ello se program&oacute; un primer prototipo, el cual
fue evaluado por optometristas expertos, deriv&aacute;ndose m&aacute;s
detalles sobre los requerimientos y comportamientos del sistema, los
cuales se concretaron en un nuevo prototipo un tanto m&aacute;s
perfeccionado, continu&aacute;ndose as&iacute; en ciclos sucesivos de
refinamiento.
</P>
<P>El poder de las herramientas utilizadas permiti&oacute; acelerar
el proceso de programaci&oacute;n, reutilizando y perfeccionando los
componentes de la aplicaci&oacute;n.
</P>
<P STYLE="margin-bottom: 0in">Las herramientas seleccionadas se
pueden agrupar en dos divisiones: las empleadas durante el an&aacute;lisis,
dise&ntilde;o y documentaci&oacute;n, y las empleadas en la
construcci&oacute;n de la aplicaci&oacute;n.
</P>
<HR>
<A NAME="lfindex6">&nbsp;</A>
<H3>Herramientas utilizadas para el an&aacute;lisis, dise&ntilde;o y
documentaci&oacute;n.</H3>

<DL>
	<DT><STRONG>Xfig&nbsp;(<A HREF="http://www.xfig.org/">http://www.xfig.org</A>)</STRONG>
	</DT><DD>
	Herramienta usada para dibujar diagramas generales.
	</DD><DT>
	<STRONG>Dia&nbsp;(<A HREF="http://www.lysator.liu.se/~alla/dia">http://www.lysator.liu.se/~alla/dia</A>)</STRONG>
	</DT><DD>
	Herramienta usada para dibujar diagramas en notaci&oacute;n UML.
	</DD><DT>
	<STRONG>VisualTCL&nbsp;(<A HREF="http://www.neuron.com/stewart/vtcl">http://www.neuron.com/stewart/vtcl</A>)</STRONG>
	</DT><DD>
	Instrumento empleado para elaborar prototipos de la interface de
	usuario.
	</DD><DT>
	<STRONG>LYX&nbsp;(<A HREF="http://www.lyx.org/">http://www.lyx.org</A>)</STRONG>
	</DT><DD>
	Procesador de documentos donde fueron escritas las especificaciones
	de la aplicaci&oacute;n.
	</DD><DT>
	<STRONG>StarOffice&nbsp;(<A HREF="http://www.sun.com/staroffice">http://www.sun.com/staroffice</A>)</STRONG>
	</DT><DD STYLE="margin-bottom: 0.2in">
	Procesador de palabra donde fue escrito el manual para el usuario
	final.
	</DD><HR>
</DL>
<A NAME="lfindex7">&nbsp;</A>
<H3>Herramientas utilizadas para la construcci&oacute;n.</H3>

<DL>
	<DT><STRONG>PostgreSQL&nbsp;(<A HREF="http://www.postgresql.org/">http://www.postgresql.org</A>)</STRONG>
	</DT><DD>
	Manejador de base de datos, el cual fue elegido por su flexibilidad,
	poder&iacute;o y capacidad para manejar grandes vol&uacute;menes de
	datos.
	</DD><DT>
	<STRONG>Perl&nbsp;(<A HREF="http://www.perl.com/">http://www.perl.com</A>)</STRONG>
	</DT><DD>
	Lenguaje base para toda la programaci&oacute;n, el cual fue
	seleccionado por su gran expresividad y potencia, adem&aacute;s de
	considerarlo f&aacute;cil de dominar por cualquier persona con
	cierta experiencia en programaci&oacute;n.
	</DD><DT>
	<STRONG>M&oacute;dulo&nbsp;Tk&nbsp;(<A HREF="http://www.cpan.org/modules/by_module/Tk/tk_modlist.html">http://www.cpan.org/modules/by_module/Tk/tk_modlist.html</A>)</STRONG>
	</DT><DD>
	Funciones de perl para la interface de usuario. pTk es f&aacute;cil
	de programar y ofrece una amplia cantidad de widgets.
	</DD><DT>
	<STRONG>M&oacute;dulo&nbsp;DBI&nbsp;(<A HREF="http://www.fugue.com/dbi">http://www.fugue.com/dbi</A>)</STRONG>
	</DT><DD>
	Funciones de perl para el uso de bases de datos SQL. De muy alto
	nivel, ahorraron mucho tiempo de programaci&oacute;n.
	</DD><DT>
	<STRONG>M&oacute;dulo&nbsp;DBD::Pg&nbsp;(<A HREF="http://www.bawue.de/~mergl/mergl_DBD_Pg.html">http://www.bawue.de/~mergl/mergl_DBD_Pg.html</A>)</STRONG>
	</DT><DD>
	Manejador espec&iacute;fico DBI para postgreSQL.
	</DD><DT>
	<STRONG>Emacs&nbsp;(<A HREF="http://www.emacs.org/">http://www.emacs.org</A>)</STRONG>
	</DT><DD>
	Medio ambiente integrado para la programaci&oacute;n, prueba y
	depuraci&oacute;n de aplicaciones.
	</DD><DT>
	<STRONG>CVS&nbsp;(<A HREF="http://www.gnu.org/software/cvs/cvs.html">http://www.gnu.org/software/cvs/cvs.html</A>)</STRONG>
	</DT><DD STYLE="margin-bottom: 0.2in">
	Instrumento usado para la sincronizaci&oacute;n del c&oacute;digo de
	los prototipos y subprototipos, mucha de la labor de seguimiento de
	propuestas y revisiones hubiera sido imposible sin una herramienta
	como esta.
	</DD><HR>
</DL>
<A NAME="lfindex8">&nbsp;</A>
<H2>La aplicaci&oacute;n en s&iacute;.</H2>

<P STYLE="margin-bottom: 0in">Es dif&iacute;cil rese&ntilde;ar
brevemente una aplicaci&oacute;n tan especializada y densa. El
esquema o script para la creaci&oacute;n de la base de datos tiene
m&aacute;s de 1000 l&iacute;neas sql, y la aplicaci&oacute;n m&aacute;s
de 15,000 l&iacute;neas perl. As&iacute; que s&oacute;lo se
mencionar&aacute;n los aspectos m&aacute;s relevantes.
</P>
<HR>
<A NAME="lfindex9">&nbsp;</A>
<H3>La interface con el usuario.</H3>

<P>El punto m&aacute;s importante de est&aacute; aplicaci&oacute;n es
la interface de usuario. Para facilitar la labor del usuario se
decidi&oacute; un dise&ntilde;o lo m&aacute;s plano y sencillo
posible, en donde el experto en optometr&iacute;a se sienta c&oacute;modo
e identifique los elementos de informaci&oacute;n por sus
conocimientos en &oacute;ptica y no tanto por su experiencia en
c&oacute;mputo.
</P>
<P>Los elementos de la interface de usuario se agrupan en pesta&ntilde;as
siguiendo la met&aacute;fora de un cuaderno (ver siguiente figura). A
pesar de ser construida en un medio ambiente gr&aacute;fico, la
aplicaci&oacute;n no necesita del mouse para poder ser manejada. De
hecho con una combinaci&oacute;n de teclas se puede acceder a
cualquier pesta&ntilde;a o bot&oacute;n.
</P>
<P>Las pesta&ntilde;as que conforman la aplicaci&oacute;n son las
siguientes:
</P>
<DL>
	<DT><STRONG>Datos&nbsp;Generales</STRONG>
	</DT><DD>
	contiene el nombre del cliente, sus se&ntilde;as y buz&oacute;n de
	correo electr&oacute;nico.
	</DD><DT>
	<STRONG>Anteojos&nbsp;iniciales</STRONG>
	</DT><DD>
	resguarda la informaci&oacute;n de los anteojos con los que se
	present&oacute; por vez primera a la &oacute;ptica.
	</DD><DT>
	<STRONG>Antecedentes</STRONG>
	</DT><DD>
	consigna datos sobre las molestias &oacute;pticas, estado de salud,
	actividades del cliente y todo lo que es necesario saber para ubicar
	su problem&aacute;tica en cuanto a visi&oacute;n se refiere.
	</DD><DT>
	<STRONG>Ex&aacute;menes</STRONG>
	</DT><DD>
	donde se captan los resultados de las revisiones y mediciones
	&oacute;pticas de los clientes.
	</DD><DT>
	<STRONG>Lentes&nbsp;de&nbsp;contacto</STRONG>
	</DT><DD>
	el cual constituye todo un m&oacute;dulo dentro de la aplicaci&oacute;n,
	y en donde en una serie de subpesta&ntilde;as se realizan una serie
	de c&aacute;lculos necesarios para determinar el mejor lente de
	contacto para cada persona.
	</DD><DT>
	<STRONG>Recetas</STRONG>
	</DT><DD>
	contiene la especificaci&oacute;n final del anteojo, u orden de
	trabajo que se ha de remitir a la f&aacute;brica para su
	elaboraci&oacute;n.
	</DD><DT>
	<STRONG>Historiales</STRONG>
	</DT><DD>
	donde se consultan los ex&aacute;menes y ventas anteriores que se le
	han efectuado al cliente.
	</DD><DT>
	<STRONG>Ventas</STRONG>
	</DT><DD STYLE="margin-bottom: 0.2in">
	conexi&oacute;n con el m&oacute;dulo de ventas donde se elabora la
	factura y se realiza el cobro de anticipos y liquidaciones de las
	&oacute;rdenes de trabajo de cada cliente.
	</DD></DL>
<P STYLE="margin-bottom: 0in">
A continuaci&oacute;n se expondr&aacute;n los aspectos m&aacute;s
importantes relacionados con estos grupos de informaci&oacute;n.
</P>
<HR>
<H4>Datos Generales.</H4>
<P>Lo que se destaca en esta pesta&ntilde;a es la facilidad con la
que se pueden buscar y encontrar datos. Por ejemplo, se puede
introducir parte del nombre de la colonia, seleccionar un estado de
la lista e inmediatamente la aplicaci&oacute;n proveer&aacute; de una
lista con los c&oacute;digos postales (C.P.) que cumplan con esas dos
condiciones.
</P>
<P ALIGN=CENTER><IMG SRC="../../common/images/article145/dat_grales.png" NAME="Graphic3" ALIGN=BOTTOM WIDTH=474 HEIGHT=342 BORDER=0>
</P>
<P>En lugar de colonia pudo haberse seleccionado
Delegaci&oacute;n/Municipio, o ambas, en cuyo caso el sistema habr&iacute;a
provisto una lista m&aacute;s espec&iacute;fica.
</P>
<P>En la base de datos se encuentran cargados todos los c&oacute;digos
postales, colonias, delegaciones y municipios del pa&iacute;s en una
tabla de m&aacute;s de 60,000 renglones. En las b&uacute;squedas m&aacute;s
largas la aplicaci&oacute;n no tarda m&aacute;s de 3 segundos en
elaborar y presentar una lista de los c&oacute;digos postales.
</P>
<P STYLE="margin-bottom: 0in">Tales facilidades de b&uacute;squeda se
extienden a lo largo de toda la aplicaci&oacute;n. Si el usuario
desea encontrar a una persona llamada ``Juan'', pero no recuerda si
su Apellido es ``P&eacute;rez'' o ``Penas'', entonces escribir&aacute;
``Pe'' en el Apellido Paterno y ``Juan'' en el Nombre, oprimir&aacute;
el bot&oacute;n ``Buscar'' (o mejor a&uacute;n oprimir&aacute; la
combinaci&oacute;n de teclas Ctrl-B). El sistema le presentar&aacute;
una lista con todos los clientes de la base de datos que cumplan con
las condiciones solicitadas.
</P>
<HR>
<H4>Clientes en proceso.</H4>
<P>En cualquier parte de la aplicaci&oacute;n, se puede oprimir la
combinaci&oacute;n de teclas Ctrl-A, con las cuales se presenta una
ventana con los clientes que se est&aacute;n atendiendo en ese
preciso momento, permiti&eacute;ndose identificarlos por su nombre y
pudiendo acceder inmediatamente a cualquiera de sus datos.
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0in"><IMG SRC="../../common/images/article145/clientes_proceso.png" NAME="Graphic4" ALIGN=BOTTOM WIDTH=300 HEIGHT=188 BORDER=0>
</P>
<HR>
<H4>Antecedentes.</H4>
<P>Esta es una de las pesta&ntilde;as que m&aacute;s trabajo caus&oacute;
a los programadores, porque implic&oacute; efectuar modificaciones al
c&oacute;digo fuente de los widgets de pTk, en particular el frame de
``Revisiones de Medios Externos y Transparentes''.
</P>
<P ALIGN=CENTER><IMG SRC="../../common/images/article145/antecedentes.png" NAME="Graphic5" ALIGN=BOTTOM WIDTH=474 HEIGHT=342 BORDER=0>
</P>
<P>En dicho frame el usuario puede seleccionar cualquiera de las
revisiones que se ponen a su disposici&oacute;n, apareciendo a su
lado derecho otra lista con las anomal&iacute;as que se pueden dar,
tanto en el ojo derecho como en el izquierdo, para tal revisi&oacute;n.
</P>
<P ALIGN=CENTER><IMG SRC="../../common/images/article145/antece2.png" NAME="Graphic6" ALIGN=BOTTOM WIDTH=474 HEIGHT=342 BORDER=0>
</P>
<P STYLE="margin-bottom: 0in">Cuando el optom&eacute;trista activa el
``check button'' autom&aacute;ticamente aparece una cruz al lado
derecho de la etiqueta de la revisi&oacute;n que seleccion&oacute;
previamente. (&iquest;Alguien sabe si tal cosa se puede programar
f&aacute;cilmente, digamos en VB?).
</P>
<HR>
<H4>Ex&aacute;menes.</H4>
<P>En la pesta&ntilde;a de Examen se realizan una serie de
validaciones un poco complejas. Cuando el optometrista anota las
lecturas que arrojan cada uno de los instrumentos y toma la decisi&oacute;n
de la graduaci&oacute;n que ha de prescribir al cliente, entonces el
sistema valida las correlaciones que hay entre todos los datos y
avisa al usuario si existe alguna condici&oacute;n err&oacute;nea.
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0in"><IMG SRC="../../common/images/article145/examen.png" NAME="Graphic7" ALIGN=BOTTOM WIDTH=474 HEIGHT=342 BORDER=0>
</P>
<HR>
<H4>Lentes de contacto.</H4>
<P>&iexcl;Esta es la joya de la aplicaci&oacute;n!, es la parte del
c&oacute;digo que m&aacute;s discusiones y esfuerzos cost&oacute; al
equipo de desarrollo. Cuando una persona usa lentes de contacto no se
imagina la maravilla tecnol&oacute;gica que tiene puesta en sus ojos.
</P>
<P>Los lentes de contacto son como los zapatos. As&iacute; como no
hay dos pares de pies iguales en todo el mundo, tampoco hay dos pares
de ojos con id&eacute;nticos padecimientos visuales.
</P>
<P>La aplicaci&oacute;n est&aacute; dise&ntilde;ada para ayudar al
optometrista a determinar el tipo de lente de contacto m&aacute;s
viable para cada cliente. No es posible que la aplicaci&oacute;n
determine (o ``recete'') una graduaci&oacute;n de manera autom&aacute;tica,
ya que hay varias condicionantes ``no medibles'' que se han de tomar
en cuenta (como las asentadas en la pesta&ntilde;a de antecedentes).
Sin embargo puede servir como herramienta para evaluar el impacto de
determinados valores sobre la agudeza visual de cada ojo.
</P>
<P ALIGN=CENTER><IMG SRC="../../common/images/article145/calculo1_lc.png" NAME="Graphic8" ALIGN=BOTTOM WIDTH=474 HEIGHT=342 BORDER=0>
</P>
<P STYLE="margin-bottom: 0in">As&iacute; por ejemplo, para cierto
tipo de lente llamado t&oacute;rico, la aplicaci&oacute;n pone a
disposici&oacute;n del optometrista un medio para ensayar y corregir
la desviaci&oacute;n del eje del lente de contacto (esquina inferior
derecha de la figura anterior). Como ya hemos dicho, no hay dos ojos
iguales en todo el mundo, y cuando los lentes de contacto se colocan
en ellos sufren ciertos acomodamientos derivados de la curvatura de
la c&oacute;rnea, los cuales afectan a la graduaci&oacute;n final del
ojo en cuesti&oacute;n.
</P>
<HR>
<A NAME="lfindex10">&nbsp;</A>
<H3>Duplicaci&oacute;n de la base de datos v&iacute;a correo
electr&oacute;nico encriptado.</H3>

<P>Existen otros aspectos de la aplicaci&oacute;n que por su
singularidad son dignos de menci&oacute;n, uno de ellos es un
mecanismo de duplicaci&oacute;n de base de datos v&iacute;a internet,
el cual pretende la transmisi&oacute;n segura de los datos de todas
las &oacute;pticas para su concentraci&oacute;n en una enorme bodega
de datos residente en las computadoras de las oficinas ejecutivas.
</P>
<P>Dicho mecanismo esta implementado en una serie de m&oacute;dulos
que pueden ser conseguidos en cualquier espejo de CPAN, as&iacute;
como con c&oacute;digo escrito para el manejador de la base de datos
PostgreSQL, tal y como se aprecia en la siguiente figura:
</P>
<P ALIGN=CENTER><IMG SRC="../../common/images/article145/duplicacion.png" NAME="Graphic9" ALIGN=BOTTOM WIDTH=314 HEIGHT=441 BORDER=0>
</P>
<P STYLE="margin-bottom: 0in">De hecho esta implementaci&oacute;n
tiene tantos detalles interesantes, que se espera exponerlos en un
articulo futuro en Linux<font color="#FF0000">Focus</font>, esto es, si los editores nos dan nuevamente
la oportunidad. :-)
</P>
<HR>
<A NAME="lfindex11">&nbsp;</A>
<H3>Computadoras light.</H3>

<P>El &uacute;ltimo aspecto importante que se ha de mencionar es el
uso de clientes ligeros. Como se indic&oacute; al principio de este
art&iacute;culo, se requer&iacute;a que las computadoras empleadas en
la aplicaci&oacute;n ocupen el menor espacio f&iacute;sico posible.
Por ello se emprendi&oacute; la tarea de buscar la mejor opci&oacute;n
entre computadoras 486 usadas, computadoras con gabinetes slim,
ultra-slim y network computers.
</P>
<P>Las alternativas que resultaron m&aacute;s viables fueron:
</P>
<DL>
	<DT><STRONG>Computadoras&nbsp;con&nbsp;gabinete&nbsp;ultra-slim</STRONG>
		</DT><DD>
	Para las cuales se integr&oacute; una distribuci&oacute;n Linux que
	abarcara un s&oacute;lo disco (imagen del kernel m&iacute;nima y
	comprimida), con la configuraci&oacute;n de red b&aacute;sica y con
	un cliente vnc basado en svgalib. Dicho disco de arranque habilita
	computadoras 486 en adelante como unidades de despliegue gr&aacute;fico,
	no requiriendo disco duro y funcionando con apenas 8MB de memoria
	RAM.
	</DD><DT>
	<STRONG>Network&nbsp;computers</STRONG>
	</DT><DD STYLE="margin-bottom: 0.2in">
	Sin disco ni floppy, con arranque remoto v&iacute;a DHCP y basadas
	en procesador PowerPC. Aunque el modelo espec&iacute;fico del
	procesador a&uacute;n estaba en pruebas para Linux cuando se tuvo
	que tomar la decisi&oacute;n, existe una imagen de kernel disponible
	por ftp (tal y como se menciona en el HowTo de las NetStation).
	</DD></DL>
<P>
Como el factor cr&iacute;tico es el espacio f&iacute;sico se
eligieron las Network Computers con monitores SVGA de 9 pulgadas, ya
que sus dimensiones (19.05 x 26.67 x 3.18 cm) permiten ubicarlas
hasta en cualquier caj&oacute;n de los aparadores.
</P>
<P>La experiencia respecto a los clientes ligeros tambi&eacute;n esta
repleta de detalles interesantes, por lo que se propone describirla
en un futuro articulo en Linux<font color="#FF0000">Focus</font>, si es que los editores nos conceden su
venia.
</P>
<HR>
<A NAME="lfindex12">&nbsp;</A>
<H2>Honor a quien honor merece.</H2>

<P>S&oacute;lo resta reconocer la labor de todos aquellos que con su
creatividad y esfuerzo hicieron posible que la aplicaci&oacute;n de
atenci&oacute;n de clientes se basara completamente en Linux:
</P>
<P>Citlali Calder&oacute;n de Anda: <A HREF="mailto:citlali@galois.fciencias.unam.mx">citlali@galois.fciencias.unam.mx
</A>
</P>
<P>Liliana Araceli Cabello: <A HREF="mailto:liliana@galois.fciencias.unam.mx">liliana@galois.fciencias.unam.mx
</A>
</P>
<P>Juan Jos&eacute; Alba
</P>
<P>Edgar Ra&uacute;l Acosta Villase&ntilde;or:
<A HREF="mailto:edgar@galois.fciencias.unam.mx">edgar@galois.fciencias.unam.mx
</A>
</P>
<P>Gunnar Wolf: <A HREF="mailto:gwolf@chmd.edu.mx">gwolf@chmd.edu.mx </A>
</P>
<P>Roberto Andrade Fonseca: <A HREF="mailto:randrade@abl.com.mx">randrade@abl.com.mx
</A>
</P>
<P>Existen partes de c&oacute;digo que creemos que pueden ser de
inter&eacute;s general para la comunidad, tales como las
modificaciones hechas a los widgets de pTk, la implementaci&oacute;n
para enviar e-mails encriptados desde perl, los programas para la
sincronizaci&oacute;n y duplicaci&oacute;n de bases de datos
PostgreSQL, as&iacute; como las im&aacute;genes de discos de arranque
para despliegue gr&aacute;fico. Todo ello se podr&aacute; encontrar
en la siguiente direcci&oacute;n:
<A HREF="http://www.pochtecah.org.mx/ABL_GNU.html">http://www.pochtecah.org.mx/ABL_GNU.html</A>.
</P>



<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=145&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Juan Pablo Rosas Duran, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article145.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<!-- OLD FORMAT, NO TRANSLATION INFO -->
</TR></TABLE></CENTER>
<p><font size=1>2001-01-05, generated by lfparser version 2.1</font></p>
</BODY>
</HTML>
