<HTML>
<HEAD>
<TITLE>COMO Usar el sistema de Impresi&oacute;n en Linux: Respuestas a preguntas frecuentes</TITLE>
</HEAD>
<BODY>
<A HREF="Uso-Impresion-Como-3.html">Anterior</A>
<A HREF="Uso-Impresion-Como-5.html">Siguiente</A>
<A HREF="Uso-Impresion-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Respuestas a preguntas frecuentes</A></H2>


<P>P1.   C&oacute;mo puedo prevenir el efecto de escalera (<I>staircase effect</I>)?</P>
<P>R1. El efecto de escal&oacute;n ocurre por la manera en que algunas impresoras esperan
que se acaben las l&iacute;neas. Algunas impresoras quieren l&iacute;neas que terminen con 
un retorno_de_carro/avance_de_l&iacute;nea <I>CR/LF</I> (estilo DOS) en lugar de con
la secuencia por defecto de los sistemas tipo UNIX (s&oacute;lo un avance de l&iacute;nea, <I>LF</I>). 
La manera m&aacute;s sencilla de solucionar esto es mirar si tu impresora puede 
conmutar entre ambos estilos de alguna manera (un interruptor DIP o mandando 
una secuencia de escape). Para hacer la segunda necesitas crear un filtro (ver 
P2 y Foster95b).</P>
<P>Una forma r&aacute;pida de arreglarlo es usar un filtro en la l&iacute;nea de comandos. un 
ejemplo de esto podr&iacute;a ser</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ cat tesis.txt | todos | lpr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>P2.  Qu&eacute; es un filtro?</P>
<P>R2. Un filtro es un programa que lee de la entrada est&aacute;ndar (<CODE>stdin</CODE>), realiza 
alguna acci&oacute;n sobre esa entrada, y escribe en la salida est&aacute;ndar (<CODE>stdout</CODE>). Los 
filtros se usan para mont&oacute;n de cosas, incluyendo el procesado de textos.</P>
<P>P3.  Qu&eacute; es un filtro m&aacute;gico?</P>
<P>R3. Un filtro m&aacute;gico es un filtro que realiza una acci&oacute;n basada en el tipo de 
un fichero. Por ejemplo, si el fichero es puro texto, entonces simplemente 
imprimir&aacute; el fichero usando los m&eacute;todos normales. Si el fichero es PostScript, 
o cualquier otro formato, podr&iacute;a imprimirlo usando otro m&eacute;todo (ghostscript).</P>


<HR>
<A HREF="Uso-Impresion-Como-3.html">Anterior</A>
<A HREF="Uso-Impresion-Como-5.html">Siguiente</A>
<A HREF="Uso-Impresion-Como.html#toc4">Indice</A>
</BODY>
</HTML>
