<HTML>
<HEAD>
<TITLE>COMO Usar el sistema de Impresi&oacute;n en Linux: Referencias</TITLE>
</HEAD>
<BODY>
<A HREF="Uso-Impresion-Como-5.html">Anterior</A>
<A HREF="Uso-Impresion-Como-7.html">Siguiente</A>
<A HREF="Uso-Impresion-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Referencias</A></H2>


<P>Esta es una secci&oacute;n de referencias sobre el sistema de impresi&oacute;n Linux. He 
intentado mantener la secci&oacute;n de referencias de este COMO lo m&aacute;s concentrada 
posible. Si crees que he olvidado alg&uacute;n tema significativamente importante, 
por favor no dudes en contactar conmigo.</P>
<P>Antes de que mandes tu pregunta a un grupo <B>USENET</B>, considera lo siguiente:</P>
<P>
<UL>
<LI>Est&aacute; la impresora aceptando trabajos? (usa <CODE>lpc(8)</CODE> para verificarlo)</LI>
<LI>Est&aacute; la respuesta a tu pregunta cubierta en este COMO , o en el COMO Configurar la Impresi&oacute;n (<I>Printing Setup HOWTO</I>)?

Si contestas 's&iacute;' a alguna de estas dos cosas, deber&iacute;as pensarlo dos veces
antes de enviar tu pregunta. Y cuando finalmente env&iacute;es el mensaje a un
grupo de noticias, incluye toda la informaci&oacute;n pertinente. Intenta no
decir s&oacute;lo algo como <I>"Estoy teniendo problemas con</I> <CODE>lpr</CODE>,
<I>por favor ayuden."</I> Este tipo de mensajes ser&aacute;n ignorados. Adem&aacute;s
intenta incluir la versi&oacute;n del kernel que est&aacute;s ejecutando, cu&aacute;ndo ocurri&oacute;
el error y el mensaje de error espec&iacute;fico que devolvi&oacute; el sistema (si lo
hizo).  </LI>
<LI>Welsh, Matt.  <I>Linux Installation and Getting
Started</I>
<SL>Disponible en castellano merced al grupo LuCAS como
<I>Linux, Instalaci&oacute;n y Primeros Pasos</I> (<I>LIPP</I>), consultar anexo
referente a grupos LiNUXeros en Espa&ntilde;a</SL>
 Un excelente texto
introductorio para el principiante.  
</LI>
<LI>Foster, Matt.  <I>Linux Printing Setup HOWTO</I>
<SL>Disponible
en castellano igualmente</SL>
, ver secci&oacute;n 
<A HREF="Uso-Impresion-Como-8.html#Grupos">Grupos</A>El
suplemento a este COMO; cubre temas tales como preparar y configurar el
software de impresi&oacute;n.
</LI>
</UL>
</P>
<P>P&aacute;ginas del Manual:
<UL>
<LI><CODE>cat(1)</CODE> Concatena e imprime ficheros</LI>
<LI><CODE>dvips(1)</CODE> Convierte un fichero TeX DVI a PostScript</LI>
<LI><CODE>ghostview(1)</CODE> Previsualiza ficheros PostScript usando Ghostscript</LI>
<LI><CODE>groff(1)</CODE> Front-end para el sistema de formateo groff</LI>
<LI><CODE>gs(1)</CODE> Int&eacute;rprete/Visor Ghostscript</LI>
<LI><CODE>lpc(8)</CODE> Programa de control de la impresora de l&iacute;neas</LI>
<LI><CODE>lpd(8)</CODE> Demonio del spool de la impresora de l&iacute;neas</LI>
<LI><CODE>lpq(1)</CODE> Examina la cola de impresi&oacute;n</LI>
<LI><CODE>lpr(1)</CODE> Impresor <I>off-line</I></LI>
<LI><CODE>lprm(1)</CODE> Elimina trabajos de la cola de impresi&oacute;n</LI>
<LI><CODE>pr(1)</CODE> Convierte ficheros de texto para imprimir</LI>
<LI><CODE>tex(1)</CODE> Formateo y tipado de texto</LI>
</UL>
</P>
<P>Grupos de noticias de USENET</P>
<P>
<UL>
<LI><CODE>comp.os.linux.*</CODE>: Much&iacute;sima informaci&oacute;n sobre Linux</LI>
<LI><CODE>comp.unix.*</CODE>: Debates relacionados con el UNIX</LI>
</UL>
</P>

<HR>
<A HREF="Uso-Impresion-Como-5.html">Anterior</A>
<A HREF="Uso-Impresion-Como-7.html">Siguiente</A>
<A HREF="Uso-Impresion-Como.html#toc6">Indice</A>
</BODY>
</HTML>
