<HTML>
<HEAD>
<TITLE>COMO Usar el sistema de Impresi&oacute;n en Linux: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Uso-Impresion-Como-2.html">Siguiente</A>
<A HREF="Uso-Impresion-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P><B>* Nota del traductor.</B> A partir de ahora usar&eacute; el verbo <I>bajar</I> para
traducir el ingl&eacute;s <I>download</I>, ya que aunque no es literalmente correcto,
es la forma en que m&aacute;s lo he escuchado a otros usuarios espa&ntilde;oles y es la que
yo mismo uso.</P>
<P>Este documento describe c&oacute;mo usar el sistema de <I>spooling</I> para impresoras de
l&iacute;neas que provee el sistema operativo Linux. Si est&aacute;s buscando una gu&iacute;a para 
poner a punto tu entorno de impresi&oacute;n, por favor, lee el 
<I>Linux Printing Setup HOWTO</I>.</P>

<H2><A NAME="ss1.1">1.1 Hist&oacute;rico de este COMO</A></H2>


<P>Esta versi&oacute;n de este COMO es una reescritura completa del original escrito por 
Grant Taylor <CODE>
<A HREF="mailto:grant@god.tufts.edu">grant@god.tufts.edu</A></CODE> 
y Brian McCauley <CODE>
<A HREF="mailto:B.A.McCauley@bhan.ac.uk">B.A.McCauley@bhan.ac.uk</A></CODE> 
He intentado mantener el material presentado por el COMO De Grant y Brian, 
pero he modificado dr&aacute;sticamente el estilo de presentaci&oacute;n y la profundidad de 
los temas tratados. Me parece que esto hace el COMO m&aacute;s completo y f&aacute;cil de 
leer. S&oacute;lo puedo esperar que est&eacute;s de acuerdo.</P>



<H2><A NAME="ss1.2">1.2 Copyrights y Marcas registradas</A></H2>


<P>Algunos nombres mencionados en este COMO est&aacute;n registrados en copyrights y/o 
est&aacute;n reclamados como Marcas registradas de ciertas personas y/o compa&ntilde;&iacute;as. 
Dichos nombres aparecen con la inicial o el nombre completo en may&uacute;sculas en 
este COMO.</P>
<P><B>El COMO Usar la Impresora en Linux v1.0 (c) 1995 Matt Foster.</B></P>
<P>A menos que se diga otra cosa, cada autor de documentos COMO de Linux tiene el 
copyright de los que haya escrito. Estos documentos pueden ser reproducidos y 
distribuidos totalmente o en parte, en cualquier medio f&iacute;sico o electr&oacute;nico, 
mientas ese aviso de copyright se mantenga en todas las copias. La 
redistribuci&oacute;n comercial est&aacute; permitida y alentada; sin embargo, al autor le 
gustar&iacute;a que se le notificasen dichas distribuciones.</P>
<P>Todas las traducciones, trabajos derivados o trabajos agregados que incorporen 
cualquier documento COMO de Linux deben ser cubiertos bajo este aviso de 
copyright. Esto es, no puedes producir trabajos derivados de un COMO e imponer 
restricciones adicionales en su distribuci&oacute;n. Se pueden admitir excepciones a 
estas reglas bajo ciertas condiciones; por favor contacte con el coordinador 
de los COMO de Linux en la direcci&oacute;n que aparece m&aacute;s abajo.</P>
<P>En resumen, deseamos promocionar la diseminaci&oacute;n de esta informaci&oacute;n a trav&eacute;s 
de cuantos canales sea posible. De todas maneras, queremos retener el copyright
de los documentos COMO, y nos gustar&iacute;a ser notificados de cualquier plan para 
redistribuir los COMOs.</P>
<P>Si tienes cualquier pregunta, por favor contacta con Greg Hankins, el 
coordinador de los <I>HOWTO</I> de Linux, en <CODE>
<A HREF="mailto=gregh@sunsite.unc.edu">gregh@sunsite.unc.edu</A></CODE>. Puedes hacer un <CODE>finger</CODE> a esta direcci&oacute;n 
para averiguar el n&uacute;mero de tel&eacute;fono e informaci&oacute;n adicional de contacto.</P>


<H2><A NAME="ss1.3">1.3 Obteniendo los COMOs sobre Imprimir en Linux</A></H2>


<P>Te recomiendo que si quieres imprimir una copia de este COMO que hayas bajado 
la versi&oacute;n PostScript. Est&aacute; formateada de manera m&aacute;s est&eacute;tica y sencilla de 
leer. Puedes obtener la versi&oacute;n Postscript desde alguno de los muchos '<I>sites</I>' de distribuci&oacute;n de Linux (como <B>SunSITE</B>, <CODE>
<A HREF="ftp://sunsite.unc.edu/Linux/docs/Howtos/">ftp://sunsite.unc.edu/Linux/docs/Howtos/</A></CODE>), o 
directamente desde mi p&aacute;gina <I>World Wide Web</I> en <CODE>
<A HREF="http://www.engr.uark.edu/~mwf/pht/">http://www.engr.uark.edu/~mwf/pht/</A></CODE></P>


<H2><A NAME="ss1.4">1.4 Sugerencias, cr&iacute;ticas y aportaciones</A></H2>


<P>Las preguntas, comentarios o correcciones para este COMO deben ser dirigidas a 
<CODE>
<A HREF="mailto:mwf@engr.uark.edu">mwf@engr.uark.edu</A></CODE></P>


<H2><A NAME="ss1.5">1.5 Reconocimientos</A></H2>


<P>Gracias a toda la gente que apart&oacute; el tiempo necesario para leer la versi&oacute;n 
alfa de ese COMO y respondi&oacute; con multitud de comentarios y sugerencias que ayudaron 
mucho (algunos podr&eacute;is ver vuestros comentarios reflejados en la versi&oacute;n)</P>
<P>Me gustar&iacute;a tambi&eacute;n agradecer a Grant y Brian por la gran cantidad de 
informaci&oacute;n que me han dado durante la transici&oacute;n de autor&iacute;a.</P>



<HR>
Anterior
<A HREF="Uso-Impresion-Como-2.html">Siguiente</A>
<A HREF="Uso-Impresion-Como.html#toc1">Indice</A>
</BODY>
</HTML>
