<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.17">
 <META NAME="LFCATEGORY" CONTENT="Kernel Corner">
<!-- this is used be a number of tools:
 =LF=AUTHOR: Subhasish Ghosh
 =LF=CAT___: Kernel Corner
 =LF=TITLE_: Compilar, configurar e instalar un Kernel de Linux Personalizado comletamente operativo
 =LF=NUMBER: 209
 =LF=ANAME_: article209.html
 -->
 <TITLE>lf209, Kernel Corner: Compilar, configurar e instalar un Kernel de Linux Personalizado comletamente operativo</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD">Home</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD">Map</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD">Index</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD">Search</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">News</FONT></A> </TD>
           <TD><FONT color="#FFFFFF">|</FONT> </TD>
           <TD><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Archives</FONT></A> </TD>
           <TD><FONT color="#FFFFFF">|</FONT> </TD>
           <TD><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Links</FONT></A> </TD>
           <TD><FONT color="#FFFFFF">|</FONT> </TD>
           <TD><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">About LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/SubhasishGhosh.gif" width="120" height="148">
<BR>by  <A href="mailto:auspicious_blessingsindia&#64;hotmail.com">Subhasish Ghosh</A>
<BR><BR>
<I>About the author:</I><BR>
<p>Mi nombre es Subhasish Ghosh, tengo 20 a&ntilde;os, y actualmente vivo en India. Soy estudiante de
ingenier&iacute;a en sistemas inform&aacute;ticos as&iacute; como un profesional de la inform&aacute;tica. Actualmente poseo
6 Certificados Microsoft Certified Professional (MCP), y tambi&eacute;n un Certificado Microsoft Certified
Professional en NT 4.0 Track. He trabajado con Linux durante mucho tiempo, especialmente con
Red Hat Linux. Actualmente me estoy preparando para el ex&aacute;men de Ingeniero Certificado de Red Hat
(RHCE) y en el futuro pienso trabajar principalmente sobre Linux.</p>
<BR><i>Content</i>:
<UL>
  <LI><A HREF="#209lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#209lfindex1">Los pasos</A></LI>
  <LI><A HREF="#209lfindex2">El resultado</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=209&lang=en">Talkback form for this article</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Compilar, configurar e instalar un Kernel de Linux Personalizado comletamente operativo</H2>
 <IMG src="../../common/images/illustration209.gif" hspace="30" width="241" height="249" alt="[illustration]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Abstract</i>:
<P>
<p>Hola a todos, este art&iacute;culo proporciona una informaci&oacute;n muy detallada y un proceso paso a paso
describiendo c&oacute;mo compilar, configurar y posteriormente instalar un kernel Red Hat Linux personalizado.
Como todos sabemos, un kernel personalizado es necesario por muchas razones, y no me gustar&iacute;a entrar
en esos detalles farragosos. S&oacute;lo mostrar&eacute; c&oacute;mo compilar, configurar e instalar un Kernel personalizado.
Aunque los pasos mencionados m&aacute;s abajo est&aacute;n orientados fundamentalmente a los usuarios de Red
Hat Linux, el mismo procedimiento se aplica a los usuarios de otras distribuciones de Linux,
aunque naturalmente, con unas peque&ntilde;as modificaciones cuando sea necesario.</p></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="209lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

<p>Esta es una gu&iacute;a para compilar el Kernel de Linux en 27 pasos. Yo he llevado a cabo
todos los pasos comentados m&aacute;s abajo sobre un sistema inform&aacute;tico con la siguiente configuraci&oacute;n:
Compaq Presario 4010 Series, 15.5 GB de espacio en disco duro, 96 MB RAM, procesador Intel Celeron
400 MHz, distribuci&oacute;n Red Hat Linux 7.0 con kernel subyacente: <strong>2.2.16-22</strong>. Nuestro
objetivo deber&iacute;a ser obtener un <strong>Kernel Personalizado</strong> completamente operativo tras
completar los pasos que se detallan posteriormente, por ejemplo, yo tengo un Kernel Personalizado
al que he denominado &quot;2.2.16-22ghosh&quot; corriendo en mi sistema (porque mi nombre es
Subhasish Ghosh, usted podr&iacute;a tener cualquier otra cosa, de hecho podr&iacute;a tener un par de ellos
corriendo simult&aacute;neamente). Por lo tanto, feliz compilado de Kernel Linux.</p>

<A NAME="209lfindex1">&nbsp;</A>
<H2>Los pasos</H2>


<p>Paso 1: Registrarse como &quot;<strong>root</strong>&quot; y continuar con los soguientes
pasos.</p>

<p>Paso 2: En el prompt, teclear: <strong>rpm -q
kernel-headers kernel-source make dev86</strong></p>

<p>Paso 3: Si estos RPMs ya est&aacute;n instalados, saltar al paso 4. Si no, montar el CD-ROM de Red
Hat Linux y ejecutar un rpm -Uvh para instalar estos RPMs</p>

<p>Paso 4: Si tiene un sistema X Window, teclee <strong>startx</strong> en el prompt. Si no
tiene un sistema X Window configurado, le recomendar&iacute;a personalmente que lo tuviera antes de
continuar, ya que ser&iacute;a extremadamente beneficioso. Si el sistema X Window NO est&aacute; configurado,
teclee config o make menuconfig en la l&iacute;nea de comandos. Por favor, tenga en cuenta que he
asumido que tiene un sistema X Window corriendo en su sistema, y por esa raz&oacute;n teclee simplemente
startx.</p>

<p>Paso 5: Una vez dentro de entorno GNOME, abra el Terminal GNOME y teclee: <strong>cd /usr/src/linux</strong>
y pulse enter.</p>

<p>Paso 6: Desde /usr/src/linux, teclee <strong>make xconfig</strong>. </p>

<p>Paso 7: La versi&oacute;n GUI de make config aparecer&aacute; en la pantalla. Le ofrecer&aacute; varias opciones
para obtener un Kernel Personalizado.</p>

<p>Paso 8: Ahora, le recomendar&iacute;a que dejara, por el momento, la mayor&iacute;a de las opciones tal y
como est&aacute;n.
La configuraci&oacute;n por defecto es bastante pesada. Por otra parte, es probablemente una que funciona
en todas las computadoras. Mi recomendaci&oacute;n es que primero finalice los pasos para aprender c&oacute;mo
funciona el proceso. Despu&eacute;s puede usted familiarizarse con el hardware de su propia computadora
y sus caracter&iacute;sticas para obtener la suficiente experiencia y poder modelar su kernel para llegar
a un peque&ntilde;o y &oacute;ptimo kernel. Un buen lugar para aprender m&aacute;s sobre las cosas internas de su PC
son los ficheros en /proc como /proc/pci, /proc/interrupts, /proc/modules etc ...
Para el prop&oacute;sito de este experimento, simplemente asegurese de realizar los siguiente cambios: </p>

<p>1.<strong><u>Tipo y caracter&iacute;sticas del procesador</u></strong>: Elija el procesador correcto
dependiendo de si usted est&aacute; trabajando sobre un Pentium II, III, o un Intel Celeron como yo. Por
ejemplo, yo hice lo siguiente: Familia de procesadores: PPro/686MX, M&aacute;xima memoria f&iacute;sica: 1 GB,
Emulaci&oacute;n matem&aacute;tica: si, MTRR: si, SMO: si.</p>

<p>2.Abra el di&aacute;logo <strong><u>Filesystems</u></strong> y haga los siguientes cambios: Por ejemplo
yo hice: soporte fs FAT DOS: si (y), soporte fs MSDOS: si(Y), UMSDOS: m, soporte UFAT(Windows 95):
si(y), soporte de sistema de ficheros NTFS(s&oacute;lo lectura): si(y), soporte de lectura-escritura en
NTFS (PELIGROSO): No(n). Tras realizar estos cambios, por favor, aseg&uacute;rese de que no ha cambiado
los otros en el proceso. Todos los cambios mencionados anteriormente son bastante inofensivos y
no causar&aacute;n ning&uacute;n da&ntilde;o a su Kernel Linux. </p>

<p>3.Salvar y salir del di&aacute;logo principal. </p>

<p>Paso 9: Ahora, ejecutar <strong>ls -al</strong> desce el path: /usr/src/linux.</p>

<p>Paso 10: Estoy seguro de que puede ver un fichero llamado:
&quot;<strong>Makefile</strong>&quot;. Es un fichero extremadamente importante para el proceso
completo de la compilaci&oacute;n. Por lo tanto, aseg&uacute;rese de que crea un backup de este fichero
utilizando: <strong>cp Makefile Makefile.bak</strong></p>

<p>Paso 11: Ahora haga: (desde /usr/src/linux) <strong>vi
Makefile</strong>.</p>

<p>Paso 12: Vaya a la l&iacute;nea <strong>EXTRAVERSION</strong> y c&aacute;mbiela por algo como esto, por ejemplo
yo cambi&eacute; EXTRAVERSION=-22, por EXTRAVERSION=&quot;-22ghosh&quot;. Es usted libre de llamarlo
de la forma que quiera. </p>

<p>Paso 13: Salvelo y cierre el fichero.</p>

<p>Paso 14: Todos los pasos siguientes deben ejecutarse desde: /usr/src/linux. Teclee:
<strong>make dep clean</strong>, y pulse enter.</p>

<p>Paso 15: Entonces teclee: <strong>make bzImage modules</strong>. Esto llevar&aacute; alg&uacute;n tiempo,
vaya a tomarse algo mientras compila los ficheros necesarios. Yo normalmente me echo una
cabezada durante este tiempo, ya que suelo hacer estas cosas en medio de la noche.</p>

<p>Paso 16: Tras terminar este paso, un fichero &quot;<strong>bzImage</strong>&quot; se crear&aacute; en el directorio
/usr/src/linux/arch/i386/boot, simplemente vaya a este directorio y compruebe si ha aparecido
otro fichero llamado &quot;bzImage&quot; o no. SI Y SOLO SI todos los pasos de la compilaci&oacute;n
se han ejecutado correctamente y todas las opciones que hemos elegido en make xconfig son correctas,
este fichero ser&aacute; creado. Si encuentra usted este fichero, y estoy seguro de que lo har&aacute;, bien,
ya puede empezar a disfrutar, porque ha ganado el 75% de la batalla. Si usted no puede ver este
fichero, lo siento pero ha debido de cometer alg&uacute;n error en alg&uacute;n lugar, t&oacute;mese un respiro y
repita todos los pasos desde el principio. Estoy seguro de que lo conseguir&aacute;.</p>

<p>Paso 17: Teclee (desde /usr/src/linux): <strong>cp ./arch/i386/boot/bzImage
/boot/vmlinuz-2.2.16-22ghosh</strong> y pulse enter.</p>

<p>Paso 18: Ahora teclee: <strong>cp System.map /boot/System.map-2.2.16-22ghosh</strong>
<br>Aunque no es obligatorio, le recomendar&iacute;a que salvase el fichero de configuraci&oacute;n del kernel
(/usr/src/linux/.config) para que tenga una referencia para construir m&aacute;s kernels posteriormente
sin tener que volver a configurar todo de nuevo. La ventana de configuraci&oacute;n gr&aacute;fica (make xconfig)
ofrece la posibilidad de cargar un fichero de configuraci&oacute;n. Para salvar el fichero de
configuraci&oacute;n, teclee:<br><strong>cp /usr/src/linux/.config /boot/Config-2.2.16-22ghosh</strong></p>

<p>Paso 19: Entonces teclee: <strong>make modules_install</strong> y pulse enter. Ver&aacute; que todos
los m&oacute;dulos se instalan en un nuevo directorio personalizado. </p>

<p>Paso 20: Ahora teclee: <strong>mkinitrd /boot/initrd-2.2.16-22ghosh.img 2.2.16-22ghosh</strong></p>

<p>Paso 21: A continuaci&oacute;n teclee: <strong>vi /etc/lilo.conf</strong> y a&ntilde;ada la siguiente
entrada: </p>

<p><strong>image=/boot/vmlinuz-2.2.16-22ghosh </strong></p>

<blockquote>
    <p><strong>label=GhoshKernel<br>
    initrd=/boot/initrd-2.2.16-22ghosh.img<br>
    root=/dev/hdc5<br>
    read-only</strong></p>
</blockquote>

<p>Paso 22: Salve y salga. Por favor, tenga en cuenta que puede cambiar las entradas en el fichero
lilo.conf como deseee y la raiz deber&iacute;a ser la raiz en su sistema; en mi m&aacute;quina est&aacute; en
 /dev/hdc5. Entonces, inserte la informaci&oacute;n de su propio sistema. El comando <br><strong>df | grep '/$'</strong> <br>
le dir&aacute; d&oacute;nde est&aacute; la raiz de su sistema de ficheros. Tenga en cuenta las comillas simplesen la
expresi&oacute;n que sigue a grep.
</p>

<p>Paso 23: Teclee: <strong>/sbin/lilo -v -v</strong></p>

<p>Paso 24: Lea toda la informaci&oacute;n en la pantalla. Si no ha ocurrido ning&uacute;n error, bien, ya est&aacute;
todo el trabajo hecho. &iexcl;&iexcl;&iexcl;&iexcl;Felicidades!!!!</p>

<p>Paso 25: Rearranque el sistema tecleando: <strong>/sbin/reboot</strong> o
<strong>/sbin/shutdown -r now</strong>.</p>

<p>Paso 26: En la pantalla de arranque , pulse Tab (o Control-X, si tiene usted la pantalla de
arranque LILO), y podr&aacute; ver la entrada:&quot;GhoshKernel&quot; junto con las otras entradas que
ya exist&iacute;an.</p>

<p>Paso 27: Teclee: GhoshKernel y pulse enter. El completamente operativo Kernel personalizado
se ver&aacute; arrancar en su sistema. De manera que, ya tiene un Kernel Personalizado completamente
operativo trabajando sobre su sistema. </p>

<A NAME="209lfindex2">&nbsp;</A>
<H2>El resultado</H2>

<p>Observe el proceso de arranque, los mensajes en la pantallas y compruebe si hay errores.
Posteriormente, compruebe tambi&eacute;n los mensajes en el fichero /var/log/boot.log y el comando dmesg.
Si no hay errores, bien, el kernel trabaja perfectamente en su hardware. &iexcl;&iexcl;Muy bien!!</p>

<p>Tras loguearse de nuevo, teclee:<strong>uname -a</strong> y pulse enter. Usted puede ver la
siguiente entrada en la pantalla: <strong><u>2.2.16-22ghosh</u></strong> seguido por la fecha de
compilaci&oacute;n y alguna informaci&oacute;n m&aacute;s. Esto prueba que est&aacute; corriendo un Kernel Personalizado. Y
esto es todo. Recuerde tambi&eacute;n que puede tener todas las versiones de Kernel que desee. En caso
de que esto no funcione o encuentra problemas, no dude en enviarme un correo electr&oacute;nico a
<a href="mailto:auspicious_blessingsindia@hotmail.com">auspicious_blessingsindia@hotmail.com</a>
para preguntas y sugerencias. Me gustar&iacute;a mucho tener noticias suyas y ayudarles, y espero que
este art&iacute;culo ayude a todo el mundo que quiera tener un Kernel Personalizado completamente
operativo. Cu&iacute;dense.<br>
Subhasish Ghosh</p>



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback form for this article</h2>
Every article has its own talkback page. On this page you can submit a comment or look at comments from other readers:
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=209&lang=en"><b>&nbsp;talkback page&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Webpages maintained by the LinuxFocus Editor team</A>
<BR><FONT COLOR="#FFFFFF">&copy; Subhasish Ghosh, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=en&article=article209.html" target="_TOP">Click here to report a fault or send a comment to LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:auspicious_blessingsindia&#64;hotmail.com"><FONT COLOR="#FFFFFF">Subhasish Ghosh</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:bblanco&#64;crvasca.com"><FONT COLOR="#FFFFFF">Bego&ntilde;a Blanco</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-07-23, generated by lfparser version 2.17</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
