<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>lf148, System Administration: P&aacute;ginas Amarilla, 1ª parte</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Home" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Map" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Index" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Search" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="News" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Archives" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Links" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="About LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-en.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-en.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Frederic_Raynal.png" alt=
    "[Photo of the Author]" height="147" width="126">
<BR>by  <A href="mailto:pappy@users.sourceforge.net">Fr&eacute;d&eacute;ric Raynal</A>
<BR><BR>
<I>About the author:</I><BR>
<A href="mailto:pappy@users.sourceforge.net">Actualmente Fr&eacute;d&eacute;ric
    Raynal</A> est&aacute; escribiendo su tesis en inform&aacute;tica en <A href=
    "http://www.inria.fr">INRIA</A>. Le gusta leer (tanto Tolkien com Balzac) y escuchar m&uacute;sica
    (desde Mozart a Philip Glass y desde Led Zeppelin a Massive Attack, pasando por Bj&ouml;rk y
    Boris Vian, pero evitando cuidadosamente el rap, techno y esos tipos de ruido ;-)

    
<BR><i>Content</i>:
<UL>
  <LI><A HREF="#lfindex0">Estructura</A></LI>
  <LI><A HREF="#lfindex1">Los mapas</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=148&lang=en">Talkback form for this article</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>P&aacute;ginas Amarilla, 1ª parte</H2>
 <IMG src="../../common/images/illustration148.gif" alt=
    "[Illustration]" hspace="10" height="90" width="100">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Abstract</i>:
<P>


    El <I>Servicio de Informaci&oacute;n de Red</I> (NIS: Network Information Service) almacena una base
de datos en un servidor. Cada m&aacute;quina en la red sobre la que corre un cliente NIS puede lanzar
consultas al servidor para obtener informaci&oacute;n como login, nombre, contrase&ntilde;a, informaci&oacute;n sobre
grupos de usuarios,...Esto permite una gesti&oacute;n centralizada de un gran n&uacute;mero de m&aacute;quinas (especialmente
cuando se utilizan conjuntamente con un sistema de archivos en red distribuido como NFS) ya que los
cambios en esta informaci&oacute;n pasar&aacute; desde el servidor a todos sus clientes.

    </P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <H1>Introducci&oacute;n</H1>

    <P>El <I>Servicio de Informaci&oacute;n de Red</I> (NIS: Network Information Service) fue inicialmente
creado por Sun y conocido como las <I>P&aacute;ginas Amarillas Sun</I> (m&aacute;s usualmente como simplemente
las <I>P&aacute;ginas Amarillas</I> o YP (Yellow Pages). Esto, sin embargo, es una marca registrada de
Brittish Telecom y en consecuencia no puede ser utilizado sin los permisos adecuados. Estas
<I>P&aacute;ginas Amarillas</I> se refieren a las mismas que conocemos para buscar n&uacute;meros de tel&eacute;fono.</P>

<P>Los servidores NIS mantienen copias de los ficheros de configuraci&oacute;n comunes de varias de la
red en una base de datos. Los clientes NIS dirigen sus peticiones a los servidores en lugar de
utilizar sus propios ficheros de configuraci&oacute;n.</P>

<P>Supongan que son un usuario en la red que desea cambiar su password. Primero imaginen que YP
no est&aacute; instalado. Este usuario deber&aacute; registrarse en todas las m&aacute;quinas de la red para cambiar
su contrase&ntilde;a. Si YP estuviera instalado, ser&iacute;a posible para &eacute;l/ella cambiar su palabra de paso
en una de las m&aacute;quinas donde corre un cliente NIS. La nueva contrase&ntilde;a ser&aacute; entonces transferida
al servidor, donde ser&aacute; modificada en su base de datos. Despu&eacute;s de esto, cuando un usuario quiera
conectarse desde una m&aacute;quina de la red (en la que, por supuesto, corre un cliente NIS ;-), la
contrase&ntilde;a se comprobar&aacute; contra aquella registrada en la base de datos del servidor.</P>

<P>Existen diferentes versiones de YP, pero ya que este art&iacute;culo es una introducci&oacute;n, s&oacute;lo nos
fijaremos en los grandes principios en los que se basa su funcionamiento, sin entrar en los
detalles. Ya los veremos m&aacute;s adelante.</P>

glibc 2.x (libc6) soporta el uso de NSS (Name Switch Service) que determina el orden en que una
informaci&oacute;n debe ser buscada (ver el fichero <FONT face="Courier New,Courier">/etc/nsswitch.conf</FONT>).
Mantiene los alias, ethers, grupos, hosts, grupos de red, protocolos, clave p&uacute;blica, contrase&ntilde;a,
rpc, servicios y mapas ocultos.

    <H1>C&oacute;mo trabaja</H1>

    <A NAME="lfindex0">&nbsp;</A>
<H2>Estructura</H2>


    <P>Debe haber una m&aacute;quina en la red funcionando como un servidor NIS para un dominio. Este
<I>dominio</I> corresponde, m&aacute;s o menos, al nombre de la base de datos que administra el
servidor. Esta es la clave utilizada por los clientes NIS para colocar la informaci&oacute;n necesaria
en el servidor NIS. Este nombre de dominio no tiene <B>absolutamente nada<B> que ver con el nombre
de dominio DNS. Puede haber m&aacute;s de un servidor NIS en el mismo dominio. Cada uno puede administrar
un dominio diferente (a nivel NIS), o pueden administrar el mismo dominio (en este caso habr&aacute; un
servidor <I>maestro</I> y servidores <I>esclavos</I>.</P>

<P>Los servidores esclavos s&oacute;lo tienen una copia de la base de datos de los servidores maestros.
Estos servidores complementan al maestro cuando a &eacute;ste le lleva mucho tiempo responder las peticiones
de los clientes o cuando el servidor maestro se cae.</P>


<P>Se notifica a los servidores cualquier cambio en la base de datos con el programa
<FONT face="Courier New,Courier">yppush</FONT> y actualizar&aacute;n sus propias bases de datos para
reflejar el estado exacto de la base de datos en el servidor.</P>

<P>Los clientes, por su parte, no necesitan ning&uacute;n "mantenimiento" ya que se est&aacute;n conectando
continuamente al servidor NIS para buscar informaci&oacute;n en su base de datos.</P>

    <A NAME="lfindex1">&nbsp;</A>
<H2>Los mapas</H2>


<P>Las bases de datos YP est&aacute;n en formato GDBM, derivado del formato ASCII. Son instaladas
durante la instalaci&oacute;n del servidor por el programa <FONT face="Courier New,Courier">makedbm</FONT>.</P>

<P>Estos <I>mapas</I> establecen correspondencias entre una <B>clave</B> y su <B>valor</B>. Todos
los mapas YP est&aacute;n basados en este modelo. Desde el punto de vista del servidor, los contenidos
no tienen significado (bueno, excepto algunos datos sobre el servidor principal o fechas). Esto
significa que, para el servidor, un mapa con contrase&ntilde;as o grupos o ... no es m&aacute;s que un conjunto
de parejas (clave, valor). Unicamente el cliente YP cliente sabe c&oacute;mo recorrer esos mapas para
encontrar la informaci&oacute;n que estaba buscando.</P>

<P>Esta representaci&oacute;n de los datos puede ser problem&aacute;tica. Como el servidor no puede "leer" el
valor de una clave para encontrar una segunda clave dentro, ser&aacute; necesario duplicar los datos.
Por ejemplo, en el caso de las contrase&ntilde;as, uno puede querer ser capaz de buscarlas utilizando
el nombre de login o por el <I>ID de ususario</I> o UID, un identificador &uacute;nico para cada usuario
en la red. Esto conduce a informaci&oacute;n redundante, ua que puede ser vista por la presencia de los
ficheros <FONT face="Courier New,Courier">passwd.byname</FONT> and
<FONT face= "Courier New,Courier">passwd.byuid</FONT>. En consecuencia, habr&aacute; un nuevo mapa
creado para cada nueva clave, significando que los datos deben ser transmitidos dos veces en caso
de cambio-</P>


<P>Un cliente necesita tres par&aacute;metros para encontrar la informaci&oacute;n que busca en la base de
datos: </P>

<OL>
   <LI>El nombre de dominio: este es el nombre de la base de datos en el servidor de P&aacute;ginas
Amarillas</LI>

   <LI>El nombre de mapa</LI>

   <LI>El nombre de clave</LI>

</OL>

Por lo tanto, para que un cliente encuentre la contrase&ntilde;a de un usuario llamado Toto en el
dominio <FONT face="Courier New,Courier">titi</FONT>, leer&aacute; el fichero <FONT face=
"Courier New,Courier">/var/yp/titi/passwd.byname</FONT> en el servidor YP buscando el usuario
Toto.

<P>Esto conduce a un sistema muy flexible, ya que configurar un nuevo dominio se reduce a la
creaci&oacute;n del directorio <FONT face="Courier New,Courier">/var/yp/new_domain</FONT>,
copiando el <FONT face="Courier New,Courier">Makefile</FONT> y ejecut&aacute;ndolo con las opciones correctas.
</P>

    <H1>LLamadas a Procedimientos Remotos (RPC)</H1>

<P>La funcionalidad de las P&aacute;ginas Amarillas se basa esencialmente en LLamadas a Procedimientos
Remotos (RPCs) aceptando peticiones entre el servidor y sus clientes.</P>

<P>El portmapper RPC (portmap) es un programa que convierte los n&uacute;meros de programa RPC a n&uacute;meros de
puerto. Cuanddo un RPC es arrancado, le dir&aacute; al portmap qu&eacute; puerto va a usar y los n&uacute;meros de programa
RPC que est&aacute; administrandol Cuando un cliente quiere hacer una petici&oacute;n RPC a un determinado
n&uacute;mero de programa, primero contacta con el servidor portmap para obtener el n&uacute;mero de puerto en
el que el programa est&aacute; corriendo. Despu&eacute;s de obtener el n&uacute;mero de puerto, dirige los paquetes RPC
al puerto que corresponda El modelo cliente/servidor de las YPs no es m&aacute;s que un caso particular
del cliente/servidor RPC.</P>

<P>El fichero <FONT face="Courier New,Courier">yp_prot.h</FONT> contiene las estructuras y los
prototipos del protocolo RPC entre clientes y el servidor YP.</P>

<UL>
   <LI>YPROC_DOMAIN e YPROC_DOMAIN_NOACK permite a los clientes encontrar un servidor para un
dominio dado.</LI>

   <LI>Las funciones YPROC_MATCH, YPROC_FIRST, YPROC_NEXT e YPROC_ALL permiten obtener informaci&oacute;n
sobre los datos.</LI>

   <LI>YPROC_XFR es llamado por <FONT face=
      "Courier New,Courier">yppush</FONT> para se&ntilde;alar los servidores esclavos que el mapa en el
servidor maestro ha cambiado y que necesitan para actualizar sus copias.</LI>

   <LI>YPPROC_CLEAR limpia la cach&eacute; y los descriptores de fichero. Esta funci&oacute;n es llamada despu&eacute;s
de actualizar un mapa, por ejemplo despu&eacute;s del comando <FONT face="Courier New,Courier">makedbm -c</FONT>.
</LI>

      <LI>YPPROC_MASTER, YPPROC_ORDER and YPPROC_MAPLIST permiten obtener informaci&oacute;n especial
sobre los mapas. Por ejemplo, el programa <FONT face="Courier New,Courier">yppasswd</FONT> hace
una llamada a YPPROC_MASTER para determinar el servidor antes de cambiar la contrase&ntilde;a.</LI>
</UL>


    <H1>Conclusiones</H1>

    Ahora que conocemos el fundamento general, el pr&oacute;ximo art&iacute;culo se dirigir&aacute; a la parte cliente
de las p&aacute;ginas amarillas: c&oacute;mo funciona, c&oacute;mo configurarlo, las herramientas que utiliza, etc...
Tambi&eacute;n repasaremos las herramientas necesarias para configurar nuestro cliente correctamente,
tanto para los RPC como para las YPs.



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback form for this article</h2>
Every article has its own talkback page. On this page you can submit a comment or look at comments from other readers:
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=148&lang=en"><b>&nbsp;talkback page&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Webpages maintained by the LinuxFocus Editor team</A>
<BR><FONT COLOR="#FFFFFF">&copy; Fr&eacute;d&eacute;ric Raynal, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=en&article=article148.html" target="_TOP">Click here to report a fault or send a comment to LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:pappy@users.sourceforge.net"><FONT COLOR="#FFFFFF">Fr&eacute;d&eacute;ric Raynal</FONT></a></font></td>
</tr>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>en</font></td>
    <td><font size=2><a href="mailto:rainbow@linuxfocus.org"><FONT COLOR="#FFFFFF">Jo Simons</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:bblanco@crvasca.com"><FONT COLOR="#FFFFFF">Bego&ntilde;a Blanco</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-07-02, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
