<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Graphics">
 <TITLE>lf211, Graphics: Hacer magia con las im&aacute;genes en la shell</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://www.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://www.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/katjasocher.gif" alt="[Photo of the Author]" height="148" width="120">
<BR>por  <A href="mailto:katja@linuxfocusorg">Katja Socher</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Katja es la editora alemana de LinuxFocus. Le gusta Tux, el cine,
    la fotograf&iacute;a y el mar. <A href="http://www.oche.de/~bearix/k/">Aqu&iacute;</A>
    se puede ver su p&aacute;gina web.</P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Haciendo magia</A></LI>
  <LI><A HREF="#lfindex1">Los ingredientes</A></LI>
  <LI><A HREF="#lfindex2">Algunos Conjuros</A></LI>
  <LI><A HREF="#lfindex3">Cambiando la altura y la anchura de nuestras im&aacute;genes</A></LI>
  <LI><A HREF="#lfindex4">Creando im&aacute;genes de previsualizaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex5">Cambiando el formato de la imagen</A></LI>
  <LI><A HREF="#lfindex6">Poniendo un logo en todas nuestras im&aacute;genes</A></LI>
  <LI><A HREF="#lfindex7">Obteniendo informaci&oacute;n de las propiedades de la imagen</A></LI>
  <LI><A HREF="#lfindex8">Referencias</A></LI>
  <LI><A HREF="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=211&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Hacer magia con las im&aacute;genes en la shell</H2>
 <IMG src="../../common/images/illustration211.jpg" alt=
    "[Illustration]" hspace="40"  width="190" height="205">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

    En este art&iacute;culo veremos algunos conjuros que el mago ImageMagick
    puede realizar utilizando una colecci&oacute;n de herramientas gr&aacute;ficas como
    ingredientes y la shell como su varita m&aacute;gica.

    </P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="lfindex0">&nbsp;</A>
<H2>Haciendo magia</H2>


    <P>En los tiempos antiguos, los magos cog&iacute;an sus ingredientes, los
    mezclaban todos en un gran caldero, agitaban su varita m&aacute;gica, murmuraban
    sus conjuros... y, de repente, alguien se convert&iacute;a en rana. En nuestros
    tiempos modernos, los magos son como cualquier persona altamente especializada de la
    sociedad, y sus libros de conjuros s&oacute;lo contienen unos pocos conjuros
    &uacute;tiles para un uso gen&eacute;rico. En muchos aspectos, no pueden competir
    con el Gimp o muchos otros programas gr&aacute;ficos, pero tienen algunas
    caracter&iacute;sticas especiales que pueden resultar muy &uacute;tiles.
    <BR>
    Su verdadera fuerza radica en la posibilidad de automatizar muchos de sus procesos
    cuando se trabaja con ellos en una shell.<BR>
    <BR>
    Pero antes vamos a divulgar algunos conjuros para poder tener una visi&oacute;n
    general de los ingredientes principales:</P>

    <A NAME="lfindex1">&nbsp;</A>
<H2>Los ingredientes</H2>


    <P>&iquest;o qu&eacute; es ImageMagick?</P>
    ImageMagick es una colecci&oacute;n de herramientas gr&aacute;ficas
    para trabajar con im&aacute;genes. Las herramientas son display,
    import, animate, montage, convert, mogrify, identify y combine.<BR>

     <B>Display</B>: Si tecleamos "display &amp;", aparece una ventana de
    visualizaci&oacute;n y podemos trabajar directamente en la imagen. A trav&eacute;s
    del men&uacute; podemos abrir un fichero, salvarlo o borrarlo, invertir o rotar, aplicar
    cambios al color o aplicar ciertos efectos, p.e. implosionar, realzar el dibujo, enmarcarlo
    y mucho m&aacute;s.<BR>

     Con <B>Import</B> se pueden realizar capturas de toda la pantalla o de ciertas
    im&aacute;genes o ventanas.<BR>

     <B>Animate</B> es una herramienta para la animaci&oacute;n. Se puede seleccionar una serie de
    im&aacute;genes para representarlas una tras otra o se puede ver un gif animado.<BR>

     Con <B>Montage</B> podemos, por ejemplo, crear una imagen en mosaico o conseguir una imagen en
    la que se pueden ver todas las im&aacute;genes que componen un gif animado.<BR>

     <B>Convert</B> es una herramienta muy potente. Se puede cambiar el formato de una imagen,
    p.e. convertir una imagen gif en una imagen jpeg y viceversa, se puede cambiar el tama&ntilde;o
    de una imagen y tambi&eacute;n aplicar un mont&oacute;n de efectos, p.e. carboncillo, a las
    im&aacute;genes.<BR>

     <B>Mogrify</B> es muy similar a convert con la gran diferencia que con mogrify se puede
     sobreescribir la imagen actual, mientras que con convert y con las otras herramientas se ha de
     especificar un fichero en el cual se salvar&aacute; la imagen resultante. No se suele
     utilizar.<BR>

     <B>Identify</B> nos da informaci&oacute;n sobre la imagen, como su geometr&iacute;a,
     tama&ntilde;o, nombre, formato, etc.<BR>

     <B>Combine</B> combina dos o m&aacute;s im&aacute;genes en otra imagen. Por ejemplo podemos
     a&ntilde;adirle un logotipo a todas nuestras im&aacute;genes.<BR>
    <BR>

     Para utilizar las herramientas debemos teclear su nombre, seguido de las
     opciones que queramos utilizar, la imagen que vamos a manipular y el nombre del fichero con el
     que vamos a grabar la imagen resultante.<BR>
     Por ejemplo, si queremos aplicarle un efecto de carboncillo a tux1.gif con un factor de 3 y salvarla en
     tux1characoal.gif escribiremos:<BR>
     convert -characoal 3 tux1.gif tux1characoal.gif<BR>
     <BR>
     Despu&eacute;s de esta visi&oacute;n de los ingredientes vamos a pobrar ahora algunos conjuros:

    <A NAME="lfindex2">&nbsp;</A>
<H2>Algunos Conjuros</H2>


    <A NAME="lfindex3">&nbsp;</A>
<H2>Cambiando la altura y la anchura de nuestras im&aacute;genes</H2>


    Imaginemos que tenemos un mont&oacute;n de im&aacute;genes con las &uacute;ltimas
    v&iacute;ctimas que hemos convertido en rana, y que queremos ponerlas en nuestra
    p&aacute;gina web. Para reducir el tiempo de carga queremos que las im&aacute;genes
    sean m&aacute;s peque&ntilde;as.<BR>
    Con la utilidad convert podemos hacer que nuestras im&aacute;genes sean m&aacute;s
    grandes o m&aacute;s peque&ntilde;as, o podemos generar thumbnails.<BR>

    El comando
<PRE>
convert -geometry 60x80 image.gif out.gif
</PRE>
    escala la imagen image.gif a una anchura de 60 y una altura de 80, escribiendo la
    imagen resultante en out.gif.<BR>
    <BR>
    Por ejemplo, para dar a todas nuestras im&aacute;genes una altura y anchura de 80 de
    una sola pasada podemos escribir:
<PRE>
#!/bin/sh
for f in $* ;do
 convert -geometry 80x80 $file t_$file
 echo "&lt;a href=\"$f\"&gt;&lt;img src=\"t_$f\" width=\"80\" height=\"80\"&gt;&lt;/a&gt;"
done
# end of script
</PRE>
    (Teclearemos estas l&iacute;neas en cualquier editor que elijamos (vi, emacs, nedit,
    kedit...) y las salvaremos como mksmallimage en nuestro directorio personal. Entonces
    abriremos una shell y teclearemos:
<PRE>
chmod 755 /home/katja/mksmallimage
</PRE>
    (utilizaremos el nombre de nuestro directorio en vez de katja) Entonces podemos
    utilizar el script tecleando /home/katja/mksmallimage xxx.jpg *.gif lo que
    convertir&aacute; todos los archivos gif adem&aacute;s del fichero xxx.jpg.)

    <A NAME="lfindex4">&nbsp;</A>
<H2>Creando im&aacute;genes de previsualizaci&oacute;n</H2>

    Tenemos un CD con una colecci&oacute;n de la gente que convertimos en rana en los dos
    &uacute;ltimos a&ntilde;os. Ahora nuestro mago rival, que est&aacute; muy celoso de
    nosotros, quiere la prueba de que incluso hemos convertido a su perro en rana. Y ahora nos
    pasamos el d&iacute;a entero buscando esa foto. Esto podr&iacute;a haberse evitado si
    hubi&eacute;semos tenido una imagen de &iacute;ndice con todas las im&aacute;genes de
    nuestro CD. Con ImageMagick es muy f&aacute;cil crear una:
<PRE>
display "vid:*.jpg"
</PRE>
    Esto genera una imagen &iacute;ndice de todas nuestras im&aacute;genes jpg en el
    directorio actual. O:
<PRE>
display "vid:frog/*"
</PRE>
    genera una imagen &iacute;ndice de todas las im&aacute;genes en el directorio
    frog.<BR>
    Pinchando con el bot&oacute;n derecho del rat&oacute;n en una de las im&aacute;genes
    obtenemos un men&uacute; en el que podemos seleccionar "Load" para ver la imagen a
    tama&ntilde;o completo.<BR>
    <BR>

    <CENTER>
      <IMG src="../../common/images/article211/dir.jpg" width="292" height="147"
      alt="[visual image directory]">
    </CENTER>
    <BR>
    <BR>
    Esta es una forma muy f&aacute;cil de crear una imagen &iacute;ndice, pero dependiendo
    del ordenador puede llevar mucho tiempo la generaci&oacute;n de la imagen
    &iacute;ndice y puede consumir mucha memoria si tenemos un gran n&uacute;mero de
    im&aacute;genes. Por ello vamos a escribir un peque&ntilde;o script htmlthumbnails, que
    ser&aacute; menos exigente con los recursos, y construiremos una p&aacute;gina web en
    la que podremos pinchar en cualquiera de los thumbnails y obtener la imagen original.<BR>
    <BR>
    El c&oacute;digo html para esto es el siguiente:
<PRE>
&lt;a href="file.gif"&gt;&lt;img src="t_file.gif" width="60" height="80"&gt;&lt;/a&gt;
</PRE>
    El fichero original es file.gif, y el thumbnail es t_file.gif.
    <BR>
    Ahora escribiremos un script que generar&aacute; los thumbnails y escribir&aacute; el
    c&oacute;digo html por nosotros.
<PRE>
for f in $* ;do
 convert -geometry 80x80 $file t_$file
 echo "&lt;a href=\"$f\"&gt;&lt;img src=\"t_$f\" width=\"80\" height=\"80\"&gt;"
done
</PRE>
    El script anterior recorrer&aacute; todas las im&aacute;genes especificadas en la
    l&iacute;nea de comando, generar&aacute; los thumbnails y escribir&aacute; el
    c&oacute;digo html en la pantalla. Entonces podremos copiar y pegar el c&oacute;digo
    html en nuestra p&aacute;gina web.<BR>
    Para hacer un script m&aacute;s completo le a&ntilde;adiremos alguna ayuda y chequeo
    de errores. Aqu&iacute; est&aacute; nuestro script final, llamado htmlthumbnails :
    <BR>
    <A href=
    "../../common/src/article211/htmlthumbnails.html">htmlthumbnails
    (en html para ver)</A>, <A href=
    "../../common/src/article211/htmlthumbnails.txt">htmlthumbnails
    (en texto para descarga)</A> <BR>


    <A NAME="lfindex5">&nbsp;</A>
<H2>Cambiando el formato de la imagen</H2>

    La utilidad convert no s&oacute;lo puede cambiar el tama&ntilde;o de la imagen, sino
    tambi&eacute;n el formato. Por ejemplo podemos convertir una imagen gif a una imagen
    jpg y viceversa. El comando para hacerlo es, simplemente:
<PRE>
convert image.gif image.jpg
</PRE>
    El programa convert reconoce el formato que tiene que utilizar por la extensi&oacute;n
    del fichero.<BR>
     Para cambiar el formato de imagen de jpg a gif para m&uacute;ltiples im&aacute;genes
    utilizaremos:<BR>
<PRE>
for f in $* ;do
 if echo "$f" | grep -i "jpg$" &gt; /dev/null ; then
   gif=`echo "$f" | sed 's/jpg$/gif/i'`
   echo "converting  $f to $gif ..."
   convert 80x80 $file $gif
 else
   echo echo "$f is not a jpg file, ignored"
 fi
done
</PRE>
    Existe un gran n&uacute;mero de formatos que ImageMagick puede reconocer.

    <A NAME="lfindex6">&nbsp;</A>
<H2>Poniendo un logo en todas nuestras im&aacute;genes</H2>

    Nos gustar&iacute;a a&ntilde;adir un peque&ntilde;o logo como el que se puede ver a la
    derecha en un n&uacute;mero determinado de im&aacute;genes.
    <IMG src=
    "../../common/images/article211/lfstamp.gif" width="71" height="22"
    alt="[linuxfocus stamp]" align="right" border="2"> <BR>
    <BR>
    Este logo deber&iacute;a ser una imagen gif transparente. Nuestro logo deber&iacute;a
    situarse como una peque&ntilde;a firma el la esquina inferior derecha de la imagen
    final, tal y como podemos ver en la siguiente imagen de Tux:

    <CENTER>
      <BR>
      <IMG src="../../common/images/article211/stamp_tux002.jpg"
     width="240" height="180" alt="[tux with logo]">
    </CENTER>
    <BR>
     &iquest;Cu&aacute;l es el comando para hacerlo? <BR>
    El programa combine se puede utilizar para combinar dos im&aacute;genes en una. Hay
    varias opciones que le dicen al programa como hacerlo:
<PRE>
combine -gravity SouthEast -compose Over img.jpg logo.gif stamp_img.jpg
</PRE>
    La opci&oacute;n "gravity SouthEast" sit&uacute;a el logo.gif en la esquina inferior
    derecha. "compose Over" dice que reemplazaremos la imagen con el logo en los lugares
    en los que solapen.<BR>
    <BR>
    Para tener un script totalmente funcional se pondr&aacute; el comando dentro
    de un bucle for, y se a&ntilde;adir&aacute; texto de ayuda y de
    comprobaci&oacute;n de errores. Aqu&iacute; est&aacute; el script final,
    denominado "stampimages" : <BR>
    <A href="../../common/src/article211/stampimages.html">stampimages
    (html para ver)</A>, <A href=
    "../../common/src/article211/stampimages.txt">stampimages (texto para
    descarga)</A> <BR>


    <A NAME="lfindex7">&nbsp;</A>
<H2>Obteniendo informaci&oacute;n de las propiedades de la imagen</H2>

    "Identify" muestra detalles acerca del tipo de nuestras im&aacute;genes, su
    tama&ntilde;o y geometr&iacute;a. Un ejemplo:
<PRE>
identify  image.jpg
da como resultado
image.jpg 340x254 DirectClass 13939b JPEG 0.1u 0:01
</PRE>
    &iquest;Qu&eacute; puede hacer nuestro mago con esto? Bien, para
    dise&ntilde;ar buenas p&aacute;ginas web que muestren las im&aacute;genes a
    medida que la p&aacute;gina se carga se deber&iacute;a especificar el
    tama&ntilde;o exacto de todas las im&aacute;genes. El c&oacute;digo html
    ser&iacute;a el siguiente:
<PRE>
&lt;img src="image.jpg" width="340" height="254" alt="[sample picture]"&gt;
</PRE>
    Cuando nuestras im&aacute;genes tienen diferentes tama&ntilde;os y no
    conocemos la altura y anchura exactas de cada una de ellas podemos utilizar
    "identify" para ayudarnos. Escribiremos un script que leer&aacute; la salida
    de "identify" y mostrar&aacute; esta l&iacute;nea. La geometr&iacute;a de la
    imagen es el segundo par&aacute;metro en la cadena de salida del programa
    "identify". Para obtener este par&aacute;metro utilizamos el comando awk:
<PRE>
identify  image.jpg | awk '{print $2}'
da como resultado
340x254
</PRE>
    Ahora tendremos que dividir la geometr&iacute;a en anchura y altura. Esto se
    puede realizar con:
<PRE>
echo 340x254 | sed 's/[^0-9]/ /g' | awk '{print $1}'
</PRE>
    que nos dar&aacute; el ancho. La altura se puede obtener con:
<PRE>
echo 340x254 | sed 's/[^0-9]/ /g' | awk '{print $2}'
</PRE>
    No fijemos nuestra atenci&oacute;n en los comando exactos. Si todav&iacute;a
    no los entendemos completamente acept&eacute;moslos tal y como nos los
    dan. Habr&aacute; un art&iacute;culo sobre programaci&oacute;n en shell en
    la pr&oacute;xima entrega de LinuxFocus en el que se explicar&aacute; toda
    su magia. El script final es el siguiente:
<PRE>
file=$1
geometry=`identify $file | awk '{print $2}'`
# geometry can be 563x144+0+0 or 75x98
# we need to get rid of the plus (+) and the x characters:
width=`echo $geometry | sed 's/[^0-9]/ /g' | awk '{print $1}'`
height=`echo $geometry | sed 's/[^0-9]/ /g' | awk '{print $2}'`
echo "&lt;img src=\"$file\" width=\"$width\" height=\"$height\"&gt;"
</PRE>
    Para obtener el script completo, de nuevo a&ntilde;adiremos texto de ayuda y
    comprobaci&oacute;n de errores. Aqu&iacute; est&aacute; nuestro script
    final, denominado "imgsrcline" :
    <BR>
    <A href="../../common/src/article211/imgsrcline.html">imgsrcline
    (html para ver)</A>, <A href=
    "../../common/src/article211/imgsrcline.txt">imgsrcline (texto para
    descarga)</A> <BR>
     <BR>
    <BR>

    <p>Mientras jugaba con ImageMagick he encontrado que a veces hay
    discrepancia entre la documentaci&oacute;n y la funcionalidad
    actual. Algunas caracter&iacute;sticas tampoco son muy estables. Sin embargo
    si nos atenemos a lo mostrado anteriormente podemos ver que es
    &uacute;til. Las funciones mostradas funcionan. He utilizado
    ImageMagick-4.2.9, ImagiMagick-5.2.9 y ImageMagick-5.3.0 y lo aprendido
    aqu&iacute; funciona en todas estas versiones.

    <P>Espero que se haya obtenido una idea de lo que se puede hacer con
    ImageMagick y que se utilizar&aacute;n los scripts, o incluso crear conjuros
    propios.<BR>
    &iexcl;A divertirse!</P>

    <A NAME="lfindex8">&nbsp;</A>
<H2>Referencias</H2>


    <UL>
      <LI>Instalaci&oacute;n: Probablemente ImageMagick ya es est&aacute;
      instalado en el sistema, ya que est&aacute; inclu&iacute;do en las
      distribuciones de Linux m&aacute;s comunes. Pero en caso de que se quiera
      una versi&oacute;n m&aacute;s reciente se puede descargar de: <a
      href="http://www.imagemagick.org/">http://www.imagemagick.org/</a></LI>

      <LI>Para m&aacute;s informaci&oacute;n acerca de las herramientas de
      ImageMagick se puede consultar la p&aacute;gina del man (por ejemplo, se
      teclea man convert para informaci&oacute;n sobre la herramienta convert) o
      se puede leer el mismo texto en la p&aacute;gina web.
      </LI>

      <LI>Si no se est&aacute; familiarizado con la programaci&oacute;n en shell
      se puede buscar el t&eacute;rmino "bash" en google y se encontrar&aacute;n
      varios tutoriales sobre programaci&oacute;n en shell que se ajusten a
      nuestras necesidades. O podemos esperar a la pr&oacute;xima entrega de
      LinuxFocus y leer ah&iacute; un art&iacute;culo sobre programaci&oacute;n
      en shell.</LI>
    </UL>
    <!-- vim: set sw=2 ts=2 et: -->
  



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=211&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Katja Socher, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://www.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article211.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:katja@linuxfocusorg"><FONT COLOR="#FFFFFF">Katja Socher</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:malfageme@terra.es"><FONT COLOR="#FFFFFF">Miguel Alfageme</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-09-24, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
