<html>
<meta name="editor" value="/usr/bin/vi">
<head><title>Preguntas Frecuentes de vi - C&oacute;mo se hace.. ?</title>
</head>
<body>
<center>
<h2><b><u>3.0 C&oacute;mo se hace... ?</u></b></h2>
<A HREF="http://www.abast.es/~avalle/vi.html"><IMG BORDER=0 SRC="vipower.gif"><BR></A>
<hr>
</center>
<h2><b>3.0 - Como se hace "buscar y sustituir"?</b></h2>

  <p>Hay varias formas, pero la m&aacute;s simple es:<dl>
    <dd><tt>:[rango]s/buscar/sustituir/[cgi]</tt> </dl><p>

Donde [rango] especifica el rango de l&iacute;neas donde queremos realizar
la b&uacute;squeda, incluyendo n&uacute;meros y los s&iacute;mbolos $, que
indica el final del fichero, . que indica la situaci&oacute;n actual del cursor
, % que indica el fichero actual o bien dos n&uacute;meros separados por comas.
Tambi&eacute;n podemos especificar un desplazamiento respecto a la 
situaci&oacute;n actual con +n, donde n especifica el n&uacute;mero de 
l&iacute;neas que queremos desplazarnos. Ejemplos de rangos v&aacute;lidos
ser&iacute;an:<dl> 
<dd><tt>:1,5s/viejo/nuevo/</tt> que especifica realizar la sustituci&oacute;n desde las l&iacute;neas 1 a la 5.
<dd><tt>:.,$s/viejo/nuevo/</tt> que especifica realizarla desde la posici&oacute;n actual hasta el final del fichero.
<dd><tt>:.,+5s/viejo/nuevo/</tt> que la realiza desde la posici&oacute;n actual hasta 5 l&iacute;neas m&aacute;s adelante.
</dl>
La opci&oacute;n <tt>[cgi]</tt> nos permitir&aacute; especificar el comportamiento que tendr&aacute; esta b&uacute;squeda, donde:<dl>
<dd><tt>c</tt> hace que el vi pida una confirmaci&oacute;n de la sustituci&oacute;n
<dd><tt>g</tt> le indica al vi que la b&uacute;squeda se realizar&aacute; para
todas las ocurrencias dentro de una misma l&iacute;nea 
<dd><tt>i</tt> hace que la b&uacute;squeda sea insensible a may&uacute;sculas.
</dl>

Como era de esperar, podemos utilizar expresiones regulares [<tt>regexp(5)</tt>]
en las b&uacute;squedas, de tal forma que utilizando <tt>\(</tt> y <tt>\)</tt>
para utilizar secuencias podremos realizar cosas realmente complicadas.
<p>Por ejemplo, 
<dl><dd><tt>:g/\(Bar\)\(celona\)/s/\2/\1na/g</tt> cambiar&aacute; en todo
el fichero Barcelona por Barna (porque \1 indica el primer elemento y
\2 indica el segundo).
</dl>
Los caracteres especiales que se permiten son los siguientes:<dl>
    <DD><tt>&</tt> Cualquier cadena que cumpla el criterio de b&uacute;squeda.
    <dd><tt>\[1-9]</tt>   El contenido del token 1 al 9 (donde cada token viene marcado por un par <tt>\(token\)</tt>
    <dd><tt>\u</tt>       Pasar&aacute; a may&uacute;sculas el pr&oacute;ximo car&aacute;cter. 
    <dd><tt>\U</tt>       Todos los caracteres hasta <tt>\e</tt> o <tt>\E</tt> 
se pasar&aacute;n a may&uacute;sculas. 
    <dd><tt>\l</tt>       El pr&oacute;ximo car&aacute;cter se pasar&aacute; a 
min&uacute;sculas. 
    <dd><tt>\L</tt>       Todos los caracteres hasta <tt>\e</tt> o <tt>\E</tt>
 se pasar&aacute;n a min&uacute;sculas.
    <dd><tt>\[eE]</tt>    Indica el fin de la selecci&oacute;n para el
paso a may&uacute;sculas o min&uacute;sculas.</dl><p>

<a name="31">
<h3><b>3.1 - C&oacute;mo se ejecuta un programa desde dentro del vi?</b></h3>

  <p>El comando <tt>:!cmd</tt> ejecutar&ntilde;a el comando externo <tt>cmd</tt>. Tambi&eacute;n podremos utilizar <tt>:sh</tt> para ejecutar una shell. Desde
dentro de esta shell podremos volver a correr el vi si es necesario, pero 
entraremos en <i>otra</i> sesi&oacute;n de vi. Esto es particularmente 
&uacute;til si estamos editando un Makefile y diferentes ficheros de 
configuraci&oacute;n cuando intentamos compilar un programa. La ventaja con 
respecto a <tt>:e</tt> es que no es necesario grabar lo que estamos haciendo,
y ademas el fichero estar&aacute; all&iacute; donde lo dejamos al salir de
la shell que hemos abierto. De todas formas, no deja de ser altamente 
recomendable grabar antes de abrir la nueva shell... nunca se sabe!

<a name="32">
<h3><b>3.2 - Socorro! Estaba escribiendo un documento y el ordenador "se'sco&ntilde;&oacute;!</b></h3>

<p>Deber&iacute;as recibir un mail acerca del problema. Es decir, el vi 
tendr&iacute;a que enviarte un mail comunic&aacute;ndote el problema y
diciendo c&oacute;mo solucionarlo. De todas formas, podr&aacute;s recuperar una
copia de lo que estabas haciendo ejecutando <tt>vi -r &lt;fichero&gt;</tt>, 
donde &lt;fichero&gt; es el fichero que estabas editando cuando el ordenador
se fu&eacute; al garete. La orden <tt>vi -r</tt> te dar&aacute; una lista de
todos los ficheros que se pueden recuperar (si estabas editando m&aacute;s de
uno en el momento del fallo).

<h3><b>3.3 - Alg&uacute;n truco para hacerle la vida m&aacute;s f&aacute;cil
a los programadores?</b></h3>
<dl>
  <dd><tt>:set ai</tt> activa la indentaci&oacute;n autom&aacute;tica.
  <dd><tt>:set sw=#</tt> donde # es un n&uacute;mero especifica el ancho
del tabulador (el n&uacute;mero de espacios que se indenta).<p>
Puedes usar <tt>&lt;&lt;</tt> y <tt>&gt;&gt;</tt> para desplazar una 
l&iacute;nea a la izquierda o a la derecha. Adem&aacute;s podr&ntilde;as 
utilizar <tt>&lt;%</tt> para desplazar una {, ( o [ hacia la izquierda o a la 
derecha (con <tt>&gt;%</tt>). Para poder hacer esto, debes estar situado sobre 
el s&iacute;mbolo en cuesti&oacute;n.<p>
  <dd><tt>:set sm</tt> te mostrar&aacute; el {, [ o ( correspondiente cuando lo cierres (su pareja correspondiente).
  <dd><tt>:set lisp</tt> realizar&aacute; algunos cambios que son &uacute;tiles para la programaci&oacute;n en lisp.</ul>

<a name="34">
<h3><b>3.4 - C&oacute;mo escribir macros?</b></h3>

  <tt><p>:map &lt;lhs&gt; &lt;rhs&gt;</tt> donde &lt;lhs&gt; tendr&aacute; 
como m&aacute;ximo 10 caracteres y &lt;rhs&gt; tendr&aacute; como m&aacute;ximo
hasta 100.  

Con esto conseguiremos que cada vez que escribamos <tt>&lt;lhs&gt;</tt> a se 
remplazar&aacute; con <tt>&lt;rhs&gt;</tt>. Todas las macros han de comenzar
en modo comando, pero pueden terminar en cualquier modo que deseemos. Ah!
y no olvides utilizar el control <tt>^V</tt> antes de utilizar cualquier
c&oacute;digo de control.

  <tt><p>:unmap &lt;lhs&gt;</tt> borra la macro..
  <p><tt>:map! &lt;lhs&gt; &lt;rhs&gt;</tt> har&aacute; que al escribir <tt>&lt;lhs&gt;</tt> dentro del documento (en modo inserci&oacute;n), se traduzca por <tt>&lt;rhs&gt;</tt>

<a name="35">
<h3><b>3.5 - C&oacute;mo asigno una macro a una tecla de funci&oacute;n?</b></h3>

  <p>If &lt;lhs&gt; is #n where n is 0-9, it will be mapped to the appropriate
function key.<p>

<a name="36">
<h3><b>3.6 - Se puede abreviar texto?</b></h3>

  <p>Por Supuesto!. Esto es vi, chaval! puede hacer cualquier cosa.<BR> 
<tt>:ab email avalle@abast.es</tt> har&aacute; que cada vez que se escriba
la palabra <tt>email</tt> el vi la traduzca por <tt>avalle@abast.es</tt>
<tt>:una email</tt> elimina esta conversi&oacute;n. 

<a name="37">
<h3><b>3.7 - C&oacute;mo puedo realizar una correcci&oacute;n ortogr&aacute;fica del documento?</b></h3>

  <p>Aqu&iacute; tienes una macro para poder hacerlo. Si realmente la
vas a utilizar, deber&iacute;as ponerla en el fichero <tt>.exrc</tt>. Es
bastante simple: ejecuta el comando <tt>ispell</tt> sobre el fichero actual,
pero por supuesto, debes tener el <tt>ispell</tt> instalado en tu sistema.
(Lo puedes encontrar <a href="ftp://ftp.cs.ucla.edu">aqu&iacute;</A>).
Para utilizarlo, s&oacute;lo hay utilizar la V en modo comando.(El vi no
utiliza la V, as&iacute; que es correcto realizar este mapeo).

  <p><center><tt>map V :w^M:!ispell % ^M:e!^M^M</tt></center>
<p>El segundo c&oacute;digo ^M hace que no sea necesario pulsar retorno
despu&eacute;s de que se haya ejecutado el <tt>ispell</tt> para volver al 
vi.<p>

<a name="38">
<h3><b>3.8 - He conseguido un "hardcopy terminal", lo puedo usar con el vi?</b></h3>

  <p>En fin... No era de esperar que en las puertas del 2000 alguien preguntara
esto (incluso el traductor no tiene ni idea de como traducir el nombre de este
cacharro. Si alguien lo sabe, por favor, que <a href="mailto:avalle@abast.es">avise!</A>).
De todas formas, la cuesti&oacute;n tiene soluci&oacute;n, y adem&aacute;s 
resuelve otras dudas, as&iacute; que all&aacute; vamos:
  <p>El vi arrancar&aacute; en un modo espec&iacute;fico llamado "open mode".
En general, todo funcionar&aacute; m&aacute;s o menos igual, pero ser&aacute;
bastante inc&oacute;modo de trabajar. Los caracteres borrados aparecer&aacute;n como "back slash" (\). El vi actuar&aacute; como si el tama&ntilde;o de la
ventana fuese de s&oacute;lo una l&iacute;nea. Con <tt>^r</tt> volveremos a 
escribir la l&iacute;nea en curso y <tt></tt>z refresca la ventana alrededor 
de la l&iacute;nea actual.<p>

<a name="39">
<h3><b>3.9 - Ah, bueno...As&iacute; que eso es el open mode? Yo no tengo un 
"hardcopy terminal", y a&uacute;n me arranca en "open mode" </b></h3>

  <p><tt>:-)</tt> Lo que ocurre es que el editor no sabe con qu&eacute; tipo
de terminal se las tiene que ver, as&iacute; que decide que en esta 
situaci&oacute;n lo mejor que puede hacer es suponer que tienes la peor
terminal posible. Podr&iacute;a parecer bastante in&uacute;til, pero 
hay que tener en cuenta que en este modo, el vi casi no necesita saber
nada acerca de tu terminal para poder trabajar.
  <p>Ahora vamos a ver c&oacute;mo arregl&aacute;rnoslas con esto. Ser&iacute;a
posible cambiar la configuraci&oacute;n para la sesi&oacute;n en curso, pero
ser&iacute;a bastante poco pr&aacute;ctico, ya que tendr&iacute;amos que volver
a realizar todos los cambios al iniciar otra sesi&oacute;n. Si sabes qu&eacute;
tipo de terminal tienes, puedes configurarlo desde el prompt del sistema,
actualizando el valor de la variable TERM (con <tt>setenv TERM &lt;termtype&gt;
</tt>si utilizas la C-shell o sus derivados o con <tt>TERM=&lt;termtype&gt; ; 
export TERM </tt>si utilizas Bourne-Shell o derivados)
  <p>Lo mejor que podr&iacute;as hacer ser&iacute;a editar tu fichero 
<tt>.profile</tt> o <tt>.chsrc</tt> para que la variable TERM se configura
autom&aacute;ticamente al iniciar una sesi&oacute;n. (Por supuesto, necesitar&aacute;s conocer el <tt>ed</tt> o configurar la variable *antes* de editar el
fichero para que el vi te funcione correctamente!).

  <p>Si no sabes qu&eacute; tipo de terminal tienes, prueba con <tt>vt100</tt>.
La mayor&iacute;a de los terminales y emuladores actuales pueden emular 
correctamente el terminal <tt>vt100</tt>. Si no te funciona, busca alguien
que te pueda ayudar a determinar el valor correcto de la variable.
( En HP-UX existe un comando <tt>/usr/bin/ttytype</tt> que te puede ayudar
a identificar el tipo de terminal).

<hr>

<a href="index.html">[Indice]</a><a href="vi40.html">[Siguiente]</a><a href="vi20.html">[Anterior]</a><br>
Esta versi&oacuten de las Faq de vi ha sido recopilada por:<a href="mailto:baruch@macom.co.il">Baruch Promislow</a> de <a href="http://www.macom.co.il/">Macom Networking LTD.</a><br>
La versi&oacuten en castellano ha sido realizada por: <a href="mailto:avalle@abast.es">Antonio Valle</A>, de <a href="http://www.abast.es/">Abast Systems, S.A.</A>
<p>
<b>(C)opyright, <a href="mailto:ellidz@midway.uchicago.edu">E. Larry Lidz</a>, 1994, 1995.  All Rights Reserved.<br>
<b>(C)opyright, <a href="mailto:avalle@abast.es">Antonio Valle</A>, 1996. Todos los Derechos Reservados.
<b><p>
<hr>
</body></html>
