
<html><head>
<meta name="editor" value="/usr/bin/vi">
<title>Preguntas Frecuentes de VI - El fichero .exrc</title></head>
<body>
<center>
<h2><b><u>Preguntas Frecuentes de VI - El fichero .exrc</u></b></h2>
<A HREF="http://www.abast.es/~avalle/vi.html"><IMG BORDER=0 SRC="vipower.gif"><BR></A>
</center>
<hr>
<h2><b>7.0 - El fichero .exrc</b></h2>

  <p>En el fichero <tt>.exrc</tt> se puede utilizar cualquier comando del 
modo ex ( :comando). El vi carga autom&aacute;ticamente el fichero y ejecuta
todos los comandos que encuente. Adicionalmente, tambi&eacute;n podremos 
emplear los comandos <tt>so</tt> , <tt>ab</tt> y macros. Para que el fichero
sea totalmente correcto, no debemos dejar ninguna l&iacute;nea en blanco, 
y especificar los comentarios con un <tt>"</tt> al principio de la l&iacute;nea.
<p>

<a name="71">
<h3><b>7.1 - Un ejemplo:</b></h3>

  <p>Este <tt>.exrc</tt> es real: es el de Larry. De todas formas, es bastante
  simple, y est&aacute; aqu&iacute; s&oacute;lo para darnos una idea de 
  c&oacute;mo podr&iacute;a ser un fichero de este tipo (de hecho, el mio
  tiene todos los mapeos necesarios para escribir c&oacute;digo HTML sin
  mayor dificultad).<p>
<PRE>  
set wm=3 
set sm 
" abbreviations for my email address.
ab zidllem E. Larry Lidz - ellidz@midway
ab zidlleu E.  Larry Lidz - ellidz@midway.uchicago.edu 
map V :w^M:!ispell -x %^M:e!^M^M
</PRE> 
Primero que nada, f&iacute;jate que no es necesario especificar los dos puntos
el vi los da por supuestos.

<p> La primera l&iacute;nea, <tt>set wm=3</tt>, especifica que el margen
para cortar las l&iacute;neas debe est&aacute;r a 3 caracteres de la derecha
de la pantalla. Esto nos dar&aacute; un corte de l&iacute;neas autom&aacute;tico.

<p>La segunda l&iacute;nea, <tt>set sm</tt>, activa el que el vi nos muestre
cada vez que cerramos un ), } o ] cu&aacute;l es el que estamos cerrando. 
Si nos dedicamos a la programaci&oacute;n es bastante &uacute;til.

<p>La tercera l&iacute;nea genera una abreviaci&oacute;n, de tal forma que
cada vez que se escribe la palabra zidllem, el vi la expande a su nombre
completo y direcci&oacute;n de correo. La cuarta es similar, con la diferencia
de que se expande a la direcci&oacute;n de correo completa, no a la local.

<p>La quinta l&uacute;nea crea una macro seg&uacute;n la que, al pulsar V, 
se ejecuta el comando <tt>ispell -x</tt> sobre el documento actual.
<p>
<hr>


<a href="index.html">[Indice]</a><a href="vi80.html">[Siguiente]</a><a href="vi60.html">[Anterior]</a><br>
Esta versi&oacuten de las Faq de vi ha sido recopilada por:<a href="mailto:baruch@macom.co.il">Baruch Promislow</a> de <a href="http://www.macom.co.il/">Macom Networking LTD.</a><br>
La versi&oacuten en castellano ha sido realizada por: <a href="mailto:avalle@abast.es">Antonio Valle</A>, de <a href="http://www.abast.es/">Abast Systems, S.A.</A>
<p>
<b>(C)opyright, <a href="mailto:ellidz@midway.uchicago.edu">E. Larry Lidz</a>, 1994, 1995.  All Rights Reserved.<br>
<b>(C)opyright, <a href="mailto:avalle@abast.es">Antonio Valle</A>, 1996. Todos los Derechos Reservados.
<b><p>
<hr>
</body></html>

