<html><head>
<meta name="editor" value="/usr/bin/vi">
<title>Preguntas Frecuentes de VI - Glosario</title></head>
<body>
<center>
<h2><b><u>Preguntas Frecuentes de VI - Glosario</u></b></h2>
<A HREF="http://www.abast.es/~avalle/vi.html"><IMG BORDER=0 SRC="vipower.gif"><BR></A>
</center>
<hr>
<h2><b>9.0 - Glosario</b></h2>

<p>Este glosario se ir&aacute; actualizando, a medida en que la gente vaya
solicitando que se a&ntilde;adan m&aacute;s t&eacute;rminos que no entiendan.
Por favor, haz saber si tienes alguna sugerencia, OK?

<p><b>modo comando</b> <br>
    Modo comando es el modo en el que el vi interpretar&aacute; las pulsaciones
de tecla que el usuario de como comandos (movimiento de cursor, edici&oacute;n
borrado, etc...)

  <p><b>ed</b> <br>
    Un editor de l&iacute;neas com&uacute;n en UNIX.

 <p><b>&lt;Esc&gt;</b> <br>
    La tecla de escape. Normalmente est&aacute; marcada en el teclado como ESC.

  <p><b>ex</b> <br>
    Un editor de UNIX. Todos los comandos : se le pasan a el (ya lo dice el lema de UNIX... <tt>small is beautiful</tt>)

  <p><b>modo inserci&oacute;n</b> <br>
     Es el modo de trabajo en el que el texto que entremos ser&aacute; a&ntilde;adido a nuestro documento, y no interpretado como comando. 

  <p><b>macro</b> <br>
    Una macro es un "atajo" asociado a una combinaci&oacute;n de teclas. Por
ejemplo, una macro nos puede permitir que pulsando una &uacute;nica tecla se
ejecuten diferentes comandos.

  <p><b>modo open</b> <br>
    modo open es el modo que utilizar&aacute; el vi para arrancar si no es
capaz de determinar el tipo de terminal que est&aacute;s usando, o si tienes
un terminal sin pantalla (tipo teletipo).

  <p><b>expresiones regulares (RegEx)</b> <br>
    Las expresiones regulares, conocidas como "RegEx" son un conjunto de 
claves que permiten que el usuario tenga un gran control sobre las 
b&uacute;squedas que est&aacute; realizando. Son muy comunes en UNIX, y
se puede encontrar m&aacute;s informaci&oacute;n sobre ellas en las p&aacute;ginas de manual de UNIX , en regexp(5).

  <p><b>sed</b><br>
    Es un editor que no tiene interface, los comandos se le dan en la l&iacute;nea de comandos.

  <p><b>vi</b> <br>
    El editor al que est&aacute;n dedicadas estas FAQs
<p>
<hr>



<a href="index.html">[Indice]</a><a href="vi100.html">[Siguiente]</a><a href="vi80.html">[Anterior]</a><br>
Esta versi&oacuten de las Faq de vi ha sido recopilada por:<a href="mailto:baruch@macom.co.il">Baruch Promislow</a> de <a href="http://www.macom.co.il/">Macom Networking LTD.</a><br>
La versi&oacuten en castellano ha sido realizada por: <a href="mailto:avalle@abast.es">Antonio Valle</A>, de <a href="http://www.abast.es/">Abast Systems, S.A.</A>
<p>
<b>(C)opyright, <a href="mailto:ellidz@midway.uchicago.edu">E. Larry Lidz</a>, 1994, 1995.  All Rights Reserved.<br>
<b>(C)opyright, <a href="mailto:avalle@abast.es">Antonio Valle</A>, 1996. Todos los Derechos Reservados.
<b><p>
<hr>
</body></html>

