<HTML>
<HEAD>
<TITLE>Linux XFree86 COMO: Aparici&oacute;n de Problemas</TITLE>
</HEAD>
<BODY>
<A HREF="XFree86-Como-6.html">Anterior</A>
<A HREF="XFree86-Como-8.html">Siguiente</A>
<A HREF="XFree86-Como.html#toc7">Indice</A>
<HR>
<H2><A NAME="s7">7. Aparici&oacute;n de Problemas</A></H2>


<P>A veces, algo no ir&aacute; del todo bien cuando se arranque el servidor X.  Esto
suele estar causado casi siempre por un problema en el archivo
<CODE>XF86Config</CODE>.  Generalmente, los valores de frecuencia del monitor
no est&aacute;n, o las frecuencias <EM>dot clock</EM> de la tarjeta de v&iacute;deo est&aacute;n
definidos de forma incorrecta.  Si la pantalla parece fluctuar, o los
bordes est&aacute;n deformados, es una clara indicaci&oacute;n de que los valores de
frecuencia o <EM>dot clocks</EM> del monitor son err&oacute;neos. Aseg&uacute;rese tambi&eacute;n
de que de que se est&eacute; especificando correctamente el chipset de su tarjeta
de v&iacute;deo, as&iacute; como otras opciones de la secci&oacute;n <CODE>Device</CODE> del
fichero <CODE>XF86Config</CODE>. Hay que estar absolutamente seguro de que se
emplea el servidor X correcto y de que <CODE>/usr/X11R6/bin/X</CODE> es un
enlace simb&oacute;lico a este servidor. </P>
<P>Si todo lo dem&aacute;s falla, trate de arrancar X ``a pelo''; es decir emplee un
comando como: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
X &gt; /tmp/x.out 2&gt;&1 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Se puede entonces matar el servidor X (empleando la combinaci&oacute;n de teclas
<CODE>ctrl-alt-backspace</CODE>) y examinar el contenido de
<CODE>/tmp/x.out</CODE>.  El servidor X informar&aacute; de todas las advertencias o
errores ---por ejemplo, si la tarjeta de v&iacute;deo no tiene un <EM>dot clock</EM>
que se corresponda con un modo soportado por el monitor. </P>
<P>El fichero <CODE>VideoModes.doc</CODE> incluido en la distribuci&oacute;n XFree86
contiene muchas sugerencias de c&oacute;mo manipular los valores de su fichero
<CODE>XF86Config</CODE>. </P>
<P>Recuerde que puede emplear <CODE>ctrl-alt-numerico +</CODE> y
<CODE>ctrl-alt-numerico -</CODE> para ir conmutando entre los modos de v&iacute;deo
listados en la l&iacute;nea <CODE>Modes</CODE> de la secci&oacute;n <CODE>Screen</CODE> de
<CODE>XF86Config</CODE>. Si el modo de mayor resoluci&oacute;n a no parece correcto,
trate de cambiar a resoluciones menores. Esto le permitir&aacute; saber, por lo
menos, que esas partes de su configuraci&oacute;n de X est&aacute;n funcionando
correctamente. </P>
<P>Compruebe tambi&eacute;n los controles de posici&oacute;n y tama&ntilde;o horizontal y vertical
de su monitor. En muchos casos, es necesario ajustarlos cuando se arranca
X.  Por ejemplo, si la pantalla parece estar movida
ligeramente
<SL>N. del T. Ligeramente es eso,
<EM>ligeramente</EM>.</SL>
 a un lado, normalmente se puede corregir esto
usando los controles del monitor. </P>
<P>El <EM>newsgroup</EM> de USENET <CODE>comp.windows.x.i386unix</CODE> est&aacute; dedicado
a discusiones sobre XFree86, as&iacute; como <CODE>comp.os.linux.x</CODE>. Ser&iacute;a una
buena idea observar ese <EM>newsgroup</EM> para enviar consultas relativas a
su configuraci&oacute;n de v&iacute;deo ---puede que se encuentre con alguien con los
mismos problemas que uno tiene.---</P>

<HR>
<A HREF="XFree86-Como-6.html">Anterior</A>
<A HREF="XFree86-Como-8.html">Siguiente</A>
<A HREF="XFree86-Como.html#toc7">Indice</A>
</BODY>
</HTML>
