<HTML>
<HEAD>
<TITLE>Linux XFree86 COMO: Ejecuci&oacute;n de XFree86</TITLE>
</HEAD>
<BODY>
<A HREF="XFree86-Como-5.html">Anterior</A>
<A HREF="XFree86-Como-7.html">Siguiente</A>
<A HREF="XFree86-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Ejecuci&oacute;n de XFree86</A></H2>


<P>Con el fichero <CODE>XF86Config</CODE> configurado, se est&aacute; preparado para
arrancar el servidor X y dar un garbeo. Lo primero, asegurarse de que
<CODE>/usr/X11R6/bin</CODE> est&aacute; en el path. </P>
<P>El comando para arrancar XFree86 es</P>
<P>
<BLOCKQUOTE><CODE>
startx
</CODE></BLOCKQUOTE>
</P>
<P>Este es una ``cubierta'' de <CODE>xinit</CODE> (en caso de que se estuviese
acostumbrado a emplear <CODE>xinit</CODE> en otros sistemas UNIX). </P>
<P>Este comando arrancar&aacute; el servidor X y ejecutar&aacute; los comandos que se
encuentran en el fichero <CODE>.xinitrc</CODE>
<SL>N. del T. Para los
usuarios de RedHat, <CODE>.Xclients</CODE>.</SL>
. en su directorio <EM>home</EM>
<CODE>.xinitrc</CODE> es simplemente un <EM>script</EM> que contiene clientes X a
ejecutar. Si este fichero no existe, se emplear&aacute; por defecto
<CODE>/usr/X11R6/lib/X11/xinit/xinitrc</CODE>. </P>
<P>Un fichero <CODE>.xinitrc</CODE> convencional tiene este aspecto:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh

xterm -fn 7x13bold -geometry 80x32+10+50 &
xterm -fn 9x15bold -geometry 80x34+30-10 &
oclock -geometry 70x70-7+7 &
xsetroot -solid midnightblue &

exec twm 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Este script arrancar&aacute; dos clientes <CODE>xterm</CODE>, un <CODE>oclock</CODE>, y
configura el color de la ventana ra&iacute;z (el fondo) a <CODE>midnightblue</CODE>. 
Arrancar&aacute; entonces <CODE>twm</CODE>, el gestor de ventanas. T&eacute;ngase en cuenta
que <CODE>twm</CODE>, se ejecuta con el mandato del int&eacute;rprete de comandos
<CODE>exec</CODE> ; esto hace que el proceso <CODE>xinit</CODE> sea reemplazado
por <CODE>twm</CODE>.  Una vez que el proceso <CODE>twm</CODE> finalice, se
cerrar&aacute; el servidor X. Se puede hacer finalizar <CODE>twm</CODE> empleando los
men&uacute;s principales: presionando el bot&oacute;n 1 del rat&oacute;n sobre el fondo del
escritorio, se abrir&aacute; un men&uacute; emergente que permitir&aacute; <CODE>Exit Twm</CODE>. </P>
<P>Es preciso asegurarse de que el &uacute;ltimo comando de <CODE>.xinitrc</CODE> se
arranca con <CODE>exec</CODE>, y que no se coloca en modo de ejecuci&oacute;n
<EM>background</EM> o segundo plano (sin un ``&amp;'' al final de la l&iacute;nea).
De no ser as&iacute;, el servidor X morir&iacute;a tan pronto como se arrancasen los
clientes del fichero <CODE>.xinitrc</CODE></P>
<P>Alternativamente, se puede salir de X presionando la combinaci&oacute;n
<CODE>ctrl-alt-backspace</CODE>.  Esto matar&iacute;a al servidor X directamente,
saliendo del sistema de ventanas. </P>
<P>Lo anterior es una muy muy simple configuraci&oacute;n del escritorio. Multitud
de maravillosos programas y configuraciones estar&aacute;n disponibles con
trabajar un poco el fichero <CODE>.xinitrc</CODE>.  Por ejemplo, el gestor de
ventanas <CODE>fvwm</CODE> proporciona escritorio virtual, pudiendo
personalizarse colores, fuentes, tama&ntilde;o y posiciones de ventanas, y as&iacute;
seg&uacute;n le plazca a uno. A pesar de que el Sistema X Window pueda parecer un
tanto simplista en un principio, es extremadamente potente, ya que puede
ser personalizado para uno mismo. </P>
<P>Si es la primera vez que se encuentra con el entorno X Window, le
recomendamos encarecidamente hacerse con un libro como <EM>The X Window
System: A User's Guide</EM>.  El empleo y configuraci&oacute;n de X es demasiado
profundo para tratarlo aqu&iacute;. Ver las p&aacute;ginas <CODE>man</CODE> de <CODE>xterm</CODE>,
<CODE>oclock</CODE>, y <CODE>twm</CODE> para hacerse con pistas para ponerse al
d&iacute;a. </P>

<HR>
<A HREF="XFree86-Como-5.html">Anterior</A>
<A HREF="XFree86-Como-7.html">Siguiente</A>
<A HREF="XFree86-Como.html#toc6">Indice</A>
</BODY>
</HTML>
