<HTML>
<HEAD>
<TITLE>Linux XFree86 COMO: Requisitos de Hardware</TITLE>
</HEAD>
<BODY>
<A HREF="XFree86-Como-1.html">Anterior</A>
<A HREF="XFree86-Como-3.html">Siguiente</A>
<A HREF="XFree86-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Requisitos de Hardware</A></H2>


<P>Como en XFree86 versi&oacute;n 3.1.1, difundida en Febrero del 1995, son
soportados los chipsets que detallamos m&aacute;s adelante. La documentaci&oacute;n
incluida con su adaptador de v&iacute;deo deber&iacute;a especificar el chipset que
emplea. Si est&aacute; buscando un nueva tarjeta gr&aacute;fica, o va a comprar una
m&aacute;quina nueva que la incorpora, haga que el vendedor le especifique con
exactitud la marca, modelo, y chipset de la tarjeta.  Para ello, es
posible que el vendedor tenga que contactar con el servicio t&eacute;cnico para
tu propio beneficio; generalmente, los vendedores estar&aacute;n contentos de
hacerlo. </P>
<P>Muchos vendedores de hardware para PC dir&aacute;n que la tarjeta es una "SVGA
est&aacute;ndard" que "deber&iacute;a funcionar" en su sistema.  Explique que su
software (¡mencione LiNUX y XFree86!) no soporta todos los chipsets de
v&iacute;deo, y que debe tener informaci&oacute;n detallada. </P>
<P>Tambi&eacute;n se puede determinar el chipset de su tarjeta de v&iacute;deo ejecutando
el programa <CODE>SuperProbe</CODE> que incluye la distribuci&oacute;n de XFree86. 
Esto se trata con mayor detalle m&aacute;s adelante. </P>
<P>Son soportados los siguientes chipsets SVGA
<SL>N. del T. Como
comprender&aacute; el lector por la fecha de divulgaci&oacute;n del presente documento,
esta lista no es ni mucho menos actual; una visita a <CODE>www.xfree86.org</CODE>
es un buen m&eacute;todo para obtener informaci&oacute;n m&aacute;s reciente. Otros lugares de
inter&eacute;s: www.nine.com,(informaci&oacute;n sobre configuraci&oacute;nes LiNUX de sus
tarjetas) www.s3.com</SL>
: </P>
<P>
<UL>
<LI>    Tseng ET3000, ET4000AX, ET4000/W32</LI>
<LI>    Western Digital/Paradise PVGA1</LI>
<LI>    Western Digital WD90C00, WD90C10, WD90C11, WD90C24, WD90C30, WD90C31,
WD90C33</LI>
<LI>    Genoa GVGA</LI>
<LI>    Trident TVGA8800CS, TVGA8900B, TVGA8900C, TVGA8900CL, TVGA9000,
TVGA9000i, TVGA9100B, TVGA9200CX, TVGA9320, TVGA9400CX, TVGA9420</LI>
<LI>    ATI 18800, 18800-1, 28800-2, 28800-4, 28800-5, 28800-6, 68800-3,
68800-6, 68800AX, 68800LX, 88800</LI>
<LI>    NCR 77C22, 77C22E, 77C22E+</LI>
<LI>    Cirrus Logic CLGD5420, CLGD5422, CLGD5424, CLGD5426, CLGD5428,
CLGD5429, CLGD5430, CLGD5434, CLGD6205, CLGD6215,
CLGD6225, CLGD6235, CLGD6420</LI>
<LI>    Compaq AVGA</LI>
<LI>    OAK OTI067, OTI077</LI>
<LI>    Avance Logic AL2101</LI>
<LI>    MX MX68000, MX680010</LI>
<LI>    Video 7/Headland Technologies HT216-32</LI>
</UL>
</P>
<P>Los siguientes chipsets SVGA con prestaciones de aceleraci&oacute;n tambi&eacute;n son
soportados: </P>
<P>
<UL>
<LI>    8514/A (y cl&oacute;nicas genuinas)</LI>
<LI>    ATI Mach8, Mach32</LI>
<LI>    Cirrus CLGD5420, CLGD5422, CLGD5424, CLGD5426, CLGD5428, CLGD5429,
CLGD5430, CLGD5434, CLGD6205, CLGD6215, CLGD6225, CLGD6235</LI>
<LI>    S3 86C911, 86C924, 86C801, 86C805, 86C805i, 86C928, 86C864, 86C964</LI>
<LI>    Western Digital WD90C31, WD90C33</LI>
<LI>    Weitek P9000</LI>
<LI>    IIT AGX-014, AGX-015, AGX-016</LI>
<LI>    Tseng ET4000/W32, ET4000/W32i, ET4000/W32p</LI>
</UL>
</P>
<P>Las tarjetas que emplean estos chipsets son soportadas en todos las clases
de buses, incluyendo VLB y PCI. </P>
<P>Todo lo anterior es soportado tanto en modos monocromo y 256 colores, con
la excepci&oacute;n de los chipsets Avance Logic
<SL> N. del T. Atenci&oacute;n: 
esta tarjeta ha tenido una difusi&oacute;n <EM>muy</EM> amplia en Espa&ntilde;a.</SL>
,
MX y Video 7, que s&oacute;lo son soportados en el modo de 256 colores. Si su
tarjeta de v&iacute;deo tiene bastante DRAM instalada, muchos de los anteriores
chipsets
<SL>N. del T. Por propia experiencia, la Avance Logic tiene
id&eacute;nticas prestaciones con 1 &oacute; 2 megas de DRAM; no soporta m&aacute;s colores por
ampliarla a 2 megas :-(.</SL>
 son soportados en modos de 16 y 32
bits por pixel (m&aacute;s espec&iacute;ficamente, algunas tarjetas Mach32, P9000, S3 y
Cirrus). La configuraci&oacute;n corriente es 8 bits por pixel (osea, 256
colores). </P>
<P>Los servidores monocromos tambi&eacute;n soportan tarjetas VGA gen&eacute;ricas, y las
tarjetas monocromas Hercules, Hyundai HGC1280, Sigma LaserView, y Apollo
monochrome. En la Compaq AVGA, s&oacute;lo son soportados 64k de memoria de v&iacute;deo
para el servidor monocromo, y la GVGA no ha sido probada con m&aacute;s de 64k. </P>
<P>Esta lista crecer&aacute; indudablemente con el tiempo. Las notas de distribuci&oacute;n
de la versi&oacute;n actual de XFree86 contendr&aacute;n una relaci&oacute;n completa de los
chipsets de v&iacute;deo soportados. </P>
<P>Un problema al que se enfrentan los desarrolladores de XFree86 es que
ciertos fabricantes de tarjetas de v&iacute;deo no emplean mecanismos est&aacute;ndar
para determinar las frecuencias de reloj empleadas para controlar la
tarjeta. Algunos de ellos o no proporcionan especificaciones describiendo
c&oacute;mo programar la tarjeta, o exigen a los desarrolladores firmar una
declaraci&oacute;n de no-divulgaci&oacute;n para obtener la informaci&oacute;n.</P>
<P>Esto limita obviamente la libre distribuci&oacute;n del software XFree86, que es
algo que no est&aacute; dispuesto a hacer el equipo de desarrollo de XFree86.
Durante bastante tiempo, este ha sido un problema con determinadas
tarjetas de v&iacute;deo fabricadas por Diamond, pero al tiempo de la divulgaci&oacute;n
de la versi&oacute;n 3.1 de XFree86, Diamond ha comenzado a trabajar con el
equipo de desarrollo a fin de distribuir controladores de libre
distribuci&oacute;n para estas tarjetas. </P>
<P>La configuraci&oacute;n recomendada para XFree86 bajo LiNUX es una m&aacute;quina 486
con al menos 8 megabytes de RAM, y una tarjeta de v&iacute;deo con alguno de los
chipsets relacionados anteriormente. Para obtener unas prestaciones
&oacute;ptimas, sugerimos emplear una tarjeta aceleradora, como una tarjeta con
chipset S3. Se debe comprobar la documentaci&oacute;n de XFree86 y asegurarse de
que su tarjeta en particular es soportada antes de decidirse y adquirir
hardware costoso. Los &iacute;ndices comparativos de rendimiento para varias
tarjetas bajo XFree86 son enviadas regularmente a los newsgroups
<CODE>comp.windows.x.i386unix</CODE> y <CODE>comp.os.linux.x</CODE>. </P>
<P>Como nota al margen, mi sistema personal LiNUX es un 486DX2-66, 20
megabytes de RAM, equipado con un tarjeta de chipset VLB S3-864 con 2
megabytes de DRAM. He ejecutado benchmarks
<SL> N. del T. Programas
para evaluar las prestaciones de un sistema determinado.</SL>
 bajo X
en esta m&aacute;quina y en estaciones de trabajo Sun Sparc IPX. El sistema LiNUX
es a <EM>grosso modo</EM> 7 veces m&aacute;s r&aacute;pido que el Sparc IPX. (Para los
curiosos, XFree86-3.1 bajo LiNUX, se ejecuta a alrededor de 171,000
xstones; el Sparc IPX a alrededor de 24,000). </P>
<P>En general, XFree86 en un sistema LiNUX con tarjeta aceleradora le
proporcionar&aacute; muchas m&aacute;s prestaciones que las encontradas en estaciones de
trabajo UNIX comerciales (que generalmente utilizan simples
framebuffers
<SL> N. del T. Gen&eacute;ricamente, dispositivo f&iacute;sico capaz
de almacenar informaci&oacute;n sobre una imagen en memoria.</SL>
 para los
gr&aacute;ficos)</P>
<P>Su m&aacute;quina precisar&aacute; al menos 4 megabytes de RAM f&iacute;sica, y 16 megabytes de
RAM virtual global. (por ejemplo, 8 megas de f&iacute;sica y 8 megas de
swap
<SL> N. del T. Mecanismo por el cual se pasan a disco p&aacute;ginas de
memoria RAM cuando &eacute;sta se agota. En adelante, me referir&eacute; a este sistema
como <EM>paginaci&oacute;n</EM> tambi&eacute;n.</SL>
). </P>

<P>Recu&eacute;rdese que cuanta m&aacute;s RAM f&iacute;sica se tenga, menos paginar&aacute; el sistema
al y desde el disco cuando la memoria est&eacute; baja. Debido a que la
paginaci&oacute;n es inherentemente lenta (los discos son muy lentos comparados
con la memoria), el tener 8 megabytes o m&aacute;s de RAM es lo necesario para
hacer funcionar XFree86 confortablemente. </P>
<P>Un sistema con 4 megabytes
<SL>N. del T. Para aquellos que no puedan
disponer de m&aacute;s, o por razones de espacio en el HD, decir a t&iacute;tulo
informativo que existe el paquete <EM>Tiny-X</EM> para estos
casos.</SL>
de RAM f&iacute;sica podr&iacute;a funcionar <EM>mucho</EM> m&aacute;s lento
(hasta 10 veces) que uno con 8 o m&aacute;s megas. </P>

<HR>
<A HREF="XFree86-Como-1.html">Anterior</A>
<A HREF="XFree86-Como-3.html">Siguiente</A>
<A HREF="XFree86-Como.html#toc2">Indice</A>
</BODY>
</HTML>
