<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>El Mini-C&oacute;mo de Ultra-DMA en Linux: Interfaces UDMA en placa</TITLE>
 <LINK HREF="Ultra-DMA-Como-7.html" REL=next>
 <LINK HREF="Ultra-DMA-Como-5.html" REL=previous>
 <LINK HREF="Ultra-DMA-Como.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="Ultra-DMA-Como-7.html">Página siguiente</A>
<A HREF="Ultra-DMA-Como-5.html">Página anterior</A>
<A HREF="Ultra-DMA-Como.html#toc6">Índice general</A>
<HR>
<H2><A NAME="onboard"></A> <A NAME="s6">6. Interfaces UDMA en placa</A></H2>

<P>
<P>Estas son interfaces de dispositivo con capacidades UDMA incluidos dentro
de la placa madre. Utilizan los puertos de E/S est&aacute;ndares para IDE y por
ello son perfectamente operativos a velocidades lentas no-UDMA en
n&uacute;cleos 2.0.x sin parchear, como los que se usan para instalar Linux. Por
ello, no deber&iacute;an causar ning&uacute;n problema durante la instalaci&oacute;n, y
parchearlos para obtener la velocidad del UDMA es un lujo bien recibido
en vez de una necesidad.
<P>
<H2><A NAME="intel"></A> <A NAME="ss6.1">6.1 Intel FX, HX, VX, TX, y LX</A>
</H2>

<P>
<P>Gracias otra vez a Gadi por esta informaci&oacute;n:
<P>
<BLOCKQUOTE><CODE>
<PRE>
El soporte para el DMA bus mastering en el chipset Intel TX est&aacute;
disponible en el 2.0.31 y superior.
</PRE>
</CODE></BLOCKQUOTE>
<P>En viejos n&uacute;cleos (como el 2.0.30 de la Slackware 3.4), la interfaz ser&aacute;
usada en el modo EIDE lento.
En ambos casos, ser&aacute; autom&aacute;ticamente detectado por el n&uacute;cleo y
no tendr&aacute; ning&uacute;n problema para usarlo.
<P>El soporte para usar el UDMA completo con estos chipsets se incluye en el
parche udma-generic; vea 
<A HREF="Ultra-DMA-Como-7.html#generic">UDMA-Generic</A>.
<P>
<H2><A NAME="via"></A> <A NAME="ss6.2">6.2 El VIA VP2 y Chipsets relacionados</A>
</H2>

<P>
<P>Esta interfaz puede ser autodetectada y usada en modo EIDE por un n&uacute;cleo 
sin parchear pero, si tiene uno de estos, querr&aacute; usar un parche para que
pueda obtener mayores tasas de transferencia y dejar en la cuneta esos
molestos mensajes "unknown PCI device" (dispositivo PCI desconocido).
<P>Uno de ellos se puede obtener en
<A HREF="http://www.ipass.net/~prefect">http://www.ipass.net/~prefect/</A>; est&aacute; dise&ntilde;ado para el
chipset VIA VP2/97, que puede encontrarse en las placas madres de FIC
modelos PA-2007 y PA-2011, pero puede funcionar en chipsets relacionados.
Se ha informado que funciona con el chipset m&aacute;s moderno VIA VP3.
<P>N&oacute;tese que este es un parche que s&oacute;lo soporta el modo Bus Mastering, no
el modo UDMA completo, pero todav&iacute;a es mejor que el modo EIDE normal.
Siga las instrucciones en el sitio Web del parche para activar el modo
BMDMA.
<P>Hay otro parche que soporta el modo UDMA completo en
<A HREF="http://www.pyreneesweb.com/Udma/udma.html">http://www.pyreneesweb.com/Udma/udma.html</A>,
dise&ntilde;ado para el VIA VT82C586B y que debe funcionar para los chipsets VP2,
VP3, VPX, P6 y AGP Apollo. Siga las instrucciones para la instalaci&oacute;n y
activaci&oacute;n del modo UDMA, aunque es recomendable que haga una copia de
seguridad de todos los datos que desee guardar, ya que hay problemas
potenciales con placas madres incompatibles. Pero, si funciona, lo har&aacute;
sin problemas.
<P>N&oacute;tese que el chipset VP1 no funciona con estos parches, aunque est&aacute;
soportado por el parche 
<A HREF="Ultra-DMA-Como-7.html#generic">UDMA-Generic</A>.
<P>
<H2><A NAME="ss6.3">6.3 TX Pro y otras placas ``Pro''</A>
</H2>

<P>
<P>Actualmente el UDMA no est&aacute; soportado para las placas madre TX Pro. Son
diferentes a las TX mobo, y aparentemente no informan correctamente de
sus capacidades de DMA, lo cual causa el problema. He o&iacute;do que alguien
est&aacute; trabajando en ello, por lo que podr&iacute;a aparecer un parche en el
futuro.
<P>
<HR>
<A HREF="Ultra-DMA-Como-7.html">Página siguiente</A>
<A HREF="Ultra-DMA-Como-5.html">Página anterior</A>
<A HREF="Ultra-DMA-Como.html#toc6">Índice general</A>
</BODY>
</HTML>
