<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>El Mini-C&oacute;mo de Ultra-DMA en Linux: Introducci&oacute;n</TITLE>
 <LINK HREF="Ultra-DMA-Como-2.html" REL=next>

 <LINK HREF="Ultra-DMA-Como.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Ultra-DMA-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Ultra-DMA-Como.html#toc1">Índice general</A>
<HR>
<H2><A NAME="main-intro"></A> <A NAME="s1">1. Introducci&oacute;n</A></H2>

<P>
<P>Este documento pretende explicar c&oacute;mo usar los discos duros con interfaces
Ultra-DMA, tambi&eacute;n conocidas como Ultra-ATA y Ultra33, en Linux. A pesar 
de que en algunos casos no encierran dificultad, pueden hacerse algunas
modificaciones con el fin de aumentar las prestaciones. Adem&aacute;s,
comprobar&aacute; que, en ocasiones, el uso de estos dispositivos no es tan trivial.
<P>
<H2><A NAME="disclaimer"></A> <A NAME="ss1.1">1.1 Renuncia de responsabilidad</A>
</H2>

<P>
<P>La informaci&oacute;n que contiene este documento es, hasta donde llega mi
conocimiento, correcta, por lo que deber&iacute;a funcionar. De todas maneras, 
a parte de la posible existencia de errores ortogr&aacute;ficos, cabe la posibilidad
de que lo descrito en este documento no funcione en su sistema, debido a
alg&uacute;n tipo de incompatibilidad. Es por ello que le recomiendo que, antes de
comenzar a manipular su disco duro, <B>¡HAGA COPIAS DE SEGURIDAD DE TODO
AQUELLO QUE QUIERA GUARDAR!</B> Si no acostumbra a hacerlas, esta es una buena
ocasi&oacute;n para comenzar.
<P>
<H2><A NAME="credits"></A> <A NAME="ss1.2">1.2 Reconocimientos</A>
</H2>

<P>
<P>
<A HREF="mailto:giovanni@sudfr.com">Michel Aubry</A> - Parche
UDMA para VIA en &lt;=2.0.33
y m&aacute;s informaci&oacute;n, Gran Parche Unificado de UDMA para 2.0.34+
<P>
<A HREF="mailto:andrebalsa@altern.org">Andrew Balsa</A> - Provey&oacute;
informaci&oacute;n general sobre UDMA y el parche udma-generic para Intel TX,
SiS, y VP1 en &lt;=2.0.33; tambi&eacute;n Gran Parche Unificado de UDMA para
2.0.34+
<P>Maxime Baudin - Traducci&oacute;n al Franc&eacute;s
<P>Bokonon - ``Controladora'' vs. ``interfaz''
<P>
<A HREF="mailto:prefect@ipass.net">John G.</A> -
Parche para VIA VP2 en &lt;=2.0.33 e informaci&oacute;n
<P>Martin Gaitan - Instalaci&oacute;n de ide0/ide1 para Promise Ultra33
<P>
<A HREF="mailto:hedrick@Astro.Dyer.Vanderbilt.Edu">Andre M. Hedrick</A> -
Gran Parche Unificado de UDMA para 2.0.34, Artop ATP850UF
<P>Norman Jacobowitz - Me pidi&oacute; a&ntilde;adir informaci&oacute;n sobre VP3
<P>John Levon - Informaci&oacute;n sobre la TX Pro mobos
<P>Peter Monta - Informaci&oacute;n sobre el uso de dos tarjetas Ultra33
<P>Masayoshi Nakano - Traducci&oacute;n al Japon&eacute;s
<P>
<A HREF="mailto:gadio@netvision.net.il">Gadi Oxman</A> - El parche
de la Promise Ultra33 para &lt;=2.0.34 y n&uacute;meros secretos
para el truco
<P>Andy Pearce - Sugiri&oacute; a&ntilde;adir informaci&oacute;n de los ficheros de dispositivo
adicionales para hde-h
<P>
<A HREF="mailto:pink@roedu.net">Andrei Pitis</A> - Parche para LILO
<P>
<A HREF="mailto:brion@pobox.com">Brion Vibber</A> - Este documento
<P>
<H2><A NAME="history"></A> <A NAME="ss1.3">1.3 Historia del Documento</A>
</H2>

<P>
<P>v2.0, 7 Agosto 1998: actualizaci&oacute;n y total reestructuraci&oacute;n de la
informaci&oacute;n sobre interfaces de la placa madre y tarjetas externas,
informaci&oacute;n sobre el Gran Parche Unificado de UDMA (una parte del parche
Jumbo) para 2.0.35, cr&eacute;ditos en orden alfab&eacute;tico por el apellido, sustituci&oacute;n
del t&eacute;rmino ``controladora'' por ``interfaz'' (m&aacute;s correcto desde
el punto de vista t&eacute;cnico), nueva informaci&oacute;n sobre activaci&oacute;n/desactivaci&oacute;n
de UDMA, a&ntilde;adida una lista de problemas ¡y m&aacute;s cosas!
<P>v1.45, 6 Julio 1998: peque&ntilde;as actualizaciones, parche de la Promise Ultra33
para el n&uacute;cleo 2.0.34 en la Red Hat 5.1 y parche que permite a LILO
arrancar desde interfaces PCI como la Promise Ultra33.
<P>v1.41, 3 Mayo 1998: arreglados unos cuantos errores ortogr&aacute;ficos y presencia
de los traductores en los cr&eacute;ditos.
<P>v1.4, 28 Abril 1998: parche UDMA-Generic, nueva informaci&oacute;n general y
aparici&oacute;n de una secci&oacute;n sobre copias.
<P>v1.3, 5 Marzo 1998: informaci&oacute;n sobre VIA VP3, mejores instrucciones de
``parcheado'' y enlace al parche de Promise m&aacute;s reciente.
<P>v1.2, 27 Enero 1998: informaci&oacute;n adicional del truco para la Promise.
<P>v1.1, 21 Enero 1998: nueva informaci&oacute;n acerca del chipset VIA, instalaci&oacute;n
de la Promise Ultra33 y activaci&oacute;n de los modos de transferencia Bus Master y
UDMA.
<P>v1.0, 19 Enero 1998: primera versi&oacute;n escrita en SGML. Bastante completa.
<P>
<H2><A NAME="copying"></A> <A NAME="ss1.4">1.4 Copias</A>
</H2>

<P>
<P>Este documento puede ser copiado libremente y/o distribuido para prop&oacute;sitos
informativos. No puede ser modificado, excepto para cambio de formato,
sin la autorizaci&oacute;n del autor. Si desea traducir este documento a otro
idioma lo puede hacer pero, de todas formas, deber&aacute; contactar primero con
el autor para que las versiones actualizadas puedan ser enviadas a los
traductores, as&iacute; como al Linux Documentation Project.
<P>
<HR>
<A HREF="Ultra-DMA-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Ultra-DMA-Como.html#toc1">Índice general</A>
</BODY>
</HTML>
