<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>El Mini-C&oacute;mo de Ultra-DMA en Linux: Activando y desactivando el UDMA</TITLE>
 <LINK HREF="Ultra-DMA-Como-9.html" REL=next>
 <LINK HREF="Ultra-DMA-Como-7.html" REL=previous>
 <LINK HREF="Ultra-DMA-Como.html#toc8" REL=contents>
</HEAD>
<BODY>
<A HREF="Ultra-DMA-Como-9.html">Página siguiente</A>
<A HREF="Ultra-DMA-Como-7.html">Página anterior</A>
<A HREF="Ultra-DMA-Como.html#toc8">Índice general</A>
<HR>
<H2><A NAME="activate"></A> <A NAME="s8">8. Activando y desactivando el UDMA</A></H2>

<P>
<P>Normalmente, el n&uacute;cleo compatible con UDMA autom&aacute;ticamente activar&aacute;
este soporte para los dispositivos e interfaces que lo admitan. De
todas maneras, desde el n&uacute;cleo 2.1.113 se desactivan las transferencias
con DMA por defecto a menos que haya configurado su n&uacute;cleo 
espec&iacute;ficamente para autom&aacute;ticamente activarlo. Esto podr&iacute;a parecer un
error, pero algunos dispositivos e interfaces no funcionan de
forma adecuada con el DMA activado; vea la Lista Negra del UDMA m&aacute;s
adelante.
<P>
<H2><A NAME="bootparam"></A> <A NAME="ss8.1">8.1 Usando los par&aacute;metros de arranque del n&uacute;cleo</A>
</H2>

<P>
<P>En n&uacute;cleos 2.1.113 y en adelante, puede activar el DMA para ambos
dispositivos de una interfaz IDE usando el par&aacute;metro del n&uacute;cleo 
<CODE>ideX=dma</CODE>, donde X es el n&uacute;mero de la interfaz (el primero es el 0).
<P>Los par&aacute;metros de arranque del n&uacute;cleo pueden activarse mediante LILO,
LOADLIN o desde la mayor&iacute;a de los programas de arranque de Linux. Para m&aacute;s
informaci&oacute;n vea el 
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/Bootdisk-HOWTO.html">Bootdisk HOWTO</A>.
<P>
<P>
<H2><A NAME="hdparm"></A> <A NAME="ss8.2">8.2 Usando hdparm</A>
</H2>

<P>
<P><CODE>hdparm</CODE> es un programa usado para modificar los par&aacute;metros de los
discos duros en Linux. Entre otras cosas puede usarlo para activar o
desactivar el UDMA para un dispositivo y comprobar su tasa de
transferencia sostenida.
<P>La mayor&iacute;a de las distribuciones de Linux incluyen <CODE>hdparm</CODE>, pero
necesitar&aacute; aplicar un parche para incluir el soporte UDMA. Puede obtener
<CODE>hdparm</CODE> de 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/hardware/hdparm-3.3.tar.gz">ftp://sunsite.unc.edu/pub/Linux/system/hardware/hdparm-3.3.tar.gz</A> 
y el parche de 
<A HREF="http://pobox.com/~brion/linux/hdparm-3.3-udma.patch.gz">http://pobox.com/~brion/linux/hdparm-3.3-udma.patch.gz</A>.
<P>Compile e instale de esta manera:
<P>
<BLOCKQUOTE><CODE>
<PRE>
cd /usr/src
tar zxvf /tmp/download/hdparm-3.3.tar.gz
cd hdparm-3.3
gzip -cd /tmp/download/hdparm-3.3-udma.patch.gz | patch -p0
make
if [ -f /sbin/hdparm ]; then rm -f /sbin/hdparm ; fi
make install
cp /usr/local/sbin/hdparm /sbin/hdparm
</PRE>
</CODE></BLOCKQUOTE>
<P><B>Para activar el UDMA para un disco duro:</B> <CODE>hdparm -d1 /dev/hda</CODE>
<P><B>Para desactivar el UDMA de un disco duro:</B> <CODE>hdparm -d0 /dev/hda</CODE>
<P><B>Para medir la tasa de transferencia de un disco:</B> <CODE>hdparm -Tt /dev/hda</CODE>
<P><B>Para ver qu&eacute; opciones est&aacute;n activadas para un disco:</B> <CODE>hdparm /dev/hda</CODE>
<P><B>Para ver m&aacute;s informaci&oacute;n de su disco:</B> <CODE>hdparm -i
/dev/hda</CODE>
<P>Para informaci&oacute;n m&aacute;s detallada lea la p&aacute;gina de manual (``<CODE>man 8 hdparm</CODE>'').
<P>
<HR>
<A HREF="Ultra-DMA-Como-9.html">Página siguiente</A>
<A HREF="Ultra-DMA-Como-7.html">Página anterior</A>
<A HREF="Ultra-DMA-Como.html#toc8">Índice general</A>
</BODY>
</HTML>
