<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>El Mini-C&oacute;mo de Ultra-DMA en Linux: ¿Qu&eacute; es Ultra-DMA y para qu&eacute; lo quiero?</TITLE>
 <LINK HREF="Ultra-DMA-Como-3.html" REL=next>
 <LINK HREF="Ultra-DMA-Como-1.html" REL=previous>
 <LINK HREF="Ultra-DMA-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Ultra-DMA-Como-3.html">Página siguiente</A>
<A HREF="Ultra-DMA-Como-1.html">Página anterior</A>
<A HREF="Ultra-DMA-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="udma-intro"></A> <A NAME="s2">2. ¿Qu&eacute; es Ultra-DMA y para qu&eacute; lo quiero?</A></H2>

<P>
<P>Aqu&iacute; tiene una breve descripci&oacute;n de las tecnolog&iacute;as de dispositivos
basadas en IDE:
<P>
<H2><A NAME="classic"></A> <A NAME="ss2.1">2.1 IDE, EIDE, y ATAPI</A>
</H2>

<P>
<P>Estas son tecnolog&iacute;as antiguas. La mayor&iacute;a de los discos duros e interfaces de
disco que puede comprar, o que posiblemente ya est&eacute; usando, son de tipo EIDE.
No obstante, abundan cada vez m&aacute;s aquellos discos duros que cuentan con una
interfaz UDMA.
<P>
<H2><A NAME="bm"></A> <A NAME="ss2.2">2.2 Bus Master DMA</A>
</H2>

<P>
<P>El Bus Master DMA es una tecnolog&iacute;a para incrementar la velocidad de las
transferencias de datos en los discos duros. Dicha tecnolog&iacute;a requiere
soporte de la placa madre y la BIOS, y alg&uacute;n soporte adicional por parte
del disco.
<P>Puede aprender m&aacute;s sobre el tema en 
<A HREF="http://developer.intel.com/design/pcisets/busmastr/FAQs.htm">http://developer.intel.com/design/pcisets/busmastr/FAQs.htm</A>.
<P>
<H2><A NAME="udma"></A> <A NAME="ss2.3">2.3 Ultra-DMA o Ultra-ATA o Ultra33 o...</A>
</H2>

<P>
<P>El Ultra-DMA tiene muchos nombres, pero nosotros lo denotaremos aqu&iacute;
por UDMA.
<P>UDMA es una tecnolog&iacute;a m&aacute;s avanzada y que provee unas transferencias
mucho m&aacute;s r&aacute;pidas (hasta 33.3 MB/s) que la EIDE, siendo su precio
m&aacute;s reducido que el los dispositivos SCSI. Muchos de los nuevos ordenadores
incorporan grandes discos e interfaces UDMA. Adem&aacute;s, es posible a&ntilde;adir una
tarjeta de interfaz UDMA (como la Promise Ultra33) a un sistema ya existente,
pudiendo aumentar la velocidad de transferencia de sus discos duros incluso
si estos no son UDMA.
<P>Puede aprender m&aacute;s detalles sobre UDMA en
<A HREF="http://www.quantum.com/src/whitepapers/ultraata/">http://www.quantum.com/src/whitepapers/ultraata/</A><P>N&oacute;tese que la longitud de cable para la conexi&oacute;n del UDMA debe ser menor
que la de un cable para DMA normal. Lo ideal es que est&eacute; por debajo de los
30 cm (12&quot;).
<P>
<H2><A NAME="speed"></A> <A NAME="ss2.4">2.4 ¿Exactamente c&oacute;mo de ``Ultra'' es?</A>
</H2>

<P>
<P>Antes de ir m&aacute;s lejos, aclaremos una equivocaci&oacute;n. Los 33 MB/seg son la
<B>tasa de transferencia instant&aacute;nea</B> (burst transfer rate), y es algo
que no ver&aacute; muy frecuentemente. Para explicarlo, aqu&iacute; hay un peque&ntilde;o texto
del UDMA.txt (udma-generic):
<P>
<BLOCKQUOTE><CODE>
<PRE>
Las tasas de transferencia instant&aacute;nea se supone que van
desde los 16,6MB/s (modo PIO 4) a 16,6MB/s (DMA modo 2) hasta 33MB/s
(UDMA). En su parche contra el n&uacute;cleo 2.1.55, Kim-Hoe Pang realmente
analiz&oacute; las tasas de transferencia instant&aacute;nea en UDMA con un analizador
l&oacute;gico: 60ns/palabra, lo que se traslada a 33MB/s.

N&oacute;tese que las tasas de transferencia instant&aacute;nea s&oacute;lo afectan a las
transferencias de datos desde/hacia la cach&eacute; del disco EIDE (476kB para
el disco de 6,4GB de IBM), y no son particularmente relevantes para la
mayor&iacute;a de los usuarios de Linux.

El n&uacute;cleo de Linux usa tanta memoria RAM como es posible para hacer de
cach&eacute; en los accesos a los datos del disco duro, y si los datos no est&aacute;n
en la cach&eacute; del n&uacute;cleo, es improbable que est&eacute;n en la cach&eacute; del disco duro
(mucho m&aacute;s peque&ntilde;a).
</PRE>
</CODE></BLOCKQUOTE>
<P>Mucho m&aacute;s relevante es la <B>tasa de transferencia sostenida</B> (sustained
transfer rate), que es la velocidad a la cual los datos pueden ser
transferidos desde el disco a la memoria principal, donde pueden usarse.
Una manera f&aacute;cil de medir esta tasa es usar <CODE>hdparm</CODE>, por ejemplo
``<CODE>hdparm -Tt /dev/hda</CODE>'' para el primer dispositivo IDE.
<P>
<BLOCKQUOTE><CODE>
<PRE>
Aqu&iacute; hay algunos datos recogidos despu&eacute;s de pruebas muy extensas, usando
la utilidad hdparm (escrita por Mark Lord):

Tasas de transferencia bajo Linux con PIO modo 4:   +/- 5,2MB/s

Tasas de transferencia bajo Linux con DMA modo 2:   +/- 7,2MB/s

Tasas de transferencia bajo Linux con UDMA modo 2:  +/- 9,8MB/s
</PRE>
</CODE></BLOCKQUOTE>
<P>Como puede comprobar, UDMA es todav&iacute;a casi el doble de r&aacute;pido que un EIDE
normal y significativamente m&aacute;s r&aacute;pido que el bus mastering DMA normal.
<P>
<H2><A NAME="udma-vs-scsi"></A> <A NAME="ss2.5">2.5 UDMA comparado con SCSI</A>
</H2>

<P>
<P>No tengo grandes n&uacute;meros para ofrecerle, pero el consenso generalizado es
que el SCSI de alto nivel ofrece mejores prestaciones que el UDMA. De
todas formas, si ha echado un vistazo &uacute;ltimamente a los precios de los
discos duros, habr&aacute; notado que tienden a ser mucho m&aacute;s baratos. La
relaci&oacute;n prestaciones/precio favorece al UDMA en la mayor&iacute;a de los casos.
<P>
<HR>
<A HREF="Ultra-DMA-Como-3.html">Página siguiente</A>
<A HREF="Ultra-DMA-Como-1.html">Página anterior</A>
<A HREF="Ultra-DMA-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
