<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>El Mini-C&oacute;mo de Ultra-DMA en Linux: Problemas</TITLE>
 <LINK HREF="Ultra-DMA-Como-10.html" REL=next>
 <LINK HREF="Ultra-DMA-Como-8.html" REL=previous>
 <LINK HREF="Ultra-DMA-Como.html#toc9" REL=contents>
</HEAD>
<BODY>
<A HREF="Ultra-DMA-Como-10.html">Página siguiente</A>
<A HREF="Ultra-DMA-Como-8.html">Página anterior</A>
<A HREF="Ultra-DMA-Como.html#toc9">Índice general</A>
<HR>
<H2><A NAME="s9">9. Problemas</A></H2>

<H2><A NAME="blacklist"></A> <A NAME="ss9.1">9.1 La Lista Negra del UDMA</A>
</H2>

<P>
<P>Los siguientes dispositivos est&aacute;n en la ``lista negra''. <B>No</B> debe
usar el UDMA con ellos, ya que podr&iacute;a causar corrupci&oacute;n en los datos.
<P>
<UL>
<LI>Western Digital WDC AC22100H</LI>
</UL>
<P>La parte de UDMA en el parche Jumbo-2.0.35-9 deshabilita autom&aacute;ticamente
el DMA para este dispositivo.
<P>
<H2><A NAME="ss9.2">9.2 ¿Va usted demasiado deprisa?</A>
</H2>

<P>
<P>Si lo est&aacute; haciendo, ¡cuidado! Aqu&iacute; tiene un trozo de la documentaci&oacute;n de
udma-generic:
<P>
<BLOCKQUOTE><CODE>
<PRE>
NO SE PASE EN LA VELOCIDAD DE RELOJ del bus PCI. 37'5MHz es la velocidad
m&aacute;xima soportada por el bus PCI. Algunos (supuestamente compatibles)
dispositivos UDMA nunca alcanzar&aacute;n los 37'5MHz, pero estar&aacute; correcto a
33'3MHz.

En cualquier caso, NUNCA, NUNCA ponga el bus PCI a 41'5MHz.

La configuraci&oacute;n RECOMENDADA para su seguridad es 33MHz.
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss9.3">9.3 ¿Su BIOS est&aacute; actualizada?</A>
</H2>

<P>
<P>Aqu&iacute; tiene otro trozo de los documentos de udma-generic:
<P>
<BLOCKQUOTE><CODE>
<PRE>
El trabajo real que involucra el configurar los chips para las
transferencias de DMA se realiza en su mayor parte por la BIOS de cada
placa madre. Por supuesto, uno espera que la BIOS haya sido programada
correctamente...

Por ejemplo, las placas madres ASUS SP-97v con su BIOS original (Rev.
1.03) no funcionar&iacute;an correctamente con el controlador modificado de Linux,
ni en el modo DMA 2 ni en los modos UDMA; funcionar&iacute;a correctamente
usando el modo PIO 4 o bajo Windows 95 en cualquier modo. Obtuve la
&uacute;ltima imagen de la BIOS (Rev. 1.06) de la Web de ASUS y la copi&eacute; en la
EPROM de mi BIOS. Ha funcionado perfectamente desde entonces (a
velocidades de bus de 66MHz).

Lo que esto nos dice es que la BIOS configura el controlador de DMA con
par&aacute;metros de temporizaci&oacute;n espec&iacute;ficos (ciclos de `active pulse' y
`recovery clock'). Mi revisi&oacute;n inicial de BIOS probablemente ten&iacute;a mal
esos tiempos. Dado que el controlador de Windows 95 modifica estos
tiempos por s&iacute; mismo (no depende de la BIOS el configurar los par&aacute;metros
de temporizaci&oacute;n del controlador de disco), solo ten&iacute;a problemas
inicialmente con el controlador de Linux, mientras que en Windows 95
funcionaba bien.

Por eso, deje que lo vuelva a repetir: este controlador de (U)DMA para
Linux depende de la BIOS para una correcta configuraci&oacute;n. Si tiene problemas,
primero compruebe que tiene la &uacute;ltima revisi&oacute;n de la BIOS para su placa madre.

[...]

Las nuevas revisiones de las BIOS pueden obtenerse desde el sitio Web del
fabricante de su placa madre. Escribir la nueva imagen de la BIOS es una
operaci&oacute;n simple pero en la que uno debe seguir estrictamente los pasos
explicados en el manual de la placa.

Las &uacute;ltimas revisiones de las BIOS Award parecen ser estables con el
UDMA. Cualquiera con fecha de 1998 ser&iacute;a correcta.
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="help"></A> <A NAME="ss9.4">9.4 ¡Si todav&iacute;a no puede hacer que funcione!</A>
</H2>

<P>
<P>Si nada de este documento parece ayudarle, o al menos no es suficiente
para hacer que su m&aacute;quina funcione, su mejor apuesta consiste en escribir
un mensaje que describa sus dificultades exactamente, de qu&eacute; tipo de
interfaz UDMA dispone, si est&aacute; en la placa o es una tarjeta externa, si
su disco actual es UDMA o s&oacute;lo EIDE, exactamente qu&eacute; configuraci&oacute;n de
dispositivos tiene, que versi&oacute;n (distribuci&oacute;n y versi&oacute;n del n&uacute;cleo a ser
posible) de Linux est&aacute; usando, y m&aacute;ndelo al grupo de noticias 
<A HREF="news:comp.os.linux.hardware">comp.os.linux.hardware</A>.
Probablemente obtendr&aacute; una ayuda pronto.
<P>
<HR>
<A HREF="Ultra-DMA-Como-10.html">Página siguiente</A>
<A HREF="Ultra-DMA-Como-8.html">Página anterior</A>
<A HREF="Ultra-DMA-Como.html#toc9">Índice general</A>
</BODY>
</HTML>
