<HTML>
<HEAD>
<TITLE>Linux ifmail-COMO en Castellano: El proceso del correo de Fido en Unix </TITLE>
</HEAD>
<BODY>
<A HREF="Ifmail-Como-1.html">Anterior</A>
<A HREF="Ifmail-Como-3.html">Siguiente</A>
<A HREF="Ifmail-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. El proceso del correo de Fido en Unix </A></H2>


<P>Antes de entrar a ver qu&eacute; programas hay que configurar,
intentaremos deducirlo siguiendo el camino que recorren los mensajes desde
que son escritos. </P>
<P>Empecemos con los NETs, los mensajes privados. En Unix, los NETs
se van a convertir en <B>correo de Internet</B>, es decir, va a quedar
almacenado en el buz&oacute;n del usuario, <CODE>/var/spool/mail/usuario</CODE>. Y
para escribir un NET se usan los programas de correo habituales, eligiendo
una direcci&oacute;n de Fido en formato Internet (por ejemplo,
Juan.Jose.Amor@p19.f12.n341.z2.fidonet.org ). </P>
<P>Cuando escribimos un mensaje, &eacute;ste es enviado al
<CODE>sendmail</CODE>, quien debe estar configurado para enviar a Fido solo
los mensajes de Fido (es decir, los mensajes para el dominio fidonet.org). 
Los dem&aacute;s ir&aacute;n a Internet. Lo que sendmail hace es enviar el mensaje al
conversor Internet &lt;-&gt; FidoNet, ifmail. </P>
<P>Cuando recibimos un paquete con NETs, ifmail se encarga de
convertirlos a mensajes de Internet y entreg&aacute;rselos a sendmail. </P>
<P>Vamos ahora con las &aacute;reas de ECHO. En Internet, el equivalente es
USENET (las news). Por lo tanto, necesitamos un lector de News, que puede
ser, el pine, el tin o incluso el Netscape. Cuando escribamos un art&iacute;culo,
&eacute;ste es enviado a un servidor de news que habr&aacute; que configurar (INN).
Luego, a la hora de empaquetar los mensajes, se llamar&aacute; a un script que,
ejecutando <CODE>ifnews</CODE>, dejar&aacute; los paquetes listos para su env&iacute;o al
nodo de Fido. </P>

<H2><A NAME="ss2.1">2.1 ¿Qu&eacute; programas hay que configurar entonces? </A></H2>


<P>Vamos a tener que aprender a tocar la configuraci&oacute;n de unos
cuantos programas. De la secci&oacute;n anterior se deducen los siguientes: </P>
<P>
<UL>
<LI> Paquete ifmail. Hay que configurar tanto la parte de empaquetado
(ifpack, iftoss), como la de traducci&oacute;n Internet &lt;-&gt; FidoNet, como
la del programa de llamada (ifcico).</LI>
<LI> Sendmail.</LI>
<LI> Servidor de News (INN).</LI>
<LI> Adem&aacute;s, necesitar&eacute;is los correspondientes programas cliente: un
lector de correo (como el <CODE>pine</CODE>) y tal vez un lector de noticias
(el propio <CODE>pine</CODE> te vale, aunque igual os gusta m&aacute;s el
<CODE>tin</CODE>). 
</LI>
</UL>
</P>
<P>O sea, adem&aacute;s de entender de qu&eacute; va esto de hacerse punto (que no
es poco) habr&aacute; que entend&eacute;rselas con el cr&iacute;ptico sendmail.cf y con los
ficheros de INN. Si adem&aacute;s se quieren tener News de Internet, habr&aacute; que
pelearse con otro programa (¡otro!), el SUCK. </P>
<P>Casi nada. En fin, vayamos por partes.</P>


<HR>
<A HREF="Ifmail-Como-1.html">Anterior</A>
<A HREF="Ifmail-Como-3.html">Siguiente</A>
<A HREF="Ifmail-Como.html#toc2">Indice</A>
</BODY>
</HTML>
