<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_0.6">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Software Development">
 <TITLE>Software Development : La Sintaxis del Tcl</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="30%" >
<TR>
<TD><img SRC="../../common/images/Brent-Welch.jpg" ALT="[Photo of the Author]" >
<BR>por  <a href="mailto:welch@acm.org">Brent B. Welch</a>
<BR><BR><I>Sobre el Author:</I><BR>
Brent Welch se divierte construyendo el website www.scriptics.com, incluyendo
una base de datos comentada con URLs sobre el lenguaje Tcl (el 
<it>
Tcl Resource
Center
</it>
) y la infraestructura de ecommerce para el producto TclPro.
Tambi&eacute;n ha realizado varias aplicaciones grandes en Tcl/Tk, incluyendo
el servidor TclHttpd, que ejecuta www.scriptics.com, el interface de usuario 
de correo Exmh y el editor de HTML webtk. Es el autor de 
<it>
Practical
Programming in Tcl and Tk
</it>
.

Welch recibi&oacute;  BS (
<it>
Bachellor in Sciences
</it>
 en Ingenier&iacute;a
Aeroespacial en la Universidad de Colorado en Boulder (1982) y un MS
(
<it>
master in Science
</it>
) en Inform&aacute;tica por la Universidad de
California en Berkeley (1986), y es doctor en Inform&aacute;tica por 
la Universidad de California en Berkeley (1990). Anteriormente
Welch fue miembro del equipo de investigaci&oacute;n del 
<it>
Palo Alto
Research Center
<it>
 de Xerox
</font>
 trabajando en sistemas distribuidos,
y m&aacute;s tarde fue miembro de el equipo Tcl/Tk de los laboratorios
de Sun Microsystems. Es tambi&eacute;n miembro de ACM
y de la IEEE Computer Society.

Home Page: http://www.beedub.com/

<P><FONT COLOR="#336633">Contenidos</FONT>:
<OL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n a la Sintaxis del Tcl</A></LI>
  <LI><A HREF="#lfindex1">Un Peque&ntilde;o Ejemplo</A></LI>
  <LI><A HREF="#lfindex2">Agrupando y Sustituyendo</A></LI>
  <LI><A HREF="#lfindex3">Otro Ejemplo</A></LI>
  <LI><A HREF="#lfindex4">Ejecuci&oacute;n de Comandos</A></LI>
  <LI><A HREF="#lfindex5">Un &uacute;ltimo Ejemplo</A></LI>
  <LI><A HREF="#lfindex6">Lecturas Complementarias</A></LI>
</OL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>La Sintaxis del Tcl</H2>
 <img SRC="../../common/images/illustration110.gif" ALT="[Ilustration]" HSPACE=10 height=181 width=120><P><FONT COLOR="#336633">Resumen</FONT>:
<P>

Este art&iacute;culo explica algunos conceptos b&aacute;sicos y la sintaxis
del lenguaje Tcl.

</P><HR size="2" noshade><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n a la Sintaxis del Tcl</H2>

Para ser un lenguaje de scripts, Tcl tiene una sintaxis bastante simple.

<dl>
<dt><code>cmd arg arg arg</code></dt>
<dd>Un comando Tcl esta formado por palabras separadas por espacios en blanco.
La primera palabra es el nombre del comando, y las restantes palabras son
argumentos para el comando.</dd>

<dt><code>$foo</code></dt>
<dd>El signo del d&oacute;lar ($) sustituye el valor de una variable. En este
ejemplo, el nombre de la variable es <tt>foo</tt>.</dd>

<dt><code>[clock seconds]</code></dt>
<dd>Los corchetes ejecutan comandos anidados. Por ejemplo, si quieres pasar
el resultado de un comando como argumento para otro, debes usar esta sintaxis.
En este ejemplo, el comando anidado es clock seconds, el cual devuelve
la hora actual en segundos.</dd>

<dt><code>"lo que sea"</code></dt>
<dd>Las comillas agrupan palabras que se pasan al comando como un &uacute;nico
argumento. Los corchetes y el signo del d&oacute;lar son reconocidos e
interpretados adecuadamente aunque se encuentren dentro de las comillas.</dd>

<dt><code>{lo que sea}</code></dt>
<dd>Las llaves tambi&eacute;n agrupan palabras en argumentos simples. En este
caso, sin embargo, los elementos que haya dentro de las llaves no son interpretados.</dd>

<dt><code>\</code></dt>
<dd>La barra invertida (\) se usa para expresar caracteres especiales. Por
ejemplo, \n genera una nueva linea. La barra invertida tambi&eacute;n se
usa para "anular" el significado especial del signo del d&oacute;lar, comillas,
corchetes, y parentesis (ser&aacute;n tomados como caracteres normales).</dd>
</dl>

<A NAME="lfindex1">&nbsp;</A>
<H2>Un Peque&ntilde;o Ejemplo</H2>

Aqu&iacute; tenemos un comando Tcl que muestra la hora actual. Usa tres
comandos Tcl:
<code>set</code>, <code>clock</code>, y <code>puts</code>. El comando
<code>set</code> asigna un valor a la variable. El comando <code>clock</code>
interact&uacute;a con el reloj. El comando <code>puts</code> muestra los
valores.
<pre>
set seconds [clock seconds]
puts "Son las [clock format $seconds]"
</pre>
Tener en cuenta que no usamos el signo $ cuando asignemos variables.
S&oacute;lo cuando queramos el valor almacenado en la variable usaremos $.
La variable <code>seconds</code>
no es absolutamente necesaria en el ejemplo. Podemos mostrar la hora actual
con un solo comando:
<pre>
puts "Son las [clock format [clock seconds]]"
</pre>

<a name=lfindex2></a>
<H2>Agrupando y Sustituyendo</H2>

La sintaxis Tcl es usada para guiar al parser (analizador sint&aacute;ctico)
del Tcl a traves de tres etapas o pasos: agrupamiento de argumentos, sustituci&oacute;n
de resultados, y ejecuci&oacute;n de comandos.

<ol>
<li><b>Agrupamiento de argumentos.</b> Tcl necesita determinar como organizar
los argumentos de los comandos. En el caso mas simple, los espacios en
blanco separan argumentos. Como se indic&oacute; antes, las comillas y
las llaves se usan para agrupar varias palabras en un solo argumento. En
el ejemplo anterior, las comillas se usan para agrupar varios elementos
como un simple argumento para el comando
<code>puts</code>.</li>

<li><b>Sustituci&oacute;n de resultados.</b> Despu&eacute;s de que los argumentos
sean agrupados, Tcl realiza la sustituci&oacute;n de cadenas. Dicho simplemente,
reemplaza <code>$foo</code> con el valor de la variable <code>foo</code>, y
los comandos entre parentesis por su "resultado". Esas sustitutiones es
crucial que sean hechas despu&eacute;s de las agrupaciones . Esta secuencia
asegura que valores inusuales no compliquen la estructura del comando.</li>

<li><b>Ejecuci&oacute;n de comandos.</b> Despues de las sustituciones, Tcl
usa el nombre del comando como clave en una tabla de ejecuci&oacute;n. Llama
al procedimiento C asociado en la tabla, y el &eacute;ste implementa el
comando. Tambi&eacute;n podemos escribir procedimientos con comandos de Tcl.
Hay convenciones simples sobre el paso de argumentos y el manejo de
errores.</li>
</ol>

<A NAME="lfindex3">&nbsp;</A>
<H2>Otro Ejemplo</H2>


Aqu&iacute; tenemos otro ejemplo:
<pre>
set i 0
while {$i &lt; 10} {
   puts&nbsp; "$i squared = [expr $i*$i]"
   incr i
}
</pre>
Aqu&iacute;, las llaves son usadas para agrupar argumentos sin hacer
ninguna sustituci&oacute;n. El parser del Tcl no sabe nada en especial
acerca del comando <code>while</code>. Lo trata como a cualquier otro
comando. Es la implementaci&oacute;n del comando <code>while</code> quien
sabe que el primer argumento es una expresi&oacute;n, y el segundo argumento
consta de  m&aacute;s comandos Tcl. Las llaves agrupan dos argumentos: la
expresi&oacute;n l&oacute;gica que controla el bucle y los comandos que hay
en el cuerpo del bucle.

<p>Tambi&eacute;n vemos dos expresiones matem&aacute;ticas: la
comparaci&oacute;n l&oacute;gica y la multiplicaci&oacute;n. El comando
while eval&uacute;a autom&aacute;ticamente su primer argumento como una
expresi&oacute;n. En otros casos deberemos usar expl&iacute;citamente el
comando <code>expr</code> para realizar evaluaciones matem&aacute;ticas.

<A NAME="lfindex4">&nbsp;</A>
<H2>Ejecuci&oacute;n de Comandos</H2>


Finalmente, Tcl recurre a otras cosas para hacer el trabajo duro. Hemos visto
que usa <code>expr</code> para llevar a cabo funciones matem&aacute;ticas,
que <code>puts</code> maneja las operaciones de salida, y <code>set</code>
para asignar variables. Estos comandos Tcl est&aacute;n implementados por
un procedimiento C que se encuentra registrado a s&iacute; mismo dentro
de Tcl. Los procedimientos de comandos en C toman la cadena de argumentos
del comando Tcl y devuelven una nueva cadena como resultado. Es muy
f&aacute;cil escribir procedimientos de comandos en C. Ellos pueden hacer
cualquier cosa, desde acceso a bases de datos hasta crear interfaces
gr&aacute;ficos de usuario. Tcl, el lenguaje propiamente dicho, no sabe
realmente qu&eacute; hace cada comando. Tan s&oacute;lo agrupa argumentos,
sustituye resultados, y ejecuta comandos.

<A NAME="lfindex5">&nbsp;</A>
<H2>Un &uacute;ltimo Ejemplo</H2>


Aqu&iacute; tenemos el procedimiento factorial:
<pre>proc fac {x} {
    if {$x &lt; 0} {
        error "Argumento err&oacute;neo $x: debe ser un entero positivo"
    } elseif {$x &lt;= 1} {
        return 1
    } else {
        return [expr $x * [fac [expr $x-1]]]
    }
}
</pre>

<A NAME="lfindex6">&nbsp;</A>
<H2>Lecturas Complementarias</H2>


<ul>
<li><a href="http://www.beedub.com/book/2nd/tclintro.doc.html">Cap&iacute;tulo
1 del "Practical Programming in Tcl and Tk"</a></li>

<li><a href="http://herzberg.ca.sandia.gov/TclCourse/">Curso de Tcl/Tk, de
E.J. Friedman</a></li>
</ul>
Fuente de este art&iacute;culo:
<a href="http://www.scriptics.com/scripting/syntax.html">Scriptics</a>



<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Brent B. Welch <BR>LinuxFocus 1999</FONT></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:welch@acm.org"><FONT COLOR="#FFFFFF">Brent B. Welch</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:gineu@retemail.es"><FONT COLOR="#FFFFFF">Sergio G&oacute;mez</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>1999-05-28, generated by lfparser version 0.6</font></p></BODY></HTML>
