<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="UNIX Basics">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Katja     Socher
 =LF=CAT___: UNIX Basics
 =LF=TITLE_: Un mundo totalmente nuevo: Un viaje guiado por Tux por la tierra de los ping&uuml;inos
 =LF=NUMBER: 221
 =LF=ANAME_: article221.html
 -->
 <TITLE>lf221, UNIX Basics: Un mundo totalmente nuevo: Un viaje guiado por Tux por la tierra de los ping&uuml;inos</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/katjasocher.gif" alt=
    "[Photo of the Author]" height="148" width="120">
<BR>por  Katja Socher <br> <small>&lt;katja(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<p>Katja es la editora alemana de  LinuxFocus. Le gustan Tux,
    las pel&iacute;culas y la fotograf&iacute;a y el mar. Su p&aacute;gina web est&aacute;
    <a href="http://www.toppoint.de/~utuxfan/k/">aqu&iacute;</a>.</p>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Javier G&oacute;mez Sierras, Roberto Hernando Velasco <small>&lt;jgomsi(at)obelix.umh.es, rhernando(at)mundofree.com&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#221lfindex0">Hola (Introducci&oacute;n)</A></LI>
  <LI><A HREF="#221lfindex1">Llegando hasta aqu&iacute;</A></LI>
  <LI><A HREF="#221lfindex2">Aduana</A></LI>
  <LI><A HREF="#221lfindex3">Transporte</A></LI>
  <LI><A HREF="#221lfindex4">Alojamiento</A></LI>
  <LI><A HREF="#221lfindex5">Habitaciones virtuales (Escritorios virtuales)</A></LI>
  <LI><A HREF="#221lfindex6">Gastronom&iacute;a</A></LI>
  <LI><A HREF="#221lfindex7">Gnome y KDE</A></LI>
  <LI><A HREF="#221lfindex8">Window Maker</A></LI>
  <LI><A HREF="#221lfindex9">IceWM</A></LI>
  <LI><A HREF="#221lfindex10">Servicio de habitaciones, por favor</A></LI>
  <LI><A HREF="#221lfindex11">Un hotel seguro</A></LI>
  <LI><A HREF="#221lfindex12">La oficina de correo o llamar a casa</A></LI>
  <LI><A HREF="#221lfindex13">Vistas y sonidos</A></LI>
  <LI><A HREF="#221lfindex14">Contratando una excursi&oacute;n extra</A></LI>
  <LI><A HREF="#221lfindex15">Mapas o &iquest;Ad&oacute;nde ir desde aqu&iacute;?</A></LI>
  <LI><A HREF="#221lfindex16">Historia y Filosof&iacute;a</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=221&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Un mundo totalmente nuevo: Un viaje guiado por Tux por la tierra de los ping&uuml;inos</H2>
 <img src="../../common/images/illustration221.jpg" width="100"
    height="113" alt="[illustration]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

    En este art&iacute;culo Tux, la mascota de Linux guiar&aacute; al turista que
    visita por primera vez la tierra nativa de Tux. Tux expondr&aacute;
algunos
    conceptos que posiblemente sean nuevos para los turistas y les
    dar&aacute; pistas y consejos sobre c&oacute;mo explorar Linux por s&iacute; mismos
    m&aacute;s tarde.

    </P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="221lfindex0">&nbsp;</A>
<H2>Hola (Introducci&oacute;n)</H2>


    <p>&iexcl;Hola! Soy Tux, el ping&uuml;ino de Linux y hoy voy a ser su gu&iacute;a
    en su primer vistazo como turista a este maravilloso pero a&uacute;n
    algo desconocido y extra&ntilde;o mundo. Despu&eacute;s de este primer viaje
    usted podr&aacute; volver y explorar  por
    s&iacute; mismo las &aacute;reas   que le interesen  de forma m&aacute;s detallada.</p>

    <A NAME="221lfindex1">&nbsp;</A>
<H2>Llegando hasta aqu&iacute;</H2>


    <p>Para la excursi&oacute;n supondr&eacute; que ya ha llegado hasta aqu&iacute;,
    que Linux est&aacute; instalado y funcionando en su sistema.
    S&eacute; que lo que el paquete tur&iacute;stico ofrece (estando Linux
    pre-instalado en su ordenador) todav&iacute;a no es muy com&uacute;n y usted
    seguramente habr&aacute; reservado su viaje individualmente. Pero puede
    que esto ya fuera su primera sorpresa positiva: reservar el
    viaje (instalando Linux) &iexcl;es francamente f&aacute;cil! La &uacute;nica parte
    que puede haber sido algo delicada es hacer las particiones. Pero
    si usa una de las distribuciones m&aacute;s modernas puede escoger
    hacer las particiones de forma autom&aacute;tica, que es muy
    sencillo. Pero si por alguna raz&oacute;n no quiere realizar las
particiones
    de forma autom&aacute;tica, por supuesto puede hacerlo usted mismo.
    La mayor&iacute;a de las veces le ayudar&aacute; la lectura del manual que suele
venir
    con todas las distribuciones. Pero finalmente depende de usted
    c&oacute;mo hacer las particiones de su sistema, ya que es usted el &uacute;nico
    que sabe c&oacute;mo quiere usarlo. Si no tiene ni idea aqu&iacute;
    le sugiero lo que se suele utilizar:</p>
    Para una buena instalaci&oacute;n de Linux necesitar&aacute; al menos 2 GB de
disco.
<br>
     Cree 4 particiones para Linux:<br>


      <ul>
      <li>root: /<br>
      &Eacute;sta es la partici&oacute;n central, las dem&aacute;s particiones se
      montan aqu&iacute;. No necesita ser grande, 300MB ser&aacute;n suficientes.<br>
      </li>

      <li>swap:<br>
       Linux necesita una partici&oacute;n de intercambio (swap). Si no hay
suficiente
      ram entonces parte de la memoria se guarda aqu&iacute;. Una regla
      es utilizar tanta memoria de intercambio como memoria ram.<br>
      </li>

      <li>datos est&aacute;ticos: /usr<br>
       Casi todos los programas y los paquetes que necesitan para
funcionar
      est&aacute;n instalados aqu&iacute;. El tama&ntilde;o de esta partici&oacute;n depende del
      n&uacute;mero y tama&ntilde;o de los programas que quiera instalar. Casi todas
      las veces el tama&ntilde;o es de 1 o 2 GB.<br>
       Tambi&eacute;n puede poner esto en la partici&oacute;n / y tener s&oacute;lo tres
      particiones.<br>
      </li>

      <li>Por &uacute;ltimo necesita un directorio personal: /home.<br>
       Puede ser tan grande como quiera. Sus datos personales se
      almacenar&aacute;n aqu&iacute;.</li>

   </ul>
    <br>
     Por lo tanto, ahora que Linux est&aacute; funcionando en su m&aacute;quina
llegamos a la
    <br>


    <A NAME="221lfindex2">&nbsp;</A>
<H2>Aduana</H2>


    <p>Aqu&iacute; tiene que dar su nombre y contrase&ntilde;a y normalmente
    decidir&aacute; qu&eacute; alojamiento prefiere. Si es de los que piensa que en
estos d&iacute;as
    de libertad de movimiento la aduana no es necesaria
    puede verlo como la llave de su habitaci&oacute;n de hotel (incluso
    pensando que no es 100% correcto). Estar&aacute; con nosotros en que
    es bueno
    tener una para que los dem&aacute;s no puedan entrar sin su permiso. &iexcl;Puede
    crear su propio mundo seg&uacute;n sus gustos!.<br>
      Todo el que tenga una cuenta v&aacute;lida (nombre de usuario y
contrase&ntilde;a)
    &iexcl;podr&aacute; entrar en la tierra del ping&uuml;ino!<br>
      Para cambiar su contrase&ntilde;a abra un shell (esto es la ventana
    que se parece a dos bajo windows. Lo puede iniciar escogiendo
    <i>xterm</i> en el men&uacute; bajo  "Terminal") despu&eacute;s de que haya
entrado en su sesi&oacute;n
     y teclee <i>paswwd</i>. Entonces tendr&aacute; que dar su contrase&ntilde;a
    actual y despu&eacute;s la nueva dos veces para evitar errores.<br>
     Tenga en cuenta que Linux distingue entre may&uacute;sculas y
min&uacute;sculas.<br>
     Deber&iacute;a evitar entrar como root siempre que pueda ya que como un
    usuario normal la posibilidad de destruir su sistema es muy peque&ntilde;a.
    Root es un superusuario que puede hacer un mont&oacute;n de cosas que un
    usuario normal no puede e incluso tiene acceso a las cuentas de
todos
    los usuarios normales. Por tanto, y m&aacute;s si es nuevo en el sistema,
    puede trabajar mucho m&aacute;s seguro porque la &uacute;nica cosa que puede
estropear
    como usuario normal es su propia cuenta pero sin ning&uacute;n efecto
    sobre el sistema. Si todav&iacute;a no ha creado una cuenta de usuario
    normal o quiere a&ntilde;adir otra cuenta de usuario (usted mismo puede
    tener tantas cuentas como desee) puede hacer dos cosas:<br>

	1) Soluci&oacute;n gr&aacute;fica<br>
     Debe ser root para crear una nueva cuenta de usuario. Si ha
   entrado como un usuario t&iacute;pico abra un shell, teclee <i>su</i>
    y entonces escriba la contrase&ntilde;a de root en la siguiente l&iacute;nea
    (una alternativa es que haga logout y despu&eacute;s login como root).
   Escriba el comando
    <i>linuxconf</i>. El programa empieza. Elija "Usuarios" en
"Configuraci&oacute;n"
   y despu&eacute;s "Cuentas de Usuario" en "Normal" y ah&iacute; "A&ntilde;adir". Ahora
   complete el nombre del usuario, y opcionalmente los grupos a los
   que pertenece, etc. Luego pulse "Aceptar". Una nueva ventana se
   abrir&aacute; pidiendo la contrase&ntilde;a. Escr&iacute;bala y pulse "Aceptar".
   De nuevo se abrir&aacute; una ventana pidi&eacute;ndole que repita la contrase&ntilde;a.
   Escr&iacute;bala otra vez y pulse return. La nueva cuenta de usuario ya est&aacute;
   creada y ahora puede hacer logout como root.<br>
     2) Soluci&oacute;n usando el shell<br>
     Tiene que ser root (vea arriba c&oacute;mo convertirse en root). Abra
   un shell y escriba <i>useradd</i>, espacio, el nombre de usuario
   para la nueva cuenta, y pulse return. En la siguiente l&iacute;nea tendr&aacute;
   que dar una contrase&ntilde;a para la nueva cuenta escribiendo <i>passwd
   elusuarioquehacreado</i>, y una vez m&aacute;s en la siguiente l&iacute;nea, para
   asegurarse de que est&aacute; escrita correctamente. Entonces obtendr&aacute;:
    "passwd: all
    authentication tokens updates successfully". La nueva cuenta de
   usuario se ha creado y deber&iacute;a salir como root ahora.<br>
    Para volver a ser un usuario normal de nuevo simplemente teclee
   <i>exit</i> si luego quiere volver a ser root poniendo <i>su</i>
    despu&eacute;s o haciendo logout.<br>
     Para hacer logout vaya al men&uacute; de su escritorio y escoja
    terminar la sesi&oacute;n o salir.</p>

    <A NAME="221lfindex3">&nbsp;</A>
<H2>Transporte</H2>

      <p>Como con otros sistemas usaremos el rat&oacute;n y el teclado
    como medios de transporte. Pero con Linux es muy com&uacute;n usar
    un rat&oacute;n de tres botones. Normalmente con un rat&oacute;n de dos
    botones se puede emular el bot&oacute;n del centro pulsando el
    izquierdo y el derecho a la vez, pero comprobar&aacute; que
    pasearse con un rat&oacute;n de tres botones es mucho m&aacute;s c&oacute;modo.<br>
     El bot&oacute;n del centro puede pegar algo donde usted quiera
    si lo seleccion&oacute; anteriormente con el bot&oacute;n de la izquierda,
    lo que es una utilidad muy pr&aacute;ctica y &uacute;til.</p>

    <A NAME="221lfindex4">&nbsp;</A>
<H2>Alojamiento</H2>


    <p>Puede elegir entre todo tipo de alojamientos: desde un
    hotel de cinco estrellas hasta un hotel barato y sencillo o incluso
    una tienda de campa&ntilde;a. Depende de usted. Lo puede elegir
dependiendo del
    espacio libre en su disco duro y de sus gustos y tambi&eacute;n es posible
    cambiar entre ellos cuando le apetezca. Puede elegir su hotel en el
    men&uacute; cuando entra a trav&eacute;s de un gestor de sesi&oacute;n. Los m&aacute;s populares
    son Gnome, KDE, window maker, fvwm, icewm,... Deber&iacute;a escoger su
hotel
    con cuidado porque todos sabemos que unas buenas vacaciones dependen
    tambi&eacute;n de lo c&oacute;modo que est&eacute; donde se aloje aparte de todo lo
dem&aacute;s.</p>


    <A NAME="221lfindex5">&nbsp;</A>
<H2>Habitaciones virtuales (Escritorios virtuales)</H2>


    <p>Algo que siempre encontrar&aacute; independientemente del alojamiento
que elija
    son los escritorios virtuales. La configuraci&oacute;n por defecto suele
mostrar
    cuatro pero puede cambiarlo si quiere. De esta manera puede tener un
    escritorio para responder el correo y navegar por internet, otro
para
    crear im&aacute;genes con El Gimp, un programa para retocar im&aacute;genes, otro
    m&aacute;s para escribir correo tradicional (postal) y un cuarto para
    lo que sea. Ayuda mucho a organizar su lugar de trabajo.</br>
     Para cambiar de una habitaci&oacute;n a otra simplemente pulse sobre la
    habitaci&oacute;n a la que quiera ir dentro del paginador (o clip).</p>

    <A NAME="221lfindex6">&nbsp;</A>
<H2>Gastronom&iacute;a</H2>


    <p>Ver&aacute; que hay mucho donde elegir. Si ha escogido uno
    de los dos escritorios, gnome o kde, para que se muestre el
    men&uacute; tiene que pulsar en el primer bot&oacute;n a la izquierda del
    panel. En otros alojamientos el men&uacute; aparecer&aacute; pulsando con el rat&oacute;n
    en cualquier parte del escritorio. En Gnome y KDE normalmente
    los programas que instale se incorporar&aacute;n al men&uacute; automaticamente
    mientras que con otros gestores de ventanas usted tendr&aacute; que
actualizar
    el men&uacute;. Con todo, cualquiera de las opciones ser&aacute; muy similar
    al resto.</p>

    <A NAME="221lfindex7">&nbsp;</A>
<H2>Gnome y KDE</H2>


    <p>Habiendo estado antes en la tierra de Windows todo le parecer&aacute;
    muy familiar. Puesto que ya se ha escrito bastante
    sobre ambos, existe abundante documentaci&oacute;n
    sobre estos escritorios (pulse sobre el bot&oacute;n de ayuda o
    vaya a sus respectivos sitios web en
    <a href="http://www.gnome.org">www.gnome.org</a> y
    <a href="http://www.kde.org">www.kde.org</a>) que puede leer y no
    la voy a repetir aqu&iacute;.<br>
     Bueno, hay una cosa que quiero comentar: En la configuraci&oacute;n
    del comportamiento del foco me gustar&iacute;a que provase el foco
    "sloppy mouse" (llamado "foco sigue al rat&oacute;n" en KDE y
    en Gnome tiene que responder <i>enter only</i> a la pregunta
    "when does the mouse pointer affect the input focus?")
    Por defecto est&aacute; configurado como "click to focus" que es
    la configuraci&oacute;n en windows. Al principio esta caracter&iacute;stica
    le parecer&aacute; un poco extra&ntilde;a pero pasado un rato no querr&aacute;
    vivir si ella...</p>

    <p>Pero quiz&aacute; no le guste este parecido con la tierra de Windows o
    simplemente tenga curisidad por los otros alojamientos. &iexcl;Hay
    muchos otros! Los gestores de ventanas son habitualmente m&aacute;s
    ligeros y no puede poner iconos directamente en el fondo.
    Hay much&iacute;simos gestores de ventanas diferentes disponibles
    y deber&iacute;a ver varios para descubrir el que le gusta m&aacute;s.
    Todos ellos son altamente configurables para adaptarse a
    la apariencia (look and feel) que m&aacute;s le guste.</p>


    <A NAME="221lfindex8">&nbsp;</A>
<H2>Window Maker</H2>


    <p>&Eacute;ste es un gestor de ventanas muy agradable y bonito con una
    apariencia configurable tambi&eacute;n graficamente. La &uacute;nica raz&oacute;n por
    la que no hablo m&aacute;s de &eacute;l es que Georges ya ha hecho todo el
    trabajo :-) Vaya a <a href=
    "../January2000/article128.html">Window Maker, el esp&iacute;ritu de
    NeXTStep</a> para leer su art&iacute;culo sobre este fant&aacute;stico gestor
    de ventanas que realmente deber&iacute;a probar &iexcl;antes de decidir
    con cu&aacute;l se queda!</p>

    <A NAME="221lfindex9">&nbsp;</A>
<H2>IceWM</H2>


    <p>IceWM es otro buen gestor de ventanas bastante conocido. Es uno
de
    los pocos gestores de ventanas que quedan donde para cambiar la
    apariencia tiene que cambiar un fichero de configuraci&oacute;n. Para
    configurarlo cree un directorio llamado <i>~/.icewm</i> y despu&eacute;s
    copie los ficheros por defecto:<br>
     <i>cp /usr/X11R6/lib/X11/icewm/preferences
    ~/.icewm/preferences<br>
     cp /usr/X11R6/lib/X11/icewm/toolbar ~/.icewm/toolbar<br>
     cp /usr/X11R6/lib/X11/icewm/winoptions
    ~/.icewm/winoptions</i><br>
     Ahora tiene que cambiarlos a su gusto. No entra dentro del
    objetivo de este art&iacute;culo describir en detalle esto as&iacute; que
    todo lo que puedo decirle aqu&iacute; es: juegue un poquito.</p>

    <A NAME="221lfindex10">&nbsp;</A>
<H2>Servicio de habitaciones, por favor</H2>


    <p>Independientemente del tipo de hotel que haya elegido
    puede elegir libremente el servicio de habitaciones. Hay
    muchos gestores de ficheros disponibles en Linux. Con ellos
    puede copiar sus ficheros, moverlos, borrarlos o lo que
    quiera.<br>
     Un concepto que quiz&aacute; sea nuevo para usted es el concepto de
    permisos. En Linux cada usuario tiene su propio directorio
    personal donde se guardan todos sus ficheros personales. Pero
    por supuesto estar&iacute;a bien si alguien que se conecta a su
    ordenador pudiese ver todos o al menos parte de sus ficheros.
    En alg&uacute;n caso ser&iacute;a &uacute;til darle a esa persona permisos de escritura
    (permiso para cambiar) sobre ciertos ficheros. Y si ha escrito
    un programa y quiere que otras personas que utilicen su ordenador lo
    puedan usar tambi&eacute;n tiene que darles permiso para que lo puedan
    ejecutar. Algunas veces querr&aacute; darle permiso a todo el mundo y
    otras s&oacute;lo a unos pocos. Es por eso que Linux diferencia entre
    permisos que tiene usted, los que tiene un grupo determinado as&iacute;
    como el resto de usuarios. Si es root puede especificar cuantos
    grupos como quiera.<br>
     Para que otras personas puedan ver sus ficheros tiene
    que darles primero permiso de lectura y ejecuci&oacute;n en su directorio
    personal al resto de usuarios o al grupo que quiera darle acceso
    porque si no no podr&aacute;n ver el contenido de su directorio
    personal. Despu&eacute;s puede decidir a qui&eacute;n y qu&eacute; permisos da
    fichero por fichero.<br>
     Konqueror por ejemplo es un estupendo gestor de ficheros que
    tambi&eacute;n sirve para navegar pero hay muchos otros tambi&eacute;n.<br>
     Durante su primera estancia en la tierra de Tux probablemente
    apreciar&aacute; el tener un servicio de habitaciones pero despu&eacute;s
    cuando venga m&aacute;s a menudo o se haya decidido a quedarse a vivir
    quiz&aacute; descubra que es mejor y m&aacute;s eficiente hacerlo todo por uno
    mismo usando el shell. Puede usar peque&ntilde;os scripts de shell para
    cosas que se repiten varias veces. Y tambi&eacute;n puede usar la tecla
    tab para completar sus comandos/palabras (terminaci&oacute;n autom&aacute;tica
    de palabras) y pulsando las fechas del teclado se mostrar&aacute;n los
    comandos anteriores.<br>
     Para conocer m&aacute;s sobre el shell lea los dos art&iacute;culos de Manuel
    Muriel Cordero: <a href="../November1998/article68.html">Comandos
b&aacute;sicos de
    UNIX</a> y <a href=
    "../November2000/article131.shtml">Utilidades GNU</a>.<br>
     Y por supuesto puede leer el art&iacute;culo de Guido y m&iacute;o sobre <a
    href="../September2001/article216.shtml">Programaci&oacute;n en
shell</a>.</p>

    <A NAME="221lfindex11">&nbsp;</A>
<H2>Un hotel seguro</H2>


    <p>Para evitar que otras personas puedan manipular su directorio
    personal no s&oacute;lo existe el concepto de diferentes usuarios y
    permisos sino que tambi&eacute;n puede bloquear la pantalla cuando va a
    dejar el ordenador un momento pero no quiere salir de su sesi&oacute;n
    completamente. Simplemente tecleando "<i>xlock</i>" en un terminal
se
    bloquear&aacute; la pantalla y tendr&aacute; que teclear su contrase&ntilde;a para
    poder volver a la sesi&oacute;n de nuevo. Una vez introducida ver&aacute; que
    todas sus aplicaciones est&aacute;n como las dej&oacute;.</p>

    <A NAME="221lfindex12">&nbsp;</A>
<H2>La oficina de correo o llamar a casa</H2>


    <p>Qu&eacute; ser&iacute;a de unas vacaciones si no pudi&eacute;semos enviar postales a
    casa o comunicarnos de alguna manera con nuestros seres queridos
    que han tenido que quedarse en casa. Por supuesto esto no es
    problema en la tierra del ping&uuml;ino.<br>

     Para escribir cartas tradicionales hay varios programas
    disponibles, algunos de ellos son libres o gratuitos como Ted,
    Kword, Abiword, StarOffice... por nombrar unos cuantos, y otros
    son de pago como Applixware y WordPerfect.<br>

     Si s&oacute;lo utiliza estos programas en casa y s&oacute;lo quiere hacer
    cosas normales como escribir una carta al banco o a un amigo
    entonces casi todas las herramientas disponibles le ir&aacute;n bien y
    solamente tendr&aacute; que encontrar la que m&aacute;s le gusta. Sobre Ted
    puede leer el art&iacute;culo de LinuxFocus: <a href=
    "../November2000/article123.shtml">Descubriendo
    Ted</a>. Sobre
    Kword y Abiword dir&iacute;a que por el momento KWord tiene unas pocas
    opciones m&aacute;s que Abiword mientas que Abiword es bastante m&aacute;s
    estable. Pero ambos se est&aacute;n desarrollando r&aacute;pidamente y son
candidatas
    a convertirse en unas herramientas geniales y avanzadas en el
    futuro. StarOffice proporciona m&uacute;ltiples opciones y
    caracter&iacute;sticas pero a algunas personas no les gusta porque es
    bastante pesado ( Puede leer los dos art&iacute;culos
    <a href="../July1998/article55.html">La Suite StarOffice
    </a> y <a href="../May1998/article40.html">StarOffice
    para Linux</a>). Simplemente pru&eacute;belas usted mismo y compruebe si se
    adaptan a sus necesidades. Tambi&eacute;n puede comprar Applix o
    WordPerfect. Yo nunca he trabajado con WordPerfect as&iacute; que s&oacute;lo
    podr&eacute; hablar sobre Applix. He comprobado que tiene m&aacute;s opciones
    que StarOffice y me siento muy c&oacute;moda trabajando con &eacute;l. Pero
    pru&eacute;belo usted mismo. &iexcl;La decisi&oacute;n es suya!<br>
     Por supuesto tambi&eacute;n hay hojas de c&aacute;lculo, programas para hacer
    presentaciones, libretas de direcciones y otros programas
    de organizaci&oacute;n disponibles para Linux.</p>

    <p>Hay un peque&ntilde;o programa que me gusta mucho llamado
    <i>knotes</i> que muestra pegatinas similares a post-it. Puede tener
    varias notas abiertas y pegarlas en el lugar de la pantalla que le
    apetezca. Siempre est&aacute; bien escribir una peque&ntilde;a nota para no
    olvidar una cita importante o algunas cosas urgentes que tenga
    que hacer.</p>

    <p>Leyendo ficheros pdf: puede usar un programa llamado
    xpdf. Simplemente escriba <i>xpdf</i> seguido del nombre del
    fichero en el shell o l&aacute;ncelo con el gestor de ficheros. Otra
    posibilidad es usar el programa <i>acroread</i> escribiendo
    <i>acroread</i> seguido del nombre del fichero.</p>

    <p>Internet &amp; correo-e: Por supuesto navegar por internet no
    es ning&uacute;n problema. Ya he mencionado konqueror como gestor de
    ficheros pero tambi&eacute;n es un buen navegador de internet que se est&aacute;
    haciendo m&aacute;s y m&aacute;s popular. Otros navegadores son p.ej. netscape y
opera.<br>
     Y tambi&eacute;n hay varios programas de correo, kmail, netscape, mail,
mutt....</p>

    <p>Quiz&aacute; no solo quiera escribir correo sino tambi&eacute;n mandar
    im&aacute;genes y otros documentos. Estar&iacute;a bien poder ponerlos juntos en
    un &uacute;nico fichero y comprimirlos para  no tener que mandar
    demasiados datos.<br>
     Bien, si quiere enviarlo &uacute;nicamente dentro de la tierra de tux
    simplemente escriba<br>
     <i>gzip nombrefichero.ext.</i><br>
     para comprimir su fichero. El fichero comprimido se guarda como
    nombrefichero.ext.gz. Por lo que si quiere comprimir el fichero
    sol.jpg escriba<br>
     <i>gzip sol.jpg</i><br>
     y se guardar&aacute; como sol.jpg.gz.<br>
     Tambi&eacute;n puede usar bzip2 para comprimir sus ficheros un poquito
m&aacute;s.
    Haga <i>man bzip2</i> para obtener m&aacute;s informaci&oacute;n.<br>
     Para empaquetar varios ficheros en un &uacute;nico archivo puede usar el
    comando <i>tar</i>:<br>
     <i>tar -cvf nombrefichero.tar ficheros/directorios</i><br>
     Para empaquetar los ficheros sol.jpg y luna.jpg en un nuevo
    fichero llamado <i>imagenes</i> escriba<br>
     <i>tar -cvf imagenes.tar sol.jpg luna.jpg</i>.<br>
     Para comprimir y empaquetar los ficheros en un solo paso puede
    escribir:<br>
     <i>tar -cvfz ficheros.tgz fichero1.ext fichero2.ext</i><br>
     Las opciones cvfz significan que c crea el archivo, z lo
    comprime, f significa que el fichero <i>ficheros.tgz</i> se usar&aacute;
para
    guardarlo y v (verbose) muestra por pantalla el nombre del fichero
    que est&aacute; siendo empaquetado.<br>

     Para ver el contenido de dicho archivo escriba:<br>
     <i>tar -tfz ficheros.tgz</i><br>
     con la t para que muestre el contenido del archivo.<br>
     Para descomprimir tus ficheros gz simplemente teclee<br>
     <i>gunzip nombrefichero.ext.gz.</i><br>
     <i>gunzip sol.jpg.gz</i> descomprimir&aacute; el fichero
    sol.jpg. El fichero sol.jpg.gz ya no existir&aacute;.<br>
     Para desempaquetar su archivo escriba<br>
     <i>tar -xvf ficheros.tar.</i><br>
     x significa desempaquetar el archivo.<br>
     Para desempaquetar y descomprimir un fichero tgz teclee:<br>
     <i>tar -xvfz ficheros.tgz</i><br>
     x extrae los ficheros.</p>

    <p>Si quiere enviar su fichero al exterior o exterior e interior
    de la tierra del ping&uuml;ino es mejor usar
    <i>zip</i>. Escriba entonces<br>
     <i>zip -r nombrefichero.zip ficheros</i>.<br>
     Para comprimir los ficheros sol.jpg y luna.jpg en un nuevo
    fichero llamado <i>imagenes</i> escriba<br>
     <i>zip -r imagenes.zip sol.jpg luna.jpg</i>.<br>
     La opci&oacute;n -r no solo se usa para empaquetar ficheros sino tambi&eacute;n
    un directorio con todo su contenido.<br>
     Para descomprimir un fichero en formato zip escriba<br>
     <i>unzip nombrefichero.zip</i>.</p>

    <p>Tambi&eacute;n existen herramientas gr&aacute;ficas para (des)comprimir y
    (des)empaquetar ficheros como p. ej. gnozip.</p>


    <A NAME="221lfindex13">&nbsp;</A>
<H2>Vistas y sonidos</H2>


    <p>Entonces ahora que ha llegado y ha encontrado el alojamiento
    perfecto para usted y sabe c&oacute;mo estar en contacto con otros querr&aacute;
    disfrutar sus vacaciones. Pero &iquest;qu&eacute; diversiones hay?
    </p>

    <p>Muchos turistas vienen aqu&iacute; porque quieren programar o
    aprender a programar. Y realmente aqu&iacute; Linux puede alardear.
    Hay much&iacute;simos lenguajes de programaci&oacute;n disponibles y la mayor&iacute;a
    son gratuitos. Simplemente desc&aacute;rguelos e inst&aacute;lelos.
    Todo lo que necesita ahora es elegir el editor de textos que le
guste.
    Est&aacute;n nedit, vi, emacs, kedit, kate,
    joe.....<br>
     (Lea los  art&iacute;culos <a href=
    "../March2000/article138.shtml">nedit</a> y <a href=
    "../May2000/article153.shtml">vi</a> si le parece.)<br>
     Si es un lenguaje interpretado la primera l&iacute;nea tiene que ser el
camino
    al int&eacute;rprete del lenguaje instalado. Entonces escriba su
    programa, gu&aacute;rdelo y h&aacute;galo ejecutable (establezca los permisos a
ejecutable).
    Si es un lenguaje compilado tendr&aacute; que compilarlo antes de
ejecutarlo.
    Para ejecutarlo simplemente teclee
./nombredelficheroquehaescrito.<br>
     En la web existen tutoriales muy buenos para la mayor&iacute;a de los
lenguajes, que le
    ayudar&aacute;n a empezar.<br>
     Si est&aacute; interesado en aprender Perl puede leer tambi&eacute;n los
art&iacute;culos
    de Guido sobre Perl:<br>
     <a href="../September1999/article114.html">Perl parte I</a><br>
     <a href="../November1999/article126.html">Perl parte II</a><br>
     <a href="../January2000/article136.html">Perl parte III</a><br>
     Ejemplo:<br>
     En Perl (un lenguaje interpretado) la primera l&iacute;nea debe ser:<br>
     <i>#!/usr/bin/perl</i><br>
     Para compilar un programa escrito en C (un lenguaje compilado)
    escriba:<br>
     <i>gcc -Wall -o programafinal fichero.c</i></p>

    <p>Si ha venido aqu&iacute; tan s&oacute;lo para divertirse tambi&eacute;n hay
    muchos programas para usted. No importa si quiere divertirse
    pintando o simplemente leyendo en la piscina mientras
    escucha buena m&uacute;sica, jugando o lo que sea, seguro que hay
    un programa disponible para usted. Existen programas realmente
    buenos para gr&aacute;ficos com The
    Gimp, Sketch, Blender... la verdad es que no deber&iacute;a
perd&eacute;rselos.<br>
     Para ver lo que hay disponible eche una hojeada a los siguiente
sitios:<br>
    </p>

    <ul>
      <li><a href=

"http://freshmeat.net/browse/18/">http://freshmeat.net/browse/18/</a><br>

      </li>

      <li><a href=

"http://www.linux.org/apps/index.html">http://www.linux.org/apps/index.html</a><br>

      </li>

      <li><a href=

"http://www.linuxlinks.com/Software/">http://www.linuxlinks.com/Software/</a><br>

      </li>

      <li><a href=

"http://www.linuxstart.com/category.php?file=/applications/">http://www.linuxstart.com/category.php?file=/applications/</a><br>

      </li>

      <li><a href=
      "http://www.linuxapps.com/">http://www.linuxapps.com/</a><br>
      </li>

      <li><a href=
      "http://download.cnet.com/">http://download.cnet.com/</a><br>
      </li>

      <li><a href=
      "http://linuxgames.com">http://linuxgames.com</a></li>
    </ul>
    Tambi&eacute;n hay muchos otros sitios donde puede informarse sobre
    (nuevos) programas. Si est&aacute; interesado en cualquiera de las
aplicaciones
    y quiere probarla simplemente desc&aacute;rguela desde ah&iacute;.<br>
     <br>


    <p>No hay tantos programas para Linux como para Windows
    pero si no quiere utilizar copias ilegales sino s&oacute;lo copias legales
    tendr&aacute; muchos m&aacute;s programas para usar porque la mayor&iacute;a
    son gratuitos o se pueden obtener muy baratos.</p>

    <A NAME="221lfindex14">&nbsp;</A>
<H2>Contratando una excursi&oacute;n extra</H2>


    <p>o Instalando software.<br>
     Para instalar nuevo software tiene que ser <i>root</i>.<br>
     Antes de descargarlo desde internet deber&iacute;a mirar primero
    si el programa no est&aacute; en uno de los CDs de su distribuci&oacute;n.
    Normalmente contienen muchos m&aacute;s programas que los que se han
    instalado durante el proceso de instalaci&oacute;n inicial. El software en
    esos CDs viene en paquetes. Existen dos formatos de paquetes: deb y
rpm.
    Aqu&iacute; le ense&ntilde;ar&eacute; c&oacute;mo instalar paquetes rpm ya que este formato
    es muy com&uacute;n.<br>
     Para instalar paquetes puede utilizar herramientas gr&aacute;ficas como
gnorpm
    o kpackage o el comando de shell "<i>rpm -i</i>" .<br>
     Instalar un &uacute;nico paquete que no requiera de otros programas es
f&aacute;cil.
    Simplemente ejecute<br>
     <i>rpm -vi nombre_paquete.rpm</i><br>
     Se vuelve un poco m&aacute;s complejo si necesita instalar anteriormente
otros
    paquetes que sean requeridos por el programa a ejecutar.
    Si el programa est&aacute; en uno de los CDs de su distribuci&oacute;n entonces
    las librer&iacute;as de las que dependa el programa tambi&eacute;n estar&aacute;n en los
CDs.
    Compruebe lo que dice el mensaje de error sobre dependencias
fallidas e
    instale primero los programas que falten.<br>
     Mandrake tiene un programa llamado urpmi que sabe qu&eacute; paquetes
    est&aacute;n en qu&eacute; CDs e instala las dependencias primero.<br>
     "<i>urpmi make</i>"<br>
     que p.ej. instalar&aacute; la utilidad make, necesaria para compilar
    software.<br>
    <br>
     Una actualizaci&oacute;n se hace de forma id&eacute;ntica a una instalaci&oacute;n,
salvo por el
    uso de la opci&oacute;n -U en lugar de -i:<br>
     <i>rpm -vU nombre_paquete.rpm</i><br>
     Lo bueno de rpm es que puede ver qu&eacute; tiene instalado:<br>
     <i>rpm -qia</i><br>
     y puede desinstalar el paquete que quiera sin ning&uacute;n problema.
Para desinstalar
    basta con que use la opci&oacute;n -e para borrar:<br>
     "<i>rpm -e nombre_paquete</i>."<br>
    <br>
     Paquetes desde internet:<br>
     El problema con los paquetes descargados de internet es que
    debe comprobar si han sido construidos exactamente para su
    sistema. Instalar un paquete de otra distribuci&oacute;n o de una versi&oacute;n
    distinta de su distribuci&oacute;n puede funcionar o no. Aparte de esto,
la instalaci&oacute;n es
    como se ha descrito arriba.<br>
    <br>
     Instalaci&oacute;n desde el c&oacute;digo fuente:<br>
     Esto suena horrible pero normalmente es muy sencillo:<br>
     - Desempaquete el paquete<br>
     - Siga las instrucciones de los ficheros README (LEAME) o INSTALL
(INSTALAR)<br>
    <br>
     Normalmente funciona as&iacute;:<br>
     - tar zxvf fichero.tar.gz<br>
     - cd en el directorio del paquete creado cuando se desempaqueta el
fichero tar
     <br>
     - ejecute ./configure<br>
     - ejecute make<br>
     - ejecute make install<br>
     Para comprobar qu&eacute; ficheros se instalar&iacute;an si hiciera <i>make
    install</i>, puede hacer <i>make -n install</i><br>
    </p>

    <A NAME="221lfindex15">&nbsp;</A>
<H2>Mapas o &iquest;Ad&oacute;nde ir desde aqu&iacute;?</H2>


    <p>Existe much&iacute;sima documentaci&oacute;n disponible que puede leer:<br>
    </p>

    <ul>
      <li>P&aacute;ginas de manual<br>
       Aqu&iacute; encontrar&aacute; todos los comandos que necesite para utilizar
      el shell y para administrar el sistema. Simplemente teclee
<i>man</i>
      seguido del comando que quiere conocer. Para obtener m&aacute;s
      informaci&oacute;n puede escribir <i>man man</i> o bien <i>xman</i>
      que abrir&aacute; una ventana. Si elige aqu&iacute;  "manual page" ("p&aacute;gina de
manual)
      y despu&eacute;s "options" ("opciones") y "display directory" ("mostrar
directorio") obtendr&aacute;
      una lista de todos los comandos disponibles. Simplemente elija
uno para aprender
      sobre &eacute;l.<br>
       (Si su distribuci&oacute;n es Mandrake las p&aacute;ginas de manual no se
habr&aacute;n instalado
      autom&aacute;ticamente en su sistema. Para instalarlas escriba
      <i>rpm -vi man-pages-1.3.5.rpm</i>, debe comprobar la versi&oacute;n
      que tiene en su CD y cambiar 1.3.5 por lo que corresponda)<br>
      </li>

      <li>P&aacute;ginas de informaci&oacute;n<br>
       Tan s&oacute;lo escriba <i>info comando</i><br>Tambi&eacute;n puede leer las
p&aacute;ginas de informaci&oacute;n
       (p&aacute;ginas info)       con konqueror.
       Normalmente las p&aacute;ginas de informaci&oacute;n son algo m&aacute;s detalladas
que las p&aacute;ginas de manual.
       <br>
      </li>

      <li>C&oacute;mos<br>
       Puede encontrar los c&oacute;mos (howtos) en el  Linux Documentation
project en <a href=
      "http://www.linuxdoc.org">http://www.linuxdoc.org</a>. (N.T. Los
c&oacute;mos es espa&ntilde;ol se
      pueden obtener en la p&aacute;gina de Lucas <a
href="http://lucas.hispalinux.es/htmls/comos.html">Documentos Cortos
(C&Oacute;MOS) - INSFLUG</a>).<br>       </li>

      <li>El directorio /usr/share/doc<br>
       Algunos programas tienen su propia documentaci&oacute;n que puede
      encontrar en el directorio anterior.<br>
      </li>

      <li>Y por supuesto est&aacute; la informaci&oacute;n disponible en internet.
      Puede leer los art&iacute;culos de LinuxFocus y otras revistas.<br>
      </li>

      <li>O puede comprar revistas y libros sobre los temas que m&aacute;s
      le interesen.</li>
    </ul>
    <br>
     Para informarse de si el hardware que quiere utilizar est&aacute;
soportado
    mire en:<br>


    <ul>
      <li><a href="http://cdb.suse.de/">http://cdb.suse.de/</a><br>
      </li>

      <li><a href=

"http://www.linux-mandrake.com/en/hardware.php3">http://www.linux-mandrake.com/en/hardware.php3</a><br>

      </li>

      <li><a href=

"http://www.redhat.com/support/hardware/">http://www.redhat.com/support/hardware/</a><br>

      <br>
      </li>
    </ul>
    Para impresoras eche un vistazo a:<br>


    <ul>
      <li><a href=

"http://www.linuxprinting.org">http://www.linuxprinting.org</a><br>

      <br>
      </li>
    </ul>

    <A NAME="221lfindex16">&nbsp;</A>
<H2>Historia y Filosof&iacute;a</H2>


    <p>Linux comenz&oacute; hace 10 a&ntilde;os cuando Linus Torvalds se sent&oacute;
    en su cuarto y comenz&oacute; a escribir un peque&ntilde;o trozo de software
    que creci&oacute; y lleg&oacute; a convertirse en un sistema operativo completo al
    cabo de los a&ntilde;os. Lo que empez&oacute; simplemente por diversi&oacute;n traspas&oacute;
    los l&iacute;mites de los sistemas operativos en aquel entonces y lo que
en un
    principio esra para aprender la forma de trabajar del
    ordenador se convirti&oacute; en un
    gran proyecto con m&aacute;s y m&aacute;s gente involucrada, trabajando para
    &eacute;l o s&oacute;lo utiliz&aacute;ndolo.<br>
     Ha habido muchos cambios desde los primeros tiempos pero
    todav&iacute;a se mantiene algo del esp&iacute;ritu y de la filosof&iacute;a. La mayor&iacute;a
    del software para Linux es, as&iacute; como el propio sistema operativo,
c&oacute;digo
    abierto y tiene licencia GPL. Lo que significa que usted no s&oacute;lo
    puede ver el c&oacute;digo fuente sino tambi&eacute;n es libre de hacer todos
    los cambios que quiera seg&uacute;n  sus necesidades y gustos. Haciendo
    el c&oacute;digo fuente libre la informaci&oacute;n disponible es compartida
realmente
    y los buenos trabajos se pueden reutilizar, lo que significa que
puede
    emplear el tiempo en crear nuevas cosas en lugar de perderlo
    repitiendo trabajo que ya han hecho otros.<br>
     Para trabajar junto con otras personas en otras partes del mundo
    tambi&eacute;n se hace necesario hacer (grandes) programas muy modulares
    en su estructura. Todo esto hace de Linux un sistema operativo
    muy flexible que contin&uacute;a mejorando d&iacute;a a d&iacute;a..<br>
     Hay mucha gente participando en alguno de los numeros proyectos
    no porque tengan que hacerlo para ganarse la vida, sino porque les
    gusta Linux y su filosof&iacute;a y esp&iacute;ritu.</p>
    <br>


    <p>Tan s&oacute;lo deseo que haya disfrutado con su viaje
    y vuelva una y otra vez y quiz&aacute; finalmente decida convertirse
    en un residente permanente o incluso en un nativo alg&uacute;n d&iacute;a.<br>
     Y como las Navidades no est&aacute;n muy lejos, &iquest;por qu&eacute; no incluye
    este viaje en su carta a Santa Claus o se lo regala a alg&uacute;n amigo?
    Si tiene la mente un poco abierta y se encuentra dispuesto para unas
    vacaciones excitantes &iexcl;este podr&iacute;a ser un viaje maravilloso!.<br>
    <br>
    <br>
     Simplemente, &iexcl;divi&eacute;rtase un mont&oacute;n!</p>
    <!-- vim: set sw=2 ts=2 et: -->
  


<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=221&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Katja     Socher, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article221.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Katja Socher <small>&lt;katja(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Javier G&oacute;mez Sierras, Roberto Hernando Velasco &lt;jgomsi(at)obelix.umh.es, rhernando(at)mundofree.com&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-12-26, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
