<HTML
><HEAD
><TITLE
>La orden netstat</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.76b+
"><LINK
REL="HOME"
TITLE="Guía de Administración de Redes con Linux"
HREF="index.html"><LINK
REL="UP"
TITLE="Configuración del Protocolo TCP/IP"
HREF="x-087-2-iface.html"><LINK
REL="PREVIOUS"
TITLE="Todo sobre ifconfig"
HREF="x-087-2-iface.ifconfig.html"><LINK
REL="NEXT"
TITLE="Comprobación de las tablas ARP"
HREF="x-087-2-iface.verify.arp.html"><LINK
REL="STYLESHEET"
TYPE="text/css"
HREF="publicacoes.css"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Guía de Administración de Redes con Linux</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="x-087-2-iface.ifconfig.html"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Capítulo 5. Configuración del Protocolo TCP/IP</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="x-087-2-iface.verify.arp.html"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="X-087-2-IFACE.NETSTAT">5.9. La orden netstat</H1
><P
><B
CLASS="COMMAND"
>netstat</B
> es una herramienta útil para comprobar la configuración
y actividad de su red. Se llama netstat, aunque se trata en realidad de una colección
de herramientas combinadas. Describiremos cada una de las funciones en las secciones
siguientes.</P
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="X-087-2-IFACE.NETSTAT.-R">5.9.1. Consulta de la tabla de encaminamiento</H2
><P
>Si ejecuta <B
CLASS="COMMAND"
>netstat</B
> usando el indicador <TT
CLASS="OPTION"
>&ndash;r</TT
>,
puede ver la información de la tabla de encaminamiento del núcleo igual que hemos
venido haciendo hasta ahora con <B
CLASS="COMMAND"
>route</B
>. Para
<SPAN
CLASS="SYSTEMITEM"
>vstout</SPAN
>, tendríamos:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    # <TT
CLASS="USERINPUT"
><B
>netstat -nr</B
></TT
>
    Kernel IP routing table
    Destination   Gateway      Genmask         Flags  MSS Window  irtt Iface
    127.0.0.1     *            255.255.255.255 UH       0 0          0 lo
    172.16.1.0    *            255.255.255.0   U        0 0          0 eth0
    172.16.2.0    172.16.1.1   255.255.255.0   UG       0 0          0 eth0</PRE
></TD
></TR
></TABLE
></P
><P
>&#13;La opción -n hace que <B
CLASS="COMMAND"
>netstat</B
> imprima las direcciones
IP en notación de cuaterna en vez de usar los nombres simbólicos de las
máquinas o las redes. Esto es especialmente útil si pretende evitar
consultas para esos nombres a través de la red (por ejemplo consultas
a un servidor DNS o NIS).</P
><P
>La segunda columna de la salida producida por <B
CLASS="COMMAND"
>netstat</B
>
informa sobre las pasarelas a las que apunta la información de
encaminamiento. Si una ruta no usa pasarela, el programa imprime un
asterisco. La tercera columna imprime el nivel de &ldquo;generalización&rdquo;
de una ruta. Dada una dirección IP para la que encontrar una ruta apropiada, el núcleo
recorre la tabla registro a registro haciendo un "AND" lógico de la dirección
y la máscara de nivel de generalización antes de compararla con el destino
que muestra dicho registro.</P
><P
>La cuarta columna muestra varios indicadores que describen la ruta:

<P
></P
></P><DIV
CLASS="VARIABLELIST"
><DL
><DT
><TT
CLASS="LITERAL"
>G</TT
></DT
><DD
><P
>La ruta utiliza una pasarela.</P
></DD
><DT
><TT
CLASS="LITERAL"
>U</TT
></DT
><DD
><P
>La interfaz está activa.</P
></DD
><DT
><TT
CLASS="LITERAL"
>H</TT
></DT
><DD
><P
> Esta interfaz permite el acceso a una sola máquina. Este es el caso
 de la interfaz de bucle local <SPAN
CLASS="SYSTEMITEM"
>127.0.0.1</SPAN
>.</P
></DD
><DT
><TT
CLASS="LITERAL"
>D</TT
></DT
><DD
><P
>&#13;Esta ruta es creada dinámicamente. Aparece si la entrada de la tabla ha
sido generada por un demonio de encaminamiento como <B
CLASS="COMMAND"
>gated</B
>
o por un mensaje de redirección ICMP (ver la sección <A
HREF="x-087-2-issues.icmp.html"
>Sección 2.5</A
>&rdquo; en el capítulo 2).</P
></DD
><DT
><TT
CLASS="LITERAL"
>M</TT
></DT
><DD
><P
> Presente
cuando este registro ha sido modificado por un mensaje de redirección ICMP.</P
></DD
><DT
><TT
CLASS="LITERAL"
>!</TT
></DT
><DD
><P
>La ruta es una ruta de rechazo, y los datagramas serán descartados.</P
></DD
></DL
></DIV
><P></P
><P
>&#13;
Las siguientes tres columnas muestran el MSS, tamaño de ventana y irtt que
serán aplicados a las conexiones TCP establecidas a través de esta ruta. El
MSS es el Tamaño Máximo de Segmento, y es el tamaño del datagrama más grande
que construirá el núcleo para transmitir a través de esta ruta. La Ventana es
la cantidad máxima de datos que el sistema aceptará de una sola vez desde una
máquina remota. El acrónimo <TT
CLASS="LITERAL"
>irtt</TT
> significa &ldquo;tiempo inicial
de ida y vuelta&rdquo;, por sus iniciales en inglés. El protocolo TCP se asegura
de que los datos han sido transmitidos de forma fiable entre máquinas
retransmitiendo un datagrama si éste ha sido perdido. El protocolo TCP mantiene
un contador de cuánto tarda un datagrama en ser enviado a su destino, y el
"recibo" que se recibe, de forma que sabe cuánto esperar antes de suponer que un
datagrama necesita retrasmitirse. Este proceso se llama tiempo de ida y vuelta.
El tiempo de ida y vuelta inicial es el valor que el protocolo TCP usará cuando
se establezca una conexión por primera vez. Para la mayoría de los tipos de redes,
el valor por omisión es válido, pero para algunas redes lentas, especialmente
ciertos tipos de redes de radiopaquetes de aficionados, el tiempo es demasiado
pequeño y causa retransmisiones innecesarias. El valor de <TT
CLASS="LITERAL"
>irtt</TT
>
puede ajustarse usando el comando <B
CLASS="COMMAND"
>route</B
>. Los campos a 0
significan que se está usando el valor por omisión.</P
><P
>Para terminar, el último campo muestra el interfaz de red que usará esta ruta.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="X-087-2-IFACE.NETSTAT.-I">5.9.2. Consulta de las estadísticas de una interfaz</H2
><P
>Cuando se invoca con el indicador <TT
CLASS="OPTION"
>&ndash;i</TT
>
<B
CLASS="COMMAND"
>netstat</B
> presenta las estadísticas para las interfaces
de red configuradas en ese momento. Si también se pasa la opción
<TT
CLASS="OPTION"
>&ndash;a</TT
>, mostrará <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>todas</I
></SPAN
> las
interfaces presentes en el núcleo, y no sólo aquellas que hayan sido
configuradas. En <SPAN
CLASS="SYSTEMITEM"
>vstout</SPAN
>, la
salida para  <B
CLASS="COMMAND"
>netstat</B
> sería algo así:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    # <TT
CLASS="USERINPUT"
><B
>netstat -i</B
></TT
>
    Kernel Interface table
    Iface MTU Met  RX-OK RX-ERR RX-DRP RX-OVR  TX-OK TX-ERR TX-DRP TX-OVR Flags
    lo      0   0   3185      0      0      0   3185      0      0      0 BLRU
    eth0 1500   0 972633     17     20    120 628711    217      0      0 BRU</PRE
></TD
></TR
></TABLE
></P
><P
>Los campos <TT
CLASS="LITERAL"
>MTU</TT
> y <TT
CLASS="LITERAL"
>Met</TT
> muestran los valores
actuales de MTU y de métrica para esa interfaz. Las columnas
<TT
CLASS="LITERAL"
>RX</TT
> y <TT
CLASS="LITERAL"
>TX</TT
> muestran cuántos paquetes
han sido recibidos o transmitidos sin errores
(<TT
CLASS="LITERAL"
>RX-OK</TT
>/<TT
CLASS="LITERAL"
>TX-OK</TT
>) o dañados
(<TT
CLASS="LITERAL"
>RX-ERR</TT
>/<TT
CLASS="LITERAL"
>TX-ERR</TT
>); cuántos fueron descartados
 (<TT
CLASS="LITERAL"
>RX-DRP</TT
>/<TT
CLASS="LITERAL"
>TX-DRP</TT
>); y cuántos se perdieron por
 un desbordamiento. (<TT
CLASS="LITERAL"
>RX-OVR</TT
>/<TT
CLASS="LITERAL"
>TX-OVR</TT
>).</P
><P
>La última columna muestra los indicadores activos para cada interfaz. Son
abreviaturas del nombre completo del indicador, que se muestran con la
configuración de la interfaz que ofrece <B
CLASS="COMMAND"
>ifconfig</B
>:

<P
></P
></P><DIV
CLASS="VARIABLELIST"
><DL
><DT
><TT
CLASS="LITERAL"
>B</TT
></DT
><DD
><P
>Dirección de difusión activa.</P
></DD
><DT
><TT
CLASS="LITERAL"
>L</TT
></DT
><DD
><P
>La interfaz es un dispositivo de bucle local.</P
></DD
><DT
><TT
CLASS="LITERAL"
>M</TT
></DT
><DD
><P
>Se reciben todos los paquetes (modo promiscuo).</P
></DD
><DT
><TT
CLASS="LITERAL"
>O</TT
></DT
><DD
><P
>ARP no funciona para esta interfaz.</P
></DD
><DT
><TT
CLASS="LITERAL"
>P</TT
></DT
><DD
><P
>Conexión punto a punto.</P
></DD
><DT
><TT
CLASS="LITERAL"
>R</TT
></DT
><DD
><P
>La interfaz funciona.</P
></DD
><DT
><TT
CLASS="LITERAL"
>U</TT
></DT
><DD
><P
>La interfaz está activa.</P
></DD
></DL
></DIV
><P></P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="X-087-2-IFACE.NETSTAT.-T-U-X">5.9.3. Mostrar conexiones</H2
><P
><B
CLASS="COMMAND"
>netstat</B
> ofrece una serie de opciones para mostrar los puertos
activos o pasivos. Las opciones <TT
CLASS="OPTION"
>&ndash;t</TT
>,
<TT
CLASS="OPTION"
>&ndash;u</TT
>, <TT
CLASS="OPTION"
>&ndash;w</TT
>, y
<TT
CLASS="OPTION"
>&ndash;x</TT
> muestran conexiones activas a puertos
TCP, UDP, RAW, o Unix. Si incluye además el indicador
<TT
CLASS="OPTION"
>&ndash;a</TT
>, se mostrarán también los puertos que
estén esperando una conexión (es decir, que estén escuchando). Esto
le dará una lista de todos los servidores que estén corriendo
actualmente en su sistema.</P
><P
>Llamar a <B
CLASS="COMMAND"
>netstat -ta</B
> en
<SPAN
CLASS="SYSTEMITEM"
>vlager</SPAN
> produce esta salida:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    $ <TT
CLASS="USERINPUT"
><B
>netstat -ta</B
></TT
>
    Active Internet Connections
    Proto Recv-Q Send-Q Local Address    Foreign Address    (State)
    tcp        0      0 *:domain         *:*                LISTEN
    tcp        0      0 *:time           *:*                LISTEN
    tcp        0      0 *:smtp           *:*                LISTEN
    tcp        0      0 vlager:smtp      vstout:1040        ESTABLISHED
    tcp        0      0 *:telnet         *:*                LISTEN
    tcp        0      0 localhost:1046   vbardolino:telnet  ESTABLISHED
    tcp        0      0 *:chargen        *:*                LISTEN
    tcp        0      0 *:daytime        *:*                LISTEN
    tcp        0      0 *:discard        *:*                LISTEN
    tcp        0      0 *:echo           *:*                LISTEN
    tcp        0      0 *:shell          *:*                LISTEN
    tcp        0      0 *:login          *:*                LISTEN</PRE
></TD
></TR
></TABLE
></P
><P
>Esta salida muestra que la mayoría de los servidores están simplemente
esperando una conexión externa. Sin embargo, la cuarta línea muestra una
conexión SMTP desde <SPAN
CLASS="SYSTEMITEM"
>vstout</SPAN
>,
y la sexta línea le indica que usted está haciendo una conexión telnet
a <SPAN
CLASS="SYSTEMITEM"
>vbardolino</SPAN
>.<A
NAME="X-087-2-FNTC13"
HREF="#FTN.X-087-2-FNTC13"
>[1]</A
>&#13;</P
><P
>El indicador <TT
CLASS="OPTION"
>&ndash;a</TT
> por sí sólo indicará todos los
sockets de todo tipo.</P
><P
></P
></DIV
></DIV
><H3
CLASS="FOOTNOTES"
>Notas</H3
><TABLE
BORDER="0"
CLASS="FOOTNOTES"
WIDTH="100%"
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.X-087-2-FNTC13"
HREF="x-087-2-iface.netstat.html#X-087-2-FNTC13"
>[1]</A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
> Para saber si una conexión es saliente por
los números de puerto. El número de puerto mostrado por una máquina
<SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>que llama</I
></SPAN
> siempre será un entero simple. En el caso
de llamar a una máquina, usaremos un puerto correspondiente a un servicio
conocido, por lo que <B
CLASS="COMMAND"
>netstat</B
> usará el nombre simbólico,
como <TT
CLASS="LITERAL"
>smtp</TT
>, que encuentre en <TT
CLASS="FILENAME"
>/etc/services</TT
>.</P
></TD
></TR
></TABLE
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="x-087-2-iface.ifconfig.html"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Inicio</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="x-087-2-iface.verify.arp.html"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Todo sobre ifconfig</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="x-087-2-iface.html"
ACCESSKEY="U"
>Subir</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Comprobación de las tablas ARP</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>