<HTML>
<HEAD>
<TITLE>BitchX Mini Como: Comandos B&aacute;sicos</TITLE>
</HEAD>
<BODY>
<A HREF="BitchX-Como-2.html">Anterior</A>
<A HREF="BitchX-Como-4.html">Siguiente</A>
<A HREF="BitchX-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Comandos B&aacute;sicos</A></H2>


<P>Los comandos se introducen anteponiendo un <CODE>/</CODE> y despu&eacute;s el
comando.  Algunos comandos son: </P>
<P>
<UL>
<LI><CODE>/join #canal</CODE>: este se usa para entrar en un canal (por
ejemplo, <CODE>/join #linux</CODE>). 

El ``<CODE>#</CODE>''no es un capricho m&iacute;o, los canales se representan siempre
con un ``<CODE>#</CODE>'' delante del nombre. No obstante, el BitchX tiene un
equivalente abreviado; si introducimos <CODE>/j linux</CODE> har&aacute; exactamente
lo mismo. 
</LI>
<LI><CODE>/leave #canal</CODE>: para abandonar un canal.
</LI>
<LI><CODE>/whois nick</CODE>: nos da informaci&oacute;n sobre un usuario del irc.
</LI>
<LI><CODE>/who #canal</CODE>: nos dice qui&eacute;n est&aacute; en el canal.
</LI>
<LI><CODE>/w nick</CODE>: igual que el comando <CODE>who</CODE>.
</LI>
<LI><CODE>/whowas nick</CODE>: nos dice si un usuario ha estado en el irc.
</LI>
<LI><CODE>/ww nick</CODE>: igual que el comando <CODE>whowas</CODE>.
</LI>
<LI><CODE>/list -yes</CODE>: nos da la lista de todos los canales.
</LI>
<LI><CODE>/msg nick</CODE>: este es para mandarle un mensaje privado a
``nick''. Tambi&eacute;n podemos darle al <CODE>Tab</CODE> y empezar&aacute;n a salir los
nombres de los miembros del canal o de las personas que te han mandado un
mensaje, as&iacute; que puedes mantener privados sin necesidad de escribir todo
el rato <CODE>/msg nick</CODE> sino que con ponerlo una vez y darle luego al
<CODE>Tab</CODE> ya lo tendr&aacute;s escrito. 

Si ponemos <CODE>/msg #canal</CODE> lo mandamos a todo el canal (esto
&uacute;ltimo no hace falta, si es el mismo canal en el que estamos, pero s&iacute; si
es otro en el que estemos metidos, pero no hablando actualmente. 
</LI>
<LI><CODE>/topic</CODE>: nos dir&aacute; el topic que tiene el canal. 
</LI>
<LI><CODE>/dns nick</CODE>: nos dar&aacute; la direcci&oacute;n IP de nick. 
</LI>
<LI><CODE>/ignore nick</CODE>: ignorar&aacute; los mensajes de nick. Para terminar
un <CODE>ignore</CODE> se pone <CODE>/unig -nick</CODE>, y si queremos ver la lista de
ignorados simplemente con poner <CODE>/ignore</CODE> nos saldr&aacute;.
</LI>
<LI><CODE>/dcc chat nick</CODE>: establece un chat con nick. Normalmente los
chats salen con un <CODE>=</CODE> delante. Para cerrar un chat basta con poner
<CODE>/dcc chat close nick</CODE>
</LI>
<LI><CODE>Comandos de operador</CODE>:  Necesitas ser operador del canal
para usarlos 

<UL>
<LI><CODE>/k nick &oacute; /kick nick</CODE>: echar&aacute; a <CODE>nick</CODE> del canal.
</LI>
<LI><CODE>/b nick</CODE> &oacute; <CODE>/ban nick</CODE>: banear&aacute; a <CODE>nick</CODE> del
canal.  (Osea, no le deja entrar m&aacute;s en el canal, por lo menos hasta que
alguien quite el ban)
</LI>
<LI><CODE>/kb nick</CODE>: echa y banea a <CODE>nick</CODE> del canal
</LI>
<LI><CODE>/topic Texto</CODE>: cambia el topic del canal por <CODE>Texto</CODE>
</LI>
<LI><CODE>/op nick</CODE>: hace a <CODE>nick</CODE> operador del canal.
</LI>
<LI><CODE>/deop nick</CODE>: le quita el estatus de operador a <CODE>nick</CODE></LI>
</UL>

</LI>
<LI><CODE>/notify nick</CODE>: nos avisa cuando <CODE>nick</CODE> entra o sale del irc.
</LI>
<LI><CODE>/notify</CODE>: nos da lista de <I>notifys</I>.
</LI>
<LI><CODE>/saveirc</CODE>: graba el .bitchxrc
</LI>
<LI><CODE>/save</CODE> o <CODE>savelist</CODE>: graba los formatos y las
configuraciones que se pueden ver poniendo <CODE>/set</CODE>.
</LI>
<LI><CODE>/p nick</CODE>: nos dice el ping de <CODE>nick</CODE> respecto a nosotros
(ctcp ping) 
</LI>
<LI><CODE>/p #canal</CODE>: hace un ping a todas las personas que haya
en el canal. 
</LI>
<LI><CODE>/part</CODE>: sale del canal en el que est&eacute;s.
</LI>
<LI><CODE>/v nick</CODE>: nos dice el cliente de irc que est&aacute; usando
<CODE>nick</CODE>.  (ctcp version). Si queremos no contestar a los <I>versions</I>
se puede hacer poniendo <CODE>set cloak on</CODE> o d&aacute;ndole a la tecla <CODE>Supr</CODE>. 
</LI>
<LI><CODE>/v #canal</CODE>: hace un <CODE>version</CODE> a todas las personas
que est&eacute;n en el canal. 
</LI>
<LI><CODE>/ver</CODE>: igual que el <CODE>/v</CODE>.
</LI>
<LI><CODE>/email nick</CODE>: nos dice la direcci&oacute;n de e-mail de <CODE>nick</CODE>
(para eso <CODE>nick</CODE> tiene que tener configurado su cliente de irc) 
</LI>
<LI><CODE>/quit</CODE>: termina la conexi&oacute;n.
</LI>
<LI><CODE>/exec</CODE>: ejecuta un comando en un el shell y muestra la salida.
</LI>
<LI><CODE>/redirect #canal exec comando</CODE> lanza un comando y
redirige su salida al canal. 
</LI>
</UL>
</P>

<H2><A NAME="ss3.1">3.1 Env&iacute;o/Recepci&oacute;n de ficheros.</A></H2>


<P>Para el env&iacute;o/recepci&oacute;n de ficheros se usa el <CODE>dcc</CODE> pero si lo
queremos ofrecer a todo el canal usamos los cdcc y para cogerlos los ctcp. </P>
<P>
<UL>
<LI><CODE>/cdcc</CODE>: nos da la lista de comandos cdcc disponibles (&uacute;til
para ofrecer ficheros a todo el canal, por ejemplo).
</LI>
<LI><CODE>/dcc </CODE>: nos muestra los ficheros que se est&aacute;n enviando o
recibiendo por dcc. 
</LI>
<LI><CODE>/dcc send nick fichero</CODE>: le env&iacute;a a nick el fichero.
</LI>
<LI><CODE>/dcc get nick</CODE>: recibe el fichero de nick (se puede
configurar la recepci&oacute;n autom&aacute;tica mediante el comando <CODE>/set auto_dcc
on</CODE> (hay muchas cosas que se pueden configurar poniendo simplemente
<CODE>/toggle</CODE>) 
</LI>
<LI><CODE>/dcc close #N</CODE>: corta el env&iacute;o/recepci&oacute;n N.
</LI>
<LI><CODE>/dcg nick</CODE>: mata los chats con nick.</LI>
</UL>
</P>
<P>Ahora viene la lista de los ctcp (muy &uacute;tiles en efnet ;) )</P>
<P>
<UL>
<LI><CODE>/ctcp #canal cdcc list</CODE>: pide la lista de ficheros
ofrecidos en #canal. 
</LI>
<LI><CODE>/ctcp nick cdcc list</CODE>: pide la lista de ficheros a <CODE>nick</CODE>
</LI>
<LI><CODE>/ctcp nick cdcc send #N</CODE>: pide a nick que env&iacute;e el
paquete n&uacute;mero N. 
</LI>
<LI><CODE>/ctcp nick resend #N</CODE>: pide a nick que reenv&iacute;e el
paquete pero comenzando por donde se cort&oacute; (muy &uacute;til si te est&aacute;n mandando
ficheros largos, hay que tener el fichero en el mismo directorio desde el
que lanzamos el BitchX, si no, no lo encuentra y enviar&aacute; el fichero
entero). No todos los que ofrecen ficheros tienen disponible esta opci&oacute;n. 
</LI>
</UL>
</P>


<H2><A NAME="ss3.2">3.2 Gesti&oacute;n de Ventanas </A></H2>


<P>Todo lo que podamos hacer con clientes gr&aacute;ficos lo podremos hacer con el
<B>BitchX</B>, el manejo de ventanas es similar al que usan programas
como <CODE>screen</CODE>. Algunos scripts simplifican las cosas y con
combinaciones como <CODE>Ctrl W C</CODE> podemos crear ventanas. Poniendo
<CODE>/window help</CODE> podemos ver una lista de todos los comandos
posibles. Se pueden encadenar y con <CODE>/window new hide</CODE> creamos una
ventana y la ocultamos. Los comandos b&aacute;sicos son:</P>
<P>
<UL>
<LI><CODE>/window new</CODE>: crea una nueva ventana.
</LI>
<LI><CODE>/window kill [refnum]</CODE>: destruye la ventana
actual.
</LI>
<LI><CODE>/window list</CODE>: lista todas las ventanas. Cada ventana tiene
asociado un nombre (si se lo hemos puesto) y una referencia (refnum)  que
se usan para hacer operaciones sobre las ventanas. 
</LI>
<LI><CODE>/window hide [refnum]</CODE>: oculta una ventana.
</LI>
<LI><CODE>/window show [refnum]</CODE>: muestra una ventana.  Si
no ponemos nada en [refnum] todos estos comandos act&uacute;an sobre la
ventana activa en ese momento. 
</LI>
<LI><CODE>/window name NOMBRE</CODE>: fija el nombre para esa ventana.
</LI>
<LI><CODE>/window grow FILAS</CODE>: aumenta o disminuye en FILAS la ventana
activa. 
</LI>
</UL>
</P>
<P>Mediante estos comandos podemos tener una ventana distinta para cada
canal, para cada servidor de irc, podemos hacer que cuando alguien nos
mande un privado se cree una ventana solo para sus mensajes y todo lo que
se nos pueda ocurrir. Por ejemplo yo tengo puesto lo siguiente en mi
.bitchxrc:  <CODE>/window name linux</CODE> (llama linux a la ventana
principal)  <CODE>/window new name msgs level msgs split on double on
hide</CODE> crea una nueva ventana oculta llamada msgs para los msgs (level
msgs).  <CODE>/window swap msgs</CODE> cambia a la ventana msgs.  <CODE>/window
show linux grow 5</CODE> muestra la ventana linux y la aumenta 5 lineas.</P>
<P>Con todo esto lo que he conseguido es tener una ventana peque&ntilde;ita en la
parte de abajo en donde me saldr&aacute;n todos los mensajes privados :) </P>
<P>Si por ejemplo quiero crear una nueva ventana para meterme en el canal
#4quake pondr&eacute; <CODE>/window new hide channel #4quake </CODE> que me
crea una ventana, la oculta e intenta entrar en el canal #4quake en
esa ventana.  </P>
<P>Para verla basta con poner <CODE>/window last</CODE> o poner <CODE>/window
list</CODE> lo que nos dir&aacute; las ventanas activas saliendo m&aacute;s o menos una
cosa como esta:  </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
-:- Ref Nick Name Channel Query Server Level 
-:- 1 unsCAred &lt;None&gt; #linux &lt;None&gt; unsCAred.d NONE 
-:- 2 unsCAred &lt;None&gt; #4quake &lt;None&gt; unsCAred.d NONE
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>ahora si pongo <CODE>/window show 2</CODE> me mostrar&aacute; la ventana del canal
#4quake. </P>
<P>Cuando tenemos m&aacute;s de una ventana en la pantalla, la ventana activa se
indica con un <B>^^^^^^</B> en la barra de estado, si queremos cambiar a
la otra usamos <CODE> control-W P</CODE> (para ver una lista completa de las
combinaciones del teclado se pone <CODE>/bhelp window</CODE>.  Si las
ventanas est&aacute;n ocultas lo mas c&oacute;modo es usar <CODE>Alt-#</CODE> siendo
# un n&uacute;mero del 1 al 9 y con esto vamos cambiando a la ventana que
queramos. </P>


<H2><A NAME="ss3.3">3.3 Servidores</A></H2>


<P>Una de las propiedades del <CODE>BitchX</CODE> es que permite estar en varios
servidores a la vez. Para hacer esto simplemente tenemos que crear una
nueva ventana (ver secci&oacute;n anterior) y poner <CODE>/server</CODE>
<EM>+SERVIDOR</EM> . El <CODE>+</CODE> es importante porque sino lo que
haremos es cambiar el servidor en el que estamos actualmente. Para cerrar
la conexi&oacute;n con un servidor basta con poner <CODE>/server</CODE>
<EM>-SERVIDOR</EM>. </P>
<P>Poniendo <CODE>/server</CODE> nos da la lista de servidores (lista que o bien
se le pasa como par&aacute;metro al arrancar o al compilarlo; ver el fichero
<CODE>/include/config.h</CODE>). </P>


<HR>
<A HREF="BitchX-Como-2.html">Anterior</A>
<A HREF="BitchX-Como-4.html">Siguiente</A>
<A HREF="BitchX-Como.html#toc3">Indice</A>
</BODY>
</HTML>
