<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>FAQ de CervanTeX: Informaci&oacute;n sobre LaTeX en castellano</TITLE>
 <LINK HREF="FAQ-CervanTeX-11.html" REL=next>
 <LINK HREF="FAQ-CervanTeX-9.html" REL=previous>
 <LINK HREF="FAQ-CervanTeX.html#toc10" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-CervanTeX-11.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-9.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc10">Índice general</A>
<HR>
<H2><A NAME="s10">10.</A> <A HREF="FAQ-CervanTeX.html#toc10">Informaci&oacute;n sobre LaTeX en castellano</A></H2>

<H2><A NAME="ss10.1">10.1</A> <A HREF="FAQ-CervanTeX.html#toc10.1">El Grupo de Usuarios de TeX Hispanohablantes (CervanTeX)</A>
</H2>

<H3>¿C&oacute;mo puedo entrar en contacto con el grupo de usuarios?</H3>

<P> 
Existe el Grupo de Usuarios de TeX Hispanohablantes <EM>CervanTeX</EM> y como se
dec&iacute;a en la cabecera, esta es su FAQ. En este momento la Junta
Directiva de <EM>CervanTeX</EM> est&aacute; formada por 
<BLOCKQUOTE><CODE>
<PRE>
PRESIDENTE:   Jos&eacute; Ra. Portillo       (josera@cica.es)
 
VOCALES:      Javier Bezos            (jbezos@arrakis.es)
              Roberto Herrero         (rhs@csn.es)
</PRE>
</CODE></BLOCKQUOTE>

Para pedir informaci&oacute;n sobre el grupo se puede contactar con cualquiera de
ellos. Si se prefiere una forma distinta al correo electr&oacute;nico
puede contactarse con el grupo a trav&eacute;s de
<BLOCKQUOTE><CODE>
<PRE>
Jos&eacute; Ra. Portillo Fern&aacute;ndez
E.T.S. Arquitectura
Departamento de Matem&aacute;tica Aplicada 1
Reina Mercedes, 2
E-41012 Sevilla (Spain)

Voz: +34-5-455-6622 Fax: +34-5-455-6621
</PRE>

Electrocorreo: 
<CODE>josera@cica.es</CODE>
</CODE></BLOCKQUOTE>

Hay una p&aacute;gina WWW del grupo CervanTeX:
<BLOCKQUOTE>
<A HREF="http://apolo.us.es/CervanTeX/">http://apolo.us.es/CervanTeX/</A></BLOCKQUOTE>

con informaci&oacute;n m&aacute;s espec&iacute;fica sobre las actividades del grupo en
<BLOCKQUOTE>
<A HREF="http://apolo.us.es/CervanTeX/GUTH.html">http://apolo.us.es/CervanTeX/GUTH.html</A></BLOCKQUOTE>
</P>

<H2><A NAME="lista-sptex"></A> <A NAME="ss10.2">10.2</A> <A HREF="FAQ-CervanTeX.html#toc10.2">La lista <CODE>sptex</CODE> </A>
</H2>


<H3>¿C&oacute;mo funciona la lista <CODE>sptex</CODE>?</H3>

<P>La lista <CODE>sptex</CODE> es el foro principal de discusi&oacute;n en este
idioma. Se trata de una lista cerrada, por lo que es necesario
suscribirse a la misma para enviar y recibir mensajes. Aunque es
independiente del grupo CervanTeX, gran parte de los suscriptores de la
lista son miembros del grupo y viceversa. CervanTeX recomienda a todas las
personas interesadas en TeX en espa&ntilde;ol la suscripci&oacute;n a esta lista.</P>
<P>
<UL>
<LI> 
Para suscribirse, debe utilizarse el formulario disponible en 
<A HREF="http://www2.cica.es/servlist/listinfo/sptex">http://www2.cica.es/servlist/listinfo/sptex</A></LI>
<LI>Para enviar un mensaje a la lista una vez suscrito:
<BLOCKQUOTE><CODE>
<PRE>
mail sptex@ls.cica.es.
</PRE>
</CODE></BLOCKQUOTE>
</LI>
<LI>Para borrarse de la lista o cambiar las opciones de suscripci&oacute;n, se crear&aacute; una
p&aacute;gina de suscripci&oacute;n por cada suscriptor, que le permitir&aacute; hacer los cambios
deseados. 
Asimismo se puede hacer por correo electr&oacute;nico. Para ello debe mandarse un
mensaje a <CODE>Sptex-request@ls.cica.es</CODE> con la palabra "help" (sin comillas) en
el asunto o en el cuerpo del mensaje. El gestor de correo enviar&aacute; un mensaje con
las instrucciones adecuadas. El mismo procedimiento debe seguirse para obtener
m&aacute;s informaci&oacute;n sobre las operaciones disponibles. 
<P>Por favor, NO mandar peticiones de suscripci&oacute;n o des-suscripci&oacute;n a la propia lista (<CODE>sptex</CODE>).</P>
</LI>
</UL>
</P>
<H3>¿Se archiva en alg&uacute;n sitio la lista <CODE>sptex</CODE>?</H3>

<P>S&iacute;, en 
<A HREF="http://www2.cica.es/servlist/private/sptex/">http://www2.cica.es/servlist/private/sptex/</A> pero es accesible &uacute;nicamente
a personas suscritas a la lista.</P>
<H3>Cuando contesto a alguien de la lista, ¿qui&eacute;n recibe la respuesta? ¿El que mand&oacute; el mensaje o la lista entera?</H3>

<P>Por omisi&oacute;n, se contesta a la lista entera, salvo que el remitente incluya un
campo <CODE>Reply-To</CODE> expl&iacute;cito.</P>

<H3>Recibo correo de muchas listas. ¿C&oacute;mo puedo filtrar lo que venga de la lista <CODE>sptex</CODE>?</H3>

<P>Todo lo que viene de <CODE>sptex</CODE> tiene un campo que comienza as&iacute;:
<BLOCKQUOTE><CODE>
<PRE>
Sender: sptex-admin@cica.es
</PRE>
</CODE></BLOCKQUOTE>

Si utilizamos un filtro llamado <EM>procmail</EM> (es software libre), podemos poner
las siguientes tres l&iacute;neas en el archivo de configuraci&oacute;n
<CODE>.procmailrc</CODE>:
<BLOCKQUOTE><CODE>
<PRE>
:0
* ^Sender: sptex-admin@cica.es
spanish-tex
</PRE>
</CODE></BLOCKQUOTE>

y todo lo que venga de <EM>sptex</EM> se ir&aacute; solito al archivo <CODE>spanish-tex</CODE>.</P>

<H3>¿C&oacute;mo es que hay tanta gente de fuera de Espa&ntilde;a en la lista?</H3>

<P>El tema previsto de esta lista era el uso de TeX para la producci&oacute;n de
documentos en castellano, no para discutir en castellano acerca de
TeX ni el uso de TeX en Espa&ntilde;a. Esto no es r&iacute;gido, pero no
pretende ser una lista espa&ntilde;ola. No se excluyen tampoco discusiones
acerca de las otras lenguas espa&ntilde;olas (catal&aacute;n, euskera, gallego,
ingl&eacute;s, :-) pero gran parte de la audiencia no estar&aacute; interesada.</P>
<H2><A NAME="ss10.3">10.3</A> <A HREF="FAQ-CervanTeX.html#toc10.3">La lista <CODE>spanish-tex</CODE></A>
</H2>

<P><EM>ATENCI&Oacute;N</EM>. La lista <EM>spanish-tex</EM> est&aacute; obsoleta. En su lugar debe
utilizarse la lista <EM>sptex</EM>.  V&eacute;ase 
<A HREF="#lista-sptex">lista-sptex</A>
. </P>

<H3>¿Se archiva en alg&uacute;n sitio la lista <CODE>spanish-tex</CODE>?</H3>

<P>S&iacute;, en la siguiente direcci&oacute;n se encuentran archivados los mensajes de la lista <CODE>spanish-tex</CODE>
<BLOCKQUOTE>
<A HREF="http://majordomo.eunet.es/listserv/spanish-tex/">http://majordomo.eunet.es/listserv/spanish-tex/</A></BLOCKQUOTE>

junto con las instrucciones de acceso a la lista.</P>

<H2><A NAME="ss10.4">10.4</A> <A HREF="FAQ-CervanTeX.html#toc10.4">El grupo de noticias <CODE>es.comp.lenguajes.tex</CODE></A>
</H2>

<P>Una fuente de informaci&oacute;n alternativa es el grupo de noticias 
<A HREF="es.comp.lenguajes.tex">es.comp.lenguajes.tex</A>,
aunque tiene bastante menos tr&aacute;fico que la lista de correo. Este es el
grupo de noticias principal sobre TeX en espa&ntilde;ol.</P>

<H2><A NAME="ss10.5">10.5</A> <A HREF="FAQ-CervanTeX.html#toc10.5">El grupo de noticias <CODE>es.eunet.spanish-tex</CODE></A>
</H2>

<P>Antes exist&iacute;a un puente (<EM>gateway</EM>) entre la lista y el grupo de noticias
<CODE>es.eunet.spanish-tex</CODE>, pero actualmente no funciona. Adem&aacute;s este
grupo ya no es de acceso general, sino que es propio de la red
<CODE>eunet</CODE>. </P>

<HR>
<A HREF="FAQ-CervanTeX-11.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-9.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc10">Índice general</A>
</BODY>
</HTML>
