<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>FAQ de CervanTeX: Preguntas espec&iacute;ficas para el LaTeX en castellano</TITLE>
 <LINK HREF="FAQ-CervanTeX-7.html" REL=next>
 <LINK HREF="FAQ-CervanTeX-5.html" REL=previous>
 <LINK HREF="FAQ-CervanTeX.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-CervanTeX-7.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-5.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc6">Índice general</A>
<HR>
<H2><A NAME="s6">6.</A> <A HREF="FAQ-CervanTeX.html#toc6">Preguntas espec&iacute;ficas para el LaTeX en castellano</A></H2>

<H2><A NAME="ss6.1">6.1</A> <A HREF="FAQ-CervanTeX.html#toc6.1">¿C&oacute;mo puedo usar TeX en castellano? o ¿Qu&eacute; es lo m&iacute;nimo que hay que</A>
                    saber para escribir en castellano con TeX/LaTeX?</H2>

<P>En realidad, no es necesario nada adicional que no est&eacute; ya incluido en las
distribuciones m&aacute;s habituales. El problema normalmente se reduce a
tres cosas:
<OL>
<LI>Introducci&oacute;n de caracteres acentuados.  V&eacute;anse las respuestas a las
preguntas 
<A HREF="#raw-characters">mediante &oacute;rdenes      LaTeX</A>, 
<A HREF="#8bitintro">¿C&oacute;mo introducir directamente los        caracteres extendidos?</A> y  
<A HREF="#acentos-math">acentos en modo matem&aacute;tico</A>
</LI>
<LI>Literales en castellano. V&eacute;ase la respuesta a la pregunta
<A HREF="#literales">¿C&oacute;mo cambiar los literales que LaTeX produce?</A>.</LI>
<LI>Patrones de partici&oacute;n de palabras (silabeo o guionado). V&eacute;ase 
<A HREF="#patrones-guionado">patrones de guionado</A> donde se
explica c&oacute;mo hacer que TeX parta las palabras siguiendo las
reglas del espa&ntilde;ol.</LI>
</OL>
</P>

<H2><A NAME="ss6.2">6.2</A> <A HREF="FAQ-CervanTeX.html#toc6.2">Con LaTeX, ¿c&oacute;mo puedo escribir los acentos y dem&aacute;s caracteres extendidos?</A>
</H2>

<H3><A NAME="raw-characters"></A> Mediante &oacute;rdenes LaTeX </H3>

<P>Cuando no hay m&aacute;s remedio, los caracteres extendidos se escriben as&iacute;:
<BLOCKQUOTE><CODE>
<PRE>
&aacute;  ==>  \'a        &Aacute;  ==>  \'A     &ntilde;  ==>  \~n   ¿  ==>  ?`
&eacute;  ==>  \'e        &Eacute;  ==>  \'E     &Ntilde;  ==>  \~N   ¡  ==>  !`
&iacute;  ==>  \'\i{}     &Iacute;  ==>  \'I     &uuml;  ==>  \"u
&oacute;  ==>  \'o        &Oacute;  ==>  \'O     &Uuml;  ==>  \"U
&uacute;  ==>  \'u        &Uacute;  ==>  \'U
</PRE>
</CODE></BLOCKQUOTE>

Sin embargo, &eacute;sto normalmente no es necesario. V&eacute;ase la respuesta a la pregunta 
<A HREF="#8bitintro">Introducir directamente los caracteres extendidos</A></P>

<H3><A NAME="8bitintro"></A> Directamente mediante el paquete <EM>inputenc</EM></H3>

<P>El paquete <EM>inputenc</EM> permite escribir directamente en la p&aacute;gina de c&oacute;digos
habitual, convirti&eacute;ndose internamente el texto introducido a texto
LaTeX, de acuerdo con las diferentes tablas de equivalencia para
las distintas p&aacute;ginas de c&oacute;digos y de forma completamente
transparente al usuario.</P>
<P>Si somos usuarios de UNIX, debemos poner al principio de nuestro documento (en
lo que se denomina el pre&aacute;mbulo, entre <CODE>\documentclass...</CODE> y
<CODE>\begin{document}</CODE>) lo siguiente: 
<BLOCKQUOTE><CODE>
<PRE>
\usepackage[latin1]{inputenc}
</PRE>
</CODE></BLOCKQUOTE>

Si trabajamos con MS-Windog hay que usar <CODE>ansinew</CODE> (que es <EM>casi</EM> el
<CODE>latin1</CODE>)
<BLOCKQUOTE><CODE>
<PRE>
\usepackage[ansinew]{inputenc}
</PRE>
</CODE></BLOCKQUOTE>

Si trabajamos con DOS, hay que poner esto:
<BLOCKQUOTE><CODE>
<PRE>
\usepackage[cp850]{inputenc}
</PRE>
</CODE></BLOCKQUOTE>

Y si somos de Macintosh, esto otro:
<BLOCKQUOTE><CODE>
<PRE>
\usepackage[applemac]{inputenc}
</PRE>
</CODE></BLOCKQUOTE>

Por lo tanto, el m&eacute;todo recomendado para utilizar caracteres de 8 bits en TODAS
las plataformas en LaTeX2e es escribir:
<BLOCKQUOTE><CODE>
<PRE>
\usepackage[tipo]{inputenc}
</PRE>
</CODE></BLOCKQUOTE>

para decir qu&eacute; p&aacute;gina de c&oacute;digos de entrada usamos.</P>
<P>Ni este m&eacute;todo ni el que se menciona en 
<A HREF="#raw-characters">acentos LaTeX</A> son v&aacute;lidos en modo
matem&aacute;tico.</P>

<H3><A NAME="acentos-math"></A> ¿C&oacute;mo introducir acentos en modo matem&aacute;tico?</H3>

<P>Para introducir acentos en modo matem&aacute;tico no hay m&aacute;s remedio que hacerlo
mediante &oacute;rdenes LaTeX, pero en este caso son distintas de las de
la secci&oacute;n  
<A HREF="#raw-characters">acentos LaTeX</A>. Por
ejemplo <EM>m&aacute;x</EM> se escribir&iacute;a en modo matem&aacute;tico como
<CODE>m\acute{a}x</CODE>. Si se quiere un acento sobre una i, tanto
<EM>spanish</EM> para <EM>babel</EM> como el paquete <EM>dotlessi</EM>
<CODE>(CTAN://macros/latex/contrib/supported/bezos/dotlessi.sty)</CODE>
proporcionan la orden <CODE>\dotlessi</CODE>; por ejemplo, m&iacute;n se
escribir&iacute;a <CODE>m\acute{\dotlessi}n</CODE>.</P>
<P>         
<EM>spanish.sty</EM> ya proporciona algunas de estas palabras acentuadas, por ejemplo,
despu&eacute;s de cargar el paquete <EM>babel</EM> con la opci&oacute;n <EM>spanish</EM> mediante
<CODE>\usepackage[spanish]{babel}</CODE>, <CODE>$\min a$</CODE> permite escribir la palabra
acentuada. Tambi&eacute;n proporciona un <CODE>\dotlessi</CODE> que complementa a <CODE>\imath</CODE>.</P>

<H2><A NAME="ss6.3">6.3</A> <A HREF="FAQ-CervanTeX.html#toc6.3">¿Puedo compartir mis archivos LaTeX en los que he escrito los acentos</A>
                    directamente?</H2>

<P>Si los caracteres acentuados est&aacute;n escritos mediante &oacute;rdenes LaTeX pueden
compartirse sin problemas, ya que se utiliza &uacute;nicamente codificaci&oacute;n
de 7 bits.</P>
<P>Si introduzco las letras acentuadas directamente como en 
<A HREF="#8bitintro">utilizando inputenc</A>, tendr&eacute;
dos posibles problemas:
<OL>
<LI>¿Me servir&aacute; para otros ordenadores que utilicen una p&aacute;gina de c&oacute;digos
diferente?, pues la segunda mitad del conjunto de caracteres es
distinta de unos a otros.</LI>
<LI>¿Podr&eacute; enviarlo por correo electr&oacute;nico?, pues solamente acepta 7 bits.</LI>
</OL>

¿C&oacute;mo se soluciona esto? Con GNU <EM>recode</EM>, con MIME, o con las dos cosas,
seg&uacute;n el caso.
<OL>
<LI>Si simplemente se quiere procesar el documento, s&iacute; que servir&aacute; para otros
ordenadores: Ejemplo: Si nosotros tenemos Unix y alguien que usa
Macintosh nos da (en disquete) un archivo con los c&oacute;digos del Mac,
nuestro LaTeX lo entender&aacute; y lo procesar&aacute; bien si lleva la
llamada a <EM>inputenc</EM>, dando el resultado correcto, aunque no
podamos ver correctamente el texto original con nuestro editor de
texto. 
<P>Si queremos adem&aacute;s modificar el documento o simplemente ver bien o simplemente
ver bien el texto sin procesar original, necesitaremos
convertirlo a la p&aacute;gina de c&oacute;digos que se utilice en nuestro
ordenador. Para ello recurriremos a GNU <EM>recode</EM> escribiendo:
<BLOCKQUOTE><CODE>
<PRE>
recode applemac:latin1 archivo.tex
</PRE>
</CODE></BLOCKQUOTE>

que nos convierte el documento de la p&aacute;gina de c&oacute;digos <CODE>applemac</CODE> a la
<CODE>latin1</CODE>. Si ahora modificamos la l&iacute;nea del <EM>inputenc</EM>
para que ponga <CODE>latin1</CODE> en lugar de <CODE>applemac</CODE> todo
funciona exactamente igual que antes en cuanto al
resultado. ¡Magia! ¿D&oacute;nde encontrar fuentes o binarios
precompilados de <EM>recode</EM>? En los siguientes lugares:</P>
<P>
<DL>
<DT><B>fuentes</B><DD><P>En cualquier r&eacute;plica del archivo GNU, en el directorio <CODE>recode</CODE>.</P>
<DT><B>DOS</B><DD><P>
<A HREF="ftp://ftp.simtel.net/pub/simtelnet/gnu/gnuish/dos_only">ftp://ftp.simtel.net/pub/simtelnet/gnu/gnuish/dos_only</A>
o en el mismo lugar en cualquier r&eacute;pilca del archivo <EM>simtel</EM>.</P>
<DT><B>DOS32</B><DD><P>
<A HREF="ftp://ftp.simtel.net/pub/simtelnet/gnu/djgpp/v2gnu/">ftp://ftp.simtel.net/pub/simtelnet/gnu/djgpp/v2gnu/</A>
o en el mismo lugar en cualquier r&eacute;pilca del archivo <EM>simtel</EM>.</P>
<DT><B>win32</B><DD><P>
<A HREF="http://www.weihenstephan.de/~syring/win32/UnxUtils.html">http://www.weihenstephan.de/~syring/win32/UnxUtils.html</A></P>
<DT><B>unix</B><DD><P>En caso de no tener directamente binarios precompilados, suele ser
sencillo compilar el programa a partir de las fuentes para
cada sistema unix concreto.</P>
</DL>
</P>

</LI>
<LI>Para evitar problemas con el correo, siempre se puede convertir el documento a
formato LaTeX <B>antes</B> de mandarlo por correo.  Despu&eacute;s de
todo, la mayor&iacute;a de lo que se escribe es para uno mismo, no para
mandarlo por correo. Ejemplo: Si alguien tiene un Mac, para enviar
algo por correo debe en primer lugar hacer una copia del documento
(pues GNU <EM>recode</EM> machaca el original). Con la copia se puede
hacer:
<BLOCKQUOTE><CODE>
<PRE>
recode -d applemac:latex archivo.tex
</PRE>
</CODE></BLOCKQUOTE>

y ya podemos enviar el <CODE>archivo.tex</CODE> resultante por correo.

Supongamos que el receptor trabaja con Unix, tendr&iacute;a que escribir:
<BLOCKQUOTE><CODE>
<PRE>
recode -d latex:latin1 archivo.tex
</PRE>
</CODE></BLOCKQUOTE>

y cambiar el <CODE>inputenc</CODE>, en su caso.
<P>En cualquier caso, si es posible, es mucho mejor enviar el archivo directamente
con acentos utilizando el est&aacute;ndar MIME con
<EM>quoted-printable</EM>, de esta forma llega el archivo con los
acentos intactos a&uacute;n usando los canales habituales de 7
bits. Naturalmente debemos ponernos de acuerdo con el receptor
del mensaje para que &eacute;l tambi&eacute;n tenga un programa que acepte
MIME, pero dado que es un est&aacute;ndar, todo el mundo deber&iacute;a acabar
teni&eacute;ndolo.</P>
</LI>
</OL>

<EM>Nota al margen</EM>: <CODE>recode 3.4</CODE> no transforma correctamente de <CODE>850</CODE> a
<CODE>iso</CODE>, porque no convierte bien los retornos de carro. A partir de
la versi&oacute;n <CODE>3.4.1</CODE> se supone que lo hace correctamente. Si la
versi&oacute;n de <CODE>recode</CODE> que tenemos es la problem&aacute;tica, se puede usar
la opci&oacute;n <CODE>-a</CODE> de <CODE>unzip</CODE> para corregir los retornos de
carro. Si nuestro documento no tiene may&uacute;sculas acentuadas, se puede
usar la opci&oacute;n <CODE>ibmpc:l1</CODE> (<CODE>ibmpc</CODE> es sin&oacute;nimo de <CODE>437</CODE>).</P>

<H2><A NAME="literales"></A> <A NAME="ss6.4">6.4</A> <A HREF="FAQ-CervanTeX.html#toc6.4">¿C&oacute;mo cambiar los literales que produce LaTeX?</A>
</H2>

<P>Cuando Lamport hizo el LaTeX original, proporcion&oacute; una serie de estilos
est&aacute;ndar como ejemplo de uso. Estos estilos se hicieron muy populares,
principalmente porque todas las instalaciones de LaTeX los
tienen. Sin embargo, estos estilos utilizan unos convenios muy
particulares y es f&aacute;cil que un usuario desee cambiarlos. Algo
especialmente molesto para el uso en castellano de los estilos
est&aacute;ndar, es que generan determinados t&iacute;tulos (p.ej. <EM>Contents</EM>,
<EM>Bibliography</EM>, etc.) en ingl&eacute;s, lo que hace inaceptable su uso. </P>
<P>Aunque era posible crear versiones modificadas para otros idiomas, se extendi&oacute;
la idea de internacionalizar dichos estilos. Por ejemplo, donde pon&iacute;a
la palabra <CODE>Contents</CODE> se ha cambiado por <CODE>\contentsname</CODE> y
se define aparte el valor de esta macro. </P>
<P>Esta es la forma en que funciona LaTeX2e actualmente. De esta manera, es
posible continuar usando los mismos estilos est&aacute;ndar en diferentes idiomas,
simplemente redefiniendo el valor de estas macros en el documento o en un
estilo aparte, por ejemplo con
<BLOCKQUOTE><CODE>
<PRE>
\renewcommand{\contentsname}{Tabla de materias}
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Un paquete de estilos que hace esto es babel -- V&eacute;ase 
<A HREF="FAQ-CervanTeX-7.html#que-es-babel">¿Qu&eacute; es babel?</A>. Cuando se quieren hacer
estos cambios en un documento que utiliza <EM>babel</EM> con
<EM>spanish.sty</EM> hay que proceder de una forma un poco distinta. V&eacute;ase
<A HREF="#sectnames">Modificando los literales de spanish.sty</A> </P>

<H2><A NAME="ss6.5">6.5</A> <A HREF="FAQ-CervanTeX.html#toc6.5">¿C&oacute;mo hacer que LaTeX parta correctamente las palabras en castellano?</A>
</H2>

<H3><A NAME="patrones-guionado"></A> ¿Qu&eacute; configuraciones (o patterns) existen para la partici&oacute;n de                  palabras?</H3>

<P>Lo primero que hay que decir es que la partici&oacute;n en castellano es algo mucho m&aacute;s
complejo de lo que pudiera parecer a simple vista. Aunque el espa&ntilde;ol
es un lenguaje muy regular, tiene ciertas anomal&iacute;as que convierten
este tema en un campo minado. Hay dos conclusiones b&aacute;sicas: 1) No es
posible encontrar el 100% de los cortes legales y 2) no es
deseable. Para empezar, la Academia permite partir tanto por
componentes (sub-ur-ba-no) como sil&aacute;bicamente (su-bur-ba-no). Adem&aacute;s
el concepto de s&iacute;laba es en algunos casos confuso y la etimolog&iacute;a
tampoco ayuda (Ej: su-bli-me, a pesar de derivar de sub-limis,
contra sub-li-mi-nal). Sin mencionar que los conceptos de diptongo e
hiato distan mucho de estar claros. Este &uacute;ltimo caso viene a carecer
de importancia, pues libros de estilo consultados prescriben ignorar
los hiatos al partir palabras.  El siguiente comentario de Fernando
M. Fournon Gonz&aacute;lez-Barcia  es interesante para ilustrar los
problemas:
<BLOCKQUOTE>
"La RAL dice que es POTESTATIVO lo de la separaci&oacute;n por prefijos. Al menos en el
esbozo, que si somos puristas y nos atenemos a la &uacute;nica gram&aacute;tica
v&aacute;lida, la del 31, casi ni eso."
</BLOCKQUOTE>

<BLOCKQUOTE>
"Creo que, est&eacute;ticamente, lo mejor es no partir nunca, salvo cuando la cosa vaya
a quedar muy fea (esta recomendaci&oacute;n tambi&eacute;n la hace la RAL), como
hace el LaTeX, y entonces partir lo m&aacute;s conservadoramente
posible. Si para los poqu&iacute;simos casos en que un p&aacute;rrafo se pone
pesado y en vez de partir subur-bano hay que hacer sub-urbano,
pues ..., que se haga a mano, ¿no?."
</BLOCKQUOTE>

<BLOCKQUOTE>
"Otra cosa es que al partir surjan vocablos malsonantes. Esto S&Iacute; que deber&iacute;a de
comprobarlo cualquier separador de palabras, pues normalmente es
muy dif&iacute;cil detectarlos a simple vista (si es que hay tiempo para
releer nuestros propios art&iacute;culos). O sea, que antes que una lista
de prefijos, sugerir&iacute;a la creaci&oacute;n de una lista de <EM>tacos</EM> y
cacofon&iacute;as varias. :-)"
</BLOCKQUOTE>

Es decir, lo mejor es evitar cualquier caso conflictivo en los patrones
(<EM>patterns</EM>) de uso general. Localmente puede hacerse los que se
quiera, usando excepciones o introduci&eacute;ndolos a mano, por ejemplo.</P>
<P>Al d&iacute;a de hoy existen 4 tablas diferentes de partici&oacute;n:
<UL>
<LI>Los producidos en 1986 por Armando Jinich, Mar&iacute;a Garza y Max D&iacute;az de Aurion
Tecnolog&iacute;a, M&eacute;xico. Est&aacute;n en el dominio p&uacute;blico desde
1990. Pueden encontrarse en:
<BLOCKQUOTE>
<A HREF="ftp://ftp.dante.de/tex-archive/language/spanish/old/silaba.tex">ftp://ftp.dante.de/tex-archive/language/spanish/old/silaba.tex</A></BLOCKQUOTE>

Estos patrones han sido producidos a partir de las reglas de la
gram&aacute;tica. Actualmente no soportan expl&iacute;citamente acentos. Max
D&iacute;az es actualmente <CODE>max@east.aurora.com</CODE> </LI>
<LI>Los producidos por Manuel V&aacute;zquez de la Universidad de Zaragoza, que puede ser
localizado en <CODE>(vazquez@cc.unizar.es)</CODE>. Estos patrones est&aacute;n
basados en la gram&aacute;tica.</LI>
<LI>Los que distribuye Arbortext producidos por Sistemas Gr&aacute;ficos y Audiovisuales de
Chihuahua. M&eacute;xico. Estos est&aacute;n generados a partir de un
diccionario. Soportan acentos.</LI>
<LI>Los producidos por Julio S&aacute;nchez, que pueden obtenerse en:
<BLOCKQUOTE><CODE>
<PRE>
CTAN/language/spanish/hyphen
</PRE>
</CODE></BLOCKQUOTE>

Estos soportan una variedad de opciones, incluido el soporte de acentos, tanto
como ligaduras como con el c&oacute;digo <CODE>IS 8859/1</CODE> (<CODE>ISO
Latin1</CODE>) para ML-TeX o TeX 3.X. Adem&aacute;s, <EM>son los
actualmente recomendados por CervanTeX</EM>.</LI>
</UL>
</P>

<H3>¿C&oacute;mo activo el patr&oacute;n de partici&oacute;n de palabras para el castellano?</H3>

<P>Para activar el patr&oacute;n de partici&oacute;n para el castellano es necesario tener babel
-- V&eacute;ase 
<A HREF="FAQ-CervanTeX-7.html#que-es-babel">¿Qu&eacute; es babel?</A> --  instalado
y generar el formato cargando el patr&oacute;n de separaci&oacute;n en s&iacute;labas en
castellano. Esto podemos hacerlo de la siguiente manera </P>
<P>
<DL>
<DT><B>Para TeX y LaTeX: Cambiando el archivo <CODE>language.dat</CODE></B><DD><P>
<UL>
<LI>Editar el archivo <CODE>language.dat</CODE>. Dependiendo de la distribuci&oacute;n de TeX
utilizada este archivo puede estar en distintos lugares. Por
ejemplo en teTeX el &aacute;rbol de TeX parte de
<CODE>TEXMF=/usr/share/texmf</CODE> y el archivo en cuesti&oacute;n
est&aacute; en <CODE>TEXMF/tex/generic/config/language.dat</CODE>. En
al caso de <EM>Debian/GNU-Linux</EM>, est&aacute; en
<CODE>/etc/texmf/language.dat</CODE> y el otro es un enlace a
&eacute;ste. </LI>
<LI>Borrar el <CODE>%</CODE> que est&aacute; al principio de la linea <CODE>spanish</CODE>. Si mal no
recuerdo viene preparado con silabeo en alem&aacute;n, si no lo
quieren pongan un <CODE>%</CODE> adelante. Tambi&eacute;n viene predefinido
ingl&eacute;s (o alguna de sus variantes, por ejemplo
american). &Eacute;ste debe estar siempre definido as&iacute; que no debe
desactivarse. </LI>
<LI>En caso de tener el MikTeX, la operaci&oacute;n es la misma, pero el archivo
<CODE>language.dat</CODE> est&aacute; en
<CODE>TEXMF/tex/generic/hyphen/local</CODE> </LI>
<LI>teTeX tiene la utilidad <EM>texconfig</EM> que invocada como
<BLOCKQUOTE><CODE>
<PRE>
# texconfig hyphen latex
</PRE>
</CODE></BLOCKQUOTE>

lanza un editor para cambiar el fichero <CODE>language.dat</CODE> y que, al cerrar el
editor, genera los formatos autom&aacute;ticamente, por lo que no es necesario hacer
el paso siguiente expl&iacute;citamente. </LI>
</UL>
</P>

<DT><B>Para LaTeX.</B><DD><P>Una vez hecho lo anterior no es necesario m&aacute;s que rehacer los formatos -- V&eacute;ase
<A HREF="FAQ-CervanTeX-8.html#formatos">¿C&oacute;mo rehacer los formatos?</A>
--. Entonces cuando se llame a <EM>babel</EM> con la opci&oacute;n
<CODE>spanish</CODE>, &eacute;ste se encargar&aacute; de utilizar los patrones de
guionado en castellano.</P>

<DT><B>Para <CODE>plain</CODE>-TeX</B><DD><P>Por omisi&oacute;n, cuando el <CODE>initex</CODE> crea el formato, carga el archivo
<CODE>hyphen.tex</CODE> que contiene las reglas de silabeo en
ingl&eacute;s. Para activarlo tambi&eacute;n en <EM>plain-TeX</EM> se debe
copiar el archivo <CODE>hyphen.cfg</CODE> como <CODE>hyphen.tex</CODE> en alg&uacute;n
sitio que en el camino de b&uacute;squeda de TeX est&eacute; antes del
<CODE>hyphen.tex</CODE> que viene como parte de <CODE>plain-TeX</CODE> y
asegurarse que existe el archivo <CODE>ushyph1.tex</CODE> (que realmente
es el mismo que el <CODE>hyphen.tex</CODE> original, pero con otro
nombre). Este paso no es necesario si s&oacute;lo se quiere la
partici&oacute;n de palabras para LaTeX y se va a utilizar
<EM>babel</EM>, pero tampoco sobra.</P>
<P>Para los usuarios de <EM>teTeX</EM> los archivos est&aacute;n en
<CODE>TEXMF/tex/config/babel/hyphen.cfg</CODE> y el <CODE>hyphen.tex</CODE>
original en <CODE>TEXMF/tex/generic/hyphen/hyphen.tex</CODE></P>
<P> 
Para los usuarios de MikTeX, los archivos est&aacute;n en
<CODE>TEXMF/generic/hyphen/hyphen.cfg</CODE> y
<CODE>TEXMF/generic/hyphen/hyphen.tex</CODE> </P>
<P>En caso de no conseguirse hacer lo anterior tambi&eacute;n puede sustituirse el archivo
<CODE>hyphen.tex</CODE> por el <CODE>hyphen.cfg</CODE>, pero debe tenerse
cuidado al actualizar la distribuci&oacute;n de no sobreescribir el
<CODE>hyphen.tex</CODE> con al que venga con la distribuci&oacute;n nueva.</P>
<P>Entonces es necesario reconstruir el formato como se indica en 
<A HREF="FAQ-CervanTeX-8.html#formatos">¿C&oacute;mo rehacer los formatos?</A>.</P>
<P>Cuando se quiere usar el silabeo en castellano, hay que agregar en el archivo
<CODE>.tex</CODE>, al principio, una linea que diga <CODE>\language1</CODE> si
el castellano es el segundo lenguaje (no sin&oacute;nimo) del
<CODE>language.dat</CODE> (<CODE>\language0</CODE> corresponder&iacute;a al ingl&eacute;s
americano)</P>
</DL>
</P>

<H3>A pesar de que he activado los patrones de partici&oacute;n de palabras del            castellano, hay una palabra que se me resiste</H3>

<P>Aunque los patrones de partici&oacute;n de palabras intentan abarcar el mayor n&uacute;mero de
casos posible, siempre puede quedar alguna palabra
recalcitrante. Tambi&eacute;n puede ocurrir que la partici&oacute;n sea correcta,
pero no deseable a los ojos del autor del documento. En este caso
hay dos posibilidades:
<UL>
<LI>Si la palabra es poco frecuente y s&oacute;lo falla en muy pocas ocasiones. En este
caso es preferible decirle directamente a la palabra en el lugar
donde aparece, d&oacute;nde se le permite partirse, mediante
<CODE>\-</CODE>. Por ejemplo:
<BLOCKQUOTE><CODE>
<PRE>
fotorrefractivo y electro&oacute;ptico   --> foto\-rre\-frac\-tivo y elec\-tro\-&oacute;ptico
</PRE>
</CODE></BLOCKQUOTE>
</LI>
<LI>Si es una palabra frecuente que es una potencial causa de problemas en el
documento. En este caso es preferible definir en el pre&aacute;mbulo
del documento c&oacute;mo se permite la partici&oacute;n de esta palabra de
forma global para todo el documento, mediante
<CODE>\hyphenation</CODE>. Por ejemplo:
<BLOCKQUOTE><CODE>
<PRE>
\hyphenation{foto-rre-frac-tivo,elec-tro-&oacute;ptico}
</PRE>
</CODE></BLOCKQUOTE>
</LI>
</UL>
</P>

<H3>Mi TeX no parte las palabras que tienen acentos. ¿Por qu&eacute;?</H3>

<P>El primitivo <CODE>\accent</CODE> detiene la partici&oacute;n. Es posible ayudar a TeX
invocando la siguiente macro despu&eacute;s de un acento:
<BLOCKQUOTE><CODE>
<PRE>
\def\allowhyphens{\penalty10000 \hskip0pt}
</PRE>
</CODE></BLOCKQUOTE>

<CODE>spanish.sty</CODE> lo hace autom&aacute;ticamente en caso necesario. En cualquier caso,
lo mejor es usar fuentes con las letras acentuadas como por ejemplo
las descritas en 
<A HREF="FAQ-CervanTeX-4.html#EC/DC">DC/EC</A>, o ML-TeX, y
patrones de partici&oacute;n que contemplen esto.</P>

<H2><A NAME="ss6.6">6.6</A> <A HREF="FAQ-CervanTeX.html#toc6.6">Acerca de <CODE>spanish.sty</CODE></A>
</H2>

<P>Los archivos para escribir en castellano con <EM>babel</EM> (<CODE>spanish.*</CODE>) los
cre&oacute; y mantuvo durante mucho tiempo Julio S&aacute;nchez. Ahora esos archivos
los mantiene Javier Bezos. A&uacute;n no est&aacute;n en su lugar correcto en la
estructura de <EM>babel</EM>, aunque se encuentran en un subdirectorio y
reciben el nombre de <CODE>spanishb.*</CODE>. En la pr&oacute;xima versi&oacute;n de
<EM>babel</EM> ser&aacute;n ya oficiales.</P>

<H3>¿Por qu&eacute; <CODE>spanish.sty</CODE> pone los meses en min&uacute;scula?</H3>

<P>Ese es el uso aceptado en la actualidad. Documentos de la propia RAL lo hacen
as&iacute;. El Mar&iacute;a Moliner tambi&eacute;n.  V&eacute;ase la siguiente cita del Mar&iacute;a
Moliner, 1990,
<BLOCKQUOTE>
"7. Aunque entre los preceptos de la G.R.A. figura el de escribir con may&uacute;scula
los nombres de los meses, de los d&iacute;as de la semana y de las
estaciones, [...] ha dejado decididamente de usarse la letra
may&uacute;scula en uno y otro de estos casos"
</BLOCKQUOTE>
</P>

<H3>¿Por qu&eacute; el spanish de babel reemplaza el punto decimal por una coma?</H3>

<P>Por tres razones: 1) porque las normas internacionales establecen que ha de
usarse coma para los decimales, excepto en aquellos pa&iacute;ses cuya
tradici&oacute;n hace preferible el punto (la propia ISO usa coma en
sus informes); 2) porque el punto decimal en Espa&ntilde;a carece de
fuerza legal y s&oacute;lo la coma es oficialmente v&aacute;lida, y 3) porque
la coma es el &uacute;nico signo usado en la vida
diaria. Probablemente, la situaci&oacute;n es similar en otros pa&iacute;ses,
salvo M&eacute;xico.  </P>
<P>Se puede cambiar el comportamiento predefinido con la orden
<CODE>\decimalpoint</CODE> o <CODE>\spanishdecimal{.}</CODE>. En unas
pocas materias, como el an&aacute;lisis n&uacute;merico o la estad&iacute;stica, es
necesario distinguir la coma decimal de la coma para separar
datos; en este caso se puede aumentar el espaciado de estas
&uacute;ltimas con:
<BLOCKQUOTE><CODE>
<PRE>
\makeatletter
\def\es@decimal{{\mathchar"613B}}
\mathcode`,="8000
\begingroup
\catcode`,=13
\gdef,{\mkern2mu\mathchar"613B\mkern8mu}
\endgroup
\makeatother
</PRE>
</CODE></BLOCKQUOTE>

(Se pueden probar otros valores en lugar de 2 [antes] y 8 [despu&eacute;s]. La unidad mu de TeX es para matem&aacute;ticas [aprox. 1/18 em].)</P>

<H3>¿Por qu&eacute; <CODE>spanish.sty</CODE> acent&uacute;a la I de &Iacute;ndice?</H3>

<P>As&iacute; lo han sostenido los tratadistas m&aacute;s importantes sobre ortograf&iacute;a y
tipograf&iacute;a desde hace m&aacute;s de un siglo: &lt;&lt; La may&uacute;sculas deben
llevar la tilde que les corresponda &gt;&gt; (Sanmart&iacute;, 1907). La RAE
finalmente lo ha considerado normativo en su ortograf&iacute;a de 1999:
&lt;&lt;El empleo de las may&uacute;sculas no exime de poner tilde cuando
as&iacute; lo exijan las reglas de acentuaci&oacute;n &gt;&gt; (p. 31).</P>

<H3>¿D&oacute;nde se puede obtener la documentaci&oacute;n de spanish en castellano? </H3>

<P>La documentaci&oacute;n de <EM>spanish</EM> que se incluye al componer <CODE>user.drv</CODE> est&aacute;
en ingl&eacute;s, pero el archivo <CODE>spanish.dtx</CODE> tambi&eacute;n la incluye
en castellano. Basta con componer este archivo y obtendremos
un detallado manual como <CODE>spanish.dvi</CODE>.</P>

<H3><A NAME="sectnames"></A> ¿C&oacute;mo cambio los nombres de las secciones de bibliograf&iacute;a, &iacute;ndice,            etc... que pone <CODE>spanish.sty</CODE>? </H3>

<P>Si no importa que este cambio no siga las caracter&iacute;sticas de <EM>babel</EM> y
<EM>spanish</EM> de cambio de idioma sobre la marcha, etc.., se puede
hacer de la misma forma que en la secci&oacute;n 
<A HREF="#literales">¿C&oacute;mo cambiar los literales que  produce LaTeX?</A>
poniendo las definiciones despu&eacute;s de llamar a babel. El problema de
este m&eacute;todo es que no est&aacute; bien integrado con  <EM>babel</EM> y por ese
lado puede dar problemas, ya <EM>babel</EM> activa algunos cambios al
llegarse al <CODE>\begin{document}</CODE>.</P>
<P>Si embargo existe una forma m&aacute;s elegante e integrada con <EM>spanish</EM> y
<EM>babel</EM>. En el pre&aacute;mbulo del documento hay que a&ntilde;adir lo
siguiente, por ejemplo, para cambiar Bibliograf&iacute;a por Referencias
<BLOCKQUOTE><CODE>
<PRE>
\addto\captionsspanish{%
\def\bibname{Referencias}%
}
</PRE>
</CODE></BLOCKQUOTE>

Y as&iacute; con todos los nombres necesarios.  La lista de nombres est&aacute; en los dos
lugares siguientes
<BLOCKQUOTE><CODE>
<PRE>
TEXMF/tex/generic/babel/spanish.ldf 
TEXMF/tex/generic/babel/spanish.tex
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>¿C&oacute;mo consigo que <EM>babel</EM> y <CODE>spanish.sty</CODE> no utilicen los atajos de                      teclado NUNCA?</H3>

<P>Este ha sido un problema muy frecuente con babel y spanish, que
ha dado como consecuencia que, por ejemplo, en las bibliograf&iacute;as
nombres como "J.&nbsp;N. Apellido" aparecieran como "J.&Ntilde;.  Apellido".  Para
solucionar este problema, spanish ofrece ahora la orden
<CODE>\deactivatetilden</CODE> que elimina el uso de <CODE>~</CODE> para la e&ntilde;e, al tiempo
que preserva su funci&oacute;n de espacio sin divisi&oacute;n (la orden <CODE>\shorthandoff</CODE>
de babel cancela ambos usos). El estilo <EM>spanish</EM> tambi&eacute;n proporciona
m&aacute;s facilidades para desactivar otras abreviaciones, que est&aacute;n
descritas en <CODE>spanish.dtx</CODE>, por ejemplo <CODE>\deactivatequoting</CODE> en el pre&aacute;mbulo. </P>
<P>Sin embargo &eacute;sto y el que funcione correctamente ha cambiado mucho entre
distintas versiones de <EM>babel</EM> lo que hace que a veces los
documentos creados con una versi&oacute;n de babel no sean directamente
portables a otros sistemas. Aunque es recomendable actualizarse a la
&uacute;ltima versi&oacute;n de <EM>spanish</EM> y <EM>babel</EM> en todos los ordenadores
implicados, en caso de no poderse hacer, la siguiente l&iacute;nea (en
LaTeX2e) en el pre&aacute;mbulo del documento elimina los atajos de
teclado 
<BLOCKQUOTE><CODE>
<PRE>
\AtBeginDocument{\gdef~{\nobreakspace{}}\catcode`\"=12}
</PRE>
</CODE></BLOCKQUOTE>

&uacute;til para documentos que se utilizar&aacute;n en distintos ordenadores, alguno de ellos
con versiones antiguas de babel o spanish.</P>

<H2><A NAME="ss6.7">6.7</A> <A HREF="FAQ-CervanTeX.html#toc6.7">¿C&oacute;mo puedo indicar la abreviatura de los ordinales?</A>
</H2>

<P>En LaTeX2e pueden utilizarse la &oacute;rdenes <CODE>\textordfeminine</CODE> y
<CODE>\textordmasculine</CODE>; por ejemplo, para abreviar Mar&iacute;a,
escribimos <CODE>M.\textordfeminine</CODE>. Una variaci&oacute;n de estas
macros ha sido incorporada a <CODE>spanish.sty</CODE> versi&oacute;n 3.0 y
extendida en la versi&oacute;n 4.0.  Se invocan como "a y "o,
respectivamente, con la posibilidad de usar <CODE>\sptext</CODE>
para casos como <CODE>1\sptext{er}</CODE>. </P>

<H2><A NAME="ss6.8">6.8</A> <A HREF="FAQ-CervanTeX.html#toc6.8">¿C&oacute;mo forzar sangr&iacute;a despu&eacute;s de las cabeceras?</A>
</H2>

<P>El objetivo de esa sangr&iacute;a (<EM>indentation</EM> para los que no est&eacute;n al tanto) es
marcar claramente la separaci&oacute;n de los p&aacute;rrafos. Como tal, es
superflua despu&eacute;s de una cabecera. Hay otros sitios en los que, no
s&oacute;lo es superflua, sino que es confusa, como despu&eacute;s de un texto que
ya va sangrado (entorno quote, <CODE>\[</CODE> <CODE>\]</CODE>, un array,
etc.) Sin embargo, es esencialmente una cuesti&oacute;n de gusto.</P>
<P>Modificarlo en un estilo es bastante f&aacute;cil. La mayor&iacute;a de las secciones, etc. en
LaTeX son algo as&iacute; como (en <CODE>art10.sty</CODE>):
<BLOCKQUOTE><CODE>
<PRE>
\def\section{\@startsection {section}{1}{\z@}{-3.5ex plus
-1ex minus -.2ex}{2.3ex plus .2ex}{\Large\bf}}
\def\subsection{\@startsection{subsection}{2}{\z@}{-3.25ex plus
 -2ex minus -.2ex}{1.5ex plus .2ex}{\large\bf}}
</PRE>
</CODE></BLOCKQUOTE>

El cuarto par&aacute;metro, si es negativo, indica que no se debe sangrar en el primer
p&aacute;rrafo tras la cabecera. C&aacute;mbiese a positivo.</P>
<P>Hay otro procedimiento para estilos que ya est&aacute;n escritos y consiste en decir:
<BLOCKQUOTE><CODE>
<PRE>
\let\@afterindentfalse\@afterindenttrue
\@afterindenttrue
</PRE>
</CODE></BLOCKQUOTE>

Esta soluci&oacute;n es la proporcionada en <CODE>indentfirst.sty</CODE> por David Carlisle </P>

<H2><A NAME="ss6.9">6.9</A> <A HREF="FAQ-CervanTeX.html#toc6.9">¿C&oacute;mo puedo escribir las funciones matem&aacute;ticas en espa&ntilde;ol?</A>
</H2>

<P>Comentario: Hay gente que discute el que las funciones vayan en espa&ntilde;ol y lleve
acento el l&iacute;m, m&aacute;x, etc. Argumentan que los nombres vienen del lat&iacute;n y
all&iacute; no hab&iacute;a acentos (y que en ingl&eacute;s tambi&eacute;n vienen del lat&iacute;n, lo
cual, por ejemplo, es claramente incierto con gcd). El caso es que en
todos los libros tradicionales en castellano se escrib&iacute;a l&iacute;m y m&aacute;x con
acento. Si &uacute;ltimamente no se hace es precisamente porque TeX (en
ingl&eacute;s) no lo tiene as&iacute;. Todav&iacute;a estamos a tiempo de no cometer ese
error:</P>
<P>El caso m&aacute;s com&uacute;n es el del seno que, en plain TeX, basta definirlo como
<BLOCKQUOTE><CODE>
<PRE>
\def\sen{\mathop{\rm sen}\nolimits} % Sustituye a \sin
</PRE>
</CODE></BLOCKQUOTE>

An&aacute;logamente,
<BLOCKQUOTE><CODE>
<PRE>
\def\mcd{\mathop{\rm mcd}\nolimits} % Sustituye a \gcd

\def\senh{\mathop{\rm senh}\nolimits} % Sustituye a \sinh

\def\arcsen{\mathop{\rm arcsen}\nolimits} % Ni el arcsin ni el
% arccos originales dejan espacio entre arc y sin o cos.
</PRE>
</CODE></BLOCKQUOTE>

Cuando la funci&oacute;n en espa&ntilde;ol tiene alg&uacute;n acento (sobre todo en la i), es m&aacute;s complicado:
<BLOCKQUOTE><CODE>
<PRE>
\def\max{\mathop{\rm m\acute ax}}

\def\min{\mathop{\rm m\acute\mathchar"7010n}}

\def\inf{\mathop{\rm \acute\mathchar"7010nf}}

\def\lim{\mathop{\rm l\acute\mathchar"7010m}}

\def\limsup{\mathop{\rm l\acute\mathchar"7010m\, sup}} % El limsup
% y el liminf originales dejan espacio entre lim y sup o inf.

\def\liminf{\mathop{\rm l\acute\mathchar"7010m\, inf}} 
</PRE>
</CODE></BLOCKQUOTE>

Por &uacute;ltimo, adapt&aacute;ndolas de su definici&oacute;n original (ver p&aacute;g. 361 del TeXbook)
para poner el acento en las dos posibilidades de uso de <CODE>mod</CODE>
hacemos:
<BLOCKQUOTE><CODE>
<PRE>
\def\bmod{\mskip-\medmuskip \mkern5mu
  \mathbin{\rm m\acute od} \penalty900 \mkern5mu
  \mskip-\medmuskip}
\def\pmod#1{\allowbreak \mkern18mu ({\rm m\acute od}\,\,#1)}
</PRE>
</CODE></BLOCKQUOTE>

En LaTeX se puede hacer de forma similar pero usando <CODE>\newcommand</CODE> o
<CODE>\renewcommand</CODE> en lugar de <CODE>\def</CODE>.</P>

<H2><A NAME="ss6.10">6.10</A> <A HREF="FAQ-CervanTeX.html#toc6.10">¿Qu&eacute; verificadores ortogr&aacute;ficos puedo utilizar para espa&ntilde;ol?</A>
</H2>

<P>
<DL>
<DT><B>ispell</B><DD><P><EM>ispell</EM> es un verificador ortogr&aacute;fico de uso libre que
funciona en UNIX, aunque hay un port para <EM>emx</EM> en fase beta --que
funciona o debe funcionar tanto en DOS (con 386 o superior) como en
OS/2 2.x o en OS/2 Warp--.</P>
<P>Para <EM>ispell</EM> existe lo siguiente:</P>
<P>
<UL>
<LI> Ficheros de afijos para espa&ntilde;ol:
<BLOCKQUOTE><CODE>
<PRE>
URL:         ftp://ftp.dante.de/tex-archive/language/spanish/ispell
ARCHIVO:     castellano.aff.gz
COMENTARIOS: diccionario y parche elisp disponible en el mismo lugar.
V&eacute;anse los archivos LEEME o README.
                          
URLs:        ftp://ftp.fi.upm.es/pub/unix
             http://www.datsi.fi.upm.es/~coes
ARCHIVOS:    espa~nol.tar.gz
COMENTARIOS: incluye espa~nol.aff, lista de palabras, instrucciones, y
             patrones de guionado para TeX en espa&ntilde;ol.
                        
</PRE>
</CODE></BLOCKQUOTE>
</LI>
<LI>Diccionarios compatibles con ispell:
<BLOCKQUOTE><CODE>
<PRE>
URL:          ftp://ftp.dante.de/tex-archive/language/spanish/ispell
ARCHIVOS:     palabras.sq.gz
COMENTARIOS:  archivo de afijos y parche elisp disponible en el mismo lugar.
  V&eacute;anse los archivos LEEME o README.

URLs:        ftp://ftp.fi.upm.es/pub/unix
             http://www.datsi.fi.upm.es/~coes
ARCHIVOS:    espa~nol.tar.gz
COMENTARIOS: incluye espa~nol.aff, lista de palabras, instrucciones, y
             patrones de guionado para TeX en espa&ntilde;ol.
                        
</PRE>
</CODE></BLOCKQUOTE>
</LI>
</UL>
</P>
<P>El que hay en <CODE>ftp.dante.de</CODE> es de
<BLOCKQUOTE><CODE>
Julio S&aacute;nchez 
</CODE></BLOCKQUOTE>

El que hay en 
<A HREF="ftp://ftp.fi.upm.es">ftp.fi.upm.es</A> es de
<BLOCKQUOTE><CODE>
<PRE>
Santiago Rodr&iacute;guez  (srodri@fi.upm.es)
Jes&uacute;s Carretero  (jesus@fi.upm.es)
                
</PRE>
</CODE></BLOCKQUOTE>
</P>
<DT><B>Excalibur</B><DD><P>Para Macintosh, existe un verificador ortogr&aacute;fico de documentos
LaTeX (y plain TeX) llamado Excalibur.  Es gratis, aunque el
copyright es del autor, Rick Zaccone <CODE>(zaccone@bucknell.edu)</CODE>.</P>
<P>Excalibur puede conseguirse por ftp an&oacute;nimo en:
<BLOCKQUOTE>
<A HREF="ftp://sol.eg.bucknell.edu/pub/mac">ftp://sol.eg.bucknell.edu/pub/mac</A></BLOCKQUOTE>
</P>
<P>Juan Luis Varona <CODE>(jvarona@dmc.unirioja.es)</CODE> ha creado un diccionario con
292342 palabras (versi&oacute;n de septiembre de 1999) que funciona con
Excalibur. Est&aacute; realizado en formato de 7 bits, y la <CODE>&iacute;</CODE> la
reconoce &uacute;nicamente como <CODE>\'{\i}</CODE>. Pero puede modificarse si se
desea. La versi&oacute;n m&aacute;s reciente puede encontrarse en
<BLOCKQUOTE>
<A HREF="ftp://tex.unirioja.es/pub/tex/dict-mac">ftp://tex.unirioja.es/pub/tex/dict-mac</A></BLOCKQUOTE>

Asimismo, en la direcci&oacute;n mencionada para <EM>Excalibur</EM>, en el directorio
<CODE>Excalibur-dictionaries</CODE>, se encuentran disponibles los
diccionarios de los distintos idiomas.  El diccionario espa&ntilde;ol puede
encontrarse tambi&eacute;n en <CODE>CTAN</CODE> en
<BLOCKQUOTE><CODE>
<PRE>
CTAN://systems/mac/support/excalibur/Spanish_Dictionary.sit.hqx
</PRE>
</CODE></BLOCKQUOTE>
</P>
<DT><B>4spell</B><DD><P><EM>4spell</EM> es un verificador ortogr&aacute;fico para Windows (32 bits)
que se distribuye bajo una licencia libre (concretamente la GPL) y
tiene un diccionario de castellano. Puede encontrarse en 
<BLOCKQUOTE><CODE>
<PRE>
CTAN://support/4spell
</PRE>
</CODE></BLOCKQUOTE>
</P>
<DT><B>Winedt</B><DD><P>El diccionario de Juan Luis Varona tambi&eacute;n se ha adaptado para su uso con el
verificador ortogr&aacute;fico del entorno winedt para Windows. Est&aacute;
disponible en 
<BLOCKQUOTE>
<A HREF="ftp://tex.unirioja.es/pub/tex/dict-win">ftp://tex.unirioja.es/pub/tex/dict-win</A></BLOCKQUOTE>
</P>
<DT><B>amspell</B><DD><P><EM>amspell</EM> es un verificador ortogr&aacute;fico para DOS. El diccionario de
Juan Luis Varona tambi&eacute;n se ha adaptado para ser utilizado con
<EM>amspell</EM>. La versi&oacute;n para <EM>amspell</EM> est&aacute; disponible en
<BLOCKQUOTE>
<A HREF="ftp://tex.unirioja.es/pub/tex/dict-pc">ftp://tex.unirioja.es/pub/tex/dict-pc</A></BLOCKQUOTE>

y <EM>amspell</EM> en
<BLOCKQUOTE><CODE>
<PRE>
CTAN://support/amspell
</PRE>
</CODE></BLOCKQUOTE>
</P>
</DL>
</P>

<H2><A NAME="ss6.11">6.11</A> <A HREF="FAQ-CervanTeX.html#toc6.11">¿C&oacute;mo utilizo BibTeX en castellano?</A>
</H2>

<P>Para esto hay dos aproximaciones,
<DL>
<DT><B>Utilizar estilos adaptables (los <EM>abstyles</EM>)</B><DD><P>Para que BibTeX funcione en espa&ntilde;ol, Tom&aacute;s Bautista ha modificado con
<EM>babel</EM> una <EM>familia adaptable</EM> de estilos de BibTeX
(tambi&eacute;n llamadas <EM>abstyles</EM>). </P>
<P>Con las <EM>abstyles</EM> se tiene la <EM>ventaja</EM> de utilizar un &uacute;nico estilo, de
forma que el idioma de las referencias &uacute;nicamente depende del
elegido con <EM>babel</EM>. De este modo, si por h o por b, en cierto
momento no se quiere el documento en ingl&eacute;s, sino por ejemplo en
espa&ntilde;ol o en alem&aacute;n, s&oacute;lo habr&iacute;a que cambiar la opci&oacute;n que
corresponde en babel y no tambi&eacute;n el estilo puesto dentro del
<CODE>\bibliographystyle{estilo}</CODE>.</P>
<P>Adem&aacute;s, con las abstyles s&oacute;lo es necesario un  <CODE>aplain.bst</CODE> preparado para
distintos idiomas, seg&uacute;n lo elegido en babel. Est&aacute;n disponibles en
<CODE>CTAN/biblio/bibtex/contrib/abstyles-babel/</CODE>.</P>

<DT><B>Utilizar el paquete <CODE>custom-bib</CODE></B><DD><P>El paquete <EM>custom-bib</EM> (disponible en
<CODE>CTAN/macros/latex/contrib/supported/custom-bib/</CODE>) permite
crear estilos bibliogr&aacute;ficos a medida, con una amplia serie de
opciones y de idiomas. Para utilizarlo, una vez desempaquetado
debe hacerse
<BLOCKQUOTE><CODE>
<PRE>
latex makebst.tex
</PRE>
</CODE></BLOCKQUOTE>

y responder a las (muchas) preguntas que se formulan. Es conveniente leerse
previamente la documentaci&oacute;n para ser consciente de qu&eacute; se est&aacute;
preguntando en cada momento, ya que muchas de las preguntas no son
obvias. El documento de Luis Seidel -- V&eacute;ase la secci&oacute;n 
<A HREF="FAQ-CervanTeX-3.html#es-tutores">Tutoriales en castellano</A> -- es una
ayuda interesante al respecto.</P>
</DL>
</P>

<H2><A NAME="ss6.12">6.12</A> <A HREF="FAQ-CervanTeX.html#toc6.12">¿C&oacute;mo genero un &iacute;ndice alfab&eacute;tico con la ordenaci&oacute;n correcta en castellano?</A>
</H2>

<P>El problema con que uno se encuentra al utilizar <EM>makeindex</EM> es que no ordena
correctamente las palabras con caracteres acentuados, ya que por
ejemplo ordena la <CODE>&aacute;</CODE> como <CODE>\'a</CODE> que es lo que TeX escribe al
archivo de &iacute;ndice y salvo que fuera la m&aacute;s reciente versi&oacute;n de
<EM>makeindex</EM> de 8 bits ni siquiera las reconocer&iacute;a si estuvieran
escritas directamente al archivo de &iacute;ndice como palabras acentuadas. A
pesar de las limitaciones mencionadas para los idiomas que no pueden
describirse mediante la tabla de caracteres de 7 bits, es posible
utilizar <EM>makeindex</EM> en idiomas como el castellano. Para solucionar
este problema hay varias aproximaciones:
<DL>
<DT><B>Decir a <EM>makeindex</EM> c&oacute;mo debe ordenar la palabra acentuada</B><DD><P>Por ejemplo, para los acentos o para la <CODE>&ntilde;</CODE> se introducir&iacute;a la entrada al
&iacute;ndice como
<BLOCKQUOTE><CODE>
<PRE>
\index{optica@&oacute;ptica}
\index{indice@&iacute;ndice}
\index{can^^ffa@ca&ntilde;a}
</PRE>
</CODE></BLOCKQUOTE>

y para una palabra compuesta como por ejemplo en
<BLOCKQUOTE><CODE>
<PRE>
\index{optica electromagnetica@&oacute;ptica electromagn&eacute;tica}
</PRE>
</CODE></BLOCKQUOTE>
</P>

<DT><B>Utilizar el paquete <EM>esindex</EM></B><DD><P><EM>esindex</EM> es un paquete desarrollado por Javier Bezos para facilitar la
escritura de &iacute;ndices correctamente alfabetizados en castellano. Su
&uacute;nica orden es <CODE>\esindex</CODE> que convierte su argumento a una
forma adecuada. Por ejemplo,
<BLOCKQUOTE><CODE>
<PRE>
\esindex{ca'n'on}
</PRE>
</CODE></BLOCKQUOTE>

equivale a 
<BLOCKQUOTE><CODE>
<PRE>
\index{can^^ffon@ca'n'on}
</PRE>
</CODE></BLOCKQUOTE>

Es necesario usar babel y que los acentos est&eacute;n escritos en forma de
abreviaciones (<CODE>'a</CODE>, <CODE>'e</CODE>, etc.). El paquete utiliza ciertas
&oacute;rdenes internas de babel por lo su funcionamiento puede cambiar
con versiones distintas a la 3.6. </P>
<P>Hay que se&ntilde;alar que con este paquete no se crea en el &iacute;ndice una entrada propia
para la palabras que empiezan por e&ntilde;e, sino que tan s&oacute;lo se a&ntilde;aden
al final de la ene. En el rar&iacute;simo caso de que hubiera palabras
que empiezan por e&ntilde;e habr&iacute;a que modificar el archivo <CODE>.ind</CODE> a
mano. Este paquete puede encontrarse en
<BLOCKQUOTE><CODE>
<PRE>
CTAN/macros/latex/contrib/supported/bezos/
</PRE>
</CODE></BLOCKQUOTE>
</P>

<DT><B>Utilizar xindy</B><DD><P><EM>xindy</EM> es un sistema de indexaci&oacute;n desarrollado por Roger Kehr, del
Instituto de Inform&aacute;tica Te&oacute;rica de Darmstadt, que  puede ser
configurado f&aacute;cilmente para adaptarse a las normas ortogr&aacute;ficas de
distintos idiomas, cada uno de ellos con un alfabeto distinto y
con unas reglas de ordenaci&oacute;n tambi&eacute;n distintas. <EM>xindy</EM> puede
definir, para cada car&aacute;cter del alfabeto, d&oacute;nde debe ser &eacute;ste
ordenado (reglas de ordenaci&oacute;n), as&iacute; como a qu&eacute; car&aacute;cter o cadena
es equivalente (reglas de equivalencia). Permite incluso definir
reglas de ordenaci&oacute;n de distinto nivel que pueden ser aplicadas de
forma sucesiva. Este paquete puede encontrarse en
<CODE>/CTAN/indexing/xindy/</CODE> y su p&aacute;gina web est&aacute; en
<BLOCKQUOTE>
<A HREF="http://www.iti.informatik.tu-darmstadt.de/xindy/">http://www.iti.informatik.tu-darmstadt.de/xindy/</A></BLOCKQUOTE>

Existen unos archivos de estilo para utilizar <EM>xindy</EM> en castellano en la
p&aacute;gina anterior y la versi&oacute;n m&aacute;s reciente, incluyendo binarios
para linux se puede encontrar en
<UL>
<LI><B>(libc5)</B>
<A HREF="http://www.aq.upm.es/~agmartin/linux/store/xindy-2.0.1.tgz">http://www.aq.upm.es/~agmartin/linux/store/xindy-2.0.1.tgz</A> </LI>
<LI><B>(glibc2.1)</B>
<A HREF="http://www.aq.upm.es/~agmartin/linux/store/xindyg21-2.1.tgz">http://www.aq.upm.es/~agmartin/linux/store/xindyg21-2.1.tgz</A></LI>
</UL>

Uno de los estilos (<CODE>es-mkidx.xdy</CODE>) ordena seg&uacute;n las reglas modernas del
castellano mientras que el otro (<CODE>es-tridx.xdy</CODE>) ordena seg&uacute;n
las reglas ya obsoletas, con ch y ll. Su uso es algo distinto del
habitual en <EM>makeindex</EM> 
<BLOCKQUOTE><CODE>
<PRE>
xindy -f tex2xindy estilo.xdy tu_archivo.idx
</PRE>
</CODE></BLOCKQUOTE>

donde <EM>tex2xindy</EM> es un filtro que convierte sobre la marcha del formato
habitual de los <EM>.idx</EM> al formato especial que utiliza
<EM>xindy</EM>, <EM>estilo.xdy</EM> puede ser cualquiera de los dos
mencionados (u otro cualquiera para otro idioma o particularizado
por el autor del documento) y <EM>tu_archivo.idx</EM> es el que crea
LaTeX a partir de las llamadas a <CODE>\index</CODE>.</P>
</DL>
</P>

<HR>
<A HREF="FAQ-CervanTeX-7.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-5.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc6">Índice general</A>
</BODY>
</HTML>
