<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>FAQ de CervanTeX: ¿C&oacute;mo consigo LaTeX y otros programas relacionados?</TITLE>
 <LINK HREF="FAQ-CervanTeX-6.html" REL=next>
 <LINK HREF="FAQ-CervanTeX-4.html" REL=previous>
 <LINK HREF="FAQ-CervanTeX.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-CervanTeX-6.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-4.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc5">Índice general</A>
<HR>
<H2><A NAME="s5">5.</A> <A HREF="FAQ-CervanTeX.html#toc5">¿C&oacute;mo consigo LaTeX y otros programas relacionados?</A></H2>

<H2><A NAME="ss5.1">5.1</A> <A HREF="FAQ-CervanTeX.html#toc5.1">Distribuciones TeX/LaTeX</A>
</H2>

<P>En principio se podr&iacute;a coger todo el sistema elemento a elemento y ponerlo todo
en com&uacute;n. Sin embargo, para que &eacute;sto funcione correctamente, el tiempo
requerido y la complejidad del trabajo son grandes. Por esta raz&oacute;n
algunas personas o empresas ya lo han hecho y lo ofrecen preparado en
lo que se denominan distribuciones.</P>
<P>Se entiende por distribuci&oacute;n un conjunto de binarios y paquetes de macros
LaTeX junto con otras utilidades adicionales, empaquetados de forma
coherente y organizada, para que trabajen en com&uacute;n de la forma m&aacute;s
eficiente posible. Hay distribuciones de libre distribuci&oacute;n, shareware
(se puede distribuir y probar, pero si se quiere usar regularmente es
necesario pagar el registro) y otras de distribuci&oacute;n comercial. Aunque
algunas de las distribuciones comerciales tienen caracter&iacute;sticas
adicionales sobre las distribuciones libres, a veces es al
contrario. Aunque algunas distribuciones est&aacute;n disponibles para
distintos sistemas operativos, lo m&aacute;s habitual es que est&eacute;n limitadas
a un sistema operativo.  </P>
<P>Las distribuciones libres o shareware pueden conseguirse en el CTAN -- v&eacute;ase
<A HREF="FAQ-CervanTeX-7.html#que-es-CTAN">¿Qu&eacute; es el CTAN?</A> --, o a trav&eacute;s de los
CD-ROM editados por distintos grupos de usuarios de LaTeX, mientras
que las comerciales se consiguen a trav&eacute;s de sus respectivos
distribuidores o directamente si no los hay.</P>
<P>Para buscar distribuciones para los distintos sistemas operativos, la estructura
de un nodo CTAN es siempre la misma. Existe un directorio
<CODE>tex-archive</CODE> del cual cuelga un &aacute;rbol de directorios. En
particular, existe un directorio <CODE>systems</CODE>, del que penden las
distintas implementaciones. Existen versiones para 
<BLOCKQUOTE><CODE>
<PRE>
Atari 
Amiga 
UNIX 
VMS 
Os2 
Windows NT 
Mac 
MS-DOS 
</PRE>
</CODE></BLOCKQUOTE>

No es necesario tener una acceso de red para acceder al CTAN. El grupo de
usuarios alemanes de TeX (DANTE) ha hecho una recopilaci&oacute;n en CD-ROM
del contenido del CTAN. La edici&oacute;n de 1999 se ha distribuido a trav&eacute;s
del grupo de usuarios CervanTeX. Para mayor informaci&oacute;n se puede
consultar la p&aacute;gina web del grupo cervanTeX</P>

<H3>Distribuciones libres o <EM>shareware</EM></H3>

<P>
<DL>
<DT><B>Unix</B><DD><P><EM>teTeX</EM> es, para sistemas <CODE>Unix</CODE> la elecci&oacute;n m&aacute;s
multiplataforma. Se puede encontrar en
<CODE>CTAN/systems/unix/teTeX</CODE> y contiene por un lado una
serie de archivos que no dependen del sistema operativo y por
otro lado binarios para toda una serie de sistemas operativos
<EM>Unix</EM>.</P>

<DT><B>Linux</B><DD><P>Aunque lo que se acaba de decir de <EM>Unix</EM> es tambi&eacute;n v&aacute;lido para
<EM>Linux</EM>, recalcar adem&aacute;s que en las principales
distribuciones de <EM>Linux</EM> vienen paquetes de <EM>teTeX</EM>
listos para instalar y utilizar sin apenas esfuerzo.</P>
<P>Antes tambi&eacute;n hab&iacute;a otra distribuci&oacute;n denominada <EM>NTeX</EM>. Es necesario tener
un especial cuidado y <B>no utilizar</B> la incluida en el CD-ROM
de Slackware'96, que inclu&iacute;a una versi&oacute;n de las fuentes CM que
no respetaba las condiciones de distribuci&oacute;n y cambiaba la
m&eacute;trica respecto de las est&aacute;ndar sin cambiar el nombre,
rompiendo la portabilidad de los documentos.</P>

<DT><B>Mac</B><DD><P>OzTeX es una versi&oacute;n <EM>shareware</EM> de TeX para los ordenadores
Macintosh. Incluye un visualizador de dvi y un conversor a
postscript. Est&aacute; disponible en
<CODE>CTAN/non-free/systems/mac/oztex</CODE>. Su p&aacute;gina original
est&aacute; en 
<A HREF="http://www.trevorrow.com/oztex/">http://www.trevorrow.com/oztex/</A>  </P>

<DT><B>DOS/OS2</B><DD><P><EM>emTeX</EM> es, para sistemas <EM>DOS</EM> la distribuci&oacute;n m&aacute;s
extendida. Puede encontrarse en
<CODE>CTAN/systems/msdos/emtex</CODE>, aunque desde hace tiempo no
se ven versiones nuevas. <EM>gTeX</EM> era otra distribuci&oacute;n para
<EM>DOS</EM>, pero recientemente ha sido retirada de <CODE>CTAN</CODE> a
petici&oacute;n de su creador.
Tambi&eacute;n est&aacute; <EM>emTeX-TDS</EM>, que no es m&aacute;s que un &aacute;rbol de
archivos de estilo para TeX/LaTeX preparado para ser
utilizado con los binarios de <EM>emTeX</EM>.</P>

<DT><B>Win32</B><DD><P>
<UL>
<LI><B>fpTeX</B> de Fabrice Popineau es una versi&oacute;n de <EM>teTeX</EM> para Windows. Es
especialmente recomendable para aqu&eacute;llos que est&aacute;n
trabajando con Windows y Unix y para administradores que
deben mantener ambos, y tambi&eacute;n una buena opci&oacute;n para
usuarios en general. El visualizador de <EM>fpTeX</EM>,
<EM>Windvi</EM> est&aacute; basado en <EM>xdvi</EM> con algunas
peculiaridades del entorno Win32. La impresi&oacute;n se hace v&iacute;a
<EM>dvips</EM>. Est&aacute; disponible en
<CODE>CTAN/systems/win32/fptex</CODE>.</LI>
<LI><B>MikTeX</B> de Christian Schenk es tambi&eacute;n una distribuci&oacute;n completa
independiente de teTeX. tiene su propio visualizador
<EM>yap</EM> que permite imprimir, aunque tambi&eacute;n se incluye
<EM>dvips</EM>. Est&aacute; disponible en
<CODE>CTAN/systems/win32/miktex</CODE>.</LI>
</UL>
</P>
</DL>
</P>

<H3><A NAME="tex-de-pago"></A> Distribuciones comerciales</H3>

<P>
<DL>
<DT><B>Windows</B><DD><P>
<UL>
<LI><B>Scientific Word</B> <EM>Scientific Word/WorkPlace/Notebook</EM> ofrece una
forma de trabajo tipo casi <EM>WYSIWYG</EM> con un procesador
TeX en segundo plano. M&aacute;s informaci&oacute;n en 
<A HREF="http://www.sciword.demon.co.uk/">http://www.sciword.demon.co.uk/</A>. Incluye
<EM>TrueTeX</EM> </LI>
</UL>
</P>
</DL>
</P>

<H2><A NAME="tex-editores"></A> <A NAME="ss5.2">5.2</A> <A HREF="FAQ-CervanTeX.html#toc5.2">Editores de texto que trabajan especialmente bien con          LaTeX</A>
</H2>

<P>
<DL>
<DT><B>Unix</B><DD><P>GNU <EM>emacs</EM> utilizado en combinaci&oacute;n con el paquete AUCTeX
(disponible en <CODE>CTAN/support/auctex)</CODE> o como un paquete ya
incluido en muchas distribuciones) proporciona men&uacute;s desplegables
y secuencias de control para las estructuras habituales, verifica
sintaxis y la muestra coloreada, permite llamar a TeX y a los
conversores desde el editor y mucho m&aacute;s. Complejo, pero muy
potente.</P>
<DT><B>DOS/OS2</B><DD><P>TeXshell es un entorno de trabajo simple y f&aacute;cilmente personalizable
que puede ser utilizado con el editor favorito de cada
uno. Tambi&eacute;n cuenta con un editor propio que permite seguir los
errores de la compilaci&oacute;n f&aacute;cilmente aunque no soporta archivos de
m&aacute;s de 64K. Aunque puede particularizarse a otras distribuciones,
viene muy preconfigurado para emTeX.</P>
<DT><B>Win32</B><DD><P>
<UL>
<LI> <B>winedt</B> 
es un paquete <EM>shareware</EM> del que se suele oir hablar
bien. Proporciona un entorno de trabajo desde el que llamar a los
distintos programas y un editor potente y bien configurado</LI>
<LI> <B>Winshell</B> 
es un programa libre de prestaciones menores, pero que puede ser
m&aacute;s que suficiente para muchos usuarios.</LI>
<LI> <B>TeXnic Center</B> 
es tambi&eacute;n un buen entorno de trabajo para Win32. Est&aacute;
disponible en CTAN en <CODE>CTAN://systems/win32/TeXnicCenter/</CODE></LI>
</UL>
</P>
</DL>
</P>

<HR>
<A HREF="FAQ-CervanTeX-6.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-4.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc5">Índice general</A>
</BODY>
</HTML>
