<HTML>
<HEAD>
<TITLE>Ratones de 3 botones: Mini-Como : Ratones Normales</TITLE>
</HEAD>
<BODY>
<A HREF="Raton_3_botones-Como-4.html">Anterior</A>
<A HREF="Raton_3_botones-Como-6.html">Siguiente</A>
<A HREF="Raton_3_botones-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Ratones Normales</A></H2>


<P>Si no se tiene ning&uacute;n interruptor, y no hay instrucciones, entonces se
requiere un poco de experiencia. La primera cosa a intentar es asumir que el
fabricante del rat&oacute;n esta diciendo la verdad, y que el rat&oacute;n es
completamente Microsoft. Configure el fichero <CODE>XF86config</CODE> para que espere 
encontrar un rat&oacute;n Microsoft (ver m&aacute;s adelante) y darle una oportunidad.</P>
<P>Si el rat&oacute;n no funcion&oacute; en absoluto, entonces no es un rat&oacute;n Microsoft o
hay alg&uacute;n otro problema. Pruebe con los otros protocolos en las
configuraciones, la p&aacute;gina de ayuda para el fichero de configuraci&oacute;n es el
mejor lugar para empezar a buscar. Mire tambi&eacute;n en la secci&oacute;n 
<A HREF="Raton_3_botones-Como-9.html#problemas">problemas</A> m&aacute;s adelante.</P>
<P>Probablemente lo que ocurra es que al ejecutar X, el rat&oacute;n funcionar&aacute; bien
pero s&oacute;lo los botones de los extremos hagan algo. Se puede, por supuesto,
aceptar esto, y emular el tercer bot&oacute;n (pulsando ambos botones al mismo
tiempo para simular el central) como se har&iacute;a con un rat&oacute;n de dos botones.
Para hacer esto, cambiar el fichero de configuraci&oacute;n como se muestra en la
secci&oacute;n 
<A HREF="Raton_3_botones-Como-8.html#configs">configs</A> m&aacute;s adelante. Esto puede ser debido a que se compr&oacute; un
rat&oacute;n de 3 botones por ninguna raz&oacute;n especialmente, cosa que seguro no volver&aacute;
a hacer. Por lo que a partir de ahora ser&aacute; necesario tener m&aacute;s en cuenta el 
hardware.</P>

<HR>
<A HREF="Raton_3_botones-Como-4.html">Anterior</A>
<A HREF="Raton_3_botones-Como-6.html">Siguiente</A>
<A HREF="Raton_3_botones-Como.html#toc5">Indice</A>
</BODY>
</HTML>
