<HTML>
<HEAD>
<TITLE>Ratones de 3 botones: Mini-Como : Cambiando a modo 3 botones.</TITLE>
</HEAD>
<BODY>
<A HREF="Raton_3_botones-Como-5.html">Anterior</A>
<A HREF="Raton_3_botones-Como-7.html">Siguiente</A>
<A HREF="Raton_3_botones-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Cambiando a modo 3 botones.</A></H2>


<P>Incluso los ratones baratos pueden funcionar con el protocolo Mouse
Systems, con los tres botones funcionando. El truco es conseguir que el
rat&oacute;n <I>piense</I> que es un Mouse Systems, algo que raramente ver&aacute; en el manual.</P>
<P>Antes de encender el ordenador, mantener pulsado el bot&oacute;n izquierdo 
(manteni&eacute;ndolo pulsado hasta que haya arrancado el ordenador, para estar 
seguro).</P>
<P>Cuando llega corriente por primera vez al rat&oacute;n, si el bot&oacute;n derecho est&aacute;
pulsado, se cambia a modo Mouse Systems. Un hecho simple, pero no siempre
publicado. Tenga en cuenta que un reset en caliente puede no cortar la corriente
al rat&oacute;n, y por lo tanto puede no funcionar. Hay otras muchas formas de
cambiar de modo, que podr&aacute;n o no funcionar con un rat&oacute;n en particular.
Alguna de ellas son menos dr&aacute;sticas que rearrancar el ordenador, menos una, ¡que
es peor!.</P>
<P>Si el ordenador <I>get-at-able</I>, se puede desenchufar el rat&oacute;n y volverlo a
enchufar con el bot&oacute;n izquierdo pulsado, aunque yo por supuesto no recomiendo
esto ya que no todos los ordenadores permiten enchufar cosas cuando est&aacute;n en
marcha (con corriente).</P>
<P>Se puede resetear el rat&oacute;n tecleando </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
echo &quot;*n&quot; &gt; /dev/mouse
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>que deber&iacute;a tener el mismo efecto que desenchufarlo. Mantener el bot&oacute;n 
izquierdo pulsado para pasar al modo Mouse Systems, no para el modo Microsoft.
Se puede poner esto en cualquier script que se use para iniciar X.</P>
<P>Bob Nichols, <CODE>
<A HREF="mailto:rnichols@interaccess.com">rnichols@interaccess.com</A></CODE> ha escrito un peque&ntilde;o programa en C para hacer 
lo mismo, que puede que funcione si <CODE>echo "*n"</CODE> no lo hace. Puede 
encontrar una copia del c&oacute;digo fuente en <CODE>
<A HREF="http://kipper.york.ac.uk/src/fix-mouse.c">http://kipper.york.ac.uk/src/fix-mouse.c</A></CODE></P>
<P>Alguien han comunicado que la l&iacute;nea ``<CODE>ClearDTR</CODE>'' en el <CODE>XF86Config</CODE> es 
suficiente para cambiar sus ratones al modo Mouse Systems.</P>
<P>Si es lo suficientemente valiente, abra el rat&oacute;n (recuerde que esto invalidar&aacute;
su garant&iacute;a) y eche un vistazo a su interior. En algunos casos, puede que el 
rat&oacute;n tenga un interruptor interior, por alguna extra&ntilde;a raz&oacute;n conocida s&oacute;lo por
el fabricante. Es m&aacute;s probable, en ratones baratos, que haya un <I>jumper</I> que
pueda cambiar. El interruptor o <I>jumper</I>
<SL>N. del T. Puente de lat&oacute;n 
o cable empleado para conmutar circuitos, t&iacute;picos en placas base y tarjetas de 
expansi&oacute;n hardware.</SL>
 pueden tener el mismo efecto que que el conmutar
entre <I>``MS/PC''</I> como se describe en la secci&oacute;n 
<A HREF="Raton_3_botones-Como-4.html#switched">switched</A> anterior.</P>
<P>Puede que se encuentre tambi&eacute;n con que el circuito de la placa est&aacute; dise&ntilde;ado 
para conmutar entre los modos 2 y 3 botones, pero que no ha sido implementado.
Tendr&aacute; el siguiente aspecto:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
         -----------
        | o | o | o |  SW1
         -----------
          1   2   3
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Intente unir las patillas (pins) 1-2 o 2-3, y vea si cambia el
comportamiento del rat&oacute;n. Si lo hace, se puede colocar un peque&ntilde;o
interruptor, o puede soldar los contactos para una soluci&oacute;n r&aacute;pida y
permanente. </P>
<P>Es posible que necesite mantener presionado el bot&oacute;n izquierdo cuando arranque
XWindow. Algunos sistemas pueden enviar alg&uacute;n tipo de se&ntilde;al al rat&oacute;n cuando
arranca X, tenga esto en cuenta tambi&eacute;n.</P>
<P>As&iacute; que ah&iacute; est&aacute;, la elecci&oacute;n es suya. Aguantar los dos botones Microsoft que 
vienen por defecto, o intentar averiguar c&oacute;mo cambiar el modo y configurar
las X para aprovechar esto.</P>

<HR>
<A HREF="Raton_3_botones-Como-5.html">Anterior</A>
<A HREF="Raton_3_botones-Como-7.html">Siguiente</A>
<A HREF="Raton_3_botones-Como.html#toc6">Indice</A>
</BODY>
</HTML>
