<HTML>
<HEAD>
<TITLE>Ratones de 3 botones: Mini-Como : Instalaciones y problemas en general. </TITLE>
</HEAD>
<BODY>
<A HREF="Raton_3_botones-Como-8.html">Anterior</A>
<A HREF="Raton_3_botones-Como-10.html">Siguiente</A>
<A HREF="Raton_3_botones-Como.html#toc9">Indice</A>
<HR>
<H2><A NAME="problemas"></A> <A NAME="s9">9. Instalaciones y problemas en general. </A></H2>


<P>Si se tienen problemas con el rat&oacute;n en X o en consola, comprobar si se
est&aacute; ejecutando <CODE>getty</CODE> en la l&iacute;nea serie, o cualquier otra cosa como puede
ser un m&oacute;dem. Compruebe que no existen conflictos de <I>IRQ</I>.</P>
<P>Los problemas con dispositivos serie pueden ser debidos a que el puerto
serie no sea inicializado correctamente al arrancar. Esto se lleva a cabo
con el comando <CODE>setserial</CODE>, ejecutado desde el script de arranque 
<CODE>/etc/rc.d/rc.serial</CODE>. Compruebe la p&aacute;gina <CODE>man</CODE> y el 
<I>Serial-HOWTO</I> para m&aacute;s detalles. Puede valer la pena experimentar un
poco con los tipos, por ejemplo pruebe <CODE>setserial /dev/mouse uart 16550</CODE>
&oacute; 16550a independientemente del tipo de puerto que posea, etc...</P>
<P>
<UL>
<LI><B>Los ratones Logitech</B> puede que requieran activar la l&iacute;nea <CODE>ChordMiddle</CODE>
para que el bot&oacute;n central funcione. Esta l&iacute;nea reemplaza a 
<CODE>Emulate3Buttons</CODE> o va tras la l&iacute;nea <CODE>/dev/mouse</CODE> en el fichero de
configuraci&oacute;n. Puede necesitar posiblemente las l&iacute;neas <CODE>ClearDTR</CODE> y
<CODE>ClearRTS</CODE> en su <CODE>Xconfig</CODE>.
</LI>
<LI><B>Intercambio de botones:</B> usar el comando <CODE>xmodmap</CODE> para cambiar
qu&eacute; bot&oacute;n f&iacute;sico registra cada pulsaci&oacute;n del rat&oacute;n. Ejemplo:

<BLOCKQUOTE><CODE>
xmodmap -e "pointer = 3 2 1"
</CODE></BLOCKQUOTE>


intercambiar&aacute; los botones para ser usados con la izquierda. Si s&oacute;lo tiene dos
botones, s&oacute;lo hay que poner los botones 1 y 2.
</LI>
<LI><B>Aceleraci&oacute;n:</B> usar el comando <CODE>xset m</CODE> para cambiar la 
configuraci&oacute;n del rat&oacute;n. Ejemplo:

<BLOCKQUOTE><CODE>
xset m 2
</CODE></BLOCKQUOTE>


Establecer&aacute; la aceleraci&oacute;n a 2. Mirar la p&aacute;gina del manual para m&aacute;s detalles.
</LI>
<LI><B>Desplazamiento del cursor:</B> Si la acci&oacute;n de pinchar con el rat&oacute;n 
parece tener lugar a la izquierda o derecha de donde est&aacute; el cursor realmente,
puede ser que su pantalla no est&eacute; alineada. Esto es un problema del controlador
S3, que puede ser que corrija empleando <CODE>xvidtune</CODE>. Pruebe con
<CODE>Invert_VCLK/InvertVCLK</CODE>, o <CODE>EarlySC</CODE>. Esta informaci&oacute;n proviene de
Bill Lavender <CODE>
<A HREF="mailto:lavender@MCS.COM">lavender@MCS.COM</A></CODE> y
Simon Hargrave. En <CODE>XF86Config</CODE>, deber&aacute; aparecer como:

<BLOCKQUOTE><CODE>
<PRE>
Subsection &quot;Display&quot;
      Modes       &quot;1024x768&quot; &quot;800x600&quot; &quot;640x480&quot; &quot;1280x1024&quot;
      Invert_VCLK &quot;*&quot; 1
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>

<HR>
<A HREF="Raton_3_botones-Como-8.html">Anterior</A>
<A HREF="Raton_3_botones-Como-10.html">Siguiente</A>
<A HREF="Raton_3_botones-Como.html#toc9">Indice</A>
</BODY>
</HTML>
