<HTML>
<HEAD>
<TITLE>Ratones de 3 botones: Mini-Como : Uso de gpm para intercambiar los modos del rat&oacute;n.</TITLE>
</HEAD>
<BODY>
<A HREF="Raton_3_botones-Como-6.html">Anterior</A>
<A HREF="Raton_3_botones-Como-8.html">Siguiente</A>
<A HREF="Raton_3_botones-Como.html#toc7">Indice</A>
<HR>
<H2><A NAME="s7">7. Uso de <CODE>gpm</CODE> para intercambiar los modos del rat&oacute;n.</A></H2>


<P><CODE>gpm</CODE> es el programa que le permite usar el rat&oacute;n en modo consola
<SL>Modo texto o comando.</SL>
. Normalmente est&aacute; incluido en todas las 
distribuciones, y puede ser iniciado desde la l&iacute;nea de comandos o en el fichero
de arranque <CODE>/etc/rc.d/rc.local</CODE>. <CODE>gpm</CODE> es la causa de muchos de los
problemas que sufren la gente que usa ratones de bus, ya que bloquea el rat&oacute;n e
impide a las X usarlo. Aquellos de nosotros que usamos ratones serie no tenemos
este problema.</P>
<P>Los dos modos principales para ratones serie bajo <CODE>gpm</CODE> son:</P>
<P>
<UL>
<LI><CODE>gpm -t ms</CODE> para modo Microsoft;</LI>
<LI><CODE>gpm -t msc</CODE> para modo MouseSystems.</LI>
</UL>
</P>
<P>Puede emplear <CODE>gpm</CODE> para que interrogue al rat&oacute;n por usted, y le diga
qu&eacute; protocolo est&aacute; usando actualmente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 gpm -t help
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>No obstante, <CODE>gpm</CODE> es a veces capaz de reconocer los tres botones del rat&oacute;n
incluso bajo modo Microsoft. Y las &uacute;ltimas versiones (Versi&oacute;n 1.0 y posteriores
(?)) pueden incluso hacer esta informaci&oacute;n accesible para otros programas. Para
que esto tenga lugar, ha de ejecutar <CODE>gpm</CODE> con la opci&oacute;n <CODE>-R</CODE>, as&iacute;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
gpm -R -t ms
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto har&aacute; que <CODE>gpm</CODE> exporte los datos del rat&oacute;n a un dispositivo nuevo, 
llamado <CODE>/dev/gpmdata</CODE>, que ser&aacute; como un rat&oacute;n para cualquier otro 
programa. Tenga en cuenta que este dispositivo SIEMPRE emplea el protocolo
MouseSystems. Podr&aacute; entonces configurar su <CODE>XF86Config</CODE> para hacer uso
de &eacute;ste en lugar de <CODE>/dev/mouse</CODE> como se muestra a continuaci&oacute;n,
pero por supuesto habr&aacute; de asegurarse de estar ejecutando <CODE>gpm</CODE> siempre antes
de arrancar X Window. Algunas personas han informado que alguno de los eventos
asociados al bot&oacute;n central no son interpretados correctamente cuando se usa esta t&eacute;cnica, esto puede ser debido a una configuraci&oacute;n de rat&oacute;n aislada.</P>

<HR>
<A HREF="Raton_3_botones-Como-6.html">Anterior</A>
<A HREF="Raton_3_botones-Como-8.html">Siguiente</A>
<A HREF="Raton_3_botones-Como.html#toc7">Indice</A>
</BODY>
</HTML>
