<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Games">
 <TITLE>lf194, Games: Analizando el juego GLTron</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Harald-Radke.gif" alt="[Photo of the Author]" height="135" width="110">
<BR>por  <A href="mailto:harryrat@gmx.de">Harald Radke</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Desde 1994 Harry estudia Ciencias de las Computardoras en la universidad de tecnologia en Aechen,Alemania. Se intereso por Linux en 1995.
Programa un poco en el entorno X, le gustan los gr&aacute;ficos y los juegos  en Linux. Sus otros aficiones son : los juegos de mesa, leer libros de ciencia ficci&oacute;n, tocar la guitarra (&iexcl;Y tocarla Mal!), cocinar y practicar Ju-Jutsu.</P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Introduci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Instalaci&oacute;n &amp; Inicio</A></LI>
  <LI><A HREF="#lfindex2"> Men&uacute; del juego</A></LI>
  <LI><A HREF="#lfindex3">Jugar</A></LI>
  <LI><A HREF="#lfindex4">Apariencia</A></LI>
  <LI><A HREF="#lfindex5">Conclusiones</A></LI>
  <LI><A HREF="#lfindex6">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=194&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Analizando el juego GLTron</H2>
 <IMG src="../../common/images/article194/gltron-logo.gif" alt="[Illustration]" hspace="10" height="52" width="131">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P><I>glTron</I> es un juego muy rapido de carreras en 3D. Desplazando tu <I>vehiculo</I>
por la pista, evitando chocar contra tus oponetes o contra las paredes de energia.</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Introduci&oacute;n</H2>


<P>Erase una vez (al principio de los 80) hubo una pelicula llamada <I>Tron</I>. El heroe de esta pel&iacute;cula se enfrentava a la mente diab&oacute;lica de un ordenador llamado <I>MCP</I> (Master Control Program),que queria dominar el mundo. El heroe fue <I>digitalizado</I>
y transportado al interior del ordenador, donde los programas padecian las torturas de la inteligencia artificial diab&oacute;lica. Los programas renegados eran encarcelados y obligados a enfrentarse entre ellos en unos juegos a muerte, como si fueran gladiadores. Uno de estos programas era
<I>lightcycle race</I>.</P>

<P>Hoy existen varios juegos basados en este tipo de carrera, uno de ellos
<I>glTron</I>. En el momento de escribir este art&iacute;culo, la versi&oacute;n actual de <I>glTron</I> era 0.61.</P>

<A NAME="lfindex1">&nbsp;</A>
<H2>Instalaci&oacute;n &amp; Inicio</H2>


<P>Puedes escoger entre dos paquetes  en la p&aacute;gina de glTron
<A href="http://www.gltron.org">www.gltron.org</A>. Adem&aacute;s del paquete original de 2.8 MB, hay una versi&oacute;n precompilada, junto con el instalador de juegos Loki.Es fichero ocupa unos 4.1 MB.</P>

<CENTER>
<TABLE border="0">
<TBODY>
<TR bgcolor="#006080">
<TD>
<CENTER><FONT color="#ffffff"><B>Requirimientos</B></FONT></CENTER>
</TD>
</TR>

<TR bgcolor="#00a0c0">
<TD>Sistema X windows</TD>
</TR>

<TR bgcolor="#00a0c0">
<TD>Simple DirectMedia Layer (SDL) 1.1 o superior</TD>
</TR>

<TR bgcolor="#00a0c0">
<TD>Mezclador SDL</TD>
</TR>

<TR bgcolor="#00a0c0">
<TD>GLUT</TD>
</TR>

<TR bgcolor="#00a0c0">
<TD>Tajeta gr&aacute;fica 3D(recomendada)</TD>
</TR>
</TBODY>
</TABLE>
</CENTER>

<P>Para elaborar este art&iacute;culo se ha utilizado la versi&oacute;n binaria. Su instalaci&oacute;n fue muy sencilla, no se tuvo ning&uacute;n problema y todo funcion&oacute; a la perfecci&oacute;n. Despues de descargar el fichero y cambiar los flags para poderlo hacer ejecutable (es una funci&oacute;n script del shell), ejecutarlo como  <TT>root</TT>.Se ejecuta el scipt y te pregunta por el directorio donde guardar los datos , as&iacute; como el directorio donde colocar el ejecutable del juego.</P>

<P>El juego empieza tecleando <TT>gltron</TT> en la ventana de consolaw. Cuando empieza a juagar por primera vez el programa crea el fichero de recursos <TT>.gltronrc</TT> en tu directorio home.</P>

<CENTER>
<TABLE border="0">
<TBODY>
<TR>
<TD>
<CENTER><A href="../../common/images/article194/gltron-sc1.jpg"><IMG
border="0" src="../../common/images/article194/gltron-sc1s.jpg" alt=
"IMG:Menu"><BR>
<I> Men&uacute; del <B>Juego</B></I></A></CENTER>
</TD>
</TR>
</TBODY>
</TABLE>
</CENTER>

<BR>
<BR>


<A NAME="lfindex2">&nbsp;</A>
<H2> Men&uacute; del juego</H2>


<P>Lo primero que ves del juego es el men&uacute;.  Puedes cambiar la apariencia gr&aacute;fica, el sonido y la manera de jugar.<BR>
Cada elemento del men&uacute; se selecciona pulsando<TT>ENTER</TT>, pulsando
<TT>ESC</TT> te permite subir un nivel del men&uacute;.</P>

<UL>
<LI><B>Video</B><BR>
Te permite acceder a otros submenus que te permiten cambiar las opciones de textura, nivel de detalles, resoluci&oacute;n de pantalla y si se quiere ver en pantalla completa o en una ventana.  Desactivando algunas funciones se puede optimizar el funcionamiento del juego, aunque esta bien optimizado,
incluso en maquinas "lentas", por ejemplo un AMD K6-3 450 con una Riva TNT 2. Si tines problemas, reduce la resoluci&oacute;n de pantalla en contra de reducir el nivel de detalles.

<P><BR>
</P>
</LI>

<LI><B>Sonido</B><BR>
En este men&uacute; puede ajustar el nivel de los efectos sonoros y de la m&uacute;sica, activando o desactivandolos  y escogien.Por ahora solo una canci&oacute;n. Seguramente en proximas versiones esta opci&oacute;n mejorar&aacute;.

<P><BR>
</P>
</LI>

<LI><B>El juego</B><BR>
Este submenu se encarga con todo lo relacionado con la manerwa de jugar.
Puedes empezar la carrera desde aqu&iacute;, configurar el control desde el teclado o seleccionar el n&uacute;mero de jugadores y seleccionar si ser&aacute;n controlados por el ordenador o por personas. El l&iacute;mite son 4 jugadores. Por ahora el programa no soporta sesiones multijugadores en red.
<BR>
<BR>


<P>El submenu de <I>Reglas del Juego</I> permite seleccionar el tama&ntilde;o de la pista y el nivel de dificultad , ademas de sellecionar la velocidad del juego.</P>

<P>Y por &uacute;ltimo en el submenu de <I>Opciones del Juego</I> puedes selecionar algunos puntos de vista de la carrera, ( personalmente no lo recomiendo, algunas no son &uacute;tilies en el desarrollo del juego). En cualquier momento de la carrera se pueden cambiar el punto de vista  mediante las teclas de funci&oacute;n. Puedes selecionar el punto de vista del piloto,o
desde el faro delantera de la motocicleta o incluso tener el punto de vista de tus oponentes. Tambi&eacute;n se puede cambiar el punto de vista moviendo el rat&oacute;n.<BR>
</P>
</LI>
</UL>

<CENTER>
<TABLE border="0">
<TBODY>
<TR>
<TD>
<CENTER><A href="../../common/images/article194/gltron-sc2.jpg"><IMG
border="0" src="../../common/images/article194/gltron-sc2s.jpg" alt=
"IMG: Arena"><BR>
<I>Dentro de la pista</I></A></CENTER>
</TD>
</TR>
</TBODY>
</TABLE>
</CENTER>

<BR>
<BR>


<A NAME="lfindex3">&nbsp;</A>
<H2>Jugar</H2>


<P>Empezando el juego desde el men&uacute; <I>Game</I> te llevan a la pista.Al principio el juego es tranquilo, pulsando la tecla de <TT>SPACIO</TT> empieza la carrera. La pista de carrera es de forma cuadrada, rodeada por paredes llenas de simbolos. El suelo es un enrrejillado. Al iniciar la carrera la moto se desplaza a velocidad constante, sin posibilidad de acelerar o frenar. Girar significa cambiar la direcci&oacute;n 90 grados cada vez que se pulsa la tecla correspondiente. Tal como avanzas, se va creando detras de ti una pared luminosa. Cualquiera que choque contra otra moto o una pared morir&aacute;. La carrera termina cuando solo queda un jugador. Todos los jugadores deben utilizar el mismo teclado y pueden usar diferente pantalla.</P>

<A NAME="lfindex4">&nbsp;</A>
<H2>Apariencia</H2>


<P>Las motos de luz est&aacute;n bien renderizadas y son fosforescentes. Las paredes son semitransparentes. En la pista circula un robot guardian. Cuando chocas contra la pared, aparte de escuchar el sonido del choque, se cambia el punto de vista para ver como la moto explota. L&aacute;stima que s&oacute;lo haya disponible una s&oacute;la canci&oacute;n.</P>

<P>El rendimiento del juego es bueno,incluso es lo suficientemente r&aacute;pido en alta resoluci&oacute;n. Hay que tener en cuenta que el suelo es una rejilla azul sobre un fondo negro y las sombras se ven difuminadas. queda mejor un suelo semitransparente o reflectante. Las paredes no tienen grosor, asi que te puede ocurrir ( especialmente desde la vista de la cabina de piloto)	ue choques con ella cuando estas siguiendo a tu oponente, simplemente por que no la has visto. Los movimientos no se realizan tan solo sobre la rejilla, entre dos lineas de la rejilla hay una zona para m&aacute;s de una pared. El fondo oscuro y los s&iacute;mbolos que rodean la pista crean una atm&oacute;sfera irreal. De cualquier manera puedes crear tu propia atm&oacute;sfera con nuevos fondos.</P>

<CENTER>
<TABLE border="0">
<TBODY>
<TR>
<TD>
<CENTER><A href="../../common/images/article194/gltron-sc3.jpg"><IMG
border="0" src="../../common/images/article194/gltron-sc3s.jpg" alt=
"IMG: Duell"><BR>
<I>Who is going to make it?</I></A></CENTER>
</TD>
</TR>
</TBODY>
</TABLE>
</CENTER>

<BR>
<BR>


<A NAME="lfindex5">&nbsp;</A>
<H2>Conclusiones</H2>


<P><I>glTron</I> es un juego interesante. Es sencillo, tras aprender que el giro es de 90 grados, dominaras el juego rapidamente.La clave del exito es un reacci&oacute;n rapida y tener una peque&ntilde;a estrategia en lugar de conducir y evitar chocar contra las paredes.</P>

<P>Se le hecha enfalta algunas opciones : capacidad para jugar en red, m&aacute;s caciones, mejorar algunos aspectos gr&aacute;ficos que el suelo sea reflectante o que las paredes tengan cierto grueso. Por otro lado tenemos la pista, puedes sellecionar su tama&ntilde;o , pero siempre es cuadrada. Lo que puede resultar aburrida. Aunque ya ha hay suficiente con mantenerse vivo. <BR>

Todas las preguntas y sugerencias realizadas por los jugadores se pueden encontrar en la p&aacute;gina de glTron. Esto os dara una idea de que aspectos se mejorar&aacute;n en la pr&oacute;xima versi&oacute;n.</P>

<P>Lo m&aacute;s destacable de juego es que os dar&aacute; buenos momentos de entretenimiento. Especialmente cuando se compite entre amigos y os estais fastidiando entre vosotros al tratar de utilizar el teclado todos a la vez.(-:<BR>

Quizas sea m&aacute;s divertido que jugar en red, porque todos los jugadores est&aacute;n repartidos por el mundo, sentados solitariamente en frente de sus pantallas.</P>

<CENTER>
<TABLE border="0">
<TBODY>
<TR>
<TD>
<CENTER><A href="../../common/images/article194/gltron-sc4.jpg"><IMG
border="0" src="../../common/images/article194/gltron-sc4s.jpg" alt=
"IMG: Crash"><BR>
<I>&iexcl;No es lo suficienetemente rapido!</I></A></CENTER>
</TD>
</TR>
</TBODY>
</TABLE>
</CENTER>

<BR>
<BR>


<A NAME="lfindex6">&nbsp;</A>
<H2>Referencias</H2>


<UL>
<LI>P&aacute;gina principal de <A href="http://www.gltron.org">glTron</A></LI>

<LI>Algo m&aacute;s en <A href=
"http://www.gltron.org/screenshots.html">screenshots</A></LI>

<LI>Informaci&oacute;n <A href=
"http://www.gltron.org/documentation.html">en linea</A></LI>

<LI>En <A href="http://www.happypenguin.org/show?glTron">Linux Game
Tome entry</A> de glTron encontrareis comentarios de jugadores.</LI>
</UL>

<BR>
<BR>
<!-- vim: set sw=2 ts=2 et: -->



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=194&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Harald Radke, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article194.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:harryrat@gmx.de"><FONT COLOR="#FFFFFF">Harald Radke</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:apardoyo@yahoo.es"><FONT COLOR="#FFFFFF">Alberto Pardo</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-07-12, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
