<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="keywords" CONTENT="LinuxFocus, international magazine for Linux">
 <TITLE>Revista LinuxFocus, Mayo 2001</TITLE>
</HEAD>

<BODY bgcolor="#ffffff" text="#000000" alink="#336633" link="#336699">

<!-- MAP for top navegation bar -->  
<MAP name="top">  
<AREA shape="rect" coords="367,9,418,30" alt="Home" href="../">  
<AREA shape="rect" coords="423,9,457,30" alt="Map" href="../map.html">  
<AREA shape="rect" coords="463,9,508,30" alt="Index" href="../indice.html">  
<AREA shape="rect" coords="514,9,558,30" alt="Search" href="../Search/"> 
</MAP>  
  
<!-- MAP for bottom navegation bar -->  
<MAP name="bottom">  
<AREA shape="rect" coords="78,0,163,15"  alt="News" href="../News/">  
<AREA shape="rect" coords="189,0,284,15" alt="Archives" href="../Archives/">  
<AREA shape="rect" coords="319,0,395,15" alt="Links" href="../Links/">  
<AREA shape="rect" coords="436,0,523,15" alt="About LinuxFocus" href="../aboutus.html">  
</MAP>  

<!-- NAVEGATION BAR -->  
<CENTER>  
<IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0"  ismap usemap="#top" ><BR>  
<IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0"  ismap usemap="#bottom"><BR>  
</CENTER>

<BR clear=all>

<!-- macro insert body -->
<!-- ./20body.html -->
<BR>
<h1>Bienvenidos al n&uacute;mero de Mayo 2001 de LinuxFocus</h1>

<img src="../../common/images/coverMay2001.jpg" alt="[cover image]" width=159 height=166 align="left">

<p>
¿ Tu abuela no quiere cambiar a Linux ?
</p>

<p>
A&uacute;n hay muchos usuarios de Windows que dudan sobre instalar Linux. Una de
las razones podr&iacute;a ser que, tras 5 reinstalaciones completas de Windows
han decidido no tocarlo nunca m&aacute;s y ahora, con que funcione la mayor parte
del tiempo son felices. Esto sucede muy a menudo incluso aunque muchos de
ellos estar&iacute;an interesados en ver qu&eacute; parece.
</p>

<p>
SuSE ha encontrado la soluci&oacute;n a este problema, y se llama CD de evaluaci&oacute;n
de SuSE en vivo. Es una distribuci&oacute;n completa, preparada para ser instalada
en un &uacute;nico CD. El CD es botable, y es tambien posible generar primero un
floppy de botado si el sistema no es capaz de arrancar desde el CD-ROM.
<br>
Este CD est&aacute; disponible desde SuSE 7.0 y la versi&oacute;n mas reciente es
'live-eval-7.1' para SuSE 7.1
</p>

<p>
Al botar desde este CD, empezamos con Yast2, la pantalla t&iacute;pica de
instalaci&oacute;n de SuSE. Que no es una instalaci&oacute;n real, sino s&oacute;lo una
configuraci&oacute;n. Durante este proceso se crean 3 ficheros en la primera
partici&oacute;n de tu primer disco IDE. Da igual que se trate de una partici&oacute;n
ext2 de Linux o una partici&oacute;n de Windows, pues el CD en vivo puede
manejar ambas.
<UL>
<LI>suselive.710, unos 2Mb - con informaci&oacute;n del CD de evaluaci&oacute;n de SuSE 7.1
<LI>suselive.swp, unos 80Mb - el fichero de swap
<LI>suselive.usr, unos 100Mb - que es un filesystem ext2 con el directorio
   home del usuario
</UL>
Usando ese CD en vivo se puede probar un sistema Linux completo sin ning&uacute;n
riesgo. Ni reparticionar ni recolocar datos. Simplemente crea estos tres
ficheros y no deja ninguna otra traza en tu disco duro.
</p>

<p>
Esta es una forma conveniente de testear una nueva distribuci&oacute;n de Linux
incluso si ya lo tienes instalado. Pruebas y decides si debes actualizar
o si tu distribuci&oacute;n actual es suficientemente buena. ¿Desventajas?  Que
corre desde un CD-ROM y eso quiere decir que es m&aacute;s lento que un sistema
Linux normal, puesto que la lectura de datos desde un CD es un proceso relativamente lento.
</p>

<p>
Puedes descargar la imagen ISO desde
<a href="ftp://ftp.suse.com/pub/suse/i386/live-eval-7.1/">ftp://ftp.suse.com/pub/suse/i386/live-eval-7.1/</a>,
o desde cualquiera de sus mirror. El sitio principal de SuSE se encuentra
a menudo bastante cargado. Si no dispones de un modem DSL para manejar
una descarga de 650Mb en un tiempo razonable, tambi&eacute;n se puede pedir a SuSE,
o tal vez pedirle una copia a un amigo. Tal vez haya revistas impresas en tu
pa&iacute;s que incluyan el CD de evaluaci&oacute;n en vivo en alguno de sus n&uacute;meros.
</p>

<p>
Es una buena manera de promocionar Linux entre tus amigos y tal vez, al final,
no s&oacute;lo tu abuela quedar&aacute; convencida de que se trata de un sistema mejor,
y cambiar&aacute; a Linux.
</p>

<!-- end ./20body.html -->
<!-- ./80body.html -->
<BR>

<h2>Los art&iacute;culos</h2>

<H4> <FONT color="#660033"> Hardware </FONT> </H4>
<UL> 
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article205.shtml">Construci&oacute;n de un robot caminante controlado mediante Linux</A>
, por Katja and Guido Socher
<IMG SRC="../images/translated.png" HEIGHT=20>
<br>
Con este art&iacute;culo mostramos como construir un peque&ntilde;o insecto caminante,
control&aacute;ndolo con Linux a trav&eacute;s del puerto paralelo. Tras la lectura del
art&iacute;culo, seremos capaces de controlar cualquier otro dispositivo casero a
trav&eacute;s del puerto paralelo.
 </LI>
</UL>

<H4> <FONT color="#660033"> Administraci&oacute;n de Sistemas </FONT> </H4>
<UL> 
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article202.shtml">A trav&eacute;s del t&uacute;nel</A>
, por Georges Tarbouriech
<IMG SRC="../images/translated.png" HEIGHT=20>
<br>
Un art&iacute;culo sobre SSH y sus amigos.
 </LI>
</UL>

<H4> <FONT color="#660033"> Desarrollo de Software </FONT> </H4>
<UL> 
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article190.shtml">Evitando agujeros de seguridad, parte III: buffer overflow</A>
, por Frederic Raynal, Christophe Blaess, Christophe Grenier
<IMG SRC="../images/translated.png" HEIGHT=20>
<br>
Este art&iacute;culo explica como explotar software mal programado usando los
buffer overflows.
<br>
 </LI>
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article181.shtml">Hazlo con make!</A>
, por Wilbert Berendsen
<IMG SRC="../images/translated.png" HEIGHT=20>
<br>
Este art&iacute;culo explica como usar <tt>make</tt>.

 </LI>
</UL>

<H4> <FONT color="#660033"> Gr&aacute;ficos </FONT> </H4>
<UL> 
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article200.shtml">Introducci&oacute;n a BORG</A>
, por Erdal Mutlu and Ceyhun Elmas
<IMG SRC="../images/translated.png" HEIGHT=20>
<br>
BORG transforma varios PC en una &uacute;nica granja de <em>rendering</em>.

 </LI>
</UL>

<H4> <FONT color="#660033"> Juegos </FONT> </H4>
<UL> 
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article194.shtml">Analizando el juego GLTron</A>
, por Harald Radke
<IMG SRC="../images/translated.png" HEIGHT=20>
<br>
GLTron es un r&aacute;pido juego de carreras en 3D.

 </LI>
</UL>

<H4> <FONT color="#660033"> Aplicaciones </FONT> </H4>
<UL> 
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="../../English/May2001/article204.meta.shtml">Grabaci&oacute;n de mp3 en tiempo real, parte II</A>
, por Philip de Groot
<br>
Edici&oacute;n de ficheros MP3 y otros trucos sobre MP3.

 </LI>
</UL>

<hr width="65%" noshade size="1">

<!-- end ./80body.html -->
<!-- ./90body.html -->
<BR>
<H4>La peque&ntilde;a ayuda de LinuxFocus</H4>

<p>
¿C&oacute;mo imprimir varias p&aacute;ginas en cada hoja de papel?
Intenta esto. Haz click en el bot&oacute;n de impresi&oacute;n de netscape (o cualquier
otro programa) y reemplaza el comando de impresi&oacute;n con:
<PRE>
psnup -2 | lpr
</PRE>
Esto te sacar&aacute; dos p&aacute;ginas por cada p&aacute;gina de papel
</p>

<p>
psnup forma parte de un conjunto de comandos para imprimir y manipular
postscript, llamado <IT>psutils</IT> (disponible en 
<a href="http://www.dcs.ed.ac.uk/home/ajcd/psutils/index.html">http://www.dcs.ed.ac.uk/home/ajcd/psutils/</a>). Un comando muy interesante es psbook, que
reorganiza las p&aacute;ginas de forma que se puede conseguir un librito en 
tama&ntilde;o A5 si imprimes 2 p&aacute;ginas en cada hoja A4. Todo lo que te hace falta
es doblar el papel por la mitad y graparlo. Claro que necesitas una impresora
de doble cara (duplex). El comando de impresi&oacute;n ser&iacute;a
<PRE>
psbook | psnup -2 | lpr -P duplex
</PRE>
En este ejemplo nuestra impresora duplex se llama <it>duplex</it>. Incluso
si no dispones de una impresora de este tipo, <it>psutils</it> siguen siendo
muy &uacute;til. Este comando te convierte p&aacute;ginas A4 en tama&ntilde;o US-letter:
<PRE>
psresize -PA4 -pletter in.ps out.ps
</PRE>
</p>

<!-- end ./90body.html -->

<!-- end insert body -->

<BR clear=all>

<!-- start of footer -->
<HR WIDTH="85%" noshade size="1">
 <CENTER> 
<table WIDTH="85%" >
 <TR bgcolor="#666666">
   <TD align="center">
   <FONT color="#FFFFFF">
    <B>&copy; 1999 LinuxFocus</B><BR>
    </FONT>
    <A href="../../common/lfteam.html"><FONT color="#FFFFFF">P&aacute;gina de contacto
       con LinuxFocus</FONT></A>
   </TD>
 </TR>
</TABLE>
</CENTER>

</BODY>
</HTML>
