<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Pierre Loidreau
 =LF=CAT___: System Administration
 =LF=TITLE_: Introducci&oacute;n a la criptograf&iacute;a
 =LF=NUMBER: 243
 =LF=ANAME_: article243.html
 -->
 <TITLE>lf243, System Administration: Introducci&oacute;n a la criptograf&iacute;a</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Pierre_Loidreau.jpg" width="153"
    height="200" alt="Pierre Loidreau">
<BR>por  Pierre Loidreau <br> <small>&lt;pierre.loidreau(at)ensta.fr&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Pierre es profesor e investigador en la ENSTA (Ecole
    Nationale Sup&eacute;rieure de Techniques Avanc&eacute;es - <i>Escuela
    Nacional Superior de T&eacute;cnicas Avanzadas </i>). Su campo de investigaci&oacute;n son los
    "criptosistemas" basados en la teor&iacute;a de c&oacute;digos correctores de errores. Practica Linux
    a diario... y tenis a menudo.</P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Roberto Hernando Velasco (<a href="http://rhernando.ya.st"><font size="1">homepage</font></a>)
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#243lfindex0">Porqu&eacute; la criptograf&iacute;a. 2500 a&ntilde;os de historia</A></LI>
  <LI><A HREF="#243lfindex1">AES (Advanced Encryption Standard, Norma de Encriptaci&oacute;n Avanzada)</A></LI>
  <LI><A HREF="#243lfindex2">Criptograf&iacute;a de clave p&uacute;blica</A></LI>
  <LI><A HREF="#243lfindex3">Sobre el uso moderno de la criptograf&iacute;a</A></LI>
  <LI><A HREF="#243lfindex4">Clave p&uacute;blica o clave secreta: un compromiso</A></LI>
  <LI><A HREF="#243lfindex5">Bibliograf&iacute;a</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=243&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Introducci&oacute;n a la criptograf&iacute;a</H2>
 <IMG src="../../common/images/article243/logo-small.gif" width=
    "106" height="125" alt="mail" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>Este art&iacute;culo se ha publicado en un n&uacute;mero especial sobre la seguridad de Linux
    Magazine France. El editor, los autores y los traductores han aceptado amablemente que todos
    los art&iacute;culos de ese n&uacute;mero especial sean publicados en LinuxFocus. En consecuencia,
    LinuxFocus os "ofrecer&aacute;" esos art&iacute;culos a medida que se vayan traduciendo al ingl&eacute;s.
    Este resumen se reproducir&aacute; en todos los art&iacute;culos que tengan el mismo origen.</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="243lfindex0">&nbsp;</A>
<H2>Porqu&eacute; la criptograf&iacute;a. 2500 a&ntilde;os de historia</H2>


    <P>El origen de la criptograf&iacute;a  se remonta sin duda a los or&iacute;genes del hombre,
    desde que aprendi&oacute; a comunicarse. Entonces, tuvo que encontrar medios
    de asegurar la confidencialidad de una parte de sus comunicaciones. En el antiguo
    Egipto, la escritura jug&oacute; a veces ese papel. Sin embargo, el primer testimonio
    de uso deliberado de m&eacute;todos t&eacute;cnicos que permitieran cifrar los mensajes
    viene de Grecia, sobre el siglo VI antes de Cristo, y se llama "escitalo".
    El escitalo era un bast&oacute;n. El emisor enrollaba una tira de cuero alrededor
    del bast&oacute;n y escrib&iacute;a longitudinalmente sobre el bast&oacute;n. Despu&eacute;s desenrollaba
    la tira y la enviaba al destinatario. Sin conocer el di&aacute;metro del bast&oacute;n que hab&iacute;a
    jugado el papel de clave, era imposible descifrar el mensaje. M&aacute;s tarde  los
    ej&eacute;rcitos romanos utilizaron para comunicarse el cifrado de C&eacute;sar, consistente en
    desplazar el alfabeto tres letras. <BR>
    <BR>

    Despu&eacute;s, durante cerca de 19 siglos, se asiste al desarrollo m&aacute;s o menos
    ingenioso de t&eacute;cnicas de cifrado experimentales donde la seguridad resid&iacute;a
    esencialmente en la confianza que quisieran darles los usuarios. En el siglo
    XIX, Kerchoffs estableci&oacute; los principios de la criptograf&iacute;a moderna. Uno de los principios
    establece que la seguridad de un sistema de cifrado no reside m&aacute;s que
    en la clave y no en el procedimiento de cifrado.<BR>
    <BR>

    En lo sucesivo, concebir sistemas criptogr&aacute;ficos deb&iacute;a responder a esos criterios.
    Sin embargo, todavia les faltaba a esos sistemas unos cimientos matem&aacute;ticos suficientes que proveyeran
    utilidades para medir y cuantificar su resistencia a eventuales ataques y, por qu&eacute;
    no, encontrar el "Santo Grial" de la criptograf&iacute;a: el sistema incondicionalmente seguro.
    En 1948 y 1949 dos art&iacute;culos de Claude Shannon, "Teor&iacute;a Matem&aacute;tica de la Comunicaci&oacute;n" y
    sobre todo "La Teor&iacute;a de la Comunicaci&oacute;n de los Sistemas Secretos" dieron los
    cimientos cient&iacute;ficos a la criptograf&iacute;a borrando tanto vanas promesas como falsos prejuicios. Shannon
    prob&oacute; que el cifrado de Vernam introducido algunas decenas de a&ntilde;os antes --todav&iacute;a
    llamado one-time pad-- era el &uacute;nico sistema incondicionalmente seguro. Sin embargo
    el sistema era impracticable. Es por lo que hoy en d&iacute;a la evaluaci&oacute;n de la seguridad
    de un sistema se interesa principalmente en la seguridad computacional.
    Se dice que
    un sistema de cifrado de clave secreta es seguro si ning&uacute;n ataque conocido de
    menor complejidad que la b&uacute;squeda exhaustiva sobre el espacio de claves ofrece mejores
    resultados que &eacute;sta.
    </P>

    <A NAME="243lfindex1">&nbsp;</A>
<H2>AES (Advanced Encryption Standard, <i>Norma de Encriptaci&oacute;n Avanzada</i>)</H2>


    Muy recientemente, en octubre de 2000, el NIST (National Institute of
    Standards and Technology, <i>Instituto Nacional de Est&aacute;ndares y Tecnolog&iacute;a</i>) eligi&oacute;,
    entre 15 candidatos, un nuevo est&aacute;ndar de cifrado con
    clave secreta    para
    reemplazar al viejo DES, debido a que el tama&ntilde;o de las claves se hab&iacute;a vuelto demasiado
    peque&ntilde;o. El algoritmo elegido para convertirse en el AES es el Rijndael, cuyo nombre
    viene del de sus creadores, Rijmen y Daemen.<BR>
     <BR>

    &Eacute;ste es un sistema de cifrado llamado "por bloques" ya que los mensajes est&aacute;n cifrados por
    bloques completos, que aqu&iacute; son de 128 bits. Hay varias versiones del sistema utilizando
    claves de 128, 192 o 256 bits. Como informaci&oacute;n apuntar que el DES cifra bloques de 64 bits
    con una clave de 56 bits solamente. El triple DES utilizaba normalmente hasta entonces
    cifras con bloques de 64 bits con una clave de 112 bits.<BR>
    <BR>


    <CENTER>
      <A href="../../common/images/article243/LinuxMag001.gif"><IMG
      src="../../common/images/article243/LinuxMag001.gif" alt="AES"
      width="466" height="122"></A>
    </CENTER>
    <BR>


    <CENTER>
      Figura 1: Iteraciones del AES
    </CENTER>
    <BR>

    El principio de funcionamiento del AES est&aacute; descrito en la figura 1. En primer lugar,
    se a&ntilde;ade bit a bit al mensaje la clave secreta <I>K</I><SUB><FONT SIZE=2>0</FONT></SUB> .
    Despu&eacute;s, como para todos los algoritmos de cifrado por bloques, se itera una funci&oacute;n
    <i>F</i>, parametrizada por subclaves que se obtienen de la clave maestra mediante
    un algoritmo de expansi&oacute;n de claves.<BR>
    <BR>

    En el caso de AES, se itera 10 veces la funci&oacute;n <i>F</i>.

    <ul>
      <li>La figura 2 describe c&oacute;mo se itera la funci&oacute;n <i>F</i> para cifrar.
      Se toma como entrada bloques de 128 bits repartidos en 16 octetos. Antes de
      nada, se aplica a cada octeto la misma permutaci&oacute;n <i>S</i>. Seguidamente, se
      aplica a los 16 octetos una segunda permutaci&oacute;n <i>P</i>. Entonces al resultado
      obtenido se le a&ntilde;ade bit a bit la subclave de 128 bits obtenida por el algoritmo de expansi&oacute;n
      de clave. </li>

      <li>El algoritmo de expansi&oacute;n de clave permite calcular la clave <i>K<sub><font size=2>i</font></sub></i>
      de la <i>i</i>-&eacute;sima iteraci&oacute;n en funci&oacute;n de la subclave <i>K</i><sub><font size=2><i>i</i>-1</font></sub> de la
      (<i>i</i>-1)-&eacute;sima iteraci&oacute;n, siendo <i>K</i><sub><font size=2>0</font></sub> la clave
      secreta. Esto se describe en la figura 3. Los 16 octetos de la clave <i>K</i><sub><font size=2><i>i</i>-1</font></sub>
      se toman de 4 en 4. Los &uacute;ltimos 4 octetos se permutan usando una permutaci&oacute;n <i>S</i>,
      que es la misma que se utiliza para permutar los bits de cada octeto de la funci&oacute;n. Despu&eacute;s
      se suma al primer octeto del nuevo conjunto el elemento <font face="symbol">a</font><SUP><FONT SIZE=2><I>i</I></FONT></SUP>.
      Este elemento es un octeto que depende del n&uacute;mero <i>i</i> de la iteraci&oacute;n considerada.
      Por &uacute;ltimo, para obtener <i>K<sub><font size=2>i</font></sub></i>, se a&ntilde;ade bit a bit los
      4 octetos obtenidos a los 4 primeros octetos de <i>K<sub><font size=2>i-1</font></sub></i>,
      despu&eacute;s el resultado obtenido es agregado a los 4 octetos siguientes y as&iacute; sucesivamente.<br>
      </li>
    </UL>

    <CENTER>
      <A href="../../common/images/article243/LinuxMag002.gif"><IMG
      src="../../common/images/article243/LinuxMag002.gif" width="414"
      height="369" alt="Funci&oacute;n F"></A>
    </CENTER>
    <BR>


    <CENTER>
      Figura 2: Funci&oacute;n <I>F</I>
    </CENTER>
    <BR>

    Veamos brevemente c&oacute;mo se construyen las permutaciones y a qu&eacute; corresponde la
    constante <font face="symbol">a</font><sup><font size=2><I>i</I></font></sup>.
    T&eacute;cnicamente y por simplicidad, un octeto se puede considerar como un elemento
    de un conjunto con 256 elementos llamado cuerpo finito, sobre el que existen todo
    tipo de operaciones simples, entre otras las operaciones de adici&oacute;n, producto e
    inversi&oacute;n. La permutaci&oacute;n <i>S</i> anteriormente mencionada corresponde a la
    inversi&oacute;n sobre este conjunto. La permutaci&oacute;n <i>P</i> est&aacute; especificada como
    una operaci&oacute;n muy simple, implement&aacute;ndose f&aacute;cilmente. El elemento <font face="symbol">a</font><sup><font size=2><I>i</I></font></sup>
    corresponde a elevar a la potencia <i>i</i> un elemento del cuerpo. Estas
    consideraciones permiten implementar AES de forma muy eficaz.<BR>
     <BR>

     Como el AES no comprende m&aacute;s que operaciones muy simples sobre los octetos
     se tienen dos ventajas enormes:<BR>


    <UL>
       <li>incluso la implrmentaci&oacute;n por software de AES es extremadamente r&aacute;pida.
       Por ejemplo, una implementaci&oacute;n en C++ sobre un Pentium a 200MHz permite
       cifrar a 70Mbits/s;</li>

       <li>la resistencia de AES a los criptoan&aacute;lisis diferencial y lineal no depende
       de la elecci&oacute;n de S-Cajas como en el DES, que hab&iacute;an sido sospechosas de haber
       sido ama&ntilde;adas por la NSA. En efecto, todas las operaciones efectuadas son operaciones
       simples.</li>
    </ul>

    <CENTER>
      <A href="../../common/images/article243/LinuxMag003.gif"><IMG
      src="../../common/images/article243/LinuxMag003.gif" width="448"
      height="293" alt="Algoritmo de expansi&oacute;n de clave"></A>
    </CENTER>
    <BR>


    <CENTER>
      Figura 3: Algoritmo de expansi&oacute;n de claves
    </CENTER>

    <A NAME="243lfindex2">&nbsp;</A>
<H2>Criptograf&iacute;a de clave p&uacute;blica</H2>


    En 1975 Diffie y Hellman publicaron un art&iacute;culo llamado "New Directions in
    Cryptography" <i>(Nuevas direcciones en Criptograf&iacute;a)</i> que tuvo el efecto
    de una bomba en la comunidad de los cript&oacute;grafos, introduciendo
    el concepto de criptograf&iacute;a de clave p&uacute;blica. Los algoritmos de cifrado
    con clave secreta (o clave privada), los &uacute;nicos conocidos hasta entonces, ya no satisfac&iacute;an
    las nuevas necesidades que aparec&iacute;an paralelamente a la explosi&oacute;n de
    nuevos medios de comunicaci&oacute;n muy impersonales -- como por ejemplo, el desarrollo de las redes
    de comunicaciones.

    <P>La soluci&oacute;n completamente revolucionaria que propusieron fue introducir
    la noci&oacute;n de funci&oacute;n de una sola v&iacute;a con trampa, o <i>trapdoor one-way function</i> (tambi&eacute;n
    conocida como funci&oacute;n de un sentido irreversible).
    Es una funci&oacute;n que se calcula f&aacute;cilmente en un sentido, pero que es
    computacionalmente imposible de invertir si no se conoce un secreto
    llamado <i>trampa</i>, aunque la funci&oacute;n sea conocida por todos.
    Entonces la clave p&uacute;blica es la funci&oacute;n, mientras que la trampa, conocida por
    un n&uacute;mero restringido de usuarios se denomina clave privada. As&iacute; naci&oacute; el
    mundo de Alice, Bob y compa&ntilde;&iacute;a. Alice y Bob son dos personas que buscan
    comunicarse de forma &iacute;ntegra mientras algunas personas pueden interponerse, escuchando
    o incluso alterando el canal de comunicaci&oacute;n.</P>

    <P> Para descifrar el mensaje el receptor invierte la funci&oacute;n utilizando la trampa.<BR>
    <BR>
    El ejemplo m&aacute;s bello de criptosistema de clave p&uacute;blica y, sin lugar a dudas, el m&aacute;s simple
    aparece justo dos a&ntilde;os despu&eacute;s, en 1978. Se debe a Rivest, Shamir y Adleman de donde
    toma el nombre RSA. Se basa en la dificultad de factorizar dos n&uacute;meros enteros. La clave
    privada est&aacute; formada por la tripleta <i>(p,q,d)</i> donde <i>p</i> y <i>q</i> son dos
    n&uacute;meros primos de aproximadamente el  mismo tama&ntilde;o, <i>d</i> es un n&uacute;mero entero primo con
    <i>p</i>-1 y con <i>q</i>-1. La clave p&uacute;blica se compone del par <i>(n,e)</i>. Donde
    <i>n=pq</i> y <i>e</i> es el inverso de <i>d</i> m&oacute;dulo <i>(p-1)(q-1)</i>, i.e.</P>

        <DIV align="center">
      <I>ed</I> = 1 mod(<I>p</I>-1)(<I>q</I>-1).
    </DIV>
    <BR>
    <BR>
    <BR>
    Supongamos que Alice desea enviar un mensaje cifrado con la clave p&uacute;blica
    de Bob <i>(n,e)</i>. Primero transforma el mensaje en un n&uacute;mero <i>m</i> inferior
    a <i>n</i>. Despu&eacute;s calcula&nbsp;

    <DIV align="center">
      <I>c</I> = <I>m</I><SUP><FONT size="2"><I>e</I></FONT></SUP> mod
      <I>n</I>,
    </DIV>
    <BR>
    <BR>
    y env&iacute;a el resultado <i>c</i> a Bob. &Eacute;ste, cuya clave p&uacute;blica es <i>(p,q,d)</i>,
    calcula:&nbsp;

    <DIV align="center">
      <I>c</I><SUP><FONT size="2"><I>d</I></FONT></SUP> mod <I>n</I> =
      <I>m</I><SUP><FONT size="2"><I>ed</I></FONT></SUP> mod <I>n</I> =
      <I>m</I>.
    </DIV>
    <BR>
    <BR>
    En el caso de RSA, la funci&oacute;n de una sola v&iacute;a con trampa que se considera
    es la funci&oacute;n que asocia a un n&uacute;mero x&lt;n el valor <I>x</I><SUP><FONT size=
    "2"><I>e</I></FONT></SUP> mod <I>n</I>. <BR>
    <BR>
    Tras el sistema de cifrado RSA, se han desarrollado muchos otros sistemas
    de clave p&uacute;blica. Uno de los m&aacute;s utilizados actualmente, y un serio competidor
    de RSA es un sistema de cifrado basado en los problemas de c&aacute;lculo de los logaritmos
    discretos.



    <A NAME="243lfindex3">&nbsp;</A>
<H2>Sobre el uso moderno de la criptograf&iacute;a</H2>

    En realidad, el inter&eacute;s de la criptograf&iacute;a de clave p&uacute;blica es el de ocuparse de
    muchos problemas de seguridad, y ofrecer una gran flexibilidad. Lo que permite
    entre otras cosas encontrar soluciones a los problemas de autentificaci&oacute;n:

    <UL>
      <LI><EM>La identificaci&oacute;n de personas:</EM> con la aparici&oacute;n de medios
      de comunicaci&oacute;n impersonales, Alice quiere estar segura de que la persona
      con la que se comunica no hace trampas con su identidad,
      es decir que alguien que diga ser Bob lo sea en realidad. Para conseguirlo,
      Alice utiliza lo que se llama un <i>protocolo de identificaci&oacute;n</i>. Existen
      muchos, bas&aacute;ndose en los mismos principios que RSA de las propiedades
      del logaritmo discreto.<BR>
      </LI>

      <LI><EM>La autentificaci&oacute;n de documentos</EM>: una autoridad puede
      autentificar documentos por medio de una <i>signatura num&eacute;rica
    </font></i>. La signatura consiste en a&ntilde;adir
      al documento cierto n&uacute;mero de bits que se calculan en funci&oacute;n del documento
      y de la autoridad, y por lo general mediante funciones hash
       como MD5 o SHA. Adem&aacute;s,
      todo el que tenga acceso al documento, debe poder verificar que la signatura
      realmente es de la autoridad. Para hacerlo se utilizan los llamados <i>esquemas
      de signatura</i>. Uno de los m&aacute;s conocidos es el esquema de signatura
      ElGamal que se basa, una vez m&aacute;s, en las propiedades del logaritmo discreto.</LI>
    </UL>
    Por otro lado, como la criptograf&iacute;a de clave secreta, la criptograf&iacute;a de clave
    p&uacute;blica permite elaborar sistemas de cifrado, asegurando la confidencialidad
    de las comunicaciones.<BR>
    <BR>

    Supongamos que Alice desea comunicarse con Bob de forma privada. Alice
    encuentra en un directorio la clave p&uacute;blica de
    Bob, y cifra el mensaje con esta clave. Cuando Bob recibe el mensaje cifrado,
    utiliza su clave privada para descifrar el mensaje y recuperar el <i>texto llano</i>.
    Las dos claves juegan papeles completamente distintos, &eacute;sta es la raz&oacute;n
    por la que se habla de <i>criptosistemas asim&eacute;tricos</i>, en oposici&oacute;n a los
    criptosistemas de <i>clave secreta</i> que utilizan la misma clave para
    cifrar que para descifrar y se llaman <i>criptosistemas sim&eacute;tricos</i>.<BR>
    <BR>

     La criptograf&iacute;a de clave p&uacute;blica presenta otra ventaja sobre la criptograf&iacute;a de clave
     secreta. Si <i>n</i> personas desean comunicarse mediante un criptosistema de clave
     secreta, cada una de ellas debe disponer de una clave diferente para cada
     persona del grupo. Por tanto hace falta poder generar en total <i>n(n-1)</i> claves.
     Teniendo en cuenta que <i>n</i> puede ser del orden de varios millares, ser&aacute;
     necesario generar ficheros de varios millones de claves. Adem&aacute;s, a&ntilde;adir
     un miembro al grupo no es sencillo, ya que habr&aacute; que generar otrar <i>n</i>
     claves para que el nuevo miembro pueda comunicarse con los dem&aacute;s integrantes
     del grupo, y despu&eacute;s distribuir las nuevas claves a todo el grupo. Por contra,
     en el caso de un <i>criptosistema asim&eacute;trico</i>, se guardan las <i>n</i> claves
     p&uacute;blicas de los miembros del grupo en un directorio.
     Para a&ntilde;adir un miembro, basta conque ponga su <i>clave p&uacute;blica</i> en el
     directorio.

    <A NAME="243lfindex4">&nbsp;</A>
<H2>Clave p&uacute;blica o clave secreta: un compromiso</H2>


    En el p&aacute;rrafo anterior, se ha visto que la criptograf&iacute;a de clave p&uacute;blica
    aporta soluci&oacute;n a muchos m&aacute;s problemas que la criptograf&iacute;a de clave
    secreta. Entonces nos podemos preguntar cu&aacute;l es la utilidad de AES.
    Existen dos razones fundamentales para escogerlo:

    <UL>
      <li>Por una parte, una raz&oacute;n pr&aacute;ctica. En efecto, la mayor&iacute;a de los sistemas
      de cifrado de clave p&uacute;blica son muy lentos. Por ejemplo, RSA es  varios
      centenares de veces m&aacute;s lento que el AES implement&aacute;ndose en software y es completamente
      imposible implementarlo en hardware. Actualmente donde la velocidad
      de la transmisi&oacute;n de la informaci&oacute;n constituye un punto crucial, el algoritmo
      de cifrado no puede ser el factor limitante.<BR>
      </LI>

      <LI>Por otro lado, desde el punto de vista de la seguridad, hay problemas relativos
      a la estructura misma de los sistemas de cifrado de clave p&uacute;blica.<BR>
      <BR>
      Es sorprendente constatar que el tama&ntilde;o de las claves necesario en criptograf&iacute;a
      de clave p&uacute;blica para asegurar un seguridad satisfactoria es mayor que el tama&ntilde;o
      de claves en criptograf&iacute;a de clave secreta. En realidad la noci&oacute;n y la importancia
      del tama&ntilde;o de clave para asegurar la seguridad no tiene sentido m&aacute;s que en el caso
      de la clave secreta. De hecho, esos sistemas se basan en la hip&oacute;tesis de que los
      &uacute;nicos posibles ataques son los llamados ataques exhaustivos (o por fuerza bruta)
      que consisten en
      enumerar todas las claves posibles. Por ejemplo, en el caso de una clave
      de 128 bits, el tama&ntilde;o del espacio a enumerar es 2<FONT size=
      "2"><SUP>128</SUP></FONT>.<BR>
      <BR>
      Por contra, en el caso de clave p&uacute;blica, el tama&ntilde;o de clave no tiene sentido m&aacute;s
      que cuando se considera el mismo sistema. De hecho, por ejemplo el sistema
      RSA de 512 bits es mucho menos seguro que un AES de 128 bits. La &uacute;nica m&eacute;dida
      v&aacute;lida para evaluar un criptosistema de clave p&uacute;blica es la complejidad del mejor
      ataque conocido. La mayor diferencia es que jam&aacute;s se est&aacute; al abrigo
      de ataques te&oacute;ricos. Muy recientemente un grupo de investigadores
      ha conseguido factorizar un n&uacute;mero de 512 bits. En consecuencia, para tener
      una seguridad suficiente para los pr&oacute;ximos a&ntilde;os, se aconseja generalmente
      utilizar n&uacute;meros <i>n</i> de 1024 bits.</LI>
    </UL>

    En cifrado, es mejor entonces utilizar algoritmos de cifrado de clave secreta
    cuando sea posible. Una soluci&oacute;n completamente interesante y aceptable
    es el compromiso elaborado por Zimmermann para concebir PGP. El principio
    de cifrado es el siguiente: supongamos que Alice y Bob desean comunicarse
    de manera &iacute;ntegra, utilizando un algoritmo de clave secreta -en el caso de
    PGP &eacute;ste algoritmo es IDEA-.

    <UL>
      <LI>Alice y Bob se ponen de acuerdo sobre la clave secreta por un protocolo
      de intercambio de claves. Este tipo de protocolos utiliza propiedades de criptograf&iacute;a
      de clave p&uacute;blica. Uno de los m&aacute;s conocidos en la materia es el protocolo de
      Diffie-Hellman.</LI>

      <LI>Despu&eacute;s se comunican utilizando el algoritmo IDEA, que es p&uacute;blico.</LI>
    </UL>
    Una vez que su conversaci&oacute;n ha terminado, rechazan la clave de esa sesi&oacute;n. Tal
    sistema combina las ventajas de los dos tipos de criptograf&iacute;a. En general, se considera
    que la mayor debilidad se encuentra en el protocolo de intercambio de claves.


    <A NAME="243lfindex5">&nbsp;</A>
<H2>Bibliograf&iacute;a</H2>

    Historia de la criptograf&iacute;a:

    <UL>
      <LI>S. Singh : <I>Histoire des codes secrets</I>. Jean-Claude
      Latt&egrave;s, 1999.<br>
      <i>(N.T. existe una versi&oacute;n en castellano publicada por Editorial Debate en 2000 con
      el t&iacute;tulo "Los c&oacute;digos secretos").</i>
      </LI>

      <LI>D. Kahn : <I>The Codebreakers: the story of secret
      writing</I>. MacMillan publishing, 1996.</LI>
    </UL>
    AES : <BR>


    <UL>
      <LI><A href=
      "http://csrc.nist.gov/encryption/aes/rijndael/">http://csrc.nist.gov/encryption/aes/rijndael/</A></LI>

      <LI><A href=
      "http://www.esat.kuleuven.ac.be/rijmen/rijndael/">http://www.esat.kuleuven.ac.be/rijmen/rijndael/</A></LI>
    </UL>
    Criptograf&iacute;a en general :<BR>


    <UL>
      <LI>Art&iacute;culo de Anne Canteaut y
      Fran&nbsp;L&eacute;vy-dit-V&eacute;hel : <A href=
      "http://www-rocq.inria.fr/canteaut/crypto_moderne.pdf">http://www-rocq.inria.fr/canteaut/crypto_moderne.pdf</A></LI>

      <LI>B. Schneier : <I>Applied Cryptography</I>. John Wiley and
      Sons, 1996.</LI>
    </UL>
    <HR>
    <!-- vim: set sw=2 ts=2 et: -->
  


<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=243&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Pierre Loidreau, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article243.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">fr --&gt; -- : Pierre Loidreau <small>&lt;pierre.loidreau(at)ensta.fr&gt;</small></font></td></tr>
  <tr><td><font size="2">fr --&gt; en: Axelle Apvrille &lt;axellec(at)netcourrier.com&gt;</font></td></tr>
  <tr><td><font size="2">fr --&gt; es: Roberto Hernando Velasco (<a href="http://rhernando.ya.st"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-05-20, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
