<HTML>
<HEAD>
<TITLE>Linux Information Sheet: Introducci&oacute;n a Linux</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="InfoSheet-Como-2.html">Siguiente</A>
<A HREF="InfoSheet-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n a Linux</A></H2>

<P>Linux es una reimplementaci&oacute;n completamente gratuita de las
especificaciones POSIX, con extensiones de SYSV y BSD (lo cual significa 
que parece Unix pero no proviene del mismo c&oacute;digo fuente base), que est&aacute; 
disponible tanto en su versi&oacute;n fuente como ya compilada. El copyright 
pertenece a Linus B. Torvalds (Linus.Torvalds@.Helsinki.FI) y otros 
colaboradores, y es libremente redistribuible bajo las condiciones de la 
&quot;GNU Public License&quot;.</P>
<P>Linux <B>no</B> es de dominio p&uacute;blico, ni es &quot;shareware&quot;. Es software gratuito,
usualmente denominado <B>freeware</B>, y t&uacute; puedes proporcionar copias a otros
pero tambi&eacute;n debes dar los fuentes con &eacute;stas o hacer posible su obtenci&oacute;n de
la misma forma. Si t&uacute; redistribuyes una modificaci&oacute;n est&aacute;s legalmente
obligado a proporcionar los fuentes de &eacute;sta. Vease la &quot;GNU Public License&quot;
para m&aacute;s detalles. Una copia est&aacute; incluida en los fuentes de Linux o puedes
obtenerla v&iacute;a ftp de prep.ai.mit.edu en /pub/gnu/COPYING</P>
<P>Linux es gratuito en la versi&oacute;n actual y seguir&aacute; si&eacute;ndolo en el futuro.
Debido a la naturaleza del copyright de GNU, al que Linux est&aacute; sujeto, ser&iacute;a
ilegal no hacerlo as&iacute;. No obstante es importante saber que es perfectamente
legal cobrar por distribuir Linux, mientras se incluya el c&oacute;digo fuente;
para ampliar este punto rem&iacute;tase a la GPL.</P>
<P>Linux se ejecuta en m&aacute;quinas 386/486/Pentium con bus ISA, EISA, PCI o
VLB. MCA (bus propietario de IBM) no est&aacute; actualmente soportado por la falta
de documentaci&oacute;n, aunque hay algunos parches disponibles para ciertas
m&aacute;quinas.</P>
<P>Actualmente se est&aacute; portando a distintas plataformas Motorola 680x0 (los
Amigas y Ataris), y por ahora funciona bastante bien. Se requiere un 68020
con una MMU, un 68030 o un 68040, y tambi&eacute;n una FPU. El software de red y X
funcionan.</P>
<P>Linux funciona bien en la CPU Alpha de DEC, actualmente bajo &quot;Jensen&quot;,
&quot;NoName&quot;, &quot;Cabriolet&quot;, &quot;Universal Desktop Box&quot; (m&aacute;s conocida como Multia), 
y algunas otras plataformas.</P>
<P>Linux est&aacute; siendo r&aacute;pidamente portado a Sun Sparc.</P>
<P>Versiones para otras m&aacute;quinas, incluyendo MIPS, PowerPC y PowerMAC
est&aacute;n en camino y se est&aacute; haciendo alg&uacute;n progreso. No te asustes, pero si
est&aacute;s interesado y puedes contribuir, puedes perfectamente encontrar otros
desarrolladores que querr&aacute;n trabajar contigo.</P>
<P>A partir de la versi&oacute;n 1.0 que data de Marzo de 1994, Linux ya no es una
versi&oacute;n de prueba (una beta). A&uacute;n hay errores en el sistema y nuevos errores
ir&aacute;n apareciendo y ser&aacute;n solucionados con el tiempo. Como Linux es un
proyecto de desarrollo abierto, todas las nuevas versiones que vayan
apareciendo estar&aacute;n disponibles para el p&uacute;blico, sean o no estables. Sin
embargo, para ayudar a la gente a discernir si la una versi&oacute;n es o no
estable se ha acordado lo siguiente: Las versiones 1.x.y en las que x sea
par son versiones estables y el incremento de y implica la correcci&oacute;n de
alg&uacute;n error. Por lo tanto de la versi&oacute;n 1.2.2 a la 1.2.3 s&oacute;lo hay correcci&oacute;n
de errores, pero ninguna caracter&iacute;stica nueva. Las versiones 1.x.y con x
impar son betas para los desarrolladores, pudiendo ser inestables y hasta
colgarse, y est&aacute;n siendo ampliadas continuamente con nuevas posibilidades.
Las actuales versiones de desarrollo son las numeradas 1.3.x, y la m&aacute;s 
reciente versi&oacute;n estable es la 1.2.13.</P>
<P>De cuando en cuando, mientras el n&uacute;cleo de desarrollo actual se estabiliza,
ser&aacute; &quot;congelado&quot; como el nuevo n&uacute;cleo y el desarrollo continuar&aacute; en una
nueva versi&oacute;n de desarrollo del kernel.</P>
<P>La mayor parte de las versiones de Linux, betas o no, son bastante estables,
y podr&aacute;s continuar us&aacute;ndolas si hacen lo que t&uacute; quieres y no pretendes estar
a la &uacute;ltima. Un site tuvo un ordenador corriendo bajo la versi&oacute;n 0.97 con un
nivel de parcheado (patchlevel) 1 (originalmente del verano de 1992) sin un
s&oacute;lo error o cuelgue. (Habr&iacute;a durado m&aacute;s si el bruto del operador no hubiese
confundido el transformador de la fuente con una aguja de descarga de
electricidad est&aacute;tica...). Otros han informado de actualizaciones con un a&ntilde;o
de retraso. Un site sigue teniendo un ordenador corriendo Linux 0.99pl15s
desde que fue inicialmente arrancado hace m&aacute;s de 600 d&iacute;as.</P>
<P>Algo a tener en cuenta es que Linux est&aacute; desarrollado siguiendo un modelo
abierto y distribuido, en lugar de uno cerrado y centralizado como la mayor
parte del software. Esto significa que la versi&oacute;n actualmente en desarrollo
es siempre p&uacute;blica (con un retraso de una o dos semanas) para que cualquiera
pueda usarla. El resultado es que en cualquier momento que se a&ntilde;ada una
nueva funcionalidad y salga a la luz la nueva versi&oacute;n, &eacute;sta casi siempre
tendr&aacute; errores, pero ser&aacute;n detectados y corregidos r&aacute;pidamente, a menudo en
cuesti&oacute;n de horas, ya que mucha gente trabaja en ello.</P>
<P>En contraste, el modelo centralizado y cerrado significa que hay s&oacute;lo una
persona o un equipo trabajando en el proyecto, y s&oacute;lo publican software que
ellos piensan que est&eacute; trabajando bien. A menudo esto conlleva largos
periodos de tiempo entre versiones, largas esperas para la correcci&oacute;n de
errores y un desarrollo m&aacute;s lento. Por supuesto que la &uacute;ltima versi&oacute;n de
este tipo de software es a menudo de mejor calidad para el p&uacute;blico, pero la
velocidad de desarrollo es normalmente mucho m&aacute;s lenta.</P>
<P>A 8 de Febrero de 1996, la actual versi&oacute;n estable de Linux es 1.2.13, y el
nuevo &aacute;rbol de desarrollo, 1.3.x, est&aacute; actualmente por la versi&oacute;n 1.3.60. ¡No
uses n&uacute;cleos de la serie 1.3.x a menos que quieras meterte en su desarrollo y 
no te preocupe que tu m&aacute;quina se venga abajo una vez tras otra!.</P>


<HR>
Anterior
<A HREF="InfoSheet-Como-2.html">Siguiente</A>
<A HREF="InfoSheet-Como.html#toc1">Indice</A>
</BODY>
</HTML>
