<HTML>
<HEAD>
<TITLE>FIPS El primer Fragmentador Interactivo de ParticioneS de disco : Restricciones</TITLE>
</HEAD>
<BODY>
<A HREF="FIPS-Como-4.html">Anterior</A>
<A HREF="FIPS-Como-6.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Restricciones</A></H2>


<P>FIPS s&oacute;lo trabajar&aacute; con los discos duros que usen la interrupci&oacute;n 13h para acceso de disco de bajo nivel. Esto es as&iacute; para casi todos los PCs. He recibido un informe de un viejo controlador ADAPTEC SCSI que ten&iacute;a un driver de software que trabajaba en un nivel m&aacute;s alto. En tal caso lo &uacute;nico que puedes hacer es conseguir un nuevo driver de ADAPTEC. Esto ya no es problema para los nuevos ADAPTECs (yo personalmente uso uno). FIPS trabaja s&oacute;lo en discos con un tama&ntilde;o de sector de 512 bytes. Parece que DOS esta preparado para trabajar con distintos tama&ntilde;os de sector, pero hasta ahora no lo he visto. FIPS no dividir&aacute; particiones con FATs de 12 bits (no querr&aacute;s dividir una partici&oacute;n con menos de 10 Mbytes verdad?). FIPS s&oacute;lo dividir&aacute; particiones DOS. La tabla de partici&oacute;n y el sector de arranque deben estar de acuerdo a las convenciones de MS-DOS 3. Esto se marca por medio del byte indicador del sistema en la tabla de partici&oacute;n, debe tener el valor 4 (n&uacute;mero de sector de 16 bits) o 6 (n&uacute;mero de sector de 32 bits). FIPS NO DIVIDIR&Aacute; PARTICIONES LINUX.</P>
<P>FIPS todav&iacute;a no act&uacute;a sobre particiones DOS extendidas. Est&aacute; planeado dar soporte a estas particiones a largo plazo, pero no puedo decir cuando. FIPS no trabajar&aacute; si hay ya cuatro particiones, ya que necesita una partici&oacute;n libre. FIPS no reducir&aacute; la partici&oacute;n original a un tama&ntilde;o menor de 4085 cluster, porque esto implicar&iacute;a reescribir la FAT de 16 bits a una de 32. </P>
<HR>
<A HREF="FIPS-Como-4.html">Anterior</A>
<A HREF="FIPS-Como-6.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc5">Indice</A>
</BODY>
</HTML>
