<HTML>
<HEAD>
<TITLE>FIPS El primer Fragmentador Interactivo de ParticioneS de disco : Antes de comenzar</TITLE>
</HEAD>
<BODY>
<A HREF="FIPS-Como-5.html">Anterior</A>
<A HREF="FIPS-Como-7.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Antes de comenzar</A></H2>


<P>Ejecute <CODE>chkdsk</CODE> o <CODE>scandisk</CODE> en la partici&oacute;n que quieres dividir. Como alternativa puede emplear <CODE>NORTON DISK DOCTOR</CODE>. Aseg&uacute;rese que no quedan clusters muertos en el disco. Prepare un disquete de arranque en a:. Bajo DOS este se puede hacer con el comando <EM>format a: /s</EM>, bajo WINDOWS NT o OS/2 esto puede ser distinto, en caso de duda consultar el manual o arrancar con un disco de arranque. Copiar a este disquete los siguientes archivos de FIPS: <CODE>restorrb.exe, unerros.txt</CODE>. </P>
<P>A continuaci&oacute;n, COMPRUEBE el disco de arranque. Lea el manual o pregunte al guru m&aacute;s pr&oacute;ximo si no puede arrancar con el disquete o no puede acceder al disco duro (Comprobar esto con el comando <EM>dir c:</EM>, deber&iacute;as de ver el directorio ra&iacute;z de tu disco duro). Si todo esto falla intente usar FIPS despu&eacute;s de arrancar normalmente desde el disco duro (un poco m&aacute;s arriesgado pero a veces el &uacute;ltimo recurso). Cuando ejecute FIPS se podr&aacute;n escribir copias de seguridad de los sectores de arranque y ra&iacute;z a un archivo en la unidad a: llamado <CODE>rootboot.00X</CODE> (donde X es un n&uacute;mero entre 0 y 9). Si algo va mal se puede recuperar la configuraci&oacute;n original arrancando desde el disquete y ejecutando <CODE>RESTORRB.EXE</CODE>. Por favor f&iacute;jense: si usa FIPS m&aacute;s de una vez (esto no es frecuente pero puede ocurrir), se escribir&aacute; mas de un rootboot. <CODE>RESTORRB</CODE> le permitir&aacute; elegir que archivo de configuraci&oacute;n recuperar. El archivo <CODE>restorrb.000</CODE> contiene la configuraci&oacute;n original. Procure no confundir las versiones. Necesitar&aacute; este disco de seguridad (<CODE>rootboot.00X</CODE>) si quiere deshacer la partici&oacute;n m&aacute;s tarde. Pero antes de comenzar con FIPS deber&aacute; defragmentar el disco. Todo el espacio que se vaya a usar para la nueva partici&oacute;n deber estar vacio. Tenga en cuenta que el archivo de windows de swapping o fichero de intercambio de la memoria virtual no ser&aacute; movido por la mayor&iacute;a de los defragmentadores. Deber&aacute; desinstalarlo (en el icono <EM>Extendido 386</EM> del panel de control de windows). Reinstalarlo despu&eacute;s de usar FIPS. Si usa <CODE>IMAGE o MIRROR,</CODE> el &uacute;ltimo sector del disco contiene un archivo oculto que se&ntilde;ala a tus archivos mirror o copia. Debe borrar este archivo antes de usar FIPS. Se crear&aacute; la pr&oacute;xima vez que ejecute mirror). Ejecuta <EM>attrib -r -s -h image.idx </EM>&oacute; <EM>attrib -r -s -h mirorsasv.fil</EM> en el directorio ra&iacute;z, borrar a continuaci&oacute;n el archivo. Si FIPS no ofrece tanto espacio como cabr&iacute;a esperar puede ser que ocurra lo siguiente:
<UL>
<LI>a.Todav&iacute;a hay demasiados datos en la partici&oacute;n. Considere borrar parte de los datos o hacer una partici&oacute;n m&aacute;s peque&ntilde;a.</LI>
<LI>b. Hay archivos ocultos en el espacio para la nueva partici&oacute;n que no han sido movidos por el programa de defragmentaci&oacute;n. Se pueden ver los archivos ocultos con el comando<EM> dir /a:h /s</EM>. Compruebe a qu&eacute; programa pertenecen. Si es un archivo de intercambio de un programa es posible eliminarlo de una forma segura y ser&aacute; recuperado autom&aacute;ticamente; mire el manual para m&aacute;s detalles. Si el archivo pertenece a alguna clase de protecci&oacute;n de copia debes desinstalar el programa.</LI>
</UL>
</P>
<P>YA no puedo ofrecer m&aacute;s ayuda sobre esto. </P>
<P>ATENCI&Oacute;N no intentes mover ning&uacute;n archivo oculto del DOS (<CODE>msdos.sys, io.sys</CODE>). Pueden acabar con un disco duro que no arranque nunca m&aacute;s. No es necesario mover estos archivos ya que se encuentran el primer sector del disco. A partir de la versi&oacute;n DOS 5.0, por lo menos uno de los archivos del sistema puede se movido, no obstante no es una buena idea dejarlo s&oacute;lo. </P>
<P>Una vez haya ejecutado FIPS tendr&aacute; que rearrancar el ordenador, aseg&uacute;rate de desactivar cualquier programa del <CODE>config.sys</CODE> o del <CODE>autoexec.bat</CODE> que escriba al disco, en concreto mirror o imagen. Considere cambiar temporalmente el nombre de estos ficheros. Tenga presente que la ubicaci&oacute;n de sus particiones DOS en la tabla de partici&oacute;n puede cambiar despu&eacute;s de usar FIPS. Si usa la partici&oacute;n nueva bajo DOS y tiene una partici&oacute;n extendida y/ dos unidades de disco, esto significa que los nombres de las particiones pueden cambiar (ejemplo D: se puede convertir en E:). He procurado que C: permanezca siempre como C:, de forma que podr&aacute; arrancar. De igual forma, si tiene un CD-ROM cambiar&aacute;, en la mayor&iacute;a de casos la letra de unidad. Si usa el par&aacute;metro /L con el comando <CODE>MSCDEX</CODE> en el fichero autoexec.bat, tendr&aacute; que cambiarlo en concordancia. Si no usa el modificador<EM> /L</EM>, <CODE>MSCDEX</CODE> escoger&aacute; autom&aacute;ticamente la primera letra libre, de forma que no es necesario cambiar nada</P>
<P>En relaci&oacute;n a las letras de unidades, el DOS usa el orden siguiente para asignarlas:
<OL>
<LI>La primera partici&oacute;n de cada unidad </LI>
<LI>Los vol&uacute;menes dentro de las particiones extendidas en cada unidad </LI>
<LI>Las restantes particiones primarias de todas las dem&aacute;s unidades.</LI>
</OL>
</P>
<P>Ejemplo:</P>
<P>C: primera partici&oacute;n primaria en el primer disco duro </P>
<P>D: primera partici&oacute;n primaria en segundo disco duro </P>
<P>E: primer volumen en la partici&oacute;n extendida del primer disco duro </P>
<P>F: segundo volumen en la partici&oacute;n extendida del primer disco </P>
<P>G: primer volumen en la partici&oacute;n extendida del segundo disco </P>
<P>H: segunda partici&oacute;n primaria del segundo disco </P>
<P>I: CD ROM</P>
<P>No conozco una manera f&aacute;cil cambiar este esquema. Concretamente no se puede asignar arbitrariamente una letra a una partici&oacute;n. Puede, sin embargo, influir en la ordenaci&oacute;n cambiando una partici&oacute;n primaria en una extendida. </P>
<P>Para usuarios LINUX: El posible cambio en la ubicaci&oacute;n de la partici&oacute;n DOS en la tabla de partici&oacute;n tambi&eacute;n significa que el n&uacute;mero que designa la esta partici&oacute;n bajo LINUX puede cambiar ( e.g /dev/hda3 se puede convertir en /dev/hda1). Cualquier partici&oacute;n Linux existente no cambiar&aacute;, raz&oacute;n por la que no habr&aacute; problema al arrancar. S&oacute;lo es necesario editar el archivo /etc/fstab si usted monta su partici&oacute;n DOS al arrancar.</P>
<HR>
<A HREF="FIPS-Como-5.html">Anterior</A>
<A HREF="FIPS-Como-7.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc6">Indice</A>
</BODY>
</HTML>
