<HTML>
<HEAD>
<TITLE>FIPS El primer Fragmentador Interactivo de ParticioneS de disco : Preguntas m&aacute;s frecuentes sobre FIPS </TITLE>
</HEAD>
<BODY>
<A HREF="FIPS-Como-12.html">Anterior</A>
<A HREF="FIPS-Como-14.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc13">Indice</A>
<HR>
<H2><A NAME="s13">13. Preguntas m&aacute;s frecuentes sobre FIPS </A></H2>


<P>Aqu&iacute; hay unas preguntas que la gente me pregunt&oacute; por <F>email</F>. Este archivo puede ayudarle con algunos problemas comunes. Por favor l&eacute;alo cuidadosamente antes de mandarlo. Si quiere saber de que se trata FIPS, lea el archivo <CODE>README.1ST.</CODE>Est&aacute;n las respuestas a las siguientes preguntas: </P>
<P>Q01. Ya que se puede dividir las participaciones con FIPS ¿ser&iacute;a posible unir las particiones? </P>
<P>Q02. ¿Puedo invertir los cambios que FIPS hizo a mi disco duro? </P>
<P>Q03. ¿Qu&eacute; pasar&iacute;a si no mantengo el sector ra&iacute;z y de arranque? ¿Puedo todav&iacute;a deshacer la partici&oacute;n? </P>
<P>Q04. He o&iacute;do que el cluster depende del tama&ntilde;o de la partici&oacute;n y que el uso del espacio es mejor con tama&ntilde;os peque&ntilde;os de cluster. ¿Puedo usar FIPS para disminuir el tama&ntilde;o del cluster de mi disco duro? </P>
<P>Q05. Quiero dividir una partici&oacute;n grande en tres o cuatro m&aacute;s peque&ntilde;as. ¿puedo usar FIPS varias veces? </P>
<P>Q06. FIPS crea por defecto una segunda partici&oacute;n DOS primaria. ¿Est&aacute; esto permitido? </P>
<P>Q07. ¿Que significa el mensaje " Info: partition table inconsistency"?</P>
<P>Q08. FIPS muestra un mensaje de error y se niega a trabajar. ¿Qu&eacute; debo hacer? </P>
<P>Q09. FIPS no reconoce mi disco SCSI. </P>
<P>Q10. FIPS s&oacute;lo reconoce una partici&oacute;n tipo 56h y ninguna DOS</P>
<P>Q11. FIPS parece trabajar bien, y DOS reconoce la nueva partici&oacute;n, pero el fdisk de Linux reconoce una sola partici&oacute;n.</P>
<P>Q12. ¿Funciona FIPS con Windows 95? </P>
<P><B>Q01. Ya que se puede dividir las participaciones con FIPS ¿ser&iacute;a posible unir las particiones? </B></P>
<P><B>A01.a</B> </P>
<P>NO en general. No quiero meterme en detalles t&eacute;cnicos, s&oacute;lo un poco: Cada partici&oacute;n formada por DOS tiene una FAT que contiene las entradas para cada Cluster de la partici&oacute;n. Actualmente la FAT no es lo suficientemente grande como para sostener ambas particiones, por lo que esas particiones no ser&aacute;n unidas f&aacute;cilmente. Es factible, pero no voy a incorporarlo dentro de FIPS. Hasta ahora he o&iacute;do de dos paquetes de Software que dicen expandir las particiones. Uno es un programa gratuito llamado"Partition Resizer" (busca un archivo llamado<CODE> presz???.zip</CODE> en tu servicio favorito de BBS o FTP), el otro es un producto comercial llamado, PartitionMagic by Power quest. No la he probado todav&iacute;a.</P>
<P><B>A01.b </B></P>
<P>SI, si dividiste antes las particiones con FIPS. Como te esperabas el problema con FAT no existe en ese caso, desde que fuera originalmente formateado. En efecto la &uacute;nica cosa requerida es restablecer el original root y boot sector (mientras tanto no importa como cambien los datos en la partici&oacute;n). Esto puede hacerse con el programa <CODE>restorrb</CODE> que viene con FIPS. Por favor ten en cuenta lo siguiente: 
<UL>
<LI>Debes tener la imagen original de root and boot sector. Para eso debes salvarles con el Floppy disk Cuando FIPS te lo muestre. </LI>
<LI>no debes formatear la primera partici&oacute;n (porque cuando es generado un nuevo FAT generalmente es muy peque&ntilde;o). </LI>
<LI>Los datos de la segunda partici&oacute;n (uno de los que fueron creados por FIPS est&aacute;n perdidos , por supuesto. Los datos de la primera partici&oacute;n est&aacute;n guardados.</LI>
</UL>
</P>
<P><B>Q02. ¿Puedo invertir los cambios que FIPS, hizo a mi disco duro </B>?</P>
<P><B>A02.</B> </P>
<P>S&iacute;, ver la respuesta-A01.b. Aseg&uacute;rate de que guardas los sectores de arranque y ra&iacute;z originales en un floppy disk con FIPS.</P>
<P><B>Q03. ¿Qu&eacute; pasar&iacute;a si no mantengo el sector ra&iacute;z y de arranque? ¿Puedo todav&iacute;a deshacer la partici&oacute;n? </B></P>
<P><B>A03 </B>Dif&iacute;cil. Por el momento tu &uacute;nica opci&oacute;n es leer el archivo que <CODE>TECHINFO.TXT</CODE> y aprender acerca del formato del disco duro, recalcula las particiones antiguas y formatear info a mano y usa un editor disco para cambiarlos. Debes proceder con astucia como indico a continuaci&oacute;n (llamar&eacute; a la partici&oacute;n que fue dividida de la partici&oacute;n original la "segunda" partici&oacute;n, quedando la partici&oacute;n original como la "primera") :
<OL>
<LI>Aseg&uacute;rate de que no hay un dato importante a la izquierda de la segunda partici&oacute;n ya que podr&iacute;a ser borrado. Haz copias de todos los roots and boots sectors (¡en Floppy disk!) por si cometieras alg&uacute;n fallo. Tambi&eacute;n aseg&uacute;rate de que tienes un disco de arranque DOS, que funcione, con el editor disco en &eacute;l .¡Haz una copia de seguridad de los datos! </LI>
<LI>Elige ' edit physical drive' y edit participation table ' en el men&uacute; del editor disk (en el caso de que tu editor disk lo soporte) </LI>
<LI>Examina la tabla para asegurarte a que dos particiones, quieres unirte. </LI>
<LI>Apunta la cabeza, cilindro y sector de la segunda partici&oacute;n e introduce los valores en los correspondientes campos de la primera partici&oacute;n. </LI>
<LI>Suma al numero de sectores de la primera partici&oacute;n el n&uacute;mero de sectores de la segunda e introduce el nuevo valor en el campo de sectores de la primera partici&oacute;n. </LI>
<LI>Borra completamente la entrada para la segunda partici&oacute;n (sobrescribiendo con ceros). </LI>
<LI>Busca el boot sector de la primera partici&oacute;n e introduce el nuevo n&uacute;mero de sectores en el campo de sectores del boot sector.</LI>
</OL>
</P>
<P>Por favor aseg&uacute;rate de que sabes lo que estas haciendo . Yo no me hago responsable de los l&iacute;os de su disco duro. L&eacute;ete el archivo <CODE>TECHINFO.TXT</CODE> cuidadosamente.</P>
<P><B>Q04. He o&iacute;do que el cluster depende del tama&ntilde;o de la partici&oacute;n y que el uso del espacio es mejor con tama&ntilde;os peque&ntilde;os de cluster. ¿Puedo usar FIPS para disminuir el tama&ntilde;o del cluster de mi disco duro</B>? </P>
<P>A04. En la partici&oacute;n que dividiste de la partici&oacute;n original, el tama&ntilde;o del cluster se adapta autom&aacute;ticamente al nuevo tama&ntilde;o cuando lo formateaste. En la partici&oacute;n original no se puede cambiar el tama&ntilde;o del cluster sin reformatear y, por lo tanto, borrando todos los datos. Si tu nueva partici&oacute;n es lo bastante grande, debes copiar los datos de la nueva partici&oacute;n y formatear los antiguos, pero ten en cuenta dos cosas:
<OL>
<LI>No seras capaz de recuperar la partici&oacute;n antigua (ver A1.a). </LI>
<LI>Los programas m&aacute;s nuevos chequean para ver si la partici&oacute;n ha sido ya formateada y en este caso preservan el formato (para que la recuperaci&oacute;n de los datos sea mas f&aacute;cil en el caso de que los formatos tengan alg&uacute;n fallo). Tienes que hacer enga&ntilde;ar al Programa haci&eacute;ndole creer que la partici&oacute;n es nueva. Posiblemente el modificador /u har&aacute; esto (No tengo posibilidad de chequear esto, por favor dime si funciona), pero si no, tienes que usar un editor de disco y sobrescribir el boot sector de la partici&oacute;n con ceros para anularlo.</LI>
</OL>
</P>
<P>Nota: He recibido un informe que sobreescribiendo el boot sector no era bastante. S&oacute;lo se me ocurre pensar que hab&iacute;a bastante informaci&oacute;n en las tablas de la BIOS sobre el viejo formato -recomiendo rearrancar despu&eacute;s de sobreescribir el boot sector y borrar todas las tablas. A veces las herramientas de DOS son demasiado inteligentes (si tienes problemas m&aacute;ndame un mensaje).</P>
<P>El tama&ntilde;o normal de una partici&oacute;n es aproximadamente el siguiente:</P>
<P>0 - 32 MB 512 BYTES </P>
<P>32 - 64 MB 1024 BYTES </P>
<P>64 - 128 MB 2048 BYTES </P>
<P>128 - 256 MB 4096 BYTES </P>
<P>256 - 512 MB 8192 BYTES </P>
<P>512 -1024 MB 16384 BYTES</P>
<P><B>Q05. Quiero dividir una partici&oacute;n grande en tres o cuatro m&aacute;s peque&ntilde;as. ¿puedo usar FIPS varias veces?</B></P>
<P>A05. Si. Debes formatear las particiones nuevamente creadas entre sucesivos usos de FIPS. A prop&oacute;sito para el tama&ntilde;o deber&aacute;s tener en cuenta el siguiente ejemplo:</P>
<P>- Suponte que quieres dividir un 1GB hard disk en cuatro particiones de 256K cada una.</P>
<P>- La partici&oacute;n original es formateada con un tama&ntilde;o del cluster de 16KB.</P>
<P>- La primera divisi&oacute;n es dividida en 256KB / 768KB. El tama&ntilde;o del cluster de la primera partici&oacute;n quedan 16KB, aunque 4 KB ser&aacute;n suficientes, Solo pueden ser cambiadas reformate&aacute;ndolas, ver A04.</P>
<P>- La nueva partici&oacute;n de 768KB es formateada, todav&iacute;a con un tama&ntilde;o del cluster de 16KB.</P>
<P>- La segunda divisi&oacute;n es hecha en 256KB / 256KB / 256KB.</P>
<P>-La tercera partici&oacute;n es formateada con un cluster de un tama&ntilde;o de 8KB.</P>
<P>- La tercera divisi&oacute;n es hecha en 256KB / 256KB / 256KB.</P>
<P>- La cuarta partici&oacute;n es formateada con un cluster de un tama&ntilde;o de 4KB.</P>
<P>- Ahora tienes los cluster de los tama&ntilde;os: 16K - 16K - 8K - 4K.</P>
<P>- Como las particiones segunda y tercera est&aacute;n todav&iacute;a vacias, esto es posible reformate&aacute;ndolas a un tama&ntilde;o de cluster de 4K. Ver A04 para detalles sobre el formateo.</P>
<P><B>Q06. FIPS crea por defecto una segunda partici&oacute;n DOS primaria. ¿Est&aacute; esto permitido? </B></P>
<P>A06. Hecha un vistazo a la secci&oacute;n " que hace FIPS " en FIPS.DOC para debatir este punto.</P>
<P><B>Q07. ¿Que significa el mensaje " Info: partition table inconsistency"?</B></P>
<P>A07. La partici&oacute;n de la tabla en el sector de arranque maestra est&aacute; formado por cuatro entradas con diferentes campos cada una . Lo raro sobre esta tabla es que algunos de los datos son redundantes.</P>
<P>Los valores del principio y del final (Head/ cylinder/ sector) pueden ser calculadas a partir del sector de arranque y el n&uacute;mero de sectores (despu&eacute;s de preguntar sobre el n&uacute;mero de BIOS de cabezas y el n&uacute;mero de sectores por pista), de hecho esto es lo que hace DOS. Este campo est&aacute; completamente en desuso por DOS ( y los otros sistemas operativos que conozco ), entonces podr&aacute;n ponerlos a cero. Sin embargo, no hace da&ntilde;o tenerlos de forma coherente. </P>
<P>Cuando fdisk crea una partici&oacute;n de la tabla de entrada, deber&iacute;a introducir los valores correctos en estos campos. Ahora, ¿como puede existir una inconsistencia? Hay por lo menos dos posibilidades:
<OL>
<LI>Algunos programas de fdisk parecen escribir valores incorrectos, especialmente el final de los cilindros que est&aacute;n fuera por uno o dos. </LI>
<LI>Puedes tener un EIDE drive que emplee traducci&oacute;n de direcciones. Los discos modernos normalmente tienen mas de 1024 cilindros, pero DOS no permite usar m&aacute;s de 1024. Esto hizo a los fabricantes de controladoras de disco emplear un truco: Reducen el numero de cilindros y aumentan el n&uacute;mero de cabezas cuando el DOS pregunta por la geometr&iacute;a del disco. Entonces DOS piensa que tiene un drive con, por ejemplo 63 sectores, 32 cabezales y 1000 cilindros, cuando los valores correctos son 63 sectores, 16 heads, 2000 cilindros. Ahora, si DOS pregunta por el primer sector del cilindro 500, realmente consigue el primer sector del cilindro 1000. Este truco se llama address translation. Algunos de las unidades m&aacute;s nuevas de discos EIDE permiten que la address translation se conecte y se anule en la BIOS. En algunos casos esto cambia despu&eacute;s que el disco es formateado. Esto significa que la geometr&iacute;a que el DOS obtiene cuando consulta al controlador de disco difiere de la geometr&iacute;a con la que la unidad fue formateada y que se refleja en la tabla de partici&oacute;n. Esto no es un problema para DOS, pero si lo era para FIPS hasta la versi&oacute;n 1.4. En la versi&oacute;n actual, si FIPS detecta esta clase de problemas, adaptar&aacute; la tabla de partici&oacute;n a la geometr&iacute;a de disco alterada. </LI>
</OL>
</P>
<P><B>Q08. FIPS muestra un mensaje de error y se niega a trabajar. ¿Qu&eacute; debo hacer? </B></P>
<P>A08. Aunque esta completamente resuelto en <CODE>FIPS.DOC</CODE>, no puedo realzarlo suficientemente: si me mandas correo , por favor incluye el _DEBUG SCRIPT_ que puedes producir con la opci&oacute;n<EM> -d</EM>. Si no tendr&eacute; que ped&iacute;rsela, y me llevar&aacute; mucho tiempo resolver tu problema.</P>
<P><B>Q09. FIPS no reconoce mi disco SCSI. </B></P>
<P>A09. Existen unos adaptadores SCSI antiguos que necesita un driver que se carga en el <CODE>config.sys</CODE> antes de acceder al disco. Este dispositivo &oacute; driver no proporciona una conexi&oacute;n a nivel de la BIOS si no que lo realiza a nivel DOS con el disco duro (para los t&eacute;cnicos : se cuelga de la interrupci&oacute;n 21h en lugar de la interrupci&oacute;n de la BIOS 13h). Esto significa que la tabla de partici&oacute;n solo puede ser accesible por un programa fdisk especial que sepa sobre adaptadores internos. FIPS no trabajar&aacute; con estos drivers (de hecho DOS tampoco). Posiblemente existen drivers nuevos para el adaptador que proporcionen un interface a nivel de la BIOS. pregunta al fabricante.</P>
<P><B>Q10. FIPS s&oacute;lo reconoce una partici&oacute;n tipo 56h y ninguna DOS</B></P>
<P>A10. Tienes Ontrack disk manager instalado. Lee la secci&oacute;n adecuada en <CODE>SPECIAL.DOC.</CODE></P>
<P><B>Q11. FIPS parece trabajar bien, y DOS reconoce la nueva partici&oacute;n, pero el fdisk de Linux reconoce una sola partici&oacute;n.</B></P>
<P>A11. De alguna manera DOS monta una tabla de partici&oacute;n distinta a la del disco maestro.</P>
<P>Hay dos posibles razones :
<OL>
<LI>usas un mecanismo driver como ontrack disk manager. Ver el documento <CODE>SPECIALDOC</CODE>. </LI>
<LI>Tienes un virus en el boot record maestro. Esto no suele pasar, pero es posible. Algunos de los virus se instalan ellos solos en el MBR y copian el MBR original a otro sitio. Cuando DOS intenta acceder a la tabla de partici&oacute;n, el virus intercepta el BIOS llamando y devolviendo la copia de seguridad, para esconderse de una posible detecci&oacute;n. Comprueba esto con un scanner de virus despu&eacute;s de arrancar con un disco de arranque DOS limpio. Puedes quitar un virus desde el MBR usando el fdisk del DOS con la opci&oacute;n /mbr, pero ten cuidado en caso de que la tabla de partici&oacute;n de seguridad no sea recuperada. Por esta raz&oacute;n el boot sector tendr&aacute; la nueva informaci&oacute;n cambiada por FIPS, pero la tabla de partici&oacute;n tendr&aacute; la configuraci&oacute;n original. Esta incoherencia deber&aacute; ser corregida ( e.g con un editor de discos).</LI>
</OL>
</P>
<P><B>Q12. ¿Funciona FIPS con Windows 95?</B> </P>
<P>A.12 S&iacute;. El sistema de archivo para Windows 95 es el mismo que para DOS. La &uacute;nica diferencia es que los nombres de archivo son m&aacute;s largos, pero FIPS trabaja en un nivel inferior al de los
directorios, por lo que no es problema. Algunas personas han informado que FIPS ha funcionado sin problemas con particiones windows95. </P>

<HR>
<A HREF="FIPS-Como-12.html">Anterior</A>
<A HREF="FIPS-Como-14.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc13">Indice</A>
</BODY>
</HTML>
