<HTML>
<HEAD>
<TITLE>FIPS El primer Fragmentador Interactivo de ParticioneS de disco : Opciones ajustables </TITLE>
</HEAD>
<BODY>
<A HREF="FIPS-Como-9.html">Anterior</A>
<A HREF="FIPS-Como-11.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc10">Indice</A>
<HR>
<H2><A NAME="s10">10. Opciones ajustables </A></H2>


<P>Esta es la explicaci&oacute;n de los modificadores de linea de FIPS. Si prefiere el estilo DOS, puede usar '/ ' en lugar de '-' como el car&aacute;cter indicador de la opci&oacute;n. Las opciones se pueden combinar de forma arbitraria. Teclee <EM>fips -help</EM> para obtener un listado de las opciones. A continuaci&oacute;n una explicaci&oacute;n m&aacute;s detallada:
<UL>
<LI><EM>-t -test</EM>: modo prueba (no escribe a disco) No requiere mucha explicaci&oacute;n.</LI>
<LI><EM>-d o -debug</EM>: modo depuraci&oacute;n. En este modo, se escribe una completa transcripci&oacute;n de la sesi&oacute;n en el archivo <CODE>FIPSINFO.DBG</CODE> en el directorio de trabajo. Puede enviar este fichero en caso de problemas (ver abajo). </LI>
<LI><EM>-h o -help</EM>: P&aacute;gina de ayuda, un corto resumen de las opciones. </LI>
<LI><EM>-n &lt;num</EM>&gt;: seleccione unidad &lt;num&gt; . Preseleccione el n&uacute;mero de unidad con esta opci&oacute;n. Los n&uacute;meros v&aacute;lidos se encuentra entre 128 y 255. Esto tambi&eacute;n se puede usar para obviar la detecci&oacute;n autom&aacute;tica de la unidad, si por cualquier causa FIPS no encuentra la unidad, puede probar esta opci&oacute;n.</LI>
<LI><EM>-p &lt;num&gt;</EM>: seleccionar la partici&oacute;n &lt;numero&gt;. </LI>
<LI><EM>-c &lt;num&gt;</EM>: primer cilindro &lt;numero&gt;</LI>
<LI>-omb: eliminar "More than one Invalid bootable-flag". Hay algunos programas que admiten mas de una partici&oacute;n de arranque, simplemente usa la primera. Si tiene un programa as&iacute; en el sector ra&iacute;z y el PC arranca normalmente, debe usar esta opci&oacute;n para evitar el mensaje de error. Le recomiendo, sin embargo, borrar las banderas (flags) err&oacute;neas, si tiene el programa adecuado.</LI>
<LI><EM>-obf:</EM> eliminar "Invalid bootable-flag"'bandera de arranque inv&aacute;lido'. Al modificar la bandera de arranque es te&oacute;ricamente posible arrancar desde un segundo disco. Si tiene esta configuraci&oacute;n, emplee esta opci&oacute;n para evitar el mensaje de error.</LI>
<LI><EM>-ore</EM>: eliminar "Number of Rootdir entries must be multiple of 16" El DOS acepta un n&uacute;mero inv&aacute;lido de entradas del directorio ra&iacute;z. Si no tiene otro medio para corregir la entrada, debe usar esta opci&oacute;n para evitar este mensaje de error.</LI>
<LI><EM>-olf</EM>: eliminar "FAT too large". Como el n&uacute;mero de sectores por FAT es un n&uacute;mero de 2 bytes, es te&oacute;ricamente posible tener hasta 65535 sectores por FAT. Esto es aceptado por DOS, pero un n&uacute;mero mayor de 256 no es &uacute;til, ya que las FAT m&aacute;s grandes tienen 256 sectores.  </LI>
<LI><EM>- osf: </EM>eliminar "FAT too small". Si el n&uacute;mero de clusters en la partici&oacute;n es mayor que las entradas en la FAT, DOS s&oacute;lo usa parte de la partici&oacute;n. Algo ha ido muy mal con esta partici&oacute;n, pero no todo esta perdido: usa esta opci&oacute;n y reduce la nueva partici&oacute;n a un tama&ntilde;o para que sea usada adecuadamente.</LI>
<LI><EM>-omd</EM>: eliminar 'Wrong Media Descriptor Byte in FAT/Bootsector'. El byte descriptivo del medio deber&iacute;a ser F8h para discos duros, pero DOS acepta otros valores, as&iacute; que puedes olvidarte de este mensaje con esta opci&oacute;n.</LI>
</UL>
</P>
<HR>
<A HREF="FIPS-Como-9.html">Anterior</A>
<A HREF="FIPS-Como-11.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc10">Indice</A>
</BODY>
</HTML>
