<HTML>
<HEAD>
<TITLE>FIPS El primer Fragmentador Interactivo de ParticioneS de disco : Despu&eacute;s de fraccionar la partici&oacute;n </TITLE>
</HEAD>
<BODY>
<A HREF="FIPS-Como-8.html">Anterior</A>
<A HREF="FIPS-Como-10.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc9">Indice</A>
<HR>
<H2><A NAME="s9">9. Despu&eacute;s de fraccionar la partici&oacute;n </A></H2>


<P>Aseg&uacute;rese que los cambios han sido escritos en el disco. Si se ha empleado una cach&eacute; de disco como <CODE>Smartdrive</CODE> (a pesar de mi recomendaci&oacute;n expl&iacute;cita de no hacerlo), espere unos segundos para que la memoria cach&eacute; se vuelque al disco. La nueva partici&oacute;n ser&aacute; reconocida por DOS despu&eacute;s de reinicializar el ordenador. NO ESCRIBA NADA AL DISCO ANTES DE ARRANCAR. Despu&eacute;s de rearrancar use <CODE>CHKDSK</CODE> or <CODE>Norton Disk Doctor</CODE> para asegurarse que su vieja ( y ahora m&aacute;s peque&ntilde;a) partici&oacute;n esta bien. Ha habido casos donde las modificaciones realizadas por FIPS no fueron escritas correctamente. Para asegurarse que &eacute;ste no es el caso, ejecuta FIPS con la opci&oacute;n -t (modo prueba) despu&eacute;s de reinicializar. Seleccione la unidad y la partici&oacute;n que ha fragmentado. Si FIPS no muestra ning&uacute;n error hasta la secci&oacute;n de elecci&oacute;n del cilindro, no hay ning&uacute;n problema y puede detener el programa con CTRL-C. En caso contrario debe deshacer los cambios con <CODE>RESTORRB </CODE>y ponerte en contacto conmigo v&iacute;a E-mail.</P>
<P>Si no ve ning&uacute;n error ya puede ahora arrancar con los ficheros habituales <CODE>autoexec.bat y config.sys</CODE>. Ejecute algunos programas y aseg&uacute;rese que todav&iacute;a puede leer su datos. Si queres usar la nueva partici&oacute;n bajo DOS, debes formatearla. Si tiene varias particiones, aseg&uacute;rese de formatear la unidad correcta, las letras pueden haber cambiado.</P>
<P>Si quiere usar la partici&oacute;n bajo Linux, debe cambiar el byte indicador del sistema con el fdisk de Linux, use a continuaci&oacute;n <CODE>MKFS</CODE>. Si quiere fragmentar la nueva partici&oacute;n de nuevo en dos m&aacute;s peque&ntilde;as, deber&aacute; formatearla bajo DOS, en caso contrario FIPS se quejar&aacute;.</P>
<HR>
<A HREF="FIPS-Como-8.html">Anterior</A>
<A HREF="FIPS-Como-10.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc9">Indice</A>
</BODY>
</HTML>
