<HTML>
<HEAD>
<TITLE>FIPS El primer Fragmentador Interactivo de ParticioneS de disco : ¿Que se necesita para usar FIPS? </TITLE>
</HEAD>
<BODY>
<A HREF="FIPS-Como-1.html">Anterior</A>
<A HREF="FIPS-Como-3.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. ¿Que se necesita para usar FIPS? </A></H2>


<P>Necesitas un programa de defragmentaci&oacute;n de archivos para mover todo los datos al principio del disco duro. FIPS sol&oacute; dividir&aacute; la partici&oacute;n si se dispone de suficiente espacio al final del disco. Las versiones DOS a partir de la 6.0 incluyen <CODE>DEFRAG</CODE> que es adecuado para este prop&oacute;sito. Hay otros programas tambi&eacute;n v&aacute;lidos como <CODE>Norton Speedisk</CODE> (efectivamente <CODE>DEFRAG es speedisk</CODE> con menos funciones, con licencia Norton), <CODE>PCTools Compress, DISKOPT</CODE> en Novel DOS 7, o programas shareware <CODE>ORG, DOG o SAFPAK </CODE>(disponibles v&iacute;a FTP an&oacute;nimo de cualquier mirror en el directorio de utilidades de disco). No he probado estas &uacute;ltimas, o sea no me culpen si no les funcionan. Tambi&eacute;n se deber&iacute;a usar un programa como <CODE>Doctor Norton Disk</CODE> (o <CODE>SCANDISK </CODE>en DOS 6.2) para comprobar el estado del disco antes de usar FIPS.</P>
<P>FIPS fue desarrollado bajo la versi&oacute;n 5.0 de DOS. Deber&iacute;a funcionar bien con cualquier versi&oacute;n a partir de la 3.0, tal vez incluso la 2.0. Sin embargo no ser&aacute;  muy &uacute;til con versiones mas antiguas del DOS ya que s&oacute;lo se dispone de particiones de gran tama&ntilde;o a partir de DOS 4. Funciona bien con DOS 6.0 y 6..2 y Novell DOS 7. Tambi&eacute;n me han informado sobre su empleo satisfactorio con particiones de Windows95. Obs&eacute;rvese que los nombres de fichero largos no son un problema para FIPS, porque funciona en un nivel m&aacute;s bajo donde la estructura de directorios no es importante. Es probablemente muy sensato probar un disquete de arranque DOS antes de usar FIPS.</P>
<HR>
<A HREF="FIPS-Como-1.html">Anterior</A>
<A HREF="FIPS-Como-3.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc2">Indice</A>
</BODY>
</HTML>
