<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <TITLE>lf152, Applications: Crear documentos PDF con DocBook</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG
alt="[Photo of the Author]" height=102
src="../../common/images/EgonWillighagen.jpg" width=79>
<BR>por  <A href="mailto:egon.w@linuxfocus.org">Egon Willighagen</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>En 1999 se uni&oacute; al grupo alem&aacute;n de LF y a principios de este a&ntilde;o se transform&oacute;
en su segundo editor. Es estudiante de qu&iacute;mica anal&iacute;tica de la Universidad de Nijmegen.
Juega al basket y disfruta haciendo excursiones.
</P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">&iquest;Qu&eacute; es DocBook?</A></LI>
  <LI><A HREF="#lfindex1">Escribir un art&iacute;culo</A></LI>
  <LI><A HREF="#lfindex2">A&ntilde;adir texto e informaci&oacute;n adicional</A></LI>
  <LI><A HREF="#lfindex3">Convertir el documento a PDF</A></LI>
  <LI><A HREF="#lfindex4">Observaciones finales</A></LI>
  <LI><A HREF="#lfindex5">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=152&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Crear documentos PDF con DocBook</H2>
 <IMG alt=[Illustration] height=100 hspace=10 src="../../common/images/illustration152.gif" width=100>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

El presente art&iacute;culo explica c&oacute;mo
usar DocBook para crear documentos PDF. Abarca tanto las herramientas de edici&oacute;n
como las que se necesitan para la conversi&oacute;n al formato PDF. Puesto que
s&oacute;lo se citan los programas y no se dan detalles sobre su instalaci&oacute;n
est&aacute; dirigido principalmente a usuarios avanzados de Linux.
<P>
La primera parte se centrar&aacute; en el formato de los
documentos DocBook.  Tras una breve introducci&oacute;n, se explicaran las herramientas necesarias para convertirlos
en documentos PDF y as&iacute; poder verlos con el Acrobat Reader.

</P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>&iquest;Qu&eacute; es DocBook?</H2>

<P>DocBook <A
href="#ref1">[1]</A>
es una aplicaci&oacute;n SGML desarrollada para el marcado de documentos. A diferencia
del HTML, DocBook no ofrece ninguna informaci&oacute;n sobre el formato del documento y es por esta raz&oacute;n que se necesita
de una conversi&oacute;n previa para poder visualizarlo. La conversi&oacute;n se realiza con
herramientas que aplican una determinada hoja de estilo al documento DocBook. </P>
<P>
<CENTER><IMG src="../../common/images/article152conversion.gif">
<BR>&nbsp;<BR>Figura 1: Conversi&oacute;n de DocBook a PDF con una hoja de estilo
</CENTER>
<P></P>
<P>Posteriormente se explicar&aacute; el tipo de hoja de estilo que debe usarse para la
conversi&oacute;n y la herramienta necesaria para ello. </P>
<A NAME="lfindex1">&nbsp;</A>
<H2>Escribir un art&iacute;culo</H2>

<P>DocBook es capaz de trabajar con dos tipos de documentos: art&iacute;culos y libros. Puesto que
en esencia son id&eacute;nticos, emplear&eacute; como ejemplo el marcado de un art&iacute;culo.
Previamente dar&eacute; una descripci&oacute;n b&aacute;sica de DocBook. </P>
<P>DocBook es en principio una aplicaci&oacute;n SGML al igual que el HTML. Pero tambi&eacute;n existe
una versi&oacute;n XML que si bien es m&aacute;s limitada, es m&aacute;s f&aacute;cil de leer
y , por lo tanto, m&aacute;s f&aacute;cil de aprender. Puesto que el XML es en s&iacute; mismo una aplicaci&oacute;n SGML, se
pueden seguir usando las herramientas del SGML. La principal diferencia entre ambas variantes
son las siguientes (y &eacute;sto es v&aacute;lido para cada aplicaci&oacute;n XML):
<UL>
  <LI>las etiquetas XML deben estar siempre enmarcadas.
  <LI>las etiquetas XML deben anidarse de manera adecuada.
</UL>
Lo primero significa que no se
puede usar &lt;BR&gt; como en el HTML, sino &lt;BR&gt;&lt;/BR&gt;.
El segundo
requisito significa que no se puede escribir
&lt;B&gt;&lt;A&nbsp;HREF="alguna_url"&gt;hacer click aqu&iacute;&lt;/B&gt;&lt;/A&gt; sino anidar
las etiquetas correctamente: &lt;B&gt;&lt;A&nbsp;HREF="alguna_url"&gt; hacer click
aqu&iacute;&lt;/A&gt;&lt;/B&gt;.

<P>Teniendo en cuenta estas importantes formalidades, podemos empezar a escribir
art&iacute;culos con DocBook.
<PRE>&lt;?xml version="1.0"?&gt;
    &lt;article&gt;
      &lt;title&gt;Escribir art&iacute;culos DocBook&lt;/title&gt;
      &lt;artheader&gt;
        &lt;abstract&gt;
          El presente art&iacute;culo explica como usar DocBook para crear documentos PDF
          y cubre las herramientas necesarias para editar documentos DocBook
          y transformarlos al formato PDF.
        &lt;/abstract&gt;
        &lt;author&gt;
          &lt;firstname&gt;Egon&lt;/firstname&gt;
          &lt;surname&gt;Willighagen&lt;/surname&gt;
        &lt;/author&gt;
        &lt;date&gt;&lt;/date&gt;
      &lt;/artheader&gt;
    &lt;/article&gt;
</PRE>
<P></P>
<P>Se dir&iacute;a que no es muy dif&iacute;cil. Hemos comenzado con un art&iacute;culo con su t&iacute;tulo, un breve
resumen, la fecha en que fue escrito y el nombre de su autor.</P>

<P>El siguiente paso consiste en a&ntilde;adir secciones al art&iacute;culo haciendo uso de etiquetas de
secci&oacute;n (&lt;section&gt;, &lt;/section&gt;):
<PRE>&lt;?xml version="1.0"?&gt;
    &lt;article&gt;
      &lt;title&gt;Escribir art&iacute;culos DocBook&lt;/title&gt;
      &lt;artheader&gt;
        ... Encabezado del art&iacute;culo ...
      &lt;/artheader&gt;

      &lt;section&gt;
        &lt;title&gt;Introducci&oacute;n&lt;/title&gt;
      &lt;/section&gt;

      ... otras secciones ...

    &lt;/article&gt;
</PRE>
<P>Al art&iacute;culo se le ha agregado una secci&oacute;n <I>Introducci&oacute;n</I>. Se pueden a&ntilde;adir
m&aacute;s secciones para obtener <I>Resultados</I>, <I>Conclusi&oacute;n</I>, etc.</P>

<A NAME="lfindex2">&nbsp;</A>
<H2>A&ntilde;adir texto e informaci&oacute;n adicional</H2>

<P>Todo el texto est&aacute; contenido entre etiquetas de p&aacute;rrafo (&lt;para&gt;, &lt;/para&gt;),
comparables a los elementos &lt;P&gt;&lt;/P&gt; del 'HTML':
<PRE>
&lt;section&gt;
      &lt;title&gt;Introducci&oacute;n&lt;/title&gt;
      &lt;para&gt;
        DocBook es una aplicaci&oacute;n SGML desarrollada para el marcado de texto,
        al igual que el HTML lo es para el marcado de documentos web.
      &lt;/para&gt;
&lt;/section&gt;
</PRE>
<P>Pero adem&aacute;s de las etiquetas de p&aacute;rrafo est&aacute;n disponibles una gran cantidad de otras etiquetas.
En lo que resta de esta secci&oacute;n se explicar&aacute; como insertar en el art&iacute;culo ejemplos,
listas, gr&aacute;ficos, etc.
</P>
<B>A&ntilde;adir ejemplos</B><BR>
<P>Los ejemplos se pueden agregar mediante el uso de etiquetas de ejemplo (&lt;example&gt;,
&lt;/example&gt;), como se muestra a continuaci&oacute;n:
<UL><PRE>&lt;example&gt;
  &lt;title&gt;Programa en Perl que convierte un documento XML en una p&aacute;gina HTML.&lt;/title&gt;
  &lt;programlisting&gt;
    #!/usr/bin/perl -w
    use diagnostics;
    use strict;
    use XML::XSLT;

    my $XSLTparser = XML::XSLT-&gt;new();
    $XSLTparser-&gt;open_project ("file.xml", "stylesheet.xsl", "FILE", "FILE");
    $XSLTparser-&gt;process_project;
    $XSLTparser-&gt;print_result();
  &lt;/programlisting&gt;
&lt;/example&gt;
</PRE></UL>Cabe destacar que el ejemplo puede a su vez contener texto, gr&aacute;ficos u otra informaci&oacute;n.
<P></P><B>A&ntilde;adir listas</B><BR>
<P>Al igual que en el HTML, DocBook tambi&eacute;n puede contener listas. Las listas se definen mediante
la etiqueta de listas no ordenadas (&lt;itemizedlist&gt;, &lt;/itemizedlist&gt;) que contiene una o
m&aacute;s etiquetas de items (&lt;listitem&gt;, &lt;/listitem&gt;):
<UL><PRE>&lt;itemizedlist&gt;
  &lt;listitem&gt;
    &lt;para&gt;an item&lt;/para&gt;
  &lt;/listitem&gt;
  &lt;listitem&gt;
    &lt;para&gt;another item&lt;/para&gt;
  &lt;/listitem&gt;
  &lt;listitem&gt;
    &lt;para&gt;and again an item&lt;/para&gt;
  &lt;/listitem&gt;
  &lt;/itemizedlist&gt;
</PRE></UL>Observes&eacute; que aqu&iacute; tambi&eacute;n el texto est&aacute; contenido en una etiqueta de p&aacute;rrafo. &iexcl;El texto
debe siempre estar contenido dentro de esta etiqueta!
<P></P>
<P>Asimismo las listas pueden ordenarse. En este caso se puede usar la etiqueta de listas ordenadas
(&lt;orderedlist&gt;, &lt;/orderedlist&gt;) en vez de la etiqueta de listas no ordenadas.
Agregando un par&aacute;metro num&eacute;rico (ej.&lt;orderedlist numeration="Arabic"&gt;) se puede obtener
una lista numerada.
</P><B>A&ntilde;adir gr&aacute;ficos</B><BR>
<P>Se pueden poner im&aacute;genes en el art&iacute;culo:
<UL><PRE>&lt;mediaobject&gt;
&lt;imageobject&gt;
&lt;imagedata fileref="alguna_imagen.gif" format="gif"/&gt;
&lt;/imageobject&gt;
&lt;textobject&gt;
  &lt;para&gt;
    Si no se est&aacute; usando &lt;productname&gt;Lynx&lt;/productname&gt;
    se puede ver un gr&aacute;fico.
  &lt;/para&gt;
&lt;/textobject&gt;
&lt;/mediaobject&gt;
</PRE></UL>Como puede verse junto al texto aparece la imagen elegida. De hecho
pudiera haber agregado una pel&iacute;cula.
<!-- The stylesheet processor that
would convert the DocBook document into PDF could then choose the best medium,
which would probably be the picture. -->

<P>N&oacute;tese tambi&eacute;n que la palabra <I>Lynx</I> est&aacute; resaltada. &Eacute;ste es un rasgo
caracter&iacute;stico de los lenguajes de marcado en donde el formato est&aacute; separado de la
informaci&oacute;n. El art&iacute;culo establece que Lynx es un producto. Posteriormente
la hoja de estilo establecer&aacute; que el nombre del producto debe mostrarse en
un formato espec&iacute;fico, por ejemplo, en cursiva. En la siguiente secci&oacute;n veremos
algunos m&eacute;todos de marcado de palabras.
</P><B>Marcado de palabras</B><BR>
<P>Como hemos visto en el ejemplo de arriba, se pueden resaltar palabras. En la siguiente
tabla se muestran algunas etiquetas de marcado aplicadas a palabras:
<UL>
  <TABLE>
    <TBODY>
    <TR bgColor=green>
      <TH>Etiqueta
      <TH>Descripci&oacute;n</TR>
    <TR bgColor=#ffff99>
      <TD vAlign=top>abbrev
      <TD>Una abreviatura, en particular una terminada en punto.
        <BR><I>Ejemplo:</I><BR>&lt;para&gt;&lt;abbrev&gt;ej.&lt;/abbrev&gt;
        significa por ejemplo.&lt;/para&gt; </TD>
    <TR bgColor=#ffff99>
      <TD vAlign=top>acronym
      <TD>Un acr&oacute;nimo
        <BR><I>Ejemplo:</I><BR>&lt;para&gt;&lt;acronym&gt;DSM&lt;/acronym&gt;
        (compa&ntilde;&iacute;a qu&iacute;mica) significa "De StaatsMijnen" (Minas del Estado en alem&aacute;n).
        &lt;/para&gt; </TD>
    <TR bgColor=#ffff99>
      <TD vAlign=top>email
      <TD>La direcci&oacute;n electr&oacute;nica de una persona<BR><I>Ejemplo:</I><BR>&lt;para&gt;Mi
        email es &lt;email&gt;egon.w@linuxfocus.org&lt;/email&gt;&lt;/para&gt;
      </TD>
    <TR bgColor=#ffff99>
      <TD vAlign=top>keyword
      <TD>Palabras claves del art&iacute;culo<BR><I>Ejemplo:</I><BR>&lt;para&gt;En mi
        humilde opini&oacute;n  &lt;keyword&gt;la qu&iacute;mica&lt;/keyword&gt; es muy
        importante.&lt;/para&gt; </TD></TR></TBODY></TABLE></UL>Y una gran cantidad
        de otras etiquetas que est&aacute;n listadas en una completa hoja de referencia <A
        href="#ref4">[2]</A>.
<P></P>
<P>Tras esta breve introducci&oacute;n a las etiquetas de DocBook, estamos en condiciones
de crear los documentos PDF.</P>
<A NAME="lfindex3">&nbsp;</A>
<H2>Convertir el documento a PDF</H2>

<P>Una vez obtenido el documento DocBook, podemos convertilo a distintos formatos.
Adem&aacute;s del PDF, se puede convertir en documento PostScript, en archivo fuente Tex
o en documento RTF (Formato de texto enriquecido) que puede leerse con WordPerfect, Word,
StarWriter y otros procesadores de texto. Sin embargo, en el presente art&iacute;culo
haremos &uacute;nicamente hincapi&eacute;  en la conversi&oacute;n a documento PDF.</P>
<P>Los documentos DocBook se pueden escribir con cualquier editor tales como Vi y Enedit. Mejor
a&uacute;n con Emacs: Norman Walsh ha escrito un modo mayor de Emacs para DocBook <A
href="#ref5">[3]</A>
que agrega ciertas funcionalidades &uacute;tiles como el poder completar el nombre de las etiquetas
o insertar plantillas. Antes de crear tu propio art&iacute;culo de prueba, puedes bajarte
docbook_article.xml mi
versi&oacute;n que contiene los ejemplos dados en este art&iacute;culo. </P>
<P>Como he explicado al principio se necesita tanto una hoja de estilo como una herramienta
que haga uso de ella para convertir el art&iacute;culo DocBook en formato PDF.
De hecho la hoja de estilo no hace la conversi&oacute;n de manera autom&aacute;tica sino
que requiere de un paso intermedio con TeX. Las hojas de estilo que usaremos
son las Hojas de Estilo Modulares de DocBook de Norman Walsh <A
href="#ref6">[4]</A>
escritas en DSSSL.</P>

<P>Para emplear en el proceso de conversi&oacute;n las hojas de estilo en DSSSL, se necesita un
procesador DSSSL. El procesador que utilic&eacute; se denomina Jade
<A href="#ref7">[5]</A>
que fue desarrollado por James Clark (actualmente ha dejado de brindar soporte a esta
herramienta). Fue reemplazado por OpenJade
<A href="#ref8">[6]</A>,
una utilidad que a&uacute;n no he tenido  posibilidad de probar. </P>
<UL><B>N&oacute;tese que los paquetes de Hojas de Estilo Modular, Jade y JadeTex
  (ver arriba) est&aacute;n disponibles en todas las distribuciones que usan paquetes (tales como
  RedHat, Suse, Corel y Debian). &iexcl;Por lo tanto verifiquen primero el disco de instalaci&oacute;n
  o la p&aacute;gina web de su distribuci&oacute;n!</B></UL>
<P></P>
<P>En mi sistema Debian las Hojas de Estilo Modular de Walsh para conversiones a PDF se
encuentran instaladas en /usr/lib/sgml/stylesheets/dsssl/docbook/nwalsh/print/ y son accesibles
desde Jade mediante el par&aacute;metro "-d". Por otra parte, la opci&oacute;n "-t" indica a Jade que use a TeX
para obtener el documento final:
<UL><PRE>egonw@localhost&gt; ls -al
total 3
-rw-r--r--    1 egonw    egonw        2887 Apr  8 22:06 docbook_article.xml
egonw@localhost&gt; jade -t tex -d /usr/lib/sgml/stylesheets/dsssl/docbook/nwalsh/print/docbook.dsl docbook_article.xml
egonw@localhost&gt; ls -al
total 21
-rw-r--r--    1 egonw    egonw        2887 Apr  8 22:06 docbook_article.xml
-rw-r--r--    1 egonw    egonw       17701 Apr  8 22:29 docbook_article.tex
</PRE></UL>Como pueden ver, Jade genera un archivo TeX que se puede convertir a PDF
con la herramienta pdfjadetex que acompa&ntilde;a al paquete JadeTeX
<A
href="#ref9">[7]</A>:

<UL><PRE>egonw@localhost&gt; ls -al
total 21
-rw-r--r--    1 egonw    egonw        2887 Apr  8 22:06 docbook_article.xml
-rw-r--r--    1 egonw    egonw       17701 Apr  8 22:29 docbook_article.tex
egonw@localhost&gt; pdfjadetex docbook_article.tex
</PRE></UL>Esto crea un agradable 
docbook_article.pdf.
Notemos que se han agregado un mont&oacute;n de detalles tales como el t&iacute;tulo al comienzo de cada
p&aacute;gina y el uso de diferentes fuentes para el listado del programa. Cuando empez&eacute; a trabajar con
DocBook la mayor&iacute;a del tiempo la dediqu&eacute; en comprender todas las combinaciones posibles.
Este art&iacute;culo muestra solamente una de ellas.
<P></P>
<A NAME="lfindex4">&nbsp;</A>
<H2>Observaciones finales</H2>

<P>El lenguaje DocBook XML es muy amplio y los m&eacute;todos para convertir los documentos en otros
formatos son diversos. Este art&iacute;culo s&oacute;lo proporciona una peque&ntilde;&iacute;sima
introducci&oacute;n. Las preguntas pueden formularse en la p&aacute;gina de consulta de este art&iacute;culo.
M&aacute;s informaci&oacute;n se puede encontrar en las referencias <A
href="#ref2">[8]</A>
y <A href="#ref3">[9]</A>.
&iexcl;F&iacute;jense que esta &uacute;ltima referencia ha sido completamente escrita en DocBook! </P>
<P>Los t&oacute;picos avanzados que no han sido cubiertos por el presente art&iacute;culo pero que est&aacute;n
disponibles con DocBook son:
<UL>
  <LI>manejo de informaci&oacute;n bibliogr&aacute;fica
  <LI>creaci&oacute;n de enlaces a otras secciones </LI>
</UL>Estos temas quiz&aacute;s sean tratados en un futuro art&iacute;culo.
<P></P>
<A NAME="lfindex5">&nbsp;</A>
<H2>Referencias</H2>

<P>
<OL>
<li>
<A href="http://www.docbook.org/">http://www.docbook.org/</A> La p&aacute;gina web de DocBook.
<li><A href="http://nwalsh.com/docbook/defguide/qr/quickref.htm">
http://nwalsh.com/docbook/defguide/qr/quickref.htm</A> Referencia
R&aacute;pida: las Etiquetas de DocBook.
<li><A href="http://nwalsh.com/emacs/docbookide/index.html">
http://nwalsh.com/emacs/docbookide/index.html</A> Modo mayor de Emacs
para DocBook
<li><A href="http://nwalsh.com/docbook/dsssl/index.html">
http://nwalsh.com/docbook/dsssl/index.html</A> Las Hojas de Estilo Modular de DocBook.
<li><A href="http://www.jclark.com/jade/">http://www.jclark.com/jade/</A> Jade.
<li><A href="http://openjade.sourceforge.net/"> http://openjade.sourceforge.net/</A> OpenJade.
<li><A href="http://www.tug.org/applications/jadetex/"> http://www.tug.org/applications/jadetex/</A> JadeTeX.
<li><A href="http://nwalsh.com/docbook/"> http://nwalsh.com/docbook/</A> P&aacute;gina web de Norman Walsh sobre DocBook.
<li><A href="http://www.oreilly.com/catalog/docbook/chapter/book/docbook.html">
http://www.oreilly.com/catalog/docbook/chapter/book/docbook.html</A> DocBook:
La Gu&iacute;a Definitiva sobre la
variante del SGML.
</ol>



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=152&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Egon Willighagen, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article152.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:egon.w@linuxfocus.org"><FONT COLOR="#FFFFFF">Egon Willighagen</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:wecharri@yahoo.com"><FONT COLOR="#FFFFFF">Walter Echarri</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-03-30, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
