<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>lf155, System Administration: Virtual Network Computing, o VNC</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="[Photo of the Author]" HEIGHT=147 WIDTH=126>
<BR>por  <A HREF="mailto:gete@wanadoo.fr">Georges Tarbouriech</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Georges es un usuario viejo de Unix (comercial y libre).
VNC ha cambiado su vida :-).
</P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Presentaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex2">Lado servidor</A></LI>
  <LI><A HREF="#lfindex3">Lado cliente (el viewer)</A></LI>
  <LI><A HREF="#lfindex4">&iexcl;A divertirse!</A></LI>
  <LI><A HREF="#lfindex5">Nos ponemos serios</A></LI>
  <LI><A HREF="#lfindex6">Seguridad</A></LI>
  <LI><A HREF="#lfindex7">Sanseacab&oacute;</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=155&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Virtual Network Computing, o VNC</H2>
 <IMG SRC="../../common/images/vnc.gif" ALT="[Illustration]" HSPACE=10 HEIGHT=64 WIDTH=64>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>
VNC es el sue&ntilde;o del administrador de redes hecho realidad. Podr&iacute;amos decir que
se trata de un sistema de visualizaci&oacute;n a distancia, pero es mucho m&aacute;s. Visitar
<a href="http://www.uk.research.att.com">http://www.uk.research.att.com</A>
permite descargar ese extraordinario software GRATIS. VNC se distribuye bajo
licencia GPL y es disponible para numerosas plataformas. Todos pueden
contribuir, y muchas adaptaciones a diferentes SO han sido realizado por
personas ajenas al proyecto.
<br>
Trataremos de descubrir los m&uacute;ltiples aspectos de VNC.
</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

A principios de 1999 AT&amp;T compr&oacute; el Olivetti Research Laboratory y prosigui&oacute; con el desarollo de VNC.
Como explican en el site de AT&amp;T, el apellido VNC viene del desarollo de "clientes finos", es decir
computadoras de redes (NC) funcionando seg&uacute;n la tecnolog&iacute;a ATM (Asynchronous Transfer Mode) y
"puesto que el cliente VNC (visor) es una versi&oacute;n software de &eacute;ste NC por ATM, permite la creaci&oacute;n
o la supresi&oacute;n de estaciones de trabajo al vuelo, hemos llamado a &eacute;ste sistema Virtual Network Computing
(Red virtual)".

<P>
Para usar VNC, necesitan una conexi&oacute;n TCP/IP, un servidor VNC (vncserver) y un cliente VNC (vncviewer)
para conectar con la m&aacute;quina en la cual el servidor VNC est&aacute; activo.
El servidor VNC basado en X funciona seg&uacute;n la arquitectura cliente-servidor del mismo X. De hecho
obtienen dos servidores en uno: un servidor X y un servidor VNC. Eso permite conservar el mismo n&uacute;mero
de visualizaci&oacute;n para el servidor X y el servidor VNC. Para conectar a un servidor VNC, tienen que dar
el apellido de la m&aacute;quina y el n&uacute;mero de visualizaci&oacute;n. El comando parece a "vncviewer nombredem&aacute;quina:2".
Es decir, si el servidor X tiene el n&uacute;mero 2, el servidor VNC tambi&eacute;n tiene el n&uacute;mero 2. Desde el cliente,
el viewer, pueden conectar al servidor usando &eacute;ste n&uacute;mero. Si un usuario trabaja en la visualizaci&oacute;n n&uacute;mero 1
y se conectan en el n&uacute;mero 2, no se dar&aacute; cuenta que trabajan en su m&aacute;quina.
VNC es capaz de encontrar el primer n&uacute;mero de visualizaci&oacute;n disponible e informar, pero nada
impide usar a otro n&uacute;mero. Si vncserver propone el n&uacute;mero 2, pueden conectar en la visualizaci&oacute;n 3,4...
si quieren  &eacute;ste n&uacute;mero al arrancar vncviewer.

<P>
En m&aacute;quinas bajo Windows ser&aacute; diferente pues no podr&aacute;n crear una nueva visualizaci&oacute;n. El
desktop estar&aacute; disponible a distancia. Si nos ponemos en el lugar del usuario trabajando
en su m&aacute;quina, podr&aacute; ver
todo lo que est&aacute;n haciendo, como si su ordenador funcionara s&oacute;lo:
el n&uacute;mero de visualizaci&oacute;n por defecto ser&aacute; 0. Si conectan dos m&aacute;quinas
NT entre ellas, no necesitan
precisar &eacute;ste n&uacute;mero.

<P>
VNC existe para numerosos SO diferentes, a veces &uacute;nicamente como cliente.
Es decir, s&oacute;lo el viewer
est&aacute; disponible. Es el caso de BeOS. Muchos Unices, MacOS, AmigaOS... pueden
usar VNC. Para ver todo lo disponible pueden ir a
<a href="http://www.uk.research.att.com/vnc/platforms.html">http://www.uk.research.att.com/vnc/platforms.html</A>

<P>
Seg&uacute;n la plataforma, VNC existe en forma de c&oacute;digo fuente o de binarios. Los programas son muy peque&ntilde;os y
es f&aacute;cil de instalar.

<P>
&iquest;C&oacute;mo funciona?

<A NAME="lfindex1">&nbsp;</A>
<H2>Presentaci&oacute;n</H2>


<A NAME="lfindex2">&nbsp;</A>
<H3>Lado servidor</H3>


La versi&oacute;n actual de VNC es 3.3.3 con n&uacute;meros de revisi&oacute;n diferentes seg&uacute;n el
sistema.
En las m&aacute;quinas Unix (o usando X) obtienen un programa llamado vncserver y otro llamado Xvnc.
Vncserver es un script Perl y pueden modificarlo seg&uacute;n sus necesidades. Sirve para arrancar
Xvnc, que es mejor evitar arrancar directamente.
Estos programas pueden ser instalados en donde quieren, siempre que el
directorio se encuentre en el camino de acceso. Cualquier gestor de
ventanas (window manager) puede ser utilizado si est&aacute; definido por defecto
en el script xstartup (bajo el directorio <TT>.vnc</TT>). Arrancar
vncserver por primera vez pide por un password, que necesitar&aacute;n para conectar a
&eacute;ste servidor. Como cada servidor X, vncserver posee muchas opciones. Si
teclean Xvnc --help tendr&aacute;n una lista completa de las mismas. Si usan estos
argumentos, vncserver los pasar&aacute; a Xvnc, que los usa de manera preferente.

<P>
&iexcl;Es todo lo que necesitan para utilizar el servidor VNC!

<P>
En las m&aacute;quinas equipadas con productos Microsoft, es un poco diferente. Si
utilizan NT4.0 pueden arrancar vncserver como un servicio, es el modo
recomendado. Bajo Windows 95 o 98 tendr&aacute;n que arrancarlo desde el icono o el
men&uacute;. Igual que en los servidores basados en X, pueden definir muchos
par&aacute;metros. Hay que dar un paseo por el men&uacute; propuesto.

<P>
No hablaremos de todas las particularidades de los diferentes servidores VNC para todas las plataformas
soportadas porque necesitar&iacute;amos un art&iacute;culo entero.
</p>

<A NAME="lfindex3">&nbsp;</A>
<H3>Lado cliente (el viewer)</H3>


<p>
El cliente se compone de un ejecutable llamado vncviewer. Para conectar a un
servidor VNC, basta con arrancar vncviewer indicando el n&uacute;mero de visualizaci&oacute;n.
Por ejemplo si quieren conectar a un servidor llamado linux en la visualizaci&oacute;n
n&uacute;mero 2, s&oacute;lo tienen quen&uacute;mero 2, s&oacute;lo tienen que escribir "vncviewer linux:2". El
password del servidor les ser&aacute; pedido y despu&eacute;s se encontrar&aacute;n
en el desktop de la m&aacute;quina linux como si trabajaban en &eacute;l. Si est&aacute;n como root,
pueden administrar perfectamente la m&aacute;quina. De modo que cuidado &iexcl;Mejor saber
lo que hacer! Todo eso es cierto para cada cliente en cada plataforma.

<P>
&iexcl;S&oacute;lo una palabra: fant&aacute;stico!
</p>

<A NAME="lfindex4">&nbsp;</A>
<H2>&iexcl;A divertirse!</H2>


<p>
En una red local (a causa de velocidad), VNC permite hacer cosas por lo menos
inhabituales. Todo parece posible: pueden arrancar cualquier applicaci&oacute;n en
cualquier SO. Por ejemplo, si vncserver est&aacute; activo en una m&aacute;quina bajo
Windows NT y arrancan vncviewer en una m&aacute;quina bajo BeOS, pueden utilizar todas
las applicaciones disponibles en el ordenador NT. Si tienen una licencia para
Photoshop, pueden arrancar Photoshop en la m&aacute;quina BeOS como lo
har&iacute;an en la m&aacute;quina NT. Eso significa que abren una ventana en la pantalla de BeOS representando
el desktop NT: &iexcl;Ahora trabajan en la estaci&oacute;n NT!

<p>
<IMG SRC="../../common/images/article155/bewinth.jpg" ALT="bewin.jpg" ALIGN=TEXTTOP>
<br>
&iexcl;Photoshop bajo BeOS!
</p>

<p>
<IMG SRC="../../common/images/article155/winlinth.jpg" ALT="winlin.jpg" ALIGN=TEXTTOP>
<br>
&iquest;O Gimp bajo Windows?
</p>

<p>
Lo repito. Pueden hacer eso desde cualquier m&aacute;quina que tenga un cliente VNC.
Otro ejemplo: si trabajan en una m&aacute;quina sin acceso al Internet, pueden conectar a un servidor VNC
con acceso al mundo exterior y utilizar su navegador para visitar una URL. Por
supuesto, pueden tambi&eacute;n utilizar el software de correo para consultar el
buz&oacute;n o mandar un mensaje.

<p>
<IMG SRC="../../common/images/article155/linsgith.jpg" ALT="linsgi.jpg" ALIGN=TEXTTOP>
<br>
El cliente VNC no tiene acceso al Internet, sin embargo...
</p>

<p>
&iexcl;A&uacute;n m&aacute;s fuerte! Pueden conectar a un servidor VNC y desde &eacute;ste servidor conectar a otra m&aacute;quina de la red, y
porqu&eacute; no, arrancar otro cliente VNC en &eacute;sta m&aacute;quina y conectar a otro servidor VNC, y as&iacute; sucesivamente!
Si arrancan un servidor VNC en una m&aacute;quina Unix, numerosos clientes usando vncviewer pueden conectar
al mismo tiempo a &eacute;ste servidor con n&uacute;meros de visualizaci&oacute;n diferentes.
Eso no funcionar&aacute; en m&aacute;quinas bajo Windows pues s&oacute;lo hay una visualizaci&oacute;n disponible.
</p>

<A NAME="lfindex5">&nbsp;</A>
<H2>Nos ponemos serios</H2>


<p>
&iexcl;Pero eso no quiere decir que lo que precede no fuera serio!

<P>
Por ejemplo, a muchos SysAdmin les gusta la administraci&oacute;n de Windows NT: no
pueden saber qui&eacute;n est&aacute; conectado a un servidor, ni qui&eacute;n hace qu&eacute; ... salvo
que hayan comprado el kit de recursos t&eacute;cnicos, que permite conocer la lista
de los procesos en un ordenador dado (pero sin poder "matar" la mayor&iacute;a de
estos procesos). &iexcl;Sin comentarios! Vnc permite dar la vuelta a &eacute;sta interesante
"funcionalidad". Tomemos un ejemplo.

<P>
Desarollan y mantienen diferentes applicaciones bajo Windows (mi compadre Javi
dice: &iexcl;Nosotros, los pobres, no podemos elegir!). Cada nueva versi&oacute;n necesita
una puesta al d&iacute;a en el servidor y en los clientes. Y las m&aacute;quinas se encuentran
m&aacute;s o menos lejos de su oficina. No pueden poner al d&iacute;a la
aplicaci&oacute;n si est&aacute; siendo usada en alg&uacute;n cliente. Con VNC, pueden cerrar
la applicaci&oacute;n en cada cliente, instalar la evoluci&oacute;n y verificar como funciona
sin dejar la oficina. Mejor hacer eso cuando nadie trabaja,
pero como muchos usuarios olvidan cerrar la
applicaci&oacute;n despues de usarla, eso tendr&aacute;n que averiguarlo.
Si VNC fu&eacute; instalado como servicio en las estaciones, pueden arrancar vncserver a distancia desde el
servidor NT, conectar a las estaciones y hacer lo que tengan que hacer.
Es decir, pueden cerrar las
aplicaciones en curso, instalar la evoluci&oacute;n (tambi&eacute;n desde otro servidor que el en el que trabajan
y que est&aacute; conectado al servidor VNC) y controlar su funcionamiento. Entonces, pueden parar el servidor
VNC en la m&aacute;quina lejana y repetir esta operaci&oacute;n en otro cliente.

<P>
Todo eso no ser&iacute;a posible de &eacute;sta manera con una emulaci&oacute;n X en las estaciones Windows, pues que
el instalador tambi&eacute;n es propietario. Otra diferencia si comparamos con X: ning&uacute;n estado se almacena
en el cliente. Pueden cortar la conexi&oacute;n del servidor VNC, ir en otra m&aacute;quina y conectar de nuevo
al servidor VNC para seguir con su trabajo.
Cosa importante: VNC permite mandar una secuencia Ctrl-Alt-Del para abrir la estaci&oacute;n NT lejana.
(No era posible en las versiones anterioras).

<P>
El ejemplo ese supone que trabajabamos desde un servidor NT. Pueden hacer lo mismo desde una estaci&oacute;n Unix, en
la cual el cliente VNC est&aacute; conectado al servidor NT en el que vncserver es activo.
Evidentemente pueden administrar su red de &eacute;sta manera, usando las "remote commands" (si existen) para
arrancar los servidores VNC en las estaciones lejanas si tienen permisos para hacerlo.
Y "lejanas" significa cualquier sitio. &iexcl;Pueden hacer todo eso desde su casa!

<P>
Y eso nos lleva todo recto a la seguridad.
</p>

<A NAME="lfindex6">&nbsp;</A>
<H2>Seguridad</H2>


<p>
Cualquier tipo de comunicaci&oacute;n en una red puede ser considerado como un agujero de seguridad potencial.
&iexcl;Es un hecho! Lo &uacute;nico que pueden hacer es tratar de limitar el riesgo.
No se dejen enga&ntilde;ar: seguridad es tan solo una palabra.
&iexcl;Si algui&eacute;n dice que su red est&aacute; 100% segura, no lo crean!
Los "piratas" son mucho m&aacute;s listos que piensa la gente: es otro hecho.

<P>
Entonces, si quieren mejorar la seguridad de VNC, tienen que mejorar la seguridad de la red. Un firewall,
SSL, SSH... pueden ser utilizados para eso.
SSL y SSH permiten criptar el tr&aacute;fico de dos maneras diferentes. No hablaremos de SSL o SSH
pues que se trata de otro tema. Si quieren saber m&aacute;s, pueden visitar el site de SSH
(<a href="http://www.ssh.fi">http://www.ssh.fi</A>) o el de SSL open source
(<a href="http://www.openssl.org">http://www.openssl.org</A>)
Encontrar&aacute;n extras, parches, add-ons sobre el asunto de la
seguridad (no s&oacute;lo) en el site de AT&amp;T.
Entre ellos tendr&aacute;n un medio de acceso a un servidor detr&aacute;s de un firewall.
Una versi&oacute;n de VNC utilizando una criptograf&iacute;a por llave p&uacute;blica SSLeay
tambi&eacute;n est&aacute; disponible.
Otro medio de limitar las conexiones por se&ntilde;as IP est&aacute;
propuesto: utilizar TCP wrapper.
Hay mucho m&aacute;s y no podemos mencionarlos todos. Pueden descubrirlos en
<a href="http://www.uk.research.att.com/vnc/extras.html">http://www.uk.research.att.com/vnc/extras.html</a>.

<P>
Tambi&eacute;n existe una versi&oacute;n Java de VNC. Es decir pueden utilizar un navegador compatible Java como un
cliente VNC si seleccionan el puerto correcto (58**, a donde ** es el n&uacute;mero de visualizaci&oacute;n: ej. 5802
corresponde a la visualizaci&oacute;n n&uacute;mero 2).
Hab&iacute;a que mencionar esto aunque sea terriblemente lento, sin hablar del
problema de seguridad.
Pero &eacute;sta versi&oacute;n existe y merece ser probada.

<P>
Para cerrar el cap&iacute;tulo de la seguridad en breve, las cosas
como son: VNC no es peor en el asunto de la seguridad
que telnet o rlogin.
</p>

<A NAME="lfindex7">&nbsp;</A>
<H2>Sanseacab&oacute;</H2>


<p>
Si no conocen VNC, vale la pena probarlo. Esperamos que &eacute;ste art&iacute;culo habr&aacute; hechoo
atractivo a VNC. Es probablemente uno de los software m&aacute;s extraordinarios en su
categor&iacute;a. Es muy peque&ntilde;o, bastante r&aacute;pido (eso depende de la red o del tipo de
conexi&oacute;n) y es GRATIS.

<p>
Es muy fiable y el &uacute;nico problema que encontre con la &uacute;ltima revisi&oacute;n concierne la versi&oacute;n Windows:
si el usuario de una estaci&oacute;n NT lejana ha dejado la tecla mayusculas pulsada, la secuencia para mandar el
Ctrl-Alt-Del parece no funcionar (mi compa&ntilde;ero de trabajo sugere escribir el password en un editor, copiarlo y
pegarlo en el campo del password... y funciona!). &iexcl;Es todo lo que fui capaz de encontrar!
Y eso que uso VNC bajo Solaris Sparc, Irix, Linux, BeOS, AmigaOS y NT. La menos elaborada
es probablemente la versi&oacute;n de AmigaOS pero nadie tiene la culpa de esto,
puesto que hace tanto tiempo que esa m&aacute;quina no ha evolucionado...

<P>
Ademas, lo que acaban de leer s&oacute;lo representa una peque&ntilde;a parte de las inmensas posibilidades de VNC.
VNC empieza a aparecer en unas distribuciones Linux, lo que sirve como
muestra de su inter&eacute;s.
Si tienen una peque&ntilde;a red en casa o una grande en el trabajo, prueben VNC. &iexcl;Es genial!

<P>
Cuando dec&iacute;a yo que viv&iacute;amos una &eacute;poca estupenda...
</p>




<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=155&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article155.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:gete@wanadoo.fr"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:gete@wanadoo.fr"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>es</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-03-30, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
