<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Graphics">
 <TITLE>lf113, Graphics: Im&aacute;genes Pseudo 3D con Gimp</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG alt="[Photo de l&aacute;uteur]" height=130
src="../../common/images/Andre-Pascual.jpg" width=100>
<BR>por  <A href="mailto:apascual@club-internet.fr">Andr&eacute; Pascual</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Inicialmente dibujante industrial, actualmente ense&ntilde;a CAD. Una
de sus pasiones es la infograf&iacute;a, en particular la 3D.
</P><BR>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Crear el fondo</A></LI>
  <LI><A HREF="#lfindex1">Elegir el motivo</A></LI>
  <LI><A HREF="#lfindex2">Preparar los fondos</A></LI>
  <LI><A HREF="#lfindex3">Crear el suelo</A></LI>
  <LI><A HREF="#lfindex4">Crear la pared frontal</A></LI>
  <LI><A HREF="#lfindex5">Juntar la pared con el suelo</A></LI>
  <LI><A HREF="#lfindex6">Crear el texto</A></LI>
  <LI><A HREF="#lfindex7">Generar un logo</A></LI>
  <LI><A HREF="#lfindex8">Incluir el texto</A></LI>
  <LI><A HREF="#lfindex9">Crear la esfera reflectante</A></LI>
  <LI><A HREF="#lfindex10">Preparar el destello</A></LI>
  <LI><A HREF="#lfindex11">Dise&ntilde;ar la esfera propiamente dicha</A></LI>
  <LI><A HREF="#lfindex12">Poner la esfera y el decorado</A></LI>
  <LI><A HREF="#lfindex13">Perfeccionar el proyecto</A></LI>
  <LI><A HREF="#lfindex14">Crear una sombra sobre la esfera</A></LI>
  <LI><A HREF="#lfindex15">Crear la sombra proyectada sobre el suelo</A></LI>
  <LI><A HREF="#lfindex16">Crear un destello especular sobre la esfera</A></LI>
  <LI><A HREF="#lfindex17">Crear el efecto pecera</A></LI>
  <LI><A HREF="#lfindex18">El toque final</A></LI>
  <LI><A HREF="#lfindex19">Conclusi&oacute;n</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=113&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Im&aacute;genes Pseudo 3D con Gimp</H2>
 <IMG alt=[Illustration] height=100 hspace=10
src="../../common/images/illustration113.gif" width=100>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>
A pesar de que Gimp es una aplicaci&oacute;n exclusivamente 2D, con un poco de ingenio y gracias a las
numerosas herramientas que tiene es posible crear una imagen en pseudo 3D.
</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->

<CENTER>
<IMG alt="[Figure 1]" height=410 src="../../common/images/article113/fig1_99.jpg" width=413> </CENTER>
<P>Para obtener los resultados del ejemplo dado (Figura 1) son necesarias cuatro etapas:
<OL>
  <LI>Crear un fondo con perspectiva para el suelo.
  <LI>Crear un texto sobre la pared vertical.
  <LI>Crear una pseudoesfera especular.
  <LI>Refinar la imagen agregando sombras, destellos y aplicaci&oacute;n de lentes
  </LI></OL>

<A NAME="lfindex0">&nbsp;</A>
<H2>Crear el fondo</H2>


<A NAME="lfindex1">&nbsp;</A>
<H2>Elegir el motivo</H2>

<P>Supondremos que Gimp posee el motivo que simula un circuito. Si este no es el caso
cualquier otro servir&aacute; (la lista de todos los motivos puede verse haciendo clic
sobre File&gt;Dialogs&gt;Patterns (Archivo&gt;Di&aacute;logos&gt;Motivos) o bien pulsando [Shift+
Ctrl+ P] ). Al elegir uno de los motivos de la lista se obtiene su visualizaci&oacute;n en escala 1:1
con su correspondiente nombre.
<P>Si el motivo no existe y se quiere reproducir exactamente el ejemplo
propuesto se deber&aacute; crearlo. Para ello abrir Gimp,
cargar el archivo /opt/kde/share/wallpapers/circuit.jpg y guardarlo
con extensi&oacute;n "pat", elegida de la lista de formatos &lt;By extension&gt; (Seg&uacute;n extensi&oacute;n) de la
caja &lt;Save Image&gt; (Guardar Imagen), de modo que nos quede /usr/local/share/gimp/patterns/circuit.pat.
<P>A partir de este momento el motivo estar&aacute; disponible la pr&oacute;xima vez que se carge Gimp.
 Cabe destacar que los pasos indicados son para KDE 1.1.1 y de Gimp 1.0.4 instalados
sobre Mandrake 5.3 y pueden diferir si se emplean otras distribuciones.
<P>Antes de empezar, recordemos que si se ignora el significado de un &iacute;cono de la
caja de herramientas, bastar&aacute; con posar unos instantes el puntero sobre dicho &iacute;cono
con lo cual aparecer&aacute; un cuadro de ayuda. Asimismo haciendo doble clic sobre un &iacute;cono
se abre el cuadro de di&aacute;logo &lt;Tool options&gt; (Opciones de herramienta)
espec&iacute;fico de la herramienta elegida. Por otra parte, haciendo clic derecho sobre la
la imagen actual se despliega el men&uacute; con todas las opciones existentes: desde
el grabado a la edici&oacute;n pasando por los filtros y otros Script-Fu...Por &uacute;ltimo
cabe destacar que todos los comandos habituales para abrir, cerrar, borrar, copiar,
pegar, cortar, rehacer, etc. pueden ejecutarse mediante atajos con el teclado.

<A NAME="lfindex2">&nbsp;</A>
<H2>Preparar los fondos</H2>

<UL>
  <LI>Ejecutar Gimp.
  <LI>Crear un archivo vac&iacute;o con ayuda de File&gt; New&gt; 640x480
  &gt;Background&gt; OK (Archivo&gt; Nuevo&gt; 640x480
  &gt;Fondo&gt; OK).
  <LI>Cubrir el fondo blanco haciendo doble clic sobre Fill (Rellenar) (bote de
  pintura)&gt; Pattern Fill (Rellenar con motivo).
  <LI>Abrir File&gt; Dialogs &gt;Patterns (Archivo&gt; Di&aacute;logos &gt;Motivos) y elegir circuito (u otra cosa).
  <LI>Hacer clic en el &aacute;rea de trabajo. </LI></UL>
<P>Listo.
<P>Como ser&aacute; necesaria una imagen para la pared y otra para el suelo, guardar
el trabajo con calidad jpg 1.00: primero como 1.jpg y luego como 2.jpg
(sin compresi&oacute;n pues se comprimir&aacute; la imagen final). Para ello hacler clic derecho sobre la imagen File&gt;Save as... (Archivo&gt;Guardar como...). De esta manera se dispondr&aacute;
de dos imagenes id&eacute;nticas: la 1.jpeg y la 2.jpeg. La imagen 2 servir&aacute; para crear el suelo
 (Ver figura 2).
<CENTER><BR><BR><IMG alt="[Figure 2]" height=480
src="../../common/images/article113/fig2_99.jpg" width=640> </CENTER><BR><BR>

<A NAME="lfindex3">&nbsp;</A>
<H3>Crear el suelo</H3>

<P>La imagen final tendr&aacute; una dimensi&oacute;n de 400x400 (elecci&oacute;n arbitraria). La imagen
 2.jpeg que ocupa la pantalla que es bastante m&aacute;s grande (640x480) se puede deformar
con la ayuda de las gu&iacute;as magn&eacute;ticas. &Eacute;stas est&aacute;n ocultas en las reglas que rodean
la imagen. Para esto es suficiente con hacer clic sobre una de las reglas y
-manteniendo pulsado el bot&oacute;n izquierdo del rat&oacute;n- desplazar el puntero sobre la zona de trabajo
para ver una l&iacute;nea punteada roja que se desplazar&aacute; horizontal o verticalmente seg&uacute;n
seg&uacute;n la regla elegida. Liberando el bot&oacute;n se ubica la l&iacute;nea en el lugar elegido.
Una escala que se desplaza sobre la regla simult&aacute;neamente con la l&iacute;nea,
ayuda a ubicarla a una distancia precisa del origen (indicada en pixeles; 1 unidad = 10 pixeles).
 La l&iacute;nea punteada se torna azul cuando se deselecciona. Se trata de una gu&iacute;a magn&eacute;tica la que atraer&aacute;
al puntero del rat&oacute;n o al borde de una selecci&oacute;n cuando se aproxima.
<UL>
  <LI>Ubicar ante todo una gu&iacute;a horizontal a 300 pixeles del origen y a continuaci&oacute;n
  dos gu&iacute;as verticales: una a 120 y la otra a 520.
  <LI>Seleccionar la capa con un clic derecho sobre la imagen y elegir &gt;Select
 (Seleccionar
)
  <LI>Hacer doble clic sobre Transform Layer or Selection (Transformar Capa o Selecci&oacute;n) de la caja de herramientas.
  En la caja &lt;Tool options&gt; (Opciones de herramienta) que aparece elegir &lt;Perspective&gt; (Perspectiva).
  <LI>Deformar la selecci&oacute;n para obtener un trapecio haciendo coincidir la esquina
  superior izquierda de la selecci&oacute;n con la intersecci&oacute;n izquierda de las gu&iacute;as. Cuidado:
  la operaci&oacute;n requiere c&aacute;lculos y por por lo tanto tiempo. Esperar a terminar para hacer clic
  en cualquier lugar.
  <LI>A continuaci&oacute;n llevar la esquina superior derecha hacia la intersecci&oacute;n derecha de
  las gu&iacute;as. De esta manera se obtiene un trapecio is&oacute;sceles (Ver Figura 3).
  <CENTER><BR><BR><IMG alt="[Figure 3]" height=480
  src="../../common/images/article113/fig3_99.jpg" width=640> </CENTER><BR><BR>
  <LI>Miniaturizar la imagen o llevarla a algunos de los escritorios. Es conveniente
  guardarla por precauci&oacute;n.</LI></UL>

<A NAME="lfindex4">&nbsp;</A>
<H3>Crear la pared frontal</H3>

<UL>
  <LI>Tomar la imagen 1.jpeg.
  <LI>Colocar una gu&iacute;a horizontal a 400 pixeles y dos verticales, una a 120 y
  otra a 520.
  <LI>Seleccionar la capa haciendo clic derecho &gt;Select (Seleccionar).
  <LI>Hacer doble clic sobre Layer o Selection (Transformar Capa o Selecci&oacute;n) y en &lt;Tool option&gt; (Opciones de herramienta) que se
  encuentra abierto elegir Scaling (Cambiar de escala).
  <LI>Deformar la capa de modo que ocupe un cuadrado de 400x400 delimitado por
  las gu&iacute;as.
  <LI>Agregar a continuaci&oacute;n una capa transparente haciendo clic derecho Layers&gt;
  Layers y channels &gt;New layer (Capas&gt;
 Capas y Canales &gt;Nueva Capa) (el &iacute;cono de la esquina inferior izquierda del gestor de capas
  que acaba de abrirse). Ubicar el suelo sobre la capa. Haciendo doble clic sobre
  el nombre "new layer" ("nueva capa") que aparece por defecto renombrarlo como "suelo" (Ver
  Figura 4).
  <CENTER><BR><BR><IMG alt="[Figure 4]" height=551
  src="../../common/images/article113/fig4_99.jpg" width=655>
</CENTER><BR><BR></LI></UL>

<A NAME="lfindex5">&nbsp;</A>
<H3>Juntar la pared con el suelo</H3>

<UL>
  <LI>Copiar el suelo trapezoidal de 2.jpeg en el portapapeles (utilizar la pluma
  como herramienta, hacer clic en cada v&eacute;rtice del trapecio, terminar en el v&eacute;rtice de partida
  y validar haciendo clic en el interior del trapecio).
  <LI>Pegarlo en la imagen 1.jpeg sobre la capa "suelo" que se acab&oacute; de crear,
  haciendo clic derecho Edit &gt; Paste (Edici&oacute;n &gt; Pegar). El suelo se ubica sobre la capa vac&iacute;a. Ubicarlo en su lugar
 de modo tal que el borde inferior de la selecci&oacute;n coincida con la gu&iacute;a
  horizontal (Ver Figura 5).
  <CENTER><BR><BR><IMG alt="[Figure 5]" height=548
  src="../../common/images/article113/fig5_99.jpg" width=679> </CENTER><BR><BR>
  <LI>Aplanar la imagen haciendo clic derecho Layers&gt; Flatten image (Capas&gt; Aplanar Imagen). &Eacute;sta ahora
  se comporta como una &uacute;nica capa.
  <LI>Recortar la imagen con un tama&ntilde;o de 400x400 con la tijera (Crop -Recortar-) de la
  barra de herramientas (se adhiere autom&aacute;ticamente a las gu&iacute;as magn&eacute;ticas).
  <LI>Agregar una capa "Texto".
  <LI>Guardar (s&oacute;lo por seguridad) como 3.XCF (formato de Gimp que conserva
  las capas y que se elige de la lista de formatos &lt;By extension&gt; -Seg&uacute;n extensi&oacute;n-). </LI></UL>

<A NAME="lfindex6">&nbsp;</A>
<H2>Crear el texto</H2>


<A NAME="lfindex7">&nbsp;</A>
<H2>Generar un logo</H2>

<UL>
  <LI>Hacer clic sobre Xtns&gt; Script-Fu&gt; Logos&gt; Crystal (Extensiones&gt; Script-Fu&gt; Logos&gt; Cristal).
  <LI>Ingresar el texto "LOUPE" (u otra cosa), Font size "105" (Tama&ntilde;o de fuente "105"), Font "Cooper" (Fuente "Cooper") (u otra), Background  (Fondo) "/opt/kde/share/wallpapers/circuit.jpeg", OK).
  Nota: la fuente "Cooper" forma parte del paquete "Freefont" y no se
  se instalan por defecto en todas las distribuciones. Ser&iacute;a de gran inter&eacute;s
  conseguir este paquete, asi como tambi&eacute;n el "Sharefont" que son
  casi indispensables para tener las m&aacute;s agradables tipograf&iacute;as (101
  fuentes vectoriales disponibles de acuerdo con Christoph Lameter,
  &lt;clameter@waterf.org&gt;).
  <LI>Se hace el logo. Las letras se texturizan con el mismo motivo que el de
  la pared pero de mayor tama&ntilde;o pues la pared ha sido empeque&ntilde;ecida. De esta
  manera se obtiene el efecto pecera.
  <LI>El logo est&aacute; formado por muchas capas una de las cuales se denomina "Background".
  Puesto que &eacute;sta carece de utilidad una vez seleccionada se la elimina
  haciendo clic derecho Layers&gt; Layers &amp; channels&gt; Delete layer (Capas&gt; Capas y Canales&gt; Eliminar Capa)
  (la cruz de la derecha).
  <LI>Reunir las capas restantes haciendo clic derecho Layers&gt; Merge Visible
  Layer (Capas&gt; Hacer visible
 Capa)(no hacer clic sobre <Flatten image> -Aplanar Imagen- ya que se perder&iacute;a la transparencia del fondo) (Ver
  Figura 6).
  <CENTER><BR><BR><IMG alt="[Figure 6]" height=186
  src="../../common/images/article113/fig6_99.jpg" width=459>
</CENTER><BR><BR></LI></UL>

<A NAME="lfindex8">&nbsp;</A>
<H2>Incluir el texto</H2>

<UL>
  <LI>Copiar el texto al portapapeles.
  <LI>Pegarlo en el 3.XCF (que no ha sido cerrado) sobre la capa "Texto".
  <LI>Posicionarlo correctamente (lo que se ve por transparencia
  deber&aacute; ser similar, m&aacute;s o menos, al dise&ntilde;o de la pared que se encuentra detr&aacute;s
   Ver Figura 7).
  <CENTER><BR><BR><IMG alt="[Figure 7]" height=472
  src="../../common/images/article113/fig7_99.jpg" width=443> </CENTER><BR><BR>
  <LI>Guardar como 3.XCF (esta vez es necesario para no perder lo que se acaba de hacer
  ya que se modificar&aacute; el gr&aacute;fico visualizado).
  </LI></UL>

<A NAME="lfindex9">&nbsp;</A>
<H2>Crear la esfera reflectante</H2>


<A NAME="lfindex10">&nbsp;</A>
<H2>Preparar el destello</H2>

<P>La esfera debe reflejar el texto aplicado sobre la pared frontal, es decir, &eacute;ste
debe aparecer invertido en relaci&oacute;n al original y curvado sobre la esfera.
<UL>
  <LI>Con la capa "Texto" activa, seleccionar el texto mediante una
  selecci&oacute;n rectangular.
  <LI>Elegir la herramienta de simetr&iacute;a vertical haciendo doble clic sobre Flip layer
  or selection&gt; Vertical) (Voltear Capa
  o Selecci&oacute;n&gt; Vertical (Voltear Capa se encuentra en la barra de herramientas).
  <LI>Designar la selecci&oacute;n que se va a mover con el cursor que consta ahora de una
  doble flecha arriba/abajo.</LI></UL>

<A NAME="lfindex11">&nbsp;</A>
<H2>Dise&ntilde;ar la esfera propiamente dicha</H2>

<P>Ahora viene la parte m&aacute;s delicada.
<UL>
  <LI>Aplanar la imagen haciendo Layers&gt; Flatten image (Capas&gt; Aplanar Imagen).
  <LI>Efectuar una selecci&oacute;n circular de manera tal que por lo menos queden involucradas
  tres letras que se ubicar&aacute;n en la parte superior del c&iacute;rculo (presionar la tecla SHIFT y
  desplazar simult&aacute;neamente el rat&oacute;n para obtener un c&iacute;rculo en vez de una elipse).
  <LI>Deformar la selecci&oacute;n haciendo clic derecho Filters&gt; Distorts&gt; Whirl
  and Pinch (Filtros&gt; Distorsi&oacute;n&gt; Girar
  y Comprimir) con los siguientes valores: "whirlangle:0" ("&aacute;ngulo de giro:0"), "Pinch amount:-1" ("Grado de compresi&oacute;n:-1"),
  "Radius:2" ("Radio:2")(estos valores se eligen en funci&oacute;n del resultado deseado y se obtienen
  despu&eacute;s de muchos ensayos. En este caso no existen f&oacute;rmulas).
  <LI>Validar y repetir la operaci&oacute;n con los mismos valores (Ver Figura 8).
  <CENTER><BR><BR><IMG alt="[Figure 8]" height=472
  src="../../common/images/article113/fig8_99.jpg" width=443> </CENTER><BR><BR>
  <LI>Con la selecci&oacute;n siempre activa, copiarla al portapapeles. Ahora se puede cerrar
  el dibujo sin guardarlo. </LI></UL>

<A NAME="lfindex12">&nbsp;</A>
<H2>Poner la esfera y el decorado</H2>

<UL>
  <LI>Volver al archivo 3.XCF.
  <LI>Crear una capa "esfera".
  <LI>Pegar la esfera y posicionarla para que las letras
  reflejadas correspondan a las de la pared.
  <LI>Guardar como 3.XCF. </LI></UL>

<A NAME="lfindex13">&nbsp;</A>
<H2>Perfeccionar el proyecto</H2>
Esta es la parte que m&aacute;s refleja la sensibilidad y
pericia del creador. Por lo tanto, dar&eacute; &uacute;nicamente consejos generales a fin de que
se manifieste la creatividad de cada uno. Hagamos un an&aacute;lisis antes de proseguir:
las letras del logo "LOUPE" reciben un haz luminoso proveniente del lado
izquierdo de la imagen (observar las sombras). L&oacute;gicamente la esfera
estar&aacute; iluminada de id&eacute;ntica manera. En consecuencia, la esfera deber&aacute; proyectar
sobre el suelo una sombra y una porci&oacute;n de su superficie debe estar en ella.

<A NAME="lfindex14">&nbsp;</A>
<H2>Crear una sombra sobre la esfera</H2>

<UL>
  <LI>Agregar una capa "sombra esfera", transparent opacity 90 (Opacidad transparente 90) (siempre existe
  posibilidad de modificar este valor), modo de mezcla "Normal".
  <LI>Ubicar cuatro gu&iacute;as magn&eacute;ticas tangentes a la esfera.
  <LI>Efectuar una selecci&oacute;n circular con la ayuda de las gu&iacute;as (a partir de
  la intersecci&oacute;n superior izquierda hasta la intersecci&oacute;n inferior derecha). La selecci&oacute;n
  debe circunscribir la esfera.
  <LI>Hacer doble clic sobre la herramienta Fill with a color gradient (Rellenar con color degradado); en la caja &lt;Tool
  options&gt; (Opciones de herramienta) elegir "Blend: FG to transparent" ("Mezclar: FG a transparente) y "Gradient: Linear" ("Degradado: Lineal").
  <LI>Elegir el color negro si no est&aacute; seleccionado.
  <LI>Rellenar la selecci&oacute;n circular con un degrad&eacute; negro -&gt;transparent (transparente) trazando una
  horizontal que parta del extremo derecho del di&aacute;metro de la esfera hasta su extremo
  izquierdo (el di&aacute;metro hay que imaginarlo pues no est&aacute; representado).
 <BR>Hacer pruebas con los modos de mezcla de la capa "sombra esfera" a fin de ver el
  comportamiento de los pixeles negro de esta capa con los que se encuentran sobre las capas
  inferiores.
  <LI>Guardar el proyecto cuando lo considere satisfactorio. </LI></UL>

<A NAME="lfindex15">&nbsp;</A>
<H2>Crear la sombra proyectada sobre el suelo</H2>

<UL>
  <LI>Agregar la sombra proyectada "sombra suelo", transparent (transparente), opacity 80 (opacidad 90).
  <LI>Imaginar la forma de esta sombra. Se trata de una elipse bastante aplanada. Para
  obtenerla, hacer una selecci&oacute;n el&iacute;ptica y posicionarla
  de manera tal que el extremo izquierdo de su eje mayor (eje horizontal
  en este caso) coincida con el punto de contacto esfera/suelo. Para esto se pueden usar
  las gu&iacute;as magn&eacute;ticas (Ver Figura 9).
  <CENTER><BR><BR><IMG alt="[Figure 9]" height=480
  src="../../common/images/article113/fig9_99.jpg" width=640> </CENTER><BR><BR>
  <LI> Hacer doble clic sobre la herramienta Fill with a color or pattern
(Rellenar con un color o motivo) ; en la caja
  &lt;Tool options&gt;  (Opciones de herramienta) elegir "Mode: Normal" ("Modo: Normal") y "Fill Type: Color fill" ("Rellenar Texto: Color de Relleno").
  <LI>Elegir un verde bien oscuro (R:18, G:35, B:14 por ejemplo).
  <LI>Con este verde rellenar la selecci&oacute;n.
  <LI>La sombra resultante no es muy realista porque su periferia est&aacute; demasiado
  definida. Una sombra real siempre es m&aacute;s difusa en los bordes. Se intentar&aacute;
  obtenerla en dos etapas:
  <LI>Con la selecci&oacute;n siempre activa, hacer clic derecho Filters&gt; Blur&gt;
 Motion Blur&gt; Radial (Filtros&gt; Desenfocar&gt;
 Desenfoque de Movimiento&gt; Radial) y elegir los valores "Length: 35" ("Longitud: 35") y "Angle: 45"&gt; OK ("Angulo: 45"&gt; OK).
  <LI>Deseleccionar y a continuaci&oacute;n hacer doble clic Filters&gt; Blur&gt; Gaussian Blur (Filtros&gt; Desenfocar&gt; Desenfoque Gausiano)
  (RLE) con los valores por defecto &gt; OK. </LI></UL>

<A NAME="lfindex16">&nbsp;</A>
<H2>Crear un destello especular sobre la esfera</H2>
Puesto que la luz proviene
de la izquierda, el borde izquierda de la esfera debe estar m&aacute;s iluminado.
<UL>
  <LI>Agregar una capa "destello".
  <LI>Con ayuda de la pluma (con el lazo es m&aacute;s dif&iacute;cil), hacer una selecci&oacute;n
  bastante grande en forma de medialuna del borde izquierdo de la esfera.
  <LI>Elegir el color blanco.
  <LI>Usar la pintura en degrad&eacute; FG-&gt;Transparent usando la misma t&eacute;cnica que
  antes pero de izquierda a derecha.
  <LI>Mezclar las capas en modo "Overlay" ("Recubrir"). Si el efecto no es bastante
  pronunciado, pintar dos o tres veces de la misma manera. </LI></UL>

<A NAME="lfindex17">&nbsp;</A>
<H2>Crear el efecto pecera</H2>
La luz que incide sobre la esfera se refleja
y se dirige hacia el objetivo del aparato que fotograf&iacute;a la escena produciendo una
aberraci&oacute;n &oacute;ptica denominada "Lens flare" ("Destello").
<UL>
  <LI>Aplanar la imagen.
  <LI>Ubicar dos gu&iacute;as magn&eacute;ticas de modo que su intersecci&oacute;n coincida con el centro
  del destello (Ver Figura 1) y anotar sus posiciones X e Y con ayuda de las reglas.
  <LI>Hacer doble clic sobre Filters&gt; Light Effects&gt; Flare FX (Filtros&gt; Efectos de Iluminaci&oacute;n&gt; Destello FX).
  <LI>Ingresar los valores relevados de X e Y como par&aacute;metros de "Center of Flare FX" ("Centro del destello FX").
  Tambi&eacute;n es posible ubicar a ojo el centro del destello con ayuda
  del rat&oacute;n. </LI></UL>

<A NAME="lfindex18">&nbsp;</A>
<H2>El toque final</H2>
Podemos esmerarnos agregando algunos destellos luminosos
a las letras de vidrio pr&oacute;ximas al haz luminoso
con un doble clic Filters&gt; Light Effects&gt; Super Nova (Filtros&gt; Efectos de Iluminaci&oacute;n&gt; Super Nova) usando los siguientes
par&aacute;metros Radius 2 &oacute; 3 (Radio 2 &oacute; 3) y Spoke 50 (Rayo 50).
En cuanto a los colores de &eacute;stos es solo cuesti&oacute;n de gusto.

<A NAME="lfindex19">&nbsp;</A>
<H2>Conclusi&oacute;n</H2>

<P>He aqu&iacute; la obra casi terminada. Digo casi pues, observando bien las esquinas, deben
seguramente subsistir defectos, aproximaciones, etc. que todo creador podr&aacute; mejorar
seg&uacute;n sus recetas personales.
<P>Que se diviertan. Pues Linux y Gimp junto a las ganas de crear son una fuente de diversi&oacute;n para tener
en cuenta. </P>



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=113&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Andr&eacute; Pascual, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article113.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:apascual@club-internet.fr"><FONT COLOR="#FFFFFF">Andr&eacute; Pascual</FONT></a></font></td>
</tr>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:wecharri@yahoo.com"><FONT COLOR="#FFFFFF">Walter Echarri</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-03-30, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
