<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>lf159, System Administration: Introducci&oacute;n a LDAP sobre Linux</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Atif-Ghaffar.jpg" ALT="[Photo of the Author]" HEIGHT=115 WIDTH=124>
<BR>por  <A HREF="mailto:atif@developer.ch">Atif Ghaffar</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
    Atif is un camale&oacute;n. Cambia de tareas, de Administrador de Sistemas, a programador,
    a profesor, a jefe de proyecto, a lo que sea necesario para terminar el trabajo. <BR>
    De vez en cuando le gusta programar en el port&aacute;til mientras ve una pel&iacute;cula en el
    cine. <BR>
    Atif opina que le debe mucho a la comunidad y a los proyectos de c&oacute;digo libre y de
    Linux por ense&ntilde;arle muchas cosas. <br>
    Pod&eacute;is encontrar m&aacute;s cosas sobre &eacute;l en su
    <a href="http://www.developer.ch/~aghaffar">p&aacute;gina web</a></P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">&iquest;Qu&eacute; es LDAP?</A></LI>
  <LI><A HREF="#lfindex1">Directorio Base o Root (ra&iacute;z)</A></LI>
  <LI><A HREF="#lfindex2">Distinguished Name (nombre distinguido)</A></LI>
  <LI><A HREF="#lfindex3">Servidores LDAP</A></LI>
  <LI><A HREF="#lfindex4">Construcci&oacute;n del directorio LDAP</A></LI>
  <LI><A HREF="#lfindex5">Descarga e instalaci&oacute;n de openLDAP</A></LI>
  <LI><A HREF="#lfindex6">Configurar el servidor LDAP</A></LI>
  <LI><A HREF="#lfindex7">C&oacute;mo a&ntilde;adir datos al nuevo servidor LDAP</A></LI>
  <LI><A HREF="#lfindex8">Interrogando a la base de datos LDAP</A></LI>
  <LI><A HREF="#lfindex9">Ventajas de LDAP</A></LI>
  <LI><A HREF="#lfindex10">Implementaciones de ejemplo de LDAP</A></LI>
  <LI><A HREF="#lfindex11">Escribe art&iacute;culos: ense&ntilde;a y aprende</A></LI>
  <LI><A HREF="#lfindex12">Recursos</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=159&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Introducci&oacute;n a LDAP sobre Linux</H2>
 <IMG SRC="../../common/images/illustration159.gif" ALT="openLDAP" HSPACE=10 HEIGHT=60 WIDTH=468>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>
    En este art&iacute;culo exploraremos LDAP y sus implementaciones usando nuestro sistema operativo
    Linux.
    <p>
    Se encuentra mucha literatura sobre LDAP, por lo que no lo repetir&eacute; todo de nuevo
    aqu&iacute;, ni hablar&eacute; sobre t&eacute;rminos avanzados de LDAP, esquemas, diferencias de
    la v2 frente a la v3, etc. De hecho no se mucho sobre todo eso. En su lugar, tratar&eacute; de
    explicar en palabras sencillas lo que es LDAP, qu&eacute; beneficios nos aporta y c&oacute;mo
    podemos usarlo.
    <p>
    No soy un experto en LDAP. De hecho soy un principiante. Escribir&eacute; aqu&iacute;
    b&aacute;asicamente qu&eacute; he hecho con LDAP y c&oacute;mo. Tratar&eacute; de no confundiros
    como lo estube yo durante mucho tiempo.
    <p>

    Pregunta: &iquest;si eres un principiante, por qu&eacute; escribes un art&iacute;culo sobre el tema? <br>
    Recientemente necesit&eacute; ayuda de un colega para un proyecto. La base del proyecto era LDAP.
    El me pod&iacute;a ayudar con Perl, servidores de correo, etc pero no sab&iacute;a nada sobre LDAP.
    De hecho, cada vez que intentaba enterarse de algo se liaba m&aacute;s y m&aacute;s. <br>
    Ya que saber algo de LDAP era un requerimiento m&iacute;nimo para el proyecto le di un curso
    intensivo sobre LDAP en media hora y se le aclararon todas las ideas. Los conceptos son
    f&aacute;ciles. Solo necesitaba que se los aclararan un poco y unos ejemplos sencillos.
    <p>
    Intentar&eacute; hacer lo mismo en este art&iacute;culo.
    <p>
    Pod&eacute;is encontrar muchas url sobre LDAP en la secci&oacute;n de referencias.
</p></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>&iquest;Qu&eacute; es LDAP?</H2>


<p>
    LDAP significa Protocolo de Acceso a Directorios Ligeros (siglas en ingl&eacute;s de Lightweight
    Directory Access Protocol) y es un servicio de directorio, muy similar a los directorios del
    sistema de ficheros al que estamos acostumbrados, o a la gu&iacute;a de tel&eacute;fonos que
    usamos para buscar n&uacute;meros de tel&eacute;fono, o a los servicios de directorios de red
    como el NIS de SUN (Network Information Service, Servicio de Informaci&oacute;n de Red), DNS
    (Domain Name Service), o al &aacute;rbol que ves en tu jard&iacute;n (o en el de tu vecino).
    <p>
    LDAP es una base de datos especializada. Es muy importante recordar que LDAP no es otra base de
    datos m&aacute;s. LDAP est&aacute; optimizada para hacer b&uacute;squedas (leer datos). Las
    lecturas en LDAP se realizan de manera mucho m&aacute;s frecuente que las escrituras.
    <p>
    &iquest;Qu&eacute; tienen todos estos servicios en com&uacute;n? <br>
    Todos devuelven alguna informaci&oacute;n cuando se les pregunta con alg&uacute;n criterio.
    <p>

    <b>Ejemplos.</b> <br><br>
        <u>Directorio del sistema de ficheros</u> <br>
        ls /etc <br>
        Devolver&aacute; todos los ficheros y subdirectorios del directorio /etc
        <p>
        ls /etc/p* <br>
        Devolver&aacute; todos los ficheros y subdirectorios que empiezan por p
        <p>
        find /usr/local/apache -name index.html <br>
        Buscar&aacute; en el sistema de ficheros un fichero o directorio que se llame index.html,
        empezando en la base "/usr/local/apache"
        <p>

        <u>Directorio de NIS</u> <br>
        ypcat passwd <br>
        Devolver&aacute; el nombre de usuario, contrase&ntilde;a, userid, etc de la base de datos de NIS
        <p>
        ypmatch atif passwd <br>
        Devolver&aacute; las entradas para la contrase&ntilde;a para el usuario atif
        <p>

        <u>Directorio DNS</u> <br>
        nslookup www.linuxfocus.org <br>
        Devolver&aacute; la direcci&oacute;n ip para la entrada www.linuxfocus.org de la base de datos
        de DNS
        <p>
        nslookup -type MX linuxfocus.org <br>
        Devolver&aacute; solo informaci&oacute;n MX de la base de datos de DNS donde el nombre de host
        sea linuxfocus.org
        <p>

        <u>Directorio LDAP</u> <br>
        (lo veremos con detalle m&aacute;s abajo)
        <p>
        ldapsearch uid=aghaffar <br>
        Devolver&aacute; toda la informaci&oacute;n p&uacute;blica sobre el usuario aghaffar <br>
        Similar al comando de unix <i>find / -uid aghaffar</i>
        <p>
        ldapsearch uid=aghaffar mail <br>
        Solo devolver&aacute;a el mail del usuario aghaffar
</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>Directorio Base o Root (ra&iacute;z)</H2>


<P>
    En cada servicio de directorio de los que hemos mencionado arriba, siempre hay un punto de inicio
    desde el que empezar a buscar. Este punto de inicio se llama normalmente &quot;root&quot;. Es
    similar a la ra&iacute;z del &aacute;rbol. <br>
    Cada &aacute;rbol tiene una ra&iacute;z, luego algunas ramas, y luego m&aacute;s ramas y hojas y
    flores, etc. <br>
    <p>
    <ul>
        <li>Para el sistema de ficheros, el root es /
        <li>para el NIS el root es el nombre de dominio, por ejemplo &quot;linuxfocus.org&quot;
        <li>para el DNS est&aacute; Internic, por ejemplo, que mantiene la base de datos principal
            sobre servidores de nombre
        <li>de igual modo para LDAP existe una base que es definible. Por ejemplo
            &quot;o=linuxfocus.org&quot; donde o significa Organizaci&oacute;n
    </ul>
    Cada ra&iacute;z puede tener varias ramas (como en el &aacute;rbol del jard&iacute;n de tu vecino),
    para el sistema de ficheros esas ramas pueden ser, por ejemplo, otro subdirectorio, o un fichero. <br>
    Cada una de las ramas puede tener atributos. <br>
    Por ejemplo, las ramas del sistema de ficheros (subdirectorios and ficheros) tienen los siguientes
    atributos.
    <ul>
        <li>nombre</li>
        <li>hora de modificaci&oacute;n</li>
        <li>propietario</li>
        <li>grupo</li>
        <li>etc</li>
    </ul>
    A continuaci&oacute;n hay un diagrama que muestra el directorio de un sistema de ficheros.<br>
    Los atributos representan la salida del comando de unix ls -ld /usr <br>
    <code>drwxr-xr-x  29 root     root          749 Jun 17 23:45 /usr</code> <br>
    <img src="../../common/images/article159/fileSystemDirectory.png"><br>
    <p>
    Ahora un diagrama para un directorio LDAP<br>
    <img src="../../common/images/article159/ldapDirectory.png"><br>
    Hablaremos sobre este diagrama m&aacute;s tarde.
</p>

<A NAME="lfindex2">&nbsp;</A>
<H2>Distinguished Name (nombre distinguido)</H2>


<p>
    Al contrario que en un &aacute;rbol natural, cada rama del directorio del sistema de ficheros, del
    LDAP o de la gu&iacute;a de tel&eacute;fonos tiene como m&iacute;nimo un atributo &uacute;nico,
    que nos ayuda a diferenciarlas las unas de las otras.
    <p>
    En los sistemas de ficheros este atributo &uacute;nico es el nombre del fichero con todo el camino,
    por ejemplo <br>
    <code> /etc/passwd</code>
    El nombre del fichero passwd tiene que ser &uacute;nico dentro de su camino. Claro que podemos tener
    /usr/passwd y /opt/passwd que son &uacute;nicos con todo su nombre completo.<br>
    De igual modo, el sistema DNS tiene el FQDN (Fully Qualified Domain Name) que es una entrada
    &uaacute;nica (ya se que puedes asignar muchas ip al mismo FQDN!).
    <p>
    En LDAP el nombre completo de una entrada se llama "dn" o nombre distinguido (en ingl&eacute;s
    Distinguished name). Este nombre es siempre &uaacute;nico en un directorio. Por ejemplo, mi dn
    es "uid=aghaffar, ou=People, o=developer.ch" <br>
    No es posible tener otras entrada con el mismo dn, pero seguramente podremos tener un dn como
    "uid=aghaffar, ou=Administrators, o=developer.ch" <br>
    Esto representa el ejemplo de las entradas del sistema de ficheros /etc/passwd y /usr/passwd <br>
    Tenemos un &uacute;nico atributo llamado uid in the &aacute;rbol "ou=Administrators, o=developer.ch"
    y tenemos un &uacute;nico atributo llamado uid en el &aacute;rbol "ou=People, o=developer.ch". No
    colisionan.
</p>

<A NAME="lfindex3">&nbsp;</A>
<H2>Servidores LDAP</H2>


<p>
    Hoy en d&iacute;a hay muchos servidores LDAP disponibles en el mercado, y la mayor&iacute;a de ellos
    funcionan bien con Linux. <br>
    Para este art&iacute;culo uaremos openLDAP.<br>
    <p>
    &iquest;Por qu&eacute; he elegido openLDAP? &iquest;Por qu&eacute; deber&iacute;as elegir t&uacute; openLDAP?
    <ul>
        <li>Porque su c&oacute;digo es libre</li>
    </ul>
    openLDAP est&aacute; disponible en http://www.openldap.org. Puedes bajarte el c&oacute;digo fuente
    y construirtelo t&uacute; mismo, o mirar a ver si est&aacute; el package para tu distribuci&oacute;n
    de Linux. Te ahorrar&aacute; el esfuerzo e isntalar&aacute;s directamente los binarios. <br>
    Yo lo he provado en SuSE6.x y en RedHat6.x.
</p>

<A NAME="lfindex4">&nbsp;</A>
<H2>Construcci&oacute;n del directorio LDAP</H2>


<p>
    En esta secci&oacute;n montaremos un servidor LDAP paso por paso.<br>
    Pasos a realizar:
    <ul>
        <li>Descargar e instalar openLDAP</li>
        <li>Configurar el servidor LDAP</li>
        <li>Configurar las variables de entorno para apuntar a la instalaci&oacute;n de LDAP</li>
        <li>Inicializar la base de datos de LDAP</li>
        <li>Interrogar a LDAP</li>
        <li>A&ntilde;adir y/o modificar entradas LDAP</li>
    </ul>
</p>

<A NAME="lfindex5">&nbsp;</A>
<H2>Descarga e instalaci&oacute;n de openLDAP</H2>


<p>
    Como ya hemos dicho, debes descargar los fuentes de www.openldap.com e instalarlos seg&uacute;n la
    documentaci&oacute;n o instalar un package de binarios precompilados (instalar los packages o un HOWTO
    sobre c&oacute;mo compilar aplicaciones queda m&aacute;s all&aacute; de las intenciones de este
    art&iacute;culo).
</p>


<A NAME="lfindex6">&nbsp;</A>
<H2>Configurar el servidor LDAP</H2>


<p>
    Para este ejemplo, construiremos un directorio LDAP para linuxfocus.org. Si quieres, puedes cambiar
    los nombres y todo lo necesario para adaptarlo a tu site. <br>
    Para configurar el servidor principal, tenemos que editar los ficheros slapd.conf y ldap.conf. Lo
    puedes hacer en tu editor favorito.<br>
    En mis servidores, estos ficheros est&aacute;n en /etc/openldap. Los tuyos pueden estar en
    /usr/local/etc/openldap o en alg&uacute;n otro sitio, dependiendo de tu Distribuci&oacute;n de
    Linux, o de los par&aacute;metros de configuraci&oacute;n si compilaste openLDAP tu mismo.

<pre>
######### /etc/openldap/slapd.conf ###################################
# lo que sigue esta definido por defecto en mi linux suse 6.4
# hablaremos mas sobre ello en la segunda o tercera parte de este articulo
# Quizas por entonces ya sepa que significa :)

include		/etc/openldap/slapd.at.conf
include		/etc/openldap/slapd.oc.conf
schemacheck	off

pidfile		/var/run/slapd.pid
argsfile	/var/run/slapd.args

#######################################################################
# definiciones de la base de datos ldbm
#######################################################################

# esto define el tipo de base de datos a usar. manten el valor por
# defecto  ldbm
database	ldbm

# sufijo o raiz (root) del directorio. Es el nodo raiz superior
# de tu directorio LDAP
suffix		"o=linuxfocus.org"

# aqui es donde se guardara el dbs de ldap
directory	/var/lib/ldap

# el nombre distingudo (distinguished name) del directorio manager
rootdn		"cn=Manager, o=linuxfocus.org"

# no es muy buena idea guardar la contrase&ntilde;a en texto llano,
# pero la dejaremos asi al principio hasta que controlemos mas sobre LDAP
rootpw		secret

# Esto es todo, de momento.
</pre>

    Editamos el fichero /etc/openldap/ldap.conf <br>
    Este fichero pertenece al cliente de LDAP, pero aqu&iacute; utilizamos la misma m&aacute;quina
    como cliente y servidor. Pueden ser la misma o dos diferentes. <br>
    Normalmente este fichero lo leen utilidades ldap como ldapdelete, ldapadd, etc.
    <p>

<pre>
##########/etc/openldap/ldap.conf#########
#
# Valores por defecto para LDAP
#

# mirar ldap.conf(5) para mas detalles
# Este fichero debe tener permiso de lectura para todo el mundo

# esto define el servidor ldap. Se puede usar hostname o direccion ip
host 127.0.0.1

# este es el el directory root que queremos usar para iniciar las
# busquedas. usaremos el nodo superior en nuestra configuracion
# pero no tiene porque serlo. Por ejemplo, podemos poner
# base = ou=users, o=linuxfocus.ch
# si lo hacemos, todas las busquedas empezaran en una rama del arbol
base  o=linuxfocus.org

# esto es todo
</pre>

    Ahora iniciamos el servidor LDAP. <br>
    Si usas el servidor pre-instalado de SuSE, lo puedes iniciar con <br>
    <i>/etc/rc.d/ldap start</i><br>
    En RedHat, creo que es <br>
    <i>/etc/rc.d/init.d/ldap start</i><br>
    Si lo has compilado e instalado por ti mismo y has usado los directorios por defecto, lo puedes
    iniciar con <br>
    <i>/usr/local/libexec/slapd &</i> o donde lo hallas instalado. Simplemente encuentra slapd y
    ejec&uacuteta;lo.<br>
</p>

<A NAME="lfindex7">&nbsp;</A>
<H2>C&oacute;mo a&ntilde;adir datos al nuevo servidor LDAP</H2>


<p>
    Llegados a este punto ya tenemos un servidor LDAP funcionando, listo para ser llenado con
    informaci&oacute;n.<br>
    La manera est&aacute;ndar de llenar de informaci&oacute;n el servidor LDAP es crear un fichero
    LDIF (Formato de intercambio de directorios LDAP, en ingl&eacute;s LDAP Directory Interchange
    Format)*. Puedes leerte el man de ldif para informarte m&aacute;s sobre ldif. <br>
    Muy brevemente, ldif es la representaci&oacute;n textual de las entradas de LDAP. Estas entradas
    est&aacute;n en un formato legible por el hombre e intercambiable entre dos servidores LDAP
    diferentes de diferentes fabricantes, usando motores de bases de datos diferentes, y ejecutandose
    en sistemas operativos diferentes. <br>
    * S&iacute;. Otro formato m&aacute;s. Me pregunto por qu&eacute; no se usa XML en lugar de LDIF.
    <p>
    Sin m&aacute;s pre&aacute;mbulos creemos el fichero ldif. Algunas cosas a recordar.<br>
        <li>Cada registro/entrada del fichero ldif se separa con una l&iacute;nea en blanco.
        <li>Los espacios en los valores son muy importantes. No es lo mismo "Atif Ghaffar" que
            "Atif Ghaffar " <br>
    <p>
    El fichero ldif: linuxfocus.org.ldif

<pre>
dn: o=linuxfocus.org
o: linuxfocus.org
objectclass: top
objectclass: organization

dn: ou=editors, o=linuxfocus.org
ou: editors
objectclass: organizationalUnit

dn: uid=aghaffar, ou=editors, o=linuxfocus.org
uid: aghafar
cn: Atif Ghaffar
sn: Ghaffar
givenname: Atif
objectclass: person
userpassword: {CRYPT}yIvSBWSuLs2N2
mailacceptinggeneralid: aghaffar@linuxfocus.org
ou: editors

dn: uid=mkempe, ou=editors, o=linuxfocus.org
uid: mkempe
cn: Magnus Kempe
sn: Kempe
givenname: Magnus
objectclass: person
userpassword: clearpass
mailacceptinggeneralid: mkempe@linuxfocus.org
maildrop: mkempe@developer.ch
preferredlanguage: fr
ou: editors
</pre>

    Ahora tenemos que a&ntilde;adir esta informaci&oacute;n al directorio LDAP. Usamos el programa llamado
    ldapadd
    <p>
    <i><b>ldapadd -D "cn=Manager, o=linuxfocus.org" -w secret &lt; linuxfocus.org.ldif</b></i><br>
    <p>
    Este comando usa "cn=Manager, o=linuxfocus.org" como el dn del manager y 'secret' como password
    y lee la informaci&oacute;n del fichero linuxfocus.org.ldif y la inserta en el directeorio LDAP.<br>
    Si todo va bien ya estamos listos para hacer preguntas a a nuestro directorio LDAP, o si no fue todo bien
    ya est&aacute;s listo para inundarme el correo ;) <br>
    Por el bien de mi servidor de correo espero que todo haya ido bien.
    <p>
    Antes de seguir, examinemos el fichero ldif l&iacute;nea por l&iacute;nea.
    <ol>
        <li>Esta l&iacute;nea define el dn para la entrada de nivel superior. Ser&aacute; la ra&iacute;z
            del &aacute;rbol de directorios.<br>
            Es necesario definirla.
        <li>Esta l&iacute;nea define la o (organizaci&oacute;n) y le da el valor "linuxfocus.org"
        <li>Esta l&iacute;nea define la clase de este objeto. Le indicamos top.
        <li>Aqu&iacute; definimos el tipo del objeto (es un objeto de organizaci&oacute;n)
        <li>La l&iacute;nea en blanco separadora.
        <li>dn para el grupo de editores (esta es la rama hecha para los editores de linuxfocus) <br>
            Como esta rama, podemos tener todas las que queramos para otros prop&oacute;sitos. Por
            ejemplo, una rama con los hosts y sus datos, una rama para mirrors del site, etc. etc.
        <li>aqu&iacute; se define expl&iacute;citamente el atributo ou (unidad organizativa) para los
            editores. <br>
            Estos atributos sirven como &iacute;tems buscables. Por ejemplo, si quieres encontrar todos
            los usuarios que son editores puedes buscar con "show all dn where ou=editors". Si no definimos
            esto aqu&iacute; esta entrada/registro no se encontrar&iacute;a.
        <li>aqu&iacute; definimos el objectclass (organizationalUnit)
        <li>La l&iacute;nea en blanco separadora.
        <li>dn para el usuario aghaffar del grupo de editores
        <li>el uid (aseg&uacute;rate que es &uacute;nico) del usuario
        <li>el cn (common name, nombre com&uacute;n) del usuario. Por ejemplo, yo prefiero escribir el
            nombre como "Nombre Apellido", otros prefieren "Apellido Nombre".
        <li>sn: apellido (en ingl&eacute;s Surname)
        <li>givenname (Nombre)
        <li>objectclass (Persona)
        <li>userpassword (este es un password encriptado). La cadena {CRYPT} indica que este password
            est&aacute; encriptado con el algoritmo crypt. El resto es el password encriptado.
        <li>Esta l&iacute;nea define una direcci&oacute;n de email donde puedo recibir emails.
        <li>ou. Esto define que estoy en la unidad organizativa de editores.
        <li>La l&iacute;nea en blanco separadora.
        <li>de nuevo, dn para otra entrada. Nombre de usuario: mkempe, ou editores
        <li>nombre comun
        <li>apellido
        <li>nombre
        <li>objectclass
        <li>userpassword: aqu&iacute; estamos utilizando un password en texto llano. Se puede usar para
            diferentes usuarios formatos diferentes. Se puede definir en cada entrada y no para toda la
            base de datos. Por lo que un usuario puede tener texto llano, otro puede encriptar con CRYPT,
            otro con SHA etc.
        <li>direcci&oacute;n de mail donde el usuario acepta mail. (Normalmente se usa para el servidor
            de mail).
        <li>maildrop: De nuevo para el servidor de mail. Define d&oacute;nde reside el mail del usuario.
            En este ejemplo, el servidor de mail recibe el mail para la direcci&oacute;n
            "mkempe@linuxfocus.org", el servidor de mail preguntar&aacute; entonces al servidor de LDAP
            "hay alg&uacute;n buz&oacute;n que acepte mail para "mkekpe@linuxfocus.org"?. El servidor
            ldap le devolver&aacute; el valor del atributo maildrop. El servidor de mail enviar&aacute;
            entonces el mail a ese buz&oacute;n. Hablaremos m&aacute;s sobre el tema en otro momento.
            Estoy construyendo la infraestructura de un ISP donde uso bastante LDAP para administrar
            dominios virtuales y toda la informaci&oacute;n sobre dominios y sus usuarios. Si est&aacute;s
            interesado en estas cosas, env&iacute;ame un mail.
        <li>preferredlanguage. Aqu&iacute; tenemos un atributo extra que nos dice el idioma preferido del
            usuario. Podemos usar esta informaci&oacute;n o otras informaciones de preferencias del usuario
            que almacenemos centralmente en el LDAP para proporcionar mejores servicios. Por ejemplo, a
            este usuario siempre se le redirecciona autom&aacute;ticamente a las p&aacute;ginas en
            franc&acute;s. <br>
            F&iacute;jate que el anterior usuario no tiene algunos atributos (preferredlanguage, maildrop,
            etc). Es una de las ventajas de LDAP. No hay una estructura fija, como en una tabla de una base
            de datos. Puedes tener una entrada con solo	3 atributos, mientras que otra puede tener 30.
        <li>ou. la unidad de editores
    </ol>
</p>

<A NAME="lfindex8">&nbsp;</A>
<H2>Interrogando a la base de datos LDAP</H2>


<p>
    Busquemos todos los datos sobre el usuario mkempe<br>
    <p>
    <i>ldapsearch uid=mkempe</i><br><br>
    Busquemos el dn de todos los editores<br>
    <p>
    <i>ldapsearch '(&(objectclass=person)(ou=editors))' dn</i><br>
    <p>
    Si quieres m&aacute;s ejemplos, l&eacute;ete las p&aacute;ginas del manual de ldapsearch <br>
</p>

<A NAME="lfindex9">&nbsp;</A>
<H2>Ventajas de LDAP</H2>


<p>
    &iquest;Cu&aacute;les son las ventajas de cambiar a LDAP?
    <p>
    LDAP es un est&aacute;ndar abierto. La mayor&iacute;a de aplicaciones nuevas que utilices ser&aacute;n
    capaces de buscar informaci&oacute;n en una base de datos. Incluso Windows 2000 usa LDAP para sus
    servicios de directorio.<br>
    Centralizar toda la informaci&oacute;n en un lugar tiene enormes beneficios: un &uacute;nico punto de
    administraci&oacute;n, con menos posibilidad de errores, menos datos duplicados por todas partes,
    y la facilidad de realizar backups.
</p>

<A NAME="lfindex10">&nbsp;</A>
<H2>Implementaciones de ejemplo de LDAP</H2>


<p>
    Yo ahora pdr&iacute;a ser un empleado de Compaq y tratar de venderte LDAP diciendo que puedes usarlo
    como &aacute;dministrador de contactos'. Pero no trabajo para Compaq, Por lo que tratar&eacute; de explicarte
    un uso m&aacute;s interesante de LDAP.
    <P>

    <B><FONT SIZE=+2>ORIGEN &Uacute;NICO DE AUTENTICACI&Oacute;N</font></b>
    <p>
    Cuentas de usuarios en un lugar central.<br>
    Puedes utilizar un &aacute;rbol LDAP para administrar tus usuarios, sus passwords y mucha m&aacute;s
    informaci&oacute;n de la que puedes guardar en un simple fichero /etc/passwd. Esta informaci&oacute;n
    podr&aacute; ser usada por los usuarios de Microsoft Windows, Unix o Mac. <br>
    <p>
    <b>Idea</b> Puedes jugar con los ficheros /etc/pam.d/login, etc para que la autenticaci&oacute;n
    se haga con la informaci&oacute;n de LDAP, en lugar de la del fichero shadow, o de nis etc.<br>
    <P>
    <b>Idea</b> Puedes escribir un peque&ntilde;o interfase web para que los usuarios cambien su password
    de unix sin necesidad de entrar en el sistema, ya que la informaci&oacute;n del password est&aacute;
    en LDAP y no en el sistema. Necesitar&aacute;s usar pam_ldap para esto. Mira el cap&iacute;tulo de
    Recursos para url's sobre pam_ldap. <BR><BR>
    <B>NOTA</b><BR>
    <FONT COLOR="GREEN">&Uacute;nica fuente de autenticaci&oacute;n</font><FONT COLOR="RED"> !=
    </font><FONT COLOR="green">&Uacute;nica autenticaci&oacute;n.</font><BR>
    Muchos vendedores de LDAP tratan de venderlo diciendo que si implementas LDAP tendr&aacute;s una
    soluci&oacute;n de autenticaci&oacute;n &uacute;nica. <BR>
    Es una verdad a medias. La autenticaci&oacute;n &uacute;nica es algo totalmente diferente y
    dif&iacute;cil de conseguir, y que planea estos d&iacute;as sobre los IT Managers.<BR>
    Autenticaci&oacute;n &uacute;nica es, por ejemplo:
    <UL>
        <li>Entras en tu estaci&oacute;n como "aghaffar"
        <LI>Vas a la intranet de la empresa, donde la p&aacute;gina web est&aacute; protegida por
            contrase&ntilde;a, y entras sin autenticarte porque tu identidad ya es conocida por la intranet.
        <LI>Inicias otro programa, por ejemplo SAP, y no te pide de nuevo tu contrase&ntilde;a, porque
            tu identidad e informaci&oacute;n ya est&aacute; ah&iacute;.
        <LI> etc etc etc
    </ul>
    De acuerdo que puedes usar LDAP como fuente de informaci&oacute;n &uacute;nica del usuario, pero la magia
    de controlar las sesiones entre diferentes programas es lo llamado "autenticaci&oacute;n &uacute;nica"
    y no tiene nada que ver con LDAP.<BR>
    Se puede hacer con LDAP, NIS, cuentas de un dominio NT, bases de datos, ficheros planos...
    <p>
    <b>Idea</b> Puedes querer dar a unos usuarios cuentas de correo en tus servidores, pero no crear cuentas
    de unix. Ning&uacute;n problema. Yo uso una combinaci&oacute;n de LDAP, Postfix MailServer y Cyrus
    IMAP/POP Server para controlar miles de usuarios y ninguno de ellos tiene una cuenta en el sistema.
    <p>
    <b>Idea</b> Puedes querer centralizar las preferencias para diferentes aplicaciones. Por ejemplo,
    preferencias de Netscape, bookmarks etc se pueden guardar en LDAP, y el usuario se puede mover de una
    m&aacute;quina a otra, recibiendo sus preferencias de un servidor LDAP. El usuarios puede cambiarse de
    un Netscape de Windows NT a un Netscape de Linux/Solaris/Macintosh y puede usar la misma
    informaci&oacute;n. (Lo siento Microsoft... se que esto es muy malo para vosotros).
    <p>
    <b>Escenario</b>
    Odio rellenar my informaci&oacute;n una vez y otra tanto en la web como en papel. No se porqu&eacute; la
    gente quiere saber una vez y otra mi edad, fecha de nacimiento, direcci&oacute;n... cuando ya se las he
    dado una vez. En mi &uacute;ltima empresa, tuvimos que hacer enormes formularios para el Help-Desk,
    que eran b&aacute;sicamente el 75% de lo mismo (nombre, apellido, cargo, direcci&oacute;n, piso, nombre
    del jefe, departamento). En lugar de agobiar a los usuarios y arriesgarse a que te peguen una paliza por
    la noche, lo mejor es preguntarles a los usuarios solo la informaci&oacute;n necesaria. Por ejemplo,
    p&iacute;deles su userid y obt&eacute;n el resto de la informaci&oacute;n del LDAP, y preg&uacute;ntales
    solo los datos que te falten.<br><br>
    <b>Idea</b> Por ejemplo, si no me va el tel&eacute;fono, la &uacute;nica informaci&oacute;n nueva que
    tengo para ti es &ntilde;o me va el tel&eacute;fono'. <br><br>
    A un usuario le agobiar&aacute; menos la intranet si:
        <li>El usuario escribe la url del formulario de problemas (O clicka un enlace de su p&aacute;gina
            de bookmarks)
        <li>La p&aacute;gina le pregunta al usuario su usuario y password (solo una vez cada sesi&oacute;n.
            En las siguientes visitas a esta p&aacute;gina o otras p&aacute;ginas protegidas, el sistema
            recordar&aacute; su informaci&oacute;n)
        <li>La p&aacute;gina tiene dos partes: 1) &aacute;read de texto donde reportar el problema y 2)
            bot&oacute;n de env&iacute;o.
</p>

<A NAME="lfindex11">&nbsp;</A>
<H2>Escribe art&iacute;culos: ense&ntilde;a y aprende</H2>


<p>
    Espero que con este art&iacute;culo, te pueda ayudar de alguna manera, o colmar tu cerebro hambriento
    con algunos 10011001001001.<br>
    Ya ves, no tienes que ser un experto para compartir tu conocimiento con la comunidad. Ni tienes que ser
    un profesor para escribir tutoriales. Cualquier informaci&oacute;n, por peque&ntilde;a que sea, puede
    ayudar a los usuarios. <br>
    Personalmente, encuentro m&aacute;s f&aacute;cil aprender si trato de ense&ntilde;arle a alguien lo
    que he aprendido. Puedes probar esta t&eacute;cnica...
    <p>
    Afortunadamente, estos d&iacute;as se ve a mucha gente hablando sobre linux. Se ven a muchos de ellos
    prob&aacute;ndolo. Algunos se rinden enseguida, pero otros aguantan m&aacute;s. Puede que no tengan
    ni idea ni ninguna experiencia con el concepto y los comandos de unix. Algunos se atascan en algunos
    problemas mucho tiempo. <br>
    Si t&uacute; te has enfrentado a estos problemas recientemente, eres la mejor persona para
    ense&ntilde;arles.<br><br>
    Si crees que no tienes nada sobre loque escribir, puedes a&uacute;n ayudar a la comunidad Linux. Puedes
    dedicarte a traducir los art&iacute;culos a tu idioma.
</p>

<A NAME="lfindex12">&nbsp;</A>
<H2>Recursos</H2>


<P>
<DL>
    <Dt>
        <A HREF="http://www.padl.com/pam_ldap.html">M&oacute;dulo PAM LDAP</a>
    </dt>
    <Dd>
        El m&oacute;dulo pam_ldap proporciona los medios a las estaciones Solaris y Linux para
        autenticarse contra directorios LDAP, y para cambiar sus passwords en el directorio.
    </dd>
    <DT>
        <A HREF="http://www.openldap.org/">openLDAP</a>
    </dt>
    <DD>
        El proyecto OpenLDAP es un esfuerzo de colaboraci&oacute;n para desarrollar una suite de
        aplicaciones y herramientas de desarrollo LDAP con c&oacute;digo libre, que sear robusta,
        comercial y completa. El proyecto est&aacute; dirigido por una comunidad mundial de voluntarios
        que usa internet para comunicarse, planear y desarrollar la Suite OpenLDAP y su
        documentaci&oacute;n.
    </dd>
    <DT>
        <a href="http://www.iit.edu/~gawojar/ldap/">Excelente navegador/editor LDAP hecho en Java</a>
    </dt>
    <DD>
        El navegador/editor LDAP proporciona un interfase amigable a los directorios LDAP con capacidades
        bien integradas de navegaci&oacute;n y edici&oacute;n. Est&aacute; escrito completamente en Java con
        la ayuda de las librer&iacute;as de clases JFC (SwingSet) y JNDI. Es capaz de conectar con
        servidores LDAP de v2 y v3.
    </dd>
    <DT>
        <A HREF="http://www.mountpoint.ch/oliver/kldap/">kldap</a>
    </dt>
    <DD>
        kldap es un cliente LDAP (navegador) para el KDE. Puedes navegar por el &aacute;rbol de manera
        similar a como lo haces en el Novell Administrator.
    </dd>
    <DT>
        <A HREF="http://freshmeat.net/search.php3?query=ldap">http://freshmeat.net/search.php3?query=ldap</a>
    </dt>
    <DD>
        Montones de utilidades LDAP en Freshmeat.
    </dd>
    <DT>
        <A HREF="http://www.redbooks.ibm.com/abstracts/sg245110.html">
        http://www.redbooks.ibm.com/abstracts/sg245110.html</a>
    </dt>
    <DD>
        LDAP Implementation Cookbook, de IBM<BR>
        Puedes ver el libro online o pedir una copia en papel.
    </dd>
    <DT>
        <A HREF="http://www.padl.com/ldap-nis_gateway.html">ypldapd: una pasarela nis a ldap</a>
    </dt>
    <DD>
        Ypldapd es un servicio de informaci&oacute;n de red (NIS, del ingl&eacute;s Network Information Service)
        que usa LDAP como su fuente de informaci&oacute;n. Si usas ypldapd, los clientes de NIS ya existentes
        pueden usar LDAP de manera transparente para resolver el usuario, grupo e informaci&oacute;n
        de host. Las empresas pueden entonces descubrir los beneficios de LDAP, como su
        distribuci&oacute;n y escalabilidad, sin tener que actualizar los clientes. Usado junto con
        tecnolog&iacute;as de servidor de LDAP como el Directory Server de Netscape, ypldapd puede
        proporcionar autenticaci&oacute;n &uacute;nica tanto a clientes NT como UNIX.
    </dd>
    <DT>
        <A HREF="http://www.umich.edu/~dirsvcs/ldap/doc/guides/slapd/1.html#RTFToC1">
        Introducci&oacute;n a SLAPD y Gu&iacute;a de Administraci&oacute;n de SLURPD</a>
    </dt>
    <DD>
        Imprescindible. Montones de informaci&oacute;n sobre el protocolo LDAP y los servidores LDAP.
    </dd>
    <DT>
        <A HREF="http://www.kingsmountain.com/ldapRoadmap.shtml">An LDAP RaodMap & FAQ</a>
    </dt>
    <DD>
        Un tutorial para navegar sobre varios Servicios de Directorio LDAP y X.500 con recursos de Internet.
    </dd>
    <DT>
        <A HREF="http://www.umich.edu/~dirsvcs/ldap/index.html">
        http://www.umich.edu/~dirsvcs/ldap/index.html</a>
    </dt>
    <DD>
        Lightweight Directory Access Protocol
    </dd>
</dl>
    <BR><BR>
</p>



<!-- vim: set sw=2 ts=2 et: -->

<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=159&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Atif Ghaffar, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article159.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<!-- OLD FORMAT, NO TRANSLATION INFO -->
</TR></TABLE></CENTER>
<p><font size=1>2001-03-30, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
