<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Mutt-i, GnuPG y PGP Como: Integraci&oacute;n de PGP y Mutt</TITLE>
 <LINK HREF="Mutt-GnuPG-PGP-Como-7.html" REL=next>
 <LINK HREF="Mutt-GnuPG-PGP-Como-5.html" REL=previous>
 <LINK HREF="Mutt-GnuPG-PGP-Como.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="Mutt-GnuPG-PGP-Como-7.html">Página siguiente</A>
<A HREF="Mutt-GnuPG-PGP-Como-5.html">Página anterior</A>
<A HREF="Mutt-GnuPG-PGP-Como.html#toc6">Índice general</A>
<HR>
<H2><A NAME="s6">6. Integraci&oacute;n de PGP y Mutt</A></H2>

<P>
<P>La operaci&oacute;n a realizar en los mensajes salientes (firmar, cifrar o ambas) se
elige justo antes de pulsar «<CODE>y</CODE>» para enviar el mensaje, en el men&uacute; de
opciones que aparece con la opci&oacute;n «<CODE>p</CODE>». Una vez elegida la operaci&oacute;n a
realizar simplemente cambiar&aacute; la linea de <EM>PGP</EM> en la cabecera que se
muestra en pantalla, pero hasta que no enviemos el mensaje con «<CODE>y</CODE>» no se
nos pedir&aacute; introducir la frase de paso para activar la firma del mensaje o las
claves publicas a utilizar para el cifrado en caso de que no coincida alg&uacute;n
destinatario con los que tienen clave p&uacute;blica en nuestro anillo de claves.
<P><B>NOTA:</B> En caso de que cometamos un error al introducir la frase de paso
cuando nos es solicitada, parecer&aacute; que <EM>Mutt</EM> se queda «colgado»,
pero no ser&aacute; as&iacute;, si no que estar&aacute; esperando que la volvamos a introducir.
Para ello pulsaremos la tecla <CODE>&lt;Intro&gt;</CODE> y borraremos la contrase&ntilde;a de
la memoria con el juego de teclas <CODE>&lt;Ctrl&gt;F</CODE>.  A continuaci&oacute;n
repetiremos la operaci&oacute;n de enviar el mensaje («<CODE>y</CODE>») y tendremos que volver
a introducir la contrase&ntilde;a.
<P><EM>Mutt</EM>, en este caso, usar&aacute; <EM>PGP/MIME</EM> para enviar el mensaje, de
modo que aparecer&aacute; un nuevo adjunto al mensaje con la firma (si s&oacute;lo hemos
elegido firmar) o cifrar&aacute; el mensaje completo (todas sus partes <EM>MIME</EM>,
adjuntos incluidos) y dejar&aacute; tan solo 2 partes MIME, la primera con la versi&oacute;n
de PGP/MIME y la segunda con el mensaje total (adjuntos incluidos) cifrado (y
firmado si as&iacute; lo solicitamos).
<P><B>Nota:</B> Por varios motivos, como que el lector de correo del destinatario
del mensaje no sea capaz de reconocer el formato <EM>MIME</EM>, podemos necesitar
que la firma no vaya acompa&ntilde;ando al mensaje como un adjunto, sino que aparezca
en el mismo cuerpo del mensaje. Para este modo, ver la secci&oacute;n que trata sobre
<EM>application/pgp</EM> con 
<A HREF="Mutt-GnuPG-PGP-Como-7.html#sec-app-pgp">PGP5</A> y con 
<A HREF="Mutt-GnuPG-PGP-Como-7.html#sec-app-gpg">GnuPG</A>.
<P>En los mensajes entrantes que vengan firmados o cifrados con <EM>PGP/MIME</EM>,
<EM>Mutt</EM> intentar&aacute; verificar la firma y/o descifrarlo autom&aacute;ticamente. Ver la
secci&oacute;n sobre 
<A HREF="Mutt-GnuPG-PGP-Como-8.html#sec-procmail.2">recetas para procmail</A>, en donde
se comenta c&oacute;mo cambiar de forma autom&aacute;tica el tipo <EM>MIME</EM> para los mensajes
recibidos cifrados o firmados, que no indican su tipo <EM>MIME</EM> correctamente.
<P>
<H2><A NAME="sec-opcion"></A> <A NAME="ss6.1">6.1 Ficheros de configuraci&oacute;n opcionales</A>
</H2>

<P>
<P>En las siguientes secciones se habla sobre las modificaciones al fichero de
configuraci&oacute;n de <EM>Mutt</EM> para poder usar 
<A HREF="#sec-conf-pgp2">PGP2</A>, 
<A HREF="#sec-conf-pgp5">PGP5</A>, y 
<A HREF="#sec-conf-gpg">GnuPG</A> con comodidad.
<P>Para ello se usa un fichero de configuraci&oacute;n llamaremos <CODE>.gnupgp.mutt</CODE> (el
nombre es inventado y le podr&iacute;amos llamar de cualquier otro modo, siempre y
cuando <B>indiquemos el origen</B> de este fichero de configuraci&oacute;n en el fichero
de configuraci&oacute;n principal <CODE>~/.muttrc</CODE>.
<P>Esto se hace incluyendo el origen (d&oacute;nde est&aacute; situado) completo del fichero de
configuraci&oacute;n <CODE>.gnupgp.mutt</CODE>, en una l&iacute;nea al final del fichero
<CODE>~/.muttrc</CODE>.  El directorio en el que situemos &eacute;ste u otros
ficheros opcionales de configuraci&oacute;n puede ser cualquiera, siempre y cuando
tengamos los permisos correctos de acceso a &eacute;l (en un cap&iacute;tulo anterior lo
incluimos dentro del directorio <CODE>~/Mail/</CODE>), o podemos crear un
directorio dentro de nuestro directorio de usuario, con un nombre aleatorio:
<P>
<BLOCKQUOTE><CODE>
<PRE>
~$ mkdir mutt.varios
</PRE>
</CODE></BLOCKQUOTE>
<P>en el que copiaremos (o crearemos) el fichero de configuraci&oacute;n opcional
<CODE>.gnupgp.mutt</CODE>, y a continuaci&oacute;n indicaremos el origen en el fichero
<CODE>.muttrc</CODE> con el comando <CODE>source</CODE>, del siguiente modo:
<P>
<BLOCKQUOTE><CODE>
<PRE>
source ~/mutt.varios/.gnupgp.mutt
</PRE>
</CODE></BLOCKQUOTE>
<P>De este modo <EM>Mutt</EM> aceptar&aacute; las variables de configuraci&oacute;n en
<CODE>.gnupgp.mutt</CODE> como si estuvieran directamente especificadas en
<CODE>.muttrc</CODE>.
<P>Este sistema es &uacute;til para evitar tener un fichero de configuraci&oacute;n desordenado
y demasiado grande, y puede ser usado para poner cualquier otro grupo de
variables de configuraci&oacute;n en otro fichero aparte.  Por ejemplo, de modo
parecido aunque no igual, si usamos <EM>vim</EM> como el editor por defecto en
<EM>Mutt</EM>, le podemos indicar a <CODE>.muttrc</CODE> que use un fichero de
configuraci&oacute;n <CODE>.vimrc</CODE> distinto al que usamos cuando usemos <EM>vim</EM> sobre
la l&iacute;nea de comandos.  Para ello, copiaremos primero <CODE>~/.vimrc</CODE> a
nuestro directorio ficticio para ficheros de configuraci&oacute;n opcionales
<CODE>~/mutt.varios/</CODE> y le daremos un nombre distinto (vg.
<CODE>vim.mutt</CODE>):
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ cd /home/usuario
~$ cp .vimrc mutt.varios/vim.mutt
</PRE>
</CODE></BLOCKQUOTE>
<P>a continuaci&oacute;n cambiaremos las variables de configuraci&oacute;n que deseamos que sean
distintas en <EM>vim</EM> como editor de <EM>Mutt</EM>, y finalmente modificaremos
<CODE>.muttrc</CODE> para que refleje este cambio:
<P>
<BLOCKQUOTE><CODE>
<PRE>
set editor="/usr/bin/vim -u ~/mutt.varios/vim.mutt"
</PRE>
</CODE></BLOCKQUOTE>
<P>Con esta &uacute;ltima l&iacute;nea estamos indicando a <CODE>Mutt</CODE> que, en lugar de usar su
editor interno por defecto, use un editor externo, <EM>Vim</EM>, con las opciones
de configuraci&oacute;n que deseamos.
<P>
<H2><A NAME="sec-conf-gen"></A> <A NAME="ss6.2">6.2 Variables de Configuraci&oacute;n General</A>
</H2>

<P>
<P>Hay un n&uacute;mero de variables que nos servir&aacute;n para el uso de cualquiera de los
tres sistemas de cifrado p&uacute;blico con <EM>Mutt</EM> por igual.  &Eacute;stas variables son
del tipo booleano, y aceptan las opciones <B>set</B> (activada) o <B>unset</B>
(desactivada).
<P>En el fichero de configuraci&oacute;n (bien sea <CODE>~/.muttrc</CODE>, o
<CODE>~/mutt.varios/.gnupgp.mutt</CODE>, o el que decidamos), el signo de
almohadilla (<B>#</B>) es un comentario libre y no se interpreta.  Por tanto,
lo usaremos aqu&iacute; delante de la aclaraci&oacute;n a cada una de las variables:
<P>
<DL>
<DT><B>unset pgp_autosign</B><DD><P># si esta variable est&aacute; activada, <EM>Mutt</EM> nos pedir&aacute; firmar todo el<BR>
# correo saliente. 
<A HREF="#uno">(1)</A><P>
<DT><B>unset pgp_autoencrypt</B><DD><P># si esta variable est&aacute; activada, <EM>Mutt</EM> nos pedir&aacute; cifrar todo el<BR>
# correo saliente. 
<A HREF="#uno">(1)</A><P>
<DT><B>set pgp_encryptself</B><DD><P># guardar una copia cifrada de todos los mensajes que se env&iacute;en cifrados<BR>
# (precisa de la variable de configuraci&oacute;n general <CODE>set copy=yes</CODE>).
<P>
<DT><B>set pgp_replysign</B><DD><P># al responder a un mensaje firmado, requerir que el mensaje de respuesta<BR>
# sea tambi&eacute;n firmado.
<P>
<DT><B>set pgp_replyencrypt</B><DD><P># al responder a un mensaje cifrado, requerir que nuestra respuesta<BR>
# tambi&eacute;n vaya cifrada.
<P>
<DT><B>set pgp_verify_sig=yes</B><DD><P># ¿queremos que se verifique autom&aacute;ticamente las firmas de los mensajes<BR>
# entrantes? ¡por supuesto que s&iacute;!
<P>
<DT><B>set pgp_timeout=&lt;n&gt;</B><DD><P># eliminar la contrase&ntilde;a de la memoria intermedia cada &lt;n&gt;<BR>
# segundos.
<A HREF="#dos">(2)</A><P>
<DT><B>set pgp_sign_as=&quot;0xABC123D4&quot;</B><DD><P># ¿qu&eacute; clave quiero usar por defecto para firmar los mensajes salientes?<BR>
# <B>Nota:</B> es posible especificar un id de usuario en lugar de un id de<BR>
# clave, pero esto podr&iacute;a confundir si tenemos el mismo id de usuario<BR>
# para distintas claves.<BR>
<P>
<DT><B>set pgp_strict_enc</B><DD><P># usar codificaci&oacute;n «quoted-printable» siempre que PGP la<BR>
# requiera.
<P>
<DT><B>unset pgp_long_ids</B><DD><P># no usar identificadores de claves de 64 bits, usar de 32 bits.<BR>
<P>
<DT><B>set pgp_sign_micalg=&lt;algo&gt;</B><DD><P># algoritmo de comprobaci&oacute;n de la integridad de un mensaje, en donde<BR>
# &lt;algo&gt; es uno de los siguientes:
<A HREF="#tres">(3)</A><P>
<UL>
<LI><B>pgp-mda5</B><BR>
para claves RSA</LI>
<LI><B>pgp-sha1</B><BR>
para claves DSS (DSA)</LI>
<LI><B>pgp-rmd160</B><BR></LI>
</UL>
</DL>
<P>En las tres subsecciones siguientes se especificar&aacute;n las variables a configurar
para cada una de las versiones.  La cuarta subsecci&oacute;n explica los cambios en
las variables en caso de que usemos m&aacute;s de una versi&oacute;n.
<P>(1)
<A NAME="uno"></A>  dado que el cont&iacute;nuo requerimiento por parte de <EM>Mutt</EM>
para que firmemos o cifremos todos los mensajes salientes puede representar un
inconveniente, es deseable dejar esta variable desactivada.  Esto es
especialmente as&iacute; en el caso del cifrado, ya que no dispondremos de las claves
p&uacute;blicas de todos los destinatarios.
<P>(2)
<A NAME="dos"></A>  depende del n&uacute;mero de mensajes que firmemos o descifremos
generalmente, nos interesar&aacute; mantener la contrase&ntilde;a en la memoria durante m&aacute;s o
menos tiempo.  Esta opci&oacute;n nos evita que tengamos que introducir la contrase&ntilde;a
por cada mensaje que firmemos, o por cada mensaje cifrado que leamos.
<B>Aviso:</B> mantener la contrase&ntilde;a en la memoria es inseguro, especialmente en
sistemas conectados a una red.
<P>(3)
<A NAME="tres"></A>  esto s&oacute;lo es necesario para la clave con la que hayamos
configurado para firmar.  Cuando la clave la escojamos desde el men&uacute; de
composici&oacute;n, <EM>Mutt</EM> se encargar&aacute; de calcular el algoritmo.
<P>
<H2><A NAME="sec-conf-pgp2"></A> <A NAME="ss6.3">6.3 Variables de Configuraci&oacute;n para PGP2</A>
</H2>

<P>
<P>Para utilizar PGP2 con <EM>Mutt-i</EM> es necesario a&ntilde;adir las siguientes
l&iacute;neas al fichero <CODE>~/mutt.varios/.gnupgp.mutt</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
set pgp_default_version=pgp2
set pgp_key_version=default
set pgp_receive_version=default
set pgp_send_version=default
set pgp_sign_micalg=pgp-md5
set pgp_v2=/usr/bin/pgp
set pgp_v2_pubring=~/.pgp/pubring.pgp
set pgp_v2_secring=~/.pgp/secring.pgp
</PRE>
</CODE></BLOCKQUOTE>
<P>Evidentemente, deber&aacute;n existir los ficheros <CODE>~/.pgp/pubring.pgp</CODE> y
<CODE>secring.pgp</CODE>. M&aacute;s informaci&oacute;n sobre PGP2 con el comando <CODE>man pgp</CODE>.
<P>
<H2><A NAME="sec-conf-pgp5"></A> <A NAME="ss6.4">6.4 Variables de Configuraci&oacute;n para PGP5</A>
 </H2>

<P>
<P>Para utilizar PGP5 con <EM>Mutt-i</EM> es necesario a&ntilde;adir las siguientes
l&iacute;neas al fichero <CODE>~/mutt.varios/.gnupgp.mutt</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
set pgp_default_version=pgp5
set pgp_key_version=default
set pgp_receive_version=default
set pgp_send_version=default
set pgp_sign_micalg=pgp-sha1
set pgp_v5=/usr/bin/pgp
set pgp_v5_pubring=~/.pgp/pubring.pkr
set pgp_v5_secring=~/.pgp/secring.skr
</PRE>
</CODE></BLOCKQUOTE>
<P>Evidentemente, deber&aacute;n existir los ficheros <CODE>~/.pgp/pubring.pkr</CODE> y
<CODE>secring.pkr</CODE>. M&aacute;s informaci&oacute;n sobre PGP 5 con el comando <CODE>man pgp5</CODE>.
<P>
<H2><A NAME="sec-conf-gpg"></A> <A NAME="ss6.5">6.5 Variables de Configuraci&oacute;n para GnuPG</A>
</H2>

<P>
<P>Para utilizar <EM>GnuPG</EM> con <EM>Mutt-i</EM> es necesario a&ntilde;adir las siguientes
l&iacute;neas al fichero <CODE>~/mutt.varios/.gnupgp.mutt</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
set pgp_default_version=gpg
set pgp_key_version=default
set pgp_receive_version=default
set pgp_send_version=default
set pgp_sign_micalg=pgp-sha1
set pgp_gpg=/usr/bin/gpg
set pgp_gpg_pubring=~/.gnupg/pubring.gpg
set pgp_gpg_secring=~/.gnupg/secring.gpg
</PRE>
</CODE></BLOCKQUOTE>
<P>Evidentemente, deber&aacute;n existir los ficheros <CODE>~/.gnupg/pubring.gpg</CODE>
y <CODE>secring.gpg</CODE>. M&aacute;s informaci&oacute;n sobre GnuPG com el comando <CODE>man
gpg.gnupg</CODE>, <CODE>man gpgm</CODE>, y <CODE>man gpg</CODE>.
<P>
<H2><A NAME="sec-conf-mix"></A> <A NAME="ss6.6">6.6 Variables de Configuraci&oacute;n Mixta</A>
</H2>

<P>
<P>En el caso que deseemos tener m&aacute;s de uno de los tres sistemas a la vez, es
preciso modificar algunas de las variables que hemos comentado anteriormente.
En realidad tan s&oacute;lo se trata de eliminar la redundancia en la versi&oacute;n
configurada por defecto.
<P>Si, por ejemplo, decidi&eacute;ramos usar GnuPG como el sistema a utilizar por
defecto, todas las teclas relacionadas con PGP/GnuPG de <EM>Mutt</EM> llamar&iacute;an a
&eacute;ste sistema para cualquier operaci&oacute;n de cifrar, descifrar, firmar, verificar,
etc...<BR> Para ello debemos definir la variable de configuraci&oacute;n
<CODE>$set_pgp_default</CODE> <B>una s&oacute;la vez</B>, as&iacute;:
<P>
<BLOCKQUOTE><CODE>
<PRE>
set pgp_default_version=gpg
</PRE>
</CODE></BLOCKQUOTE>
<P>con lo cual, y para el uso conjunto de los tres sistemas, la parte
correspondiente al fichero <CODE>~/mutt.varios/.gnupgp.mutt</CODE> podr&iacute;a
quedar del siguiente modo:
<P>
<BLOCKQUOTE><CODE>
<PRE>
set pgp_default_version=gpg     # versi&oacute;n a usar por defecto

set pgp_key_version=default     # clave que se usar&aacute; por defecto, en este
                                # caso la definir&aacute; gnupg

set pgp_receive_version=default # para descodificar usar&aacute; la versi&oacute;n que se
set pgp_send_version=default    # haya configurado por defecto (gpg)

set pgp_gpg=/usr/bin/gpg        # localizaci&oacute;n del binario de GnuPG
set pgp_gpg_pubring=~/.gnupg/pubring.gpg        # fichero de claves pub. GnuPG
set pgp_gpg_secring=~/.gnupg/secring.gpg        # fichero de claves secr. GnuPG

set pgp_v2=/usr/bin/pgp         # localizaci&oacute;n del binario de PGP2
set pgp_v2_pubring=~/.pgp/pubring.pgp           # fichero de claves pub. PGP2
set pgp_v2_secring=~/.pgp/secring.pgp           # fichero de claves secr. PGP2

set pgp_v5=/usr/bin/pgp         # localizaci&oacute;n del binario de PGP5
set pgp_v5_pubring=~/.pgp/pubring.pkr           # fichero de claves pub. PGP5
set pgp_v5_secring=~/.pgp/secring.skr           # fichero de claves secr. PGP5
</PRE>
</CODE></BLOCKQUOTE>
<P>
<HR>
<A HREF="Mutt-GnuPG-PGP-Como-7.html">Página siguiente</A>
<A HREF="Mutt-GnuPG-PGP-Como-5.html">Página anterior</A>
<A HREF="Mutt-GnuPG-PGP-Como.html#toc6">Índice general</A>
</BODY>
</HTML>
