<HTML>
<HEAD>
<TITLE>fuente_ISO-COMO: Introducci&oacute;n </TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Fuente-ISO-Como-2.html">Siguiente</A>
<A HREF="Fuente-ISO-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="intro"></A> <A NAME="s1">1. Introducci&oacute;n </A></H2>


<P>Las distribuciones de Linux que conozco traen por defecto la misma fuente
que el DOS (p&aacute;gina de c&oacute;digos 437). Para hacer que el sistema funcione como
si la fuente fuera <I>ISO</I>, se emplea un extra&ntilde;o <I>``remapeo''</I> para
hacer que al representarse determinado car&aacute;cter, no salga por pantalla el
que en la fuente ocupa dicha posici&oacute;n.</P>
<P>Para saber si este es el caso de tu sistema, mira el siguiente car&aacute;cter: <BR></P>
<P><B>&Aacute;</B> <BR></P>
<P>Si est&aacute;s viendo una A may&uacute;scula con acento agudo, este documento no te hace
falta. Si ves un cuadrado, te puede interesar. Por supuesto lo anterior se
aplica si est&aacute;s mirando este documento en su versi&oacute;n texto desde la consola,
o bien la versi&oacute;n <CODE>html</CODE> desde el <CODE>lynx</CODE>. Si lo est&aacute;s viendo desde X o 
leyendo una versi&oacute;n impresa, deber&iacute;as ver la A en cualquier caso.</P>
<P>Tambi&eacute;n puedes probar <CODE>man iso_8859_1</CODE> desde la consola 
(seg&uacute;n tu
distribuci&oacute;n y de si instalaste el manual o no, es posible que no tengas
esta p&aacute;gina) y comprobar si los caracteres mostrados se corresponden con
su descripci&oacute;n y si ves correctamente <B>todos</B> ellos. Es muy posible
que gran parte aparezcan como cuadrados en vez de corresponderse con la
descripci&oacute;n que traen a la derecha.</P>
<P>Si quieres disponer de todos los caracteres necesarios para una correcta
escritura de la lengua castellana (y varias otras), puedes seguir los pasos
que se describen en este documento. Para los recelosos, comentar que esto no
implica la p&eacute;rdida de s&iacute;mbolos gr&aacute;ficos, y que si se hace bien, seguiremos
viendo los cuadraditos en nuestras aplicaciones favoritas (<CODE>mc</CODE>, <CODE>slrn</CODE>,
etc.).La &uacute;nica pega es que las
l&iacute;neas horizontales no salen unidas, cosa que creo que se debe a que la VGA
s&oacute;lo hace esto para ciertas posiciones de la tabla de caracteres. No
obstante puedo asegurar que se puede sobrevivir sin ello.</P>
<P>A lo largo del documento aparecen varios ejemplos de comandos. Cuando &eacute;stos
empiezan por <CODE>#</CODE> significa que quien debe ejecutarlos es el
superusuario (<CODE>root</CODE>). Cuando aparecen precedidos por <CODE>$</CODE>
significa que pueden ser ejecutados por cualquier usuario.</P>

<HR>
Anterior
<A HREF="Fuente-ISO-Como-2.html">Siguiente</A>
<A HREF="Fuente-ISO-Como.html#toc1">Indice</A>
</BODY>
</HTML>
