<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML lang="en">

<HEAD>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<TITLE>LinuxFocus Julio 1998: Creando y Editando Animaciones con GIMP</TITLE>
</HEAD>



<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">



<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../">
<AREA shape="rect" coords="423, 9, 457, 30" alt="Map" href="../map.html">
<AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="../indice.html">
<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/">
</MAP>



<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15"   alt="News" href="../News/">
<AREA shape="rect" coords="189, 0, 284, 15"  alt="Archives" href="../Archives/">
<AREA shape="rect" coords="319, 0,  395, 15" alt="Links" href="../Links">
<AREA shape="rect" coords="436, 0,  523, 15" alt="About LF" href="../aboutus.html">
</MAP>



<CENTER>
<IMG src="../../common/images/../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top Bar]" ismap usemap="#top" ><BR>
<IMG src="../../common/images/../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom Bar]" ismap usemap="#bottom">
</CENTER>


<!-- BREVE BIO DEL AUTOR -->
<TABLE  align="left" width="30%" border="0" cellspacing="0" cellpadding="5">

<TR>
 <TD>
   <IMG src="../../common/images/Who.gif" width="173" height="164" alt="[Photo of the Author]"><BR>
   <FONT color="#336633" size="+2">Phil Ross </FONT><BR>
<!--
   <FONT color="#336633">Acerca del Autor</FONT>: 
   [write a one to two paragraph bio here]
   <BR>
-->
<br>
<A HREF="mailto:phil@ryoko.cis.pitt.edu">Escribe al autor</A>
<br>



<!--   INDEX      -->



 </TD>
</TR>

</TABLE>




<TABLE>

<TR>
<TD>


<!--   BODY OF THE ARTICLE    -->
<H2> Creando y Editando Animaciones con GIMP</H2>
<IMG src="../../common/images/illustration28.gif" alt="[Ilustration]" width="100" height="100" hspace="10" >

<P align="top">
<FONT color="#336633" size="2">Resumen</FONT>: 
<FONT size="2" face="Helvetica,Arial,Roman">
En nuestra columna regular de Gimp describimos algunas t&eacute;cnicas simples para crear y editar
animaciones usando Gimp.
</FONT>

</P>


<BR clear="all">
<BR>
<HR size="0" noshadow>



<P>Hola, y bienvenido a mi tercer tutorial de Linux Focus sobre GIMP. Esta
vez no seguir&eacute; cualquier trabajo de Manuel, sino que har&eacute; algo completamente
s&oacute;lo con GIMP. Me gustar&iacute;a mostrar unas peque&ntilde;as facultades de la animaci&oacute;n de GIMP.
&Eacute;stas no son demasiadas complejas, pero si son lo suficiente buenas para
ser &uacute;tiles.</P>

<P>Primero, hablemos de lo que es una animaci&oacute;n. La palabra Animaci&oacute;n es
derivada de la palabra latina <I>anima</I> que significa vida o alma. Una
animaci&oacute;n, a diferencia de una pintura, parece tener vida. Puesto que una
caracter&iacute;stica com&uacute;n de muchas cosas vivientes es el movimiento, ¿qu&eacute; mejor
manera de dar vida a una imagen ponerle movimiento?</P>

<P>Para aquellos  que no est&aacute;n   familiarizados, el m&eacute;todo tradicional
que los  artistas han utilizado para  darles movimiento a sus im&aacute;genes
es crear m&uacute;ltiples im&aacute;genes. Cada imagen representa una toma diferente
de  la escena en  el  tiempo , conocida  como  cuadro, y estos cuadros
est&aacute;n organizados en un  orden cronol&oacute;gico, desde  el primer cuadro al
&uacute;ltimo cuadro.  La   animaci&oacute;n es simplemente  un  slideshow  de estos
cuadros.  Una   animaci&oacute;n puede parecer  muy real   si es  vista  a la
velocidad apropiada.  La velocidad de una  animaci&oacute;n es mejor conocida
como "velocidad por cuadro" y est&aacute; frecuentemente medida en cuadro por
segundo. Veamos lo que GIMP tiene para ofrecer a la animaci&oacute;n.</P>

<P><IMG  ALIGN=RIGHT  BORDER=0      SRC="../../common/images/figure28-1.jpg"    width="329"
height="252"> Creo que en el primer y segundo  tutorial de Linux Focus
sobre  GIMP   usamos y hablamos  acerca  de   las funciones  Layers de
GIMP. Fuimos capaces de hacer cosas buenas con layers, y cr&eacute;anlo o no,
las funciones  Layers van tambi&eacute;n a jugar   un papel importante  en la
creaci&oacute;n  de nuestra  animaci&oacute;n. En  suma, cada  layer actuar&aacute; como un
cuadro aparte. El &uacute;ltimo cuadro ser&aacute; el primer cuadro en la animaci&oacute;n,
y los  cuadros son mostrados desde el  &uacute;ltimo al primero utilizando la
opci&oacute;n de Animation  Playback del filter  menu. Ahora vamos a crear un
peque&ntilde;o ejemplo de animaci&oacute;n.</P>

<P>Bien,  esta noche parezco  estar de humor  como para tomar un viejo
ejemplo de Microsoft. Si &eacute;sto les ofende,  pido disculpas...&eacute;sto no es
un  capricho, es s&oacute;lo  un buen ejemplo. De  todas formas, quiero hacer
una peque&ntilde;a animaci&oacute;n acerca de Microsoft, as&iacute; que la primera cosa que
hago   es crear el logo de   Microsoft en texto   negro sobre un fondo
blanco. La fuente m&aacute;s parecida al logo real  de Microsoft es la fuente
"Eras". Esta fuente no es inclinada,  pero si lo  fuera, apuesto a que
podr&iacute;amos   obtener una   fuente    muy  parecida  a  la    fuente  de
Microsoft.  &Eacute;sta es  lo suficientemente parecida  para nuestro ejemplo
aunque... no necesita ser perfecto.

<CENTER><IMG BORDER=0 SRC="../../common/images/figure28-2.jpg" width="400" height="100"></CENTER>
</P>


<P>Ahora lo que har&eacute;  es colocar el logo de  Microsoft en el fondo del
cuadro. Abro el Layers & Channels dialog box, y hago click en el bot&oacute;n
Duplicate Layer,  el cual es el bot&oacute;n  que muestra dos hojas de papel,
una sobre en el tope de la otra, como su icon.  Esto crear&aacute; otra copia
del layer,  y ligeramente modificar&eacute; &eacute;ste  nuevo layer, que  es el que
estar&aacute;  en el tope.  Har&eacute; click en  el layer  para asegurarme que est&aacute;
activo,  entonces  elijo Rectangular Select desde    el toolbox. Voy a
image window y selecciono la  &uacute;ltima letra del logo,  que es una "t" y
creo un select box a  su alrededor. Luego  lo selecciono y obtendremos
el  borde seleccionado animado (luce  similar a hormigas marchando), y
cuando coloco  el cursor  del  mouse dentro de  la regi&oacute;n selecionada,
aparece una cruz tetra-direccional.   Esto significa que  puedes hacer
click y drag  esa  regi&oacute;n seleccionada  para moverla.  Lo que entonces
quiero  hacer es  moverlo  hacia  abajo ligeramente   5 pixels o   m&aacute;s
aproximadamente. Entonces hago  Ctrl+H  para asegurar la regi&oacute;n  en su
nueva posici&oacute;n.  <CENTER><IMG BORDER=0 SRC="../../common/images/figure28-3.jpg" width="400"
height="100"></CENTER>
</P>

<P>Ahora regreso a  mi Layers dialog  box y duplico  el layer del tope
para  hacer un tercer  layer. Entonces hago  click sobre  el nuevo top
layer  para  activarlo, me  aseguro  que mi  Rectangular  Selection es
seleccionada desde el  toolbox,  y regreso  a  mi image window.   All&iacute;
selecciono  las &uacute;ltimas DOS letras del  logo, que son  "f" y "t" y las
muevo  a  una nueva regi&oacute;n  5 o  m&aacute;s  pixels m&aacute;s  abajo.  <CENTER><IMG
BORDER=0 SRC="../../common/images/figure28-4.jpg" width="400" height="100"></CENTER>
</P>

<P>Esto  puede ser dif&iacute;cil  de  observar sobre  esta p&aacute;gina,  pero las
letras est&aacute;n empezando lentamente y suavemente  a dispersarse. As&iacute; que
para desplazarlo hacia abajo completamente, voy a continuar duplicando
cada top layer, activo el nuevo top layer, selecciono otra letra m&aacute;s y
la bajo 5 pixels m&aacute;s o menos.  B&aacute;sicamente quiero hacer &eacute;sto hasta que
el logo desaparezca.</P>

<P>Cuidado, &eacute;sto  puede ser un  poco problem&aacute;tico. Encontr&eacute; que es m&aacute;s
f&aacute;cil hacer invisibles los layers inferiores  que los superiores. Esto
se puede lograr haciendo click sobre los eye icons en la Layers dialog
box  la cual desactiva  el eye  icon  para ese layer. Tambi&eacute;n,  cuando
bajas una regi&oacute;n,  cualquier &aacute;rea usada es   cubierta por esa  regi&oacute;n,
pero si no es cubierta, podr&iacute;a llegar a ser transparente. En este caso
tendr&aacute;s que escoger tu l&aacute;piz o paint brush y pintarla.</P>

<P><IMG    ALIGN=RIGHT  BORDER=0   SRC="../../common/images/figure28-5.jpg"     width="236"
height="335">   Despu&eacute;s de   este    proceso  tengo   15  cuadros   en
total. Renombr&eacute; los  cuadros y coloqu&eacute; n&uacute;meros  al lado de cada cuadro
haciendo  doble click sobre   el texto en  cada layer.  Aqu&iacute; est&aacute; otro
consejo. En  el t&iacute;tulo de cada  layer, puedes especificar un  valor de
tiempo de un milisegundo   entre  par&eacute;ntesis y el Animation   Playback
filter mostrar&aacute;  ese cuadro en particular por  esa cantidad de tiempo.
De esta  manera puedes   controlar  la velocidad   por cuadro  de   la
animaci&oacute;n.  No tienes que  mantener la velocidad por cuadro constante,
puedes cambiarla con cada cuadro. Para mi ejemplo us&eacute; un delay time de
50 milisegundos para cada cuadro.</P>

<P>Ahora tenemos  nuestra sarc&aacute;stica animaci&oacute;n  representando la ca&iacute;da
de Microsoft,  y   queremos guardarla para   que podamos  colocarla en
nuestra webpage.  GIMP nos permite guardar  esta animaci&oacute;n como un GIF
animado el cual permitir&aacute; disfrutar a los web browsers mir&aacute;ndolo tanto
como nosotros disfrutamos  cre&aacute;ndolo.   Antes de  guardarlo  como GIF,
necesitamos estar seguros de que nuestra  imagen est&aacute; en un formato de
color-indexado en lugar RGB. El t&iacute;tulo de la image window nos dar&aacute; esa
informaci&oacute;n entre par&eacute;ntesis.  Si dice RGB  y no indexado, tendr&aacute;s que
hacer click con el bot&oacute;n derecho del  rat&oacute;n sobre la image window para
obtener el men&uacute;, y entonces elige Image->Indexed. Obtenemos un mensaje
desde   GIMP diciendo que 255 colores   o menos es   &oacute;ptimo si estamos
haciendo GIFs animados  o transparentes.  Obtenemos una Indexed  Color
Conversion  box la cual nos permite  escoger algunas  opciones para la
conversi&oacute;n. Yo  s&oacute;lo  uso las opciones  por defecto   y hago click  en
OK. La barra de t&iacute;tulo muestra que la imagen has  sido convertida a un
color indexado.</P>

<P>Ahora queremos guardar la imagen, as&iacute; que vamos a la image window y
con el bot&oacute;n derecho del rat&oacute;n obtenemos  el men&uacute;. Elige File->Save As
para que aparezca la Save Image box. Entonces escogemos el lugar donde
guardar el archivo  y  escribe el  nombre en el  sitio  apropiado.  Yo
nombr&eacute; a mi  animaci&oacute;n DownfallOfMicrosoft.gif, y GIMP autom&aacute;ticamente
determin&oacute; que era para guardarse en formato GIF, y entonces hice click
en OK. Ahora la  Save As GIF box aparece  y nos permite elegir algunas
opciones  para  el formato   del archivo.   Puedes  escoger guardar el
archivo  en  formato  entrelazado o  no.    Puedes  elegir guardar  un
comentario  en el  archivo, puedes  tener el GIF  animado en  un bucle
constantemente,  puedes colocar el default delay   para los cuadros en
los  que no especificaste  un  delay time en  el  Layers dialog box, y
elegir  c&oacute;mo los  cuadros  interact&uacute;an entre s&iacute;  durante la animaci&oacute;n.
Estas opciones son cuesti&oacute;n de gusto personal, as&iacute; que experimenta con
ellas y observa cuales hacen que tu animaci&oacute;n se vea mejor.</P>


<P>Aqu&iacute; abajo mi animaci&oacute;n resultante. Muy simple pero t&uacute; puedes
obviamente hacer m&aacute;s si eres los suficientemente creativo. Pude haber
incluido un poderoso logo de Linux que vendr&iacute;a desde arriba pisoteando 
al logo de Microsoft, pero con mi suerte de haberlo hecho seguro recibir&iacute;a
llamadas amenazantes de algunos de sus abogados.
<CENTER><IMG BORDER=0 SRC="../../common/images/figure28-6.gif" width="400" height="100"></CENTER>
</P>

<CENTER><TABLE WIDTH="75%">
<TABLE>
<TR><TD BGCOLOR=#9999FF>
<CENTER><B><U>¡Otra buena caracter&iacute;stica de GIMP!</U></B></CENTER>
<P>Esta caracter&iacute;stica depende si o no est&aacute;s usando una pre-built
versi&oacute;n de GIMP o si la compilaste t&uacute; mismo. Yo no utilizo pre-built
software. Siempre compilo mi software as&iacute; que conozco exactamente lo que
pas&oacute; en el proceso de compilaci&oacute;n. Otra buena caracter&iacute;stica de GIMP es 
el proceso de compilaci&oacute;n. Aunque toma un poco de tiempo compilar GIMP
incluso en una m&aacute;quina Pentium de &uacute;ltima generaci&oacute;n, es muy f&aacute;cil hacerlo.
El script de auto-configuraci&oacute;n de GNU ejecuta y encuentra cuales bibliotecas 
posees en el sistema y cuales no. Si hay bibliotecas que son esenciales
para la operaci&oacute;n de GIMP y no las tienes instaladas, &eacute;l te notificar&aacute; y
se detiene. Si hay bibliotecas opcionales que no tienes, el
script simplemente te dice que el plug-in que necesita esa biblioteca
no ser&aacute; construido</P>

<P>As&iacute; si est&aacute;s compilando GIMP t&uacute; mismo y tiene la biblioteca MPEG
instalada, o si tienes la suerte de obtener una pre-built versi&oacute;n de GIMP
que tenga la biblioteca MPEG built in, ser&aacute;s capaz de cargar archivos MPG 
a GIMP!  GIMP cargar&aacute; el archivo y decodificar&aacute; cada cuadro en su propio
layer. Puedes entonces editar el archivo MPG como si fuera una imagen normal.
</TD></TR>
</TABLE>
</CENTER>


<HR size="1" noshade>

<p align=right><i>Traducido por 
<A HREF="mailto:progmusic@yahoo.com"><FONT color="#000000">Ruben Sotillo</font></A></I></P>



</TD>
</TR>
</TABLE>


<!-- ARTICLE FOOT -->
<BR clear="all">
<CENTER>
<TABLE width="95%">

<TR>
 <TD align="center" bgcolor="#666666">
  <FONT color="#ffffff">
  This website is maintained by Miguel &Aacute;ngel Sep&uacute;lveda<BR>
 &copy; Phil Ross 1998<BR>
  <B>LinuxFocus 1998</B>
  </FONT>
 </TD>
</TR>

</TABLE>
</CENTER>



</BODY>

</HTML>






