<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML lang="en">

<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<TITLE>Linux al servicio de los artistas en  BUF COMPAGNIE</TITLE>

</HEAD>

<BODY bgcolor="#FFFFFF"  text="#000000" alink="#FF0000" link="#FF0000" vlink="#FF0000">

<TABLE border="0" width="100%" bgcolor="#ffffff" cellpadding="5" cellspacing="5">




<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../">
<AREA shape="rect" coords="423, 9, 457, 30" alt="Map" href="../map.html">
<AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="../indice.html">
<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/">
</MAP>



<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15"   alt="News" href="../News/">
<AREA shape="rect" coords="189, 0, 284, 15"  alt="Archives" href="../Archives/">
<AREA shape="rect" coords="319, 0,  395, 15" alt="Links" href="../Links">
<AREA shape="rect" coords="436, 0,  523, 15" alt="About LF" href="../aboutus.html">
</MAP>



<CENTER>
<IMG src="../../common/images/../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top Bar]" ismap usemap="#top" ><BR>
<IMG src="../../common/images/../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom Bar]" ismap usemap="#bottom">
</CENTER>



<TR valign="top">

<TD width="25%" bgcolor="#ffffff">

<CENTER>

<A HREF="mailto:vidalc@club-internet.fr"><IMG src="../../common/images/Charles-V.jpg" width="100"

height="106" ALT="el autor"></A>

<BR>

<FONT color="#336633" size=5>
Charles Vidal
</FONT>

</CENTER>

<BR>

<FONT   color="#336633">El  autor</FONT>: Estudiante.  <A
HREF="http://www.chez.com/juvigny/Asso/">Presidente d'Apod&eacute;line</A>

<BR>

<BR>

<BR>

<BR>

<CENTER>

<IMG src="../../common/images/Arnaud-L.jpg" width="100" height="" ALT="El entrevistado">

<BR>

<FONT color="#336633" size="5">
Arnaud Lamorlette
</FONT>

</CENTER>

<BR>

<FONT color="#336633" size="2">Director de investigaci&oacute;n</FONT>: 

<A HREF="http://wwwusers.imaginet.fr/~buf/">BUF Compagnie</A>


<BR>

<BR>

<BR>

<CENTER><A HREF="../../common/images/figure31-2.jpg">Ver una pantalla de Linux.</A></CENTER>

<BR>



</TD>

<TD width="75%" bgcolor="#ffffff">

<H1>Linux al servicio de los artistas en BUF COMPAGNIE</H1>

<A HREF="http://wwwusers.imaginet.fr/~buf/">

<IMG src="../../common/images/illustration32.jpg" width="100" height="100" align="left" hspace="10" ALT="BUF COMPAGNIE"></A>





<FONT color="#336633" size="2">Resumen</FONT>: 

<FONT  size="2"  font="Helvetica,Arial,Roman">BUF   es  una   compa&ntilde;&iacute;a
especializada en  la infograf&iacute;a, habiendo realizado efectos especiales
en   films como  Batman  y  Robin.    Arnaud  Lamorlette, director  de
investigaci&oacute;n  y  desarrollo  nos   cuenta  c&oacute;mo  y   porqu&eacute; se  est&aacute;n
decantando poco a poco por Linux
</FONT>

<BR clear="all">

<BR>

<HR size="0" noshadow>



<UL>

<LI><I>CV: Buenos d&iacute;as.  &iquest;Cu&aacute;l  es su nombre?  &iquest;A qu&eacute; se
dedica la compa&ntilde;&iacute;a <A HREF="http://wwwusers.imaginet.fr/~buf/">BUF</A>
y cu&aacute;l su funci&oacute;n en la empresa?.</I>

<p>Me llamo Arnaud Lamorlette , soy  responsable de la investigaci&oacute;n y
el      desarrollo  en la <A HREF="http://wwwusers.imaginet.fr/~buf/">
compa&ntilde;&iacute;a BUF</A>.

<p>
Mi  funci&oacute;n es  encontrar soluciones para  hacer  las im&aacute;genes lo  m&aacute;s
bellas   posibles.  La   compa&ntilde;&iacute;a   BUF es  una sociedad   que   se ha
especializado en la infograf&iacute;a.  Comenc&eacute; mi actividad hace 13 a&ntilde;os, en
1985.  Hemos realizado los efectos especiales  de los films Visitantes
1 y   2, Batman y  Robin,  La ciudad  de  los ni&ntilde;os  perdidos, algunos
videoclips   como  los de Rolling   Stones,   BIORK y  muchos anuncios
publicitarios.


</P><li><I> CV:  &iquest;Cu&aacute;l es su parque inform&aacute;tico?
</I><p>

Ahora   est&aacute;   constituido   principalmente  por   m&aacute;quinas    Silicon
Graphics. Empezamos nuestra  andadura en 1985   con PCs (Intel  286) y
UNIX.

Pod&iacute;amos desarrollar pel&iacute;culas, pero con mucha paciencia.  Hoy tenemos
75  m&aacute;quinas   <A  HREF="http://www.sgi.com/"> Silicon   Graphics </A>
conectadas en red, y un PC con cuatro procesadores Intel.


</P><li><I>CV: &iquest;Qu&eacute; software  utilizan?</I><p>


Utilizamos programas de desarrollo propio (de modelizaci&oacute;n, animaci&oacute;n,
gesti&oacute;n  de  producci&oacute;n,  etc.).    Nos  servimos tambi&eacute;n  de  algunos
programas comerciales, en los que  hacemos plug-ins: Softimage, flint,
<A    HREF="http://www.softimage.com/Products/3D/mrShaders.htm">mental
ray</A> , alias, photoshop ...</P>





<CENTER><A        HREF="../../common/images/figure31-1.jpg"><IMG    src="../../common/images/figure31-1-thumb.jpg"
align="center" hspace="160" ALT="4 procesadores"></A><BR>

<FONT size="2" font="Helvetica,Arial,Roman">

<I>&iexcl;&iexcl;Xosview con 4 procesadores!!</I></FONT></center>



<P><li><I>CV: Hab&eacute;is   comprado   &uacute;ltimamente   un   PC  con    cuatro
procesadores  Intel, en el cu&aacute;l  hab&eacute;is  instalado Linux &iquest;Por
qu&eacute; Linux?</I>

<p>
S&iacute;,  intentamos  estar   atentos     en la   tecnolog&iacute;a    disponible,
anticip&aacute;ndonos a los pr&oacute;ximos a&ntilde;os.  As&iacute;, pasamos del  PC en 1991-92 a
Silicon Graphics, porque esas  estaciones de trabajo respond&iacute;an bien a
nuestras  necesidades.  Desde  hace un  a&ntilde;o,  los PCs han aumentado en
potencia   y  disminuido en precio.   Estamos  muy  interesados por la
relaci&oacute;n calidad/precio.  Evaluamos  una  soluci&oacute;n NT,  y no  quedamos
satisfechos.  Se integraba  muy  mal en  nuestro entorno  de  trabajo
(dificultades para compartir  los   datos con  las  maquinas  Silicon,
servicios de red muy limitados...).
<p>
Resulta dif&iacute;cil cuando  uno   proviene del mundo UNIX.    Sin embargo,
estamos muy interesados por la potencia del PC actualmente.  As&iacute; pues,
decidimos   evaluar  una soluci&oacute;n  LINUX,  pensamos  que el sistema se
integrar&iacute;a muy bien en nuestro parque inform&aacute;tico.
<p>
Pero,  el gran   problema,    son el reducido  n&uacute;mero   de   programas
comerciales que existen   para  Linux.  Utilizamos Mental  Ray   y los
autores portaron  internamente el programa  a  Linux.  Les pedimos esa
versi&oacute;n, y que   la soportaran oficialmente  para Linux.   Como varias
personas la pidieron tambi&eacute;n al igual  que nosotros, han decido portar
la versi&oacute;n a Linux de manera oficial.
<p>
Entonces, evaluamos  el programa bajo Linux, y  como  el resultado fue
muy positivo,  comenzamos   a  portar  todos   nuestros  programas  de
desarrollo   propio a Linux.   La   m&aacute;quina  Linux es utilizada   como
servidor  de  c&aacute;lculo.  Sin embargo,  todos   los infografistas siguen
trabajando con Silicon Graphics;  debido a que  poseen un hardware muy
potente para OpenGL.

</P><li><I>CV: &iquest;C&oacute;mo conoci&oacute; linux?</I><p>

En cuanto hacemos  una b&uacute;squeda sobre UNIX  en la Web, encontramos por
fuerza p&aacute;ginas sobre LINUX.

Prob&eacute; a instalarlo personalmente en mi  casa, hace seis meses, &iexcl;
&uacute;nicamente para  saber lo que  era!  Pero en  el trabajo,  sin soporte
t&eacute;cnico,  la  elecci&oacute;n resultaba   muy   dif&iacute;cil.  Mental  Ray nos  ha
asegurado su apoyo, y por ello, nos hemos dirigido por este camino.


</P><li><I>CV: &iquest;Cu&aacute;les   fueron  los problemas  encontrados?</I><p>

Tuvimos varios problemas  de  instalaci&oacute;n con  los discos SCSI   en la
distribuci&oacute;n Red   Hat  (problemas en   el  formateo del  disco  y  la
instalaci&oacute;n de LILO).   En lo que concierne  a SMP, el sistema no  era
estable al  principio, pero despu&eacute;s de haber   encontrado un parche en
Internet, hemos obtenido un sistema estable (versi&oacute;n 2.1.77).


</P><li><I>CV: &iquest;Y al nivel de las prestaciones?</I><p>

SGI O2 R5000  512 Mb.  de memoria   = 44000 Francos  sin tva,  con muy
buenas reducciones;

bi-pentium II 333 MHZ x 512 Mb = 21000 Francos sin tva, es decir, 6.66
veces m&aacute;s r&aacute;pido que la O2 R5000 (esta diferencia  no es te&oacute;rica, pero
la comprobamos con un brender2 y db2).

En  conclusi&oacute;n  :   una relaci&oacute;n potencia/precio  de   13827  para los
c&aacute;lculos. Y comparado con NT, linux es m&aacute;s r&aacute;pido y estable.


</P><li><I>CV: SGI a  anunciado una   alianza  con INTEL  y  Microsoft
&iquest;Eso le preocupa?</I>

<P>No, nos conforta la alternativa Linux.


</P><li><I>CV:  &iquest;Qu&eacute;   piensa  de    los programas   libres,  y
particularmente de los  programas  libres que  se ejecutan bajo  Linux
(Gcc, pov, The Gimp)?</I><p>

En lo que concierne  a gcc, lo encuentro muy  bueno, es de una calidad
profesional.

Para POV y Gimp, son buenos programas  pero que no responden de manera
completa      a    nuestras      necesidades    (tenemos   necesidades
espec&iacute;ficas: gesti&oacute;n de varias caches...).

Eso demuestra que nunca  han sido evaluados en producci&oacute;n.  Tendr&iacute;amos
que modificar las fuentes de esos programas (the GIMP no tiene gesti&oacute;n
alpha). No obstante, es algo que no podr&iacute;amos hacer con photoshop.

</P><li><I>CV: &iquest;Cu&aacute;l   ser&aacute; el porvenir  de  linux en  el mundo
gr&aacute;fico?   Recuerdo  que una gran parte   de las  im&aacute;genes del titanic
fueron realizadas con linux.</I><p>


Linux  viene como uno  m&aacute;s  para hacer c&aacute;lculos   con un coste m&iacute;nimo.
Linux,  en s&iacute; mismo,  no tiene  calidad  gr&aacute;fica interna como  Silicon
Graphics.


</P><li><I>CV: &iquest;Estar&iacute;a interesado  en programas  comerciales y
profesionales bajo linux?</I><p>


Est&aacute;  claro  que si  softimage   o  flint existieran bajo  linux,   la
selecci&oacute;n del SO seria evidente.

</P><li><I>CV:  &iquest;Qu&eacute; piensa  de   la comunidad de  usuarios  de
programas libres y las ideas que los vinculan?</I><p>


Filos&oacute;ficamente, es muy bueno.  Pienso que  a corto plazo, habr&aacute; mucha
gente proveniente del mundo Unix,   quedar&aacute; desilusionada con  Windows
NT, y linux podr&aacute; ser una alternativa.
<p>
Es exactamente lo que nosotros hemos hecho.  Hemos evaluado NT, nos ha
dejado decepcionados y hemos optado por linux.

Espero un  soporte comercial m&aacute;s importante  para linux.   A mi nivel,
busco drivers para las tarjetas OpenGL.

¿Existen para linux?

Es  fundamental   si queremos  transformar    las  m&aacute;quinas linux   en
estaciones de trabajo infogr&aacute;fico.

El hecho de que los programas no est&eacute;n respaldados por una empresa nos
preocupa en cuanto al porvenir del producto.

Si   el programa es comercial,  obliga   la empresa  a  mejorarlo y  a
responder a sus clientes.  Por lo tanto,  en lo que concierne a linux,
es un SO de nivel profesional.  El hecho de poder evaluarlo gratis; es
algo extraordinario.



</P><Li><I>CV: ¿Quiere a&ntilde;adir algo para concluir?</I><p>

S&iacute;, quisiera hablar de la oposici&oacute;n entre NT y linux;

Microsoft no  hace   productos  excelentes,  pero hace   uniforme   la
inform&aacute;tica,   lo que es  muy  bueno para  el  p&uacute;blico.  En parte, son
actores de la democratizaci&oacute;n  de la inform&aacute;tica.    Por lo tanto,  la
mayor ventaja es la potencia de su marketing.   Por otro lado, mirando
atr&aacute;s en  la historia de  la inform&aacute;tica, cosas geniales como NextStep
no tienen usuarios porque no tienen  marketing.  Hay que temer que sea
lo mismo para linux. El programa m&aacute;s genial no podr&aacute; desarrollarse sin
marketing.


</P><Li><I>CV: Gracias.</I><p>



<HR size="1" noshade>

<p align=right><i>Traducido por 
<A HREF="mailto:"><FONT color="#000000">Joaquin Gonzales</font></A></I></P>

</TD>

</TR>


</TABLE>


<!--        Page Foot -->
<BR clear="all">
<CENTER>
<TABLE width="95%">
<TR>
 <TD align="center" bgcolor="#666666">
  <FONT color="#ffffff">
  P&aacute;ginas web mantenidas por Miguel &Aacute;ngel Sep&uacute;lveda<BR>
	      &copy; Charles vidal  1998<BR>
  <B>LinuxFocus 1998</B>
  </FONT>
 </TD>
</TR>
</TABLE>
</CENTER>

</BODY>
</HTML>
