<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML lang="es">

<HEAD>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<TITLE>LinuxFocus Julio 1998: RTLinux II</TITLE>
</HEAD>



<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">



<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../">
<AREA shape="rect" coords="423, 9, 457, 30" alt="Map" href="../map.html">
<AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="../indice.html">
<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/">
</MAP>



<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15"   alt="News" href="../News/">
<AREA shape="rect" coords="189, 0, 284, 15"  alt="Archives" href="../Archives/">
<AREA shape="rect" coords="319, 0,  395, 15" alt="Links" href="../Links">
<AREA shape="rect" coords="436, 0,  523, 15" alt="About LF" href="../aboutus.html">
</MAP>



<CENTER>
<IMG src="../../common/images/../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top Bar]" ismap usemap="#top" ><BR>
<IMG src="../../common/images/../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom Bar]" ismap usemap="#bottom">
</CENTER>


<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE  align="left" width="30%" border="0" cellspacing="0" cellpadding="5">

<TR>
 <TD>
   <IMG src="../../common/images/Ismael-R.gif" width="100" height="133" alt="[Photo of the Author]"><BR>
   <FONT color="#336633" size="+2">Ismael Ripoll </FONT><BR>

   <FONT color="#336633">Sobre   el  Autor</FONT>:  Doctorado   por la
   Universidad Polit&eacute;cnica de  Valencia in 1996.  Profesor en Sistemas
   Operativos en  el  Departamento  DISCA.  Investigando en   temas de
   tiempo-real y  sistemas operativos.  Usuario  de Linux desde  1994.
   Hobbies: Treking en los Pirineos, esquiar y electr&oacute;nica casera.


<p>
<A HREF="mailto:iripoll@disca.upv.es">Escribe al autor</A>
</p>

<!--   INDEX      -->

<FONT color="#336633">&Iacute;ndice de contenidos</FONT>: <BR>
<A href="#section1">KU Real Time Linux (KURT) </A><BR>
<A href="#section2">&iquest;Para qu&eacute; sirve el  Tiempo Real?  </A><BR>
<A href="#section3">M&oacute;dulos cargables </A><BR>
<A href="#section4">El programa de Tiempo Real </A><BR>
<A href="#section5">Comunicaci&oacute;n entre tareas </A><BR>
<A href="#section6">Conclusi&oacute;n </A><BR>
<A href="#section7">Bibliograf&iacute;a</A><BR>




 </TD>
</TR>

</TABLE>




<TABLE>

<TR>
<TD>


<!--   BODY OF THE ARTICLE    -->
<H2>Real Time Linux II</H2>
<IMG src="../../common/images/illustration33.gif" alt="[Ilustration]" width="100" height="100" hspace="10" >

<P align="top">
<FONT color="#336633" size="2">Resumen</FONT>: 
<FONT size="2" face="Helvetica,Arial,Roman">
En este  segundo art&iacute;culo dedicado a RT-Linux,  tratar&eacute; de ofrecer una
visi&oacute;n  m&aacute;s  pr&aacute;ctica  de RT-Linux.   Antes  de  entrar  en detalle me
gustar&iacute;a dar  una r&aacute;pida visi&oacute;n  general de un nuevo sistema operativo
de tiempo real sobre Linux KURT.
</FONT>

</P>


<BR clear="all">
<BR>
<HR size="0" noshadow>

<A name="section1"></A>
<H3>KU Real Time Linux (KURT) </H3>
   
<P>A principios de este mismo a&ntilde;o
(1998) se presento un nuevo sistema operativo de tiempo real basado
en Linux. KURT es un sistema de tiempo real blando (soft, or firm),
esto es, se intentan cumplir los plazos de ejecuci&oacute;n, pero en
caso que alguna tarea finalice un poco tarde no sucede ning&uacute;n
desastre. Las tareas de tiempo real de KURT pueden hacer uso de todas
las facilidades Linux, al contrario que las tareas de RT-Linux. Las
mejoras --modificaciones-- se han realizado sobre el n&uacute;cleo
son:</P>
<UL WIDTH=16 HEIGHT=15 ALIGN=BOTTOM>
	<LI>
	 Mejorar la granuralidad del reloj del sistema. En Linux-i386,
	 frecuencia a la que interrumpe el reloj es de 10ms (100 veces
	 por segundo), y es con esta resoluci&oacute;n temporal con la que se
	 toman acciones de control y  se mide el tiempo. KURT  utiliza
	 el   mismo     mecanismo   de   gesti&oacute;n    del   tiempo   que
	 RT-Linux. Programa el  chip de reloj  (8254) para que  genere
	 interrupciones bajo demanda, en   lugar de hacerlo  de  forma
	 peri&oacute;dica.  Con  esto se  consigue  una resoluci&oacute;n  de  reloj
	 superior al microsegundo.</LI>
	<LI>
	Se ha  modificado  el  planificador  para incluir  una   nueva
	pol&iacute;tica   de planificaci&oacute;n, SCHED_KURT,  a  dem&aacute;s  de las que
	Linux ya tiene implementadas, que   son las que POSIX  define:
	SCHED_FIFO, SCHED_RR y SCHED_OTHER.</P>
	<LI>
	Se han a&ntilde;adido nuevas llamadas al sistema para poder hacer uso
	de las nuevas funcionalidades de tiempo real</LI>
</UL>
<P>Las tareas de tiempo real son m&oacute;dulos de carga din&aacute;mica.</P>

<P>Uno de los aspectos m&aacute;s   caracter&iacute;sticos de KURT es la
pol&iacute;tica de   planificaci&oacute;n   que utiliza.    Se ha  implementado   un
planificador c&iacute;clico.  &Eacute;ste  tipo de planificadores  se basa en el uso
de una tabla (llamada <I>plan</I>) en  la que est&aacute;n anotadas todas las
acciones de  planificaci&oacute;n: instante de  activaci&oacute;n, tarea a ejecutar,
duraci&oacute;n de &eacute;stas, etc..  La  tabla se construye   durante la fase  de
dise&ntilde;o  del  sistema  y luego durante   la ejecuci&oacute;n,  el trabajo  del
planificador consiste  en leer secuencialmente  la tabla  y seguir sus
indicaciones. Cuando se   llega al  final de  la  tabla,  se vuelve  a
repetir la ejecuci&oacute;n desde el principio de la tabla,  de ah&iacute; el nombre
de  la pol&iacute;tica de planificaci&oacute;n.   Este m&eacute;todo de planificaci&oacute;n tiene
muchas ventajas:</P>
<UL>
	<LI><P> El planificador  es muy  sencillo de  implementar.</P>
	<LI><P> Es muy eficiente.</P> <LI><P> Una vez se ha construido
	el   plan  es inmediato  determinar   la  planificabilidad del
	sistema (hay investigadores que defiende  que &eacute;ste es el &uacute;nico
	m&eacute;todo que puede garantizar al 100% el correcto funcionamiento
	de un STR).</P>
</UL>
	
<P>El principal inconveniente radica  en la dificultad de construir el
plan. Y cada vez que se altera alguno  de los par&aacute;metros de las tareas
hay que reconstruir el  plan completo. Por  otra parte, el  tama&ntilde;o del
plan, y por tanto la  cantidad de memoria necesaria para  almacenarlo,
suele ser muy grande.</P>



<A name="section2"></A>  <H3>&iquest;Para  qu&eacute; sirve el  Tiempo  Real?
</H3>

<P>Quiz&aacute;s muchos   crean  que las  t&eacute;cnicas  de tiempo   real  s&oacute;lo se
utilizan en la nasa, o en misiles o cosas por el  estilo. Si bien esto
pod&iacute;a ser cierto hace  unos a&ntilde;os, hoy en  d&iacute;a la situaci&oacute;n ha cambiado
mucho --y a&uacute;n ha de cambiar m&aacute;s-- debido a la progresiva incorporaci&oacute;n
de la inform&aacute;tica y la electr&oacute;nica en  la vida cotidiana. El &aacute;mbito de
la vida cotidiana  en el que m&aacute;s   est&aacute; presente el Tiempo-Real  es el
campo  de  las telecomunicaciones y  las  aplicaciones multimedia. Por
ejemplo, si queremos que nuestro ordenador sea  capaz de reproducir un
fichero de sonido que tenemos grabado en el  disco, el programa tendr&aacute;
que continuamente (mejor  dicho, peri&oacute;dicamente) leer,  descomprimir y
enviar a la tarjeta  de sonido los  sonidos. Si  a la vez  que estamos
escuchando la  grabaci&oacute;n, estamos trabajando con  un programa  como un
editor  de  textos o   sencillamente estamos compilando  el  n&uacute;cleo de
Linux,  es   seguro que se     producir&aacute;n silencios debido  a  que  el
procesador est&aacute; ocupado haciendo otras tareas.  Si en lugar de sonido,
lo que estamos reproduciendo es v&iacute;deo, entonces se producir&aacute;n saltos o
cortes  en la imagen. Este tipo  de  sistemas se denominan sistemas de
tiempo real   blando (el incumplimiento  de un  plazo de  ejecuci&oacute;n no
produce  un   desastre  grave,  pero  s&iacute;     una  degradaci&oacute;n de   las
prestaciones).</P> 

<P>Las   aplicaciones  de RT-Linux van   m&aacute;s  all&aacute; de las aplicaciones
estrictamente de tiempo  real. Con RT-Linux  podemos  tomar el control
total del PC (digo  PC y no ordenador porque  por ahora todav&iacute;a no hay
ninguna implementaci&oacute;n de RT-Linux para otra arquitectura) tal como se
puede hacer en MSDOS.   En una tarea  de tiempo real podemos acceder a
todos los puertos  del   PC, instalar manejadores   de interrupciones,
inhabilitar temporalmente  las interrupciones...   o  sea que  podemos
dejar &quot;colgada&quot;   la  m&aacute;quina  como  si  de  un   Windows se
tratara. Esta posibilidad es muy atractiva para todos aquellos que nos
gusta   conectar  peque&ntilde;os  &quot;gadgets&quot;   electr&oacute;nicos      al
ordenador.</P>


<A name="section3"></A> <H3>M&oacute;dulos cargables</H3>


<P>Para entender y poder  utilizar RT-Linux  es necesario conocer  los
m&oacute;dulos  de  carga din&aacute;micos  de  Linux.   Matt Welsh   ha escrito  un
completo art&iacute;culo en el que  explica en profundidad todos los aspectos
de los m&oacute;dulos.</P>

<H4><FONT SIZE=4><I>&iquest;Qu&eacute; son? </I></FONT></H4>

<P>En la  mayor&iacute;a de las implementaciones  de UNIX,  la &uacute;nica forma de
acceder al   hardware  (puertos,   memoria, interrupciones, etc.)   es
mediante los  ficheros especiales,  teniendo previamente  instalado el
manejador  del dispositivo (device drier).  A pesar de que existen muy
buenos libros que explican c&oacute;mo construir manejadores de dispositivos,
suele ser una labor larga y aburrida,  pues hay que implementar muchas
funciones para poder enlazarlo con el sistema operativo.</P>

<P><B>Los m&oacute;dulos son  &quot;trozos de sistema  operativo&quot; que se
pueden  insertar y extraer   en  tiempo de  ejecuci&oacute;n</B>. Cuando   se
compila un  programa compuesto por varios  ficheros fuente, primero se
compilan por separado cada  fichero para  producir el fichero  objeto,
&quot;.o&quot;, y luego se enlazan todos juntos, resolviendo todas las
referencias, para crear un &uacute;nico ejecutable. Supongamos que el fichero
objeto que contiene la funci&oacute;n main pudi&eacute;ramos ponerlo en ejecuci&oacute;n, y
que el sistema operativo fuera capaz de cargar en memoria y enlazar el
resto de  los ficheros  s&oacute;lo  cuando fueran necesarios.  Bien, pues el
n&uacute;cleo de Linux es capaz  de hacer &eacute;sto  con el propio n&uacute;cleo.  Cuando
Linux  arranca s&oacute;lo se  carga  en memoria  el ejecutable vmlinuz,  que
contiene las partes indispensables, y  luego en tiempo de ejecuci&oacute;n se
puede cargar y  descargar selectivamente los  m&oacute;dulos que se necesiten
en cada momento.</P>

<P>Los m&oacute;dulos son una caracter&iacute;stica  opcional de Linux que se  elige
cuando se compila el n&uacute;cleo.  Los  n&uacute;cleos de todas las distribuciones
que conozco han sido compilados con la opci&oacute;n de m&oacute;dulos activada.</P>

<P>Podemos  incluso crear nuevos m&oacute;dulos  y cargarlos sin necesidad de
recompilar ni rearrancar el ordenador.</P>

<P>Una vez cargado  un m&oacute;dulo, pasa a formar  parte del propio sistema
operativo, por lo que:</P>
<UL>
	<LI><P> Puede hacer uso  de  todas las  funciones y  acceder a
	todas las variables y estructuras de datos del n&uacute;cleo.
	</P>
	<LI><P> El c&oacute;digo del m&oacute;dulo se ejecuta con el m&aacute;ximo nivel de
	privilegio del procesador. En  la arquitectura i386 se ejecuta
	en el nivel 0 (ring level 0), con lo que puede hacer cualquier
	tipo  de  acceso  a  entrada/salida   y ejecutar instrucciones
	privilegiadas.</P> 

	<LI><P> La memoria,  tanto  de programa  como  de  datos, est&aacute;
	mapeada  directamente  a memoria  f&iacute;sica,  sobre la que  no se
	puede hacer  &quot;paging&quot;,  o como   incorrectamente  se
	suele conocer &quot;swapping&quot;. Con  lo que nunca se podr&aacute;
	producir un fallo de p&aacute;gina durante su ejecuci&oacute;n.</P>
</UL>

<P>Como podemos ver, un m&oacute;dulo de carga din&aacute;mica en s&iacute; mismo ya tienen
unas cuantas caracter&iacute;sticas de   tiempo real: evita los  retrasos por
fallos de p&aacute;gina y tiene acceso a todos los recursos del hardware.</P>


<H4><FONT SIZE=4><I>&iquest;C&oacute;mo se crean y utilizan?</I></FONT></H4>

<P>Un   m&oacute;dulo  se crea  a partir   de un fuente   en &quot;C&quot;. A
continuaci&oacute;n tenemos un m&oacute;dulo m&iacute;nimo  (para poder hacer la mayor&iacute;a de
las siguientes ordenes es necesario ser super-usuario, root) :</P>
<p>
<tt><b>ejemplo1.c</b></tt>
<div style="border:solid; border-width:1">
<pre>  #define MODULE
  #include &lt;linux/module.h&gt;
  #include &lt;linux/cons.h&gt;
  static int output=1;

  int <b>init_module</B>(void) {
    printk(&quot;Output= %d\n&quot;,output);
    return 0;
  } 
  void <B>cleanup_module</B>(void){   
    printk(&quot;Adi&oacute;s, By, Chao, Ovuar, \n&quot;);
  }</pre>
</div>

<P>Para compilarlo utilizaremos los siguientes
par&aacute;metros:</P>
<tt>
  # <B>gcc</B> -I /usr/src/linux/include/linux -O2 -Wall -D__KERNEL__ -c ejemplo1.c
</pre>
</tt>
La opci&oacute;n <tt>-c</tt> le indica al  gcc debe detenerse una vez haya
obtenido el fichero objeto, eliminando  la fase de enlazado (link). El
resultado es el fichero objeto ejemplo1.o.</P> 

<P>El   n&uacute;cleo no dispone de salida   est&aacute;ndar, por lo  que no podemos
utilizar la funci&oacute;n  <tt>printf()</tt>...  a cambio, el  n&uacute;cleo ofrece
una versi&oacute;n de &eacute;sta llamada <tt>printk()</tt>, que funciona casi igual
s&oacute;lo que el resultado lo imprime  sobre un buffer circular de mensajes
(kernel ring  buffer). En este  buffer es donde  se escriben todos los
mensajes del   n&uacute;cleo, de  echo, son  los  mensajes  que  vemos cuando
arranca Linux.  En  cualquier momento podemos ver  el contenido con la
orden    dmesg    o         directamente  consultado   el      fichero
<tt>/proc/kmsg</tt>.</P>

<P>Como podemos ver, no est&aacute; la funci&oacute;n <tt>main()</tt> en su lugar se
llama a la  funci&oacute;n  <tt>init_module()</tt> a la  que  no se  le  pasa
ning&uacute;n    par&aacute;metro.  Antes    de    descargar el    m&oacute;dulo  se  llama
<tt>cleanup_module()</tt>.  Para cargar el m&oacute;dulo se hace con la orden
<tt>insmod</tt>.</P>
<pre>
  # insmod ejemplo1.o
</pre>

<P>Acabamos   de   instalar     ejemplo1  y   ejecutar    su   funci&oacute;n
<tt>init_module()</tt>.  Si queremos ver los resultados llamamos:</P>

<pre>
  # <B>dmesg </B>| tail -1
  Output= 1   
</pre>
<P>La orden <tt>lsmod</tt> permite   listar   los m&oacute;dulos que  en   un
momento dado tenemos instalados:</P>

<pre>
# <B>lsmod</B>
Module    Pages   Used by:
ejemplo1      1          0
sb            6          1
uart401       2  [sb]    1
sound        16  [sb uart401]  0 (autoclean) 
</pre>

<P>Y finalmente con <tt>rmmod</tt> descargamos un m&oacute;dulo:</P>

<PRE>
  # <B>rmmod</B> ejemplo1
  # <B>dmesg</B> | tail -2
  Output= 1
  Adi&oacute;s, By, Chao, Orvua,     
</PRE>

<P>La salida  de <tt>dmesg</tt> nos  muestra  que se ha  ejecutado  la
funci&oacute;n cleanup_module().</P>

<P>S&oacute;lo nos queda  por saber  c&oacute;mo se  pueden  pasar par&aacute;metros  a  un
m&oacute;dulo.   No  hay nada m&aacute;s sencillo   y sorprendente.  Podemos asignar
valores a las variables globales con  s&oacute;lo escribir la asignaci&oacute;n como
par&aacute;metro de <tt>insmod</tt>. Por ejemplo:</P>
<PRE>
  # <B>insmod</B> ejemplo1.o
  output=4<
  # <B>dmesg</B> | tail -3
  Output= 1
  Ad&iacute;os, By, Chao, Orvua,
  Output= 4                
</PRE>

<P>Ahora ya   sabemos  todo lo necesario   sobre m&oacute;dulos,  volvamos  a
RT-Linux.</P>



<A name="section4"></A>
<H3>El primer programa de Tiempo Real </H3>


<P>Recordemos que para  poder utilizar RT-Linux,  primero hemos tenido
que preparar el  n&uacute;cleo de Linux  para soportar los m&oacute;dulos de  tiempo
real,    operaci&oacute;n       que     se       explic&oacute;     en      el    <a
href="../May1998/article44.html">primer n&uacute;mero de la serie</a>.
</P>

<P>Podemos utilizar RT-Linux de dos formas distintas:</P>

<OL>
  <LI><P>Como  un sistema cl&aacute;sico de   tiempo real con un planificador
  basado en prioridades fijas.</P>

  <LI><P>Como un PC  desnudo (bare), algo  parecido q lo  que se puede
  hacer en DOS: capturar  las interrupciones y  tener el control total
  del ordenador.</P>
</OL>

<P>En este art&iacute;culo   s&oacute;lo explicar&eacute; c&oacute;mo  utilizar  RT-Linux  como un
sistema con prioridades fijas. El ejemplo que vamos a ver no hace nada
&quot;&uacute;til&quot;, tan  s&oacute;lo pone en  marcha una  tarea de tiempo real,
que es un simple bucle:</P>


<tt><b>ejemplo2.c</B></tt>
<div style="border:solid; border-width:1">
<font size=-1>

<PRE>  #define MODULE
  #include &lt;linux/module.h&gt;
  #include &lt;linux/kernel.h&gt;
  #include &lt;linux/version.h&gt;
  #include &lt;linux/rt_sched.h&gt;
  <B>RT_TASK task;</B>
	  
  void <B>fun</B>(int computo) {
    int bucle,x,limite;
    limite = 10;
    while(1){
      for (bucle=0; bucle&lt;computo; bucle++)
        for (x=1; x&lt;limite; x++);
      	
      <B>rt_task_wait</B>();
    }
  }
  
  int <B>init_module</B>(void) {

    RTIME now = rt_get_time(); 

    <B>rt_task_init</B>(&amp;task,fun, 50 , 3000, 1);
    <B>rt_task_make_periodic</B>(&amp;task,
          now+(RTIME)(RT_TICKS_PER_SEC*4000)/1000000,
	 (RTIME)(RT_TICKS_PER_SEC * 100)/1000000);
    return 0;
  }

  void <B>cleanup_module</B>(void){
    <B>rt_task_delete</B>(&amp;task);
  }</font></pre></div>
</P>
<P>Para compilarlo utilizaremos la siguiente l&iacute;nea de orden:</P>
<tt>
	# gcc -I /usr/src/linux/include/linux -O2 -Wall -D__KERNEL__ -D__RT__ -c
	ejemplo2.c 
	</tt>
</DL>

<P>Puesto  que este programa  es un m&oacute;dulo, el punto  de entrada es la
funci&oacute;n  <tt>init_module()</tt>.    Lo primero que   hace   es leer el
instante de   tiempo actual y   lo guarda  en   una variable local; la
funci&oacute;n     <tt>rt_get_time()</tt>       devuelve    el    n&uacute;mero   de
<tt>RT_TICKS_PER_SEC</tt>  transcurridos   desde que   se   arranc&oacute; el
ordenador  (que en la  actual implementaci&oacute;n <tt>RT_TICKS_PER_SEC</tt>
vale 1.193.180, lo que da una resoluci&oacute;n de 0.838 micro-segundos). Con
<tt>rt_task_init()</tt> se inicializa la estructura   task pero no  se
pone en  marcha la tarea.  El programa  principal  de la reci&eacute;n creada
tarea es <tt>fun()</tt>, el segundo par&aacute;metro.  El siguiente par&aacute;metro
es el valor del dato que se le pasar&aacute; a la nueva tarea cuando comience
su ejecuci&oacute;n,  observa que <tt>fun()</tt> espera  un par&aacute;metro de tipo
<tt>int</tt>.  El siguiente  par&aacute;metro es el tama&ntilde;o de  la pila  de la
tarea; puesto  que  cada tarea  tiene un  hilo  de ejecuci&oacute;n   propio,
necesita una pila propia. El &uacute;ltimo par&aacute;metro es la prioridad; en este
caso, con una sola tarea en el sistema, se puede poner cualquier valor
de prioridad.</P>

<P><tt>rt_task_make_periodic()</tt> convierte a  la tarea task en  una
tarea peri&oacute;dica.   El primer tiempo es  el instante de tiempo absoluto
en el que se activar&aacute; por primera vez y  el siguiente par&aacute;metro indica
el periodo entre activaciones sucesivas a partir de la primera.</P>

<P>La  tarea  de tiempo  real   (funci&oacute;n <tt>fun()</tt>), es un  bucle
infinito, dentro del cual  s&oacute;lo hay dos acciones:   un bucle que  s&oacute;lo
sirve  para  gastar tiempo,  y luego  llama a <tt>rt_task_wait()</tt>.
<tt>rt_task_wait()</tt>, es una funci&oacute;n  que suspende la  ejecuci&oacute;n de
la  tarea que la invoca hasta  la siguiente  activaci&oacute;n, momento en el
que continuar&aacute;  la ejecuci&oacute;n con  la siguiente instrucci&oacute;n  despu&eacute;s de
<tt>rt_task_wait()</tt>. Observa que una tarea peri&oacute;dica no se ejecuta
desde el principio en cada activaci&oacute;n, sino que  la propia tarea ha de
suspenderse (cuando ha finalizado su trabajo) y esperar a la siguiente
activaci&oacute;n.  De est&aacute; forma  podemos programar una  tarea para que solo
en    la   primera    activaci&oacute;n    realice   ciertas   labores     de
inicializaci&oacute;n.</P>

<P>Para poder poner <tt>ejemplo2</tt>  en ejecuci&oacute;n se ha de  instalar
primero  el m&oacute;dulo    <tt>rt_prio_sched</tt>,  pues  necesitamos   las
funciones <tt>rt_task_make_periodic()</tt>,  <tt>rt_task_delete()</tt>
y  <tt>rt_task_init()</tt>.  La funci&oacute;n <tt>rt_get_time()</tt> no est&aacute;
dentro de ning&uacute;n m&oacute;dulo, sino que est&aacute;  compilada dentro del n&uacute;cleo, y
por tanto no hay que instalar nada para poder utilizarla.</P>

<pre>
  # modprobe rt_prio_sched
  # insmod ./ejemplo2.o
</pre>

Puesto que <tt>rt_prio_sched</tt> es  un m&oacute;dulo del sistema, lo  hemos
creado  cuando   compilamos el n&uacute;cleo   de  Linux y se  ha  copiado al
directorio <tt>/var/modules/2.0.33/</tt>,  podemos utilizar  la  orden
modprobe, que es simplemente una forma m&aacute;s  f&aacute;cil de cagar m&oacute;dulos (es
capaz    de  buscar  el m&oacute;dulo   pedido  en    varios directorios. Ver
<tt>modprobe(1)</tt>).</P>

<P>Si todo  ha ido bien, con  la orden  <tt>lsmod</tt> podemos ver que
los dos m&oacute;dulos se han cargado correctamente.</P>

<P>Bueno,   pues  ya tenemos una    tarea  de  tiempo  real en  marcha
&iquest;Notas  algo?  Si el procesador es  un poco lento, posiblemente
notes que Linux va un poco m&aacute;s despacio de  lo normal. Puedes aumentar
el  n&uacute;mero  de iteraciones del  bucle  de  <tt>fun()</tt>, variando el
tercer par&aacute;metro de <tt>rt_task_init()</tt>. Una forma de apreciar que
Linux tiene menos tiempo de procesador es con el programa ico, pues el
tiempo empleado por las tareas de tiempo real es, a todos los efectos,
como si el  procesador funcionara m&aacute;s  despacio; Linux  cree que todos
sus procesos necesitan m&aacute;s tiempo para hacer lo mismo. Si el tiempo de
c&oacute;mputo (tiempo  necesario para  ejecutar  todas las   iteraciones del
bucle)  de la tarea es superior  a 100 microsegundos entonces Linux se
&quot;colgar&aacute;&quot;, pues  es  la tarea  en background,  y la tarea de
tiempo  real consume el  100% del  tiempo.  Realmente, Linux  NO se ha
colgado, sencillamente no tiene tiempo de procesador.</P>


<A name="section5"></A>
<H3> Comunicaci&oacute;n entre tareas</H3>


<P>En RT-Linux s&oacute;lo hay una forma de  comunicaci&oacute;n: Real-Time FIFO. El
funcionamiento es  muy  similar a las tuber&iacute;as   (PIPE's)  de Unix, la
comunicaci&oacute;n es  por flujo de  datos  sin estructura.  Una FIFO  es un
buffer  de   bytes  de tama&ntilde;o  fijo   sobre  el que   se pueden  hacer
operaciones de lectura y escritura.

</P>
<P>Con las FIFOS  podemos comunicar tanto tareas  de tiempo real entre
s&iacute;, como tareas de tiempo real con procesos Linux normales.</P>

<P><B>Desde el punto de vista de  un proceso Linux normal</B> una FIFO
es   un   fichero especial   de  caracteres.   Normalmente   estar&aacute; en
/dev/rtf0,  /dev/rtf1, etc. Estos fichero no  existen en  Linux por lo
que hay que crearlos. Lo podemos hacer de la siguiente forma:</P>

<pre>
  # for i in 0 1 2 3; do mknod
  /dev/rtf$i c 63 $i; done 
</pre>

<P>Si necesitamos m&aacute;s FIFOs s&oacute;lo hay  que crearlas rtf4, rtf5 etc. Los
ficheros  especiales  son  el interfaz  de acceso   a un manejador del
sistema operativo, pero si el manejador no existe entonces no sirve de
nada el fichero especial, de hecho, intentar abrir un fichero especial
del   cual el  sistema operativo    no tiene   el  manejador  asociado
fallar&aacute;.</P>
<P>

<CENTER>
<IMG SRC="../../common/images/figure7-1.gif" NAME="DrawObject" ALT="DrawObject">
</CENTER>
<BR CLEAR=LEFT>

Las   FIFOS se  utilizan  como    si  fueran ficheros  normales  (open
read/write close). Para poder utilizarlas han de existir, esto es, una
tarea  de  tiempo real ha  de  haber creado la  FIFO  antes  de que un
proceso normal  de   Linux  pueda  hacer  un    open  sobre  ella.</P>


<P><B>Desde  el punto de  vista de una tarea   de tiempo real</B>, las
FIFOS se utilizan mediante funciones espec&iacute;ficas:</P>
<UL>
	<LI><P><tt>rt_create(unsigned int  fifo,  int size)</tt>: crea
	una FIFO  con  un buffer  de  tama&ntilde;o size.  A partir   de este
	momento, y hasta   que  se destruya, el  dispositivo  accedido
	desde /dev/rtf[fifo]existe y se puede utilizar.</P>

	<LI><P><tt>rt_destroy(unsigned int fifo)</tt>: se destruye  la
	FIFO y se libera la memoria.</P>

	<LI><P><tt>rt_fifo_put(fifo,  char  *buf,   int   count)</tt>:
	intenta  escribir count  bytes  del  buffer   buf.  Si no  hay
	bastante espaci&oacute; en el buffer de la FIFO, retorna -1.</P>

	<LI><P><tt>rt_fifo_get(fifo,   char *buf, count)</tt>: intenta
	leer  count  bytes desde la  FIFO, si  no hay  bastantes datos
	disponibles retorna -1.</P>
</UL>


<P>Veamos  ahora un   ejemplo  de  sistema  que   hace  uso  de  estas
funciones.  Este  ejemplo es una  peque&ntilde;a  modificaci&oacute;n de uno  de los
ejemplos que hay en la distribuci&oacute;n de RT-Linux (sound):</P>


<tt><b>ejemplo3.c</b></tt>
<div style="border:solid; border-width:1">
<font size=-1>
<pre>  #define MODULE
  #include &lt;linux/module.h&gt;
  #include &lt;linux/rt_sched.h&gt; 
	 
  #include &lt;linux/rtf.h&gt;
  #include &lt;asm/io.h&gt;

  RT_TASK task;  

  static int filter(int x){
    static int oldx;
    int ret;
    if (x &amp; 0x80) {
      x = 382 - x;
    }
    ret = x &gt; oldx;
    oldx = x;
    return ret;
  }

  void <B>fun</B>(int dummy) {
    char data;
    char temp;
    while (1) {
      if (rtf_get(0, &amp;data, 1) &gt;  0) {
        data = filter(data);
        temp = inb(0x61);            
        temp &amp;= 0xfd;
        temp |= (data &amp; 1) &lt;&lt;
  1;
        outb(temp,0x61);
      }
      rt_task_wait();
    }
  }

  int <B>init_module</B>(void){
    rtf_create(0, 4000);
    
    /* enable counter 2 */
    outb_p(inb_p(0x61)|3, 0x61);
    
    /* to ensure  that the output of the counter is 1 */
    outb_p(0xb0, 0x43);
    outb_p(3, 0x42);
    outb_p(00, 0x42);
    
    rt_task_init(&amp;task, fun,  0 , 3000, 1);   
    rt_task_make_periodic(&amp;task, 
                   (RTIME)rt_get_time()+(RTIME)1000LL, 
                   (RTIME)(RT_TICKS_PER_SEC / 8192LL));

    return 0;
  } 

  void <B>cleanup_module</B>(void){
    rt_task_delete(&amp;task);  
    rtf_destroy(0);
  }</font></pre></div>

<P>Al  igual que en el  ejemplo2, necesitamos los servicios del m&oacute;dulo
<tt>rt_prio_sched</tt>, pero  ahora  tambi&eacute;n necesitamos los servicios
del m&oacute;dulo <tt>rt_fifo_new</tt> para poder utilizar las FIFO's.
</P>

<P>Se crea una tarea  de tiempo real  peri&oacute;dica con una  frecuencia de
8192Hz. Esta tarea lee bytes  de la FIFO  cero, y si encuentra algo lo
env&iacute;a al puerto del  altavoz del PC.  Si copiamos un fichero de sonido
en formato &quot;.au&quot;  sobre <tt>/dev/rtf0</tt>,  podremos o&iacute;rlo.
No  es necesario decir  que  la calidad de sonido  es  p&eacute;sima pues  el
hardware del PC solo  permite utilizar un bit para  modular se&ntilde;al.  En
el directorio  <tt>testing/sound</tt>   de  la   distribuci&oacute;n  podemos
encontrar el fichero <tt>linux.au</tt> para hacer pruebas.</P>

<P>Para compilarlo y ejecutarlo:</P>
<tt>
&nbsp;&nbsp;  # gcc -I /usr/src/linux/include/linux -O2 -Wall -D__KERNEL__ -D__RT__ -c ejemplo3.c<br>
&nbsp;&nbsp;  # modprobe rt_fifo_new
&nbsp;&nbsp;  # modprobe rt_prio_sched
&nbsp;&nbsp;  # insmod ejemplo3.o<br>
&nbsp;&nbsp;  # cat linux.au &gt; /dev/rtf0<br>
  <BR>
</tt>
<P>Observa como el programa cat se puede  utilizar para escribir sobre
cualquier  fichero,   incluidos    los  ficheros  especiales.  Tambi&eacute;n
podr&iacute;amos utilizar la orden <tt>cp</tt>.</P>

<P>Para poder ver    c&oacute;mo afecta el   tiempo real   a la  calidad   de
reproducci&oacute;n, s&oacute;lo tenemos que escribir un  programa que haga lo mismo
pero    desde   un  proceso  de  usuario:</P>  


<tt><b>ejemplo4.c</b></tt>
<div style="border:solid; border-width:1">
<pre>  #include &lt;unistd.h&gt;
  #include &lt;asm/io.h&gt;
  #include &lt;time.h&gt;

  static int filter(int x){
    static int oldx;
    int ret;
    if (x &amp; 0x80)
      x = 382 - x;
    ret = x &gt; oldx;
    oldx = x;
    return ret;
  }
  espera(int x){
    int v;
    for (v=0; v&lt;x; v++);
  }
  void fun() {
    char data;
    char temp;

    while (1) {
      if (read(0, &amp;data, 1) &gt;  0) {
        data = filter(data);
        temp = inb(0x61);
        temp &amp;= 0xfd;
        temp |= (data &amp; 1) &lt;&lt; 1;
        outb(temp,0x61);
      }
      espera(3000);
    }
  }

  int main(void){
    unsigned char dummy,x;
    ioperm(0x42, 0x3,1); ioperm(0x61, 0x1,1);

    dummy= inb(0x61);espera(10);
    outb(dummy|3, 0x61);

    outb(0xb0, 0x43);espera(10);

    outb(3, 0x42);espera(10);
    outb(00, 0x42);

    fun();
  }</pre></div>

<P>Este programa se compila como un programa
normal:</P>

<pre>
  # gcc -O2 ejemplo4.c -o  ejemplo4
</pre>
<P>Y para ejecutarlo:</P>
<pre>
  # cat linux.au | ejemplo4
</pre>


<P>Para poder acceder a  los puertos hardware  del ordenados desde  un
programa  normal  de   Linux    hay  que pedir  permiso    al  sistema
operativo. Esto  es una medida  de protecci&oacute;n b&aacute;sica  y necesaria para
evitar que   un programa pueda  acceder  por  ejemplo  al  disco  duro
directamente.  La llamada   <tt>ioperm()</tt>  sirve para  indicar  al
sistema  operativo  que  queremos  acceder a un  determinado  rango de
direcciones de entrada/salida.  S&oacute;lo se les conceder&aacute;  el acceso a los
programas que se ejecuten con permisos de super-usuario.  Otro detalle
a destacar es c&oacute;mo se genera la frecuencia de 8192Hz  ala que se emite
el sonido.  Si bien existe la  llamada <tt>nanodelay()</tt>, &eacute;sta s&oacute;lo
tiene una resoluci&oacute;n del orden del milisegundo, por lo que tenemos que
hacer uso de  la temporizaci&oacute;n  por bucle   de espera.  El bucle  est&aacute;
ajustado para que m&aacute;s o menos funcione sobre un Pentium 100Mhz.</P>

<P>Ahora prueba a ejecutar     ejemplo4  junto con el     programa ico
&iquest;Qu&eacute; tal  se oye?  &iquest;Te parece  ahora que  el tiempo real
sirve para algo?</P>


<A name="section6"></A>
<H3> Conclusi&oacute;n  </H3>



<P>Este segundo  art&iacute;culo  ha  estado  centrado   en los  detalles  de
programaci&oacute;n  de tareas de tiempo  real.  Los ejemplos presentados son
bastante simples  y  carentes de  utilidad,   en el siguiente   n&uacute;mero
presentare una  aplicaci&oacute;n m&aacute;s &uacute;til.  Podremos controlar la televisi&oacute;n
desde  Linux o todav&iacute;a m&aacute;s sorprendente,   controlar tu Linux desde el
mando a distancia!!
</P>


</TD>
</TR>
</TABLE>


<A name="section7"></A>
<H3> Bibliograf&iacute;a:   </H3>


<UL>
  <LI><B><I>&quot;Online KURT&quot;</I></B>
  B. Srinivasan. <A HREF="http://hegel.ittc.ukans.edu/projects/kurt">http://hegel.ittc.ukans.edu/projects/kurt</A>

  <LI><B><I>&quot;A Linux-based
  Real-Time Operating System&quot;</I></B> por Michael Barabanov.
  Master of Science, New Mexico Institute of Mioning and Technology.


  <LI>
  <B><I>&quot;Linux as an Embedded
  Operating System&quot;</I> </B>by Jerry Epplin
  <A HREF="http://www.espmag.com/97/fe39710.htm">http://www.espmag.com/97/fe39710.htm</A>

  
  <LI><I>&quot;<B>Implementing
  Loadable Kernel Modules for Linux&quot;</B></I> por  Matt Welsh
  <A HREF="http://www.ddj.com/ddj/1995/1995.05/welsh.html">http://www.ddj.com/ddj/1995/1995.05/welsh.html</A>

  
  <LI><I><B>&quot;Linux Kernel
  Internals&quot;</B> por</I> M. Beck, H. B&ouml;hme, M. Dziadzka, U.
  Kunitz, R. Magnus, D. Verworner. Ed: Addison-Wesley.

  <LI><I><B>&quot;Programaci&oacute;n
  Linux 2.0, API de sistema y funcionamiento del n&uacute;cleo&quot;</B>
  </I>pors R&eacute;my Card, Eric Dumas y Franck M&eacute;vel.
  (Escrito originalmente en frances y traducido al castellano). Ed:
  Eyrolles, Ediciones Gesti&oacute;n 2000.

<LI> <B><I>&quot;On Satisfying Timing
  Constrains in Hard-Real-Time Systems&quot;</I></B> por J. Xu &amp;
  L. Parmas. IEEE Trans. on Software Engineering. Jan 1993</UL>




<HR size="1" noshade>

<p align=right><i>Texto original en Castellano</i></P>


<!-- ARTICLE FOOT -->
<BR clear="all">
<CENTER>
<TABLE width="95%">

<TR>
 <TD align="center" bgcolor="#666666">
  <FONT color="#ffffff">
  P&aacute;ginas web Mantenidas por Miguel Angel Sepulveda<BR>
 &copy; Ismael Ripoll 1998<BR>
  <B>LinuxFocus 1998</B>
  </FONT>
 </TD>
</TR>

</TABLE>
</CENTER>



</BODY>

</HTML>






