<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML lang="es">

<HEAD>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<TITLE>LinuxFocus Julio 1998: Programaci&oacute;n con Java I</TITLE>
</HEAD>



<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">



<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../">
<AREA shape="rect" coords="423, 9, 457, 30" alt="Map" href="../map.html">
<AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="../indice.html">
<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/">
</MAP>



<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15"   alt="News" href="../News/">
<AREA shape="rect" coords="189, 0, 284, 15"  alt="Archives" href="../Archives/">
<AREA shape="rect" coords="319, 0,  395, 15" alt="Links" href="../Links">
<AREA shape="rect" coords="436, 0,  523, 15" alt="About LF" href="../aboutus.html">
</MAP>



<CENTER>
<IMG src="../../common/images/../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top Bar]" ismap usemap="#top" ><BR>
<IMG src="../../common/images/../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom Bar]" ismap usemap="#bottom">
</CENTER>


<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE  align="left" width="30%" border="0" cellspacing="0" cellpadding="5">

<TR>
 <TD>
   <IMG src="../../common/images/Who.gif" width="173" height="164" alt="[Photo of the Author]"><BR>
   <FONT color="#336633" size="+2">Jose M. Fern&aacute;ndez </FONT><BR>
<!--
   <FONT color="#336633">Acerca del Author</FONT>: 
   [write a one to two paragraph bio here]
   <BR>
-->

<P><A href="mailto:fgcia@correoweb.com">Escribe al autor</A></P>


<!--   INDEX      -->

<FONT color="#336633">Contenidos</FONT>: <BR>
<A href="#section1">Introducci&oacute;n</A><BR>
<A href="#section2">Origen</A><BR>
<A href="#section3">Obtenci&oacute;n e Instalaci&oacute;n de Java </A><BR>
<A href="#section4">Entorno de desarrollo </A><BR>
<A href="#section5">Caracter&iacute;sticas </A><BR>
<A href="#section6">Comenzar a programar en JAVA </A><BR>
<A href="#section7">Resumen</A><BR>





 </TD>
</TR>

</TABLE>




<TABLE>

<TR>
<TD>


<!--   BODY OF THE ARTICLE    -->
<H2> Java. Parte I </H2>
<IMG src="../../common/images/illustration34.gif" alt="[Ilustration]" width="100" height="100" hspace="10" >

<P align="top">
<FONT color="#336633" size="2">Resumen</FONT>: 
<FONT size="2" face="Helvetica,Arial,Roman">
Este   es   el    primer    art&iacute;culo  en   una     serie  sobre
programaci&oacute;n con Java.  La primera parte est&aacute; dedicada a
describir  Java como lenguaje,  sus caracter&iacute;sticas generales y
la localizaci&oacute;n   de   las fuentes  m&aacute;s  importantes  de
informaci&oacute;n.
</FONT>

</P>


<BR clear="all">
<BR>
<HR size="0" noshadow>

<A name="section1"></A>
<H3>Introducci&oacute;n</H3>
   

<P>Iniciamos aqu&iacute; una  serie de art&iacute;culos en  los cuales
describiremos el   entorno   y  el  lenguaje  de   programaci&oacute;n
Java.     Como primer  prop&oacute;sito    intentare  alejarme de  los
t&oacute;picos relacionados con este lenguaje no contare nada sobre la
historia del lenguaje,  sobre microondas, lavadoras, robles (s&iacute;
alguien le interesa podr&aacute;  leerlo en multitud de publicaciones,
hasta en revistas del coraz&oacute;n).  Tampoco mostrar&eacute; a Duke
(mascota de  Java) que es un  mu&ntilde;equito narig&oacute;n en forma
de  tri&aacute;ngulo con unas  enormes manazas que apenas te descuides
te  saluda  a   ritmo  de   un  soniquete   que  recuerda a     viejas
pel&iacute;culas americanas de ciencia-ficci&oacute;n.</P>



<P>Hay una cosa   en   todo esto  que  es cierta   &quot;Java  esta de
moda&quot;, no hay  revista que se precie  que no hable sobre esto, ni
empresa  de software    que no presente    alg&uacute;n  producto para
desarrollar  applets de  Java, ni  p&aacute;gina  web  que no contenga
varias de ella. </P>

<P>Intentar&eacute; con esta serie  de art&iacute;culos  profundizar y
en  lo     posible  aprender   (todos    juntos)  este   lenguaje   de
programaci&oacute;n que  es simple  en  lo b&aacute;sico  pero con una
alta  complejidad   y   dif&iacute;cil  de   dominar  y  adem&aacute;s
est&aacute; constantemente evolucionando.</P>

<P>Los  primeros  art&iacute;culos ir&aacute;n encaminados ha realizar
una descripci&oacute;n del lenguaje  en general para posteriormente ir
analizando  en   profundidad  temas   particulares  como  los applets,
trabajos para red, JDBC, beans, etc.</P>

<P>Har&eacute;   hincapi&eacute;  en  que   Java  es un   lenguaje  de
prop&oacute;sito general, y no  solo para realizar applets para pagina
Web,  aunque &eacute;sta  es  por lo  que es  conocido  no nos podemos
quedar en  este aspecto ya que proporciona  una serie  de alternativas
que   pueden   ser   m&aacute;s  interesantes    aun que    la  propia
realizaci&oacute;n de applets para la red.</P>

<P>Este  primer art&iacute;culo es  un poco m&aacute;s descriptivo que
practico,    en      el    cual    veremos     fundamentalmente    las
caracter&iacute;sticas del lenguaje, entorno  de desarrollo y  solo al
final veremos alg&uacute;n ejemplo de un programa Java.</P>

<A name="section2"></A>
<H3>Origen</H3>
 

<P>Java fue concebido por James Gosling, Patrick Naughton, Chis Warth,
Ed  Frank y Mike  Sherindan  en Sun Microsystem   Inc. en 1.991, en su
primera versi&oacute;n  que duro unos 18  meses.  Entre  1.992 y 1.995
colaboraron en la  madurez del prototipo inicial  Bill Joy, Arthur Van
Hoff, Jonathan Payne, Frank Yellia, Tim Lindolm.</P>

<P>Como podemos observar  por las fechas, Java es  anterior o al menos
simultaneo  a la WWW  (hasta el  a&ntilde;o 1.991  Tim Berners  Lee no
desarroll&oacute; el lenguaje HTML). </P>

<P>A  Java lo podemos considerar  como un lenguaje de prop&oacute;sito
general   aunque  su verdadero  auge     ha  sido originado  por    su
utilizaci&oacute;n en paginas Web.</P>

<P>La sintaxis    de   Java   es   similar    a  la  de    C   y   las
caracter&iacute;sticas de orientaci&oacute;n  a objetos  de C++.  Java
en  un lenguaje de  programaci&oacute;n coherente y l&oacute;gicamente
consistente.</P>

<P>Debido a las similitudes  con C y C++  se podr&iacute;a  pensar que
Java  es  una  versi&oacute;n   para   Internet  de C++,   pero  tiene
importantes  diferencias  te&oacute;ricas y   practicas. Especialmente
Java mejora  y refina el paradigma de  orientaci&oacute;n a objetos de
C++.</P>

<P>Internet a ayudado a Java a ser un lenguaje universalmente conocido
y por su lado  Java a tenido un  profundo efecto sobre Internet ya que
amplia el  universo de  objetos que  pueden moverse libremente  por el
ciberespacio (programas din&aacute;micos auto-ejecutables).</P>



<A name="section3"></A>
<H3>Obtenci&oacute;n e Instalaci&oacute;n de Java</H3>

<P>Para poder programar en   Java necesitaremos  varias  herramientas,
siempre nos estamos refiriendo al entorne GNU/LINUX (por si alguien se
despista):</P>

<DIR>

<P>La implementaci&oacute;n  actual para Linux  basado en ELF requiere
un n&uacute;cleo 1.2.13 o posterior.</P>

<P>Utilizaremos un   entorno llamado  JDK  (Java Development Kit).</P>
<P>Netscape versi&oacute;n 2.0.14 o posterior.</P>

<P>Un editor de texto como Xemacs (trabajaremos siempre bajo Xwindows,
aunque no  sea necesario en algunos casos,  aunque  s&iacute; para los
Applets y programas con interfaces gr&aacute;ficos).</P>

</DIR>

<P>Para bajarse el JDK se puede obtener entre otros a partir del nodo:
<A               HREF="http://www.blackdown.org/java-linux.html"><FONT
SIZE=2>http://www.blackdown.org/java-linux.html</FONT></A>       desde
aqu&iacute;  elegiremos  alguna r&eacute;plica   (mirror),  para poder
realizar la  descarga  m&aacute;s   r&aacute;pidamente.   Hace algunos
meses la  &uacute;ltima  versi&oacute;n era la  JDK-1.1.3 (con  la que
realizar&eacute; los ejemplos), pero en mi  &uacute;ltima visita vi la
versi&oacute;n  1.1.9,  pero  &quot;atenci&oacute;n&quot;  si   nos lo
bajamos todo   son  alrededor  de   24 Mb.,  aunque   lo estrictamente
necesario es aproximadamente 12 Mb (paciencia).</P>

<P>Una   vez descomprimido con   gunzip  y  tar  no hay  ning&uacute;n
problema para empezar a trabajar.</P>

<P>Lo   normal     ser&aacute;    instalarlo   en      el   directorio
<tt>/usr/local</tt> con  lo que  se  nos crear&aacute;   el directorio
<tt>/JDK1.1.3</tt> y  dentro de  este a su   vez nos encontraremos con
varios directorios:</P>

<P><tt>/doc</tt>: Documentaci&oacute;n oficial en formato HTML</P>
<P><tt>/demo</tt>: Programas de demostraci&oacute;n Java</P>
<P><tt>/lib</tt>: Librer&iacute;as</P>
<P><tt>/bin</tt>: Se encuentran las herramientas propias del JDK.</P>

<P>Dentro  del  directorio   <tt>/lib</tt>  encontraremos  el  fichero
&quot;<tt>classes.zip</tt>&quot; (no   descomprimir este fichero), que
contiene todas  las  clases compiladas  que se pueden  utilizar por el
JDK.</P>

<P>Dentro    del  directorio   ra&iacute;z    encontramos el   fichero
&quot;<tt>src.zip</tt>&quot;, este contiene todos los ficheros fuentes
incluidos en classes.zip. No se pueden  compilar y es suministrado por
motivos de informaci&oacute;n.</P>

<A name="section4"></A>
<H3>Entorno de desarrollo</H3>

<P>como  hemos  dicho  anteriormente  est&aacute;n   incluidas  en  el
directorio <tt>/bin</tt>:</P>

<DIR>

<P><tt>javac</tt>:  compilador de java,  compila programas fuentes en lenguaje
java a bytecodes.</P>

<P><tt>Java</tt>: interprete java. Ejecuta bytecodes Java.</P>

<P><tt>jre</tt> : similar al interprete java (java), pero pensado para
usuarios  finales los    cuales  no  requieren  todas   las   opciones
disponibles.</P>

<P><tt>appletviewer</tt>: testea y ejecuta applets.</P>

<P><tt>jdb</tt>: depurador.</P>

<P><tt>javap</tt>: desensamblador de ficheros compilados en Java.</P>

<P><tt>javadoc</tt>:  generador de  documentaci&oacute;n, produce   un
conjunto de  paginas     HTML describiendo  las   clases  publicas   y
protegidas,     interfaces,   constructores, m&eacute;todos  y campos.
Tambi&eacute;n    produce  una    jerarqu&iacute;a de   clases  y   un
&iacute;ndice de todos sus miembros.</P>

<P><tt>javah</tt>:  para    a&ntilde;adir m&eacute;todos  nativos  (en
lenguaje C) a programas Java.</P>



<P><tt>jar</tt>: archiva clases y fuentes java en un archivo Jar.</P>

<P><tt>javakey</tt>: mantenimiento de firmas digitales.</P>



<P><tt>updateAWT</tt>: actualiza los nombres que  han cambiado en  los
m&eacute;todos de AWT1.02 en una aplicaci&oacute;n.</P>

</DIR>

<P>Para poder trabajar sin problemas de directorios, a&ntilde;adiremos
el   directorio  <tt>/usr/local/JDK1.1.3/bin</tt>  a   la  variable de
entorno <tt>PATH</tt> del usuario que queramos.   Si deseamos que este
fijada para todos los usuarios, incorporar el directorio a la variable
<tt>PATH</tt> que se fija en el fichero <tt>/etc/profile</tt>.</P>

<A name="section5"></A>
<H3> Caracter&iacute;sticas </H3>


<P>Antes de  seguir,  habr&iacute;a   que preguntarse  ¿qu&eacute;  es
Java?, y   como respuesta podemos tener  (como  en el   manual del JDK
indica)   que    son  dos  cosas,    por  un   lado  un    lenguaje de
programaci&oacute;n y por otro una plataforma.</P>

<P>Como lenguaje  de programaci&oacute;n Java es  un  lenguaje de alto
nivel con  las siguientes  caracter&iacute;sticas (m&aacute;s adelante
las veremos en detalle):</P>

<UL>
<LI>Es simple
<LI>Orientado a objeto
<LI>Distribuido
<LI>Interpretado&#9;&#9;
<LI>Robusto
<LI>Seguro
<LI>Arquitectura neutral
<LI>Portable
<LI>Multihilo
<LI>Din&aacute;mico
<LI>Alta resoluci&oacute;n
</UL>

<P>Lo primero que salta a la vista es que Java es interpretado, aunque
requiere una  compilaci&oacute;n previa,  generando  un  c&oacute;digo
objeto en bytecodes,   que es de  muy  bajo nivel, este  c&oacute;digo
puede ser interpretado en distintas plataformas.</P>

<P>Los bytecodes  Java  posibilita   &quot;escribe una   vez,  ejecuta
siempre&quot;. Podemos compilar  programas  en una plataforma  con  un
compilador  Java y  los  bytecodes generados pueden  ser ejecutados en
cualquier arquitectura  que  posea   una implementaci&oacute;n de   la
maquina   virtual java (JVM). Por  ejemplo  un programa Java puede ser
compilado  en   una   plataforma con   Windows   NT  y  ejecutarse sin
ning&uacute;n   problema (por   lo   menos  as&iacute;   lo  dice   la
teor&iacute;a) en un Sun Ultra Solaris.</P>

<P>Una plataforma podr&iacute;a ser el ambiente hardware o software en
el cual un programa es ejecutado.  La plataforma Java difiere de otras
plataformas  en que esta  es  solo  software y se  ejecuta  sobre otra
plataforma hardware.</P>

<P>La plataforma Java tiene dos componentes:</P>

<UL>
<LI>La maquina virtual Java (JVM)
<LI>Interfaces de programaci&oacute;n de  aplicaciones (API)
</UL>



<P>JVM   es  un ordenador abstracto   en  el  cual  se pueden ejecutar
programas  Java compilados. Fue dise&ntilde;ada   para ser sencilla  y
peque&ntilde;a  porque se pretend&iacute;a  que estuviese  presente en
todos los sitios  donde fuese posible. Esta  simplicidad ha hecho  que
r&aacute;pidamente se extendiera a todas las arquitecturas existentes,
logrando una capa  software com&uacute;n a  todas ellas, por lo que en
redes de   ordenadores heterog&eacute;neos (como   lo es  Internet) la
potabilidad se  logra gracias a  Java. Como  podemos imaginar esta  es
posiblemente  una  de  las  razones     del  auge imparable de    esta
tecnolog&iacute;a. La maquina virtual no  la debemos entender como una
capa software sobre un procesador sino como su nombre indica pretender
se un ordenador   y  poco  a poco   van  apareciendo  Chips Java   que
dar&aacute;n apoyo a maquinas reales Java, tarjetas de cr&eacute;dito,
decodificadores de TV digital, etc.</P>

<P>Las API es una gran  colecci&oacute;n  de componentes software  que
proveen  al   lenguaje de  muchas  utilidades,  tales  como interfaces
gr&aacute;ficas  del   usuario    (GUI).   Est&aacute;n agrupadas   en
librer&iacute;as (en  terminolog&iacute;a  Java paquetes).  Gracias  a
estos  paquetes podemos escribir  en   Java muchos tipos de  programas
distintos, adem&aacute;s  de las conocidas  Applets  para Web, podemos
dise&ntilde;ar, por ejemplo   servidores  Web, proxis, servidores   de
correos,    servidores Irc,   y  pr&aacute;cticamente  lo  que podamos
imaginar tanto en relaci&oacute;n con Iternet como no.</P>

<P>Las APIs agrupadas en paquetes las podemos clasificar como:</P>

<UL>
<LI>B&aacute;sicas  :  objetos, matrices,   n&uacute;meros, entradas y
salidas, estructura de datos, propiedades  del sistema, fecha, tiempo,
etc.

<LI>Applets :  conjunto  de  funciones  y   utilidades usadas  par  la
realizaci&oacute;n de applets Java.

<LI>Trabajo en Red: URLs, TCP, UDP, sockets, direccionamiento IP.

<LI>Internacionalizaci&oacute;n:  ayuda  para escribir  programas  que
pueden       se      adaptados     autom&aacute;ticamente    a     las
caracter&iacute;sticas locales y pueden  ser visualizadas en la lengua
propia.

<LI>Seguridad: de bajo y alto  nivel, incluyendo firma digital, claves
publicas y privadas, control de acceso y certificados.

<LI>Componentes software: conocidos como JavaBeans.

<LI>Bases  de  datos:   proporciona  un acceso   uniforme a   un  gran
n&uacute;mero de bases de datos relacionales.

</UL>

<P>Adem&aacute;s de este n&uacute;cleo  b&aacute;sico de  API, podemos
disponer de  extensiones para  3D, telefon&iacute;a, animaci&oacute;n,
etc.</P>


<P>Como vimos al  principio de este  apartado, Java tenia una serie de
caracter&iacute;sticas que veremos en detalle:</P>

<TABLE rules=cols>
<TR valign="top">
<TD>Es simple: </TD>
<TD>

<P>En Java hay un n&uacute;mero reducido de formas claras para abordar
una tarea dada. Ofrece&#9;toda la funcionalidad de un lenguaje potente
pero sin las caracter&iacute;sticas menos usadas y m&aacute;s confusas
de  estas.   Hereda  la  sintaxis     de C/C++   y  muchas   de    las
caracter&iacute;sticas  orientadas  a  objetos   de  C++.    Todos los
programadores   que conozcan C/C++   no  tendr&aacute;n  ning&uacute;n
problema para aprender Java. Elimina algunas caracter&iacute;sticas de
estos lenguajes, entre los que destacan:</P>

<UL>
<LI>Aritm&eacute;tica de punteros
<LI>Registros (struct)
<LI>Definici&oacute;n de tipos (typedef)
<LI>Macros (#define)
<LI>Necesidad de liberar memoria (free)
<LI>No hay herencia m&uacute;ltiple
<LI>No hay sobrecarga de operadores
<LI>No hay estructura un uniones
</UL>

</TD>
</TR>

<TR valign="top">
<TD>Es orientado <br>a objetos:</TD>
<TD>
Java es un lenguaje dise&ntilde;ado partiendo  de cero, como resultado
de   esto se  realiza una  aproximaci&oacute;n   limpia, &uacute;til y
pragm&aacute;tica a los objetos. El modelo de objeto de Java es simple
y f&aacute;cil de ampliar.
</TD>
</TR>



<TR valign="top">
<TD>Es distribuido:</TD>
<TD>
Java   fue      dise&ntilde;ado      con   extensas   capacidades   de
interconexi&oacute;n  TCP/IP.  De  hecho permite a  los  programadores
acceder a la  informaci&oacute;n a trav&eacute;s de  la  red con tanta
facilidad como a los ficheros locales.
</TD>
</TR>

<TR valign="top">
<TD>Es robusto:</TD>
<TD>
Java  es   fuertemente   tipado,  por lo    que  permite comprobar  el
c&oacute;digo  en    tiempo  de    compilaci&oacute;n.   Adem&aacute;s
tambi&eacute;n  comprueba   el    c&oacute;digo    en   tiempo      de
ejecuci&oacute;n. La liberaci&oacute;n de memoria  se realiza de forma
autom&aacute;tica, ya   que se  proporciona  un recolector   de basura
autom&aacute;tico para los objetos que  no se utilizan.  Java asimismo
proporciona una gesti&oacute;n de excepciones orientada a objetos.  Un
programa escrito  correctamente todos  los errores de ejecuci&oacute;n
pueden y deben ser gestionados por el programa.
</TD>
</TR>


<TR valign="top">
<TD>Es de <br>arquitectura <br>neutral:</TD>
<TD>
El principal objetivo    de   los  dise&ntilde;adores  de   Java   era
&quot;escribir  una vez, ejecuta en    cualquier sitio, en   cualquier
momento y para  siempre&quot;. El c&oacute;digo Java  se  compila a un
c&oacute;digo  de bytes  de alto nivel  independiente   de la maquina.
Este c&oacute;digo esta  dise&ntilde;ado para ejecutarse  en cualquier
m&aacute;quina con un sistema  run-time  (interprete)  el cual  si  es
dependiente de esta.
</TD>
</TR>

<TR valign="top">
<TD>Es seguro:</TD>
<TD>
<P>Las   necesidades de la   inform&aacute;tica distribuida exigen los
mayores     niveles  de   seguridad  para     los sistemas  operativos
clientes.   Java proporciona   seguridad  a  trav&eacute;s  de  varias
caracter&iacute;sticas   de    su     entorno     en      tiempo    de
ejecuci&oacute;n:</P>

<UL>
<LI>Un verificador  de bytecodes <LI>La disposici&oacute;n  de memoria
en  tiempo de ejecuci&oacute;n   <LI>Restricciones   de acceso a   los
archivos.
</UL>

<P>Aunque  el  compilador   solo   genere  c&oacute;digo  correcto  el
interprete lo vuelve a verificar  para asegurarse que el c&oacute;digo
no ha  sido cambiado (intencionadamente o  no) entre el  momento de la
compilaci&oacute;n y la  ejecuci&oacute;n. Adem&aacute;s el interprete
Java determina la  disposici&oacute;n  de la memoria para  las clases.
Se puede considerar a Java uno de  las aplicaciones m&aacute;s seguras
para cualquier sistema.</P>

</TD>
</TR>

<TR valign="top">
<TD>Es portable:</TD>
<TD>
Adem&aacute;s   de la     portabilidad  b&aacute;sica    para ser   de
arquitectura     neutral   Java     tambi&eacute;n  implementa    unos
est&aacute;ndares de portabilidad, los enteros son siempre enteros, el
sistema de interfaces de usuario lo constituye un sistema abstracto de
ventanas, por lo que es independiente de la arquitectura  en la que se
implemente (UNIX, PC, Mac).
</TD>
</TR>

<TR valign="top">
<TD>Es interpretado:</TD>
<TD>
Para poder conseguir uno de  los objetivos b&aacute;sicos de Java, que
es la  independencia de  plataforma,  el compilador  de Java genera un
c&oacute;digo  intermedio  (bytecodes).  Este c&oacute;digo puede  ser
ejecutado  en   cualquier  sistema  que  posea   un  interprete.  Esta
caracter&iacute;stica    puede llevarnos a    pensar  en los  posibles
problemas   de  rendimiento.    Aunque   por este    mismo motivo  los
desarrolladores del  lenguaje dise&ntilde;aron  con mucho   cuidado el
c&oacute;digo intermedio  de  manera  que fuese   sencillo  traducirlo
directamente a  c&oacute;digo m&aacute;quina nativo para  conseguir un
rendimiento alto.
</TD>
</TR>

<TR valign="top">
<TD>Es multihilo:</TD>
<TD>
En Java se puede escribir programas que hagan varias  cosas a la vez y
de una forma f&aacute;cil y robusta.
</TD>
</TR>

<TR valign="top">
<TD>Es  din&aacute;mico :</TD>
<TD>
Java no intenta  enlazar   todos los m&oacute;dulos  que  componen una
aplicaci&oacute;n hasta  el tiempo de ejecuci&oacute;n.   Esto permite
enlazar  din&aacute;micamente el c&oacute;digo   de una forma segura y
conveniente.
</TD>
</TR>

</TABLE>


<P>Despu&eacute;s de esta  parrafada (no es  m&aacute;s que lo oficial
de Java) habr&aacute; que (otra vez) preguntarse  por Java en el mundo
GNU/Linux. Anteriormente  hablamos  de un JDK  para  Linux, esto no es
m&aacute;s  que  una implementaci&oacute;n  comercial  de  la original
desarrollada     por    Sun     Microsystem     (aunque   de     libre
disposici&oacute;n).</P>

<P>Existen      herramientas    como    el         compilador   GUAVAC
(http://HTTP.CS.Berkeley.EDU/~engberg/guavac) bajo licencia  GPL,  con
el que se puede compilar cualquier  fuente Java sin ning&uacute;n tipo
de problemas. Destacaremos asimismo una  maquina virtual llamada KAFFE
(<A                                 HREF="http://www.kaffe.org/"><FONT
IZE=2>http://www.kaffe.org</FONT></A>) , bajo licencia Berkeley. Estos
dos proyectos est&aacute;n   bastante avanzados aunque  todav&iacute;a
necesitan  las  librer&iacute;as de clases de   Java de Sun  (de libre
disposici&oacute;n  de momento) para tener   un sistema de  desarrollo
completo.</P>

<P>Existen  tambi&eacute;n  proyectos en  fases  iniciales para  crear
entornos de  desarrollo   r&aacute;pidos y  visuales  de  aplicaciones
Java.</P>

<P>Hay un gran movimiento en la red  alrededor de la tecnolog&iacute;a
Java y GNU, con el objetivo  de desarrollar herramientas completas, de
libre distribuci&oacute;n e independientes  de Sun. Con lo que podemos
hacernos una idea  de la importancia de  Java,  y cuando la moda  pase
seguro que algo quedar&aacute; (bastante dir&iacute;a yo).</P>


<A name="section6"></A>
<H3>Comenzar a programar en JAVA</H3>

<P>Una  vez vistos  todas   las  caracter&iacute;sticas generales   de
lenguaje,      veremos  un programa    real.       Como  dije  en   la
introducci&oacute;n de  este articulo quisiera apartarme lo m&aacute;s
posibles de t&oacute;picos,  es  decir no haremos  el  primer programa
saludando al  mundo, en lugar  de esto veremos  en nuestra pantalla un
cuadro de las dimensiones que  queramos (un poco m&aacute;s complicado
pero sin pasarse):</P>

<CENTER>
<A HREF="../../common/src/Cuadro.java">Fichero  Cuadro.Java</A>
</CENTER>


<div style="border:solid; border-width:1">

<PRE>
class Cuadro {
  public static void main (String args[]) {
    int l ,a;
    if (args.length == 2) {
      l = Integer.valueOf(args[0]).intValue();
      a = Integer.valueOf(args[1]).intValue();
    }
    else {
      l= 20;
      a= 15;
    }
    for (int i=l; i>0; i--){
      System.out.print("*");
    }
    System.out.print("\n");
    for (int i= a-2; i>0; i--){
      System.out.print("*");
      for(int j=l-2; j>0; j--) {
	System.out.print(" ");
      }
      System.out.print("*\n");
    }
    for (int i=l; i>0; i--){
      System.out.print("*");
    }
    System.out.print("\n");
  }
}
</PRE>
</div>

<P>La primera cosa a tener en cuenta es que el nombre  que le damos al
archivo fuente es muy   importante, ya que  este  se define como   una
&quot;unidad  de  compilaci&oacute;n&quot;.  Puede  ser un archivo que
contiene una o m&aacute;s definiciones de clase.  El compilador espera
que  estos  archivos tengan   la extensi&oacute;n "<tt>.Java</tt>"  (4
caracteres) por lo que algunos  sistemas como DOS  o Windows 3.1 no lo
soportan.</P>

<P>Como   vemos  en el  ejemplo   el   nombre  de  la   clase definida
tambi&eacute;n coincide  con el nombre del archivo  fuente y no es por
casualidad, en Java,  todo el c&oacute;digo  tiene que estar dentro de
una clase. Por convenio, el nombre de la clase tiene que coincidir con
el nombre del archivo que contiene el  programa. Adem&aacute;s Java es
sensible    al contesto  (diferencia    las may&uacute;sculas  de  las
min&uacute;sculas).</P>

<P>Para  compilar  el   ejemplo,  desde  la l&iacute;nea   de  comando
escribiremos:</P>

&gt; javac cuadro.java<BR>

<P>El compilador Java (si  todo ha ido  bien) crear&aacute; un archivo
<tt>cuadro.class</tt>   que contiene, naturalmente, el   c&oacute;digo
binario  (bytecode)   y este   podr&aacute;   ser   ejecutado por   el
interprete:</P>

&gt; java cuadro<BR>

<P>Cuando compilamos  c&oacute;digo    fuente  de  Java,  cada   clase
individualmente  es colocada en un  archivo que tiene  el mismo nombre
que la  clase. Esta es  la raz&oacute;n por  lo cual es buena practica
llamar a los  archivos fuentes de la misma  forma que  a la clase  que
contiene  ya   que   as&iacute;    el nombre   del      archivo fuente
coincidir&aacute; con el nombre del <tt>archivo.class</tt>.</P>

<P>Aunque nuestro  ejemplo <tt>cuadro.java</tt> es bastante simple nos
ayudar&aacute; a comprender los elementos fundamentales de un programa
Java y sobre todo la estructura de un programa.</P>

<P>Lo primero a tener  en cuenta es que este  ejemplo no es un  applet
para incluir en una pagina HTML sino un  programa independiente que se
ejecuta con el interprete desde la l&iacute;nea de comandos.</P>

<P>La primera l&iacute;nea del programa es:</P>

<PRE>
class cuadro {
</PRE>

<P>En esta   l&iacute;nea se emplea  la  palabra  reservada class para
declarar     que    se   va       a  definir    una    nueva    clase,
&quot;<tt>cuadro</tt>&quot;   es el  identificador  del  nombre  de la
clase.  La definici&oacute;n de la clase completa incluyendo todos sus
miembros est&aacute;n  entre dos llaves  (<tt>{}</tt>), las m&aacute;s
generales. Notar que en Java  toda la actividad  de un programa ocurre
dentro de la clase.</P>

<P>En la siguiente l&iacute;nea:</P>

<PRE>
public static void main (String args[]) {
</PRE>

<P>Lo primero   que      podemos  destacar    es  el     m&eacute;todo
<tt>main()</tt>.     Todas  las    aplicaciones    Java  comienzan  su
ejecuci&oacute;n llamado  a este  m&eacute;todo  (como en  C/C++).   A
continuaci&oacute;n  comentaremos algunos conceptos que posteriormente
(en otros art&iacute;culos)  detallaremos aunque lo haremos de  pasada
solo para comprender el ejemplo.</P>

<P>La palabra  clave <tt>public</tt>  permite controlar la visibilidad
de     las   clases miembro.    Cuando  una  clase     se declara como
<tt>public</tt>,  &eacute;sta puede   ser utilizada  por c&oacute;digo
definido   fuera  de su    clase.  <tt>static</tt>   permite   que  el
m&eacute;todo <tt>main()</tt>  sea llamado sin necesidad de instanciar
la clase. <tt>void</tt>   indica que no devuelve ning&uacute;n  valor.
Para  enviar informaci&oacute;n  a   un m&eacute;todo  se realiza  por
variables   especificadas entre  los  par&eacute;ntesis  que siguen al
nombre  del    m&eacute;todo,   en     nuestro caso     declaramos  un
par&aacute;metro llamado arg  que es  una  matriz de instancias de  la
clase <tt>String</tt>.</P>

<P>Naturalmente   todo  el  c&oacute;digo  del    m&eacute;todo   esta
tambi&eacute;n entre llaves. En la l&iacute;nea:</P>

<PRE>
 int l, a ;
</PRE>

<P>como todo  programa que se precie declaramos  dos variables de tipo
entero.   En Java cada variable   hay que declararla previamente. Como
podemos  observar cada instrucci&oacute;n  se termina  en "<tt>;</tt>"
.</P>

<P>El resto de las l&iacute;neas articulan un peque&ntilde;o algoritmo
en el cual:</P>

<OL>
<LI>Comprobamos si se han proporcionado par&aacute;metros o no<BR>
<PRE>
If (args.length==2)
</PRE>

<LI>Si hay  par&aacute;metros,   se asignaran  estos  a  las variables
<tt>a</tt> y <tt>l</tt> :<BR>
<PRE>
  l = Integer.valueOf(args[0]).intValue();
  a = Integer.valueOf(args[1]).intValue();
</PRE>

<LI>En caso contrario  se iniciaran las  variables con dos valores por
defectos:<BR>
<PRE>
  l = 20;
  a = 15;
</PRE>

<LI>El  resto del programa   no  es m&aacute;s  que las  instrucciones
necesarias para pintar por pantalla el cuadro. Podemos destacar:<BR>
<PRE>
System.out.print()
</PRE>

<P>donde <tt>print()</tt>   imprime   la  cadena que  se    pasa  como
par&aacute;metro.   <tt>System</tt>    es  una  clase  predefinida que
permite el acceso al sistema y <tt>out</tt> es  el flujo de salida que
esta conectado a la consola. Y tambi&eacute;n,</P>

<PRE>
for (int i=l; i&gt;0; i--)
</PRE>

<P>Como podemos imaginar   se  comporta como esperamos  de  &eacute;l,
tiene  mucha similitud   (es  igual) que   en  C/C++  y  otros  muchos
lenguaje.</P>
</OL>


<P>Una practica  que  pod&iacute;amos hacer  con  este  peque&ntilde;o
ejemplo,  aparte  de compilarlo y ejecutarlo,  es  comprobar que es de
arquitectura   neutral   ya      que  si    el   programa    compilado
<tt>cuadro.class</tt> lo ejecutamos bajo Windows  95 (sin que sirva de
precedente) comprobaremos que  se comporta de  la misma forma que bajo
Linux.</P>



<A name="section7"></A>
<H3>Resumen</H3>


<P>Hemos  relatado  los    aspectos   generales   del  lenguaje     de
programaci&oacute;n Java. No hemos hecho nada m&aacute;s que empezar y
nos queda un  largo camino  de  dos art&iacute;culos  m&aacute;s  para
realizar  una descripci&oacute;n completa (y   no muy amplia) de  este
lenguaje.     El  siguiente    articulo   veremos   entre   otros:  la
definici&oacute;n y tipos  de variables, instrucciones b&aacute;sicas,
clases,  etc.  En fin  la   mayor parte de   las especificaciones  del
lenguaje.</P>

<P>Dar&eacute; en cada  art&iacute;culo las referencias, publicaciones
y direcciones en  las que he basado  en mucho o  en poco esta serie de
art&iacute;culos.</P>


</TD>
</TR>
</TABLE>


<H3>Referencias</H3>
<UL>
<LI><b><i>JAVA manual  de referencia</i></b>. Patrick Naughton Herbert
Schildt. Mcgraw-Hill.

<LI><b><i>Programando con JAVA</i></b>. Tim Ritchey. Prentice Hall.

<LI><b><i>Tutorial de   Java</i></b>. Manual en castellano  en formato
HTML   obtenido         de     la          direcci&oacute;n         <A
HREF="http://www.fie.us.es/info/internet/JAVA">www.fie.us.es/info/internet/JAVA</A>.
Agust&iacute;n Froufe.


<LI><b><i>The Java Tutorial</i></b>.  Manual en ingles en formato HTML
obtenido            en          la         direcci&oacute;n         <A
HREF="http://www.javasoft.com/">www.javasoft.com</A>. Sun.

<LI><b><i>Tutoriales de la propia instalaci&oacute;n del JDK</i></b>.

</UL>


<HR size="1" noshade>

<p align=right><i>Texto original en Castellano</i></P>

<!-- ARTICLE FOOT -->
<BR clear="all">
<CENTER>
<TABLE width="95%">

<TR>
 <TD align="center" bgcolor="#666666">
  <FONT color="#ffffff">
  P&aacute;ginas web mantenidas por Miguel &Aacute;ngel Sep&uacute;lveda<BR>
 &copy; Jose M. Fernandez 1998<BR>
  <B>LinuxFocus 1998</B>
  </FONT>
 </TD>
</TR>

</TABLE>
</CENTER>



</BODY>

</HTML>






