<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML lang="es">

<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<TITLE>Enlightenment</TITLE>
</HEAD>

<BODY bgcolor="#FFFFFF"  text="#000000" alink="#336633" link="#336633" vlink="#336633">



<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../">
<AREA shape="rect" coords="423, 9, 457, 30" alt="Map" href="../map.html">
<AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="../indice.html">
<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/">
</MAP>



<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15"   alt="News" href="../News/">
<AREA shape="rect" coords="189, 0, 284, 15"  alt="Archives" href="../Archives/">
<AREA shape="rect" coords="319, 0,  395, 15" alt="Links" href="../Links">
<AREA shape="rect" coords="436, 0,  523, 15" alt="About LF" href="../aboutus.html">
</MAP>



<CENTER>
<IMG src="../../common/images/../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top Bar]" ismap usemap="#top" ><BR>
<IMG src="../../common/images/../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom Bar]" ismap usemap="#bottom">
</CENTER>





<TABLE border="0" width="100%" bgcolor="#ffffff" cellpadding="5" cellspacing="5">

<TR valign="top">
<TD width="25%" bgcolor="#ffffff">
<IMG src="../../common/images/George-C.gif" width="173" height="164">
<BR>
<CENTER>
<FONT color="#336633" size="5">
Geoffrey W. Corey
</FONT>
</CENTER>
<BR>
<BR>
<FONT color="#336633" size="2">Sobre el autor</FONT>: 
<FONT size="2" font="Helvetica,Arial,Roman">
Los ordenadores son  mi hobby y mi profesi&oacute;n,  sin embargo, mi vida es
mi familia.&nbsp;&nbsp; Soy el padre orgulloso de un  chico de 4 a&ntilde;os,
Joshua, y de  dos  gemelos de  10   meses, Aaron  y  Ryan.&nbsp;&nbsp;
Jennifer, mi esposa, es la mejor y  apoya mi extra&ntilde;a carrera sobre los
ordenadores.&nbsp;&nbsp;&nbsp; Ahora estoy trabajando en la empresa de
subcontrataci&oacute;n  <A HREF="http://www.clientlink.com">ClientLink</A>, y
me especializo en  bases de datos  muy grandes y an&aacute;lisis  orientado a
objetos y dise&ntilde;o.

</FONT>
<BR>

<p>
   <A href="mailto:coreyg@mindspring.com">Escribe al autor</A>
   </p> 


<!--   INDEX      -->


<FONT color="#336633">&Iacute;ndice de contenidos</FONT>: <BR>
<A href="#section1">Introducci&oacute;n</A><BR>
<A href="#section2">Instalaci&oacute;n</A><BR>
<A href="#section3">Compilando las fuentes</A><BR>
<A href="#section4">Personalizando Enlightenment</A><BR>
<A href="#section5">El futuro de Enlightenment</A><BR>
</TD>

<TD width="75%" bgcolor="#ffffff">

<H1>Enlightenment</H1>
 <IMG src="../../common/images/illustration2.gif" width="100" height="100" align="left" hspace="10">


<FONT color="#336633" size="2">Resumen</FONT>: 
<FONT size="2" font="Helvetica,Arial,Roman">
Enlightenment  es un    gestor    de ventanas  para  Linux   altamente
personalizable, Este  art&iacute;culo   trata sobre  las caracter&iacute;sticas,  la
instalaci&oacute;n,    y  la   personalizaci&oacute;n   del    gestor de    ventanas
Enlightenment. La versi&oacute;n actual de Enlightenment est&aacute; aun considerada
una versi&oacute;n de desarrollo. Este art&iacute;culo est&aacute; orientado a gente con un
buen conocimiento en el   desarrollo  y compilaci&oacute;n de programas    en
Linux.</FONT>

<BR clear="all">
<BR>
<HR size="0" noshadow>

<A name="section1"></A>
<H3>Introducci&oacute;n</H3>
   
<A HREF="http://www.enlightenment.org">Enlightenment</A> es  un gestor
de  ventanas  altamente    gr&aacute;fico.&nbsp;&nbsp;  Los   autores  de  <A
HREF="http://www.enlightenment.org">Enlightenment</A>              han
proporcionado un gestor de ventanas altamente configurable que permite
a   los usuarios  configurar  todos los   aspectos   de un aspecto  de
ventanas.&nbsp;&nbsp; Atr&aacute;s quedan  los d&iacute;as de las ventanas cuadradas
de     cristal   que    muchos   otros    sistemas   operativos    han
dictado.&nbsp;&nbsp; ¡Enlightenment  ha devuelto   la diversi&oacute;n  a  al
inform&aacute;tica!&nbsp;&nbsp;&nbsp; Si quieres que en  el trabajo te tengan
envidia,    simplemente   carga      el    tema     por defecto     en
Enlightenment.&nbsp;&nbsp;  Si  quieres   que pierdan  los   estribos,
entonces          carga     el           tema         de            <A
HREF="http://www.enlightenment.org/themes/screen/aliens.jpg">Aliens</A>
o                      el                     de                    <A
HREF="http://www.enlightenment.org/themes/screen/neuromancer.jpg">Neuromancer</A>
.&nbsp; Estos son solo   dos de los 20  o  mas temas disponibles  para
escoger.   Todos  los temas  creados est&aacute;n   disponibles en  el web de
Enligtenment,                              en                       <A
HREF="http://www.enlightenment.org/themes">http://www.enlightenment.org/themes</A>.

<P>Una  peque&ntilde;a    advertencia,&nbsp;  probablemente    necesites   un
procesador y   una  tarjeta gr&aacute;fica  decente  para   sacarle el m&aacute;ximo
partido    a este  gestor  de     ventanas.&nbsp;&nbsp; Yo  ahora  uso
Enlightenment en casa  con un Pentium 90  con  una tarjeta gr&aacute;fica  S3
Vision  864  con  2  Mb     de memoria.&nbsp;&nbsp;  Considero    esta
configuraci&oacute;n  como el  m&iacute;nimo   requisito.&nbsp;&nbsp;  Sin  embargo,
tambi&eacute;n  hay temas     para    resoluciones  menores  como   el     <A
HREF="http://www.rasterman.com/themes/printthemes.cgi">Executive
theme</A>.

<P>&nbsp;Lo siguiente es una peque&ntilde;a captura del tema por defecto en
Enlightenment.
<TABLE>
<TR>
<TD>En la parte superior derecha est&aacute;n los botones del escritorio.&nbsp;&nbsp;
Pinchando en estos botones podr&aacute;s abrir aplicaciones como xterm, netscape,
gimp, y otras.&nbsp;&nbsp; Si pinchas en los &uacute;ltimos tres botones, un caj&oacute;n
se abrir&aacute; hacia la derecha y contendr&aacute; im&aacute;genes de peque&ntilde;o tama&ntilde;o que podr&aacute;s
elegir como fondo del escritorio.&nbsp;

<P>En la parte inferior izquierda se encuentran los escritorios
virtuales.&nbsp;&nbsp;
Pinchando en ellos podr&aacute;s cambiar a los diferentes escritorios.&nbsp;&nbsp;
Puedes fijarte que la imagen en el escritorio virtual se parecer&aacute; a la
disposici&oacute;n de las ventanas en ese escritorio.&nbsp;&nbsp; Tambi&eacute;n puedes
mover ventanas en los escritorios virtuales arrastr&aacute;ndolas a la posici&oacute;n
deseada.&nbsp;

<P>En la parte superior derecha encontramos la caja de iconos.&nbsp;&nbsp;
Cuando minimizas una ventana el icono se sit&uacute;a en la caja de
iconos.&nbsp;&nbsp; Puedes moverte a trav&eacute;s de la caja de iconos, en caso de
que la hallas llenado, pinchando en los botones de movimiento situados
arriba y abajo de la caja de iconos.&nbsp;&nbsp;&nbsp;
Los iconos pueden expandirse arrastr&aacute;ndolos hasta el escritorio.&nbsp;

<P>En medio de la pantalla puedes observar un men&uacute;.&nbsp; Estos men&uacute;s se
pueden ver al pinchar en el escritorio con el bot&oacute;n derecho, medio o
izquierdo del rat&oacute;n.&nbsp;
</TD>

<TD><B>El tema por defecto</B>&nbsp;
<BR><A HREF="../../common/images/figure29-1.jpg"><IMG SRC="../../common/images/figure29-1-thumb.gif" ALT="Enlightenment Screenshot" HEIGHT=150 WIDTH=200 ALIGN=TEXTTOP></A></TD>
</TR>
</TABLE>


<TABLE WIDTH="100%" NOSAVE >
<TR VALIGN=TOP NOSAVE>
<TD><B>El Obsidian Theme</B>&nbsp;
<BR><A HREF="../../common/images/figure29-2.jpg"><IMG SRC="../../common/images/figure29-2-thumb.jpg" ALT="Obsidian Theme" HEIGHT=240 WIDTH=320 ALIGN=TEXTTOP></A></TD>

<TD     NOSAVE>Hay   muchos   a&ntilde;adidos       m&aacute;s   interesantes   para
Enlightenment.&nbsp;&nbsp;              Explora                     <A
HREF="http://www.enlightenment.org">http://www. enlightenment. org</A>
y   prueba   <A  HREF="http://www.tcserv.com/Eterm/">Eterm</A>  y   <A
HREF="http://slashdot.org/linux/e.shtml">Eplus</A>.&nbsp;&nbsp;     <A
HREF="http://www.tcserv.com/Eterm/">Eterm</A> nos trae una  fantasiosa
versi&oacute;n de rxvt y  Eplus a&ntilde;ade pr&aacute;cticamente todo lo dem&aacute;s&nbsp;&nbsp;
Eplus est&aacute;  compuesto por un  reproductor  de CDs, un  notificador  de
email, rendimiento del monitor, y  un asesinato  de luces sin  sentido
para deslumbrar  a  tus compa&ntilde;eros.&nbsp;&nbsp;&nbsp; El  aspecto y el
comportamiento  de Eplus puede  ser  personalizado de forma similar  a
Enlightenment.&nbsp; Otros programas se han creado  con el esp&iacute;ritu de
Enlightenment.&nbsp;  Uno   que      has   de     bajarte   es      <A
HREF="http://www.icom.net/~smelecat/emp3/">eMusic</A>.&nbsp;        <A
HREF="http://www.icom.net/~smelecat/emp3/">eMusic</A>  es   un animado
player de ficheros mp3, MOD y de CDs.&nbsp; Siguiendo con el verdadero
estilo de Enlightenment, el   aspecto y el comportamiento  del  player
tambi&eacute;n puede configurarse.&nbsp;  <BR>&nbsp; <BR>Aqu&iacute; hay una captura
del Obsidian Theme. Aqu&iacute; puedes ver la diferencia  de este tema con el
tema  por  defecto.  Las   columna de  abajo muestra   los escritorios
virtuales. La segunda columna contiene los iconos de men&uacute;, la barra de
iconos y <A HREF="http://slashdot.org/linux/e.shtml">Eplus</A>.&nbsp;

<P>La creatividad en la inform&aacute;tica no est&aacute; muerta gracias a la gente que
mantiene vivo a Linux&nbsp;</TD>
</TR>
</TABLE>
&nbsp;

<A name="section2"></A>
<H3>Instalaci&oacute;n</H3>

La instalaci&oacute;n puede ser un poco complicada si no conoces bien los Makefiles
y la localizaci&oacute;n de las librer&iacute;as.&nbsp;&nbsp;&nbsp; Ten en cuenta que 
<A HREF="http://www.enlightenment.org">Enlightenment</A> est&aacute; aun en versi&oacute;n
de desarrollo.&nbsp; Yo he instalado con &eacute;xito Enlightenment bajo 
<A HREF="http://www.debian.org">Debian</A> 1.3.1 y bajo 
<A HREF="http://www.redhat.com">RedHat</A> 5.0.&nbsp;&nbsp;&nbsp;
En Debian fue relativamente f&aacute;cil, puesto que el CD contiene las librer&iacute;as
jpeg, png, tiff y z.&nbsp;&nbsp; Enlightenment necesita Imlib, que usa todas
estas librer&iacute;as.&nbsp;&nbsp; Fue un poco m&aacute;s desafiante bajo RedHat, puesto
que las librer&iacute;as C estaban actualizadas, por lo que hablar&eacute; de la
instalaci&oacute;n bajo RedHat.&nbsp;&nbsp;&nbsp; Hay instrucciones de instalaci&oacute;n
m&aacute;s detalladas en la p&aacute;gina de <A HREF="http://www.enlightenment.org">Enlightenment</A>&nbsp;
Por favor, sigue las instrucciones de la p&aacute;gina web para asegurarte de que
las librer&iacute;as requeridas est&aacute;n instaladas en tu sistema antes de
compilar/instalar Enlightenment.&nbsp; Yo explicar&eacute; brevemente como he
instalado Enlightenment y hablar&eacute; de algunas de las soluciones para algunos
problemas que he encontrado.

<P>Lo primero, necesitas conseguir la &uacute;ltima versi&oacute;n de las librer&iacute;as para
Imblib en <A HREF="http://www.labs.redhat.com/imlib">
http://www.labs.redhat.com/imlib</A>.&nbsp;&nbsp;&nbsp; 
La mayor&iacute;a de problemas surgir&aacute;n si instalas las &uacute;ltimas librer&iacute;as y aun
tienes las viejas rondando por tu sistema.&nbsp;&nbsp; Hay RPMs disponibles
para todas las librer&iacute;as.&nbsp;&nbsp;&nbsp; Aseg&uacute;rate de que en /usr/lib no
hay librer&iacute;as duplicadas que pertenezcan a z, tiff, jpeg, png y Imblib.&nbsp;&nbsp;&nbsp;
Limpia el directorio de forma que queden instaladas &uacute;nicamente las &uacute;ltimas.

<P>Ahora hay un <A HREF="ftp://ftp.enlightenment.org/pub/RPMS">RPM</A>
para Enlightenment.&nbsp;&nbsp; Puedes intentar instalar el RPM y probar si
funciona.&nbsp;&nbsp; Para arrancar Enlightenment, edita el fichero .xinitrc
en tu directorio home y a&ntilde;ade la siguiente l&iacute;nea:

<P>exec /usr/local/enlightenment/bin/enlightenment

<P>Graba el fichero y despu&eacute;s introduce la siguiente l&iacute;nea de comandos y
presiona la tecla intro.&nbsp; Nota: Enlightenment tiene gr&aacute;ficos
espectaculares y es mejor arrancarlo con la mayor resoluci&oacute;n y con el mayor
n&uacute;mero de colores posible.&nbsp;&nbsp; 16-bit de color deber&iacute;a ser el
m&iacute;nimo.

<P>startx -- -bpp 16

<P>Ahora, si Enlightenment falla la ejecuci&oacute;n, deber&iacute;as ver el motivo al
final de la informaci&oacute;n de arranque de X Window.&nbsp; Puedes tambi&eacute;n
imaginarte cual es el problema, o intentar compilar las fuentes t&uacute; mismo.

<A name="section3"></A>
<H3>Compilando las fuentes</H3>
Tras descomprimir las fuentes, todo lo que necesitas es leer el fichero
INSTALL antes de compilar.&nbsp;&nbsp; En resumen,&nbsp; 1) xmkmf -a&nbsp;
2) make install.

<P>Ahora, si falla al enlazar porque no encuentra los comandos de png,
jpeg o tiff, edita el fichero Makefile y busca LOCAL_LIBRARIES y aseg&uacute;rate
de que es algo as&iacute;:

<P>LOCAL_LIBRARIES = -lImlib -ltiff -lgif -ljpeg -lpng -lz

<P>Haz 'make install' y todo deber&iacute;a de funcionar bien.&nbsp;&nbsp; Si no es
as&iacute;, mira a ver si has eliminado las librer&iacute;as duplicadas de /usr/lib&nbsp;
y que las librer&iacute;as est&aacute;n accesibles desde el Makefile.

<A name="section4"></A>
<H3> Personalizando Enlightenment</H3>

<H4>A&ntilde;adiendo un nuevo tema</H4>
Vale, te has bajado un tema de Enlightenmet.org . . . . ¿ahora qu&eacute;?&nbsp;&nbsp;
Bien, copia el fichero a /usr/local/enlightenment/themes.&nbsp;&nbsp; Para
arrancar con un tema diferente, simplemente cambia el fichero .xinitrc
situado en tu directorio home y a&ntilde;ade el tema a la linea de comandos.&nbsp;&nbsp;
Por ejemplo, nos bajamos Neuromancer de los ficheros.&nbsp;&nbsp; Edita el
fichero .xinitrc de tu directorio home y a&ntilde;ade el par&aacute;metro -theme y el
nombre del fichero del tema.&nbsp; En ese caso, tu fichero .xinitrc tendr&iacute;a
la siguiente l&iacute;nea para arrancar Enlightenment con el tema Neuromancer:

<P>exec /usr/local/enlightenment/bin/enlightenment -theme Neuromancer

<P>Ahora arranca normalmente en modo de 16 bit.

<P>startx -- -bpp 16

<P>Lo que Enlightenment hace es buscar un fichero llamado Neuromancer o un
directorio llamado Neuromancer en el directorio /usr/local/enlightenment/themes .&nbsp;
Como puedes ver, cada tema es &uacute;nico y permite m&aacute;s que un poco de creatividad
por parte de los autores del tema. Entonces, ¿qu&eacute; es un tema?&nbsp;&nbsp;
Bien, los ficheros de tema que te has bajado son realmente un fichero tar
comprimido (.tgz).&nbsp;&nbsp; Generalmente se ha quitado la extensi&oacute;n al
fichero, sin embargo, puedes descomprimir y desempaquetar el fichero.&nbsp;&nbsp; Lo
siguiente que haremos ser&aacute; personalizar algunos de los men&uacute;s y botones en un
tema.

<H4>Personalizando un tema</H4>

Hay una utilidad llamada<A HREF="http://pw1.netcom.com/~ericmit/Econfig.html">Econfig</A>
que est&aacute; basada en TCL/TK y sirve para editar los ficheros de configuraci&oacute;n
de un tema.&nbsp;&nbsp; Nosotros iremos algo m&aacute;s al fondo y usaremos el
bueno y viejo editor "vi". Los temas est&aacute;n en&nbsp; /usr/local/enlighenment/themes 
y no son m&aacute;s que ficheros empaquetados con tar y comprimidos con gzip (.tgz).&nbsp;&nbsp;&nbsp; 
Descomprime y desempaqueta el tema DEFAULT de esta forma:

<div style="border:solid; border-width:1">
<font size=-1>
<PRE>
cd /usr/local/enlightenment/themes 
mv DEFAULT DEFAULT.tgz 
tar zxvf DEFAULT 
cd DEFAULT 
ls 
-rw-r--r--   1 1000  bin    2929 Jul 25  1997 MAIN 
-rw-r--r--   1 1000  bin    7015 Jul 31  1997 buttons 
-rw-r--r--   1 1000  bin     952 Aug 29  1997 control 
-rw-r--r--   1 1000  bin     843 Aug 12  1997 cursors 
-rw-r--r--   1 1000  bin    2885 Jul 29  1997 desktops 
-rw-r--r--   1 1000  bin     510 Nov 18 17:12 exec 
-rw-r--r--   1 1000  bin     567 Jul 25  1997 fx 
-rw-r--r--   1 1000  bin    3239 Jul 25  1997 icons 
-rw-r--r--   1 1000  bin    1074 Jul 25  1997 infobox 
-rw-r--r--   1 1000  bin    6392 Jul 30  1997 keys 
-rw-r--r--   1 1000  bin   41382 Aug  6  1997 menus 
drwxr-xr-x   4 1000  bin    2048 Jul 26  1997 pix 
-rw-r--r--   1 1000  bin     452 Jul 25  1997 root 
-rw-r--r--   1 1000  bin    1658 Aug  8  1997 status 
-rw-r--r--   1 1000  bin     530 Jul 25  1997 text 
-rw-r--r--   1 1000  bin   13222 Aug 12  1997 windowstyles 
</pre>
</font>
</div>


<P>El fichero MAIN es lo primero que lee Enlightenment.&nbsp;&nbsp; Si ves
este fichero percibir&aacute;s que llama a los otros ficheros para inicializar las
diferentes partes de Enligtenment.&nbsp; La mayor&iacute;a de los otros temas
siguen la siguiente convenci&oacute;n al igual que el tema DEFAULT (por defecto).
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER="1" cellpadding="5" cellspacing="0" rules=cols>
<TR bgcolor="#999999">
<TH>Nombre <br>del fichero</TH>

<TH>Descripci&oacute;n</TH>
</TR>

<TR>
<TD>MAIN</TD>

<TD>Es el fichero que Enlightenment carga durante la inicializaci&oacute;n.&nbsp;
Este fichero puede incluir otros ficheros para personalizar las distintas
disposiciones para las ventanas, los botones, los escritorios,&nbsp; los
cursores, los iconos, etc.</TD>
</TR>

<TR>
<TD>buttons</TD>

<TD>Define la posici&oacute;n, el aspecto y el comportamiento de los botones que se
encuentran en el escritorio.&nbsp;&nbsp; Para el tema DEFAULT, esta es la
columna de botones localizada en la parte superior izquierda del escritorio
</TD>
</TR>

<TR>
<TD>control</TD>

<TD>Define el comportamiento del gestor de ventanas.&nbsp;&nbsp; Esto
incluye aspectos como el de subir autom&aacute;ticamente una ventana hasta arriba
si ha estado apuntada por el puntero durante un periodo de
tiempo.&nbsp;&nbsp;&nbsp; Adelante, edita el fichero y &eacute;chale un ojo.&nbsp;
Tiene unos excelentes comentarios sobre las caracter&iacute;sticas que proporciona.
</TD>
</TR>

<TR>
<TD>cursors</TD>

<TD>Define la apariencia del puntero del rat&oacute;n.</TD>
</TR>

<TR>
<TD>desktops</TD>

<TD>Define el aspecto y la posici&oacute;n de los escritorios virtuales.&nbsp; Para
el tema DEFAULT, estas son las im&aacute;genes de la parte inferior izquierda del
escritorio.</TD>
</TR>

<TR>
<TD>exec</TD>

<TD>Define los programas que se han de ejecutar autom&aacute;ticamente cuando
Enlightenment arranca.</TD>
</TR>

<TR>
<TD>fx</TD>

<TD>Define los efectos especiales que puede proporcionar Enlightenment.&nbsp;&nbsp;
&Eacute;ste es un fichero divertido, adelante, editalo y cambia la opci&oacute;n shadow
state (estado de las sombras) de off (apagado) a on (encendido).</TD>
</TR>

<TR>
<TD>icons</TD>

<TD>Define la caja que contendr&aacute; los programas iconificados, es decir,
cuando minimices un programa, el icono para el programa se mostrar&aacute; en la
caja de iconos.&nbsp; Para el tema DEFAULT la caja de iconos se encuentra en
la parte superior derecha del escritorio.</TD>
</TR>

<TR>
<TD>infobox</TD>

<TD>Define la caja de informaci&oacute;n que aparece al inicio de Enlightenment. &nbsp;
&Eacute;ste es el logotipo que puedes ver cuando arrancas Enlightenment y comienza la
carga de los ficheros de configuraci&oacute;n.</TD>
</TR>

<TR>
<TD>keys</TD>

<TD>Define las teclas calientes (hot-keys) y su comportamiento.&nbsp;&nbsp;
Puedes personalizar este fichero e indicar que F5 tenga la funci&oacute;n de
arrancar Gimp si quieres.</TD>
</TR>

<TR>
<TD>menus</TD>

<TD>Define los men&uacute;s y su comportamiento.&nbsp; Estos son los men&uacute;s que
aparecen al hacer click con el bot&oacute;n derecho, central o izquierdo del rat&oacute;n.
&nbsp;&nbsp; Exploraremos la personalizaci&oacute;n de los men&uacute;s un poco
despu&eacute;s.</TD>
</TR>

<TR>
<TD>pix</TD>

<TD>&Eacute;ste es un directorio en el cual se encuentran todas las im&aacute;genes.&nbsp;
</TD>
</TR>

<TR>
<TD>root</TD>

<TD>Define la imagen de fondo.
</TD>
</TR>

<TR>
<TD>status</TD>

<TD>&Eacute;ste define las televisiones que puedes ver aparecer en la pantalla de
configuraci&oacute;n, cuando Enlightenment carga el fichero de configuraci&oacute;n.
</TD>
</TR>

<TR>
<TD>text</TD>

<TD>Define el tipo de letra usado para el texto.</TD>
</TR>

<TR>
<TD>windowstyles</TD>

<TD>Esto define los bordes de las ventanas, los botones y el comportamiento
para todas las X-Windows.</TD>
</TR>
</TABLE>
&nbsp;

<H4>Personalizando men&uacute;s</H4>

Ahora, el trabajo de personalizaci&oacute;n m&aacute;s com&uacute;n para los men&uacute;s es el fichero
'menus'.&nbsp;&nbsp; Puede que solo quieras cambiar el texto y la acci&oacute;n de
la l&iacute;nea exec para un elemento existente que quieras cambiar al
principio.&nbsp;&nbsp; Muchos de los elementos del men&uacute; no existen en mi
m&aacute;quina y puedo reutilizar el sitio para algo m&aacute;s.&nbsp;&nbsp;
Ahora eventualmente querr&aacute;s a&ntilde;adir algo.&nbsp;&nbsp; Aqu&iacute;, puede que quieras
ir a por una calculadora.

<P><B>Nota:</B> Antes de cambiar alg&uacute;n fichero de configuraci&oacute;n, <B> ¡¡¡¡HAZ UNA
COPIA DE SEGURIDAD!!!!</B>

<P>Para a&ntilde;adir un elemento al men&uacute;, simplemente copia y pega un "begin
menuitem" hasta el "end" al final de la lista, (entre el men&uacute; de inicio y el
final).&nbsp;&nbsp; Por ejemplo,&nbsp; edita el fichero 'menus' y busca la
palabra 'Random'.&nbsp;&nbsp; &Eacute;ste es el men&uacute; 'Random Garbage' que aparece
al pinchar con el bot&oacute;n derecho en el escritorio.&nbsp;
Ahora busca 'Xsnow' y te llevar&aacute; al principio del men&uacute; 'Random Garbage'.
&nbsp;&nbsp; Copia desde "begin menuitem" hasta "end" (justo despu&eacute;s de
'action exec xsnow') y a&ntilde;&aacute;delo tras el &uacute;ltimo 'end'.&nbsp;&nbsp;&nbsp;
Ahora cambia 'Xsnow' por 'Fonts' y cambia 'action exec snow' por 'action
exec xfontsel'.&nbsp;&nbsp; Ahora la parte dif&iacute;cil tiene que ver con la
posici&oacute;n.&nbsp;&nbsp; Notar&aacute;s que Xsnow se sit&uacute;a en 0 312 y el tama&ntilde;o es 253
24.&nbsp;&nbsp; No te preocupes del primer n&uacute;mero. Sin embargo, si divides
312 / 24 el resultado es 13.&nbsp;&nbsp; Esto es porque Xsnow es el elemento
n&uacute;mero 14 del men&uacute; (empezando desde el elemento n&uacute;mero 0). Entonces para
Fonts necesitaremos a&ntilde;adir de 24 a 312.&nbsp;&nbsp; Entonces cambia 312 a
336.&nbsp;&nbsp;&nbsp; Tambi&eacute;n necesitamos cambiar el n&uacute;mero de elementos de
14 a 15 (dos lineas sobre el texto 'Random Garbage') e incrementar las
dimensiones del men&uacute; en 24, entonces cambia 'dimensions 253 336' a
'dimensions 253 360'

<P>Por supuesto, la alternativa es cargar
<A HREF="http://pw1.netcom.com/~ericmit/Econfig.html">Econfig</A>
y usar un interfaz para X-Window.&nbsp;&nbsp; Aun no he probado Econfig,
pero me parece que har&aacute; el siguiente procedimiento menos doloroso.

<P>Extracto del 'menus' original

<div style="border:solid; border-width:1">
<font size=-1>
<PRE>
<P>------- texto omitido -------
begin menu
  name root3
  type custom
  dimensions 253 336
  popupdist 126 12
  items 14
  begin menuitem
    text Random Garbage
------- texto omitido -------
 begin menuitem
    text Xsnow
    type element
    location 0 312
    size 253 24
    text_location 5 5
    text_size 243 14
    image unselected pix/menu_plain_1.ppm  shapemode
on 255 0 255
    image selected   pix/menu_plain_2.ppm 
shapemode on 255 0 255
    action exec xsnow
  end
end
-------- texto omitido -------

<P>Extracto del 'menus' modificado

<P>-------- texto omitido -------
begin menu
  name root3
  type custom
  dimensions 253 <B>360</B>
  popupdist 126 12
  items <B>15</B>
  begin menuitem
    text Random Garbage
-------- texto omitido -------
  begin menuitem
    text Xsnow
    type element
    location 0 312
    size 253 24
    text_location 5 5
    text_size 243 14
    image unselected pix/menu_plain_1.ppm  shapemode on 255 0 255
    image selected   pix/menu_plain_2.ppm 
shapemode on 255 0 255
    action exec xsnow
  end
  begin menuitem
    text <B>Fonts</B>
    type element
    location 0 <B>312</B>
    size 253 24
    text_location 5 5
    text_size 243 14
    image unselected pix/menu_plain_1.ppm  shapemode on 255 0 255
    image selected   pix/menu_plain_2.ppm 
shapemode on 255 0 255
    action exec <B>xfontsel</B>
  end
end
------- texto omitido ------
<BR> 

</pre>
</font>
</div>


<P>Bien, para ver nuestro &uacute;til trabajo, pincha con el bot&oacute;n de la izquierda
y selecciona 'Exit Options' y luego 'Restart'.&nbsp;&nbsp; Enlightenment
releer&aacute; los ficheros de configuraci&oacute;n y reiniciar&aacute;.&nbsp;&nbsp; Durante el
reinicio, la sesi&oacute;n que est&eacute;s corriendo se mantiene, por lo que no perder&aacute;s
ninguna de las ventanas que est&eacute;s corriendo actualmente.&nbsp;&nbsp;&nbsp;
Una vez Enlightenment reinicie, pincha con el bot&oacute;n derecho en el escritorio
y deber&iacute;as ver Fonts al final de la lista.&nbsp;&nbsp; ¡ Pruebalo !

<P>Modificar botones es del mismo estilo.&nbsp;&nbsp; Adelante, explora los
ficheros de configuraci&oacute;n, sin embargo, ¡recuerda hacer copias de seguridad
antes de hacer cualquier cambio!
<BR>

<A name="section5"></A>
<H3>El futuro de Enlightenment</H3>

El futuro de Enlightenment ser&aacute; compatible con <A HREF="http://www.gnome.org">GNOME</A>.
Los autores, tambi&eacute;n conocidos como <A HREF="http://mandrake.net">Mandrake</A>
y Rasterman, est&aacute;n actualmente reescribiendo <A HREF="http://www.enlightenment.org">Enlightenment</A>
desde cero para la versi&oacute;n DR0.14.&nbsp;&nbsp; Rasterman ha estado a&ntilde;adiendo
compatibilidad con GNOME puesto que es tambi&eacute;n parte del proyecto 
<A HREF="http://www.gnome.org">GNOME</A> en los <A
HREF="http://www.labs.redhat.com/">Laboratorios Red Hat </A>.&nbsp;&nbsp;
Una versi&oacute;n demo para desarrolladores 0.14 ha salido ya y no incluye
configurabilidad.&nbsp;&nbsp; La demo sali&oacute; para mostrar algunas de las
logradas nuevas caracter&iacute;sticas de la versi&oacute;n DR0.14.&nbsp;&nbsp;&nbsp;
Cuando leas este art&iacute;culo, la versi&oacute;n DR 0.14 deber&iacute;a haber salido ya, al
menos que hayan surgido problemas imprevistos.
<br>
<br>
<HR size="1" noshade>

<p align=right><i>Traducido por 
<A HREF="mailto:javipolo@cyberjunkie.com"><FONT color="#000000">Javi Polo</font></A></I></P>
</td>
</tr>
</table>

    <!--        Page   Foot        -->
    <BR clear="all">
    <CENTER>
      <TABLE width="95%">
	
	<TR>
	  <TD align="center" bgcolor="#666666">
	    <FONT color="#ffffff">
	      
	      <FONT color="#ffffff">P&aacute;ginas web mantenidas por Miguel &Aacute;ngel Sep&uacute;lveda<BR>
		&copy; Geoffrey W. Corey 1998<BR>
		<B>LinuxFocus,</B></FONT>
	    </FONT>
	  </TD>
	</TR>
	
	
      </TABLE>
      
      
</BODY>
  
</HTML>






