<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.5b1 [en] (WinNT; I) [Netscape]">
   <TITLE>Apartad5</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<H2>
<A NAME="5.3.0.- NEWS"></A><B>5.3.0.- NEWS</B></H2>

<H3>
<A NAME="5.3.1.- Free Agent"></A><B>5.3.1.- Free Agent</B></H3>

<UL><A HREF="http://www.forteinc.com" TARGET="_top">http://www.forteinc.com</A><IMG SRC="esingla2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></UL>

<H4>
<A NAME="5.3.1.1.- Cómo configuro el Free Agent"></A><B>5.3.1.1.- C&oacute;mo
configuro el Free Agent ?</B></H4>

<DD>
En la misma URL donde se encuentra este FAQ estan disponibles: el manual
"completo" del Free Agent y los FAQ del Free Agent &iacute;ntegramente
traducidos al castellano asi es que los coges y te los lees ;-)</DD>

<H4>
<A NAME="5.3.1.2.- Manual completo en castellano versión"></A>5.3.1.2.-
Manual completo en castellano versi&oacute;n 2.6</H4>

<UL>
<LI>
Manual en formato TXT:<B> </B><A HREF="ftp://ftp.ontinet.com/pub/faq/agntes26.zip">ftp://ftp.ontinet.com/pub/faq/agntes26.zip</A>&nbsp;<IMG SRC="esespan2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></LI>
</UL>

<H4>
<A NAME="5.3.1.3.- FAQs en castellano versión"></A>5.3.1.3.- FAQs en castellano
versi&oacute;n 2.7&nbsp;<IMG SRC="nuevo.gif" HEIGHT=10 WIDTH=64></H4>

<UL>
<LI>
FAQs en formato TXT: <A HREF="ftp://ftp.ontinet.com/pub/faq/agfaqe27.zip">ftp://ftp.ontinet.com/pub/faq/agfaqe27.zip</A>&nbsp;<IMG SRC="esespan2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></LI>

<LI>
FAQs en formato HTML: <A HREF="ftp://ftp.ontinet.com/pub/faq/faq27es.zip">ftp://ftp.ontinet.com/pub/faq/faq27es.zip</A>&nbsp;<IMG SRC="esespan2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></LI>

<LI>
<A HREF="faq27es.htm">Ver el FAQ</A>&nbsp;<IMG SRC="esespan2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></LI>
</UL>

<H3>
<A NAME="5.3.2.- Microsoft News"></A><B>5.3.2.- Microsoft News</B></H3>

<DD>
<A HREF="http://www.microsoft.com/msdownload/" TARGET="_top">http://www.microsoft.com/msdownload/</A>&nbsp;<IMG SRC="esingla2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER>&nbsp;<IMG SRC="esespan2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></DD>

<H3>
<A NAME="5.3.3.- Newsbeat (OS/2)"></A><B>5.3.3.- Newsbeat (OS/2)</B></H3>
Newsbeat es uno de los mejores programas de gesti&oacute;n de News (Usenet)
que hay para OS/2, junto con el PMInews. Newsbeat es shareware, y puede
conseguirse en <A HREF="http://www.cyberbeach.net/~minogue/newsbeat.html" target="_top">http://www.cyberbeach.net/~minogue/newsbeat.html</A>.
Si est&aacute; usted acostumbrado al modo de trabajo de Agent o Free Agent
para Windows, le recomiendo que use NewsBeat, puesto que su interfaz es
pr&aacute;cticamente id&eacute;ntica a la de los 2 programas anteriores.
<P>NOTA: En el momento de escribir esta FAQ, la &uacute;ltima versi&oacute;n
disponible de NewsBeat era la 1.0, y en base a ella se trata todo.
<P><A NAME="5.3.3.1 - Entrando por primera vez a NewsBeat"></A><B>5.3.3.1
- Entrando por primera vez a NewsBeat</B>
<P>Cuando entremos por primera vez a NewsBeat, nos aparecer&aacute; una
ventana con un men&uacute; que consiste en una serie de p&aacute;ginas.
En algunas p&aacute;ginas, el texto aparece 'cortado' (al menos ese es
mi caso). Si as&iacute; fuese, lo indicar&eacute; con el s&iacute;mbolo
# entre corchetes ([#]).
<P><A NAME="5.3.3.2 - Configurando ese primer menú"></A><B>5.3.3.2 - Configurando
ese primer men&uacute;</B>
<P>Como se ha hecho anteriormente, indicar&eacute; p&aacute;gina por p&aacute;gina
qu&eacute; debemos poner en cada campo:
<P><B>[Network]</B>
<BR>&nbsp;
<UL>
<LI>
[#] News Server (NNTP): Ponga aqu&iacute; la direcci&oacute;n del servidor
de News de su proveedor. En Espa&ntilde;a, casi todos los servidores de
News que hay son s&oacute;lo alias del de Ibernet (la excepci&oacute;n
la constituyen IBM y Medusa, que yo sepa). P.ej. "news.psi.ct"</LI>

<LI>
[#] Mail Server (SMTP): Ponga aqu&iacute; la direcci&oacute;n del servidor
al que usted env&iacute;a su e-mail. P.ej. "smtp.psi.ct"</LI>

<LI>
Real Name: Su nombre real. P.ej. "Pablo Garcia Quiles"</LI>

<LI>
Organization: Si usa NewsBeat desde alguna empresa u oranizaci&oacute;n,
p&oacute;ngalo aqu&iacute;. P.ej. "Unicef". En caso contrario, d&eacute;jelo
en blanco, o ponga algo como "Casa GmbH".</LI>

<LI>
Login Name: No suele hacer falta, puesto que los servidores de news son
p&uacute;blicos. Si accede a un servidor de News privado, ponga aqu&iacute;
el login que le haya sido asignado.</LI>

<LI>
Password: Idem.</LI>

<LI>
[#] Use authentication: Remarque esta casilla si accede a un servidor de
news privado.</LI>
</UL>
<B>[User]</B>
<UL>
<LI>
Recomiendo ignorar todo, excepto el campo 'Signature', donde debe poner
la firma que vaya a usar.</LI>
</UL>
<B>[Preferences]</B>
<P>Todo lo dicho para esta p&aacute;gina es muy relativo, porque es cuesti&oacute;n
de gustos. Indico c&oacute;mo lo tengo yo configurado:
<BR>&nbsp;
<UL>
<LI>
Article Sorting: Threaded</LI>

<LI>
Casilla 'Post to newsgroup' marcada</LI>

<LI>
Directory: E:\INTERNET\ARXIUS</LI>

<LI>
Casillas 'Beep when file completed', 'Use PMView to preview', 'Close PMView
After Do' y 'Overwrite Offline Messages' marcadas.</LI>
</UL>
<B>[Viewers]</B>
<UL>
<LI>
Web Browser: E:\INTERNET\NETSCAPE\NETSCAPE.EXE</LI>

<LI>
Parameters: -3</LI>
</UL>
Pulse ahora ALT+F4 y diga que s&iacute; a guardar los cambios. Ver&aacute;
que entra al NewsBeat, y salta un mensaje de error. Ignorelo.
<P><A NAME="5.3.3.3 - Configurando usuarios"></A><B>5.3.3.3 - Configurando
usuarios</B>
<P>NewsBeat es un cliente de news multiusuario (poco frecuente en el mundo
Windows), es decir, puede haber varios usuarios en el mismo programa, independientes
unos de otros. Para configurar los usuarios, vaya al men&uacute; 'Options',
y seleccione 'Edit users'. Ahora pulse 'Add' y configure un usuario:
<BR>&nbsp;
<UL>
<LI>
Username: Ponga aqu&iacute; su nombre de usuario. P.ej. "Pablo Garcia Quiles"</LI>

<LI>
Password: Ponga aqu&iacute; su password</LI>

<LI>
Again: Repita aqu&iacute; su password (para verificaci&oacute;n)</LI>

<LI>
Directory: Ponga aqu&iacute; el directori asignado a ese usuario. P.ej.
"e:\internet\newsbeat\pablo"</LI>
</UL>
<A NAME="5.3.3.4 - Usando NewsBeat"></A><B>5.3.3.4 - Usando NewsBeat</B>
<P>Una vez configurado este usuario, ya podemos trabajar con NewsBeat.
Indico las acciones m&aacute;s comunes:
<BR>&nbsp;
<UL>
<LI>
Conectar al servidor de news: Pulse Control+C o vaya al men&uacute; 'Options'
y seleccione 'Connect to server'.</LI>

<LI>
Coger la lista de newsgroups por primera vez: Vaya al men&uacute; 'Newsgroups'
y seleccione 'Refresh list from server'</LI>

<LI>
Actualizar la lista de newsgroups: Vaya al men&uacute; 'Newsgroups' y seleccione
'Update'</LI>

<LI>
Marcar un mensaje para tra&eacute;rselo y leerlo offline: Vaya al men&uacute;
'Message' y seleccione 'Mark for offline download'.</LI>

<LI>
Traerse los mensajes marcados: Vaya al men&uacute; 'Message' y seleccione
'Download all marked messages (offline)'.</LI>
</UL>
<A NAME="5.3.3.5 - Los iconos de NewsBeat"></A><B>5.3.3.5 - Los iconos
de NewsBeat</B>
<P>En la versi&oacute;n 1.0 aparecen 15 iconos. Su funci&oacute;n se explica
a continuaci&oacute;n, empezando de izquiera a derecha:
<BR>&nbsp;
<UL>
<LI>
1&ordm;: Editar un nuevo mensaje</LI>

<LI>
2&ordm;: Contestar un mensaje</LI>

<LI>
3&ordm;: Imprimir</LI>

<LI>
4&ordm;: Decodificar un mensaje uuencodeado</LI>

<LI>
5&ordm;: Guardar un mensaje</LI>

<LI>
6&ordm;: Copiar un mensaje al portapapeles</LI>

<LI>
7&ordm;: Marcar este mensaje como leido (Mark read)</LI>

<LI>
8&ordm;: Marcar este mensaje como no-leido (Mark Unread)</LI>

<LI>
9&ordm;: Marcar todos los mensajes como leidos (Mark all read)</LI>

<LI>
10&ordm;: Marcar todos los mensajes como no-leidos (Mark all unread)</LI>

<LI>
11&ordm;: Abre el navegador para internet</LI>

<LI>
12&ordm;: Muestra todas las opciones disponibles en las ventanas de listado
de grupos y listado de mensajes por grupo de news (zoom mode).</LI>

<LI>
13&ordm;: Muestra s&oacute;lo las opciones por defecto en las ventanas
de listado de grupos y listado de mensajes por grupo de news (normal mode).</LI>

<LI>
14&ordm;: Abre la ventana de configuraci&oacute;n</LI>

<LI>
15&ordm;: Supuestamente este bot&oacute;n es para salir del programa, pero
en realidad nos lleva a la ayuda.</LI>
</UL>
<A NAME="5.3.3.6 - La Uudecode Queue"></A><B>5.3.3.6 - La Uudecode Queue</B>
<P>En la mayor&iacute;a de programas de gesti&oacute;n de News para el
entorno Windows, si queremos decodificar m&aacute;s de un mensaje, hemos
de ir decodificando uno por uno, esperando a que acabe cada uno, para poder
empezar con el siguiente. En Newsbeat, esto NO es as&iacute;. NewsBeat
tiene lo que sus programadores llaman 'Uudecode queue', es decir, una 'cola
de mensajes para ser uudecodeados', con lo que podemos (pulsando el cuarto
icono) a&ntilde;adir todos los mensajes que queramos a esa cola, y NewsBeat
los ir&aacute; uudecodeando en modo background (sin que nos demos cuenta,
y sin tener que esperar).
<P><A NAME="5.3.3.7 - El ratón en NewsBeat"></A><B>5.3.3.7 - El rat&oacute;n
en NewsBeat</B>
<P>El rat&oacute;n es especialmente &uacute;til en NewsBeat:
<BR>&nbsp;
<UL>
<LI>
Pulsando sobre cada uno de los 15 iconos con el bot&oacute;n derecho, aparecer&aacute;
una peque&ntilde;a descripci&oacute;n de cada bot&oacute;n</LI>

<LI>
Pulsando con el bot&oacute;n izquierdo sobre los botones que encabezan
cada una de las tres ventanas de NewsBeat (cuando est&aacute; en modo normal)
ir&aacute; cambiando lo que nos muestre en cada momento en esa ventana.</LI>

<LI>
Pulsando con el bot&oacute;n derecho en alg&uacute;n sitio de cada una
de las tres ventanas (en normal mode) nos aparecer&aacute; una lista de
acciones que podemos efectuar (distinta para cada ventana)</LI>
</UL>
<A NAME="5.3.3.8 - Los autores de NewsBeat"></A><B>5.3.3.8 - Los autores
de NewsBeat</B>
<BR>&nbsp;
<DD>
Vipin Bhargava, uno de los autores de NewsBeat suele estar en el canal
#OS/2 de la red de IRC EfNet con el nick "Vip" (sin comillas). Pod&eacute;is
conectaros a Efnet en los servidores irc.ais.net e irc.concentric.net (entre
otros muchos).</DD>

<DL>
<CENTER>
<DT>

<HR WIDTH="100%"></DT></CENTER>

<LI>
<I>FAQ.ESP.INTERNET Versi&oacute;n 2.0.9</I></LI>

<LI>
<I>Recopilado por Agustin MuNoz 2:346/201.9@fidonet.org</I></LI>

<LI>
<!-- date start --><I>Ultima Actualizaci&oacute;n el Viernes 4 de Septiembre
de 1998.</I><!-- date end --></LI>

<ADDRESS>

<HR WIDTH="100%"></ADDRESS>

<ADDRESS>
<I>Para reproducciones totales o parciales de este FAQ por favor lee atentamente
el Apartado </I><A HREF="Apart1.htm#1.5.0.- Copyright">1.5.0.- Copyright</A>&nbsp;<I></I></ADDRESS>
</DL>

</BODY>
</HTML>
