<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.5b1 [en] (WinNT; I) [Netscape]">
   <TITLE>Apartad5</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<H2>
<A NAME="5.2.0.- E-MAIL"></A><B>5.2.0.- E-MAIL</B></H2>

<H3>
<A NAME="5.2.1.- Eudora"></A><B>5.2.1.- Eudora</B></H3>
Uno de los m&aacute;s populares lectores de e-mail de los llamados "off-line"
Existen dos versiones "Lite" versi&oacute;n freeware y "Pro" versi&oacute;n
de pago
<BR>Las versiones Lite son todas en Ingl&eacute;s y las Pro (pagando) est&aacute;n
en varios idiomas, castellano incluido.
<P>&nbsp;&nbsp;&nbsp; <A HREF="http://www.eudora.com" TARGET="_top">http://www.eudora.com</A><IMG SRC="esingla2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER>
<H3>
<A NAME="5.2.1.1.- Cómo configuro el Eudora"></A><B><FONT SIZE=+0>5.2.1.1.-
C&oacute;mo configuro el Eudora</FONT></B></H3>
La Instalaci&oacute;n no reviste ninguna complicaci&oacute;n, puesto que
el SETUP lo hace todo, configurandose durante el primer uso del programa.
<P>Los campos vitales para su configuraci&oacute;n son los siguientes:
<BR>&nbsp;
<UL>
<LI>
<B>1.-</B> En el Apartado <B>Getting Started</B>, cubriremos el espacio
<B>POP
account</B> de la siguiente manera:</LI>

<BR>Si mi servidor de correo electronico es <B>mail.geocities.com</B>,
y mi direcci&oacute;n particular es <B>guti@geocities.com</B>, el POP Account
es una mezcla de ambos, normalmente <B>usuario@servidor_de_correo</B> quedando
<B>guti@mail.geocities.com
</B>&eacute;sta no es nuestra verdadera direcci&oacute;n y si nuestros
futuros "maileadores" intentaran escribirnos a esta direcci&oacute;n, probablemente
les daria error, aunque es necesario para el buen funcionamiento del programa,
no obstante, este problema lo solucionaremos mas adelante.
<LI>
<B>2.- </B>De nuevo en el Apartado <B>Getting Started</B>, cubriremos el
espacio <B>Real Name</B>, poniendo nuestro nombre o pseud&oacute;nimo,
teniendo en cuenta que ser&aacute; con el que nos conozcan los dem&aacute;s.
En mi caso, pondria <B>Agustin MuNoz</B>.</LI>

<LI>
<B>3.- </B>En el Apartado <B>Personal Information</B>, veremos que los
dos primeros espacios estan cubiertos, por lo que solo nos queda poner
en el espacio <B>Return Address</B> nuestra aut&eacute;ntica direcci&oacute;n,
&eacute;sta ser&aacute; la direccion donde vayan los emails que nos contesten
es decir, en mi caso quedaria: <B>guti@geocities.com</B></LI>

<LI>
<B>4.- </B>El ultimo dato b&aacute;sico para configurar est&aacute; en
el Apartado <B>Sending Mail</B>, donde tenemos que desactivar la casilla
<B>Immediate
Send</B> para poder utilizar el programa Off-Line.</LI>
</UL>

<DT>
<B>Eudora FAQs &amp; Links</B></DT>

<DT>
Excelente site con FAQs, add-ons, ayudas y links a otros sites relacionados
con Eudora</DT>

<DT>
<A HREF="http://wso.williams.edu/~eudora/index.html" TARGET="_top">http://wso.williams.edu/~eudora/index.html</A>&nbsp;<IMG SRC="esingla2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></DT>

<BR>&nbsp;
<H3>
<A NAME="5.2.1.2.- Funciones Básicas"></A><B><FONT SIZE=+0>5.2.1.2.- Funciones
B&aacute;sicas</FONT></B></H3>
ESCRIBIR UN MENSAJE SALIENTE.
<P>Ir a men&uacute; <B>"Message"</B>, seleccionar <B>"New Message"</B>.
Se abrir&aacute; una ventana nueva.
<BR>&nbsp;
<UL>
<LI>
En la cabecera, el campo <B>"To:"</B> es el destinatario a quien quieres
envi&aacute;rselo,</LI>

<LI>
En el campo <B>"From:"</B> se escribe autom&aacute;ticamente tu propia
direcci&oacute;n de correo,</LI>

<LI>
En el campo <B>"Subject:"</B> se pone la tem&aacute;tica del mensaje.</LI>
</UL>
Por ahora, prescindiremos de los otros campos, ya entraremos m&aacute;s
adelante en ellos. Bajo la cabecera del mensaje, est&aacute; el cuerpo,
donde escribes lo que quieres escribir.Una vez terminado se pulsa el bot&oacute;n
<B>"Send"</B>.
<BR>&nbsp;
<P>GUARDAR UN MENSAJE SALIENTE.
<P>Para guardar cualquier mensaje saliente, ir al men&uacute; <B>"File"</B>,
seleccionar <B>"Save"</B>. Esto guardar&aacute; el mensaje en el buz&oacute;n
<B>"Out"</B>.
Ver&aacute;s que aparece un punto gordo a la izquierda, significa que ese
mensaje est&aacute; listo para ser enviado.
<BR>&nbsp;
<P>ENVIAR UN MENSAJE SALIENTE.
<P>Cuando pulsamos el bot&oacute;n <B>"Send"</B> a la hora de escribir
el mensaje, se env&iacute;a. M&aacute;s tarde entraremos en este tema.
<BR>&nbsp;
<P>CHEQUEAR CORREO Y RECIBIR MENSAJES.
<P>Hay dos maneras de hacerlo. Una es el chequeo autom&aacute;tico y otra
es el chequeo manual, ir al men&uacute; <B>"File"</B> y seleccionar <B>"Check
Mail"</B>.
<BR>&nbsp;
<UL>
<LI>
Te pedir&aacute; tu <B>clave de acceso</B>. Introd&uacute;celo y pulsa
<B>"OK"</B>.
Cuidado, debes introducirlo exactamente como es, respetando may&uacute;sculas
y min&uacute;sculas.</LI>

<LI>
Si todo va bien, chequear&aacute; tu buz&oacute;n electr&oacute;nico.</LI>

<LI>
Si no hay correo nuevo, te aparecer&aacute; una ventana que dice <B>"You
have no new mail"</B>.</LI>

<LI>
Si hay correo, te aparecer&aacute; el aviso <B>"You have new mail"</B>.
El correo lo encontrar&aacute;s en el buz&oacute;n "In". Los que est&aacute;n
se&ntilde;alados con un punto gordo, son los que tienes sin leer.</LI>

<LI>
Pulsando sobre cada mensaje de la lista, se abrir&aacute; para poder leerlo.</LI>
</UL>

<P><BR>RESPONDER A UN MENSAJE.
<UL>
<LI>
Teniendo el mensaje abierto que deseas responder, ir a men&uacute; <B>"Message"</B>
y seleccionar <B>"Reply"</B>.</LI>

<LI>
Se abrir&aacute; una ventana con el campo <B>"To:"</B> con la direcci&oacute;n
de destino a&ntilde;adida autom&aacute;ticamente, el campo <B>"From:"</B>
con tu direcci&oacute;n, y el campo <B>"Subject:"</B></LI>

<LI>
Con el mismo subject del mensaje anterior, excepto que empieza por <B>"RE:"</B>
(de "reply", responder).</LI>

<LI>
En el cuerpo del mensaje ver&aacute;s una copia del mensaje al que respondes,
en cada l&iacute;nea hay un car&aacute;cter <B>">"</B> (u otra similar)
indicando que es texto del mensaje a responder. A este texto copia del
mensaje anterior se llama <B>"quote"</B>.</LI>

<LI>
&nbsp;Despu&eacute;s de responder, pulsar el bot&oacute;n <B>"Send"</B>.</LI>
</UL>

<P><BR>TRANSFERIR MENSAJES ENTRE BUZONES Y/O CARPETAS.
<P>Esta opci&oacute;n es sumamente &uacute;til para organizar tus mensajes.
<P>Para crear un nuevo buz&oacute;n y transferir tu mensaje en &eacute;l,
abre el buz&oacute;n <B>"In"</B> , selecciona el mensaje, y desde el men&uacute;
<B>"Transfer"</B>,
selecciona <B>"New..."</B>. Se abrir&aacute; una ventana pidi&eacute;ndote
el nombre del nuevo buz&oacute;n. Por ejemplo, para los mensajes de la
lista Grumetes, quiz&aacute;s desees ponerle el nombre <B>"GRUMETES"</B>.
Pulsa <B>"OK"</B> para crear el nuevo buz&oacute;n. El mensaje se transferir&aacute;
al nuevo buz&oacute;n. Si se trata de un buz&oacute;n que ya existe, s&oacute;lo
tienes que seleccionarlo de la lista que tienes debajo de <B>"New..."</B>.
<BR>&nbsp;
<P>BORRAR UN MENSAJE
<BR>&nbsp;
<UL>
<LI>
Para borrar un mensaje, abrirlo o seleccionarlo del buz&oacute;n correspondiente.</LI>

<LI>
Seleccionar entonces <B>"Delete"</B> del men&uacute; <B>"Message"</B>.
No se borra, se transfiere al buz&oacute;n <B>"Trash"</B> (podemos traducirlo
como "Papelera", aunque literalmente es "Basura").</LI>

<LI>
Si seleccionas <B>"Empty Trash"</B> del men&uacute; <B>"Special"</B>, se
vaciar&aacute; este buz&oacute;n y se borran definitivamente los mensajes.</LI>
</UL>
Es &uacute;til que no se borren definitivamente al momento, puede que cambies
de idea sobre un mensaje, o que haya habido un error.
<BR>&nbsp;
<BR>&nbsp;
<H3>
<A NAME="5.2.1.3.- Escribiendo mensajes"></A><B><FONT SIZE=+0>5.2.1.3.-
Escribiendo mensajes</FONT></B></H3>
ESCRIBIR UN MENSAJE NUEVO
<P>Como vimos en el apartado anterior, seleccionar <B>"New Message"</B>
del menu <B>"Message"</B>. S&oacute;lo que ahora os explico con m&aacute;s
detalle lo que hay.
<BR>&nbsp;
<P>BARRA DE HERRAMIENTAS.
<P>Aqu&iacute; tenemos una serie de botones y men&uacute;s desplegables.
La barra de herramientas est&aacute; justo bajo la barra de t&iacute;tulo.
<BR>&nbsp;
<UL>
<LI>
El primer men&uacute; desplegable, es el <B>Men&uacute; de Prioridad</B>.
Hay cinco opciones desde <B>"Highest"</B> (el m&aacute;s alto) hasta <B>"Lowest"</B>
(el m&aacute;s bajo). Por defecto est&aacute; en <B>"Normal"</B>.</LI>

<LI>
El segundo men&uacute; desplegable, es el <B>Men&uacute; de las Firmas</B>.
Hay tres opciones, <B>"None"</B>, <B>"Alternative"</B> o <B>"Standard"</B>.
Por defecto es <B>"Standard"</B>.</LI>

<LI>
El tercer men&uacute; desplegable es el <B>formato de codificaci&oacute;n</B>
para el env&iacute;o de ficheros. Hay dos opciones, <B>"MIME"</B> y <B>"BinHex"</B>.
Por defecto es <B>"MIME"</B>.</LI>
</UL>
Despu&eacute;s sigue una serie de botones. Excepto el &uacute;ltimo, est&aacute;n
"hundidos" cuando est&aacute;n activos y "sin hundir" cuando est&aacute;n
inactivos.
<UL>
<LI>
El primer bot&oacute;n es la codificaci&oacute;n <B>"Quoted-Printable"</B>.
Se usa cuando env&iacute;as mensajes con l&iacute;neas muy largas o con
caracteres especiales. Se recomienda tenerlo siempre activo.</LI>

<LI>
El segundo bot&oacute;n, <B>"Text As Document"</B>, es la opci&oacute;n
de enviar ficheros de texto como ficheros aparte, no como parte del mensaje.
Cuando est&aacute; activo, los ficheros de texto se env&iacute;an aparte,
cuando est&aacute; inactivo, los incluye en el cuerpo del mensaje.</LI>

<LI>
El tercer bot&oacute;n, <B>"Word Wrap"</B>, permite que salto de l&iacute;nea
sea autom&aacute;tico, en vez de tener que saltar t&uacute; mismo a la
l&iacute;nea siguiente cuando est&aacute;s escribiendo l&iacute;neas y
frases largas.</LI>

<LI>
El cuarto bot&oacute;n, <B>"Tabs in Body"</B>, cuando est&aacute; activo
permite usar el bot&oacute;n <B>"Tab"</B> como tabulador en el cuerpo del
mensaje que escribes. Cuando est&aacute; inactivo, salta el cursor a los
campos de la cabecera.</LI>

<LI>
El quinto bot&oacute;n, <B>"Keep copy"</B>, cuando est&aacute; activo guarda
una copia del mensaje que escribes en el buz&oacute;n <B>"Out"</B> cuando
se env&iacute;a el mensaje. Se guardar&aacute;n hasta que sean borrados
o transferidos. Si se inactiva, se borrar&aacute; autom&aacute;ticamente
despu&eacute;s de enviado.</LI>

<LI>
El sexto bot&oacute;n, <B>"Send"</B> o <B>"Queue"</B>, por defecto est&aacute;
en <B>"Send"</B>, por lo que env&iacute;a inmediatamente el mensaje. M&aacute;s
adelante se explica la opci&oacute;n <B>"Queue"</B>, que se queda en espera
hasta que conectes, y entonces se env&iacute;a autom&aacute;ticamente.</LI>
</UL>
CABECERA DEL MENSAJE
<P>Encontrar&aacute;s seis campos visibles: <B>To</B>, <B>From</B>, <B>Subject</B>,
<B>Cc</B>,
<B>Bcc</B> y <B>Attachments</B>. Los cinco primeros pueden editarse directamente,
el sexto se usa de otra manera.
<BR>&nbsp;
<OL>
<LI>
<B>TO:</B> En este campo se pone la direcci&oacute;n o direcciones a enviar,
o alias que hayas definido (se explicar&aacute; en un mensaje posterior
esto). Cada direcci&oacute;n y alias debe estar separado por comas.</LI>

<LI>
<B>FROM:</B> En este campo se pone autom&aacute;ticamente tu nombre y direcci&oacute;n
de correo, tal y como lo hayas configurado.</LI>

<LI>
<B>SUBJECT:</B> En este campo se indica la tem&aacute;tica del mensaje,
o alguna otra frase que de una orientaci&oacute;n sobre el mensaje. <B>Puede</B>
dejarse en blanco, <B>pero no es recomendable.</B></LI>

<LI>
<B>CC:</B> En este campo, al igual que "To:", es para a&ntilde;adir direcciones
y/o alias a quienes quieres enviar una copia del mensaje (CC es abreviatura
de "Carbon Copy", en alusi&oacute;n a las copias en papel carb&oacute;n
de la &eacute;poca de mecanograf&iacute;a). Tambi&eacute;n cada direcci&oacute;n
o alias debe estar separado entre s&iacute; por una coma. Es de uso opcional.
Los destinatarios de este campo, son visibles para los destinatarios del
campo "To:"</LI>

<LI>
<B>BCC:</B> Lo mismo que el anterior, pero el destinatario de "To:" no
sabr&aacute;
que se ha enviado copias a los destinatarios puestos aqu&iacute;, dado
que son "invisibles" para &eacute;l. Tambi&eacute;n es de uso opcional.</LI>

<LI>
<B>ATTACHMENTS:</B> En este campo se indica uno o m&aacute;s ficheros a
enviar junto al mensaje. M&aacute;s adelante se explica esto.</LI>
</OL>
USANDO UNA FIRMA
<P>Una firma consiste en unas pocas l&iacute;neas (no se recomienda m&aacute;s
de cinco), que se a&ntilde;aden autom&aacute;ticamente al final del mensaje.
Se suele usar para dar
<BR>una informaci&oacute;n de contacto (direcci&oacute;n electr&oacute;nica
o postal, tel&eacute;fono, etc.).
<P>Nota: No te preocupes si t&uacute; no ves la firma en los mensajes que
escribes, se a&ntilde;aden de todas formas autom&aacute;ticamente.
<P>Para crear o modificar las firmas normal ("Standard") o alternativa
("Alternate"), hay que ir al submen&uacute; <B>"Signatures"</B>, en el
men&uacute; <B>"Tools"</B>. Elige cualquiera de las dos, introduce el texto
que deseas, y selecciona <B>"Save"</B> del men&uacute; <B>"File"</B>.
<P>La firma <B>"Standard"</B> se a&ntilde;ade por defecto, pero si quieres
que se use la firma <B>"Alternate"</B> o que no haya ninguna firma, cuando
escribas o contestes un mensaje, despliega el segundo men&uacute; y escoge
la opci&oacute;n que prefieras: <B>"none"</B> (sin firma), <B>"Alternate"</B>
(firma alternativa) o <B>"Standard"</B> (firma normal)
<P><A NAME="CAMBIANDO LA PRIORIDAD DEL MENSAJE"></A>
<BR>CAMBIANDO LA PRIORIDAD DEL MENSAJE
<P>La prioridad que asignes no influye en cuando al env&iacute;o y recepci&oacute;n
de los mensajes. Es s&oacute;lo una indicaci&oacute;n para t&iacute; y
para los destinatarios de los mensajes, del tipo de prioridad que tiene
el mensaje entre vosotros. Hay cinco niveles de prioridad, desde <B>"highest"</B>
(muy urgente) hasta <B>"lowest"</B> (no hay ninguna prisa, no es importante),
por defecto est&aacute; en normal. Para seleccionarlo, cuando escribes
o contestas un mensaje, despliega el primer men&uacute; y selecciona el
que prefieres. Las opciones <B>"high"</B> (urgente) y <B>"highest"</B>
(muy urgente) est&aacute;n en rojo.
<BR>&nbsp;
<P>A&Ntilde;ADIR ("ATTACHEAR") UN FICHERO A UN MENSAJE
<P>Puedes a&ntilde;adir cualquier fichero, del tipo que sea, a un mensaje.
Pueden ser ficheros de texto, fotos, ficheros comprimidos, documentos,
etc.
<P>Para a&ntilde;adir un fichero a un mensaje saliente, selecciona la opci&oacute;n
<B>"Attach
File"</B> del men&uacute; <B>"Message"</B>. Se abrir&aacute; una ventana
donde puedes seleccionar el fichero para a&ntilde;adir. Puedes repetirlo
tantas veces como quieras.
<P>Si por alguna raz&oacute;n has cambiado de idea sobre un fichero a enviar,
lo seleccionas y pulsas el bot&oacute;n <B>"Supr"</B> o seleccionas <B>"Clear"</B>
del menu <B>"Edit"</B>.
<P>Cuando se trata de un fichero de texto, puedes enviarlo como un fichero
aparte, o como parte del mensaje. Para ello tienes el bot&oacute;n correspondiente
<BR>en la barra de herramientas, tal y como hemos visto.
<P>El tipo de codificaci&oacute;n puede ser <B>MIME</B> o <B>Bin-Hex</B>.
<BR>&nbsp;
<UL>
<LI>
<B>MIME</B>. Es la mejor opci&oacute;n para la mayor&iacute;a de los lectores
de correo actuales.</LI>

<LI>
<B>BinHex</B>. Esta opci&oacute;n es conveniente para destinatarios que
usen Macintosh, o para quienes tienen lectores de correo antiguos, que
no admiten MIME.</LI>
</UL>
Ya vimos que esto se selecciona desde el tercer menu desplegable al escribir
o responder un mensaje.
<BR>&nbsp;
<P>INCLUIR UNA URL EN UN MENSAJE.
<P>Para incluir una direcci&oacute;n URL en un mensaje, ten&eacute;is que
encerrarlo entre los s&iacute;mbolos <B>"&lt;"</B> y <B>">"</B>. De esta
manera, el programa de vuestro destinatario podr&aacute; identificar que
se trata de una direcci&oacute;n URL.
<BR>&nbsp;
<P>SALVAR O GUARDAR UN MENSAJE PARA SEGUIR ESCRIBI&Eacute;NDOLO O MODIFIC&Aacute;NDOLO
MAS TARDE.
<BR>&nbsp;
<UL>
<LI>
En vez de darle al bot&oacute;n <B>"Send/Queue"</B>, usad la opci&oacute;n
Salvar que os expliqu&eacute; en el primer apartado.</LI>

<LI>
En cualquier momento pod&eacute;is seleccionar el mensaje, que estar&aacute;
en el buz&oacute;n <B>"Out"</B>, para seguir escribiendo o respondiendo
antes de enviarlo.</LI>

<LI>
Esto es &uacute;til con mensajes largos.</LI>
</UL>

<H3>
<A NAME="5.2.1.4.- Enviando mensajes"></A><B><FONT SIZE=+0>5.2.1.4.- Enviando
mensajes</FONT></B></H3>
Despu&eacute;s de escribir un mensaje, puedes mandarlo inmediatamente o
ponerlo en estado de espera para enviarlo m&aacute;s tarde.
<P>ENVIANDO UN MENSAJE INMEDIATAMENTE.
<P>Si quieres enviar tus mensajes inmediatamente en vez de ponerlos en
estado de espera para enviarlos m&aacute;s tarde, entonces asegurate que
la opci&oacute;n <B>"Immediate send"</B> est&eacute; activa. Esta opci&oacute;n
se encuentra en en el men&uacute; <B>"Tools"</B>, selecci&oacute;n <B>"Options"</B>.
Una vez en ella se abre una ventana, escoger el men&uacute; <B>"Sendind
Mail"</B>, y all&iacute; se encontrar&aacute; la opci&oacute;n <B>"Immediate
send"</B>.
<P>Para enviar un mensaje, pulsar el bot&oacute;n <B>"Send"</B> o seleccionar
la opci&oacute;n <B>"Send Immediately"</B> en el men&uacute; <B>"Message"</B>.
<P>Si tienes la opci&oacute;n <B>"Immediate Send"</B> activada, pero quieres
poner el mensaje en estado de espera, entonces presiona el bot&oacute;n
<B>"Shift"</B>
antes de pulsar en el bot&oacute;n <B>"Send"</B>.&nbsp; Aparecer&aacute;
una ventana sobre la que se hablar&aacute; m&aacute;s adelante.
<BR>&nbsp;
<P>PONIENDO UN MENSAJE EN ESTADO DE ESPERA PARA ENVIAR M&Aacute;S TARDE.
<BR>&nbsp;
<UL>
<LI>
Si quieres poner tus mensajes en estado de espera (en el buz&oacute;n <B>"Out"</B>)
para enviarlos todos juntos m&aacute;s tarde, aseg&uacute;rate que la opci&oacute;n
<B>"Immediate
send"</B> est&eacute; desactivado, en <B>"Tools" -> "Options" -> "Sending
Mail"</B>.</LI>

<LI>
Para configurar Eudora para que te avise o no si intentas borrar mensajes
en estado de espera, o si sales sin enviarlos, encontrar&aacute;s las opciones
correspondientes en <B>"Tools" -> "Options" -> "Extra Warnings".</B></LI>

<LI>
Para poner un mensaje en estado de espera, pulsar el bot&oacute;n <B>"Queue"</B>
o seleccionar <B>"Queue for Delivery"</B> del men&uacute; <B>"Message"</B>.
Se cerrar&aacute; la ventana del mensaje y se guardar&aacute; en el buz&oacute;n
<B>"Out"</B>,
ver&aacute;s que tiene una marca <B>"Q"</B> (que significa que est&aacute;
listo para enviar).</LI>

<LI>
Para enviar todos tus mensajes en estado de espera, seleccionar <B>"Send
Queued Messages"</B> del men&uacute; <B>"File"</B>.</LI>
</UL>
Si tienes la opci&oacute;n <B>"Immediate Send"</B> desactivada, pero quieres
mandar un mensaje inmediatamente, pulsa la tecla <B>"Shift"</B> y despu&eacute;s
el bot&oacute;n <B>"Queue"</B>. Aparecer&aacute; una ventana de la que
se hablar&aacute; m&aacute;s tarde con detalle, selecciona la opci&oacute;n
<B>"Send
message Right Now"</B> para enviarlo ahora.
<BR>&nbsp;
<P>PONIENDO UN MENSAJE EN ESTADO DE ESPERA POR UN TIEMPO DETERMINADO.
<P>Puedes especificar que un mensaje sea enviado en un determinado momento
en el futuro.
<P>Para hacer esto en un mensaje saliente, selecciona <B>"Messages" ->
"Change" -> "Queueing..."</B>
<BR>Una ventana <B>"Change Queueing"</B>, mencionada ya m&aacute;s arriba,
aparecer&aacute;:
<BR>&nbsp;
<UL>
<LI>
La opci&oacute;n <B>"Right Now"</B> es para enviarlo inmediatamente, despu&eacute;s
de pulsar <B>"OK"</B>.</LI>

<LI>
La opci&oacute;n <B>"Next time queued messages are sent"</B> enviar&aacute;
el mensaje la pr&oacute;xima vez que sean enviados todos juntos.</LI>

<LI>
En la opci&oacute;n <B>"On or after"</B>, puedes usar los campos <B>"Time"</B>
(hora) y <B>"Date"</B> (fecha) para seleccionar el d&iacute;a y hora en
el que ser&aacute; enviado. En este caso el mensaje se guardar&aacute;
en el buz&oacute;n <B>"Out"</B> marcado con una <B>"T"</B>. El mensaje
se enviar&aacute; en el momento programado.</LI>
</UL>
<B>Nota</B>: Para que se env&iacute;e en ese momento, Eudora debe estar
ejecut&aacute;ndose. Si no lo est&aacute;, se mandar&aacute; el mensaje
en la primera ocasi&oacute;n que se ejecute despu&eacute;s de esa hora
y fecha.
<P>La opci&oacute;n <B>"Don't Send"</B> har&aacute; que el mensaje nunca
est&eacute; en estado de espera, nada suceder&aacute;. Se quedar&aacute;
"congelado" en el buz&oacute;n <B>"Out"</B> hasta que se borre, se mantenga
en estado de espera, o se env&iacute;e.
<BR>&nbsp;
<P>EDITANDO UN MENSAJE EN ESTADO DE ESPERA.
<P>Para editar un mensaje en estado de espera, abrir el buz&oacute;n <B>"Out"</B>
y seleccionar el mensaje de la lista. Hacer los cambios necesarios y salvarlo.
<BR>&nbsp;
<P>PONIENDO UN MENSAJE FUERA DEL ESTADO DE ESPERA.
<P>Un mensaje que est&aacute; en estado de espera puede a&uacute;n no enviarse
usando el comando <B>"Change Queueing"</B>. Abrir el buz&oacute;n <B>"Out"</B>
y seleccionar el mensaje deseado de la lista. Seleccionar <B>"Change Queueing..."</B>
como ya dijimos antes y pulsar <B>"Don't Send"</B>. Esto cambiar&aacute;
el estado del mensaje, de la <B>"Q"</B> (estado de espera) al punto gordo
(simplemente guardado). El mensaje permanecer&aacute; "congelado" en el
buz&oacute;n <B>"Out"</B> hasta que lo borremos, volvamos a ponerlo en
estado de espera, o lo enviemos.
<BR>&nbsp;
<P>ENVIANDO MENSAJES EN ESTADO DE ESPERA CUANDO CHEQUEAMOS EL CORREO.
<P>Si la opci&oacute;n <B>"Send on check"</B> en -> <B>"Tools" -> "Options"
-> "Sending Mail"</B> est&aacute; activado. Cada vez que conectes para
chequear el nuevo correo (autom&aacute;ticamente o manualmente), se enviar&aacute;n
autom&aacute;ticamente todos los mensajes en estado de espera.
<BR>&nbsp;
<P>GUARDANDO COPIAS DE MENSAJES SALIENTES.
<P>Hay dos maneras de hacer esto:
<BR>&nbsp;
<UL>
<LI>
Poner cada mensaje en el buz&oacute;n <B>"Out"</B>, activando la opci&oacute;n
<B>"Keep
copies"</B> (<B>"Tools" -> "Options" -> "Sending Mail"</B>). Esto lo har&aacute;
autom&aacute;ticamente en todos los mensajes.</LI>

<LI>
Poner cada mensaje en el buz&oacute;n <B>"Out"</B>, activando el bot&oacute;n
<B>"Keep
copy"</B> en la barra de herramientas. Esto lo har&aacute; en cada mensaje
que se active el bot&oacute;n.</LI>
</UL>
En ambos casos, cuando se env&iacute;an los mensajes, permanecen el el
buz&oacute;n <B>"Out"</B> marcados con una <B>"S"</B> a la izquierda, indicando
que esos mensajes fueron enviados.
<P>NOTA GENERAL: <B>"Queue"</B> significa literalmente <B>"Guardar cola"</B>,
sin embargo, he cre&iacute;do que aqu&iacute; se entiende mejor como <B>"En
estado de espera"</B>.
<BR>&nbsp;
<H3>
<A NAME="5.2.1.5.- Recibiendo mensajes"></A><B><FONT SIZE=+0>5.2.1.5.-
Recibiendo mensajes</FONT></B></H3>
Hay dos maneras de chequear tu correo: autom&aacute;ticamente o manualmente.
<P>CHEQUEANDO DE FORMA AUTOMATICA.
<P>Para configurar Eudora para chequear autom&aacute;ticamente si hay correo
nuevo, ve al <B>"Men&uacute; Tools"</B>, selecciona <B>"Options"</B>. All&iacute;,
una vez que se abra la ventana de configuraci&oacute;n, ve a <B>"Checking
Mail Options"</B> y una vez all&iacute;, en el campo <B>"Check for mail
every ? minutes"</B>, introduces cada cu&aacute;nto tiempo chequear&aacute;
el correo, en minutos. Un m&iacute;nimo recomendado puede ser 15 minutos.
Menos tiempo es en realidad innecesario. Si este campo est&aacute; vac&iacute;o,
o su valor es 0, entonces no hay chequeo autom&aacute;tico de tu correo.
<BR>&nbsp;
<P>CHEQUEANDO DE FORMA MANUAL.
<P>Para chequear manualmente si tienes correo nuevo, selecciona <B>"Check
Mail"</B> desde el menu <B>"File"</B>.
<P>En ambos casos se abrir&aacute; una ventana durante el chequeo y transferencia
de correo. Si deseas pararlo por alguna raz&oacute;n, s&oacute;lo tienes
que presionar en el bot&oacute;n <B>"Stop"</B>.
<BR>&nbsp;
<P>USANDO TU PASSWORD O CLAVE DE ACCESO
<P>Cada vez que ejecutas el Eudora y chequeas el correo la primera vez,
necesitas introducir tu clave correspondiente a tu cuenta POP. La clave
la solicita el servidor POP de tu proveedor de Internet antes de poder
transferirte tu correo, de esta manera nadie puede acceder a tu correo.
<P>Hay que tener en cuenta que esto no significa que una vez que est&eacute;
en tu ordenador significa que siga estando protegido, a menos que los mensajes
hayan sido enviados con alg&uacute;n sistema de seguridad, por ejemplo,
encriptaci&oacute;n.
<P>Cuando se precisa introducir la clave, se abre un cuadro de di&aacute;logo
para ello. Basta con teclearte y pulsar OK.
<P>Mientras Eudora est&aacute; ejecut&aacute;ndose, recordar&aacute; tu
clave de acceso, con lo que no tienes necesidad de introducirlo en cada
chequeo que hagas. Pero si por alguna raz&oacute;n no quieres que lo recuerde,
por ejemplo porque vas a dejar el ordenador sin vigilancia o lo que sea,
simplemente ve al menu <B>"Special"</B> y selecciona <B>"Forget Password"</B>.
Con esto, Eudora olvidar&aacute; la clave de acceso.
<P>Pero tambi&eacute;n puedes hacer que Eudora recuerde tu clave de acceso
en todas las sesiones, sin necesidad de tener que estar introduci&eacute;ndolo
cada vez que ejecutes Eudora. Para ello, ve a <B>"Tools" -> "Options" ->
"Checking Mail Options"</B> y activa la opci&oacute;n <B>"Save Password"</B>.
<BR>&nbsp;
<P>CAMBIANDO TU CLAVE DE ACCESO
<P>Para cambiar tu clave de acceso, ve a <B>"Special"</B> y selecciona
<B>"Change
Password"</B>. Te preguntar&aacute; por la clave antigua, y despu&eacute;s
te pedir&aacute; que introduzcas la nueva dos veces. El hecho de que lo
pida dos veces es para comparar y evitar cualquier error que hayas tenido
al teclearla. Eudora admite claves de acceso de hasta 30 caracteres, aunque
normalmente son de 7 u 8.
<P><B>NOTA</B>: Esto funciona s&oacute;lo si tu servidor POP est&eacute;
ejecutando un servidor compatible que permita cambio de password.
<P>Cuando elijas una nueva clave, no uses palabras reales, nombres, fechas,
acr&oacute;nimos familiares, etc. Algunos sistemas requieren al menos un
n&uacute;mero o s&iacute;mbolo en tu clave de acceso, y quiz&aacute; quieras
hacerlo incluso aunque no sea preciso.
<BR>&nbsp;
<P>RECIBIENDO NUEVO CORREO.
<P>Cuando Eudora chequea tu cuenta en busca de correo nuevo, puedes ser
avisado de una o varias maneras: un cuadro de alerta, la apertura de los
buzones implicados, y/o un sonido que hayas asociado a nuevo correo. Estas
opciones pueden activarse o desactivarse en <B>"Tools" -> "Options" ->
"Getting Attention Options"</B>.
<P>Normalmente el correo nuevo se deja en el buz&oacute;n <B>"In"</B>,
a no ser que est&eacute;s usando filtros para transferir mensajes. Si el
buz&oacute;n <B>"In"</B> no est&aacute; abierto todav&iacute;a, selecciona
<B>"In"</B>
desde el menu <B>"Mailbox"</B>. Los mensajes se listan en el orden que
se han recibido, de arriba a abajo. Los mensajes no le&iacute;dos est&aacute;n
marcados con un punto gordo en la columna <B>"Status"</B>, a la izquierda.
<P>Cualquier mensaje lo puedes abrir para leer con un doble-click del rat&oacute;n.
Los mensajes recibidos se guardan indefinidamente en el buz&oacute;n <B>"In"</B>
o en los que est&eacute;n despu&eacute;s de ser filtrados hasta que los
borres o los transfieras a otro buz&oacute;n.
<BR>&nbsp;
<P>LA VENTANA DE MENSAJES RECIBIDOS
<P>Para abrir un mensaje recibido, haz un doble-click con el rat&oacute;n
desde la ventana del buz&oacute;n, en la lista. La ventana de mensajes
recibidos consiste en la barra de t&iacute;tulo, la barra de herramientas
y el cuerpo del mensaje.
<BR>&nbsp;
<P>LA BARRA DEL TITULO
<P>Proporciona informaci&oacute;n sobre el mensaje, incluyendo el nombre
de quien lo envi&oacute;, la hora y fecha, y el tema del mensaje.
<BR>&nbsp;
<P>LA BARRA DE HERRAMIENTAS.
<BR>&nbsp;
<UL>
<LI>
El peque&ntilde;o cami&oacute;n-gr&uacute;a del extremo izquierdo se usa
para arrastrar cualquier mensaje en un buz&oacute;n diferente. Simplemente
ve a &eacute;l, d&eacute;jalo pulsado y ve a un buz&oacute;n abierto o
a la ventada de los buzones.</LI>

<LI>
El bot&oacute;n <B>"BLAH, BLAH, BLAH"</B> te muestra todas las cabeceras
del mensaje, en cualquier formato en que est&eacute;n.</LI>

<LI>
El bot&oacute;n con un lapicero, te permite editar el mensaje.</LI>

<LI>
Si un mensaje lo has recibido s&oacute;lo en parte por la raz&oacute;n
que sea, aparecer&aacute; un bot&oacute;n con una flecha hacia abajo, el
cual permite recibirlo por completo. Por lo general, este bot&oacute;n
no aparece.</LI>
</UL>
El men&uacute; desplegable que hay a continuaci&oacute;n, es para seleccionar
la prioridad del mensaje. De esto ya hemos hablado en el <A HREF="#5.2.1.4.- Enviando mensajes">5.2.1.4.-
Enviando mensajes</A> , puesto que el men&uacute; desplegable es exactamente
el mismo que entonces.
<BR>&nbsp;
<P>CUERPO DEL MENSAJE.
<P>El cuerpo del mensaje contiene la cabecera del mensaje y la informaci&oacute;n
de texto, as&iacute; como tambi&eacute;n los nombres de cada fichero "encadenado"
o "attacheado" al mensaje. Estos ficheros pueden abrirse desde el interior
de la ventana del mensaje haciendo doble click encima de ellos.
<BR>&nbsp;
<P>RECIBIENDO FICHEROS "ATTACHEADOS".
<P>A menos que hayas especificado un directorio en particular, ser&aacute;n&nbsp;
autom&aacute;ticamente decodificados y guardados en el directorio ATTACH
que cuelga del directorio del Eudora. Si recibes m&uacute;ltiples ficheros
con el mismo nombre, se a&ntilde;ade un n&uacute;mero al final de cada
nombre duplicado, en el orden en que se reciban.
<P>Si recibes un mensaje grande consistente en un texto absolutamente indescifrable,
probablemente es un fichero encadenado que no ha sido autom&aacute;ticamente
decodificado. Para decodificar un fichero que no haya podido hacerlo el
Eudora, abrir el mensaje y seleccionar <B>"Save As"</B> del men&uacute;
<B>"File"</B>
para guardar el mensaje como un fichero de texto. Entonces ejecutar una
utilidad apropiada de decodificaci&oacute;n para el m&eacute;todo empleado
por el remitente del mensaje. Las utilidades de decodificaci&oacute;n pueden
encontrarse en muchos sitios en Internet.
<BR>&nbsp;
<P>ESPECIFICANDO UN DIRECTORIO DE FICHEROS "ATTACHEADOS".
<P>Si no deseas utilizar el directorio por defecto <B>"ATTACH"</B>, selecciona
<B>"Tools"
-> "Options..." -> "Attachments"</B>. Entonces pulsa en un bot&oacute;n
alargado que hay hacia el medio. Selecciona la unidad y directorio a usar,
y pulsa en el bot&oacute;n <B>"Use Directory"</B>. El nombre del directorio
aparecer&aacute; encima del bot&oacute;n alargado.
<BR>&nbsp;
<P>EDITANDO MENSAJES RECIBIDOS.
<P>Puedes editar el cuerpo de un mensaje recibido si activas el bot&oacute;n
con un lapicero dentro, en la barra de herramientas. Entonces podr&aacute;s
editar el cuerpo del mensaje. Cuando est&eacute; hecho, guarda los cambios
y cierra el mensaje.
<P>Para cambiar el campo <B>"Subject"</B>, simplemente &aacute;brelo y
ed&iacute;talo. Cuando terminas, pulsa cualquier otra parte, o ci&eacute;rralo.
El nuevo subject se mostrar&aacute; en la lista de mensajes del buz&oacute;n.
De todas formas el contenido del campo "Subject" en la cabecera del mensaje
seguir&aacute; sin cambiarse.
<P>Si respondes al mensaje, el subject original es el que se usa para ponerlo
autom&aacute;ticamente en el nuevo mensaje. Esto te da liberad de poner
informaci&oacute;n &uacute;til para t&iacute; dentro de la lista de mensajes
en el buz&oacute;n, sin temor de que tus notas privadas sean vistas por
la gente a quien escribes.
<P>Esta opci&oacute;n de cambiar el <B>"subject"</B> es especialmente &uacute;til
en aquellos mensajes que, por una raz&oacute;n u otra, el "subject" no
se corresponde con el tema del cuerpo del mensaje. <B>Defecto que por desgracia
es muy frecuente</B>.
<BR>&nbsp;
<P>USANDO URLs ACTIVAS
<P>Cualquier cadena de caracteres que eudora reconozca como una URL (http,
ftp, gopher, ph, finger, etc.) est&aacute; activo. Haz doble-click encima
de la URL para abrir una p&aacute;gina WWW, transferir un fichero, iniciar
una b&uacute;squeda gopher, usar la herramienta finger, etc. En la versi&oacute;n
32b, las URL est&aacute;n marcadas con otro color y subrayadas para mostrar
que est&aacute;n activas.
<P>Para configurar Eudora para abrir autom&aacute;ticamente el navegador
Netscape cuando uses un enlace <B>"mailto"</B>, activa la opci&oacute;n
<B>"Intercept
Netscape mailto URLs"</B> en <B>"Tools" -> "Options" -> "Miscellaneous"</B>.
<BR>&nbsp;
<P>ADMINISTRANDO TU CORREO EN EL SERVIDOR POP DE TU PROVEEDOR
<P>Durante el chequeo de correo, tus mensajes se transfieren normalmente
desde tu cuenta en el servidor POP a tu PC, y entonces se borran del servidor
POP. Pero esto puede configurarse si deseas poder leer el correo desde
dos o m&aacute;s ordenadores, y mantener tu correo organizado al mismo
tiempo. Para ayudarte con esto, hay varios opciones que puedes usar para
controlar tus transferencias de correo y el almacenamiento en el servidor.
<BR>&nbsp;
<P>SALT&Aacute;NDOSE MENSAJES SUPERIORES A CIERTO TAMA&Ntilde;O
<P>Para parar Eudora en las transferencias de mensajes entrantes que son
demasiado grandes, activa la opci&oacute;n <B>"Skip messages over ? K in
size"</B> en <B>"Tools" -> "Options" -> "Checking Mail"</B>, y especifica
un tama&ntilde;o concreto en Kb. S&oacute;lo se transferir&aacute;n unas
pocas lineas, las primeras, de los mensajes que exceden de ese tama&ntilde;o,
con una nota al final indicando que no ha sido transferido el mensaje entero.
<BR>&nbsp;
<P>DEJANDO EL CORREO EN EL SERVIDOR
<P>Para transferir todos tus mensajes nuevos desde el servidor POP al ordenador
donde est&aacute;s, y tambi&eacute;n dejar copias de estos mensajes en
el servidor, activar la opci&oacute;n <B>"Leave mail on server"</B> en
<B>"Tools"
-> "Options" -> "Checking Mail"</B>. Puedes usar tambi&eacute;n la opci&oacute;n
"<B>Delete from server after ? days"</B> para configurar el n&uacute;mero
m&aacute;ximo de dias que permanecer&aacute;n las copias.
<P>En el siguiente chequeo que hagas desde ese ordenador, Eudora ignora
las copias de los mensajes previamente bajados y mira por los nuevos. Pero
si chequeas desde otro ordenador, estos mensajes son tratados como nuevos
y transferidos a ese ordenador.
<P>Esto es &uacute;til, por ejemplo, para revisar el correo pendiente desde
un cybercaf&eacute; pero dejando los mensajes para despu&eacute;s subirlos
desde casa.
<P>Esta opci&oacute;n deber&iacute;a usarse con cuidado, pues puede producir
una saturaci&oacute;n de tu buz&oacute;n en el servidor POP.
<BR>&nbsp;
<P>BAJARSE UN MENSAJE INCOMPLETO DESDE EL SERVIDOR.
<P>Si un mensaje era demasiado grande para la opci&oacute;n activada con
l&iacute;mite de tama&ntilde;o, pero despu&eacute;s de ver las primeras
l&iacute;neas, decides que quieras transferir el mensaje entero, entonces
pulsar el bot&oacute;n <B>"Fetch"</B> (que figura con una flecha apuntando
hacia abajo) en la ventana del mensaje, y chequea el correo otra vez.
<BR>&nbsp;
<BR>&nbsp;
<H3>
<A NAME="5.2.1.6.- Respondiendo mensajes"></A><B><FONT SIZE=+0>5.2.1.6.-
Respondiendo mensajes</FONT></B></H3>
RESPONDIENDO A UN MENSAJE
<P>Para responder el mensaje, selecciona <B>"Reply"</B> desde el men&uacute;
<B>"Message"</B>.
Se abrir&aacute; una nueva ventana, con la direcci&oacute;n del remitente
original autom&aacute;ticamente puesto en <B>"To:"</B>. Todo el texto del
mensaje original se copia en el cuerpo del mensaje. Este texto puede editarse
como sea preciso.
<P>Puede a&ntilde;adirse texto adicional a la respuesta simplemente como
cualquier mensaje saliente, y la r&eacute;plica puede enviarse o salvarse
para futuros cambios.
<P>Si el texto original no incluye informaci&oacute;n de estilo, cada linea
se prefija con el s&iacute;mbolo <B>">"</B>.
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

<B>></B>Este es un mensaje de prueba. &iquest;Puedes
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

<B>></B>contestarlo, por favor? As&iacute; puesto estar
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

<B>></B>seguro de que lo has recibido.
<P>Si el texto original ha incluido informaci&oacute;n de estilo (por ejemplo,
negrita), se cuotea con los s&iacute;mbolos <B>"&lt;" ">"</B> y una barra
izquierda.
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

<B>>>>></B>
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>&nbsp;
| </B>Este texto incluye informaci&oacute;n de estilo,
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<B>&nbsp;
|</B> tal como negrita, y texto grande.
<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

<B>&lt;&lt;&lt;&lt;</B>
<P>Los mensajes que han sido respondido se identifican con una <B>"R"</B>
en la columna Status de la lista de mensajes.
<BR>&nbsp;
<P>USANDO LAS OPCIONES DE RESPUESTA
<P>Hay varias opciones que puedes usar cuando respondas a mensajes.
<BR>&nbsp;
<UL>
<LI>
Para incluir a todos los que han recibido el mensaje original, selecciona
<B>"Reply
to All"</B> desde el menu <B>"Message"</B>.</LI>

<LI>
Para incluirte a t&iacute; mismo como un destinatario, activa la opci&oacute;n
<B>"Include
yourself"</B> en <B>"Tools" -> "Options" -> "Replying Options".</B> Esto
s&oacute;lo funciona si est&aacute;s usando <B>"Reply to All"</B>.</LI>
</UL>
<B>Nota</B>. Para determinar qui&eacute;n eres, Eudora usa el nick <B>"me"</B>.
Si no hay "me", Eudora usa los contenidos de <B>"POP account"</B>&nbsp;
y <B>"Return address"</B> de <B>"Tools" -> "Options" -> "Personal Info"</B>.
El nick "me" es particularmente &uacute;til si tienes m&uacute;ltiples
direcciones y no quieres que haya respuestas a todas esas direcciones.
<UL>
<LI>
Para poner las direcciones de otros destinatarios del mensaje original
en el campo <B>"Cc:"</B> (en vez del campo "To:"), activa la opci&oacute;n
<B>"Put
original To recipients in Cc field, not To field"</B> en <B>"Tools" ->
"Options" -> "Replying Options"</B>. S&oacute;lo la direcci&oacute;n del
remitente anterior se pondr&aacute; en el campo <B>"To:"</B>. Esto s&oacute;lo
funciona si est&aacute;s usando <B>"Reply to All"</B>.</LI>

<LI>
Para copiar la prioridad del mensaje original en tus respuestas, activa
la opci&oacute;n <B>"Copy original's priority to reply"</B> en <B>"Tools"
-> "Options" -> "Replying Options"</B>.</LI>

<LI>
Para configurar Ctrl-R como <B>"Reply to All"</B> en vez de <B>"Reply"</B>,
activa esta opci&oacute;n en <B>"Tools" -> "Options" -> "Replying Options"</B>.</LI>
</UL>
REENVIANDO (FORWARD) UN MENSAJE
<P>Cualquier mensaje puede reenviarse a alguien m&aacute;s. Para reenviar
un mensaje selecciona <B>"Forward"</B> del men&uacute; <B>"Message"</B>.
Se abrir&aacute; una nueva ventana con tu direcci&oacute;n en el campo
<B>"From"</B>,
y el texto original copiado en el cuerpo del mensaje. Para m&aacute;s detalles
de c&oacute;mo se copia un texto, ver la secci&oacute;n
<A HREF="#5.2.1.6.- Respondiendo mensajes">"Respondiendo
a un mensaje"</A>. Haz cualquier cambio que quieras, e introduce las direcciones
de los destinatarios en el campo <B>"To:"</B>. El mensaje puede enviarse
o guardarse para futuros cambios.
<P>Los mensajes que han sido reenviados se identifican con una <B>"F"</B>
en la columna <B>"Status"</B> de la lista de mensajes.
<BR>&nbsp;
<P>REDIRIGIENDO UN MENSAJE
<P>Los mensajes entrantes pueden enviarse a un nuevo destinatario <B>"a
trav&eacute;s de"</B> t&iacute;, manteniendo la direcci&oacute;n del remitente
original en el campo <B>"From"</B>. Esto se llama redirigir.
<P>Para redirigir un mensaje, selecciona <B>"Redirect"</B> del men&uacute;
<B>"Message"</B>.
Una nueva ventana se abrir&aacute; con la direcci&oacute;n del remitente
original en el campo <B>"From"</B> con el a&ntilde;adido
<B>"by way of
(tu direcci&oacute;n)"</B>, el texto del remitente original en el cuerpo
del mensaje y los <B>"attacheos"</B> originales en el campo
<B>"Attachments"</B>.
Haz cualquier cambio que quieras, e introduce la direcci&oacute;n del destinatario
en el campo <B>"To:"</B>. El mensaje puede enviarse o guardarse para futuros
cambios.
<P><B>Nota</B>: Puedes encerrar cualquier cambio que hagas con los s&iacute;mbolos
<B>"["
y "]"</B> para no confundir al destinatario sobre qui&eacute;n ha escrito
qu&eacute;.
<P>Los mensajes que han sido redirigidos se identifican con una <B>"D"</B>
en la columna Status de la lista de mensajes.
<BR>&nbsp;
<P>TURBO REDIRECCION
<P>Puedes redirigir un mensaje a alguien de tu lista de destinatarios,
poner en estado de espera el nuevo mensaje (sin mostrarlo), y borrar el
mensaje original, todo ello con un solo comando. Para hacer esto, activa
la opci&oacute;n <B>"Turbo redirect by default"</B> en <B>"Tools" -> "Options"
-> "Miscellaneous"</B>.
<P>Cuando uses redirecci&oacute;n de mensajes, no se a&ntilde;ade tu firma
al mensaje cuando se env&iacute;a, a menos que hayas escrito originalmente
el mensaje.
<BR>&nbsp;
<P>ENVIAR MENSAJES RECHAZADOS OTRA VEZ
<P>Si por alguna raz&oacute;n un mensaje no puede ser enviado a un destinatario,
los servidores devuelven el mensaje al remitente original (t&uacute;).
Un mensaje se rechaza habitualmente porque hay un error en la direcci&oacute;n
del destinatario, aunque tambi&eacute;n puede tener otros motivos.
<P>El mensaje de retorno normalmente incluye informaci&oacute;n cr&iacute;ptica
que puede ayudarte a determinar la raz&oacute;n por la que el mensaje fue
rechazado. Esto tambi&eacute;n incluye el texto del mensaje original.
<P>Puedes f&aacute;cilmente recuperar el mensaje original, hacer cualquier
correcci&oacute;n y reenviarlo. Para hacer esto, selecciona <B>"Send Again"</B>
desde el menu <B>"Message"</B>. Esto elimina el texto extra insertado y
reformatea el mensaje tal como aparec&iacute;a originalmente. Entonces
puedes hacer cambios o adicciones y enviar el mensaje de nuevo.
<BR>&nbsp;
<H3>
<A NAME="5.2.1.7.- Trabajando con los buzones de correo"></A><B><FONT SIZE=+0>5.2.1.7.-
Trabajando con los buzones de correo</FONT></B></H3>
ABRIENDO UN BUZON
<P>Para abrir un buz&oacute;n, selecci&oacute;nalo desde el men&uacute;
<B>"Mailbox"</B>,
o haz doble click en &eacute;l en la ventana principal.
<P><B>Nota</B>: El icono del sobre se muestra en el men&uacute; <B>"Mailbox"</B>
cuando un buz&oacute;n o una carpeta contiene mensajes no le&iacute;dos
que tienen menos de cinco d&iacute;as, y cualquier buz&oacute;n o carpeta
en la ventana principal, que contiene mensajes no le&iacute;dos, se muestran
en negrita.
<BR>&nbsp;
<P>LA ANATOMIA DE UN BUZON
<P>Las ventanas de buzones contienen todas tus listas de mensajes enviados
y recibidos. Para abrir un buz&oacute;n, selecci&oacute;nalo desde el men&uacute;
<B>"Mailbox"</B>
o haz doble click en la ventana principal.
<BR>&nbsp;
<P>SUMARIOS DE MENSAJES (LISTA DE MENSAJES)
<P>Cada linea en una ventana de buz&oacute;n representa un mensaje y se
llama un sumario de mensaje. Los mensajes enviandos que hay en cualquier
buz&oacute;n distinto a <B>"Out"</B> se muestran con sumarios en cursiva.
Para seleccionar uno o m&aacute;s sumarios de mensajes, usa una de las
opciones siguientes:
<BR>&nbsp;
<UL>
<LI>
Para seleccionar un sumario, pulsa en &eacute;l.</LI>

<LI>
Para seleccionar dos sumarios y todos los que haya entre ellos, selecciona
uno, mant&eacute;n la tecla Shift pulsada, y selecciona otro.</LI>

<LI>
Para seleccionar todos los sumarios que tienen la misma informaci&oacute;n
en una columna particular, mant&eacute;n pulsada la tecla Alt en una columna
en el sumario. Por ejemplo, si pulsas en la columna Status para un sumario,
todos los sumarios con ese estado se seleccionan.</LI>

<LI>
Para seleccionar sumarios arrastrando el rat&oacute;n sobre ellos, primero
activa la opci&oacute;n <B>"Allow drag and drop transfers"</B> en <B>"Tools"
-> "Options" ->&nbsp;&nbsp;&nbsp;&nbsp; "Miscellaneous".</B></LI>
</UL>
Cada sumario de mensaje se divide en columnas: <B>Status, Priority, Attachments,
Sender/Recipient, Date, Size, y Subject</B> (respectivamente: estado, prioridad,
ficheros encadenados, remitente/destinatario, fecha, tama&ntilde;o y tema).
Puedes mostrar u ocultar estas columnas&nbsp; en <B>"Tools" -> "Options"
-> "Mailbox Columns".</B>
<P>El estado y prioridad de un mensaje puede cambiarse directamente en
la ventana del buz&oacute;n. Para hacer esto, selecciona los mensajes que
quieres cambiar y pulsa el bot&oacute;n derecho del rat&oacute;n. Selecciona
una opci&oacute;n desde el men&uacute; desplegable para hacer tu cambio.
<BR>&nbsp;
<P>LA COLUMNA STATUS
<P>Esta columna muestra el estado del mensaje, que es alguno de los siguientes:
<BR>&nbsp;
<UL>
<LI>
<B>[punto]</B> El mensaje no ha sido le&iacute;do (en todos los buzones
excepto Out), o es posible ponerlo en estado de espera pero no lo est&aacute;
a&uacute;n (s&oacute;lo buz&oacute;n Out)</LI>

<LI>
<B>[nada]</B>&nbsp; El mensaje ha sido le&iacute;do (todos los buzones
excepto Out), o todav&iacute;a no puede ser puesto en estado de espera
si no tiene destinatarios (buz&oacute;n Out s&oacute;lo).</LI>

<LI>
<B>[R]</B>&nbsp;&nbsp; Este mensaje ha sido respondido.</LI>

<LI>
<B>[F]</B>&nbsp;&nbsp;&nbsp; Este mensaje ha sido reenviado.</LI>

<LI>
<B>[D]</B>&nbsp;&nbsp; Este mensaje ha sido redirigido.</LI>

<LI>
<B>[S]</B>&nbsp;&nbsp;&nbsp; Este mensaje ha sido enviado (s&oacute;lo
mensajes salientes)</LI>

<LI>
<B>[Q]</B>&nbsp;&nbsp; Este mensaje est&aacute; en espera de ser enviado
(s&oacute;lo mensajes salientes)</LI>

<LI>
<B>[T]</B>&nbsp;&nbsp;&nbsp; Este mensaje est&aacute; en espera de ser
enviado en el momento especificado (s&oacute;lo&nbsp;&nbsp; mensajes salientes)</LI>

<LI>
<B>[-]&nbsp;&nbsp;&nbsp;&nbsp; </B>El mensaje fue transferido desde el
buz&oacute;n Out antes de ser enviado.</LI>
</UL>
LA COLUMNA PRIORITY
<P>Esta columna muestra la prioridad del mensaje. Puedes usar el menu desplegable
para configurar una prioridad particular, o subir o bajar la prioridad.
<BR>&nbsp;
<UL>
<LI>
<B>Highest p.&nbsp;</B>&nbsp;&nbsp;&nbsp; muy urgente (s&iacute;mbolo doble
rojo apuntando hacia arriba)</LI>

<LI>
<B>High p.&nbsp;</B>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; urgente
(s&iacute;mbolo rojo apuntando hacia arriba)</LI>

<LI>
<B>[nada]</B>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Normal
(ning&uacute;n s&iacute;mbolo)</LI>

<LI>
<B>Low p.</B>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Bajo (s&iacute;mbolo
negro apuntando hacia abajo)</LI>

<LI>
<B>Lowest p.</B>&nbsp;&nbsp;&nbsp;&nbsp; Muy bajo (simbolo doble negro
apuntando hacia abajo).</LI>
</UL>
Para m&aacute;s informaci&oacute;n en la prioridad de los mensajes, ver
el apartado <A HREF="#CAMBIANDO LA PRIORIDAD DEL MENSAJE">"Cambiando la
prioridad del mensaje"</A>.
<BR>&nbsp;
<P>LA COLUMNA ATTACHMENTS
<P>Esta columna muestra un icono (papel con esquina doblada) si un mensaje
tiene ficheros encadenados a &eacute;l.
<BR>&nbsp;
<P>LA COLUMNA SENDER/RECIPIENT
<P>Esta columna muestra el remitente del mensaje (para mensajes entrantes)
o los destinatarios (para mensajes salientes).
<P>Nota: Algunos servidores POP y sistemas de transporte de correo tienen
un bug que hace que Eudora muestra el remitente de mensajes entrantes como
<B>"???@???"</B>.
Esto es debido a que el campo requerido <B>"From:" </B>de la cabecera,
desapareci&oacute;.
<BR>&nbsp;
<P>LA COLUMNA DATE
<P>Esta columna muestra la fecha y hora en que el mensaje ha sido hecho,
o, para mensajes con fecha programada, se mostrar&aacute; el d&iacute;a
y hora en que el mensaje se enviar&aacute;.
<BR>&nbsp;
<P>LA COLUMNA SIZE
<P>Esta columna muestra el tama&ntilde;o del mensaje en K (kilobytes).
<BR>&nbsp;
<P>LA COLUMNA SUBJECT
<P>Esta columna muestra la tem&aacute;tica del mensaje. El remitente originalmente
escribi&oacute; esta informaci&oacute;n en la cabecera del mensaje, pero
puedes modificarlo (ver la secci&oacute;n "Editando mensajes recibidos").
<BR>&nbsp;
<P>MOSTRANDO Y CAMBIANDO EL ANCHO DE LAS COLUMNAS
<P>Para especificar qu&eacute; columnas quieres que se muestren en tus
buzones, selecciona <B>"Tools" -> "Options" -> "mailbox Columns"</B> y
aseg&uacute;rate de que las columnas que quieres ver est&aacute;n activadas.
<P>Para cambiar el tama&ntilde;o de una columna en una ventana de buz&oacute;n,
mueve el puntero del rat&oacute;n hasta estar sobre la cabecera de la columna,
en la separaci&oacute;n que quieres mover. Arr&aacute;stralo hasta la posici&oacute;n
que deseas. El divisor de columnas se mover&aacute; hasta la nueva posici&oacute;n,
y el buz&oacute;n se redibujar&aacute;. Puedes minimizar en lo posible
una columna. Al hacer eso, se ver&aacute; una doble separaci&oacute;n de
columna, en lugar de la columna misma, y no se visualizar&aacute; el contenido
de ella. En el futuro puedes cambiar de nuevo su tama&ntilde;o.
<BR>&nbsp;
<P>USANDO EL BOTON DEL TAMA&Ntilde;O DEL BUZ&Oacute;N
<P>En la esquina inferior izquierda de cada ventana de buz&oacute;n, hay
tres n&uacute;meros que muestran la informaci&oacute;n del tama&ntilde;o
para ese buz&oacute;n. El primero es el n&uacute;mero de mensajes que hay
en el buz&oacute;n, el segundo es la cantidad total de espacio que requieren
estos mensajes, el tercero es la cantidad de espacio de disco que se ha
desechado en este buz&oacute;n.
<P>El espacio desechado se crea cuando los mensajes se borran de un buz&oacute;n.
Este espacio desechado se remueve autom&aacute;ticamente cuando su tama&ntilde;o
es m&aacute;s
<BR>grande que el tama&ntilde;o del espacio que usan los mensajes del buz&oacute;n,
o si la cantidad de espacio desechado es superior al 5% del espacio libre
disponible en el disco que lo contiene.
<P>Para limpiar manualmente el espacio desechado en un buz&oacute;n, pulsa
en el bot&oacute;n del tama&ntilde;o del buz&oacute;n. O, para limpiar
manualmente todos los buzones, selecciona <B>"Compact mailboxes"</B> desde
el menu <B>"Special"</B>.
<BR>&nbsp;
<P>CREANDO BUZONES Y CARPETAS
<P>Eudora te permite crear buzones para poner los mensajes en ellos, y
carpetas para poner los buzones (u otras carpetas) en ellos.
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Hay tres maneras de crear
buzones y carpetas:
<BR>&nbsp;
<UL>
<LI>
Usando la opci&oacute;n <B>"New"</B> desde el men&uacute; <B>"Mailbox"</B>
y los submen&uacute;s de las carpetas.</LI>

<LI>
Usando la ventana <B>"Mailboxes"</B> (ver la secci&oacute;n correspondiente).</LI>

<LI>
Usando la opci&oacute;n <B>"New"</B> desde el men&uacute; <B>"Transfer"</B>.</LI>
</UL>
CREANDO UN BUZON O CARPETA USANDO EL MENU MAILBOX
<P>Para crear un nuevo buz&oacute;n o carpeta de correo, selecciona <B>"New..."</B>
desde el men&uacute; <B>"Mailbox"</B>, o desde el submen&uacute; de una
carpeta de correo (para poner
<BR>el buz&oacute;n en esa carpeta). Se mostrar&aacute; una ventana de
di&aacute;logo.
<P>Para crear un buz&oacute;n, escribe el nombre del nuevo buz&oacute;n
(por ejemplo, <B>"GRUMETES"</B>) y pulsa <B>OK</B>. Se crear&aacute; el
buz&oacute;n y se a&ntilde;adir&aacute; a los menus <B>"Mailbox"</B> y
<B>"Transfer"</B>.
<P>Para crear una carpeta de correo, teclea el nombre de la nueva carpeta
de correo y activa la opci&oacute;n <B>"Make it a Folder"</B>. Pulsa OK
para crear la carpeta. Se mostrar&aacute; de nuevo la ventana de di&aacute;logo.
Teclea el nombre de un buz&oacute;n a crear dentro de la nueva carpeta,
entonces pulsa OK. La nueva carpeta y su buz&oacute;n se mostrar&aacute;n
en los menus <B>"Mailbox"</B> y <B>"Transfer"</B>.
<BR>&nbsp;
<P>USANDO LA VENTANA "MAILBOXES" (VERSION 16 BIT)
<P>La ventana <B>"Mailboxes"</B> te permite crear nuevos buzones y carpetas,
eliminar y renombralos, y mover buzones entre carpetas. Para realizar alguna
de estas tareas, seleccionar <B>"Mailboxes"</B> desde el men&uacute; <B>"Tools"</B>.
Se mostrar&aacute; la ventana <B>"Mailboxes"</B>.
<P>La ventana tiene dos listas id&eacute;nticas de buzones y carpetas,
cada una llamada <B>"Top Level"</B>. Estas listas muestran los nombres
de los buzones y carpetas que hayas creado (las carpetas se identifican
por un icono a la izquierda del nombre). Cada lista es similar a lo mostrado
bajo los menus <B>"Mailbox"</B> y <B>"Transfer"</B>, excepto que <B>"In"</B>,
<B>"Out"</B>
y <B>"Trash"</B> no est&aacute;n incluidos.
<P>Si la ventana <B>"Mailboxes"</B> no es suficientemente grande para mostrar
todos tus buzones y carpetas creadas, usa la barra de scroll en el lado
derecho de cada lista para ver el resto de los buzones y carpetas.
<P><B>Nota</B>: Un doble-click en cualquier de los buzones en una lista,
abrir&aacute; ese buz&oacute;n. Los mensajes pueden seleccionar, abrirse,
y manipularlos de cualquier modo desde all&iacute;.
<P>Para abrir una carpeta y mostrar su contenido en la lista, haz un doble-click
en la carpeta. Para cambiar la carpeta que est&aacute; siendo mostrada
en la lista, selecciona otra carpeta desde el t&iacute;tulo desplegable.
<BR>&nbsp;
<P>CREANDO UN NUEVO BUZ&Oacute;N O CARPETA
<P>Para crear un nuevo buz&oacute;n o carpeta en la ventana <B>"Mailboxes"</B>,
aseg&uacute;rate de que una de las listas est&aacute; mostrando la carpeta
en donde quieres poner el nuevo buz&oacute;n o carpeta. Entonces pulsa
en el bot&oacute;n <B>"New"</B> debajo de la lista. Una ventana se mostrar&aacute;
solicitando el nombre del nuevo buz&oacute;n o carpeta.
<P>Teclea el nuevo nombre, activa la opci&oacute;n <B>"Make it a Folder"</B>
si es lo que quieres, y pulsa OK. El nuevo buz&oacute;n o carpeta se mostrar&aacute;
en las listas, y a&ntilde;adido a los menos <B>"Mailbox"</B> y <B>"Transfer"</B>.
<BR>&nbsp;
<P>RENOMBRANDO UN BUZ&Oacute;N O CARPETA
<P>Para renombrar un buz&oacute;n o una carpeta, selecciona el que quieres
renombrar (de cualquier lista) entonces pulsa el bot&oacute;n <B>"Rename"</B>
situado debajo de esa lista. Una ventana se abrir&aacute; solicitando el
nuevo nombre. Teclea el nuevo nombre y pulsa <B>"Rename"</B> para renombrar
el buz&oacute;n o la carpeta.
<BR>&nbsp;
<P>MOVIENDO UN BUZ&Oacute;N DE UNA CARPETA A OTRA
<P>Para mover un buz&oacute;n de una carpeta a otra, seleccionar el que
quieres mover (de cualquier lista). En la otra lista, abre la carpeta destino
de manera que si nombre se mostrar&aacute; en la parte de arriba de la
lista. Pulsa en el bot&oacute;n apropiado <B>"Move"</B> para mover el buz&oacute;n
a la otra carpeta.
<BR>&nbsp;
<P>ELIMINAR UN BUZON O UNA CARPETA
<P>Para eliminar un buz&oacute;n o una carpeta, selecci&oacute;nalo de
una de las listas y entonces pulsa el bot&oacute;n <B>"Remove"</B> situado
bajo esa lista. Una ventana se abrir&aacute; pidi&eacute;ndote confirmaci&oacute;n
de la eliminaci&oacute;n. Pulsa en el bot&oacute;n "Remove It" para eliminar
el buz&oacute;n. Si seleccionar m&aacute;s de un buz&oacute;n o carpeta,
puedes pulsar el bot&oacute;n <B>"Remove All"</B> para eliminar todos ellos.
<P>Si eliges eliminar un buz&oacute;n con mensajes a&uacute;n almacenados,
o una carpeta con otros buzones o carpetas almacenadas, todos los mensajes,
buzones y carpetas contenidas tambi&eacute;n se eliminar&aacute;n.
<BR>&nbsp;
<P>USANDO LA VENTANA "MAILBOXES" (VERSION 32 BIT)
<P>La ventana <B>"Mailboxes"</B> te permite crear nuevos buzones y carpetas,
eliminarlos y renombrarlos, y mover buzones entre las carpetas. Los buzones
o carpetas que est&aacute;n en negrita tienen mensajes sin leer.
<P>La ventana <B>"Mailboxes"</B> se cuelga autom&aacute;ticamente en el
lado izquirdo de la ventana del Eudora, pero puede tambi&eacute;n colsarse
en el lado derecho de la ventana, o colocado en cualquier sitio de tu escritorio.
Puedes usar el bot&oacute;n derecho del rat&oacute;n para elegir <B>"Docking
view"</B> (flotante o fijo a la ventana de la aplicaci&oacute;n) o activar/desactivar
<B>"Hide"</B>
(Oculto).
<P>Para abrir la ventana <B>"Mailboxes"</B> si la tienes escondida, selecciona
<B>"View
Mailboxes"</B> desde el menu <B>"Tools"</B>.
<P>Para mover la ventana <B>"Mailboxes"</B>, mant&eacute;n apretado el
bot&oacute;n izquierdo del rat&oacute;n en el borde gris de la ventana
y arr&aacute;strala a donde quieres ponerla. Si la arrastras a los lados
izquierdo o derecho de la ventana Eudora, se colgar&aacute; en posici&oacute;n
vertical dentro de esa ventana.
<P>Para abrir un buz&oacute;n o una carpeta, haz doble click sobre &eacute;l.
Puedes moverte entre los buzones y carpetas usando los botones arriba y
abajo, o cerrar o abrir carpetas usando los botones izquierdo y derecho.
Puedes tambi&eacute;n comenzar tecleando el nombre del buz&oacute;n o la
carpeta que quieres, y se remarcar&aacute; cuando hayas tecleado suficientes
caracteres para identificarlo.
<BR>&nbsp;
<P>CREANDO UN NUEVO BUZ&Oacute;N O CARPETA
<P>Para crear un nuevo buz&oacute;n o carpeta en la ventana <B>"Mailboxes"</B>,
pulsa en una carpeta y pulsa <B>"New"</B>. Se abrir&aacute; una ventana
solicitando el nombre del nuevo buz&oacute;n o carpeta.
<P>Teclea el nuevo nombre, activa <B>"Make it a Folder"</B> si lo deseas,
y pulsa OK. El nuevo buz&oacute;n o carpeta se mostrar&aacute; en las listas,
y a&ntilde;adido en los menus <B>"Mailbox" y Transfer"</B>.
<BR>&nbsp;
<P>RENOMBRANDO UN BUZON O CARPETA
<P>Para renombrar un buz&oacute;n o una carpeta, haz click en el, entonces
vuelve a hacer click para remarcar s&oacute;lo el nombre. Teclea el nuevo
nombre. Tambi&eacute;n puedes seleccionarlos y escoger <B>"Rename")</B>.
<BR>&nbsp;
<P>MOVIENDO UN BUZON DE UNA CARPETA A OTRA
<P>Para move un buz&oacute;n de una carpeta a otra, selecci&oacute;nalo
y arr&aacute;stralo desde donde est&aacute; a la nueva carpeta.
<BR>&nbsp;
<P>ELIMINANDO UN BUZON O UNA CARPETA
<P>Para eliminar un buz&oacute;n o una carpeta, selecci&oacute;nalo y entonces
selecciona <B>"Delete"</B> desde el bot&oacute;n derecho del rat&oacute;n
o usa la tecla <B>"Delete"</B>.
<P>Si eliges eliminar un buz&oacute;n en el que hay mensajes a&uacute;n
almacenados, o una carpeta en el que hay buzones o carpetas almacenadas,
todos los mensajes, buzones y carpetas contenidas en ellas se eliminar&aacute;n
tambi&eacute;n.
<P><A NAME="5.2.1.8.- Organizando tus mensajes"></A><B><FONT SIZE=+0>5.2.1.8.-
Organizando tus mensajes</FONT></B>
<P>BORRANDO UN MENSAJE.
<P>Como una salvaguarda contra los borrados involuntarios, se usan dos
pasos para borrar un mensaje desde tu PC: primero se deja el mensaje en
<B>"Trash"</B>
y despu&eacute;s se debe vaciar <B>"Trash"</B>.
<P>Para poner un mensaje en <B>"Trash"</B>, seleccionar <B>"Delete"</B>
desde el menu <B>"Message"</B>, o selecciona <B>"Trash"</B> desde el menu
<B>"Transfer"</B>.
<P>Para borrar definitivamente los mensajes en el buz&oacute;n <B>"Trash"
</B>(elimin&aacute;ndolos
permanentemente de tu ordenador), selecciona
<B>"Empty Trash"</B> desde
el menu <B>"Special"</B>.
<P>Puedes configurar Eudora para que te avise si intentas borrar mensajes
sin leer, en estado de espera, o sin enviar. Para hacer esto, ve a <B>"Tools"
-> "Options" -> "Extra warnings"</B> para activar las casillas correspondientes.
<P>Saliendo del Eudora vac&iacute;a autom&aacute;ticamente el contenido
del buz&oacute;n <B>"Trash"</B> cuando la opci&oacute;n <B>"Empty Trash
when exiting" </B>est&aacute; activada. Se encuentra en <B>"Tools" -> "Options"
-> "Miscellaneous"</B>. Finalmente si &uacute;nicamente deseas eliminar
unos pocos mensajes del buz&oacute;n <B>"Trash"</B>, selecci&oacute;nalos,
entonces selecciona <B>"Delete"</B> desde el men&uacute; <B>"Message"</B>
o presiona la tecla <B>"Delete"</B>. Borrando un mensaje desde <B>"Trash"</B>
lo eliminar&aacute; completamente.
<BR>&nbsp;
<P>BORRANDO FICHEROS ATTACHEADOS AUTOMATICAMENTE
<P>Cuando borras mensajes, puedes hacer que sus ficheros attacheados se
borren autom&aacute;ticamente. Para hacer esto, activa la opci&oacute;n
<B>"Delete
attachments when emptying Trash"</B> en <B>"Tools" -> "Options" -> "Attachments"</B>,
y aseg&uacute;rate que los ficheros attacheados est&eacute;n en el <B>"Attach
Directory"</B> o el que hayas especificado para ellos. Si tienes esta opci&oacute;n
activada, y quieres borrar un mensaje pero guardar su fichero, mueve el
fichero a otro directorio antes de borrar el mensaje.
<BR>&nbsp;
<P>TRANSFERIR MENSAJES
<P>Puedes transferir mensajes a cualquiera de tus buzones. Hay varias maneras
para hacer esto:
<BR>&nbsp;
<UL>
<LI>
Selecciona los mensajes que quieres transferir, y entonces selecciona un
buz&oacute;n desde el menu <B>"Transfer"</B>.</LI>

<LI>
Selecciona los mensajes que quieres transferir, entonces mant&eacute;n
el bot&oacute;n derecho pulsado y selecciona un buz&oacute;n desde el submen&uacute;
<B>"Transfer"</B></LI>

<LI>
Arrastra una lista mensajes a un buz&oacute;n abierto o a un buz&oacute;n
en la ventana de buzones. (Esto no funciona con la versi&oacute;n 16b,
s&oacute;lo con la de 32b).</LI>
</UL>
Para poner una copia de un mensaje en otro buz&oacute;n (en vez de transferir
el mensaje), mant&eacute;n pulsada la tecla <B>"Shift" </B>y usa una de
las opciones de arriba. Este es muy &uacute;til si quieres tener un mensaje
determinado en m&aacute;s de un buz&oacute;n.
<P>Si intentas transferir un mensaje al buz&oacute;n <B>"Out"</B>, se mostrar&aacute;
un mensaje de alerta inform&aacute;ndote que la informaci&oacute;n de algunas
cabeceras pueden eliminarse durante la transferencia. Pulsa <B>"Yes"</B>
para transferir el mensaje.
<P><B>Nota:</B> Puedes deshacer las transferencias usando el comando <B>"Undo"</B>
en el menu <B>"Edit"</B>.
<BR>&nbsp;
<P>USANDO EL MENU TRANSFER
<P>El menu <B>"Transfer"</B> es una de las maneras de transferir mensajes
entre tus buzones. Con un mensaje abierto, o mensajes marcados de la lista
inicial, selecciona un buz&oacute;n desde el menu <B>"Transfer"</B>. Los
mensajes se transfieren desde sus buzones previos al buz&oacute;n que hayas
elegido.
<BR>&nbsp;
<P>ARRASTRANDO MENSAJES
<P>Puedes arrastrar mensajes de un buz&oacute;n a otro seleccionando la
lista de mensajes y arranstrar la lista en cualquier buz&oacute;n abierto
o minimizado, o (si est&aacute;s usando la versi&oacute;n 32b) cualquier
buz&oacute;n en la ventana de los buzones. Cuando sueltes el bot&oacute;n
del rat&oacute;n, el mensaje se transferir&aacute;.
<P><B>Nota:</B> s&oacute;lo puedes arrastrar mensajes si la opci&oacute;n
<B>"Allow
drag and drop transfer"</B> est&aacute; activada, en <B>"Tools" -> "Options"
-> "Miscellaneous"</B>.
<BR>&nbsp;
<P>CREANDO UN BUZ&Oacute;N O UNA CARPETA DURANTE LA TRANSFERENCIA
<P>Para crear un buz&oacute;n y transferir el mensaje a &eacute;l al mismo
tiempo, selecciona "<B>New..."</B> desde el men&uacute; <B>"Transfer"</B>
en lugar del nombre de un buz&oacute;n. La ventana de di&aacute;logo de
buz&oacute;n nuevo se mostrar&aacute;.
<P>Puedes crear entonces un nuevo buz&oacute;n o una carpeta de correo
(para m&aacute;s detalles, ver la secci&oacute;n <B>"Crear Buzones y carpetas"</B>).
Cuando est&eacute; hecho, el mensaje se transferir&aacute; en el nuevo
buz&oacute;n.
<P>Para crear el nuevo buz&oacute;n sin transferir el mensaje en el, activa
la opci&oacute;n <B>"Don't transfer, just create mailbox"</B>.
<BR>&nbsp;
<P>FILTRANDO MENSAJES
<P>Algunas de las funciones de administraci&oacute;n de e-mails en el Eudora
pueden hacerse de manera autom&aacute;tica usando filtros. Para abrir la
ventana <B>"Filters"</B>, selecciona <B>"Filters"</B> desde el menu <B>"Tools"</B>.
La ventana se mostrar&aacute;, y cualquier filtro que hayas creado se listar&aacute;
a la izquierda.
<P>Para crear o modificar un filtro:
<BR>&nbsp;
<OL>
<LI>
Pulsa <B>"New" </B>o selecciona un filtro existente.</LI>

<LI>
Selecciona las opciones de c&oacute;mo quieres que se use el filtro: como
un filtro autom&aacute;tico que se llamar&aacute; con cualquier correo
entrante y/o saliente, y como un filtro manual que puede llamarse cuando
selecciones <B>"Filter Messages"</B> desde el menu <B>"Special"</B>. Cualquier
combinaci&oacute;n de estas opciones funciona.</LI>

<LI>
Define el criterio por el que se regir&aacute; el filtro: usa el men&uacute;
desplegable con los campos de la cabecera y los campos de texto para especifical
cu&aacute;l de los campos de la cabecera podr&iacute;a incluir un texto
concreto. Puedes definir dos t&eacute;rminos relativos para ese criterio
as&iacute; que eso hace que tu filtro sea tan espec&iacute;fico como sea
posible (ver la secci&oacute;n "Criterios del filtro").</LI>

<LI>
Define la acci&oacute;n que se tomar&aacute; con los mensajes que cumplen
el criterio (ver la secci&oacute;n <B>"Acciones del filtro"</B>) y guarda
los filtros.</LI>
</OL>
Nota: Los filtros se nombran autom&aacute;ticamente de acuerdo al criterio
para ese filtro. Puedes entonces reordenarlos usando los botones <B>"Up"</B>
y <B>"Down"</B> encima de la lista.
<P>Cuando se llaman a los filtros (autom&aacute;tica o manualmente), cada
mensaje se enfrenta a cada filtro por orden de arriba a abajo. Si el mensaje
re&uacute;ne el criterio de un filtro, se toman las acciones especificadas
hasta que no haya ninguna acci&oacute;n m&aacute;s, entonces el mensaje
es confrontado con el siguiente filtro. Si en alg&uacute;n punto se toma
una acci&oacute;n <B>"Skip rest"</B>, no se hace nada m&aacute;s con ese
mensaje, y se filtra el siguiente mensaje.
<P>Puedes cambiar la anchura de los filtros creando mas o menos espacio
para tu lista. Para hacer eso, pon la flecha sobre la barra a la derecha
de la lista y arrastra la linea a la izquierda o derecha.
<BR>&nbsp;
<P>CRITERIO DEL FILTRO
<P>Cada filtro puede usar uno o m&aacute;s t&eacute;rminos como su criterio,
conectando entonces apropiadamente con el men&uacute; desplegable de conjunci&oacute;n.
<P>Usar el campo <B>"Header"</B> para especificar qu&eacute; campo de la
cabecera del mensaje quieres que mire el filtro. Puedes seleccionar una
opci&oacute;n desde el menu desplegable o entrar uno t&uacute; mismo. Esto
es &uacute;til si quieres usar una cabecera de campo que no aparece en
el menu. Las selecciones existentes son las siguientes:
<BR>&nbsp;
<UL>
<LI>
<B>To</B></LI>

<LI>
<B>Cc</B></LI>

<LI>
<B>From</B></LI>

<LI>
<B>Subject</B></LI>

<LI>
<B>Reply-To</B></LI>

<LI>
<B>"Any Recipient"</B></LI>

<LI>
<B>"Any Header"</B></LI>

<LI>
<B>"Body"</B></LI>
</UL>
La opci&oacute;n <B>"Any Recipient"</B> busca en todos los posibles campos
de destinatario (To, Cc Bcc). La opci&oacute;n <B>"Any Header"</B> busca
en todas las cabeceras enteras (incluyendo los campos ocultos que se muestran
con la opci&oacute;n <B>"Blah blah blah"</B>), y la opci&oacute;n <B>"Body"</B>
busca en el cuerpo del mensaje.
<P>Usa <B>"Match Type Popup"</B> para controlar c&oacute;mo se relaciona
el campo de la cabecera con la cadena de texto en el campo de texto. Las
opciones son:
<BR>&nbsp;
<UL>
<LI>
<B>"contains"</B> o <B>"doesn't contain"&nbsp;</B> Si el campo especificado
contiene o no contiene el texto, filtrar el mensaje.</LI>

<LI>
<B>"is"</B> o <B>"is not"</B>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Si el campo especificado es o no es la cadena de texto, filtrar el mensaje.</LI>

<LI>
<B>"starts with"</B> o <B>"ends with"</B>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Si el campo especificado comienza o termina con ese texto, filtrar el mensaje.
La opci&oacute;n "starts with" se refiere a los primeros caracteres que
no est&aacute;n en blanco despu&eacute;s de la coma, as&iacute; que cualquier
espacio despu&eacute;s de la coma se ignora.</LI>

<LI>
<B>"appears"</B> o <B>"doesn't appear"</B>&nbsp;&nbsp; Si el campo espec&iacute;ficado
aparece o no aparece en el mensaje, filtrar el mensaje (el campo de texto
se ignora en este caso). Esto es &uacute;til para filtrar mensajes basados
solamente en los tipos de campos que contienen.</LI>

<LI>
<B>"intersects nickname"</B>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Si la cadena de texto est&aacute; incluida en un nicl (si es un nombre
completo o un nick en el nick), filtrar el mensaje.</LI>
</UL>
Usar los campos <B>"Text"</B> para especificar las cadenas de texto que
buscar&aacute; el filtro. Haz los contenidos de este campo tan espec&iacute;fico
como sea posible.
<P>Usa el men&uacute; desplegable <B>"Conjunction"</B> para enlazar los
dos t&eacute;rminos. Las opciones de conjunci&oacute;n son:
<BR>&nbsp;
<UL>
<LI>
<B>"Ignore"</B>&nbsp;&nbsp; Ignora el segundo t&eacute;rmino, si el mensaje
cumple el primero, se filtra el mensaje.</LI>

<LI>
<B>"and"</B>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Si el mensaje cumple
los dos t&eacute;rminos, se filtra.</LI>

<LI>
<B>"or"</B>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Si el
mensaje cumple alguno de los dos t&eacute;rminos, se filtra.</LI>

<LI>
<B>"unless"</B>&nbsp;&nbsp; Si el mensaje cumple los dos terminos, no se
filtra. (Esto permite excluir ciertas variaciones del primer t&eacute;rmino).</LI>
</UL>
ACCIONES DEL FILTRO
<P>Todos los mensajes que cumplen con los criterios de los filtros se manejan
seg&uacute;n se especifica en los menus desplegables <B>"Actions"</B>.
Cada filtro puede hacer hasta cinco cosas a un mensaje que cumple con el
criterio. Puedes usar la misma acci&oacute;n dos veces si no afecta directamente
al mensaje original (por ejemplo, <B>"Copy To"</B> puede usarse dos veces,
pero no <B>"Transfer To"</B>).
<P>Las opciones son las siguientes:
<BR>&nbsp;
<UL>
<LI>
<B>"None"</B> No se hace ninguna acci&oacute;n.</LI>

<LI>
<B>"Make priority"</B> Asigna el nivel de prioridad seleccionado a los
mensajes. Si seleccionas un nivel, los mensajes se configuran a esa prioridad.
Si seleccionas "Raise" o "Lower", los mensajes bajan un nivel de prioridad
basado en su nivel antes del filtrado.</LI>

<LI>
<B>"Make Subject" </B>Asigna el nuevo tema a los mensajes (no afecta al
tema que tiene el mensaje en s&iacute;). Si eliges esta opci&oacute;n,
el tema entero del mensaje se reemplaza con el nuevo tema. Usa el s&iacute;mbolo
"&amp;" si quieres a&ntilde;adir el nuevo tema al antiguo. Por ejemplo,
introducciendo "New Subject:&amp;" resulta "New Subject:Old Subject"</LI>

<LI>
<B>"Copy To"</B> Copia los mensajes a los buzones seleccionados.</LI>

<LI>
<B>"Transfer To"</B> Transfiere los mensajes a los buzones seleccionados.</LI>

<LI>
<B>"Skip Rest" </B>Para el filtrado para el mensaje (no es confrontado
con el resto de los filtros en la lista)</LI>
</UL>
ORDENANDO LOS MENSAJES EN LOS BUZONES
<P>Las listas de mensajes en los buzones se ordenan autom&aacute;ticamente
por fecha, en orden ascendente (los m&aacute;s nuevos abajo de la lista).
Para cambiar eso, selecciona el comando apropiado desde el submen&uacute;
<B>"Sort"
</B>en el men&uacute; <B>"Edit"</B>. Para ordenar en orden descendente
(inverso), mant&eacute;n pulsada la tecla Shift y selecciona una opci&oacute;n
de ordenado.
<P>Las opciones existentes son:
<BR>&nbsp;
<UL>
<LI>
<B>Sort by Status</B>. Ordena por el estado.</LI>

<LI>
<B>Sort by Priority</B>. Ordena por la prioridad.</LI>

<LI>
<B>Sort by Attachment</B>. Ordena por los ficheros attacheados.</LI>

<LI>
<B>Sort by Sender</B>. Ordena por el remitente.</LI>

<LI>
<B>Sort by Date</B>. Ordena por la fecha.</LI>

<LI>
<B>Sort by Size</B>. Ordena por el tama&ntilde;o.</LI>

<LI>
<B>Sort by Subject</B>. Ordena por el tema.</LI>
</UL>
Los buzones se ordenan bas&aacute;ndose en el estado previo del buz&oacute;n.
Por ejemplo, si un buz&oacute;n est&aacute; ordenado por fecha, y entonces
los ordenas por remitente, los mensajes se agrupan por remitentes y cada
grupo est&aacute;n en orden por la fecha.
<P>Nota: Algunas veces el ordenado por la fecha puede ser incorrecto. Esto
a veces sucede si los mensajes tienen etiquetas de fecha incorrectas, o
tienen zonas horarias desconocidas o incorrectas.
<BR>&nbsp;
<P>ENCONTRANDO UN TEXTO EN LOS MENSAJES
<P>Eudora incorpora una funci&oacute;n <B>"Find"</B> ("encontrar" que busca
por textos espec&iacute;ficos dentro de un mensaje, varios mensajes, o
incluso varios buzones. Para mostrar el submenu de comandos "Find", selecciona
<B>"Find"</B>
desde el menu <B>"Edit"</B>.
<BR>&nbsp;
<P>ENCONTRANDO UN TEXTO EN UN MENSAJE.
<P>Para buscar un texto en un mensaje, abre el mensaje. Entonces selecciona
<B>"Find"</B>
desde el menu <B>"Edit"</B> y escoge el comando <B>"Find"</B> del submenu.
Un cuadro de di&aacute;logo se mostrar&aacute;, con el punto de inserci&oacute;n
parpadeando localizado en el campo de texto.
<P>Teclea el texto que quieres encontrar en el campo de texto. Cuando finalices
la entrada del texto deseado, pulsa el bot&oacute;n <B>"Find"</B>
<P>Comenzar&aacute; desde donde est&aacute; el cursor en el mensaje, Eudora
busca en el mensaje el texto especificado. Si no se encuentra, se mostrar&aacute;
una alarma de <B>"not found"</B>.
<P>Si la b&uacute;squeda es exitosa, el mensaje se colocar&aacute; en el
primer punto donde se ha encontrado el texto, mostr&aacute;ndolo marcado.
<P>Para continuar la b&uacute;squeda en el misma mensaje, pulsa el bot&oacute;n
find en el cuadro de di&aacute;logo <B>"Find"</B>, o selecciona el comando
<B>"Find
Again"</B> desde el submenu <B>"Find"</B>. Estos comandos son equivalentes
y limitan la b&uacute;squeda al&nbsp; mismo mensaje. Repetiendo estos comandos
ciclicamente cruzas todo el mensaje abierto &uacute;nicamente.
<BR>&nbsp;
<P>ENCONTRANDO TEXTO ENTRE MULTIPLES MENSAJES Y BUZONES
<P>Los comandos <B>"Next", "Next Message" y "Next "mailbox"</B> se localizan
en el submenu <B>"Find"</B> (en el menu <B>"Edit"</B>) o como botones en
la ventana de di&aacute;logo "Find".
<BR>&nbsp;
<UL>
<LI>
<B>"Next" </B>El bot&oacute;n o comando "Next" te permite buscar el texto
hasta que lo encuentra en el mismo mensaje o en uno de los mensajes siguientes
del buz&oacute;n actual.</LI>

<LI>
<B>"Next Message" </B>El bot&oacute;n o comando "Next Message" empieza
la b&uacute;squeda en el mensaje siguiente. Eudora continua la b&uacute;squeda
hasta que encuentra el texto deseado, incluso si tiene que abrir m&aacute;s
de un mensaje o un buz&oacute;n de correo.</LI>

<LI>
<B>"Next Mailbox"</B> El bot&oacute;n o comando "Next Mailbox" comienza
la b&uacute;squeda del texto especificado en el buz&oacute;n siguiente
al actual. La b&uacute;squeda se conduce entre todos los mensajes en ese
buz&oacute;n y en cualquier buz&oacute;n subsecuente, incluyendo los buzones
<B>"In"</B>,
<B>"Out"</B> y <B>"Trash"</B>.</LI>
</UL>
<B>Nota</B>: los buzones son chequeados en el orden que est&aacute;n lostados
en el menu Mailbox.
<P>Cuando el texto es encontrado en un mensaje. Se mostrar&aacute; el mensaje.
Ctrl+doble-click en la barra del t&iacute;tulo del mensaje abrir&aacute;
el buz&oacute;n que contiene ese mensaje.
<BR>&nbsp;
<P>"MATCH CASE"
<P>Normalmente Eudora ignora la diferencia entre may&uacute;sculas y min&uacute;sculas
cuando busca. Si quieres que Eudora considere esa diferencia mientras busca,
activa la opci&oacute;n <B>"Match Case"</B> en el cuadro de di&aacute;logo
<B>"Find"</B>.
Cuando se activa esta opci&oacute;n, Eudora busca por copias exactas del
texto, incluyendo may&uacute;sculas.
<BR>&nbsp;
<P>"SUMMARIES ONLY"
<P>Si sabes que el texto que est&aacute;s buscando est&aacute; incluido
en una lista de mensaje, activa la opci&oacute;n <B>"Summaries Only" </B>en
el cuadro de di&aacute;logo Find. Cuando pulses el bot&oacute;n <B>"Find"</B>,
Eudora busca el texto &uacute;nicamente en los campos <B>"Sender"</B> y
<B>"Subject"
</B>de las listas de mensajes que aparecen en las ventanas de los buzones.
Eudora buscar&aacute; mucho m&aacute;s r&aacute;pido con esta opci&oacute;n
activada.
<BR>&nbsp;
<P>PARANDO UNA BUSQUEDA
<P>Si quieres parar al Eudora en la continuaci&oacute;n de una b&uacute;squeda,
pulsa el bot&oacute;n <B>"Stop"</B> en la ventana de progreso o pulsa la
tecla <B>"Esc"</B>.
<BR>&nbsp;
<P>GUARDANDO UN MENSAJE A UN FICHERO
<P>Puedes guardar un mensaje en un fichero de texto aparte, en tu ordenador.
Para hacer esto, abre o selecciona los mensajes que quieres guardar. Entonces,
selecciona <B>"Save As..."</B> desde el menu <B>"File"</B>. Se mostrar&aacute;
la ventana <B>"Save As"</B>.
<P>Introduce el nombre que quieres darle al fichero de texto, y selecciona
las opciones apropiadas.
<P><B>Importante</B>: aseg&uacute;rate de cambiar la opci&oacute;n <B>"Save
as type"</B> como <B>"Text Files"</B>.
<BR>&nbsp;
<UL>
<LI>
<B>"Guess Paragraphs"</B> elimina caracteres de retorno extra&ntilde;os
para dejar el mensaje s&oacute;lo con el cambio de l&iacute;nea al final
de los p&aacute;rrafos.</LI>

<LI>
<B>"Include Header"</B> conserva la informaci&oacute;n de cabecera del
mensaje en el documento guardado. Si no est&aacute; activo, s&oacute;lo
se guarda el cuerpo del mensaje.</LI>
</UL>
Una vez que has hecho todas tus elecciones, pulsa en el bot&oacute;n <B>"Save"</B>.
<P><B>Nota</B>: si un mensaje sin leer se salve en un fichero, esto cambia
su estado a le&iacute;do, lo mismo que si el mensaje fuera abierto. Si
seleccionas m&uacute;ltiples mensajes de una ventana de buz&oacute;n y
escoges <B>"Save As..."</B> todos los mensajes seleccionados se guardar&aacute;n
en un &uacute;nico fichero.
<P><A NAME="5.2.1.9.- Usando el Libro de Direcciones y la"></A><B><FONT SIZE=+0>5.2.1.9.-
</FONT>Usando
el Libro de Direcciones y la Lista R&aacute;pida de Destinatarios</B>
<P>USANDO EL LIBRO DE DIRECCIONES
<P>El Libro de Direcciones (Address Book) es donde guardas informaci&oacute;n
sobre personas o grupos con quienes escribes. Cada entrada en el libro
de direcciones incluye un nick para una persona o grupo, sus direcciones
e-mail completas y algunas notas. Los nicks pueden usarse en lugar de las
propias direcciones de correo en los campos <B>"To:"</B>, <B>"Cc:"</B>
y <B>"Bcc:"</B> de los mensajes que escribes. Puedes tambi&eacute;n usar
el libro de direcciones para poner nicks en la Lista r&aacute;pida de Destinatarios
(Quick List Recipients) y dirigilas a un nuevo mensaje.
<P>Para abrir tu libro de direcciones, selecciona desde el menu <B>"Tools"</B>
la opci&oacute;n <B>"Address Book"</B>.
<P>Usa la opci&oacute;n <B>"View by"</B> para mostrar las entradas por
nicks (nickname) o direcciones (address). Si intentas visualizar por un
campo que no contiene datos, la entrada se muestra como <B>""</B>. Puedes
tambi&eacute;n empezar tecleando en la lista de entradas, y la entrada
apropiada se seleccionar&aacute; cuando entres los suficientes caracteres
como para identificarla.
<P>Para bajar y subir en la lista de entradas, usa los cursos. Para reasignar
un nuevo tama&ntilde;o a la lista, arrastra la barra divisora.
<P>Para cerrar y abrir la parte derecha de la ventana, usa los botones
&lt; y >.
<BR>&nbsp;
<P>CREANDO NUEVAS ENTRADAS.
<P>Para crear una nueva entrada, pulsa en el bot&oacute;n <B>"New"</B>.
Se mostrar&aacute; una ventana. Entra un nick para la entrada. Un nick
(a veces tambi&eacute;n llamado un alias) es un sustituto m&aacute;s breve
y m&aacute;s f&aacute;cilmente memorizable para las direcciones electr&oacute;nicas
de esa entrada. (Por ejemplo, tengo una amiga con una direcci&oacute;n
endemoniadamente dif&iacute;cil de recordar, he creado un nick llamado
<B>"Sonia"</B>
y asociado a esa direcci&oacute;n. Ahora me basta con poner
<B>"Sonia"</B>
en el campo <B>"To:"</B> para que se asigne autom&aacute;ticamente esa
direcci&oacute;n).
<P>Selecciona la opci&oacute;n <B>"Put it on the recipient list"</B> si
quieres que el nick est&eacute; en tu lista de destinatarios, y pulsa <B>"OK"</B>
para crear la entrada. Ahora puedes introducir la informaci&oacute;n para
esa entrada.
<P>En la pesta&ntilde;a <B>"Address(es)" </B>introduce las direcciones
completas de la persona o las personas que vas a incluir en ese nick, separando
las direcciones por comas o pasando a la siguiente l&iacute;nea (&eacute;ste
es el &uacute;nico sitio que se puede dar a <B>"ENTER"</B> para separar
las direcciones). Tambi&eacute;n puedes usar nicks en este campo, pero
aseg&uacute;rate que cualquier nick que uses est&aacute; definido en su
propia entrada. Puedes usar una mezcla de nicks y direcciones electr&oacute;nicas
completas.
<P>NOTA: Aseg&uacute;rate que no haya ninguna otra informaci&oacute;n en
este campo excepto las direcciones o nicks, o tus mensajes se direccionar&aacute;n
incorrectamente.
<P>En la pesta&ntilde;a <B>"Notes"</B> puedes entrar informaci&oacute;n
de esa persona o grupo, cualquier tipo de notas para tu uso particular.
Esta informaci&oacute;n no se incluye en los mensajes que env&iacute;es.
<P>Se recomienda que no tengas m&aacute;s de 2.500 entradas por fichero.
Si tienes un gran n&uacute;mero de entradas, deber&iacute;as considerar
usar un servidor <B>"Ph"</B>.
<P>Para guardar tus cambios en el libro de direcciones, selecciona <B>"Save"</B>
desde el menu <B>"File"</B>.
<BR>&nbsp;
<P>CAMBIANDO Y ELIMINANDO ENTRADAS.
<P>Para hacer cambios a una entrada del libro de direcciones (incluyendo
cambiar el nombre de la entrada, el nick para ello, y cualquier informaci&oacute;n
en las Notas), selecciona la entrada desde la lista y edita los campos
apropiados.
<P>Importante: Si cambias un nick, aseg&uacute;rate de corregir cualquier
entrada que tenga referencias a ese nick.
<P>Para borrar una entrada, selecci&oacute;nalo desde la lista y pulsa
el bot&oacute;n <B>"Del</B>" o pulsa la tecla <B>"Delete"</B>. No puedes
eliminar el fichero de nicks del Eudora.
<P>Para guardar tus cambios, selecciona <B>"Save"</B> desde el menu <B>"File"</B>.
<BR>&nbsp;
<P>INCLUYENDO NICKS EN LA LISTA RAPIDA DE DESTINATARIOS.
<P>Para incluir un nick en la lista r&aacute;pida de destinatarios, selecciona
la entrada apropiada del libro de direcciones desde la lista y pulsa en
la opci&oacute;n <B>"Recipient List" </B>arriba a la derecha (junto al
campo <B>"Nickname"</B>). El nick para la entrada seleccionada se incluir&aacute;
en la Lista R&aacute;pida de Destinatarios.
<P>Si cambias un nick o eliminas una entrada, la lista r&aacute;pida de
destinatarios se actualizar&aacute; apropiadamente. Para m&aacute;s detalles
sobre el uso de la lista r&aacute;pida de destinatarios ver la secci&oacute;n
<A HREF="#USANDO LA LISTA RAPIDA DE DESTINATARIOS">"Usando
la Lista R&aacute;pida de Destinatarios"</A>
<P><B>Nota:</B> Puedes a&ntilde;adir o eliminar m&uacute;ltiples nicks
a o desde la lista r&aacute;pida de destinatarios seleccionando m&uacute;ltiples
entradas. Mant&eacute;n pulsada la tecla <B>shift </B>para seleccionar
m&uacute;ltiples entradas en secuancia, o la tecla <B>Ctrl </B>para deshacer
la selecci&oacute;n.
<BR>&nbsp;
<P>DIRIGIENDO UN MENSAJE DESDE EL LIBRO DE DIRECCIONES.
<P>Puedes abrir y dirigir un nuevo mensaje desde el libro de direcciones
usando los botones <B>"To:"</B>, <B>"Cc:"</B> y <B>"Bcc:</B>"
<P>Para crear un nuevo mensaje desde el libro de direcciones, selecciona
la entrada hacia la cual quieres dirigir el mensaje (pulsando la tecla
<B>Shift</B>
para seleccionar m&uacute;ltiples entradas. Entonces pulsa
<B>"To:"</B>,
<B>"Cc:"</B> o <B>"Bcc:"</B>. Una ventana nueva se mostrar&aacute; con
el nick seleccionado insertado en el campo apropiado.
<P>Nota: tambi&eacute;n puedes hacer un <B>doble click</B> en una entrada
para introducir ese nick en el campo <B>"To"</B>.
<P>Una vez que se ha mostrado la ventana del nuevo mensaje, puedes usar
los botones <B>"To:"</B>, <B>Cc:"</B> y <B>"Bcc:"</B> para insertar nicks
adicionales en los correspondientes campos.
<BR>&nbsp;
<P>EL COMANDO "MAKE ADDRESS BOOK ENTRY"
<P>Este comando se usa para crear entradas en tu libro de direcciones,
y es especialmente &uacute;til para crear entradas de grupos.
<P>En el libro de direcciones, selecciona varias entradas diferentes, entonces
escoge <B>"Make Address Book Entry..."</B> desde el menu <B>"Special"</B>.&nbsp;
La ventana para el nuevo nick se mostrar&aacute; esperando que introduzcas
el nick.
<P>El campo <B>"Address(es)"</B> de la nueva entrada incluir&aacute; los
nicks para las entradas que has seleccionado, no las direcciones reales.
<P>En un buz&oacute;n, selecciona las listas de los mensajes que quieres
y selecciona <B>"Make Address Book Entry..."</B> desde el menu <B>"Special"</B>.
Sigue las intrucciones para crear una nueva entrada. Si el mensaje es un
mensaje saliente, la nueva entrada incluir&aacute; todas las direcciones
en los campos <B>"To"</B>, <B>"cc"</B> y <B>"Bcc"</B>. Si el mensaje es
un mensaje entrante, la nueva entrada incluir&aacute; todas las direcciones
del campo <B>"From"</B>. Si se ha seleccionado m&uacute;ltiples mensajes,
las direcciones se tomar&aacute;n de cada mensaje y se pondr&aacute;n en
la nueva entrada.
<P><B>Nota:</B> El comando <B>"Make Address Book Entry..."</B> usa las
opciones configuradas en <B>"Reply Options"</B>. Si la opci&oacute;n <B>"Include
yourself"</B> est&aacute; activada, tu direcci&oacute;n ser&aacute; incluida
en la nueva entrada.
<BR>&nbsp;
<P>EL COMANDO "FINISH ADDRESS BOOK ENTRY"
<P>Con el comando <B>"Finish Address Book Entry"</B>, puedes introducir
una parte concreta de un nick en los campos <B>"To"</B>, <B>"Cc"</B> o
<B>"Bcc"</B>
de un mensaje, y entonces seleccionar <B>"Finish Address Book Entry"</B>
desde el menu <B>"Edit"</B>, y el nick se completar&aacute; por t&iacute;.
Debes introducir los suficientes caracteres del nick que lo identifiquen,
o Eudora no sabr&aacute; qu&eacute; nick usar.
<BR>&nbsp;
<P><A NAME="USANDO LA LISTA RAPIDA DE DESTINATARIOS"></A>USANDO LA LISTA
RAPIDA DE DESTINATARIOS
<P>La Lista R&aacute;pida de Destinatarios es tu lista de destinatarios
a los cuales env&iacute;an mensajes frecuentemente.
<LI>
Para a&ntilde;adir un nick a la lista r&aacute;pida de destinatarios, chequea
la opci&oacute;n <B>"Recipient List"</B> en su entrada en el Libro de Direcciones.</LI>

<LI>
Para a&ntilde;adir una direcci&oacute;n electr&oacute;nica completa a lista,
selecciona el texto que contiene la direcci&oacute;n completa. Entonces,
selecciona <B>"Add As Recipient"</B> desde el menu <B>"Special"</B>.</LI>

<LI>
Para eliminar una entrada desde la lista, desactiva la opci&oacute;n Recipient
List en la entrada del libro de direcciones, o selecciona el nick desde
el submenu <B>"Remove Recipient"</B> desde el menu <B>"Special"</B>.</LI>

<LI>
Para abrir un mensaje nuevo dirigido a alguien de tu lista, selecciona
<B>"New
Message to"</B>, <B>"Forward to"</B> o <B>"Redirect to"</B> desde el menu
<B>"Message"</B>, y selecciona el nick de la lista mostrada.</LI>

<P><BR>Pueden a&ntilde;adirse m&aacute;s de un recipiente desde la lista
a los campos <B>"To"</B>, <B>"Cc"</B> y <B>"Bcc"</B> de cualquier mensaje.
Si usas el comando <B>"Insert Recipient"</B>, las comas se a&ntilde;adir&aacute;n
si es necesario.
<P><A NAME="5.2.1.10.- Usando el directorio de Servicios"></A><B><FONT SIZE=+0>5.2.1.10.-
</FONT>Usando
el directorio de Servicios (Directory Services)</B>
<P>ABRIENDO EL DIRECTORIO DE SERVICIOS.
<P>Eudora puede acceder a dos diferentes directorios de servicios, <B>"Ph"</B>
y <B>"Finger"</B>. Para usar estos servicios, debes poner el nombre de
los correspondientes servidores Ph y Finger en <B>"Host Options"</B> en
<B>"Tools"</B>
-> <B>"Options"</B>. El servidor activo ph o finger (definido en Host Options)
se mostrar&aacute; en el campo <B>"Server"</B>, el cual incluye una lista
desplegable de los &uacute;ltimos 10 servidores que hayas accedido.
<P>Para utilizar el directorio de servicios, selecciona <B>"Directory Services"</B>
desde el menu <B>"Toold"</B>.
<P>USANDO PH.
<P>Para ver alguien usando Ph, introduce la informaci&oacute;n (normalmente
el nombre de alguien) en el campo <B>"Command"</B>. El comando se env&iacute;a
a tu servidor Ph, y la respuesta se muestra en la secci&oacute;n baja de
la ventana.
<P>Si hay m&aacute;s de un resultado, puedes usar la tecla Tab para moverse
hacia el siguiente, o manteniendo pulsada la tecla Shift mientras pulsas
Tab para moverse hacia el anterior.
<P><B>Nota: </B>Puedes teclear cualquier comando Ph en el campo <B>"Command"</B>,
excepto los comandos de login o que requieran login.
<P>ENCONTRANDO SERVIDORES PH
<P>Algunos servidores Ph guardan una lista de otros servidores que est&aacute;n
disponibles en Internet. Esta no es siempre una lista comprensible de todos
los servidores Ph que hay ah&iacute; fuera, pero puede ser &uacute;til.
<P>Para coger la lista de servidores que el servidor activo conoce, pulsa
en el bot&oacute;n <B>"Server"</B> de la ventana. Se mostrar&aacute; una
lista de servidores en el &aacute;rea de resultados. Para ir a uno de esos
servidores y hacer una solicitud (query), haz doble click en la URL del
servidor.
<P>USANDO FINGER
<P>Para usar el protocolo finger, introduce el comando y pulsa <B>"Finger"</B>.
El comando puede estar en la forma <B>"nombre@dominio"</B>. Si omites el
segmento <B>"@dominio"</B>, usar&aacute; el del servidor mostrado en el
campo <B>"server"</B>. El comando finger se env&iacute;a al servidor finger,
y la respuesta se mostrar&aacute; en la secci&oacute;n baja de la ventana.
<BR>&nbsp;
<BR>&nbsp;
<H3>
<A NAME="5.2.2.- Pegasus"></A><B>5.2.2.- Pegasus</B></H3>

<DD>
<A HREF="http://www.pegasus.usa.com" TARGET="_top">http://www.pegasus.usa.com</A>&nbsp;<IMG SRC="esingla2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></DD>

<DD>
<A HREF="ftp://ftp.risc.ua.edu/pub/network/pegasus" TARGET="_top">ftp://ftp.risc.ua.edu/pub/network/pegasus
(North America)</A></DD>

<DD>
<A HREF="ftp://ftp.let.rug.nl/pub/pmail" TARGET="_top">ftp://ftp.let.rug.nl/pub/pmail
(Europe)</A></DD>

<H3>
<B>>>C&oacute;mo configuro el Pegasus?</B></H3>

<DD>
<A HREF="http://www.geocities.com/SiliconValley/Vista/5096/pegasus.htm" TARGET="_top">http://www.geocities.com/SiliconValley/Vista/5096/pegasus.htm</A>&nbsp;<IMG SRC="esespan2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></DD>

<H3>
<A NAME="5.2.3.- M.Mail"></A><B>5.2.3.- Microsoft Mail</B></H3>

<DD>
<A HREF="http://www.microsoft.com/msdownload/" TARGET="_top">http://www.microsoft.com/msdownload/</A>&nbsp;<IMG SRC="esingla2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER>&nbsp;<IMG SRC="esespan2.gif" HEIGHT=20 WIDTH=20 ALIGN=ABSCENTER></DD>

<H3>
<A NAME="5.2.4.- PMMail"></A><B>5.2.4.- PMMail (OS/2 y Win32)</B></H3>

<DD>
PMMail es uno de los m&uacute;ltiples programas de e-mail que hay para
OS/2 (aunque en noviembre de 1997 est&aacute; previsto que aparezca la
versi&oacute;n Win32). Todo lo que hay escrito en esta FAQ es en base a
la versi&oacute;n 1.90 de PMMail (aunque ya est&aacute; disponible la 1.95)</DD>

<DD>
Nota: Acaba de aparecer la versi&oacute;n Win32 para W95/NT y tengo que
decir a su favor que es realmente magnifico este gestor de e-mail :-)</DD>

<P><BR><A NAME="5.2.4.1 - Entrando por primera vez a PMMail"></A><B>5.2.4.1
- Entrando por primera vez a PMMail</B>
<BR>&nbsp;
<DD>
La primera vez que entramos a PMMail, &eacute;ste nos pregunta si deseamos
crear una cuenta de correo con los settings que ha encontrado en el fichero
TCPOS2.INI (configuraci&oacute;n del TCP/IP). Es recomendable decir que
s&iacute; (=pulsar 'Bien'), porque nos facilitar&aacute; las cosas.</DD>

<P><BR><A NAME="5.2.4.2 - Configurando la cuenta de correo"></A><B>5.2.4.2
- Configurando la cuenta de correo</B>
<P>Hayamos realizado el paso del punto 5.2.4.1 o no, llegaremos a un men&uacute;
de etiquetas, con diversas p&aacute;ginas. A continuaci&oacute;n, se explica
qu&eacute; poner en cada p&aacute;gina:
<P><B>[General]</B>
<BR>&nbsp;
<UL>
<LI>
Default Character Set: Puede hacer dos cosas:</LI>

<UL>
<LI>
Dejar el 'US ASCII', con lo cual estar&aacute; usando el ASCII americano,
y usuarios de otras plataformas y/o tablas de c&oacute;digos NO leer&aacute;n
bi&eacute;n sus tildes, e&ntilde;es y s&iacute;mbolos que correspondan
a ASCIIs superiores al 127.</LI>

<LI>
Elegir el 'Latin 1', que es el internacional. Yo recomiendo elegir el Latin-1.</LI>
</UL>

<LI>
Time Zone Offset To GMT: Para Pen&iacute;nsula y Baleares, seleccione '1'.
Para las Islas Canarias, seleccione '0'.</LI>
</UL>
<B>[Message List]</B>
<P>No toque nada.
<P><B>[MIME Associations]</B>
<P>Esto sirve para que al decodificar un fichero MIME, salte autom&aacute;ticamente
el programa encargado de su manejo. Para cambiar las opciones de uno de
los que ya hay en la lista, marquelo con el rat&oacute;n y pulse 'Edit'.
Para a&ntilde;adir un nuevo tipo de fichero, pulse 'Add'. Para eliminar
un tipo de fichero, pulse 'Delete'.
<P><B>[REXX]</B>
<P>No toque nada.
<P>Ahora vaya al men&uacute; 'Account' y seleccione 'Utilities Settings'.
S&oacute;lo menciono lo que hay que cambiar:
<P><B>[Signatures]</B>
<BR>&nbsp;
<UL>
<LI>
Pulse sobre 'New' y d&eacute; una descripci&oacute;n a la firma que vaya
a usar para sus mensajes (campo 'Description'). En el campo que aparece
en blanco, escriba todo lo que vaya a ser su firma (la netiquette recomienda
no excederse de 3 l&iacute;neas).</LI>

<LI>
Puede crear tantas firmas como desee. Seleccione una de ellas y pulse sobre
sobre 'Set as default' para que sea esa la que aparezca por defecto en
sus mensajes.</LI>
</UL>
<B>[Canned Replies]</B>
<BR>&nbsp;
<DD>
Una canned reply es un mensaje pre-escrito, que se puede insertar r&aacute;pidamente
en un e-mail. Esto es muy &uacute;til cuando ha de responder a muchas personas
cosas similares. El m&eacute;todo de actuaci&oacute;n con las canned replies
es el mismo que con las signatures, pero aqu&iacute; NO hay posibilidad
de poner una canned reply por defecto.</DD>

<P><BR><B>[Filters]</B>
<BR>&nbsp;
<DD>
Los filtros son MUY &uacute;tiles para eliminar el correo-basura que nos
remiten muchas empresas de publicidad. A continuaci&oacute;n explico la
creaci&oacute;n de un filtro para eliminar mensajes referentes a acuarios
y/o peces:</DD>

<UL>
<LI>
Description: Ponga aqu&iacute; la descripci&oacute;n. P.ej. "Antiaquaris
i peixos"</LI>

<LI>
Marque la casilla 'Enabled'</LI>

<LI>
Marque la casilla 'Simple' (los filtros complejos, 'complex', han de dise&ntilde;arse
con un lenguaje especial). El problema de los filtros 'Simple' es que s&oacute;lo
permiten usar dos palabras para filtrar.</LI>

<LI>
Search: Seleccione la parte del mensaje donde va a buscar las palabras.
Puede elegir 'Whole message' (todo el mensaje: cuerpo y cabecera), 'Header'
(s&oacute;lo cabecera), 'Body' (s&oacute;lo el cuerpo), 'Attachment Names'
(en los nombres de los ficheros attacheados), 'To', 'From', 'Cc:' y 'Subject'.
Recomiendo marcar 'Whole message'.</LI>

<LI>
For: Introduzca aqu&iacute; las palabras que desea usar para separar los
mensajes. P.ej. "aquari" (en el segundo campo 'for' puede poner "peix")</LI>

<LI>
Connector: Puede elegir 'And' (discriminar&aacute; el mensaje que contenga
las dos palabras especificadas), 'Or' (discriminar&aacute; el mensaje que
contenga una de las dos palabras especificadas), o 'unless' (discriminar&aacute;
cualquier mensaje que contenga una palabra y NO la otra, es decir, los
que SI contengan las dos palabras SI pasar&aacute;n).</LI>

<LI>
Type: Recomiendo marcar 'Incoming'.</LI>

<LI>
Actions: Hay 6 casillas de 'Actions', donde puede usted especificar para
qu&eacute; acciones ser&aacute; usado ese filtro.</LI>
</UL>
<A NAME="5.2.4.3 - Configurando el PMMail"></A><B>5.2.4.3 - Configurando
el PMMail</B>
<P>Una vez configurada la cuenta de correo, vaya al men&uacute; PMMail,
y seleccione 'Settings'. S&oacute;lo mencionar&eacute; los cambios que
habremos de hacer:
<P><B>[General]</B>
<BR>&nbsp;
<UL>
<LI>
Default Character Set: Puede hacer dos cosas:</LI>

<UL>
<LI>
Dejar el 'US ASCII', con lo cual estar&aacute; usando el ASCII americano,
y usuarios de otras plataformas y/o tablas de c&oacute;digos NO leer&aacute;n
bi&eacute;n sus tildes, e&ntilde;es y s&iacute;mbolos que correspondan
a ASCIIs superiores al 127.</LI>

<LI>
Elegir el 'Latin 1', que es el internacional, la opcci&oacute;n m&aacute;s
recomendable.</LI>
</UL>

<LI>
Time Zone Offset To GMT: Para Pen&iacute;nsula y Baleares, seleccione '1'.
Para las Islas Canarias, seleccione '0'.</LI>
</UL>
<B>[Message List]</B>
<P>No toque nada.
<P><B>[MIME Associations]</B>
<P>Esto sirve para que al decodificar un fichero MIME, salte autom&aacute;ticamente
el programa encargado de su manejo. Para cambiar las opciones de uno de
los que ya hay en la lista, marquelo con el rat&oacute;n y pulse 'Edit'.
Para a&ntilde;adir un nuevo tipo de fichero, pulse 'Add'. Para eliminar
un tipo de fichero, pulse 'Delete'.
<P><B>[REXX]</B>
<P>No toque nada.
<BR>Ahora vaya al men&uacute; 'Account' y seleccione 'Utilities Settings'.
S&oacute;lo menciono lo que hay que cambiar:
<P><B>[Signatures]</B>
<BR>&nbsp;
<UL>
<LI>
Pulse sobre 'New' y d&eacute; una descripci&oacute;n a la firma que vaya
a usar para sus mensajes (campo 'Description'). En el campo que aparece
en blanco, escriba todo lo que vaya a ser su firma (la netiquette recomienda
no excederse de 3 l&iacute;neas).</LI>

<LI>
Puede crear tantas firmas como desee. Seleccione una de ellas y pulse sobre
sobre 'Set as default' para que sea esa la que aparezca por defecto en
sus mensajes.</LI>
</UL>
<B>[Canned Replies]</B>
<UL>
<LI>
Una canned reply es un mensaje pre-escrito, que se puede insertar r&aacute;pidamente
en un e-mail. Esto es muy &uacute;til cuando ha de responder a muchas personas
cosas similares. El m&eacute;todo de actuaci&oacute;n con las canned replies
es el mismo que con las signatures, pero aqu&iacute; NO hay posibilidad
de poner una canned reply por defecto.</LI>
</UL>
<B>[Filters]</B>
<P>Los filtros son MUY &uacute;tiles para eliminar el correo-basura que
nos remiten muchas empresas de publicidad. A continuaci&oacute;n explico
la creaci&oacute;n de un filtro para eliminar mensajes referentes a acuarios
y/o peces:
<BR>&nbsp;
<UL>
<LI>
Description: Ponga aqu&iacute; la descripci&oacute;n. P.ej. "Antiaquaris
i peixos"</LI>

<LI>
Marque la casilla 'Enabled'</LI>

<LI>
Marque la casilla 'Simple' (los filtros complejos, 'complex', han de dise&ntilde;arse
con un lenguaje especial). El problema de los filtros 'Simple' es que s&oacute;lo
permiten usar dos palabras para filtrar.</LI>

<LI>
Search: Seleccione la parte del mensaje donde va a buscar las palabras.
Puede elegir 'Whole message' (todo el mensaje: cuerpo y cabecera), 'Header'
(s&oacute;lo cabecera), 'Body' (s&oacute;lo el cuerpo), 'Attachment Names'
(en los nombres de los ficheros attacheados), 'To', 'From', 'Cc:' y 'Subject'.
Recomiendo marcar 'Whole message'.</LI>

<LI>
For: Introduzca aqu&iacute; las palabras que desea usar para separar los
mensajes. P.ej. "aquari" (en el segundo campo 'for' puede poner "peix")</LI>

<LI>
Connector: Puede elegir 'And' (discriminar&aacute; el mensaje que contenga
las dos palabras especificadas), 'Or' (discriminar&aacute; el mensaje que
contenga una de las dos palabras especificadas), o 'unless' (discriminar&aacute;
cualquier mensaje que contenga una palabra y NO la otra, es decir, los
que SI contengan las dos palabras SI pasar&aacute;n).</LI>

<LI>
Type: Recomiendo marcar 'Incoming'.</LI>

<LI>
Actions: Hay 6 casillas de 'Actions', donde puede usted especificar para
qu&eacute; acciones ser&aacute; usado ese filtro.</LI>
</UL>
<A NAME="5.2.4.4 - Usando PMMail"></A><B>5.2.4.4 - Usando PMMail</B>
<P>Describo s&oacute;lo las acciones m&aacute;s corrientes:
<BR>&nbsp;
<UL>
<LI>
Escribir nuevo mensaje: pulse Control+N o vaya al men&uacute; 'message'
y seleccione 'new message'</LI>

<LI>
Contestar un mensaje de forma privada a su emisor: pulse Control+R o vaya
al men&uacute; 'message' y seleccione 'reply to'. Puede elegir si desea
incluir el quoteo o no (include/exclude quote)</LI>

<LI>
Contestar un mensaje de forma p&uacute;blica (s&oacute;lo v&aacute;lido
en las listas de correo): pulse Control+Alt+R o vaya al men&uacute; 'message'
y seleccione 'reply to all'. Tambi&eacute;n puede elegir si incluir o no
el quoteo.</LI>

<LI>
Leer un mensaje: situese sobre &eacute;l en la carpeta 'Inbox' y pulse
enter, o vaya al men&uacute; 'message' y seleccione 'read'</LI>

<LI>
Grabar un mensaje: pulse Control+S o vaya al men&uacute; 'message' y seleccione
'save'.</LI>

<LI>
Borrar un mensaje: pulse 'del' o 'supr' o vaya al men&uacute; 'message'
y seleccione 'delete'.</LI>

<LI>
Enviar los mensajes grabados: pulse F5 o vaya al men&uacute; 'account'
y seleccione 'send queued messages'.</LI>

<LI>
Enviar y recibir correo: pulse F2 o pulse el primer icono por la izquierda,
o vaya al men&uacute; 'account' y seleccione 'fetch'.</LI>

<LI>
A&ntilde;adir una direcci&oacute;n al Address Book: pulse Alt+S o vaya
al men&uacute; 'message' y seleccione 'add sender to address book'.</LI>
</UL>
<A NAME="5.2.4.5 - Herramientas del PMMail"></A><B>5.2.4.5 - Herramientas
del PMMail</B>
<P><B>[Address Book]</B>
<BR>&nbsp;
<DD>
Es, como su nombre indica, un libro de direcciones de e-mail de gente.
Es muy &uacute;til si no queremos aprendernos de memoria las direcciones
de nuestros conocidos. Puede accederse a &eacute;l pulsando Control+A o
yendo al men&uacute; 'Tools' y pulsando 'Address Book'.</DD>

<P><BR><B>[Find]</B>
<P>Sirve para buscar palabras (keywords) en un mensaje (o en m&aacute;s
de uno). Se accede a &eacute;l pulsando Control+F o yendo al men&uacute;
'Tools' y seleccionando 'Find'.
<H3>
<A NAME="5.2.5.- MR/2 ICE"></A><B>5.2.5.- MR/2 ICE</B></H3>

<DL>
<DD>
Es otro cliente de e-mail para OS/2. Tambi&eacute;n incluye soporte de
News, aunque est&aacute; en fase beta. La p&aacute;gina oficial es <A HREF="http://nick.secant.com" target="_top">http://nick.secant.com</A></DD>
</DL>

<DL>
<CENTER>
<DT>

<HR WIDTH="100%"></DT></CENTER>

<LI>
<I>FAQ.ESP.INTERNET Versi&oacute;n 2.0.9</I></LI>

<LI>
<I>Recopilado por Agustin MuNoz 2:346/201.9@fidonet.org</I></LI>

<LI>
<!-- date start --><I>Ultima Actualizaci&oacute;n el Viernes 4 de Septiembre
de 1998.</I><!-- date end --></LI>

<ADDRESS>

<HR WIDTH="100%"></ADDRESS>

<ADDRESS>
<I>Para reproducciones totales o parciales de este FAQ por favor lee atentamente
el Apartado </I><A HREF="Apart1.htm#1.5.0.- Copyright">1.5.0.- Copyright</A>&nbsp;<I></I></ADDRESS>
</DL>

</BODY>
</HTML>
