<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>FAQ de R34.LINUX: Sistemas de Archivos - FileSystems</TITLE>
 <LINK HREF="FAQ-R34.LINUX-3.html" REL=next>
 <LINK HREF="FAQ-R34.LINUX-1.html" REL=previous>
 <LINK HREF="FAQ-R34.LINUX.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-R34.LINUX-3.html">Página siguiente</A>
<A HREF="FAQ-R34.LINUX-1.html">Página anterior</A>
<A HREF="FAQ-R34.LINUX.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2. Sistemas de Archivos - FileSystems</A></H2>

<H2><A NAME="ss2.1">2.1 El directorio /proc</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>He encontrado en el directorio /proc un fichero propietario de root que se
llama kcore y ocupa 8 Megas. ¿Sab&eacute;is para qu&eacute; sirve, si sirve para algo? Tiene
toda la pinta de ser un core dump, pero he intentado borrarlo y no he podido. En
principio tiene solo atributos de lectura, pero cuando se los cambio a escritura
e intento borrarlo me dice "operacion no permitida" y le vuelve a restaurar los
atributos a su forma inicial.     
<P>
<DT><B>RESPUESTA</B><DD><P>El directorio /proc y todo lo que bajo &eacute;l se organiza
es virtual. No existe en el disco, sino que est&aacute; creado en memoria. Se
utiliza para suministrar informaci&oacute;n sobre el sistema. Si ves archivos
<EM>enormes</EM> o que no puedes leer o borrar o algo parecido, no te
asustes, no existen. <BR>
<P>
<BLOCKQUOTE><CODE>
<PRE>
[6]
</PRE>
</CODE></BLOCKQUOTE>
</DL>
<P>
<H2><A NAME="ss2.2">2.2 HDs &gt; 1024 sectores</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿Hay muchos problemas para soportar discos de m&aacute;s de 1024 Sectores?
<P>
<DT><B>RESPUESTA</B><DD><P>No hace falta tener soporte LBA en la BIOS para instalar Linux en un disco
de &gt; 1024 sectores. Tampoco hace falta para compartir un HD &gt; 1024 entre
Linux y DOS.
<P>
<BLOCKQUOTE><CODE>
<PRE>
[7]
</PRE>
</CODE></BLOCKQUOTE>
</DL>
<P>
<H2><A NAME="ss2.3">2.3 Lectura de floppies</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿C&oacute;mo puedo leer y grabar en disquetes?.
<P>
<DT><B>RESPUESTA</B><DD><P>En principio hay dos formas. La primera es montando el disquete en un
subdirectorio de nuestro sistema de archivos, de forma que accediendo a ese
directorio se accede al disquete. Esto se har&iacute;a de la siguiente forma:
<P>
<BLOCKQUOTE><CODE>
<PRE>

    mount -t msdos /dev/fd0 /mnt/floppy
</PRE>
</CODE></BLOCKQUOTE>
<P>
<DT><B></B><DD><P>As&iacute; lo que se consigue es montar un disquete, con sistema de
archivo MS-DOS (FAT), que est&aacute; en la primera disquetera (A: en DOS), en el 
directorio /mnt/floppy. Por supuesto se pueden montar m&aacute;s tipos de sistemas 
de ficheros en un disquette, no solo el FAT, est&aacute; el VFAT para disquetes de 
Windows 95, ext2 para disquetes de Linux, etc..
La segunda forma es con las utilidades mtools. Se utilizan comandos como los del DOS pero con 'm' delante. Estas utilidades solo funcionan para disquettes formateados con FAT. Por ejemplo:
<P>
<UL>
<LI>mdir</LI>
<LI>mdel</LI>
<LI>mformat</LI>
<LI>mrd</LI>
<LI>etc...</LI>
</UL>
<P>
<P>Estas utilidades suelen venir con todas las distribuciones actuales.
Si quieres m&aacute;s informaci&oacute;n... 'man fstab'.
<P>
</DL>
<P>
<H2><A NAME="ss2.4">2.4 Ahora no consigo leer el CDROM, antes s&iacute;...</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>Despues de instalar Linux desde el CDROM, me pregunt&eacute; si habr&iacute;a instalado
tambien el CD pero no consegu&iacute;a montarlo (mount -t iso9660 /dev/cdu31a
/cdrom -r (o algo as&iacute; es lo que pon&iacute;a)) y despu&eacute;s de echar un vistazo por
ah&iacute;, me di cuenta de que no exist&iacute;a el dispositivo /dev/cdu31a a pesar de
que en la instalacion "selectiva" le habia dicho que me lo instalara.
<P>
<DT><B>RESPUESTA</B><DD><P>Lo que ocurre es que los disquetes desde los que instalaste Linux tenian un
kernel con soporte para tu cdrom, pero luego, durante el proceso de
instalaci&oacute;n, pusiste un kernel sin soporte. Consigue las fuentes de un kernel
(normalmente en el CD de tu distribuci&oacute;n vendr&aacute; uno) y recompilalo con soporte
para ISO9660.
</DL>
<P>
<H2><A NAME="ss2.5">2.5 Deltree en Linux</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿Existe un comando equivalente al deltree del DOS en
Unix/Linux? Es decir, que me permita hacer borrados recursivos con un solo
comando.
<P>
<DT><B>RESPUESTA</B><DD><P>Ejecuta <CODE>$  rm -rf directorio_a_borrar</CODE> y antes
aseg&uacute;rate que no te equivocas de directorio, que aqu&iacute; no tenemos "undeletes"
y pi&eacute;nsalo muy bien antes de hacerlo como root!. Si lo que quieres es borrar
los directorios vac&iacute;os, aprovechando la potencia del comando 'find', se
puede hacer con la orden:
<P>
<BLOCKQUOTE><CODE>
<PRE>

    rm -rf `find . -type d -empty -print`
</PRE>
</CODE></BLOCKQUOTE>
<P>
<DT><B></B><DD><P>No confundir las comillas invertidas con las normales. Una vez m&aacute;s, es
aconsejable usar este comando con cuidado, y nunca desde el directorio raiz,
ya que hay algunos directorios muy importantes para el funcionamiento del
sistema y que pueden estar vacios ('/tmp', por ejemplo).
</DL>
<P>
<H2><A NAME="ss2.6">2.6 Transferencias de 32 bits en discos IDE</A>
</H2>

<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿Qu&eacute; tengo que hacer para que mi disco duro haga transferencias de 32 bits?
<P>
<DT><B>RESPUESTA</B><DD><P>Tan f&aacute;cil como instalar el programa <I>hdparm</I> y ejecutar
<P>
<BLOCKQUOTE><CODE>
<PRE>
# hdparm -c3 /dev/hdX
</PRE>
</CODE></BLOCKQUOTE>
<P>donde X es la letra del disco duro (hda, hdb, etc..).
</DL>
<P>
<H2><A NAME="ss2.7">2.7 Cambiar Linux de partici&oacute;n/disco.</A>
</H2>

<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿Como puedo mover Linux de un disco/partici&oacute;n a otro disco/partici&oacute;n sin perder datos y de manera segura?
<P>
<DT><B>RESPUESTA</B><DD><P>Es muy sencillo. Sigue estos pasos al pie de la letra:
<P>
<UL>
<LI>Crea la partici&oacute;n con el cfdisk (fdisk para los m&aacute;s desgraciados)
con el n&uacute;mero `hdaY' (Aconsejable rebootear luego).</LI>
<LI>La partici&oacute;n original era la `hdaX'.</LI>
<LI>Creas el sistema de ficheros en la partici&oacute;n:</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
   # mke2fs -b 1024 -c -v -L particion-linux /dev/hdaY
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Lo montas:</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
  # mount -t ext2 /dev/hdaY /mnt
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Desmonta las particiones DOS y otras cosas que no quieras copiar:</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
  # umount dos*
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Copia todos los ficheros a la nueva unidad:</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
  # (cd / &amp;&amp; tar cf - . --exclude mnt* ) | (cd /mnt &amp;&amp; tar xvfp -)
</PRE>
</CODE></BLOCKQUOTE>

El `--exclude mnt*' es imprescindible pues si no... luego de copiar
todos los directorios intentar&aacute; copiar /mnt/ en si mismo y entonces
se llenar&iacute;a el disco por segunda vez con lo mismo.
<P>Este m&eacute;todo de copiar est&aacute; bien pues copia todo: los devices, los
propietarios de los ficheros, los accesos,... A mi me funcin&oacute; sin
problemas.
<P>Metodos alternativos que no se han probado:
<P>
<BLOCKQUOTE><CODE>
<PRE>
  # cd / ; find . -print | cpio -pdm /mnt
  # cd / ; cp -a * /mnt
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Pasas a la nueva unidad:</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
  # cd /mnt
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Creas el directorio /mnt (no lo hab&iacute;amos copiado):</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
  # mkdir mnt
  # chmod 755 mnt
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Borras el contenido del directorio /proc:</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
   # rm -r proc/*
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Vas a `etc':</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
   # cd etc
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Editas el fichero `fstab' y cambias donde aparezca `hdaX' por 
`hdaY', y guardas los cambios.</LI>
<LI>Eliminas el fichero `mtab'</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
    # rm mtab
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Editas el fichero `lilo.conf' y vuelves a cambiar donde aparezca
`hdaX' por `hdaY'. Tambien puedes a&ntilde;adir a la lista de ficheros
nuevas entradas s&oacute;lo que ahora se refieran a la nueva unidad (que
cada uno escoja como vea).</LI>
<LI>Ejecutas el lilo para que guarde los cambios realizados:</LI>
</UL>

<BLOCKQUOTE><CODE>
<PRE>
     # lilo -r /mnt/
</PRE>
</CODE></BLOCKQUOTE>

<UL>
<LI>Reinicias y pruebas que tal funciona el linux en la nueva partici&oacute;n.</LI>
</UL>
 <BR>
<B>Es aconsejable no eliminar la partici&oacute;n antigua por si algo ha salido mal poder seguir teniendo el Linux accesible.</B>
</DL>
<P>
<HR>
<A HREF="FAQ-R34.LINUX-3.html">Página siguiente</A>
<A HREF="FAQ-R34.LINUX-1.html">Página anterior</A>
<A HREF="FAQ-R34.LINUX.html#toc2">Índice general</A>
</BODY>
</HTML>
