<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>FAQ de R34.LINUX: X-Window</TITLE>
 <LINK HREF="FAQ-R34.LINUX-7.html" REL=next>
 <LINK HREF="FAQ-R34.LINUX-5.html" REL=previous>
 <LINK HREF="FAQ-R34.LINUX.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-R34.LINUX-7.html">Página siguiente</A>
<A HREF="FAQ-R34.LINUX-5.html">Página anterior</A>
<A HREF="FAQ-R34.LINUX.html#toc6">Índice general</A>
<HR>
<H2><A NAME="s6">6. X-Window</A></H2>

<H2><A NAME="ss6.1">6.1 Arranque</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿C&oacute;mo arranco X-Window?. Si pongo <CODE>X</CODE> peta. La pantalla se queda gris con un aspa y el ordenador se queda bloqueado. Si en vez de hacer <CODE>X</CODE> hago
<CODE>openwin</CODE> s&iacute; funciona.
<P>
<DT><B>RESPUESTA</B><DD><P>No peta. Has arrancado el servidor de X-Window, pero ning&uacute;n cliente. En vez
de <CODE>X</CODE>, teclea <CODE>startx</CODE>. Esto arranca el servidor primero y a
continuaci&oacute;n el gestor <EM>fvwm</EM> (o el que tengas programado).
</DL>
<P>
<H2><A NAME="ss6.2">6.2 Configurar distintas resoluciones</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿Hay alg&uacute;n modo para poner la pantalla en 800x600? ¿O en otras resoluciones?
<P>
<DT><B>RESPUESTA</B><DD><P>Cerci&oacute;rate de que tanto tu monitor como tu tarjeta VGA pueden soportar el modo 
que deseas, y afina el XF86Config. Y mira la siguiente pregunta.
<P>
<BLOCKQUOTE><CODE>
<PRE>
[2]
</PRE>
</CODE></BLOCKQUOTE>
<P>
</DL>
<P>
<H2><A NAME="ss6.3">6.3 Cambiar de Resoluci&oacute;n y Terminal Virtual</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>Instalo y configuro X-Window, pero una vez dentro no me deja abrir otra
terminal (<CODE>ALT-[n]</CODE>) ni cambiar la resoluci&oacute;n.
<P>
<DT><B>RESPUESTA</B><DD><P>Para cambiar a una nueva consola de modo texto desde una sesi&oacute;n XWindow se
usa la combinaci&oacute;n <CODE>ctrl-alt-[Fx]</CODE> donde
<CODE>[Fx]</CODE> representa a cualquier tecla de funci&oacute;n.
<P>Para cambiar la resoluci&oacute;n al vuelo se usa <CODE>ctrl-alt-[+]</CODE> y
<CODE>ctrl-alt-[-]</CODE>, donde <CODE>[+]</CODE> y
<CODE>[-]</CODE> representan las teclas m&aacute;s y menos, en gris, del
teclado num&eacute;rico.
<P>
<BLOCKQUOTE><CODE>
<PRE>
[2]
</PRE>
</CODE></BLOCKQUOTE>
<P>
</DL>
<P>
<H2><A NAME="ss6.4">6.4 Capturar la pantalla</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿Como puedo capturar lo que me aparece en la pantalla?.
<P>
<DT><B>RESPUESTA</B><DD><P>Hay varias opciones, entre ellas:
<P>
<UL>
<LI>El programa <B>XV</B> permite capturar lo que tengamos visible en la
pantalla a un fichero. Pulsa el bot&oacute;n <B>Grab</B> y sigue las instrucciones.</LI>
<LI>Con el programa <B>xwd</B>.</LI>
<LI>Con el programa <B>xgrab</B>.</LI>
<LI>Con el programa <B>The GIMP</B>.</LI>
</UL>
<P>
</DL>
<P>
<H2><A NAME="ss6.5">6.5 Tildes en X-Window</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>No me salen las tildes en las X-Window, ¿qu&eacute; puedo hacer?.
<P>
<DT><B>RESPUESTA</B><DD><P>Pues hay un buen hombre franc&eacute;s que se ha encargado de solucionarnos el
problema. P&aacute;sate por su p&aacute;gina web 
<A HREF="http://web.fdu.fr/~tquinot/dead-keys.fr.html">http://web.fdu.fr/~tquinot/dead-keys.fr.html</A> 
y se acabar&aacute;n tus problemas. Hay que decir que esta librer&iacute;a solo funciona con XFree86 3.3.1. <BR>
<P>Otra soluci&oacute;n es utilizar este <EM>/etc/X11/Xmodmap</EM>:
<BLOCKQUOTE><CODE>
<PRE>
keycode 20 = apostrophe question backslash
keycode 21 = exclamdown questiondown asciitilde
keycode 22 = 0xff08
keycode 26 = e E eacute Eacute
keycode 30 = u U uacute Uacute
keycode 31 = i I iacute Iacute
keycode 32 = o O oacute Oacute
keycode 34 = dead_grave dead_circumflex bracketleft asciicircum
keycode 38 = a A aacute Aacute
keycode 48 = dead_acute dead_diaeresis braceleft
</PRE>
</CODE></BLOCKQUOTE>
</DL>
<P>
<H2><A NAME="ss6.6">6.6 Motif</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿Sab&eacute;is si en la distribuci&oacute;n de X va inclu&iacute;do <EM>Motif</EM> y sus librer&iacute;as de
programaci&oacute;n?
<P>
<DT><B>RESPUESTA</B><DD><P>No. Las <EM>Motif</EM> son de pago, al menos de momento. Hay varios porting para
Linux, incluso uno de dominio p&uacute;blico por acabar. Los precios oscilan entre
99 y 275 d&oacute;lares:
<P>
<DT><B>MooTiff (99$)</B><DD><P>LaserMoon <BR>
Fax : 44 0329-825936 <BR> 
orders@lasermoon.co.uk <BR>
<P>
<DT><B>Motif (275$)</B><DD><P>MetroLink <BR>
Fax: 1 305938-1982 <BR> 
sales@metrolink.com <BR>
<P>MooTiff es un poco "palido". Viene en un CDROM con un mont&oacute;n de ejemplos y
manuales en varios formatos, para principiantes es muy bueno. Por su parte,
Motif (de MetroLink) es un porting oficial de la OSF, muy s&oacute;lido y se
puede usar profesionalmente sin problemas. Ambos funcionan con XFree86 3.1
en adelante y son la version 2.0 de Motif.
<P>Hay un proyecto en marcha para hacer unas Motif de dominio publico
llamado <EM>Lesstif</EM>. Si tienes acceso a internet, busca por
<A HREF="http://www.hungry.com/products">http://www.hyngry.com/products</A>.
</DL>
<P>
<H2><A NAME="ss6.7">6.7 Sesi&oacute;n X-Window de manera remota.</A>
</H2>

<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿C&oacute;mo puedo ejecutar las X desde una sesion Telnet en WNT?
¿se necesita un soft de Telnet expecial?
<P>
<DT><B>RESPUESTA</B><DD><P>En lineas generales, se puede decir que hay dos maneras de iniciar una sesi&oacute;n
en X Windows de forma remota: ambas requieren del concurso de un programa
servidor de X (no cliente de X como se ha comentado en algunos mensajes)
corriendo en el host desde el cual se inicia la sesi&oacute;n (Windows NT en tu caso).
<P>La primera es la que se ha comentado aqu&iacute;, y consiste en, una vez dentro de la
m&aacute;quina deseada mediante telnet, rlogin o como sea, exportar la pantalla: para
eso se cambia el valor de la variable de entorno DISPLAY para que apunte al
servidor de X que estamos usando, esto es: si entro desde sirius.fie.us.es con
Windows a galileo.fie.us.es con UNIX, y quiero ejecutar aplicaciones en modo
gr&aacute;fico en galileo, la secuencia es:
<P><B>GALILEO</B>:
<BLOCKQUOTE><CODE>
<PRE>
$ export DISPLAY=sirius.fie.us.es:0.0
(o setenv DISPLAY dependiendo de la shell)
</PRE>
</CODE></BLOCKQUOTE>

El primer numero despues de los dos puntos es el n&uacute;mero de servidor que se
quiere usar en sirius (puede haber m&aacute;s de uno) y el segundo, el n&uacute;mero de
pantalla dentro de ese servidor (una vez m&aacute;s, puede haber m&aacute;s de una pantalla,
o escritorio en cada servidor). Normalmente, podremos usar :0.0
<P><B>SIRIUS</B>:
Hay que decirle al servidor X que demos permiso a Galileo para acceder al
servidor de X de Sirius. Si estuvieramos en una consola UNIX con X-Windows,
esto ser&iacute;a emitir el comando xhost +nombre_de_maquina, o sea
<BLOCKQUOTE><CODE>
<PRE>
$ xhost +galileo.fie.us.es
</PRE>
</CODE></BLOCKQUOTE>

o bien, para asegurarnos de que no va a haber problemas
<BLOCKQUOTE><CODE>
<PRE>
$ xhost +
</PRE>
</CODE></BLOCKQUOTE>

La segunda versi&oacute;n da permiso a cualquier m&aacute;quina para que muestre su salida
gr&aacute;fica en la nuestra, si es que alguien hace un export DISPLAY
correspondiente. Mucha gente usa la segunda versi&oacute;n, lo que lleva a veces a
situaciones comprometidas. Imagina la siguiente escena: una compa&ntilde;era (ilusa
ella, jijiji) en una consola hft (consola de IBM RS6000 bajo AIX 3.2.5)
corriendo las X-WIndows del sistema en una m&aacute;quina llamada, por ejemplo...
victim.fie.us.es, accede al Netscape de otro servidor con el m&eacute;tido expuesto.
Si usa xhost + para dar permiso, entonces un usuario mal&eacute;volo puede hacer
telnet a otra m&aacute;quina,... llam&eacute;mosla evil.fie.us.es (existe?) y realizar lo
siguiente:
<P><B>EVIL</B>:
<BLOCKQUOTE><CODE>
<PRE>
$ export DISPLAY=victim.fie.us.es:0.0
$ xv 17inch.jpg &amp;
</PRE>
</CODE></BLOCKQUOTE>

La salida gr&aacute;fica de este comando saldr&iacute;a en una hermosa ventana en
victim.fie.us.es. No me pregunteis de qu&eacute; va eso de 17 pulgadas... la chica a&uacute;n
est&aacute; traumatizada de la impresi&oacute;n...
<P>El segundo m&eacute;todo es usando <I>XDMP</I> (o algo as&iacute;). Consiste en decirle
al servidor
de X-Windows que busque un servidor de xdm en la m&aacute;quina a la que queremos
entrar por X-Windows. Si dicha m&aacute;quina (en nuestro caso, galileo) corre el
demonio xdm y el servidor X soporta este tipo de sesiones, aparecer&aacute; en nuestra
pantalla de Windows una bonita pantalla a tama&ntilde;o completo, la mayor&iacute;a de las
veces, del mensaje de bienvenida en modo gr&aacute;fico invit&aacute;ndonos a hacer un login.
Este cartel es el mismo que se ver&iacute;a desde la consola gr&aacute;fica del sistema
contra el que se realiza la sesi&oacute;n.
<P>Hay varios tipos de sesi&oacute;n XDM: XDMP-Query, XDMP-Indirect, XDMP-Broadcast. Las
diferencias estriban en c&oacute;mo se encuentra e inicia el contacto con la m&aacute;quina
cliente X (o sea, la m&aacute;quina en la que pretendemos usar programas X). Lo mejor
es usar la ayuda del programa servidor de X que estemos usando (Exceed, X-Win,
etc...)
<P>La ventaja de este m&eacute;todo sobre el anterior es que no se precisa haber entrado
con anterioridad por telnet, ni se necesita tocar la variable de entorno
DISPLAY. La desventaja es que la m&aacute;quina cliente X debe correr el demonio xdm
(que lio de clientes y servidores, verdad?)
</DL>
<P>
<HR>
<A HREF="FAQ-R34.LINUX-7.html">Página siguiente</A>
<A HREF="FAQ-R34.LINUX-5.html">Página anterior</A>
<A HREF="FAQ-R34.LINUX.html#toc6">Índice general</A>
</BODY>
</HTML>
