<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>FAQ de R34.LINUX: Configuraci&oacute;n</TITLE>
 <LINK HREF="FAQ-R34.LINUX-8.html" REL=next>
 <LINK HREF="FAQ-R34.LINUX-6.html" REL=previous>
 <LINK HREF="FAQ-R34.LINUX.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-R34.LINUX-8.html">Página siguiente</A>
<A HREF="FAQ-R34.LINUX-6.html">Página anterior</A>
<A HREF="FAQ-R34.LINUX.html#toc7">Índice general</A>
<HR>
<H2><A NAME="s7">7. Configuraci&oacute;n</A></H2>

<H2><A NAME="ss7.1">7.1 Impresora</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿C&oacute;mo doy de alta a una impresora en el sistema?...he probado con el setup,
pero no me dice nada de la impresora..:-?
<P>
<DT><B>RESPUESTA</B><DD><P>El tema de la impresora es muy extenso en Linux. Como gu&iacute;a, hace falta tener
soporte de impresora en el kernel, instalado el paquete <CODE>lpr</CODE>, configurado
<CODE>/etc/printcap</CODE> y una serie de filtros. Existe un programa llamado 
<EM>magicfilter</EM> que te ayudar&aacute; a configurar todo el tema de impresi&oacute;n en 
Linux. Lo mejor que se puede sugerir es:<BR>
<BLOCKQUOTE><CODE>
<PRE>
[8]
</PRE>
</CODE></BLOCKQUOTE>
</DL>
<P>
<H2><A NAME="ss7.2">7.2 Terminales</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿Se puede configurar Linux para admitir y reconocer un terminal tonto? ¿Y para
usar un viejo XT o un Amiga como tal?
<P>
<DT><B>RESPUESTA</B><DD><P>Se puede, por supuesto. Hay que tocar (muy poco) el fichero 
<CODE>/etc/inittab</CODE> y
usar uno de los puertos de la m&aacute;quina Linux para interconectarlo con el
terminal o el PC. En este &uacute;ltimo caso necesitas tambi&eacute;n un software emulador
de terminal, tal como un <B>TELIX</B> o <B>PROCOMM</B> si vas a trabajar desde MSDOS. No necesitas ni tener disco duro y el cable de uni&oacute;n no puede ser m&aacute;s sencillo, ya que solo tiene 3 hilos.
<P>
<BLOCKQUOTE><CODE>
<PRE>
db25    db25            db9     db25
2       3               2       2
3       2               3       3
7       7               5       7
</PRE>
</CODE></BLOCKQUOTE>
<P>En el lado Linux, y en el fichero <CODE>/etc/inittab</CODE>, a&ntilde;ade una l&iacute;nea
como esta, o parecida:
<P>
<BLOCKQUOTE><CODE>
<PRE>
S1:3456:respawn:/sbin/getty ttyS1 DT19200 wy75
</PRE>
</CODE></BLOCKQUOTE>
<P>Esa es la l&iacute;nea que tengo puesta en mi sistema. Para un terminal Wyse, si
quieres m&aacute;s informaci&oacute;n m&iacute;rate el serial-howto y/o 'man getty'.
Puedes usar el 'getty', el 'agetty' o cualquier otro... utiliza el que m&aacute;s
te guste.
<P><I>ttyS0</I> es COM1, <I>ttyS1</I> es COM2, etc. Una vez hecho esto, ejecuta
'init q'.
<P>
<BLOCKQUOTE><CODE>
<PRE>
[9]
</PRE>
</CODE></BLOCKQUOTE>
</DL>
<P>
<H2><A NAME="ss7.3">7.3 Acentos en bash</A>
</H2>

<P>
<P>
<DL>
<DT><B>PREGUNTA</B><DD><P>¿Alguien podr&iacute;a explicar c&oacute;mo arreglar el problema de las <I>&ntilde;</I> y los
acentos?.... me han hablado de un fichero <I>~/.inputrc/</I> que 
tengo localizado pero no tengo ni idea de que hacer con &eacute;l... o ... en mi linux no hay 
ning&uacute;n fichero de ese tipo as&iacute; que no puedo cambiarlo...
<P>
<DT><B>RESPUESTA</B><DD><P><I>~/.inputrc/</I> es un fichero de configuraci&oacute;n del shell bash. B&uacute;scalo en tu 
directorio HOME:
<P>
<BLOCKQUOTE><CODE>
<PRE>
ls ~/.inputrc 
</PRE>
</CODE></BLOCKQUOTE>
<P>Si no aparece, cr&eacute;alo con un editor e incluye las siguientes l&iacute;neas:
<P>
<BLOCKQUOTE><CODE>
<PRE>
set horizontal-scroll-mode on
set bell-style none
set meta-flag on
set output-meta on
set convert-meta off
"\e[3~" delete-char
"\e[4~" end-of-line
"\e[1~" beginning-of-line
"\e[2~"
"\e[5~"
"\e[6~"
"\e[[C": "mount /cdrom\C-m"
"\e[[D": "umount /cdrom\C-m"
"\e[[E": "startx > ~/x.out 2>&amp;1\C-m"
</PRE>
</CODE></BLOCKQUOTE>
<P>Con esto, no s&oacute;lo a&ntilde;ades acentos, sino funcionalidad completa en algunas
teclas de movimiento de cursor. Habr&aacute;s de copiar este fichero en el
directorio <I>home</I> de cada usuario que quieras que lo use. Lo que puedes hacer
es copiarlo en <CODE>/etc/skel</CODE> y as&iacute; cada vez que crees un nuevo usuario con
adduser, se copiar&aacute; de manera autom&aacute;tica a su directorio <CODE>home</CODE>. Tambi&eacute;n puedes ejecutar 
el comando <CODE>setfont</CODE> con las opciones <CODE>lat1-16, lat1-14, lat1-8</CODE>, etc... 
para cambiar el c&oacute;digo de caracteres y el tama&ntilde;o. Adem&aacute;s, con las 3 &uacute;ltimas lineas, defines
una acci&oacute;n para las teclas F3 (montar el cdrom), F4 (desmontar el cdrom) y F5 (ejecutar las X
y guardar la salida en un fichero). En este fichero puedes poner acciones a las teclas
que quieras (para saber los c&oacute;digos de escape de una tecla, pulsa Ctrl+V y luego la tecla
que quieras).
<P>Recomendado leer la p&aacute;gina de manual de bash (<CODE>man bash</CODE>). Hay muchas m&aacute;s
cosas que personalizar.
</DL>
<P>
<HR>
<A HREF="FAQ-R34.LINUX-8.html">Página siguiente</A>
<A HREF="FAQ-R34.LINUX-6.html">Página anterior</A>
<A HREF="FAQ-R34.LINUX.html#toc7">Índice general</A>
</BODY>
</HTML>
