<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>lf173, System Administration:  Construyendo ISPs escalables con software de c&oacute;digo abierto </TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://www.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://www.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Atif-Ghaffar.jpg" ALT="[Photo of the Author]" HEIGHT=115 WIDTH=124>
<BR>por  <A HREF="mailto:atif@developer.ch">Atif Ghaffar</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Atif es un camale&oacute;n. Cambia sus roles, desde Administrador de Sistemas, a programador, a profesor, a administrador de proyectos, a lo que quiera que sea necesario para realizar el trabajo.
<BR>
Ejerce permanentemente como Administrador de Desarrollo de Internet en <a href="http://www.4unet.net">4unet</a> y est&aacute; <a href="http://www.4unet.net/careers/">buscando empleo para gente con talento</a>.
<br>
Puedes encontrar m&aacute;s sobre &eacute;l en <a href="http://www.developer.ch/~aghaffar">,su homepage</a></P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">&iquest;Por qu&eacute; LDAP?</A></LI>
  <LI><A HREF="#lfindex1">&iquest;Qu&eacute; es ISPMan?</A></LI>
  <LI><A HREF="#lfindex2">&iquest;Qu&eacute; puede proporcionar este ISP?</A></LI>
  <LI><A HREF="#lfindex3">Dominios virtuales</A></LI>
  <LI><A HREF="#lfindex4">Potenciando nuestro ISP con software.</A></LI>
  <LI><A HREF="#lfindex5">Dise&ntilde;o de Directorio</A></LI>
  <LI><A HREF="#lfindex6">Autentificaci&oacute;n LDAP (sin sistema de cuentas)</A></LI>
  <LI><A HREF="#lfindex7">Manejando Dns via LDAP</A></LI>
  <LI><A HREF="#lfindex8">Configurando proftpd</A></LI>
  <LI><A HREF="#lfindex9">Ajustando Cyrus</A></LI>
  <LI><A HREF="#lfindex10">Ajustando Postfix</A></LI>
  <LI><A HREF="#lfindex11">Gestionando usuarios con ISPMan</A></LI>
  <LI><A HREF="#lfindex12">Escalando a m&aacute;s m&aacute;quinas</A></LI>
  <LI><A HREF="#lfindex13">suministrando correo web a los usuarios</A></LI>
  <LI><A HREF="#lfindex14">Recursos</A></LI>
  <LI><A HREF="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=173&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2> Construyendo ISPs escalables con software de c&oacute;digo abierto </H2>
 <IMG SRC="../../common/images/illustration173.gif" ALT="ispman" HSPACE=10 >
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

En Mi &uacute;ltimo art&iacute;culo te introduje en el uso de LDAP bajo Linux. Tuve muchas preguntas de gente que ten&iacute;a curiosidad de saber como LDAP combinado con alg&uacute;n afinado sovtware de c&oacute;digo abierto podian construir correo web o un sistema de hospedaje web.<p>
En este art&iacute;culo podremos iniciar un sistema ISP escalable basado en LDAP y Linux. Se tocar&aacute;n muchos de los problemas y preguntas hechas. Podremos entonces usar una utilidad llamada ISPMan para manejarlo o administrarlo.

<p>
Para evitar textos de longitud innecesaria con los ejemplos textuales, los he embebido en widgets de &aacute;rea de texto. si realmente quieres imprimir esta p&aacute;gina, salvala localmente y cambia el &aacute;rea de texto a pre tags.
<br>
Quz&aacute;s estas l&iacute;neas en Perl puedan hacer el truco.
<br><i>perl -pi.bak -e 's!textarea.*?>!pre>!g' filename</i><p>
Construir un ISP y administrarlo tiene su truco, especialmente si quieres hacerlo muy automatizado, altamente disponible y escalable. Poner en marcha un ISP requiere un equipo de administradores de sistemas, dedicados al funcionamiento de las m&aacute;quinas, creando cuentas, administrando sitios web, resolviendo problemas, ejecutando tareas de ayuda, etc.<br>
Muchas veces, la tarea de ayuda es peque&ntilde;a o no se controla al inicio. Muchas de las tareas de ayuda que recibo y toco necesitan necesitan desesperadamente de la ayuda.


</P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>&iquest;Por qu&eacute; LDAP?</H2>

<p>
LDAP es un directorio excelente. No solo puede manejar el nombre y password de los usuarios sino mucho m&aacute;s acerca de ellos y sus recursos.
Conforme avancemos, podremos ver como LDAP ayuda a manejar un mont&oacute;n de cosas de forma centralizada.
</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>&iquest;Qu&eacute; es ISPMan?</H2>

<p>
ISPMan es el software, lo he escrito, as&iacute; la gente del departamento de IT no se me equivocar&aacute; cuando necesiten crear un nuevo dominio, iniciar un nuevo servidor web o cambiar una entrada a un DNS. ISPMan es software de c&oacute;digo abierto y est&aacute; disponible en <a href="http://www.ispman.org">http://www.ispman.org</a>. Quise probar a explicar m&aacute;s acerca de ISPMan en s&iacute; mismo pero voy atrasado. Sientete libre para probarlo y mejorarlo.
</p>



<A NAME="lfindex2">&nbsp;</A>
<H2>&iquest;Qu&eacute; puede proporcionar este ISP?</H2>

<p>
Este ISP puede proporcionar DNS, correo, correo web, hospedaje web, etc.<br>
<br>
La idea es que un cliente llegue y quiera hospedar el dominio "exampledomain.com".
<br>
Este dominio se crea centralizadamente con tan solo unos clicks y un mont&oacute;n de magia es administrada entre las escenas incluyendo creaci&oacute;n DNS, creaci&oacute;n del servidor virtual para correo y un servidor web virtual.
<br>El cliente tiene un nombre de usuario ftp para acceder a su/sus servidor/es web/ftp. Se puede crear cualquier n&uacute;mero de usuarios dentro del dominio para acceso al correo electr&oacute;nico. Los usuarios dentro del dominio pueden o no recibir espacio web.<p>
Ah&iacute; est&aacute; tambi&eacute;n el n&uacute;mero suministrado de acceso a internet. Debe ser un proceso sencillo y directo o se complicar&aacute; realmente, eso lo tocaremos en este art&iacute;culo :).
</p>


<A NAME="lfindex3">&nbsp;</A>
<H2>Dominios virtuales</H2>

<p>
Cada uno quiere un sitio web y su propio dominio de direcciones de correo electr&oacute;nico. El servidor de correo electr&oacute;nico ha sido ligado extra&ntilde;amente al sistema de cuentas para correos electronicos. No me gusta.
<br>
El problema reside en los m&uacute;ltiples niveles cuando quieres manejar user1@domain1.com y user1@domain2.ch etc.<br> Hay un mont&oacute;n de mapeados innecesarios etc para hacer. Felizmente el software futuro podr&aacute; escribirse recordando los nombres de dominio.
<br>
Por ejemplo, Cyrus, un servidor IMAP excelente. Cyrus administra buzones de correo (no usuarios). Solo dejar&iacute;a que un buz&oacute;n tuviese el nombre "aghaffar". Si tengo otro cliente que desde el dominio "linuxrus.com" acceda a un nombre de usuario "aghaffar", he tenido mala suerte. Tengo que crear un buz&oacute;n con otro nombre y mapear al usuario a ese buz&oacute;n. Otro truco podr&iacute;a ser crear un usuario "aghaffar.linuxrus.com" pero Cyrus ha usado "." como delimitador del buz&oacute;n, as&iacute; que no se puede usar, ni puedo usar "aghaffar@linuxrus.com".
<p>
Anotese tambien que no todos nosotros vivimos en US. Un mont&oacute;n de ejemplos en algunas listas de correo sugieren user1@domain1 y user1@domain2. Ellos esperan que todos los nombres de dominio terminen en .com. De esta forma tendremos que mantener la pista de "username" "domain" "TLD"(Top Level Doamin).
<p>
Nuestro dise&ntilde;o debe tener todo esto en cuenta.
<p>
As&iacute; en lugar de crear un usuario llamado "aghaffar", debemos crear usuarios de esta forma. "username_domain_tld".
<br>Realemente no recuerdo por qu&eacute; he usado "_" como delimitador, pero "." no estaba disponible por lo de Cyrus, y ah&iacute; tuve otros problemas con otros delimitadores, por ejemplo "&" es una mala conjunci&oacute;n para shells y URLs.
</p>

<A NAME="lfindex4">&nbsp;</A>
<H2>Potenciando nuestro ISP con software.</H2>

<p>
Esta es una lista de software que ha sido agradable de usar. Si quieres puedes usar otro, siempre que te funcione.
<p>
<ul>
  <li>openLDAP (el servidor LDAP)
  <li>Postfix (el r&aacute;pidisimo servidor SMTP de LDAP)
  <li>Cyrus imapd (un excelente servidor IMAP/POP3)
  <li>Cyrus SASL (librer&iacute;a de autentificaci&oacute;n usada por Cyrus imapd)
  <li>Apache (no digo nada)
  <li>Proftpd (un excelente servidor servidor ftp LDAP que yo sepa)
  <li>Perl (vamos, &iquest;creeis que podr&iacute;a haber hecho algo sin perl?)
  <li>ISPMan (Software escrito en este dise&ntilde;o para usar ISPs)
  <li>Bind (El pap&aacute; del DNS)
  <li>pam_ldap (modulo para autentificaci&oacute;n ldap)
  <li>IMP 2.2 (un excelente cliente de correo web basado en PHP)
</ul>

</p>


<A NAME="lfindex5">&nbsp;</A>
<H2>Dise&ntilde;o de Directorio</H2>

<p>
Nuestro directorio est&aacute; basado en dominios. Hay dominios, dominio de usuarios, dominio de servicios, etc.
<br>Por ejemplo, un usuario puede solo existir en un dominio (excepto algunos usuarios del sistema como el administrador LDAP, el administrador Cyrus, etc)
<br>una rama del dominio tiene informaci&oacute;n sobre los usuarios de ese dominio, los datos DNS del dominio, los datos http del dominio, etc, etc.
<br>Ejemplo<p>
<form>
<textarea cols=60 rows=10>
o=ispman
objectclass=top
objectclass=organisation
o=ispman

  domain=developer.ch, o=ispman
  domain=developer.ch
  objectclass=top
  objectclass=dnsdomain
  objectclass=posixAccount
  uid: developer.ch
  uidNumber: 2000
  gidNumber: 1000
  homeDirectory: /home/developer.ch
  userPassword: {crypt}XXffGGHH
  loginShell: /bin/bash

    ou=users, domain=developer.ch, o=ispman
    domain=developer.ch
    ou=users
    objectclass=top
    objectclass=domainusers

    ou=dnsdata, domain=developer.ch, o=ispman
    domain=developer.ch
    ou=dnsdata
    objectclass=top
    objectclass=domainrelatedobject

    ou=httpdata, domain=developer.ch, o=ispman
    ou=httpdata
    objectclass=top
    objectclass=httpdata
    serverroot=/home/httpd/virtual/developer.ch
</textarea></form>
<p>
Aqu&iacute; hemos definido una rama para el dominio "developer.ch", esta rama tiene subramas para usuarios, datos dns y datos http.


<br>
En este ejemplo, el haber definido un directorio home uid, gid, para el dominio etc, causa que queramos solo el usuario "domain.tld" para acceder via ftp.<br>
Por ejemplo, si el cliente que usa developer.ch quiere descargar ficheros a su directorio, debe acceder como usuario "developer.ch" y dar el password apropiado para acceder al servidor ftp el cual podr&aacute; finalmente dar acceso al directorio home.. etc.. etc.. mas sobre esto despu&eacute;s.
<br><br>
Para otros usuarios, no definiremos uid, gid, etc porque no querremos entrarlos via ftp.


<br>Podr&aacute;s encontrar un <a href="../../common/src/article173/example.ldif.txt">ejemplo completo de fichero LDIF aqu&iacute;</a> (este fichero estar&aacute; obsoleto debido a su maquina de producci&oacute;n, y he a&ntilde;adido caracter&iacute;sticas etc en el nuevo dise&ntilde;o) o usa <a href="http://www.ispman.org/ldapdata.php3">este link</a> si deseas ense&ntilde;arselo a tu jefe (tambi&eacute;n un poco desfasado).


</p>

<A NAME="lfindex6">&nbsp;</A>
<H2>Autentificaci&oacute;n LDAP (sin sistema de cuentas)</H2>

<p>
Otra gran cosa es que no tenemos que crear ning&uacute;n sistema de cuentas en /etc/passwd, /etc/shadow etc o manejar NIS etc.
<br>
Todas las cuentas son manejadas en LDAP y la autentificaci&oacute;n se har&aacute; directamente desde LDAP.<br>Para este truco tomamos un monton de ayuda de PAM (Pluggable Authentification Module) pam_ldap.
PAM te deja definir que modulo debe tener cuidado de la autentificaci&oacute;n, autorizaci&oacute;n, etc.
<p>
Por ejemplo, mis archivos /etc/pam.d/imap, /etc/pam.d/pop y /etc/pam.d/proftpd dicen<br>
<pre>
#%PAM-1.0
auth       sufficient   /lib/security/pam_ldap.so
account    sufficient   /lib/security/pam_ldap.so
</pre>
Ahora todas las autentificaciones imap/pop3/ftp son manejadas por el servidor Ldap.
As&iacute; el usuario aghaffar_developer_ch toma autentificaci&oacute;n y toma sus correros una vez piense que no existen en el sistema o registros nis o passwd.

</p>

<A NAME="lfindex7">&nbsp;</A>
<H2>Manejando Dns via LDAP</H2>

<p>
  DNS no tiene por el momento un back end LDAP, y quiz&aacute;s no sea una buena idea tener un backend LDAP para DNS excepto por el DNS Dynamica el cual se usa en conjunci&oacute;n con DHCP. De alguna manera, usaremos LDAP para almacenar informaci&oacute;n acerca del DNS y entonces extraerla para crear los ficheros de zona DNS. Esto nos permitir&aacute; manejar cada cosa centralmente desde una m&aacute;quina segura, mientras no hagamos cambios en el DNS.
<p>
Las entradas DNS en el LDAP se ven as&iacute;
<table>
<tr>
<td bgcolor=antiquewhite>
<pre>
dn: ou=dnsdata, domain=4unet.net, o=ispman
domain: 4unet.net
ou: dnsdata
objectclass: top
objectclass: domainrelatedobject
objectclass: posixAccount
uid: 4unet.net
uidNumber: 2000
gidNumber: 1000
homeDirectory: /home/4unet.net
userPassword: {crypt}XXffGGHH
loginShell: /bin/true
</pre>
</td>
<td>
La definici&oacute;n se extiende por los datos DNS. Tambien se define un cuenta Posix (un usuario) con el mismo nombre que el dominio.
Este usuario es del tipo webmaster, quien puede acceder via ftp cargar archivos a las areas designadas, etc.

</td>
</tr>

<tr>
<td bgcolor=antiquewhite>
<pre>
dn: cn=soarecords, ou=dnsdata, domain=4unet.net, o=ispman
cn: soarecords
primary: ns1.4unet.net
ou: dnsdata
retry: 1800
rootmail: dnsmaster.4unet.net
domain: 4unet.net
minimum: 432000
objectclass: top
objectclass: domainRelatedObject
expire: 1209600
refresh: 21600
</pre>
</td>
<td>
Esto define los registros SOA para la DNS para 4unet.net.<br>
Un script es reponsable de extraer los valores y formatearlos en registro SOA dentro de un DNS para ser incluido en el fichero zona.
</td>
</tr>

<tr>
<td bgcolor=antiquewhite>
<pre>
dn: cn=nsrecords, ou=dnsdata, domain=4unet.net, o=ispman
domain: 4unet.net
cn: nsrecords
ou: dnsdata
objectclass: top
objectclass: domainRelatedObject
record: @,ns1.4unet.net
record: @,ns2.4unet.net
</pre>
</td>
<td>
Y estos son los registros NS.
<br>
Un script puede grabar todos los atributos del registro, y dividirlos por caracteres "," y tomar el objeto y nombre de sevidor para ser a&ntilde;adido al nombre de zona.
</td>
</tr>

<tr>
<td bgcolor=antiquewhite>
<pre>
dn: cn=mxrecords, ou=dnsdata, domain=4unet.net, o=ispman
domain: 4unet.net
cn: mxrecords
ou: dnsdata
objectclass: top
objectclass: domainRelatedObject
record: @,10, mx1.4unet.net
record: @,100, mx2.4unet.net
</pre>
</td>
<td>
Tal como antes, pero esta vez registros MX.
<br>Estos registros tambien contienen el campo prioritario que est&aacute; ajustado de acuerdo a los registros MX del fichero de zona.
</td>
</tr>
<tr>
<td bgcolor=antiquewhite>
<pre>
dn: cn=arecords, ou=dnsdata, domain=4unet.net, o=ispman
objectclass: top
objectclass: domainRelatedObject
domain: 4unet.net
cn: arecords
ou: dnsdata
record: ns1, 193.247.80.43
record: ns2, 193.247.80.44
record: @,193.247.80.43
record: @,193.247.80.44
</pre></td>
<td>
Estos son los registros A, simplemente host, mapeos de direcciones ip.
</td>
</tr>

<tr>
<td bgcolor=antiquewhite>
<pre>
dn: cn=cnames, ou=dnsdata, domain=4unet.net, o=ispman
objectclass: top
objectclass: domainRelatedObject
domain: 4unet.net
cn: cnames
ou: dnsdata
record: ftp, www
record: mail, www
record: *, www
</pre>
</td>
<td>
Y los CNAMES o Alias para los hosts.
</td>
</tr>
</table>
Todos estos scripts estan disponibles con el paquete ISPMan. Echa un vistazo a la captura de pantalla para ver como modificar un registro NS <a href="http://www.ispman.org/screenshots.php3?screenshot=ns">
</a>
</p>


<A NAME="lfindex8">&nbsp;</A>
<H2>Configurando proftpd</H2>

<p>
Necesitas tener proftpd con el modulo LDAP instalado. Si quieres correr ftp con servidores virtuales, etc, y si piensas que estar&aacute; muy ocupado deber&aacute;s ejecutarlo como un proceso en solitario en lugar que desde inetd.
<br>
Comenta las lineas ftp desde tu inetd.conf y recarga el demonio inetd.<br>
crea un grupo con el gid 1000 llamado ftponly. podemos dar este gid a todos los dominios.
<p>

edita tu /etc/pam.d/proftpd como se mostr&oacute; anteriormente en la secci&oacute;n de autentificaci&oacute;n LDAP.<br>
En tu /etc/proftpd.conf debe verse algo como esto.
<br>
<form>
<textarea cols=60 rows=10>
ServerName      "developer connections"
ServerType      standalone
ServerAdmin     atif@developer.ch

DeferWelcome      off
DefaultServer     on

Port        21
Umask       022

User        nobody
Group       nogroup

&lt;Directory /*>
  AllowOverwrite    on
&lt;/Directory>

PathAllowFilter ".*/[a-zA-Z0-9]+$"
PathAllowFilter ".*/[a-zA-Z0-9_\.\-]+$"

PathDenyFilter "(\.ftpaccess)|(\.htaccess)$"

MaxInstances                   30
UseReverseDNS        off
IdentLookups         off
TimeoutStalled                  300

ScoreboardPath       /var/run/proftpd
TransferLog          /var/log/proftpd.xfer_log
DefaultRoot ~/ ftponly
MaxLoginAttempts                3

LDAPServer         "localhost"
LDAPPrefix         "o=ispman"
</textarea>
</form>
<p>


Para ejecutar proftpd, debes escribir /usr/sbin/proftpd
y para matarlo, killall /usr/sbin/proftpd

</p>

<A NAME="lfindex9">&nbsp;</A>
<H2>Ajustando Cyrus</H2>

<p>
Compila e instala Cyrus SASL e imapd, y los clientes c-sdk de UW-IMAP. El IMAP, los clientes  sdk deben de ser instalados en tu sistema. Prueba primero rpm -aq | grep imap. Si dudas, compila e instala una nueva versi&oacute;n.

Crea un usuario del sistema llamado cyrus y un grupo de correo, sigue las instrucciones de instalaci&oacute;n y comprueba que tu servidor imap est&eacute; trabajando.
Una vez est&eacute; trabajando simplemente selecciona /etc/pam.d/imap como se mostr&oacute; anteriormente en la secci&oacute;n de autentificaci&oacute;n de LDAP.
<p>
Puedes necesitar crear un usuario llamado cyrus o el que admin te de para /etc/imapd.conf en  el directorio LDAP.

<br>
Por ejemplo si tu admin cyrus es llamado "cyrus", entonces deber&iacute;as tener una entrada como la que sigue en tu directorio ldap.
<pre>
dn: uid=cyrus, ou=admins, o=ispman
cn: Cyrus Admin
sn: Cyrus
objectclass: top
objectclass: systemadmins
uid: cyrus
userpassword: XXDDCCYY
ou: admins
</pre>
ISPMan puede hacer esas entradas por t&iacute; durante los ajustes.

</p>

<A NAME="lfindex10">&nbsp;</A>
<H2>Ajustando Postfix</H2>

<p>
Postfix es muy amigable para LDAP. Puedes construir un dominio virtual y consultas virtuales de usuarios directamente en LDAP as&iacute; no tendr&aacute;s que especificar para que dominios debes de recibir correos.<br> Por ejemplo, si un correo llega para el dominio "perl.ch", deber&iacute;as mirar en todos los dominios y ver si hay un dominio llamado "perl.ch", si est&aacute; entonces debes aceptar el correo en lugar de devolverlo.
<p>
Mi /etc/postfix/main.cf se ve como este
<form><textarea cols=60 rows=10>
queue_directory = /var/spool/postfix
program_directory = /usr/lib/postfix
command_directory = /usr/sbin
daemon_directory = /usr/lib/postfix
mail_owner = postfix
default_privs = nobody
myhostname = mozilla.developer.ch
mydomain = developer.ch
myorigin = $mydomain
inet_interfaces = all
default_transport = smtp

# El siguiente mapa toma el dominio desde LDAP para ver
# si debe aceptar correos para este dominio
mydestination = /etc/postfix/destination, ldap:ldapdomain
ldapdomain_server_host = localhost
ldapdomain_server_port = 389
ldapdomain_bind_dn = o=ispman
ldapdomain_search_base = o=ispman
ldapdomain_query_filter = (&(objectclass=dnsdomain)(domain=%s))
ldapdomain_result_attribute = domain


# Estos mapas echan un vistazo a ldap para ver si hay una
# entrada llamada mailacceptinggeneralid que valide la direcci&oacute;n.

# Por ejemplo, llega correo para atif@developer.ch, el servidor ldap
# ha buscado mailacceptinggeneralid=atif@developer.ch
# si lo encuentra, entonces responde el atributo resultante "maildrop"
# Esto debe devolver una direcci&oacute;n local o remota.
# en mi caso devuelve atif_developer_ch@mozilla, que significa dejar el
# correo en el buzon llamado "atif_developer_ch" en el host "mozilla"
virtual_maps = hash:/etc/postfix/virtual, ldap:ldapvirtual
ldapvirtual_server_host = localhost
ldapvirtual_server_port = 389
ldapvirtual_bind_dn = o=ispman
ldapvirtual_bind = no
ldapvirtual_timeout = 5
ldapvirtual_search_base = o=ispman
ldapvirtual_query_filter = (mailacceptinggeneralid=%s)
ldapvirtual_result_attribute = maildrop
ldapvirtual_lookup_wildcards = no

relocated_maps = hash:/etc/postfix/relocated
smtpd_sender_restrictions = hash:/etc/postfix/access

transport_maps = hash:/etc/postfix/transport

mailbox_transport = cyrus
best_mx_transport = local

virtual_domains=/etc/postfix/virtual
relay_domains = $mydestination, $virtual_domains

smtpd_banner = $myhostname ESMTP $mail_name ($mail_version)

local_destination_concurrency_limit = 2
default_destination_concurrency_limit = 10
</textarea></form>
<p>

</p>


<A NAME="lfindex11">&nbsp;</A>
<H2>Gestionando usuarios con ISPMan</H2>

<p>
Gestionar usuarios con ISPMan es facil. La creaci&oacute;n de un usuario consiste en dos pasos
<ol>
<li>creaci&oacute;n de una entrada en la base de datos LDAP
<li>creaci&oacute;n de un buz&oacute;n en el servidor IMAP
</ol>
Borrando un usuario, borrado de ambas entradas por t&iacute;.
</p>


<A NAME="lfindex12">&nbsp;</A>
<H2>Escalando a m&aacute;s m&aacute;quinas</H2>

<p>
  ISPMan deja crear buzones de correo para los usuarios para cualquier m&aacute;quina en tu oficina de correo. Por ejemplo, puedes tener mail1, mail2, mail3, mail4, etc, cada una manejando 10.000 usuarios. Usando el combo LDAP + Postfix + Cyrus, puedes gestionar correo para cualquiera de las maquinas internas.
<br>Por ejemplo. el correo llega para bob@developer.ch, Postfix responde al servidor ldap para devolver el maildrop para la entrada que deja mailacceptinggeneralid=bob@developer.ch, y el servidor LDAP devuelve bob@mail5.developer.ch. El correo es entonces redirigido a la m&aacute;quina llamada mail5 en tu oficina de correos.
<p>
Paralelamente he trabajado con algunos clientes en un proxy IMAP/pop3 que corria en el frontend de los servidores de correo en pop3 y en puertos imap y redireccionaba las respuestas de forma transparente a las m&aacute;quinas internas. As&iacute; tus usuarios sabr&aacute;n solo una direcci&oacute;n. Por ejemplo mail.developer.ch o pop.developer.ch para conectar para en lugar de conocer cual servidor de correo contiene su correo.
</p>


<A NAME="lfindex13">&nbsp;</A>
<H2>suministrando correo web a los usuarios</H2>

<p>
IMP es un gran producto para proporcionar correo web a los usuarios.<br>

Puedes seleccionar un alias de correo.* en el httpd.conf de apache para apuntar a la instalaci&oacute;n IMP central.<p>
Por ejemplo el siguiente es desde mi instalaci&oacute;n<br>
<form><textarea cols=60 rows=10>

&lt;VirtualHost 195.61.45.153>
    ServerName mail.webcv.ch
    ServerAlias mail.*
    UseCanonicalName off
      DocumentRoot /www/virtual/mail.webcv.ch/htdocs/horde/imp
      Alias /horde /www/virtual/mail.webcv.ch/htdocs/horde
      Alias /imp /www/virtual/mail.webcv.ch/htdocs/horde/imp
        AddType application/x-httpd-php3 .php3
        DirectoryIndex index.html index.php3
        Options Indexes FollowSymLinks
        php3_include_path  /www/virtual/mail.webcv.ch/htdocs/horde:/www/virtual/mail.webcv.ch/php
        php3_auto_prepend_file /www/virtual/mail.webcv.ch/php/prepend.php3
        php3_magic_quotes_gpc Off
        php3_magic_quotes_runtime Off
        RewriteEngine on
        RewriteOptions inherit
        TransferLog /www/logs/mail.webcv.ch_access
        ErrorLog /www/logs/errors/mail.webcv.ch_error
&lt;/VirtualHost>
</textarea>
</form>
<p>

Estoy trabajando en una versi&oacute;n ligeramente modificada de IMP que puede manejar los casos siguientes.
<ul>
<li>Tomados los nombres cortos de usuario (aghaffar en lugar de of aghaffar_developer_ch) y creados los nombres completos de usuario para autentificaci&oacute;n de acuerdo a la URL que tenga el usuario. Por ejemplo, si el usuario aghaffar est&aacute; entrando a http://mail.developer.ch, entonces el nombre de usuario ser&iacute;a aghaffar_developer_ch, y si el usuario atif entra a http://mail.perl.ch entonces el nombre de usuario == atif_perl_ch.
<li>redirecciona al servidor de correo interno de acuerdo a la respuesta dada desde LDAP
<li>Los cambios menores en los nombres de usuario son almacenados en el libro de direcciones etc para manejar multiples hosts en la m&iacute;sma m&aacute;quina.
</ul>

De este modo puedes dejar a tus clientes leer correos electr&oacute;nicos simplemente visitando http://mail.their.domain
</ul>

</p>

<A NAME="lfindex14">&nbsp;</A>
<H2>Recursos</H2>

<p>

<DL>
    <Dt>
        <A HREF="http://www.padl.com/pam_ldap.html">PAM LDAP Module</a>
    </dt>
    <Dd>
	El m&oacute;dulo pam_ldap suministra la forma para que las estaciones de
	trabajo Solaris y Linux autentifiquen de nuevo los directorios LDAP,
	y para cambiar sus passwords en el directorio.
    </dd>

    <DT>
        <A HREF="http://www.openldap.org/">openLDAP</a>
    </dt>
    <DD>
	El proyecto OpenLDAP es un esfuerzo de colaboraci&oacute;n para construir un
	robusto, en cierto grado comercial, completo y de c&oacute;digo abierto suite
	de aplicaciones y utilidades de programaci&oacute;n. El proyecto ha sido
	gestionado por una comunidad mundial de usuarios que usan Internet para
	para comunicarse, planear, y construir la Suite OpenLDAP y su relatada
	documentaci&oacute;n.
    </dd>

    <DT>
        <A HREF="http://www.postfix.org">Postfix</a>
    </dt>
    <dd>
      El excelente servidor SMTP
    </dd>

    <dt><a href="http://asg.web.cmu.edu/cyrus/">libreria Cyrus SASL e imapd</a></dt>
    <dd>
    El proyecto de correo electr&oacute;nico Cyrus est&aacute; continuando para construir una iniciativa altamente escalable de sistema de correo dise&ntilde;ado para usar en peque&ntilde;a o gran empresa usando tecnologias basadas en standards. Las tecnologias Cyrus pueden escalar desde uso independiente en peque&ntilde;os departamentos a un sistema centralizado gestionado en una gran empresa.</dd>

  <dt><a href="http://www.ispman.org">ISPMan (el asesino de Exchange)</a></dt>
  <dd>El software para gesti&oacute;n del ISP fue puesto por m&iacute; en este art&iacute;culo</dd>

  <dt><a href="http://www.proftpd.net">proftpd</a>
  </dt>
  <dd> Un servidor ftp seguro</dd>
</DL>


</p>



<!-- vim: set sw=2 ts=2 et: -->

<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=173&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Atif Ghaffar, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://www.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article173.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:atif@developer.ch"><FONT COLOR="#FFFFFF">Atif Ghaffar</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:jbalmes@teleline.es"><FONT COLOR="#FFFFFF">Jes&uacute;s Balmes Ruiz</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-10-02, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
