<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_1.8">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>Administraci&oacute;n de sistemas : Gu&iacute;a de instalaci&oacute;n de Slackware 7.0. Parte I.</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG src="../../common/images/Jeffry-D.jpg" width="200" height="288" alt="[Jeffry Degrande]">
<BR>por  <A HREF="mailto:suzuki@village.uunet.be">Jeffry Degrande</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P></P>
<P><FONT COLOR="#336633">Contenidos</FONT>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Preparando la instalaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex2">Particionado</A></LI>
  <LI><A HREF="#lfindex3">Instalaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex4">Configuraci&oacute;n</A></LI>
  <LI><A HREF="#lfindex5">Informaci&oacute;n adicional</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=154&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Gu&iacute;a de Instalaci&oacute;n de Slackware 7.0. Parte I</H2>
 <IMG src="../../common/images/illustration154.jpg" width="238" height="63" hspace="" lt="[Slackware]"><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
<P>Este art&iacute;culo intenta echar una mano a todos aquellos que pretendan instalar Slackware 7.0.
<P>El art&iacute;culo en holand&eacute;s fue publicado originalmente en
<A href="http://www.linux.be">www.linux.be</A>, y el autor nos dio su permiso para republicarlo
en Linux<font color="red">Focus</font>. Aunque hay que recordar que la versi&oacute;n actual de Slackware es la 7.1, no la 7.0.

</P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

<P>
Decid&iacute; usar <A href="#info">Slackware</A> porque en realidad no me gusta la llamada &aacute;migabilidad' que
proporcionan distribuciones como <A href="#info">Suse</A> o <A href="#info">Redhat</A>.
La principal ventaja de Slackware es que &uacute;nicamente instalar&aacute;s los programas que realmente necesitas.
Suse es especialmente buena a la hora de incorporar un monton de cosas que no necesitas, sin mencionarte
una s&oacute;la palabra sobre ello. Y, en mi opinion, Slackware tampoco tiene mucho que aprender para llegar
a ser &aacute;migable '.

<P>
Iremos avanzando a trav&eacute;s de los pasos m&aacute;s imprtantes del proceso de instalaci&oacute;n, hasta obtener un sistema
en funcionamiento. En el pr&oacute;ximo art&iacute;culo, entraremos a describir la configuraci&oacute;n y administraci&oacute;n de un
sistema Slackware. Ahora &iexcl; instal&eacute;moslo &iexcl;.

<A NAME="lfindex1">&nbsp;</A>
<H2>Preparando la instalaci&oacute;n</H2>

<P>
Si eres afortunado y tu BIOS te ofrece la posibilidad de botar desde el CD-ROM, puedes saltarte esta secci&oacute;n.
En ese caso, aseg&uacute;rate de que la opci&oacute;n est&aacute; activada, coloca el cdrom y arranca tu ordenador.

<P>
Sin embargo, cuando no puedes botar desde el cdrom, tienes que crear tu mismo tus discos de arranque.
Bajo DOS resulta sumamente f&aacute;cil. Consigue dos discos formateados (en perfecto estado, aseg&uacute;rate de que no
tengan sectores da&ntilde;ados). El primero el disco de arranque (bootdisk) se usar&aacute; para arrancar el kernel, y
el otro cargar&aacute; (el ra&iacute;z, rootdsk) el resto del sistema. En el directorio <TT>rootdsks</TT> hay un peque&ntilde;o
programa llamado <TT>rawrite.exe</TT> que puedes usar para escribir ambos discos. Lo que escribiras en el
disco ra&iacute;z lo puedes encontrar en el mismo directorio, almacenado en ficheros con extensi&oacute;n .gz. <TT>color.gz</TT>
servir&aacute; en la mayor parte de los casos, aunque debes leer <TT>rootdsks/README.TXT</TT> si tu caso es especial.
<br>
En cualquier caso, leer los ficheros <TT>readme</TT> es algo que siempre deber&iacute;as hacer.

<P>
Para crear el disco raiz (rootdisk) usa el siguiente comando
<br>
<PRE>
        C:\> RAWRITE COLOR.GZ A:
</PRE>
y etiqu&eacute;talo como &quot;Rootdisk&quot; o algo parecido.

<P>
En el directorio <TT>bootdsks.144</TT> hay varios ficheros terminados en <TT>.i</TT> .
Se usan para hacer el segundo disco, el de arranque (bootdisk). En la mayor parte de los sistemas
IDE funcionar&aacute; <TT>bare.i</TT>, que es el est&aacute;ndar. Lee los ficheros de texto si no funciona en tu
caso. Ahora procedamos a hacer el disco
<PRE>
        C:\> RAWRITE BARE.I A:
</PRE>
y etiquet&eacute;moslo como &quot;Bootdisk&quot;.

<P>
Ahora podemos rebotar (indicando a la bios que arranque desde a:) y colocar el disco de arranque
(bootdisk). Cambialo por el ra&iacute;z (rootdsks) cuando se solicite.

<A NAME="lfindex2">&nbsp;</A>
<H2>Particionado</H2>

<P>
Ahora tenemos un sistema arrancado, ha llegado el momento de empezar la instalaci&oacute;n real. Empezamos
entrando como root (como no es la aut&eacute;ntica cuenta de root, no tendr&aacute;s que escribir la password).

<P>
El siguiente paso no es tan f&aacute;cil (m&aacute;s a&uacute;n, es divertido :-)

<P>
Necesitamos hacer particiones independientes para Linux en nuestro disco duro. Para ello, tendremos que
usar <TT>fdisk</TT> o <TT>cfdisk</TT>.  &quot;fdisk&quot; es algo m&aacute;s complicado de manejar, pero tiene
las mejores capacidades. &quot;cfdisk&quot; es bastante f&aacute;cil y hace lo que quieres hacer.

<BLOCKQUOTE>
<P>
(Asumimos que tienes Windows en tu partici&oacute;n primaria (aunque yo recomendar&iacute;a borrarlo ;) y que el resto
de tu espacio de disco est&aacute; libre. Hay m&uacute;ltiples paquetes de software que te permiten reparticionar tus
discos. Puedes encontrar m&aacute;s sobre esto en el <A href="#info">Partition HOWTO</A>, o puedes leer alg&uacute;n
<A href="#info">articulo de Linux<font color="red">Focus</font> </A> que trate sobre ello.)
</BLOCKQUOTE>

<P> FYI:

<BLOCKQUOTE>
<P>
Antes de continuar, quiero decir algo sobre el sistema de ficheros de Linux (and Unix).
A partir de ahora, no llamaremos a las direrentes particiones como C: , D: , etc., sino que nos
referiremos a ellas como /dev/hda1, /dev/hda2, y as&iacute; sucesivamente.

<P>
Hay cierta l&oacute;gica en estos nombres. Cada disco duro f&iacute;sico tiene asignado un cierto car&aacute;cter. Si tienes
dos discos en tu sistemas, el primero se llamar&aacute; /dev/hda mientras que el segundo ser&aacute; /dev/hdb.
<br>
De forma similar, cada partici&oacute;n tiene un n&uacute;mero. La primera partici&oacute;n del primer disco ser&aacute; /dev/hda1,
la segunda partici&oacute;n ser&aacute; /dev/hda2. Y lo mismo para el segundo disco, cuyas dos primeras particiones
ser&aacute;n /dev/hdb1 y /dev/hdb2 .

<P>
Tambi&eacute;n me gustar&iacute;a decir algo sobre la disposici&oacute;n de tus particiones. Todas ellas forman parte de una
gran estructura de tipo &aacute;rbol que empieza en la ra&iacute;z (/). Por tanto, es importante elegir de forma
cuidadosa el tama&ntilde;o de las particiones.
<br>
Haz un directorio ra&iacute;z relativamente peque&ntilde;o, un gran /usr, y emplea el resto de tu disco para los
usuarios en el directorio /home. No olvides crear espacio de paginado (swap), especialmente si no dispones
de mucha memoria. No existe ning&uacute;na dispuosicion 'mejor', deber&aacute;s descubrir la m&aacute;s apropiada t&uacute; mismo. El
<A href="#info">installation-HOWTO</A> te puede ayudar con informaci&oacute;n adidional.
</BLOCKQUOTE>

<P>
Lanzamos cfdisk con el comando
<PRE>
        # cfdisk
</PRE>

<P>
Esta aplicaci&oacute;n es autoexplicativa. La entrada se hace con las teclas del cursor, y se puede acceder a la
ayuda desde cualquier lugar. Haz un par de particiones con <TT>[ new ]</TT> o con la tecla <TT>n</TT>.
Simplemente para estar seguros, marca <TT>/</TT> como una partici&oacute;n arrancable (es la primera opci&oacute;n).
Haz una partici&oacute;n para swap y cambia su <TT>[ Type ]</TT> a 82 (linux swap). Con <TT>[ write ]</TT> salvar&aacute;s
losc cambios que has hecho haci&eacute;ndolos permanentes, y el programa se cerrar&aacute;.

<A NAME="lfindex3">&nbsp;</A>
<H2>Instalaci&oacute;n</H2>

<P>
Ahora escribe:
<PRE>
        # setup
</PRE>

y empieza la parte divertida ;)

<P>
De esta forma llegas a un interfaz de men&uacute;s que te presenta un cierto n&uacute;mero de opciones. Obviamente,
empezaremos con la primera, y luego continuaremos hasta haber pasado por todas. &quot;Help&quot; es
simplemente para acceder a la ayuda, de modo que seleccionamos &quot;keymap&quot; y pulsamos enter.

<BLOCKQUOTE>

<P><TT>[<b>keymap</b>]</TT>
<P>
Aqu&iacute; te preguntan el tipo de teclado que tienes. En mi caso era azerty / latin-be, que es el adecuado
para los belgas de habla holandesa.

<P><TT>[<b>addswap</b>]</TT>
<P>
Aqu&iacute; seleccionamos la partici&oacute;n que usaremos para espacio de paginaci&oacute;n (aquella a la que pusimos
&quot;type 82&quot; en cfdisk). Tambi&eacute;n te preguntan si quieres activarla. Por descontado que le
decimos que s&iacute;.

<P><TT>[<b>Target</b>]</TT>
<P>
Aqu&iacute; seleccionamos los <em>puntos de montaje </em> para cada partici&oacute;n (al montarla, fijas una partici&oacute;n
a alg&uacute;n lugar de tu estructura de directorios tipo arbol). Es imprescindible disponer de /, mientras que
/usr y /home son opcionales (si hiciste particiones para estos directorios, m&oacute;ntalos. En otro caso no lo
hagas.
<BR>
Por ejemplo:
<PRE>
  Filesystem           Mounted on

  /dev/hda1            /
  /dev/hda5            /usr
  /dev/hda6            /home
</PRE>
Por supuesto, puede ser diferente en tu m&aacute;quina. A windows le gusta colocarse en la partici&oacute;n /dev/hda1.

<P>
Tambi&eacute;n podemos a&ntilde;adir otras particiones a /etc/fstab (la DOS, por ejemplo). Este es el fichero de configuraci&oacute;n
que recuerda todo aquello que debe ser montado. Es bueno hacer esto, para poder ver otras particiones desde
Linux con facilidad.

<P><TT>[<b>Source</B>] (origen)</TT>
<P>Aqu&iacute; se selecciona el medio desde el cual vas a instalar Slackware. La mayor parte de las veces ser&aacute; el cdrom.

<P><TT>[<b>installation type</b>] (tipo de instalaci&oacute;n)</TT>
<P>&iquest;Qu&eacute; tipo de instalaci&oacute;n deseas hacer? Elije &quot;slakware&quot;.

<P><TT>[<b>select</b>] (selecci&oacute;n)</TT>
<P>Y aqu&iacute; seleccionas qu&eacute; paquetes deseamos instalar:

<UL>
<LI><PRE>[<b>X</b>] A    Base Linux system (sistema base)</PRE>
<P>&iexcl;No podr&aacute;s hacer nada sin &eacute;ste! Despu&eacute;s de todo, &iquest;para qu&eacute; sirve un coche sin motor? :)

<LI><PRE>[<b>X</b>] AP   Various Applications that do not need X (aplicaciones sin X)</PRE>
<P>Ese paquete contiene varias herramientas &uacute;tiles. Yo en tu lugar lo instalar&iacute;a.

<LI><PRE>[<b>X</b>] D    Program Development (C, C++, Lisp, Perl, etc.) (desarrollo de software)</PRE>
<P>Si pretentes programar con Linux lo necesitas. Tambi&eacute;n si recompilas el kernel alguna vez.

<LI><PRE>[<b>X</b>] DES  GNU libc crypt() add-on</PRE>
<P>Encriptado, instala &eacute;ste.

<LI><PRE>[<b>X</b>] E    GNU Emacs</PRE>
<P>Emacs es un editor de texto con multitud de posibilidades. Yo no lo instalo (demasiado para m&iacute;), pero
t&uacute; puedes hacerlo si quieres.

<LI><PRE>[<b>X</b>] F    FAQ lists, HOWTO documentation</PRE>
<P>&iexcl;Muy, muy &uacute;tiles!
 
<LI><PRE>[<b>X</b>] GTK  GTK+ and GNOME programs for X</PRE>
<P>Un entorno gr&aacute;fico.

<LI><PRE>[<b>X</b>] K    Linux kernel source (las fuentes del kernel)</PRE>
<P>Si no instalas &eacute;ste, posiblemente perder&aacute;s algunos drivers de hardware muy importantes. &iexcl;A instalar!

<LI><PRE>[<b>X</b>] KDE  Qt and the K Desktop Environment for X</PRE>
<P>Un entorno gr&aacute;fico, algo exigente en cuanto a recursos, pero muy f&aacute;cil de usar.

<LI><PRE>[<b>X</b>] N    Networking (TCP/IP, UUCP, Mail, News)</PRE>
<P>Aqu&iacute; lim&iacute;tate a seleccionar lo que necesites. Si no piensas montar un servidor web, &iexcl;no lo instales!
Y lo mismo para el servidor de correo ...

<LI><PRE>[<b>X</b>] T    TeX typesetting software</PRE>
<P>Buena herramienta para producir documentos, lo recomiendo.

<LI><PRE>[<b>X</b>] TCL  Tcl/Tk script languages</PRE>
<P>Un lenguaje de programaci&oacute;n muy indicado para crear aplicaciones gr&aacute;ficas.

<LI><PRE>[<b>X</b>] X    XFree86 X Window System (el sistema X Window)</PRE>
<P>Te ser&aacute; imprescindible si quieres hacer _cualquier cosa_ gr&aacute;fica.

<LI><PRE>[<b>X</b>] XAP  X Applications</PRE>
<P>Herramientas curioas y/o &uacute;tiles.

<LI><PRE>[ ] XD   X Server development kit</PRE>
<P>Yo no instalo &eacute;ste. S&oacute;lo lo necesitaras si pretendes hurgar en tu servidor X.

<LI><PRE>[<b>X</b>] XV   XView (OpenLook Window Manager, apps)</PRE>
<P>Uno de los m&uacute;ltimples entornos gr&aacute;ficos.
 
<LI><PRE>[<b>prompting mode</b>] (m&eacute;todo de selecci&oacute;n)</PRE>
<P>Aqu&iacute; puedes elegir la forma en que decidir&aacute;s como se har&aacute; la instalaci&oacute;n de los paquetes de software.
Lo forman las siguientes posibilidades
<UL>
 <LI><b>full</b><br>instalar&aacute; todo, usando aproximadamente 1&nbsp;GB.
 <LI><b>menu</b><br>instalar&aacute; el software por grupos.
 <LI><b>newbie</b><br>consultar&aacute; sobre cada programa que no sea imprescindible para tu sistema. Te dar&aacute; una
descripci&oacute;n del paquete para ayudarte a decidir.
 <LI><b>expert</b><br>, para seleccionar a mano los paquetes que pretendes instalar.
</UL>

<LI><TT>[<B>install</B>] (instalar)</TT>
<P>
Ahora los paquetes elegidos ser&aacute;n instalados. Esto llevar&aacute; un rato, de modo que puedes ir a por
un caf&eacute; mientras tanto.
</BLOCKQUOTE>

<A NAME="lfindex4">&nbsp;</A>
<H2>Configuraci&oacute;n</H2>


<P>
Y ya llegamos al siguiente nivel, que es <TT>[<b>configure</b>]</TT>

<BLOCKQUOTE>
<P><TT>[<b>install linux kernel</b>] (instalar kernel)</TT>
<P>Aqu&iacute; elegimos qu&eacute; kernel vamos a instalar. Las posibilidades son varias:

<UL>
<LI><b>bootdisk</b><br>usar el kernel del disco de arranque que creamos
anteriormente como kernel de nuestro sistema.
<LI><b>cdrom</b><br>usar uno de los kernel que vienen en el CDROM
<LI><b>diskette</b><br>usar un kernel que tengamos en otro disco
<LI><b>skip</b> (saltar)<br>pasar de largo e instalar un kernel standard</UL>

<P><TT>[<b>boot disk</b>]</TT>
<P>
Si queremos disponer de un disco de arranque para nuestro sistema, debemos hacerlo aqu&iacute;. Primero
formateamos el disco, despues seleccionamos entre &quot;simple&quot; o &quot;lilo disk&quot;. La
primera opci&oacute;n nos coloca el kernel en el disco, mientras que la segunda coloca LILO en &eacute;l (es m&aacute;s
flexible). Es tu decisi&oacute;n :)

<P>Y si no quieres un disco de arranque, simplemente sigue adelante


<P><TT>[<b>MODEM CONFIGURATION</b>]</TT>
<P>Para indicar cual es el puerto en el que tenemos colocado el modem. Se indican los equivalentes
DOS de los nombres Linux. Si has olvidado cual es, tendras que mirarlo con Windows (y esa ser&aacute; la
&uacute;ltima vez que necesites usarlo ;)

<P><TT>[<b>SCREEN FONTS</b>] (fuentes de pantalla)</TT>
<P>Para seleccionar una fuente agradable para la consola (el entorno en modo texto).

<P><TT>[<b>LILO</b>]</TT>
<P>Si s&oacute;lo vas a usar Windows&nbsp;95/98 y Linux puedes seleccionar sin ninguna preocupaci&oacute;n la
opci&oacute;n autom&aacute;tica. Si algo no funciona o si tu configuraci&oacute;n es m&aacute;s compleja, probablemente sea
mejor que vayas por otro camino (la opci&oacute;n &quot;expert&quot;). En cualquier caso, se puede
configurar LILO m&aacute;s tarde, tal vez con ayuda del Lilo-HOWTO.

<P>Y tambi&eacute;n podemos elegir donde colocaremos el lilo <PRE>
  <B>boot</B> en el comienzo de nuestra partici&oacute;n ra&iacute;z ("/")
  <b>floppy</b> en un diskette
  <b>MBR</b> en el sector de arranque maestro (MBR) del disco duro
</PRE>

<P>"boot" es &uacute;til cuando se usa alg&uacute;n otro gestor de arranque, &quot;MBR&quot; es para cuando se
usa Lilo para elegir el arranque entre Linux y otros sistemas operativos. Esta opci&oacute;n sobreescribe
el sector de arranque del disco, poco recomendable si usas Win NT.

<P>M&aacute;s informaci&oacute;n sobre Lilo en su HOWTO.

<P><TT>[<b>MOUSE</b>] (rat&oacute;n)</TT>
<P>Indica el tipo de tu rat&oacute;n (pista: si no est&aacute; funcionando prueba con pnp), y el puerto en el
que est&aacute;.

<P>Y ahora podemos decidir si correr GPM o no (es un programa que proporciona soporte para el rat&oacute;n
en la consola).

<P><TT>[<b>TIMEZONE</b>]</TT>
<P>Selecciona tu zona horaria.

<P><TT>[<b>ROOTPASS</b>]</TT>
<P>Y da una password para el root. &iexcl;CUIDADO! Recu&eacute;rdala bien, si la olvidas te ver&aacute;s en serios
problemas. Como no ves lo que est&aacute;s escribiendo, hazlo con cuidado :) (en cualquier caso, tendr&aacute;s
que escribirla dos veces)

</BLOCKQUOTE>

<P>&iexcl; Y ya est&aacute; &iexcl;

<P>Cierra el programa y, de vuelta a la consola, escribe
<PRE>
        # reboot
</PRE>
con lo que rebotar&aacute; tu sistema, y ya tendr&aacute;s un Slackware corriendo en ella...

<A name="info">&nbsp;</A>
<A NAME="lfindex5">&nbsp;</A>
<H2>Informaci&oacute;n adicional</H2>


<P>
<UL>
<!--  <LI>Part II of this article: <A href="">Slackware 7.0 part II: Configuration Guide</A>
 -->
 <LI>El Mini-HOWTO de particiones: <A href="http://www.linuxdoc.org/HOWTO/mini/Partition.html">www.linuxdoc.org/HOWTO/mini/Partition.html</A> (en <A href="http://www.linuxdoc.org">linuxdoc.org</A>)
 <LI>El HOWTO de instalaci&oacute;n de Linux: <A href="http://www.linuxdoc.org/HOWTO/Installation-HOWTO.html">www.linuxdoc.org/HOWTO/Installation-HOWTO.html</A> (en <A href="http://www.linuxdoc.org
">linuxdoc.org</A>)
<!-- <A href="http://www.linuxdoc.org/HOWTO/mini/Partition.html">www.linuxdoc.org/HOWTO/mini/Partition.html</A> -->
<!-- linuxfoc Installation-HOWTO -->
 <LI><A href="../January2000/article135.html">Como particionar tu disco duro bajo Linux</A>, un art&iacute;culo de Linux<font color="red">Focus</font> 
 <LI>La distribuci&oacute;n Linux Slackware, <A href="http://www.slackware.com">www.slackware.com</A>
 <LI>La distribuci&oacute;n Linux RedHat, <A href="http://www.redhat.com">www.redhat.com</A>
 <LI>La distribuci&oacute;n Linux Suse, <A href="http://www.suse.com">www.suse.com</A>
</UL>






<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=154&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Jeffry Degrande <BR>LinuxFocus.org 2000</FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article154.shtml" target="_TOP"><FONT COLOR="#FFFFFF">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</FONT></A><BR></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>nl</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:suzuki@village.uunet.be"><FONT COLOR="#FFFFFF">Jeffry Degrande</FONT></a></font></td>
</tr>
<tr><td><font size=2>nl</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>en</font></td>
    <td><font size=2><a href="mailto:floris.lambrechts@linuxfocus.org"><FONT COLOR="#FFFFFF">Floris Lambrechts</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2000-09-23, generated by lfparser version 1.8</font></p>
</BODY>
</HTML>
