<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>lf166, System Administration: Bastille-Linux o c&oacute;mo mejorar la seguridad de nuestro sistema</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img SRC="../../common/images/Frederic_Raynal.png">
<BR>por  <a href="mailto:pappy@users.sourceforge.net">Fr&eacute;d&eacute;ric Raynal</a>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Fr&eacute;d&eacute;ric Raynal prepara su tesis en inform&aacute;tica sobre tatuado de im&aacute;genes
en el INRIA (Instituto Nacional de investigaci&oacute;n en Inform&aacute;tica y Automatizaci&oacute;n
con sus siglas en franc&eacute;s).
Asimismo participa en el desarrollo de la Bastille-Linux.
</P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Presentaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex2">
Instalaci&oacute;n o "juguemos con los guiones mientras el lobo no est&aacute;"</A></LI>
  <LI><A HREF="#lfindex3">
Los m&oacute;dulos paso a paso</A></LI>
  <LI><A HREF="#lfindex4">
IPChains</A></LI>
  <LI><A HREF="#lfindex5">
PatchDownload - Obteniendo los parches</A></LI>
  <LI><A HREF="#lfindex6">
FilePermissions - Los permisos de los archivos</A></LI>
  <LI><A HREF="#lfindex7">
AccountSecurity - La seguridad de las cuentas</A></LI>
  <LI><A HREF="#lfindex8">
BootSecurity - Seguridad en el arranque</A></LI>
  <LI><A HREF="#lfindex9">
SecureInetd - Seguridad Inetd</A></LI>
  <LI><A HREF="#lfindex10">
DisableUserTools - Deshabilitar las herramientas de los usuarios</A></LI>
  <LI><A HREF="#lfindex11">
ConfigureMiscPAM - Configuraci&oacute;n de PAM</A></LI>
  <LI><A HREF="#lfindex12">
Logging - Acceso al sistema</A></LI>
  <LI><A HREF="#lfindex13">
MiscellaneousDaemons - Otros demonios</A></LI>
  <LI><A HREF="#lfindex14">
Sendmail</A></LI>
  <LI><A HREF="#lfindex15">
RemoteAcces - Acceso remoto</A></LI>
  <LI><A HREF="#lfindex16">
DNS</A></LI>
  <LI><A HREF="#lfindex17">
Apache</A></LI>
  <LI><A HREF="#lfindex18">
Printing - Imprimir</A></LI>
  <LI><A HREF="#lfindex19">
FTP</A></LI>
  <LI><A HREF="#lfindex20">
&Uacute;ltimos trucos y consejos</A></LI>
  <LI><A HREF="#lfindex21">
Conclusi&oacute;n</A></LI>
  <LI><A HREF="#lfindex22">
Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=166&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Bastille-Linux o c&oacute;mo mejorar la seguridad de nuestro sistema</H2>
 <img src="../../common/images/illustration166.jpg" ALT="[Illustration]" HSPACE=10 HEIGHT=100 WIDTH=100>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>
La versi&oacute;n 1.1 de Bastille-Linux, que apareci&oacute; a principios de junio, no es una nueva distribuci&oacute;n
Linux sino un conjunto de guiones para proteger mejor nuestro sistema contra potenciales
vulnerabilidades. El enfoque de los autores es muy pedag&oacute;gico y se puede aprender mucho
durante el proceso de su instalaci&oacute;n.
</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H3>Introducci&oacute;n</H3>

En cuanto a seguridad se refiere, Linux es mucho mejor que otros sistemas operativos.
Sin embargo, no todas las distribuciones son iguales con respecto a este tema.
Bastille-Linux propone un conjunto de medidas a tomar para proteger nuestro sistema.
Incialmente fue escrito para RedHat pero la &uacute;ltima versi&oacute;n funciona tambi&eacute;n para otras
distribuciones.

<p>El proyecto es dirigido por Jon Lasser (coordinador principal)
y Jay Beale (desarrollador principal). No obstante, existen numerosos
desarrolladores, dise&ntilde;adores de software y beta-testers involucrados.
<p>Ante todo dejemos bien en claro que Bastille-Linux NO es una nueva distribuci&oacute;n de Linux.
Es un conjunto de guiones escritos en <font face="Courier New,Courier">perl</font>
destinados a mejorar la seguridad de Linux.
</p>
<p>

</p>
<p>El t&eacute;rmino seguridad se limita aqu&iacute; al aspecto inform&aacute;tico: c&oacute;mo evitar que personas
indeseables accedan a nuestra m&aacute;quina. Bastille-Linux binda parte de la respuesta
modificando la instalaci&oacute;n inicial de las diferentes distribuciones de Linux.
</p>

<p>Una tarea b&aacute;sica de todo administrador es de conocer las necesidades de sus usuarios
no s&oacute;lo para satisfacerlos sino tambi&eacute;n para evitar que se ejecuten programas en la
red que no se usan pero que pueden tener vulnerabilidades peligrosas para &eacute;sta.
Uno de mis mentores sol&iacute;a decir: cuanto menos puedas hacer, mejor ;-].
Si bien hablaba sobre complejidad algor&iacute;tmica lo mismo es aplicable a la administraci&oacute;n
de redes: demasiado privilegios causan da&ntilde;o y
crean nuevos &aacute;ngulos de ataque. Para reducir las vulnerabilidades de un sistema
es necesario instalar s&oacute;lo lo que realmente se necesita.
</p>
<p>Bastille-Linux intenta reducir las posibilidades de un ataque a una m&aacute;quina Linux.
Para alcanzar este objetivo, los dise&ntilde;adores del programa han optado por un enfoque
muy pedag&oacute;gico: sugieren paso a paso qu&eacute; hacer y explican el por qu&eacute;.
</p>

<A NAME="lfindex1">&nbsp;</A>
<H3>Presentaci&oacute;n</H3>

Al momento de escribir este art&iacute;culo la versi&oacute;n de Bastille-Linux es la 1.1.0 la cual
fue liberada en la primera quincena del mes de junio.
<p>Independientemente de su utilidad evidente, Bastille-Linux es estremadamente did&aacute;ctico.
Los guiones funcionan haciendo preguntas precisas. A menudo, en este tipo de enfoque
las preguntas son tan incomprensibles como las respuestas y los usuarios no saben qu&eacute; hacer.
Aqu&iacute;, en cambio, los desarrolladores tratan de educar al usuario. Explican no s&oacute;lo el contexto
de la pregunta, sino tambi&eacute;n las consecuencias de sus posibles respuestas. Esto hace de
Bastille-Linux una herramienta f&aacute;cil de usar.

</p>
<p>Para usuarios m&aacute;s avanzados, el c&oacute;digo fuente escrito en
<font face="Courier New,Courier">perl</font> es un modelo de claridad (s&iacute;, es posible ;) :
cada comentario describe en forma precisa las acciones que se toman.
</p>
<p>A continuaci&oacute;n se muestran las caracter&iacute;sticas de la versi&oacute;n 1.1.0 :
<ul>
<li>
Los guiones ahora funcionan en sistemas usados.
</li>
<p>
<li>
Existe una funci&oacute;n <font face="Courier New,Courier">undo</font>:
se hace una copia de respaldo de cada archivo modificado por Bastille-Linux
de manera de poder restaurar las configuraciones inciales si fuese necesario</li>
<p>
<li>
Al principio, Bastille-Linux estaba reservado para RedHat y Mandrake. Esto ya no
continua siendo as&iacute;. Actualmente, un m&oacute;dulo contiene las rutas de los archivos necesarios
en funci&oacute;n de la distribuci&oacute;n sobre la que se ejecutan los guiones.</li>
</ul>
Bastille-Linux consta de diferentes m&oacute;dulos. Son cuatro m&oacute;dulos de prop&oacute;sito general
y otros relacionados con prop&oacute;sitos m&aacute;s espec&iacute;ficos (programas como
<font face="Courier New,Courier">sendmail</font>,
<font face="Courier New,Courier">FTP</font>,
demonios de escaso uso, etc.)
<p>Los m&oacute;dulos generales comprenden:</p>
<ol>
<li>
Instalaci&oacute;n de un cortafuegos (firewall)</li>

<li>
Actualizaci&oacute;n de los programas del sistema</li>

<li>
Auditor&iacute;a de los programas SUID-root</li>

<li>
Desactivaci&oacute;n y restricci&oacute;n de servicios in&uacute;tiles</li>
</ol>
Los otros m&oacute;dulos est&aacute;n vinculados con aspectos m&aacute;s espec&iacute;ficos. Algunos se dedican a los
agujeros de seguridad creados por programas mal configurados (por ejemplo, <font face="Courier
New,Courier">sendmail</font> o <font face="Courier New,Courier">FTP</font>),
otros modifican la configuraci&oacute;n de algunos servicios de una manera menos permisiva
(<font face="Courier New,Courier">PAM</font>,
<font face="Courier New,Courier">syslog</font>,
...)
<p>Algunas medidas de seguridad se superponen ofreciendo diferentes niveles de protecci&oacute;n
(esto es contrario a los principios de mi mentor pero alguna vez hay que emanciparse ;-)
Hay que proteger cada servicio o cada vulnerabilidad potencial por intermedio de todos
los medios posibles. De esta manera, si uno fracasa los restantes siguen protegiendo
a nuestro sistema.
</p>
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p><img src="../../common/images/article166/image166-1.png" height=316 width=499></center>
<p><br>
<A NAME="lfindex2">&nbsp;</A>
<H3>
Instalaci&oacute;n o "juguemos con los guiones mientras el lobo no est&aacute;"</H3>

Las versiones previas de Bastille-Linux s&oacute;lo funcionaban en sistemas nuevos lo cual no
sigue siendo as&iacute;. Sin embargo, cabe destacar que Bastille carece (casi) de utilidad en
sistemas ya usados. De  esta manera, se recomienda por cuestiones de seguridad
instalar Bastille-Linux en sistemas reci&eacute;n instalados. Habiendo aclarado este punto
podemos pasar a cuestiones m&aacute;s importantes: &iexcl;la instalaci&oacute;n!
<p>Bastille-Linux est&aacute; disponible como tarball <font face="Courier New,Courier">.tgz</font>
en <font face="Courier New,Courier"><a href="http://bastille-linux.sourceforge.net">bastille-linux.sourceforge.net</a></font>.
Este archivo es de s&oacute;lo 134 Kb. Una vez descargado se lo descomprime haciendo
(<font face="Courier New,Courier">tar
xzf Bastille-1.1.0.tgz</font>).
</p>
<p>Cuatro guiones administran Bastille-Linux:</p>
<ul>
<li>
<font face="Courier New,Courier">InteractiveBastille.pl</font>: este gui&oacute;n
formula al usuario diversas preguntas para definir las operaciones que se van a efectuar
en el sistema. Al finalizar, crea un archivo <font face="Courier New,Courier">config</font>
teniendo en cuenta las respuestas dadas.</li>
<p>
<li>
<font face="Courier New,Courier">AutomatedBastille.pl</font>: instala la configuraci&oacute;n
por defecto dando la posibilidad de usar un cortafuegos a partir de un archivo de
configuraci&oacute;n suministrado. Cabe destacar que este gui&oacute;n ya no se sigue manteniendo.</li>
<p>
<li>
<font face="Courier New,Courier">BackEnd.pl</font>: es el responsable de los cambios
introducidos al sistema. Toma como par&aacute;metros las respuestas incialmente dadas
</li>
<p>
<li>
<font face="Courier New,Courier">Undo.pl</font> : cuando se ejecuta
<font face="Courier New,Courier">BackEnd.pl</font> algunos archivos del sistema
(<font face="Courier New,Courier">/etc/syslog.conf,/etc/inetd.conf</font>,
<font face="Courier New,Courier">/etc/hosts.*</font>,
...) sufren modificaciones. Para permitir la recuperaci&oacute;n del sistema inicial,
las copias de respaldo se ubican en el directorio
<font face="Courier New,Courier">/root/Bastille/undo</font>.</li>
</ul>
Para instalar Bastille-Linux hay que ser <i>superusuario</i> ya que los guiones
modificar&aacute;n los archivos de configuraci&oacute;n. La instalaci&oacute;n m&aacute;s habitual consiste
en ejecutar primero el
<font face="Courier New,Courier">InteractiveBastille.pl</font>.
A continuaci&oacute;n el usuario deber&aacute; responder una serie de preguntas (que ser&aacute;n
analizadas en detalle m&aacute;s adelante). Por &uacute;ltimo se debe ejecutar el
<font face="Courier New,Courier">BackEnd.pl</font>
y &iexcl;listo!. Un seguimiento de todos los cambios introducidos se puede encontrar en el
directorio
<font face="Courier New,Courier">/root/Bastille/undo</font>.
<p>Algunas observaciones antes de comenzar.
<ol>
<li>
Se supone que el gui&oacute;n, por defecto, se ejecuta en el directorio
<font face="Courier New,Courier">/root/Bastille</font>
... esto se modificar&aacute; en una futura versi&oacute;n y ser&aacute; posible ejecutarlo desde cualquier
lugar (de hecho, quiz&aacute;s ya sea as&iacute; en el momento de leer estas l&iacute;neas)</li>
<p>
<li>
Dos m&oacute;dulos proponen la creaci&oacute;n de cuentas y presuponen que en el sistema se usan
contrase&ntilde;as ocultas. Esto ocurre en la instalaci&oacute;n por defecto y es conveniente
verificar que el directorio
<font face="Courier New,Courier">/etc/passwd</font> no contenga contrase&ntilde;as, que
al directorio <font face="Courier New,Courier">/etc/shadow</font> s&oacute;lo tenga acceso
el <i>superusuario</i> y que sea este directorio el que contiene las contrase&ntilde;as.
</li>
<p>
<li>
Bastille-Linux a&uacute;n no administra enlaces entre m&oacute;dulos como los que aparecen
en la configuraci&oacute;n del n&uacute;cleo (esta caracter&iacute;stica estar&aacute; disponible en una pr&oacute;xima
versi&oacute;n). Se debe prestar atenci&oacute;n a las respuestas dadas en cada m&oacute;dulo y a las
consecuencias que pueden originar. As&iacute;, por ejemplo, es posible decirle al m&oacute;dulo
IPChains bloquear el puerto 2049 y mantener el
<font face="Courier New,Courier">NFS</font>
en la lista de demonios activos del m&oacute;dulo MiscellaneousDaemons
(<font face="Courier New,Courier">NFS</font> usa este puerto).</li>
</ol>

<A NAME="lfindex3">&nbsp;</A>
<H2>
Los m&oacute;dulos paso a paso</H2>

Para comprender las etapas paso a paso, conservar&eacute; las preguntas planteadas
por Bastille-Linux en ingl&eacute;s acompa&ntilde;&aacute;ndolas de su correspondiente traducci&oacute;n
al castellano. Las letras entre [ ] muestra la respuesta por defecto
(N -> No, Y -> Yes -S&iacute;-).
<A NAME="lfindex4">&nbsp;</A>
<H3>
IPChains</H3>

Este m&oacute;dulo sirve para configurar un cortafuegos. Si bien no es indispensable para
proteger el sistema, permite controlar el tr&aacute;fico de red desde y hacia nuestra m&aacute;quina.
Sin embargo, no basta con bloquear el tr&aacute;fico con un cortafuegos. Hay que reconfigurar
los demonios (recordar que no son in&uacute;tiles diferentes niveles de seguridad).
<p>El principio en que se basa este gui&oacute;n es excelente. Considera 2 interfaces
de red: la que se comunica con el exterior y la que se comunica con la red local.
El objetivo es determinar los servicios disponibles en cada m&aacute;quina y
y bloquear el resto. Por defecto, se rechaza todo lo que proviene del exterior.
A continuaci&oacute;n el gui&oacute;n establecer las reglas para autorizar determinados servicios.</p>
<p>El gui&oacute;n simult&aacute;neamente se hace cargo de los protocolos TCP, UDP, ICMP y
propone una lista de servicios que se deben vigilar para cada uno de ellos.
Ser&iacute;a demasiado extenso detallar el enfoque que sigue Bastille-Linux para instalar
un cortafuegos pero la lectura del gui&oacute;n con sus comentarios ayuda much&iacute;simo.
Sin embargo, se necesita de un m&iacute;nimo de conocimiento para entender este m&oacute;dulo.</p>

<A NAME="lfindex5">&nbsp;</A>
<H3>
PatchDownload - Obteniendo los parches</H3>

Las actualizaciones son importantes para mantener la integridad del sistema. En los
&uacute;ltimos meses, <font face="Courier New,Courier">bind</font>
y <font face="Courier New,Courier">piranha</font>, (por citar algunos)
han provocado graves problemas de seguridad. Fueron r&aacute;pidamente solucionados: al ser el
c&oacute;digo fuente p&uacute;blico, algunas personas inmediatamente escribieron los parches.
<p>Desafortunadamente, este gui&oacute;n a&uacute;n no funciona del todo bien.
Es bastante complejo puesto que se deben determinar los paquetes instalados y, entre
ellos, los que se necesitan actualizar.
A continuaci&oacute;n, se debe descargar el parche, verificar que no ha sido modificado (por
alg&uacute;n hacker o durante el proceso de transferencia) antes de instalarlo. La verdadera
dificultad radica en que esta etapa depende de la distribuci&oacute;n empleada.</p>
<p>Por el momento, Jay Beale recomienda realizar esta etapa en forma manual sin
descuidarla. Una versi&oacute;n m&aacute;s funcional de este m&oacute;dulo est&aacute; en v&iacute;s de desarrollo y
estar&aacute; disponible muy pronto.
</p>
<A NAME="lfindex6">&nbsp;</A>
<H3>
FilePermissions - Los permisos de los archivos</H3>

Este m&oacute;dulo est&aacute; inspirado en el documento del grupo SANS. Su finalidad es
determinar los programas que deben ser accesibles &uacute;nicamente al
<i>superusuario</i> (o a un miembro del grupo <i>root</i>),
los que necesitan conservar el bit SUID, etc ...
<ul>
<li>
<i>Would you like to set more restrictive permissions on the administration
utilities? - <strong>&iquest;Desea imponer permisos m&aacute;s restringidos sobre las utilidades de
administraci&oacute;n?</strong> [N] </i></li>
<br>Ciertos programas no deben ser accesibles a todo  el mundo.
Bastille-Linux proporciona una inmensa lista de programas que se encuentran
con los permisos 0750.
<p>
<li>
Est&aacute; a continuaci&oacute;n el tema del bit SUID. Este bit permite a un programa
ser ejecutado por un usuario con los permisos de <i>superusuario</i>
(la 's' en la posci&oacute;n 4, 7 y 10)</li>

<ul><font face="Courier New,Courier">>>ls -l /bin/ping</font>
<br><font face="Courier New,Courier">-rwsr-xr-x 1 root root 17968 Mar 6
15:57 /bin/ping</font></ul>
Este bit si bien mejora la facilidad de uso, reduce la seguridad.
En efecto, si alguien descubre una vulnerabilidad (por ejemplo, el desbordamiento
de un b&uacute;fer), podr&aacute; adquirir los derechos de superusuario sin estar autorizado.
<br>Bastille-Linux sugiere eliminar este bit de algunos programas entre los
que se encuentran
<font face="Courier New,Courier">mount/umount</font>,
<font face="Courier New,Courier">ping</font>,
<font face="Courier New,Courier">dump/restore</font>,
<font face="Courier New,Courier">cardctl</font>,
... Esta lista comprende entre otros a las utilidades de red <font face="Courier New,Courier">ping</font>
y <font face="Courier New,Courier">traceroute</font> que permiten verificar el
estado de un servidor.
El quitar el bit SUID es actuar en forma paranoica pero no impide el uso est&aacute;ndar de la m&aacute;quina.
<br>Asimismo, es posible encontrar en esta lista de programas SUID-root los
(<font face="Courier New,Courier">comandos r</font>). Tales como los programas
<font face="Courier New,Courier">rcp</font>, <font face="Courier New,Courier">rlogin</font>
o <font face="Courier New,Courier">rsh</font>. Estas utilidades no encriptan los datos
que env&iacute;an a trav&eacute;s de la red. Adem&aacute;s, usan &uacute;nicamente la direcci&oacute;n IP como medio de
autenticaci&oacute;n lo cual es inadecuado (posibilidad de enga&ntilde;os o 'spoofing').</ul>

<A NAME="lfindex7">&nbsp;</A>
<H3>
AccountSecurity - La seguridad de las cuentas</H3>

Un hacker a menudo comienza con el robo de la cuenta de un usuario (o una cuenta del sistema).
&nbsp; Algunas precauciones sencillas dificultan la tarea y permiten
detectar eventuales intrusiones.
<ul>
<li>
<i>Would you like to set up a second UID 0 account - <strong>&iquest;Desea configurar una segunda cuenta con
UID 0?</strong>  [N] </i></li>

<br>Al responder afirmativamente a esta pregunta se crea otra cuenta <i>root</i> en el
sistema. En este caso, no se deber&iacute;a seguir usando la cuenta original de <i>root</i>
sino la reci&eacute;n creada. Esto incrementa en un factor de dos la posibilidad de que un hacker
pueda romper la clave de superusuario pero permite conocer qui&eacute;n utiliza la identidad
de <i>superusuario</i> analizando los archivos situados en
<font face="Courier New,Courier">/var/log</font>.
<p>
<li>
<i>May we take strong steps to disallow the dangerous r-protocols? - <strong>&iquest;Se pueden tomar
medidas dr&aacute;sticas para los comandos r?</strong> [Y]</i></li>
<br>Como hemos mencionado anteriormente los <font face="Courier New,Courier">comandos r</font>
son fuentes potenciales para obtener una nueva cuenta en una m&aacute;quina: &iexcl;las contrase&ntilde;as se
transfieren sin cifrar! En una red de este tipo un 'sniffer' (rastreador) ofrece interesantes posibilidades...
<br>Bastille-Linux prohibe el uso de los
<font face="Courier New,Courier">comandos r</font>
via <font face="Courier New,Courier">PAM</font> (Pluggable Authentication
Modules), elimina los permisos de ejecuci&oacute;n y bloquea los servidores que est&aacute;n en
<font face="Courier New,Courier">tcp_wrapper</font>
(rlogind, rexecd y rshd). Est&aacute;n configurados en
<font face="Courier,New,Courier">/etc/inetd.conf</font>
donde es suficiente colocarlos como comentarios.
<p>
<li>
<i>Would you like to enforce password aging? - <strong>&iquest;Desea imponer un l&iacute;mite de caducidad
a las contrase&ntilde;as?</strong> [Y]</i></li>

<br>Las contrase&ntilde;as se deber&aacute;n cambiar cada 180 d&iacute;as. Se desactivan las cuentas cuyas contrase&ntilde;as
no se cambian.
<p>
<li>
<i>Would you like to create a non-root user account? - <strong>&iquest;Desea crear una cuenta para
un usuario est&aacute;ndar?</strong> [N]</i></li>

<br>Hay que usar lo m&iacute;nimo posible la cuenta de <i>superusuario</i>. De hecho, un simple
comando como <font face="Courier New,Courier">rm -rf ejecutado por el <i>superusuario</i>
</font> puede provocar un desastre cosa que no sucede en el caso de un usuario sin
dichos privilegios. &Uacute;nicamente las tareas de administraci&oacute;n se deben hacer
usando la cuenta de <i>superusuario</i>.
<p>
<li>
<i>&nbsp;Would you like to restrict the use of cron to administrative accounts? -
<strong>&iquest;Desea restringir el uso de cron para tareas administrativas?</strong> [Y]</i></li>

<br><font face="Courier New,Courier">cron</font> permite ejecutar tareas en forma
autom&aacute;tica. Por ejemplo, un administrador puede usarlo para verificar regularmente la
integridad de archivos o  para hacer b&uacute;squedas en
<font face="Courier New,Courier">/var/log</font>.
Por otra parte, permitir su uso a todos los usuarios es brindar demasiados priviliegios.
Para evitar esta situaci&oacute;n, Bastille-Linux crea un archivo
<font face="Courier New,Courier">/etc/cron.allow</font>
que contiene los usuarios autorizados a usar este servicio.</ul>

<A NAME="lfindex8">&nbsp;</A>
<H3>
BootSecurity - Seguridad en el arranque</H3>

La opciones propuestas por este m&oacute;dulo abarcan la seguridad f&iacute;sica de una m&aacute;quina.
Este m&oacute;dulo corrige los agujeros de seguridad de versiones previas que permit&iacute;an
a cualquier persona acceder f&iacute;sicamente a la consola y adquirir privilegios de
(i.e. <i>superusuario</i>).
En efecto, era suficiente ejecutar <font face="Courier New,Courier">LILO</font>
en modo <i>monousuario</i>,
(<font face="Courier New,Courier">LILO: linux single</font>) para encontrarse con
un gentil int&eacute;rprete de comandos perteneciente al <i>root</i> ;-P
<p>Obviamente esto no basta. Para proteger f&iacute;sicamente a una computadora se debe
proteger la BIOS con una contrase&ntilde;a, el disco duro debe ser el &uacute;nico dispositivo
de arranque, el gabinete debe estar asegurado para evitar que alguien agregue su
propio disco duro...
Este es por supuesto un comportamiento paranoico que no necesita aplicarse sin
que exista una muy buena raz&oacute;n.</p>
<p>Desde el punto de vista del programa, algunas medidas elementales brindan un
compromiso razonable con las mencionadas anteriormente:
<ul>
<li>
<i>Would you like to password-protect the LILO prompt? - <strong>&iquest;Desea proteger a LILO
mediante una contrase&ntilde;a?</strong> [N]</i></li>

<br>Al contestar "Yes" (S&Iacute;) evita que gente desautorizada acceda al sistema tras el
arranque.
<p>
<li>
<i>Would you like to reduce the LILO delay time to zero? - <strong>&iquest;Desea reducir a
cero el tiempo de espera de LILO?</strong> [N]</i></li>

<br>De esta manera nadie puede ingresar par&aacute;metros en tiempo de arranque.
Si nuestra computadora posee diversos sistemas operativos no debe responderse
en forma afirmativa pues el &uacute;nico SO que arrancar&aacute; ser&aacute; el elegido por defecto.
<p>
<li>
<i>Do you ever boot Linux from the hard drive? - <strong>&iquest;Siempre arranca Linux desde
el disco duro?</strong> [Y]</i></li>

<br>Si respondi&oacute; YES (S&Iacute;) a algunas de las preguntas previas y tiene instalado
LILO en su sistema, debe responder tambi&eacute;n aqu&iacute;  YES (S&Iacute;) para que se graben
las modificaciones al disco.
<p>
<li>
<i>Would you like to write the LILO changes to a boot floppy? - <strong>&iquest;Desea guardar
los cambios hechos a LILO en un disquete de arranque?</strong> [N]</i></li>

<br>Debe responder afirmativamente si dispone de un disquete de arranque para
emergencias o bien si es el modo elegido para arrancar Linux.
<p>
<li>
<i>Would you like to disable CTRL-ALT-DELETE rebooting? - <strong>&iquest;Desea desactivar
la secuencia CTRL-ALT-DELETE para reiniciar el sistema?</strong> [N]</i></li>

<br>El objetivo es evitar que alguien reinicie la m&aacute;quina.
Sin embargo, esto es in&uacute;til a menos que tambi&eacute;n se encuentre protegido el
suministro de energ&iacute;a el&eacute;ctrica ;-)
<p>
<li>
<i>Would you like to password protect single-user mode? - <strong>&iquest;Desea proteger el
modo monousuario mediante una contrase&ntilde;a?</strong> [Y]</i></li>

<br>Como hemos visto al principio de este m&oacute;dulo, resulta ser una muy buena idea
evitar que cualquier persona adquiera privilegios de <i>superusuario</i>.

</ul>

<A NAME="lfindex9">&nbsp;</A>
<H3>
SecureInetd - Seguridad Inetd</H3>

El prop&oacute;sito de este m&oacute;dulo es restringir y desactivar servicios superfluos.
Los hackers f&aacute;cilmente pueden encontrar agujeros de seguridad en cualquier
servicio privilegiado, por lo tanto se deben restringir tanto los servicios
como sus privilegios.

<p>Por ejemplo, un error en el DNS de RedHat 6.0 permite adquirir privilegios
de superusuario en forma remota. Desactivando este servicio o reduciendo sus
privilegios nos proteger&aacute; de este inconveniente.

</p>
<p>Algunos protocolos, como los <font face="Courier New,Courier">comandos r</font>
ya mencionados pero tambi&eacute;n el <font face="Courier New,Courier">ftp</font>
o el <font face="Courier New,Courier">telnet</font> resultan ser muy vulnerables.
Otros permiten al atacante obtener informaci&oacute;n (<font face="Courier New,Courier">finger</font>
o <font face="Courier New,Courier">identd</font> por ejemplo) de las cuentas de
una m&aacute;quina, etc. Muchos de estos servicios est&aacute;n administrados por
<font face="Courier New,Courier">tcp_wrapper</font>&nbsp;
que permite controlar al que accede a un determinado servicio (por intermedio del
archivo <font face="Courier New,Courier">/etc/hosts.{allow, deny}</font>).
Una vez que el wrapper decide si el cliente puede acceder al servicio solicitado,
env&iacute;a la solicitud al correspondiente servidor.</p>
<p>Esta parte contin&uacute;a siendo un tanto r&iacute;gida y deber&iacute;a reveerse completamente
en futuras versiones.
<ul>
<li>
<i>Would you like to modify inetd.conf and /etc/hosts.allow to optimize
use of Wrappers? - <strong>&iquest;Desea modificar inetd.conf y /etc/hosts.allow para
optimizar el uso de Wrappers?</strong> [Y]</i></li>

<br>Bastille-Linux instala estos dos archivos.
Puede resultar interesante hecharles un vistazo para pasarles par&aacute;metros m&aacute;s precisos
en funci&oacute;n a nuestras necesidades.
<p>
<li>
<i>Would you like to set sshd to accept connections only from a small list
of IP addresses? - <strong>&iquest;Desea autorizar el acceso a sshd solamente a un n&uacute;mero limitado
de direcciones IP?</strong> [N]</i></li>

<br><font face="Courier New,Courier">sshd</font> es un demonio que permite
conectarse de modo seguro (intercambio de claves, cifrado de contrase&ntilde;as y datos,...)
Permite reemplazar totalmente a
<font face="Courier New,Courier">telnet</font>,
<font face="Courier New,Courier">rlogin</font>,
<font face="Courier New,Courier">rsh</font>,
<font face="Courier New,Courier">rcp</font>
y <font face="Courier New,Courier">ftp</font>. Cabe destacar un versi&oacute;n equivalente
de <font face="Courier New,Courier">ssh</font>
bajo la licencia BSD: <font face="Courier New,Courier">OpenSSH</font>.
Volveremos sobre este asunto posteriormente.
<p>
<li>
<i>Would you like to make "Authorized Use" banners? - <strong>&iquest;Desea instalar mensajes con
la leyenda "Uso autorizado"?</strong> [Y]</i></li>

<br>Toda persona que intente conectarse a nuestra m&aacute;quina ver&aacute; un mensaje de advertencia
que le preguntar&aacute; si est&aacute; autorizado para conectarse a trav&eacute;s de este servicio.
Este mensaje se encuentra en el archivo <font face="Courier New,Courier">/etc/motd</font>.</ul>
<p>
Antes de proseguir, recordemos que una red se basa en un modelo cliente-servidor.
Por lo tanto, para cada servicio hay que saber si se est&aacute; del lado del cliente o del
lado del servidor. Por ejemplo, el no hacer funcionar el servidor web no nos impide navegar
por Internet ya que el navegador juega el rol del cliente.
<br>&nbsp;
<A NAME="lfindex10">&nbsp;</A>
<H3>
DisableUserTools - Deshabilitar las herramientas de los usuarios</H3>

Este m&oacute;dulo es breve pero absolutamente indispensable para un servidor. En general, un
hacker ingresa a una m&aacute;quina mediante una cuenta de usuario normal. A continuaci&oacute;n recompila
algunos programas del sistema a fin de poder explotar sus puntos d&eacute;biles.
Este m&oacute;dulo desactiva al compilador C para todos los usuarios salvo para el <i>superusuario</i>.
<p>Por lo tanto, si una m&aacute;quina es &uacute;nicamente un servidor donde nadie necesita compilar
hay que eliminar el compilador.
<A NAME="lfindex11">&nbsp;</A>
<H3>
ConfigureMiscPAM - Configuraci&oacute;n de PAM</H3>

La finalidad de este m&oacute;dulo consiste en disminuir los riesgos de ataques tipo 'Denegaci&oacute;n
de servicios' estos ataques cuelgan al sistema sobrecarg&aacute;ndolo (por ejemplo: llenando una partici&oacute;n
con archivos <font face="Courier New,Courier">core</font>, ejecutando pings mortales, etc)
<p>PAM significa "Pluggable Authentification Module". Se trata de una biblioteca que permite
al administrador del sistema elegir el modo en que autentica cada aplicaci&oacute;n a sus usuarios,
los permisos que tienen, los recursos a los que pueden acceder, etc.
<ul>
<li>
<i>Would you like to put limits on system resource usage? - <strong>&iquest;Desea imponer limitaciones al
uso de recursos del sistema?</strong> [Y]</i></li>

<br>El archivo <font face="Courier New,Courier">/etc/security/limits.conf
</font> contiene los l&iacute;mites impuestos al sistema. Bastille-Linux los modifica de la siguiente
manera:
<ul>
<li>
a la cantidad de archivos core la acota a 0 ;</li>

<li>
cada usuario puede ejecutar a los sumo 150 procesos ;</li>

<li>
el m&aacute;ximo tama&ntilde;o de un archivo se limita a 40 Mb.</li>
</ul>
Se pueden modificar cada uno de estos valores directamente desde el archivo de configuraci&oacute;n.
<p>
<li>
<i>Should we restrict console access to a small group of user accounts? - <strong>&iquest;Se debe
restringir el acceso a la consola a un peque&ntilde;o grupo de cuentas de usuario?</strong> [N]</i></li>

<br>En RedHat 6.0/6.1, los usuarios que se conectan inicialmente desde la consola se benefician
con ciertos privilegios como el poder montar el CD-ROM. Es posible restringir el acceso a la
consola a un grupo de usuario de confianza. Esta pregunta permite precisar dichos
usuarios si se opta por este tipo de pol&iacute;tica.</ul>

<A NAME="lfindex12">&nbsp;</A>
<H3>
Logging - Acceso al sistema</H3>

<font face="Courier New,Courier">syslog</font> es uno de los servicios m&aacute;s importantes
para detectar si una m&aacute;quina ha sido intervenida.
Este demonio registra ciertos sucesos que tienen lugar en el sistema. Se puede optar
por limitar la cantidad de informaci&oacute;n almacenada.
<p>Cabe destacar que si se elige un n&uacute;mero m&iacute;nimo de servicios, cualquier anomal&iacute;a en
los archivos <font face="Courier New,Courier">/var/log</font> se puede detectar f&aacute;cilmente
debido al peque&ntilde;o volumen de informaci&oacute;n guardada. En cambio, si el sistema posee
muchos servicios in&uacute;tiles los archivos
<font face="Courier New,Courier">/var/log</font> se vuelven inmensos y por lo tanto
dif&iacute;ciles de analizar (en este caso es necesario recurrir a guiones dedicados).</p>
<p>Este m&oacute;dulo agrega nuevos controles al archivo
<font face="Courier New,Courier">/etc/syslog.conf</font>.
<ul>
<li>
<i>Would you like to add additional logging? - <strong>&iquest;Desea a&ntilde;adir un acceso adicional
al sistema?</strong> [Y]</i></li>

<br>Bastille-Linux crea un archivo <font face="Courier
New,Courier">/var/log/kernel</font> para almacenar los mensajes del kernel
y los errores graves (los mensajes provenientes del cortafuegos pertenecen a la
primera categor&iacute;a). Determinadas informaciones se env&iacute;an a 2 terminales
(TTY 7 y TTY8). Un nuevo archivo
<font face="Courier New,Courier">/var/log/loginlog</font>
registra los usuarios que se conectan al sistema.
<p>
<li>
<i>Do you have a remote logging host? - <strong>&iquest;Dispone de acceso a un host remoto?</strong>  [N]</i></li>

<br>Salvo que posea otra m&aacute;quina hacia la que env&iacute;a sus mensajes, la respuesta
debe ser negativa.
<p>
<li>
<i>Would you like to set up process accounting? - <strong>&iquest;Desea activar la contabilidad
de procesos?</strong> [N]</i></li>

<br>En Linux, es posible registrar los comandos que han sido ejecutados, cu&aacute;ndo y por
qui&eacute;n. Si bien es &uacute;til para seguir de cerca las actividades de un hacker hace que
el archivo log r&aacute;pidamente se vuelva enorme. En pocas palabras, su uso consume espacio de
disco y tiempo de CPU. Conviene desactivar esta opci&oacute;n a menos que realmente
resulte necesario.</ul>

<A NAME="lfindex13">&nbsp;</A>
<H3>
MiscellaneousDaemons - Otros demonios</H3>

Siempre preocupados por la minimizaci&oacute;n, este m&oacute;dulo s&oacute;lo activa los servidores que
realmente se necesitan al iniciar el sistema. Por defecto, se desactivan casi todos
los servicios in&uacute;tiles. Se puede volver a activar un servicio mediante el comando
<font face="Courier New,Courier">chkconfig</font>.
<br>&nbsp;
<table BORDER WIDTH="70%" NOSAVE >
<tr>
<td><b>Servicios&nbsp;</b></td>

<td><b>Descripci&oacute;n</b></td>
</tr>

<tr>
<td>apmd</td>

<td>Se usa para controlar las baterias de las computadoras port&aacute;tiles.</td>
</tr>

<tr>
<td>NFS y samba</td>

<td>Para administrar sistemas de archivos compartidos ... si bien son muy &uacute;tiles
en redes heterog&eacute;neas son origen de enormes agujeros de seguridad.</td>
</tr>

<tr>
<td>atd</td>

<td>Todo lo que se puede hacer por intermedio de <font face="Courier New,Courier">atd</font>
se puede hacer mediante
<font face="Courier New,Courier">cron.</font></td>
</tr>

<tr>
<td>servicios PCMCIA</td>

<td>Si se tiene un dispositivo PCMCIA, lo que es frecuente en port&aacute;tiles pero
mucho m&aacute;s raro en estaciones de trabajo.</td>
</tr>

<tr>
<td>dhcpd</td>

<td>Servidor para proporcionar direcciones IP temporales. Este tipo de servicio
lo proporciona un Proveedor de Servicios de Internet (ISP) o se usa en una
red local.
</td>
</tr>

<tr>
<td>gpm</td>

<td>Se usa en modo consola (texto) para manejar el rat&oacute;n. A menos que se trabaje
a menudo en modo consola este servicio no sirve para nada.</td>
</tr>

<tr>
<td>servidor de noticias</td>

<td>Pocas personas necesitan de un servidor de noticias en sus m&aacute;quinas. En general,
es tarea del ISP.</td>
</tr>

<tr>
<td>routed</td>

<td>As&iacute; como el servidor de noticias es tarea del ISP, &eacute;l es tarea de su DNS.&nbsp;</td>
</tr>

<tr>
<td>NIS</td>

<td>Servicio muy pr&aacute;ctico en una red local...&iexcl;pero origen de muchos problemas desde
el punto de vista de la seguridad!</td>
</tr>

<tr>
<td>snmpd</td>

<td>Servidor destinado a la administraci&oacute;n de una red (estad&iacute;sticas, gesti&oacute;n
de usuarios,...)</td>
</tr>

<tr>
<td>sendmail</td>

<td>No es necesario ejecutarlo como demonio para permitir el env&iacute;o y recepci&oacute;n de
correo.
Adem&aacute;s, si recibe su correo de su ISP por POP o IMAP,
<font face="Courier New,Courier">sendmail</font> carece de utilidad y como
programa posee un gran historial de fallos...</td>
</tr>
</table>

<br>&nbsp;
<A NAME="lfindex14">&nbsp;</A>
<H3>
Sendmail</H3>

Como hemos mencionado previamente, <font face="Courier New,Courier">sendmail</font>
es un servicio que gestiona correo. Su historia esta plagada de agujeros de seguridad
provocados por la diversidad de tareas que tiene un servidor de correo
y los privilegios necesarios para llevarlas a cabo (resoluci&oacute;n de nombres, informaci&oacute;n
para syslog, etc...).
Adem&aacute;s de sus vulnerabilidades,
<font face="Courier New,Courier">sendmail</font> permite obtener informaci&oacute;n de un
usuario espec&iacute;fico de un servidor determinado. Por ejemplo, el comando
<font face="Courier New,Courier">sendmail EXPN</font> y
<font face="Courier New,Courier">VRFY</font> permiten saber a una persona si existe
una cuenta de usuario concreta.
<p>Como hemos dicho, no es necesario ejecutar <font face="Courier New,Courier">sendmail</font>
como demonio para enviar y recibir correo. Para un uso individual
<font face="Courier New,Courier">sendmail</font>
no sirve verdaderamente para nada ya que es suficiente con utilizar un cliente de correo
cualquiera
(<font face="Courier New,Courier">netscape</font>, <font face="Courier New,Courier">rmail</font>,
<font face="Courier New,Courier">pine</font>,
<font face="Courier New,Courier">mutt</font>,
etc...) para enviar correo. Para recibirlo, bastar&aacute; con activar
<font face="Courier New,Courier">sendmail</font>
a intervalos regulares para poder verificar el contenido de nuestra casilla de correos.
<br>&nbsp;
<ul>
<li>
<i>Do you want to leave sendmail running in daemon mode? - <strong>&iquest;Desea que sendmail
permanezca ejectu&aacute;ndose como demonio?</strong> [Y]</i></li>

<br>Como hemos visto en la mayor&iacute;a de los casos carece de utilidad y es sumamente peligroso
por lo tanto es conveniente desactivarlo.
<p>
<li>
<i>Would you like to run sendmail via cron to process the queue? - <strong>&iquest;Desea que sendmail
gestione a trav&eacute;s de cron la cola de espera de los mensajes?</strong> [N]</i></li>

<br>Si se contesta afirmativamente, <font face="Courier New,Courier">sendmail</font>
verificar&aacute; la cola de mensajes cada 15 minutos.
Es posible modificar este par&aacute;metro desde el archivo
<font face="Courier New,Courier">/etc/sysconfig/sendmail</font>.
<p>
<li>
<i>Would you like to disable the VRFY and EXPN sendmail commands? - <strong>&iquest;Desea
desactivar los comandos VRFY y EXPN de sendmail?</strong> [Y]</i></li>

<br>Estos comandos proporcionan informaci&oacute;n &uacute;tiles tanto a hackers como spammers.</ul>

<A NAME="lfindex15">&nbsp;</A>
<H3>
RemoteAcces - Acceso remoto</H3>

A menudo resulta &uacute;til poder conectarse a una m&aacute;quina sin estar f&iacute;sicamente pr&oacute;xima
a ella. Hemos visto que los <font face="Courier New,Courier">comandos r
</font> permiten hacer esto de una manera insegura. Bastille-Linux sugiere descargar
<font face="Courier New,Courier">ssh</font>.
Se trata de un programa que cifra los datos (y por lo tanto las contrase&ntilde;as) que
circulan a trav&eacute;s de una conexi&oacute;n.
<p>Se puede usar un programa donde el tama&ntilde;o de la <i>clave de sesi&oacute;n</i>
no supere los 128 bits (N.T: este l&iacute;mite var&iacute;a de acuerdo a las leyes propias
de cada pa&iacute;s). Expliquemos qu&eacute; es una clave de sesi&oacute;n. Se trata de la clave que servir&aacute;
para cifrar los datos. Esta clave se construye paso a paso por el cliente y el servidor y
resulta de un protocolo de intercambio de claves (Diffie-Hellman en la mayor&iacute;a de los
casos).&nbsp; El principio consiste en construir una clave con una parte de la clave de cada uno de
los participantes. Esta clave de sesi&oacute;n se usa para cifrar los datos en base a un algoritmo
sim&eacute;trico (es decir, se usa la misma clave tanto para cifrar como para descifrar datos).
As&iacute; DES, que sirve para cifrar las contrase&ntilde;as en Unix, es un algoritmo sim&eacute;trico que posee
una clave de 56 bits.</p>
<p>Ahora bien, una clave de 128 bits &iquest;es suficiente para garantizar la confidencialidad y
seguridad de una transacci&oacute;n?: &iexcl;S&Iacute;!.  A&uacute;n cuando actualmente DES no se considere
"muy segura", los mejores ataques no est&aacute;n al alcance de todo el mundo. Por otra parte, es
un error com&uacute;n creer que una clave de tama&ntilde;o <i>2k</i> es dos veces m&aacute;s dif&iacute;cil de romper que otra
de tama&ntilde;o <i>k</i>. De hecho, la dificultad se incrementa mucho m&aacute;s r&aacute;pido que el tama&ntilde;o
de la clave.&nbsp;Para una clave de tama&ntilde;o <i>k</i>, existen <i>2^k</i> claves posibles
(y por lo tanto 2^2k para una clave de tama&ntilde;o 2k). Por lo tanto, al duplicar el tama&ntilde;o
de una clave estamos agregando&iexcl;&nbsp;
<img src="../../common/images/article166/image166-2.png" height=41 width=64 align=ABSCENTER>
claves posibles! Cuando uno comprueba la verdadera dificultad que implica romper a DES
(56 bits) uno espera que las claves de sesi&oacute;n de 128 bits ofrezcan una seguridad
inviolable (suponiendo que el algoritmo de cifrado/descifrado no contenga agujeros de
seguridad).&nbsp; Desde el punto de vista de un atacante, el aumentar este l&iacute;mite
hace que la dificultad pase de un nivel imposible a otro "a&uacute;n m&aacute;s imposible".
</p>
<p>Cuatro programas diferentes que proporcionan servicios parecidos:
<li>
<font face="Courier New,Courier">ssh 1.2.x</font> : un sistema cliente-servidor
para establecer conexiones cifradas;</li>

<li>
<font face="Courier New,Courier">ssh 2.x</font> : id&eacute;ntico al anterior pero con
menos fallos y m&aacute;s posibilidades;</li>

<li>
<font face="Courier New,Courier">OpenSSH</font> : una versi&oacute;n similar a la anterior
pero bajo licencia BSD;</li>

<li>
<font face="Courier New,Courier">ssf </font>: como <font face="Courier New,Courier">ssh</font>,
pero adaptado a la legislaci&oacute;n francesa</li>
</ol>

<p>Los restantes m&oacute;dulos est&aacute;n relacionados con servicios. La pol&iacute;tica que se toma para
ellos puede parecer sorprendente: se empieza por restringir los privilegios y se termina
por detenerlos. Contrariamente a lo que podr&iacute;a pensarse, estas dos medidas no
son contradictorias. En efecto, estos servicios se pueden reactivar en cualquier
momento, ya sea accidentalmente o por alg&uacute;n intruso...con lo cual resulta
conveniente restringir sus privilegios.

<A NAME="lfindex16">&nbsp;</A>
<H3>
DNS</H3>

Un DNS (Domain Name Server) pemite vincular una direcci&oacute;n IP con el nombre de una
m&aacute;quina y viceversa.
Por ejemplo, la direcci&oacute;n 198.186.203.36 corresponde a www.bastille-linux.org.
La funci&oacute;n principal de este servidor se denomina BIND (to bind significa,
entre otras cosas, vincular). &Uacute;ltimamente, se ha descubierto un ataque de
tipo DoS contra BIND. Se lo puede evitar, dando acceso DNS a un grupo reducido
de directorios (antes de ejecutar un comando o gui&oacute;n , se puede cambiar el
directorio ra&iacute;z - por defecto / - mediante el comando
<font face="Courier New,Courier">chroot</font>).
<p>Agreguemos algunas observaciones t&eacute;cnicas antes de detallar el comportamiento
de Bastille-Linux. El demonio asociado a este servicio se denomina
<font face="Courier New,Courier">named</font>.
Su configuraci&oacute;n proviene del archivo
&nbsp; <font face="Courier New,Courier">/etc/named.conf</font>.
<br>&nbsp;
<ul>
<li>
<i>Would you like to chroot <font face="Courier New,Courier">named</font> and
set it to run as a non-root user? -  <strong>&iquest;Desea cambiar el directorio ra&iacute;z de
named y ejecutarlo como un usuario normal?</strong> [N]</i></li>
<br>Para hacer todo esto, Bastille-Linux crea un nuevo usuario denominado
<i>dns</i> que no posee int&eacute;rprete de comandos sino &uacute;nicamente
su propio directorio &nbsp; <font face="Courier New,Courier">/home/dns</font>.&nbsp;
En el interior se reconstruye la arquitectura de un sistema cl&aacute;sico agregando los
directorios usuales (<font face="Courier New,Courier">/usr</font>,
<font face="Courier New,Courier">/etc</font>,
<font face="Courier New,Courier">/var</font>,
etc ...). A continuaci&oacute;n, se copian los archivos de configuraci&oacute;n y bibliotecas
que necesita el demonio. Son necesarias otras peque&ntilde;as modificaciones
(para <font face="Courier New,Courier">syslog</font>
por ejemplo ver el gui&oacute;n <font face="Courier New,Courier">DNS.pm</font>).
Ahora el DNS tiene su propio entorno :)
<p>
<li>
Would you like to deactivate named, at least for now? - <strong>&iquest;Desea desactivar
moment&aacute;neamente a named?</strong> [Y]</li>

<br>La mayor&iacute;a de las personas no necesitan poseer un servidor de nombre
en sus m&aacute;quinas ya que el ISP les brinda dicho servicio. El COMO-DNS
describe la instalaci&oacute;n de un cach&eacute; para la resoluci&oacute;n de nombres pero
a&uacute;n as&iacute; puede ser origen de problemas.</ul>

<A NAME="lfindex17">&nbsp;</A>
<H3>
Apache</H3>

<font face="Courier New,Courier">Apache</font> es el servidor web m&aacute;s utilizado
de Internet. Un servidor de este tipo es &uacute;til en dos casos:
<ol>
<li>
para albergar un sitio web: en este caso es necesaria una direcci&oacute;n IP fija.
Los ISP (Proveedores de Servicios de Internet) tienen esta clase de direcciones lo cual no es el caso de sus clientes.</li>
<li>
para probar nuestras propias p&aacute;ginas web: en este caso bastar&aacute; con activar el servidor
(<font face="Courier New,Courier">/etc/rc.d/init.d/httpd start</font>) en el momento
apropiado.</li>
</ol>
El archivo para configurar este demonio se encuentra en
<font face="Courier New,Courier">/etc/httpd/conf</font>.
<ul>
<li>
<i>Would you like to deactivate the Apache web server? - <strong>&iquest;Desea desactivar el
servidor web Apache?</strong> [Y]</i></li>

<br>Puesto que no siempre se lo necesita y en aras de la minimizaci&oacute;n lo desactivamos.
<p>
<li>
<i>Would you like to bind the web server to listen only to the localhost? - <strong>&iquest;Desea
vincular al servidor web para que "escuche" solamente al localhost?</strong> [N]</i></li>

<br>Es posible vincular al demonio <font face="Courier New,Courier">httpd</font>
a una direcci&oacute;n espec&iacute;fica. Aqu&iacute;, Bastille-Linux propone conectarlo a la direcci&oacute;n
del <font face="Courier New,Courier">localhost</font>
127.0.0.1. Esto permite tener en ejecuci&oacute;n un servidor en una m&aacute;quina para probar
nuestras propias p&aacute;ginas web.
<br>Se podr&aacute;n acceder a ellas desde la direcci&oacute;n:
<center><font face="Courier New,Courier">http://localhost/</font>
(o <font face="Courier New,Courier">http://localhost/raynal</font>
para acceder a nuestras p&aacute;ginas web personales)</center>
Es decir <font face="Courier New,Courier">Apache</font> usa la interfaz
<font face="Courier New,Courier">loopback</font>
(<font face="Courier New,Courier">lo</font>) para funcionar.
<p>
<li>
<i>Would you like to bind the web server to a particular interface? - <strong>&iquest;Desea
vincular al servidor web con una interfaz particular?</strong> [N]</i></li>

<br>Al responder aqu&iacute; afirmativamente anula la respuesta precedente.
Hemos dicho que quer&iacute;amos usar el servidor web con el
<font face="Courier New,Courier">loopback</font>
... y esta pregunta permite precisar otra interfaz (Ethernet, por ejemplo)
mediante una direcci&oacute;n IP que le es asociada.
<p>
<li>
<i>Would you like to deactivate the following of symbolic links? - <strong>&iquest;Desea
desactivar el seguimiento de enlaces simb&oacute;licos?</strong>  [Y]</i></li>

<br>Es imperativo responder afirmativamente. De la misma manera que el DNS
funciona en un espacio restringido, no se debe permitir a
<font face="Courier New,Courier">Apache</font> salir de su universo
(es decir, <font face="Courier New,Courier">/home/httpd</font>). Por ejemplo,
si uno de los usuarios posee, en su directorio para el servidor web, un enlace
al directorio ra&iacute;z <font face="Courier New,Courier">/</font>, todo el mundo
puede acceder a todos los archivos...en particular a los archivos de configuraci&oacute;n
del tipo <font face="Courier New,Courier">passwd</font> entre otros.
<p>
<li>
<i>Would you like to deactivate server-side includes? - <strong>&iquest;Desea desactivar
los "server-side includes"?</strong> [Y]</i></li>

<br>Como dice Jay Beale: si no sabe de qu&eacute; se trata es porque no lo necesita.
Baste con saber que se puede configurar para que los usuarios puedan ejecutar
cualquier programa en el servidor (y s&iacute;...tiemblen amigos administradores
...ser&iacute;a un pesadilla para ustedes ;-)
<p>
<li>
<i>&nbsp;Would you like to disable CGI scripts, at least for now? - <strong>&iquest;Desea
moment&aacute;neamente desactivar los guiones CGI?</strong> [Y]</i></li>

<br>Escribir un gui&oacute;n CGI (Common Gateway Interface) no es extremadamente
dif&iacute;cil pero se necesitan tomar ciertas precauciones (sobrecargar la pila,
por ejemplo, genera archivos core en el servidor). Gran cantidad de m&eacute;todos
actuales para atacar a un sistema explotan los errores cometidos en estos
guiones.
<p>
<li>
<i>Would you like to disable indexes? - <strong>&iquest;Desea deshabilitar los archivos
&iacute;ndex</strong> [N]</i></li>
<br>Ante la ausencia de un archivo <font face="Courier
New,Courier">index.html</font> en un directorio, Apache lista todos
los archivos que contiene. Esto es menos grave que permitir la lectura de
los enlaces simb&oacute;licos. No obstante imaginen que un determinado
directorio contenga datos importantes.
</ul>
Un servidor, como cualquier otro servidor, puede ser una invitaci&oacute;n
a visitar nuestra m&aacute;quina y, quiz&aacute;s, a da&ntilde;arla si encuentra incorrectamente
configurada. Esto puede resultar bastante molesto en algunos casos.
Supongamos por ejemplo, el caso de un banco, si se pueden leer los
nombres de sus clientes (y quiz&aacute;s sus contrase&ntilde;as)...visiten la p&aacute;gina
<a href="http://www.kitetoa.com">www.kitetoa.com</a>,
que no se van a arrepentir ;-) (N.T: desgraciadamente est&aacute;
solamente en franc&eacute;s)

<A NAME="lfindex18">&nbsp;</A>
<H3>
Printing - Imprimir</H3>

Una &uacute;nica pregunta: &iquest;imprimir&aacute; con su m&aacute;quina?. Si la respuesta es negativa
Bastille-Linux desactiva el demonio
<font face="Courier New,Courier">lpd</font> y elimina el bit SUID
de <font face="Courier New,Courier">lpr</font> y <font face="Courier New,Courier">lprm</font>.

=============
<A NAME="lfindex19">&nbsp;</A>
<H3>
FTP</H3>

Desde el punto de vista de la seguridad, <font face="Courier New,Courier">FTP</font>
puede ser el origen de diversos problemas . Por ejemplo, al iniciar una conexi&oacute;n
las contrase&ntilde;as circulan en texto plano. Lo mismo sucede con los datos, lo cual es peligroso
si los datos son confidenciales (datos m&eacute;dicos, financieros...)
<p>Por otra parte, &uacute;ltimamente se han encontrado algunos agujeros de seguridad en
<font face="Courier New,Courier">wu-ftpd</font>. Recordemos, que no es en absoluto
necesario tener el servidor ejecut&aacute;ndose para hacer transferencias via FTP.

<p>El archivo que controla el acceso al servidor <font face="Courier New,Courier">FTP</font>
es <font face="Courier New,Courier">/etc/ftpacces</font>.
<ul>
<li>
<i>Would you like to disable user privileges on the FTP daemon? - <strong>&iquest;Desea
eliminar los privilegios de los usuarios para el demonio FTP?</strong> [N]</i></li>

<br>Uno de los inconvenientes del FTP es que permite conexiones an&oacute;nimas.
Otro, es que permite "subir" archivos (es decir, enviar archivos al servidor). Numerosos ataques
se aprovechan de estas vulnerabilidades.
Por otra parte algunos problemas provienen del hecho de que las transacciones no
son seguras (es decir, los datos no son cifrados).
<p>
<li>
<i>Would you like to disable anonymous download? - <strong>&iquest;Desea anular las descargas
an&oacute;nimas?</strong> [N]</i></li>

<br>Esto impide las conexiones al servidor del tipo
<font face="Courier New,Courier">anonymous</font>.</ul>

<A NAME="lfindex20">&nbsp;</A>
<H3>
&Uacute;ltimos trucos y consejos</H3>

Como lo he subrayado anteriormente, Bastille-Linux constituye una formidable herramienta pedag&oacute;gica.
Tanto las propias preguntas como los comentarios son bien precisos. Cuando las cosas no son
lo suficientemente claras, se dispone de una gran diversidad de recursos para encontrar la
respuesta correcta. La mejor manera de aprender sobre un determinado tema, consiste en
usar &uacute;nicamente el m&oacute;dulo deseado.
<p>Para ello bastar&aacute; con hacer una copia de respaldo del archivo que contiene las preguntas
y editar el archivo Questions.txt. Cada m&oacute;dulo empieza con la palabra clave FILE...
s&oacute;lo resta conservar lo que deseamos realmente nos interesa.
<blockquote><font face="Courier New,Courier">/root/Bastille >> cp Questions.txt
Questions.txt-orig</font>
<br><font face="Courier New,Courier">/root/Bastille >> emacs Questions.txt
BackEnd.pl &amp;</font>
<br><font face="Courier New,Courier">/root/Bastille >> ./InteractiveBastille</font></blockquote>
</p>
<p>
Obviamente las medidas tomadas por astille-Linux no son suficientes para garantizar
la seguridad de nuestro sistema:
<ol>
  <li>ning&uacute;n sistema es 100% seguro;
  <li>son indispensables otras medidas para completar las sugeridas por la Bastille-Linux.
</ol>
Entre las medidas indispensables que se pueden agregar podemos pensar inmediatamente en un
analizador de archivos log (portsentry, snort, snplog, etc ...), en un parche de
<a href="http://www.openwall.com">www.openwall.com</a> para el kernel (pila no ejecutable,
restriciones sobre los directorios /tmp y /proc, etc...).
</p>
<p>
El camino para proteger un sistema es arduo e interminable. Se debe estar continuamente
al tanto sobre los agujeros de seguridad (a trav&eacute;s de listas de correos como la bugtraq
del sitio securityfocus, por ejemplo).
</p>

<A NAME="lfindex21">&nbsp;</A>
<H3>
Conclusi&oacute;n</H3>

Bastille-Linux ayuda a proteger una distribuci&oacute;n Linux con mala reputaci&oacute;n en el &aacute;mbito
de la seguridad. Puede que digas: &iquest;por qu&eacute; entonces no elegir otra?. Es verdad, pero
Red Hat (o Mandrake ya que las diferencias son m&iacute;nimas) posee ciertas caracter&iacute;sticas agradables.
El objetivo del presente art&iacute;culo no es el promover (o denigrar) a una determinada
distribuci&oacute;n. Despu&eacute;s de todo, la libertad de elecci&oacute;n es una de las fortalezas
del software libre. De hecho, este art&iacute;culo posee diversos cometidos. Ante todo, mostrar
la preocupaci&oacute;n permanente de un administrador de sistemas que vive con el temor de
ver su red destruida por algunos hackers inescrupulosos. Por otra parte, esta herramienta
les permitir&aacute; hacer una profunda visita a la configuraci&oacute;n del sistema. Bajo esta &oacute;ptica,
resulta ser un medio excelente, tanto para los ne&oacute;fitos como para los usuarios avanzados,
para explorar y descubrir los rincones ocultos de la configuraci&oacute;n de un sistema Linux.
<p>Las dos premisas fundamentales son el minimalismo y la profundidad.
Cuanto menos servicios existan en nuestra m&aacute;quina menor ser&aacute;n los agujeros de seguridad.
Para cada uno de estos servicios, muchas protecciones valen m&aacute;s que una sola...pero
esto es un arma de doble filo pues una protecci&oacute;n mal configurada (or la conjunci&oacute;n
de muchas de ellas) se pueden volver en nuestra contra.
</p>
<p>Por &uacute;ltimo, se&ntilde;alemos que la pr&oacute;xima versi&oacute;n de este programa se llamar&aacute; BUS
(Bastille Unix Security). Se tratar&aacute; de una juiciosa combinaci&oacute;n entre Bastille-Linux
y Msec (Mandrake Security Proyect) el cual se denominar&aacute; pronto Usec (Unix Security Project).</p>

<p></p>
<hr>
<A NAME="lfindex22">&nbsp;</A>
<H3>
Referencias</H3>


<ul>
<li>
<a href="http://bastille-linux.sourceforge.net">http://bastille-linux.sourceforge.net</a>
:&nbsp; Sitio oficial de Bastille-Linux</li>

<li>
Bastille-Linux: A Walkthrough : en el sitio <a href="http://www.securityfocus.com">www.SecurityFocus.com</a>.
Este art&iacute;culo est&aacute; en ingl&eacute;s y fue escrito por Jay Beale, autor principal de la Bastille-Linux.
Presenta al programa y su instalaci&oacute;n. Me result&oacute; de suma ayuda al escribir el presente art&iacute;culo
;-)</li>

<li>
<a href="http://www.sans.org">http://www.sans.org</a> : el sitio del grupo
SANS (Jay Beale colabora con ellos).&nbsp; Fuente inagotable de informaci&oacute;n sobre seguridad
computacional.</li>

<li>
<a href="http://www.securityfocus.com/frames/?content=/vdb/stats.html">http://www.securityfocus.com/frames/?content=/vdb/stats.html</a>:&nbsp;
siempre en SecurityFocus, muestra un interesante estudio sobre los sistemas operativos y sus fallos.
El primer lugar lo ocupa una familia de sistemas operativos muy conocidos y a continuaci&oacute;n
Linux (sin hacer hincapi&eacute; en alguna distribuci&oacute;n en particular)</li>

<li>
<a href="http://www.kitetoa.com">www.kitetoa.com</a> : un sitio que se dedica a probar servidores web
y a encontrar cosas interesantes.&nbsp; Pat&eacute;tico y divertido a la vez. -Solamente en Franc&eacute;s-
</li>

<li>
<a href="http://www.ssh.com/">http://www.ssh.com</a> : sitio oficial del <i>secured
shell. ssh</i> es de uso gratuito para evaluaci&oacute;n, uso no comercial o para
&aacute;mbitos universitarios (...no en Francia)
</li>

<li>
<a href="http://www.openssh.org">http://www.openssh.org</a> : lo mismo que ssh ...
pero bajo licencia BSD&nbsp; :)</li>

</ul>

<hr>
<br><!-- hhmts start -->Last modified: Mon Jun 12 16:40:50 CEST 2000<!-- hhmts end -->



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=166&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Fr&eacute;d&eacute;ric Raynal, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article166.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:pappy@users.sourceforge.net"><FONT COLOR="#FFFFFF">Fr&eacute;d&eacute;ric Raynal</FONT></a></font></td>
</tr>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>en</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:wecharri@yahoo.com"><FONT COLOR="#FFFFFF">Walter Echarri</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-06-15, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
