<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_1.8">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Community">
 <TITLE>Community : Analizando Vector Linux</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/SujanSwearingen.gif" WIDTH=100 HEIGHT=100 ALT="[Photo of the Author]">
<BR>por  <A HREF="mailto:swear000@uwp.edu">Sujan Swearingen</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Soy nuevo en la Universidad de Wisconsin- Parkside. Anteriormente a estar envuelto en investigaciones gen&eacute;ticas, trabaj&eacute; como t&eacute;cnico de laboratorio en una universidad local donde usaba una gran variedad de plataformas. Estas inclu&iacute;an AS/400, UNIX, NT, Apple, OS/2, y entornos Netware. Antes de esto, contribu&iacute; al desarrollo de <A HREF="http://www.racinecounty.com/">http://www.racinecounty.com/</A>. Fue aqu&iacute; donde me introduje en el mundo Linux. Desde entonces me he estado esforzando por conocer el sistema operativo que est&aacute; revolucionando continuamente la tecnolog&iacute;a.</P>
<P><FONT COLOR="#336633">Contenidos</FONT>:
<UL>
  <LI><A HREF="#lfindex0">OBJETIVO:</A></LI>
  <LI><A HREF="#lfindex1">ESQUEMA DE ESTUDIO:</A></LI>
  <LI><A HREF="#lfindex2">RESULTADOS:</A></LI>
  <LI><A HREF="#lfindex3">CONCLUSI&Oacute;N:</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=168&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Analizando Vector Linux</H2>
 <IMG SRC="../../common/images/article168/pic.gif" WIDTH=100 HEIGHT=100 ALT="[Illustration]"><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
<P>En este art&iacute;culo re-examinaremos la versatilidad de Linux. Nuestro estudio se enfocar&aacute; a una pseudo mini distribuci&oacute;n de Linux conocida como <A HREF="http://www.vectorlinux.50megs.com/">Vectorlinux</A>. Su p&aacute;gina web reza: "LA MEJOR MINI DISTRIBUCI&Oacute;N LINUX QUE NUNCA HAS USADO". Decid&iacute; ver si esto era verdad instalando la distribuci&oacute;n en una m&aacute;quina en la que corr&iacute;a una instalaci&oacute;n base de <A HREF="http://sunsite.auc.dk/mulinux/">muLinux</A> . La instalaci&oacute;n actual de VectorLinux requiere t&eacute;cnicas de particionamiento muy interesantes con el uso de varias utilidades de disco. El resultado es, sin embargo un sistema muy capaz.</P></P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>OBJETIVO:</H2>

<P>La mayor&iacute;a de las instalaciones Linux utilizan el CD-ROM como soporte para la distribuci&oacute;n de los archivos. Por tanto, la dificultad se encuentra al intentar instalar la distribuci&oacute;n en una m&aacute;quina con capacidad limitada y sin CD-ROM. Mientras algunas distribuciones proporcionan tama&ntilde;os del sistema de archivo que caven en el disco, no proporcionan a la vez algunas caracter&iacute;sticas importantes, proporcionan una versi&oacute;n menos reciente del kernel, o faltan las capacidades relacionadas con las &uacute;ltimas tendencias de desarrollo. </P>
<P>Hacia donde VectorLinux enfoca su preocupaci&oacute;n es al borrado de suficientes cosas superfluas como para construirse sobre los aspectos funcionales de un sistema operativo.</P>
<P>VectorLinux enumera las siguientes caracter&iacute;sticas:</P>

<UL><DIR>
<DIR>


<UL>
<B><FONT COLOR="#800000"><BLOCKQUOTE><LI>Tama&ntilde;o reducido a pesar del desarrollo completo del sistema Xwindow.</LI></BLOCKQUOTE>
<BLOCKQUOTE><LI>Instalaci&oacute;n medianamente sencilla con solamente la descarga de dos archivos.</LI></BLOCKQUOTE>
<BLOCKQUOTE><LI>Uso combinado de Icewm y Dfm para el entorno de ventanas X.</LI></BLOCKQUOTE>
<BLOCKQUOTE><LI>Contiene gcc y g++ para poder compilar tus aplicaciones.</LI></BLOCKQUOTE>
<BLOCKQUOTE><LI>Contiene un cliente de correo, un gestor de archivos, Netscape 4.7, lynx, Xv, y alberga otras muchas aplicaciones.</LI></BLOCKQUOTE>
<BLOCKQUOTE><LI>Versi&oacute;n del kernel 2.2.14 y glibc6-2.1.3</B></FONT> </LI></BLOCKQUOTE>
<B><FONT COLOR="#800000"><BLOCKQUOTE><LI>GTK y glib 1.2.7 Imlib 1.98 etc</B></FONT> </LI></BLOCKQUOTE>
<B><FONT COLOR="#800000"><BLOCKQUOTE><LI>Cliente de Icq as&iacute; como de irc (Xchat 1.40)</B></FONT> </LI></BLOCKQUOTE>
<B><FONT COLOR="#800000"><BLOCKQUOTE><LI>La mayor&iacute;a de las aplicaciones est&aacute;n basadas &uacute;nicamente en una librer&iacute;a GTK (manteniendo el espacio al m&iacute;nimo)</B></FONT> </LI></BLOCKQUOTE>
<B><FONT COLOR="#800000"><BLOCKQUOTE><LI>La instalaci&oacute;n completa requiere solo 175 megas de espacio en disco.</LI></BLOCKQUOTE></UL>
</DIR>
</DIR>
</UL>

</B></FONT><BLOCKQUOTE>--Sacado del web de Vectorlinux.--</BLOCKQUOTE>
<P>El objetivo es ver si esta distribuci&oacute;n puede ser instalada en un disco duro de 340 MB.</P>
<A NAME="lfindex1">&nbsp;</A>
<H2>ESQUEMA DE ESTUDIO:</H2>

<P>El host fue recuperado de la consulta de un dentista que hab&iacute;a actualizado su sistema a un Pentium II. El sistema era originariamente usado para guardar las citas mediante un programa DOS. Sin embargo, el programa dej&oacute; de funcionar despu&eacute;s del paso al a&ntilde;o 2000. La &uacute;nica opci&oacute;n en este punto era remplazar el software con uno compatible con el a&ntilde;o 2000.</P>
<H4>&nbsp;</H4>
<H4>Estrategia y Materiales</H4>
<P>Las especificaciones de la m&aacute;quina host eran:</P>

<UL>
<LI>Intel&trade; 486DX2 (Cannon Innova 486v) </LI>
<LI>340 MB HDD </LI>
<LI>Tarjeta gr&aacute;fica Cirrus Logic GD5428 </LI>
<LI>Monitor WEN Technologies </LI>
<LI>teclado de 101 teclas Canon </LI>
<LI>Rat&oacute;n tipo PS/2</LI></UL>

<P>La documentaci&oacute;n del proceso de instalaci&oacute;n era f&aacute;cil de leer y entender. Saqu&eacute; una copia impresa para tenerla a mano. Adem&aacute;s, es un buen lugar para escribir las anotaciones durante la instalaci&oacute;n. Por ejemplo, tuve que abrir la caja para enterarme de que el chip de la tarjeta gr&aacute;fica era un Cirrus Logic GD5428. Esta informaci&oacute;n me fue de utilidad cuando ejecut&eacute; XF86Setup. </P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=8 WIDTH=480>
<TR><TD VALIGN="MIDDLE" BGCOLOR="#c0c0c0">
<P><TBODY></P>
<FONT FACE="Helvetica,Arial" SIZE=2><P ALIGN="CENTER">El comando <B>df</P>
</B><P ALIGN="CENTER">Los ficheros se almacenan en sistema de archivos que corresponde con un &aacute;rea concreta de disco. El n&uacute;mero de bloques disponibles y la localizaci&oacute;n de cada sistema de archivos es suministrada por el comando. df. El espacio en disco es asignado en unidades llamadas bloques; un bloque suele ser de 512 o 1024 caracteres dependiendo del sistema. En un sistema, el espacio en disco es siempre un requerimiento m&iacute;nimo. El comando es &uacute;til si se planea crear archivos grandes o chequear el espacio de disco disponible.</P>
<P></TBODY></FONT></TD>
</TR>
</TABLE>
</CENTER></P>

<P ALIGN="CENTER">&nbsp;</P>
<P>Originalmente, ten&iacute;a el DOS instalado en una peque&ntilde;a partici&oacute;n lo suficientemente grande como para mantener una instalaci&oacute;n m&iacute;nima de este sistema operativo. Ten&iacute;a adem&aacute;s una partici&oacute;n Swap Linux de 40 MB y el resto del espacio dedicado a muLinux.. Me baj&eacute; el archivo veclinux.bz2 (~60MB) al directorio /tmp directory de mi muLinux. El desaf&iacute;o vino cuando tuve que mover el fichero veclinux.bz2 a un directorio de DOS. Esto le permitir&iacute;a al instalador encontrar el archivo en la localizaci&oacute;n especificada y en el tipo de sistema de archivos especificado. Supuestamente el instalador pod&iacute;a instalar desde una partici&oacute;n ext2 a otra ext2, sin embargo, esto no era una opci&oacute;n para mi. Hab&iacute;a dudas sobre el hecho de que la partici&oacute;n que ten&iacute;a muLinux estuviera entre la de swap y la DOS. En otras palabras estaba entre la espada y la pared. La mayor&iacute;a del espacio disponible estaba del lado de la partici&oacute;n mnuLinux. La instalaci&oacute;n hab&iacute;a cogido unos 170 MB de espacio no disponible. Afortunadamente, hab&iacute;a una soluci&oacute;n...</P>
<P>FIPS es una utilidad que permite de forma segura redimensionar particiones sin destruir los datos. Usar esta herramienta en conjunci&oacute;n con de defragmentador es, por decir algo, muy recomendable. El defragmentador de DOS permite que m&aacute;s clusters est&eacute;n disponibles cuando FIPS est&aacute; redimensionado. Adem&aacute;s evita que FIPS falle al identificar el cluster final de la partici&oacute;n. </P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=8 WIDTH=480>
<TR><TD VALIGN="MIDDLE" BGCOLOR="#c0c0c0">
<P><TBODY></P>
<FONT FACE="Helvetica,Arial" SIZE=2><P ALIGN="CENTER">El comando <B>rm -r</B> </P>
<P ALIGN="CENTER">Usando rm –r en el nivel m&aacute;s alto de una jerarqu&iacute;a de directorios se borra recursivamente todos los subdirectorios por debajo de este.</P>
<P ALIGN="CENTER">Ocasionalmente, sin embargo, un usuario intentar&aacute; hasta cansarse borrar un determinado archivo, no importa lo creativo que sea usando rm. En este momento, es cuando &eacute;l te pide ayuda. Si hay una forma de conseguirlo usando rm, cuentasela.</P>
<P></TBODY></FONT></TD>
</TR>
</TABLE>
</CENTER></P>

<P ALIGN="CENTER">De cualquier forma, despu&eacute;s de eliminar la instalaci&oacute;n de muLinux (excepto el directorio /tmp) con rm –r comenc&eacute; a redimensionar las particiones. B&aacute;sicamente cog&iacute; todo el espacio de disco que pude menos la partici&oacute;n que conten&iacute;a el fichero veclinux.bz2 y un poco menos. El comando df mostr&oacute; lo siguiente cuando lo ejecut&eacute; desde el disquete de instalaci&oacute;n de VectorLinux:</P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=1 WIDTH=480>
<TR><TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<P><TBODY><FONT FACE="Arial" SIZE=2 COLOR="#ffffff">Filesystem </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">1k-blocks </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">Used </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">Available </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">Use% </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>Mounted on </FONT></TD>
</TR>
<TR><TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>/dev/ram0 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">2971 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">2720 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">251 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">92% </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>/ </FONT></TD>
</TR>
<TR><TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>/dev/hda4 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">69102 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">67064 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">2008 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">97% </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>/DOS </TBODY></FONT></TD>
</TR>
</TABLE>
</CENTER></P>

<P ALIGN="CENTER">&nbsp;</P>
<P>La instalaci&oacute;n es casi directa una vez se han establecido las particiones. Despu&eacute;s de cambiar al directorio que contiene los archivos de instalaci&oacute;n de VectorLinux (normalmente c:\veclinux), uno debe ejecutar ram.bat. Este archivo de proceso por lotes lee una imagen que gu&iacute;a al usuario a trabes del proceso de instalaci&oacute;n. Despu&eacute;s de ingresar como root y de seleccionar el m&eacute;todo de instalaci&oacute;n, se pide al usuario que monte la partici&oacute;n que contiene veclinux.bz2. El programa de setup crea un archivo temporal de swap de 8MB, despu&eacute;s de montar la partici&oacute;n que contiene veclinux.bz2 y la partici&oacute;n destino. Luego pregunta al usuario si se debe chequear veckubyx,bx2. Esto ayuda a asegurar que la distribuci&oacute;n est&aacute; completa y es completamente legible. Despu&eacute;s del CRC (chequeo de redundancia c&iacute;clica) el instalador formatea la partici&oacute;n destino. En un 486 esto tarda un rato. En este momento, se indica al usuario que se va a reiniciar.</P>
<A NAME="lfindex2">&nbsp;</A>
<H2>RESULTADOS:</H2>

<P>Al rearrancar el sistema, la pantalla parpadea y aparece el prompt de LILO. Primero, permit&iacute; a la m&aacute;quina arrancar en la partici&oacute;n DOS para asegurarme de que los archivos originales segu&iacute;an estado guardados. Despu&eacute;s de asegurarme la accesibilidad, rearraqu&eacute; otra vez. Esta vez seleccion&eacute; la partici&oacute;n Linux. La pantalla de arranque normal de Linux apareci&oacute; y hab&iacute;a unos pocos drivers que se estaban cargando sin ser necesarios. Una recompilaci&oacute;n del kernel deber&iacute;a solucionar el problema. Una vez dentro, me fue posible configurar lilo (adem&aacute;s de las X, ppp, etc.). Conoc&iacute;a como hacer estas cosas porque el creador de VectorLinux fue tan amable de dejarme un mensaje de correo para leer durante la primera entrada en el sistema.. Esta y otras caracter&iacute;sticas similares lo hacen muy bueno para principiantes y veteranos.</P>
<P>La instalaci&oacute;n proporciona los siguientes par&aacute;metros de uso del disco:</P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=1 WIDTH=480>
<TR><TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<P><TBODY><FONT FACE="Arial" SIZE=2 COLOR="#ffffff">Filesystem </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">1k-blocks </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">Used </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">Available </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">Use% </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>Mounted on </FONT></TD>
</TR>
<TR><TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>/dev/hda1 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">259860 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">178651 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">73156 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">71% </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>/ </FONT></TD>
</TR>
<TR><TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>/dev/hda4 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">69102 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">67064 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">2008 </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P ALIGN="RIGHT">97% </FONT></TD>
<TD WIDTH="17%" VALIGN="MIDDLE" BGCOLOR="#000000">
<FONT FACE="Arial" SIZE=2 COLOR="#ffffff"><P>/DOS </TBODY></FONT></TD>
</TR>
</TABLE>
</CENTER></P>

<P>Esta configuraci&oacute;n se puede usar. La partici&oacute;n /DOS est&aacute; bien para backup. Si le pasa algo a VectorLinux, puedes arrancar en la partici&oacute;n DOS y volver a ejecutar el instalador. Si te f&iacute;as suficientemente del instalador, puedes a&ntilde;adirlo como espacio extra para alguna partici&oacute;n. Personalmente, creo que a&ntilde;adirlo a la partici&oacute;n de swap puede ser una buena idea.</P>
<P>&nbsp;</P>
<A NAME="lfindex3">&nbsp;</A>
<H2>CONCLUSI&Oacute;N:</H2>
<IMG SRC="../../common/images/article168/dna.gif" ALIGN="RIGHT" WIDTH=83 HEIGHT=150>
<P>Esta distribuci&oacute;n sobrepasar&aacute; las expectativas de la mayor&iacute;a de los usuarios de una mini-distribuci&oacute;n..La distribuci&oacute;n est&aacute; adem&aacute;s preparada para manejar un corte de alimantaci&oacute;n recuperandose sin problemas. Sin embargo, configurar las X con XF86Setup provoc&oacute; errores de segmentaci&oacute;n y cuelges. XWindows funcionar&aacute; pero es necesaria una revisi&oacute;n. Para que te hagas una idea, se tomar&aacute; la mayor parte del d&iacute;a en cargar el Netscape. Yo lo borr&eacute; y voy a instalar algo comparable.</P>
<P>Pretendo usar el nuevo sistema configurado para que trabaje como una estaci&oacute;n bioinform&aacute;tica. El potencial de VectorLinux en el manejo de esta tarea parece ser prometedor.</P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0 CELLPADDING=8 WIDTH=540>
<TR><TD VALIGN="MIDDLE" BGCOLOR="#ffff00">
<P><TBODY><FONT FACE="Helvetica,Arial" SIZE=2>Nota: El problema del a&ntilde;o 2000 ha sido resuelto ejecutando el programa hwclock para actualizar la hora del sistema. </TBODY></FONT></TD>
</TR>
</TABLE>
</CENTER></P>

<H2 ALIGN="CENTER">REFERENCIAS:</H2>
<P>Bourne, Stephen R. <U>The UNIX System V Environment</U>. Workingham: Addison-Wesley, 1987. </P>
<P>Frisch, &AElig;leen. <U>Essential System Administration</U>. Cambridge: O'Reilly, 1995. </P>
<P><A HREF="http://www.vectorlinux.50megs.com/">Vectorlinux homepage en www.vectorlinux.50megs.com</A> </P>
<P><!-- vim: set sw=2 ts=2 et: --></P>


<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=168&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Sujan Swearingen <BR>LinuxFocus.org 2000</FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article168.shtml" target="_TOP"><FONT COLOR="#FFFFFF">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</FONT></A><BR></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:swear000@uwp.edu"><FONT COLOR="#FFFFFF">Sujan Swearingen</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier_nieto@navegalia.com"><FONT COLOR="#FFFFFF">Javier Nieto</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2000-09-06, generated by lfparser version 1.8</font></p>
</BODY>
</HTML>
