<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="keywords" CONTENT="LinuxFocus, international magazine for Linux">
 <TITLE>Revista LinuxFocus, Septiembre 2000</TITLE>
</HEAD>

<BODY bgcolor="#ffffff" text="#000000" alink="#336633" link="#336699">

<!-- MAP for top navegation bar -->  
<MAP name="top">  
<AREA shape="rect" coords="367,9,418,30" alt="Home" href="../">  
<AREA shape="rect" coords="423,9,457,30" alt="Map" href="../map.html">  
<AREA shape="rect" coords="463,9,508,30" alt="Index" href="../indice.html">  
<AREA shape="rect" coords="514,9,558,30" alt="Search" href="../Search/"> 
</MAP>  
  
<!-- MAP for bottom navegation bar -->  
<MAP name="bottom">  
<AREA shape="rect" coords="78,0,163,15"  alt="News" href="../News/">  
<AREA shape="rect" coords="189,0,284,15" alt="Archives" href="../Archives/">  
<AREA shape="rect" coords="319,0,395,15" alt="Links" href="../Links/">  
<AREA shape="rect" coords="436,0,523,15" alt="About LinuxFocus" href="../aboutus.html">  
</MAP>  

<!-- NAVEGATION BAR -->  
<CENTER>  
<IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0"  ismap usemap="#top" ><BR>  
<IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0"  ismap usemap="#bottom"><BR>  
</CENTER>

<BR clear=all>

<!-- macro insert body -->
<!-- ./20body.html -->
<BR>
<center>
<h1>LinuxFocus. Septiembre de 2000</h1>
</center>

<p>
Los avances recientes en capacidad de discos duros nos dejan sin aliento. Hace algunos a&ntilde;os, algunos art&iacute;culos sosten&iacute;an que las leyes de la f&iacute;sica terminar&iacute;an por limitar la capacidad de los discos duros. El tama&ntilde;o de las regiones magnetizadas en los materiales ferroel&eacute;ctricos tiene un tama&ntilde;o finito, por lo que no se podr&iacute;a reducir indefinidamente. Soprendentemente, los fabricantes han ido encontrando m&eacute;todos para hacerlas cada vez m&aacute;s peque&ntilde;as. Discos de 80&nbsp;Gb no son nada del otro mundo pero &iquest;para qu&eacute; queremos tanto espacio?
<br>
La respuesta a esa pregunta es sencilla. &iquest;Alguna vez has comprobado el tama&ntilde;o de un ejecutable llamado netscape? 14&nbsp;Mb para la versi&oacute;n 4.7X, y contin&uacute;a creciendo. Netscape 6 es taaan grande y lento que s&oacute;lo funciona con velocidad aceptable en hardware muy reciente. &iquest;Para qu&eacute; necesitamos un lector de news, de correo, java, etc. en un solo gran ejecutable? Uno actualiza a la nueva versi&oacute;n con la esperanza de evitar bugs y de paso consigue un nuevo lector de correo. Y donde el viejo funcionaba perfectamente, el nuevo no lo hace.
<br>
&iquest;Qu&eacute; ha sido de aquellos ingenieros de software cualificados que escrib&iacute;an estables, peque&ntilde;as y r&aacute;pidas aplicaciones?
</p>

<p>
Gnome se ha dado cuenta de esto y ha armado un buen jaleo con el 
<a href="http://www.gnome.org/pr-foundation.html">anuncio</a> de su nuevo modelo de componentes Bonobo. KDE no ha hecho tanto ruido, sino que se ha dedicado a implementarlo y con un poco de suerte <a href="http://www.kde.org/">KDE 2.0</a>
estar&aacute; listo en breve. Pero a&uacute;n as&iacute;, &iquest;donde est&aacute; ese navegador r&aacute;pido y estable que pueda ejecutarse en mi pentium 200? &iquest;Son acaso los navegadores de texto como
<a href="http://ei5nazha.yz.yamagata-u.ac.jp/~aito/w3m/eng/index.html">w3m</a>
y <a href="http://lynx.browser.org">lynx</a> la &uacute;nica alternativa elegante y estable? Algunos proyectos en curso pretenden conseguir ese navegador.
<a href="http://www.viewml.com/">viewml</a> ser&aacute; un navegador para peque&ntilde;os sistemas embebidos. Usa el motor de rendering del KDE project (kfm), aunque por el momento est&aacute; en desarrollo y es a&uacute;n m&aacute;s inestable que netscape&nbsp;4.7, aunque podr&iacute;a convertirse en un navegador muy agradable. Otra alternativa es 
<a href="http://galeon.sourceforge.net">galeon</a>, basado en el nuevo motor de mozilla, Gecko. Se encuentra en un estadio realmente preliminar, aunque funciona bastante bien. Eso s&iacute;, a&uacute;n necesitaras ese nuevo disco duro para poder instalar esos 24&nbsp;Mb de c&oacute;digo que no usar&aacute;s ;-).
</p>


<!-- end ./20body.html -->
<!-- ./80body.html -->
<BR>
<center>
<h2>Los art&iacute;culos</h2>
</center>

<H4> <FONT color="#660033"> Desarrollo de Software </FONT> </H4>
<UL>
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article169.shtml">REBOL el rebelde</A>, por Georges Tarbouriech
<br>
Podr&iacute;amos decir que REBOL es un lenguaje de mensajer&iacute;a pero, de hecho, es mucho m&aacute;s que eso.
 </LI>
</UL>

<H4> <FONT color="#660033"> Aplicaciones </FONT> </H4>
<UL>
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article158.shtml">MagicPoint</A>, por Charles Vidal
<br>
MagicPoint es una de las escasas aplicaciones pensadas para crear presentaciones bajo X-Window.
 </LI>
</UL>

<H4> <FONT color="#660033"> Comunidad </FONT> </H4>
<UL>
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article168.shtml">Analizando Vector Linux</A>, por Sujan Swearingen
<br>
Revisi&oacute;n de una mini-distribuci&oacute;n de Linux.
 </LI>
 <LI type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article171.shtml">C&oacute;mo informar sobre errores en Debian 2.2</A>,
por Egon Willighagen
<BR>
Este art&iacute;culo describe como los usuarios de Debian
pueden ayudar a la comunidad, informando sobre los
errores que encuentren.
 </LI>
</UL>

<H4> <FONT color="#660033"> Administraci&oacute;n de sistemas </FONT> </H4>
<UL>
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article166.shtml">Bastille-Linux</A>, por Fr&eacute;d&eacute;ric Raynal
<br>
Bastille-Linux no es una nueva distribuci&oacute;n de Linux, sino un conjunto de herramientas de seguridad.
 </LI>
 <LI type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article173.shtml">Construyendo un ISP escalable con
software de c&oacute;digo abierto</A>,
por Atif Ghaffar
<BR>
Construcci&oacute;n de un servidor para un proveedor de
servicios de internet (ISP) con LDAP bajo Linux.
 </LI>
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article154.shtml">Gu&iacute;a de Instalaci&oacute;n de Slackware 7.0. Parte I</A>,
por Jeffry Degrande
<br>
El autor describe en detalle el proceso de instalaci&oacute;n de la distribuci&oacute;n Linux Slackware 7.0.
 </LI>
</UL>


<H4> <FONT color="#660033"> Dise&ntilde;o Web </FONT> </H4>
<UL>
 <li type=circle>
  <IMG src="../../common/images/frame.gif" alt="point" align="middle">
  <A href="article167.shtml">Revisi&oacute;n de libros: Professional PHP Programming</A>, por John Perr
<br>
Una revisi&oacute;n del libro <it>Professional PHP Programming</it> editado por WROX press.
 </LI>
</UL>




<!-- end ./80body.html -->
<!-- ./90body.html -->
<BR>
<h4><font color="#660033">La peque&ntilde;a ayuda de LinuxFocus</font></h4>

<p>
&iquest;C&oacute;mo instalar mi nuevo disco duro? Enchufar los cables no suele ser demasiado dif&iacute;cil, pues suelen estar perfectamente etiquetados y suelen poder encajarse de una sola forma. La mec&aacute;nica de los discos no esta dise&ntilde;ada para mantener los discos girando en cualquier posici&oacute;n. Desafortunadamente, eso no suele mencionarse en los manuales o separatas que vienen con el disco. Si lo colocas de forma incorrecta, te puedes encontrar con un disco que se funde en un par de meses.
<br>
El disco debe colocarse tal y como se muestra en la primera figura, <br>
<img src="../../common/images/September2000/good.gif" alt="ok" width=300 height=143>
<br>
esto es, o descansando sobre su lado largo y estrecho, o colocado de plano con la placa de circuito impreso hacia _abajo_.
</p>

<p>
Nunca deber&iacute;a montarse con la parte met&aacute;lica hacia abajo y el cirtuito impreso hacia arriba:
<br>
<img src="../../common/images/September2000/bad.gif" alt="bad" width=107 height=77>


<!-- end ./90body.html -->

<!-- end insert body -->

<BR clear=all>

<!-- start of footer -->
<HR WIDTH="85%" noshade size="1">
 <CENTER> 
<table WIDTH="85%" >
 <TR bgcolor="#666666">
   <TD align="center">
   <FONT color="#FFFFFF">
    <B>&copy; 1999 LinuxFocus</B><BR>
    </FONT>
    <A href="../../common/lfteam.html"><FONT color="#FFFFFF">P&aacute;gina de contacto
       con LinuxFocus</FONT></A>
   </TD>
 </TR>
</TABLE>
</CENTER>

</BODY>
</HTML>
