<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>FAQ de CervanTeX: ¿Qu&eacute; son TeX y sus programas hermanos?</TITLE>
 <LINK HREF="FAQ-CervanTeX-2.html" REL=next>

 <LINK HREF="FAQ-CervanTeX.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-CervanTeX-2.html">Página siguiente</A>
Página anterior
<A HREF="FAQ-CervanTeX.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1.</A> <A HREF="FAQ-CervanTeX.html#toc1">¿Qu&eacute; son TeX y sus programas hermanos?</A></H2>

<H2><A NAME="ss1.1">1.1</A> <A HREF="FAQ-CervanTeX.html#toc1.1">¿Qu&eacute; es TeX?</A>
</H2>

<P>TeX es un sistema de composici&oacute;n de textos de alta calidad creado por Donald
E. Knuth, dirigido en particular a aqu&eacute;llos textos que contienen una
gran cantidad de expresiones matem&aacute;ticas. No debe pensarse en TeX
como un procesador de palabras del tipo WYSIWYG, un archivo <CODE>tex</CODE>
es un archivo <CODE>ASCII</CODE> donde est&aacute; el texto que deseamos imprimir
junto con determinadas instrucciones sobre como debe ser tratado, que
debe ser procesado por un compilador (el programa TeX). &Eacute;ste
devuelve un archivo que es independiente de la plataforma y que es el
que finalmente se transformar&aacute; al lenguaje de impresora y se
imprimir&aacute;. </P>
<P> 
Para escribir TeX Knuth desarroll&oacute; un sistema de <EM>programaci&oacute;n ilustrada</EM>
denominado WEB. Las fuentes WEB de TeX est&aacute;n disponibles
gratuitamente, lo mismo que herramientas para convertir el original en
WEB en un programa que pueda compilarse y un texto que pueda
imprimirse. El sistema WEB proporciona herramientas para compilar
TeX en distintos sistemas operativos.</P>
<P>TeX en s&iacute; es un procesador de macros, con una alta capacidad de
programaci&oacute;n. Utilizar TeX puro reviste una cierta dificultad, por
lo que Knuth suministr&oacute; una serie de macros para TeX a las que se
denomin&oacute; <EM>plain TeX</EM>. Estas macros son el conjunto m&iacute;nimo de
macros que se pueden utilizar de forma eficaz con TeX e incluyen
algunos ejemplos de uso de &oacute;rdenes TeX de alto nivel. Cuando alguien
afirma programar en TeX normalmente se refiere a que lo hace en
<EM>plain TeX</EM></P>

<H2><A NAME="ss1.2">1.2</A> <A HREF="FAQ-CervanTeX.html#toc1.2">¿Por qu&eacute; debo asegurarme de usar TeX 3.X?</A>
</H2>

<P>Bueno, hace unos a&ntilde;os (en el ***), diversas personas (y la existencia de
ML-TeX :-) convencieron a Knuth de que el soporte que TeX
proporcionaba a otros idiomas era insuficiente. As&iacute; que lo modific&oacute; de
la siguiente manera:
<UL>
<LI> 
Soporte total a los 8 bits. TeX puede ahora leer los 256 diferentes
c&oacute;digos. Los nuevos caracteres son c&oacute;digos utilizables como
cualquier otro. Antes hab&iacute;a algo, pero no bastante. Ahora podemos
hacer que <CODE>^^e1</CODE> sea la <CODE>&aacute;</CODE>.</LI>
<LI>TeX soporta ahora 256 tablas de partici&oacute;n simult&aacute;neamente.  Puedes escribir:
<BLOCKQUOTE>
... there is a difference between especially and {<CODE>\language\spanish</CODE> especialmente} in that...
</BLOCKQUOTE>

y TeX compondr&aacute; el p&aacute;rrafo con las reglas de ingl&eacute;s, menos <EM>especialmente</EM>
que lo har&aacute; con las del castellano.
</LI>
<LI>Dos nuevas macros <CODE>\lefthyphenmin</CODE> y <CODE>\righthyphenmin</CODE> que
controlan el tama&ntilde;o del trozo m&iacute;nimo que se puede dejar al partir
palabras. Previamente estaban fijos a 2 y 3, respectivamente.
<P>Pero lo fundamental es que TeX 2.X no existe ya. Hay que cambiar tarde o
temprano. No hay parches ni arreglos para TeX 2.X.</P>
<P>Por cierto, la versi&oacute;n actual es la 3.14159, y la versi&oacute;n actual de METAFONT es
la 2.718.  La &uacute;ltima versi&oacute;n de TeX ser&aacute; la versi&oacute;n <EM>pi</EM>
(como &uacute;ltima voluntad de Donald Knuth), y ya no habr&aacute; m&aacute;s
cambios.  Y el &uacute;ltimo METAFONT ser&aacute; versi&oacute;n <EM>e</EM>.</P>
</LI>
</UL>
</P>

<H2><A NAME="tex-gratis"></A> <A NAME="ss1.3">1.3</A> <A HREF="FAQ-CervanTeX.html#toc1.3">Si TeX es tan bueno, ¿por qu&eacute; es gratuito?</A>
</H2>

<P>Porque Knuth lo decidi&oacute; as&iacute;, y no parece molestarle que otros ganen dinero
vendiendo productos y servicios basados en TeX. De hecho, aunque
algunas herramientas que se usan junto a TeX se ofrecen bajo la
<EM>GNU General Public License (Copyleft)</EM>, TeX en s&iacute; ni siquiera
tiene esa restricci&oacute;n. La &uacute;nica restricci&oacute;n impuesta por Knuth es que
debe dar el mismo resultado en todas las implementaciones, para
garantizar la absoluta portabilidad de los documentos escritos con
TeX.</P>

<P>Algunas empresas ofrecen implementaciones comerciales de TeX/LaTeX con
elementos propios (v&eacute;ase la secci&oacute;n 
<A HREF="FAQ-CervanTeX-5.html#tex-de-pago">Implementaciones          comerciales</A>)</P>


<H2><A NAME="ss1.4">1.4</A> <A HREF="FAQ-CervanTeX.html#toc1.4">¿Qu&eacute; es LaTeX?</A>
</H2>

<P>LaTeX es un paquete de macros para TeX, originalmente escrito por Leslie
Lamport para proporcionar un sistema de procesamiento de documentos
m&aacute;s simple de uso que TeX, pero con toda su potencia. LaTeX
proporciona una serie de &oacute;rdenes para describir la estructura del
documento, de forma que el usuario final no deba pensar mucho en la
presentaci&oacute;n. Mediante distintas clases de documentos y paquetes
adicionales, el mismo documento puede producirse con muchos diferentes
aspectos.</P>


<H2><A NAME="ss1.5">1.5</A> <A HREF="FAQ-CervanTeX.html#toc1.5">¿Qu&eacute; es LaTeX2e?, ¿Por qu&eacute; debo usarlo si me va bien con el otro</A>
          (LaTeX209)?</H2>

<P>LaTeX2e es la nueva versi&oacute;n est&aacute;ndar de LaTeX, preparada y mantenida por el
equipo del proyecto LaTeX3. Es la versi&oacute;n actual de LaTeX y est&aacute;
disponible desde cualquier punto CTAN, en </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
CTAN/macros/latex
</PRE>
</CODE></BLOCKQUOTE>
 
Desde que es oficial, LaTeX = LaTeX2e y el otro ahora se llama LaTeX 2.09 y
est&aacute; obsoleto.</P>
<P>LaTeX2e es compatible hacia atr&aacute;s con LaTeX209, pero incluye toda una serie
de caracter&iacute;sticas nuevas. </P>
<P>Hay una raz&oacute;n de peso para no usar LaTeX 2.09: Solamente LaTeX est&aacute;
mantenido, lo cual quiere decir (entre otras cosas) que si encontramos
un error hay gente a quien dec&iacute;rselo y puede que lo arreglen, mientras
que si tenemos problemas con LaTeX 2.09 nadie nos har&aacute; caso, porque
LaTeX 2.09 ya no va a cambiar jam&aacute;s.</P>

<H2><A NAME="ss1.6">1.6</A> <A HREF="FAQ-CervanTeX.html#toc1.6">¿Qu&eacute; son los paquetes de la AMS (AMS-TeX, AMS-LaTeX)?</A>
</H2>

<P>AMS-TeX es un paquete de macros para TeX. Escrito originalmente por Michael
Spivak para la Sociedad Americana de Matem&aacute;ticas (AMS) entre 1983 y
1985. Est&aacute; basado en <EM>plain TeX</EM>, pero proporciona m&aacute;s medios
para producir f&oacute;rmulas matem&aacute;ticas de aspecto profesional con menor
esfuerzo por parte de los autores, con un gran cuidado en aspectos
como el tama&ntilde;o y la posici&oacute;n de las f&oacute;rmulas. Entre los aspectos
tratados se encuentran las ecuaciones de m&aacute;s de una l&iacute;nea, la
numeraci&oacute;n de ecuaciones, los puntos de elipsis, las matrices, los
acentos dobles, sub y super&iacute;ndices en varios niveles, as&iacute; como otras
cosas.</P>
<P>Seg&uacute;n fue aumentando la popularidad de LaTeX la AMS desarroll&oacute; AMS-LaTeX,
que consiste en una colecci&oacute;n de clases y paquetes para LaTeX que
ofrece a los autores la funcionalidad de AMS-TeX.</P>

<H2><A NAME="ss1.7">1.7</A> <A HREF="FAQ-CervanTeX.html#toc1.7">¿Qu&eacute; es METAFONT?</A>
</H2>

<P>Donald Knuth escribi&oacute; METAFONT al mismo tiempo que TeX. Mientras TeX define
la colocaci&oacute;n de los elementos en una p&aacute;gina, METAFONT define c&oacute;mo son
estos elementos, sus tama&ntilde;os y c&oacute;mo se crean. </P>
<P>El lenguaje utilizado por METAFONT para definir tipos permite describir
distintas cosas, la geometr&iacute;a del grafo, las propiedades del elemento
de impresi&oacute;n, informaci&oacute;n adicional que permita distinguir entre
distintos tama&ntilde;os del mismo tipo, o diferencias entre dos tipos que
pertenecen a la misma o distinta familia.</P>
<P>Aunque Knuth y otros han dise&ntilde;ado un buen n&uacute;mero de tipos utilizando METAFONT,
el dise&ntilde;o de tipos en general y en particular con METAFONT es un &aacute;rea
muy especializada que nunca deber&aacute; abordar el usuario
normal. Simplemente METAFONT deber&aacute; estar instalado para cuando TeX
quiera generar copias de nuevos tipos.</P>

<HR>
<A HREF="FAQ-CervanTeX-2.html">Página siguiente</A>
Página anterior
<A HREF="FAQ-CervanTeX.html#toc1">Índice general</A>
</BODY>
</HTML>
