<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>FAQ de CervanTeX: ¿Qu&eacute; ventajas e inconvenientes tiene TeX/LaTeX?</TITLE>
 <LINK HREF="FAQ-CervanTeX-3.html" REL=next>
 <LINK HREF="FAQ-CervanTeX-1.html" REL=previous>
 <LINK HREF="FAQ-CervanTeX.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-CervanTeX-3.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-1.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2.</A> <A HREF="FAQ-CervanTeX.html#toc2">¿Qu&eacute; ventajas e inconvenientes tiene TeX/LaTeX?</A></H2>

<H2><A NAME="ss2.1">2.1</A> <A HREF="FAQ-CervanTeX.html#toc2.1">Ventajas frente a otros procesadores.</A>
</H2>

<P>Adem&aacute;s de las ventajas que aqu&iacute; se describen, en la p&aacute;gina 
<A HREF="http://www.cudenver.edu/~hgreenbe/courses/texinfo/wordvslatex.html">http://www.cudenver.edu/~hgreenbe/courses/texinfo/wordvslatex.html</A>
se recopilan (en ingl&eacute;s) buen numero de mensajes con una informaci&oacute;n detallada
de las razones que han llevado a toda una serie de personas a 
utilizar LaTeX 
<DL>
<DT><B>Funciona y es estable y multiplataforma.</B><DD><P>Tan simple como eso, LaTeX no se <EM>cuelga</EM>, el formato de los archivos es
mucho m&aacute;s estable que en otros procesadores y cualquier cambio es
primero profundamente meditado y despu&eacute;s profusamente documentado,
existen implementaciones para distintas plataformas y en todas el
resultado es exactamente el mismo (si se tienen los mismos estilos
y tipos, claro).</P>

<DT><B>Alta calidad en la edici&oacute;n de ecuaciones.</B><DD><P>Esta es siempre la raz&oacute;n &uacute;ltima por la que un usuario cient&iacute;fico se inclina
hacia LaTeX. Este procesador ajusta los tama&ntilde;os de par&eacute;ntesis,
integrales, sub&iacute;ndices y super&iacute;ndices, alinea los elementos de las
matrices, construye cajas, etc. </P>

<DT><B>LaTeX permite redactar f&aacute;cilmente documentos estructurados.</B><DD><P>A trav&eacute;s de distintas clases de documento y de su conjunto de macros, LaTeX
posibilita escribir textos dividi&eacute;ndolos en cap&iacute;tulos, secciones,
subsecciones, controlando en todo momento la numeraci&oacute;n y las
referencias cruzadas. Construye &iacute;ndices de contenidos, tablas o
figuras. Ajusta los tama&ntilde;os y tipos de letras seg&uacute;n la parte del
documento en que se hallen. </P>

<DT><B>Facilidad en la construcci&oacute;n de macros y &oacute;rdenes.</B><DD><P>A poco de comenzar a usar este procesador, el usuario se encuentra definiendo o
redefiniendo &oacute;rdenes para que &eacute;stas se ajusten a sus preferencias
personales. Por ejemplo, es posible que una determinada expresi&oacute;n
aparezca repetidas veces en el texto. Nada mas f&aacute;cil que definir
una orden que reemplace a todo un bloque. O bien, es posible que
no guste la forma en que LaTeX numera las p&aacute;ginas. Una
redefinici&oacute;n al principio del documento permite cambiar esto. </P>

<DT><B>Se escribe en ASCII.</B><DD><P>Esto, que al principio puede parecer un inconveniente (ya que implica teclear
mucho m&aacute;s) se torna en ventaja al cabo del tiempo. Por un lado
permite incrementar la velocidad de escritura (pues no hay que
andar utilizando rat&oacute;n o men&uacute;s), por otro facilita el uso de
cualquier editor de texto (no contiene caracteres de control) y
permite su transmisi&oacute;n por correo electr&oacute;nico (puede escribirse en
ASCII de 7 bits). Esto hace que muchas revistas cient&iacute;ficas
admitan art&iacute;culos escritos en LaTeX, enviados por
<EM>e-mail</EM>. Ellos lo procesan en el lugar de destino, hacen los
cambios necesarios y lo imprimen. </P>

<DT><B>Es gratis</B><DD><P>Pues eso. Para ver porqu&eacute; v&eacute;ase la secci&oacute;n 
<A HREF="FAQ-CervanTeX-1.html#tex-gratis">¿Porqu&eacute;       TeX es gratis?</A>. A pesar de
ello, existen tambi&eacute;n implementaciones comerciales.</P>

</DL>
</P>

<H2><A NAME="ss2.2">2.2</A> <A HREF="FAQ-CervanTeX.html#toc2.2">Inconvenientes o m&aacute;s bien, ¿cu&aacute;les son las cr&iacute;ticas m&aacute;s habituales?</A>
</H2>

<P>
<DL>
<DT><B>Es muy dif&iacute;cil.</B><DD><P>A diferencia de los procesadores visuales o <EM>WYSIWYG</EM>, que pueden usarse casi
desde el primer d&iacute;a con resultados aceptables, LaTeX requiere un
periodo de aprendizaje antes de conseguir los primeros
frutos. Incluso cuando ya se es un usuario medio o avanzado,
siempre es conveniente tener cerca un manual o un LaTeXperto, al
que preguntarle. </P>
<P>Este proceso de iniciaci&oacute;n consiste principalmente en aprenderse las &oacute;rdenes
esenciales. Despu&eacute;s le siguen &oacute;rdenes secundarias. </P>
<P>M&aacute;s tarde, puede uno aprender a programar en este lenguaje. Llegado ese punto se
puede dar el siguiente salto, atacar el <EM>plain-TeX</EM> o incluso
el TeX, para introducir &oacute;rdenes de muy bajo nivel, pero esto muy
rara vez lo necesitar&aacute; un usuario normal. Estas dos ultimas fases
s&oacute;lo son precisas si uno est&aacute; interesado en los intr&iacute;ngulis del
sistema y los intr&iacute;ngulis de LaTeX se le quedan cortos. </P>
<P>La contrapartida de este esfuerzo es que cuando se trabaja con LaTeX y se
compara  el resultado con lo obtenido con otros procesadores, la
salida de &eacute;stos &uacute;ltimos parece <EM>"poco seria"</EM> en cuanto se
exigen f&oacute;rmulas matem&aacute;ticas. Algo como los dientes, que duelen al
salir, pero luego se hacen imprescindibles.</P>

<DT><B>No se ven los resultados hasta que se compila el archivo.</B><DD><P>Una de las decepciones que sufre el usuario novato es que no ve los frutos de su
trabajo hasta que compila. Como suelen aparecer errores de
compilaci&oacute;n, esto suele ser frustrante (aparte de conllevar una
p&eacute;rdida de tiempo). La &uacute;nica soluci&oacute;n es armarse de paciencia. Con
el tiempo, los errores disminuyen y, simult&aacute;neamente, se aprende a
procesar de cabeza, por lo que no se necesita hacer una
visualizaci&oacute;n para saber como va a quedar. </P>
<P>De todas formas, LaTeX no est&aacute; especialmente dirigido a los aspectos puramente
est&eacute;ticos de cada p&aacute;gina en concreto, sino a los estructurales del
documento. Si uno est&aacute; interesado estrictamente en la est&eacute;tica
(por ejemplo, porque trabaja en la autoedici&oacute;n), LaTeX no es el
procesador adecuado. &Eacute;ste basa la belleza de los documentos
creados m&aacute;s en la claridad, en el buen criterio y en una est&eacute;tica
agradable que en la posibilidad de hacer f&aacute;cilmente dise&ntilde;os
rebuscados para cada p&aacute;gina. </P>

<P>Existen, no obstante, soluciones intermedias entre LaTeX y los procesadores
WYSIWYG. As&iacute;, el TeXtures de los Mac, el <EM>xdvi</EM> de las
<EM>X-Window</EM> bajo <EM>Unix</EM> o los <EM>dviwin</EM>, <EM>yap</EM> o
<EM>winview</EM> de los PC's permiten mantener en pantalla el archivo
que se est&aacute; editando y la visualizaci&oacute;n del &uacute;ltimo, lo cual
facilita la correcci&oacute;n de los documentos. </P>


<DT><B>No permite introducir im&aacute;genes.</B><DD><P>Esta acusaci&oacute;n habitual no es en absoluto cierta. Simplemente hay que ser
conscientes de los medios de visualizaci&oacute;n e impresi&oacute;n de que
disponemos y obrar en consecuencia. V&eacute;ase la secci&oacute;n 
<A HREF="FAQ-CervanTeX-8.html#tex-figuras">Introduciendo figuras en LaTeX</A></P>

<P>Lo que no debe olvidarse nunca es que tanto TeX como LaTeX est&aacute;n pensados
como lenguajes de composici&oacute;n de documentos, no de autoedici&oacute;n. A
cada cual lo suyo.</P>


<DT><B>No tiene variedad de tipos (fuentes)</B><DD><P>Es cierto que los tipos CM originalmente desarrollados por Knuth son limitados
en cantidad y variedad, por lo que a medida que LaTeX se
difund&iacute;a han aumentado las demandas de m&aacute;s tipos para usos
diversos. Aunque el crecimiento es todav&iacute;a lento, existe una gran
cantidad de tipos disponibles en el CTAN en: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
CTAN/fonts
</PRE>
</CODE></BLOCKQUOTE>

En las versiones para salidas <EM>postscript</EM> si es posible el uso de cualquier
tipo, pero no se garantiza que las ecuaciones mantengan la calidad
requerida. </P>

</DL>
</P>

<HR>
<A HREF="FAQ-CervanTeX-3.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-1.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc2">Índice general</A>
</BODY>
</HTML>
