<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>FAQ de CervanTeX: ¿Que elementos intervienen al procesar un documento con LaTeX?</TITLE>
 <LINK HREF="FAQ-CervanTeX-5.html" REL=next>
 <LINK HREF="FAQ-CervanTeX-3.html" REL=previous>
 <LINK HREF="FAQ-CervanTeX.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-CervanTeX-5.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-3.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4.</A> <A HREF="FAQ-CervanTeX.html#toc4">¿Que elementos intervienen al procesar un documento con LaTeX?</A></H2>

<H2><A NAME="ss4.1">4.1</A> <A HREF="FAQ-CervanTeX.html#toc4.1">El documento fuente: ¿C&oacute;mo creo un documento con LaTeX, lo proceso, lo</A>
          veo y lo imprimo? </H2>

<P>Como hemos dicho TeX/LaTeX es realmente un lenguaje de programaci&oacute;n de
textos. En el documento fuente original se introduce el texto a
procesar junto con una serie de &oacute;rdenes especificando c&oacute;mo debe ser
procesado &eacute;ste. Este paso se realiza con el editor de texto favorito
del autor, aunque hay algunos editores de texto que est&aacute;n, mejor
adaptados, o totalmente integrados para su uso con TeX/LaTeX --
v&eacute;ase 
<A HREF="FAQ-CervanTeX-5.html#tex-editores">editores para TeX</A> --. Pongamos
por ejemplo que el documento creado es <CODE>documento.tex</CODE>.</P>
<P>Una vez terminado el documento fuente (<CODE>documento.tex</CODE>), &eacute;ste se procesa
mediante TeX si se han utilizado las &oacute;rdenes de <EM>plain-TeX</EM> o
LaTeX si se han utilizado las &oacute;rdenes de LaTeX. Se corrigen los
posibles errores de sintaxis y se repite el proceso hasta que &eacute;stos se
han eliminado. Como resultado del procesamiento se tiene un
<EM>archivo independiente del dispositivo</EM>, o DVI
(<CODE>documento.dvi</CODE>).</P>

<H2><A NAME="DVI"></A> <A NAME="ss4.2">4.2</A> <A HREF="FAQ-CervanTeX.html#toc4.2">¿Qu&eacute; es un archivo DVI?</A>
</H2>

<P>Un archivo DVI es el archivo resultante de procesar el texto fuente a trav&eacute;s de
TeX. Su forma no depende del dispositivo que se vaya a utilizar para
verlo/imprimirlo. Un archivo DVI est&aacute; pensado para ser le&iacute;do por un
<EM>conversor</EM> que produzca una salida adecuada para una determinada
impresora, o para un determinado visualizador en la pantalla del
ordenador. Los archivos DVI utilizan una codificaci&oacute;n interna de
TeX, de forma que un documento fuente debe producir exactamente el
mismo archivo DVI, con independencia de la implementaci&oacute;n de TeX que
se utiliza para producirlo.</P>
<P>Un archivo DVI contiene toda la informaci&oacute;n necesaria para imprimir o ver el
resultado, excepto los tipos o su aspecto concreto (aunque contiene
sus medidas) o informaci&oacute;n que se introducir&aacute; mediante una orden
<CODE>\special</CODE> -- v&eacute;ase 
<A HREF="#special">¿Qu&eacute; son los           \special?</A> --.</P>

<H2><A NAME="ss4.3">4.3</A> <A HREF="FAQ-CervanTeX.html#toc4.3">¿Qu&eacute; es un conversor (driver)?</A>
</H2>

<P>Un conversor es un programa que toma su entrada de un archivo DVI y produce un
archivo que puede enviarse a una impresora o una salida directa a una
pantalla.</P>
<P>Estos conversores normalmente son espec&iacute;ficos a cada impresora o lenguaje de
impresora. Por ejemplo, una impresora <EM>postscript</EM> entender&aacute;
siempre la salida de un conversor <EM>postscript</EM>, pero en general no
de otros formatos.</P>
<P>Al igual que el archivo DVI, el conversor necesita informaci&oacute;n sobre los tipos
que puede encontrar en distintos lugares.</P>


<H2><A NAME="ss4.4">4.4</A> <A HREF="FAQ-CervanTeX.html#toc4.4">¿Qu&eacute; son los archivos <CODE>.pk</CODE>?</A>
</H2>

<P>Los archivos <CODE>.pk</CODE> (cuyo nombre viene de <EM>packed raster</EM>) contienen tipos
de letra en forma de mapa de bits. METAFONT produce una salida en mapa
de bits en un formato no comprimido denominado <CODE>.gf</CODE>, que es
convertido a <CODE>.pk</CODE> mediante una utilidad denominada
<EM>gftopk</EM>. Para cada dise&ntilde;o de letra, tama&ntilde;o, peso y familia es
necesario un archivo <CODE>.pk</CODE> distinto, e incluso para distintos
dispositivos de salida. Como consecuencia de &eacute;sto se guardan en una
estructura compleja de directorios, o en librer&iacute;as de tipos, para
normalizar el acceso a las mismas.</P>

<H2><A NAME="ss4.5">4.5</A> <A HREF="FAQ-CervanTeX.html#toc4.5">¿Qu&eacute; son los archivos <CODE>.tfm</CODE>?</A>
</H2>

<P><CODE>tfm</CODE> es la abreviatura de <EM>TeX font metric</EM>, m&eacute;trica de los tipos
TeX. Los archivos <CODE>.tfm</CODE> guardan la informaci&oacute;n acerca de los
tama&ntilde;os de los caracteres en cada tipo, as&iacute; como las ligaduras y
desplazamientos dentro de cada tipo. Se necesita un archivo <CODE>.tfm</CODE>
para cada tipo utilizado por TeX, es decir para cada dise&ntilde;o, peso y
familia, aunque uno valga para todas las magnificaciones. TeX
utiliza los archivos <CODE>.tfm</CODE> para componer la p&aacute;gina, pero en
general los conversores no los necesitan.</P>

<H2><A NAME="CM"></A> <A NAME="ss4.6">4.6</A> <A HREF="FAQ-CervanTeX.html#toc4.6">¿Qu&eacute; son los tipos (fuentes) CM?</A>
</H2>

<P>Los tipos CM son los tipos originalmente creados por Donald E. Knuth. Cuando
desarroll&oacute; TeX, lo acompa&ntilde;&oacute; de este conjunto completo de tipos de
alta calidad. Estos tipos eran independientes de la impresora
utilizada (ya que eran tratados como gr&aacute;ficos) lo que produc&iacute;a la
misma calidad en cualquier sitio. Con el tiempo, estos tipos (los
Computer Modern o CM) se convirtieron en la <EM>firma</EM> del procesador,
que permit&iacute;a identificar un documento a primera vista.</P>

<H2><A NAME="EC/DC"></A> <A NAME="ss4.7">4.7</A> <A HREF="FAQ-CervanTeX.html#toc4.7">¿Qu&eacute; son los tipos (fuentes) EC/DC?</A>
</H2>

<P>Son fuentes del tipo de las Computer Modern, pero con 256 caracteres, que cubren
las necesidades de casi todas las lenguas habladas en Europa y algunas
otras que utilizan el alfabeto latino. Su nombre viene de <EM>European
Computer Modern Fonts</EM>. Dichas fuentes contienen caracteres
acentuados siguiendo el esquema de codificaci&oacute;n de Cork. Han estado
durante bastante tiempo en periodo de pruebas y durante ese tiempo se
llamaban DC. Ya se distribuyen normalmente al p&uacute;blico en general, con
el nombre EC, y a partir de ese momento las DC se consideran
obsoletas.</P>
<P>Estas fuentes ya est&aacute;n presentes en las distribuciones modernas de
TeX/LaTeX, pero en caso de que se trabaje con una distribuci&oacute;n
antigua pueden conseguirse en:
<BLOCKQUOTE><CODE>
<PRE>
CTAN/fonts/ec/ready-mf
</PRE>
</CODE></BLOCKQUOTE>

y los archivos <CODE>tfm</CODE> para LaTeX est&aacute;n en
<BLOCKQUOTE><CODE>
<PRE>
CTAN/fonts/ec/tfm
</PRE>
</CODE></BLOCKQUOTE>

Si tenemos tipos de Cork (PostScript, DC, etc.) y queremos utilizar esta
codificaci&oacute;n en las fuentes de salida se debe introducir en el
pre&aacute;mbulo del documento la l&iacute;nea
<BLOCKQUOTE><CODE>
<PRE>
\usepackage[T1]{fontenc}
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss4.8">4.8</A> <A HREF="FAQ-CervanTeX.html#toc4.8">¿Qu&eacute; son los tipos (fuentes) virtuales?</A>
</H2>

<P>Los tipos (fuentes) virtuales proporcionan a TeX una forma de trabajar con
algo m&aacute;s complejo que los caracteres individuales definidos en un
tipo. En un tipo virtual se definen a partir de elementos simples de
los tipos normales, elementos m&aacute;s complejos que TeX considerar&aacute; como
si fueran elementos de un tipo normal (tienen sus tama&ntilde;os y su archivo
<CODE>.tfm</CODE> de m&eacute;trica), pero que en realidad el procesador del DVI
compondr&aacute; a partir de distintos elementos constituyentes para formar a
partir de ellos el elemento complejo descrito en el tipo virtual. De
esta forma es posible remapear caracteres, hacer un tipo compuesto con
elementos tomados de distintos tipos o en general construir elementos
muy complejos a partir de elementos simples de los distintos
tipos. Por ejemplo se utilizan tipos virtuales para <EM>remapear</EM>
tipos <EM>postscript</EM>.</P>
<P>TeX en s&iacute; no ve los tipos virtuales, &uacute;nicamente trabaja con las m&eacute;tricas que
le da el tipo virtual en su <CODE>.tfm</CODE> como si se tratara de tipos
normales.</P>

<H2><A NAME="special"></A> <A NAME="ss4.9">4.9</A> <A HREF="FAQ-CervanTeX.html#toc4.9">¿Qu&eacute; son las &oacute;rdenes <CODE>\special</CODE>?</A>
</H2>

<P>TeX proporciona una forma de expresar cosas que los conversores pueden hacer,
pero de las que TeX no sabe nada. Por ejemplo TeX no sabe c&oacute;mo
introducir figuras <EM>postscript</EM> en un documento o c&oacute;mo cambiar el
color del texto impreso, pero algunos conversores s&iacute; saben c&oacute;mo
hacerlo.</P>
<P>Para ello TeX proporciona la orden <CODE>\special</CODE>. TeX simplemente entiende
la orden como correcta y la pasa con sus argumentos al archivo DVI,
sin hacer nada de lo que en ella se dice. Es el conversor el que debe
interpretar la orden y hacer lo que se le pide.</P>
<P>La sintaxis de los <CODE>\special</CODE> es fuertemente dependiente del dispositivo de
salida y en general no es v&aacute;lida para distintos dispositivos. LaTeX2e
proporciona paquetes est&aacute;ndar de gr&aacute;ficos (<CODE>graphics, graphicx</CODE>) y
manejo de color (<CODE>color</CODE>), que hacen m&aacute;s f&aacute;cil la inclusi&oacute;n de
gr&aacute;ficos, rotaci&oacute;n, reescalado y cambios de color --V&eacute;ase la secci&oacute;n
<A HREF="FAQ-CervanTeX-8.html#tex-figuras">Introducir gr&aacute;ficos con LaTeX</A> --. </P>


<H2><A NAME="postscript"></A> <A NAME="ss4.10">4.10</A> <A HREF="FAQ-CervanTeX.html#toc4.10">¿Qu&eacute; es el postscript y el postscript encapsulado (archivos</A>
            <CODE>.eps</CODE>)?</H2>

<P><EM>PostScript</EM> (PS) es un lenguaje de programaci&oacute;n para describir p&aacute;ginas. Como
lenguaje estructurado permite la programaci&oacute;n (tiene estructuras de
control y bucles), y recuerda el lenguaje de programaci&oacute;n
FORTH. Originalmente fue desarrollado por Adobe. Existen varios
int&eacute;rpretes de <EM>PostScript</EM> que permiten la visualizaci&oacute;n de este
formato.  El m&aacute;s extendido es <EM>Ghostscript</EM> (GS), de Aladdin, del
que puede obtenerse informaci&oacute;n en 
<A HREF="http://www.cs.wisc.edu/~ghost/index.html">http://www.cs.wisc.edu/~ghost/index.html</A> y en 
<A HREF="http://www.aladdin.com">http://www.aladdin.com</A> cuando
acaben de construirla.  El formato PS se basa en describir cada p&aacute;gina
desde un origen de coordenadas que se sit&uacute;a en la esquina inferior
izquierda de la p&aacute;gina.  PS permite, sin embargo, redefinir el origen,
de forma que se puede recomenzar la descripci&oacute;n de un bloque de una
p&aacute;gina desde un origen arbitrario. </P>
<P>PS encapsulado (EPS) es el formato est&aacute;ndar para importar y exportar archivos PS
en cualquier tipo de entornos.  Usualmente es un archivo que contiene
una sola p&aacute;gina que describe una figura.  El archivo EPS est&aacute;
especialmente pensado para incluirlo en otros archivos PS, y es como
cualquier otro archivo PS con algunas restricciones. La FAQ de
<EM>PostScript</EM> puede alcanzarse en 
<A HREF="http://www.lib.ox.ac.uk/internet/news/faq/comp.lang.postscript.html">http://www.lib.ox.ac.uk/internet/news/faq/comp.lang.postscript.html</A>,
de donde est&aacute; tomado mucho de lo anterior.</P>

<H2><A NAME="formato-pdf"></A> <A NAME="ss4.11">4.11</A> <A HREF="FAQ-CervanTeX.html#toc4.11">¿Qu&eacute; es el formato <CODE>pdf</CODE>?</A>
</H2>

<P>PDF (Portable Document Format) es, como su nombre indica, un formato de archivos
transportable entre distintas plataformas, creado por Adobe y
especialmente dise&ntilde;ado para visualizar documentos tal y como se han
dise&ntilde;ado.  Permite usar colores, gr&aacute;ficos, seguir enlaces e imprimir
pero, fundamentalmente, permite ver en la pantalla los documentos,
siendo un formato compacto.  Es muy similar a PS, pero no tiene
capacidades de programaci&oacute;n. En relaci&oacute;n con TeX, PDF es un formato
que sustituye al DVI -- ver la pregunta 
<A HREF="#DVI">¿Qu&eacute; es DVI?</A> -- en la salida de
TeX. En la web hay informaci&oacute;n abundante sobre PDF en 
<A HREF="http://www.pdfzone.com/webring/">http://www.pdfzone.com/webring/</A>. Los visualizadores de PDF m&aacute;s
recomendables son Acrobat Reader, de Adobe, gratuito (
<A HREF="http://www.adobe.com">http://www.adobe.com</A>) y el
Ghostview 
<A HREF="http://www.cs.wisc.edu/~ghost/index.html">http://www.cs.wisc.edu/~ghost/index.html</A>.</P>

<HR>
<A HREF="FAQ-CervanTeX-5.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-3.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc4">Índice general</A>
</BODY>
</HTML>
