<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>FAQ de CervanTeX: ¿Que es...?</TITLE>
 <LINK HREF="FAQ-CervanTeX-8.html" REL=next>
 <LINK HREF="FAQ-CervanTeX-6.html" REL=previous>
 <LINK HREF="FAQ-CervanTeX.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-CervanTeX-8.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-6.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc7">Índice general</A>
<HR>
<H2><A NAME="s7">7.</A> <A HREF="FAQ-CervanTeX.html#toc7">¿Que es...?</A></H2>

<H2><A NAME="que-es-CTAN"></A> <A NAME="ss7.1">7.1</A> <A HREF="FAQ-CervanTeX.html#toc7.1">¿Qu&eacute; es el CTAN (<EM>Comprehensive TeX Archive                Network</EM>).</A>
</H2>

<P>Son las abreviaturas de <EM>Comprehensive TeX Archive Network</EM> (<EM>Red del
Archivo Completo de TeX</EM>).  Son tres servidores de FTP que
almacenan pr&aacute;cticamente todo lo relacionado con el TeX. Sus
<EM>nodos</EM> son:
<UL>
<LI> 
<A HREF="ftp://ftp.dante.de">ftp.dante.de</A>  (Alemania)</LI>
<LI> 
<A HREF="ftp://ftp.tex.ac.uk">ftp.tex.ac.uk</A> (Reino Unido)</LI>
<LI> 
<A HREF="ftp://ftp.shsu.edu">ftp.shsu.edu</A>  (Estados Unidos)</LI>
</UL>
</P>
<P>Tambi&eacute;n se puede acceder mediante gopher o WWW con otros nombres, y existen
interfaces de acceso como
<BLOCKQUOTE>
<A HREF=" http://www.ucc.ie/cgi-bin/ctan">http://www.ucc.ie/cgi-bin/ctan</A></BLOCKQUOTE>

que muestra una serie de r&eacute;plicas del CTAN, y permite hacer b&uacute;squedas en ellas.</P>
<P>En los tres casos el material de TeX est&aacute; en el directorio
<CODE>/tex-archive</CODE>. Cada uno es un <EM>mirror</EM> o r&eacute;plica de los
otros dos: Los tres contienen lo mismo (con un d&iacute;a de diferencia a lo
m&aacute;s, en teor&iacute;a).  Por lo tanto conviene conectarse al que que nos
caiga m&aacute;s cerca. Dado que siempre hay que ir a <CODE>/tex-archive</CODE>,
se puede omitir dicho directorio y darse por supuesto.  Por ejemplo,
si alguien nos dice que LaTeX se encuentra en
<CODE>CTAN/macros/latex</CODE> quiere decir que podemos encontrarlo por
ejemplo en el directorio
<BLOCKQUOTE><CODE>
<PRE>
ftp://ftp.dante.de/tex-archive/macros/latex
</PRE>
</CODE></BLOCKQUOTE>

Nota: Desde hace tiempo, <CODE>ftp.shsu.edu</CODE> funciona tan mal que los
mantenedores del CTAN han decidido (20 de junio de 1996) no
considerarlo ya m&aacute;s un nodo del CTAN. Para los usuarios de Am&eacute;rica, se
recomienda usar la siguiente <EM>r&eacute;plica</EM>:
<BLOCKQUOTE>
<A HREF="ftp://ftp.cdrom.com/pub/tex/ctan">ftp://ftp.cdrom.com/pub/tex/ctan</A></BLOCKQUOTE>

En Espa&ntilde;a existe una r&eacute;plica del CTAN en
<BLOCKQUOTE>
<A HREF="ftp://ftp.rediris.es/mirror/tex-archive">ftp://ftp.rediris.es/mirror/tex-archive</A></BLOCKQUOTE>

aunque no se actualiza con la misma rapidez que los nodos del CTAN.</P>


<H2><A NAME="ss7.2">7.2</A> <A HREF="FAQ-CervanTeX.html#toc7.2">¿Qu&eacute; es el esquema de codificaci&oacute;n de Cork?</A>
</H2>

<P>Es el c&oacute;digo acordado en la reuni&oacute;n del TUG 1990 en Cork, el llamado <EM>TeX
256 international character set</EM> que es, al menos en lo que se
refiere al castellano, compatible con ML-TeX, ISO Latin Alphabet 1
(IS 8859/1) y el DEC Multinational Character Set. Que adem&aacute;s, es el de
las fuentes DC/EC.  Esto significa que es posible utilizar en entrada
los caracteres acentuados directamente (por ejemplo con <CODE>compose</CODE>
en Sun o terminales <CODE>VTxxx</CODE> (<CODE>xxx</CODE> >= 200).</P>

<H2><A NAME="que-es-babel"></A> <A NAME="ss7.3">7.3</A> <A HREF="FAQ-CervanTeX.html#toc7.3">¿Qu&eacute; es babel?</A>
</H2>

<P><EM>Babel</EM> es un conjunto de estilos escritos por Johannes L. Braams que:
<UL>
<LI>Proporciona macros &uacute;tiles para la producci&oacute;n de documentos en una veintena de
idiomas, incluido el espa&ntilde;ol.</LI>
<LI>P&uacute;blico y en evoluci&oacute;n. Esto significa la posibilidad de enviar documentos a
otros sin tener que intercambiar macros primero y que estas macros
se actualizan en funci&oacute;n de las necesidades.</LI>
<LI>La posibilidad de cambiar de idioma a mitad de documento, para, por ejemplo,
citar en otro idioma y tener disponibles las macros espec&iacute;ficas de
ese idioma.</LI>
<LI>Puede ser utilizado en plain TeX tambi&eacute;n.</LI>
</UL>

Adem&aacute;s, <EM>babel</EM> convive c&oacute;modamente con otros estilos. Por ejemplo,
<CODE>artikel1.sty</CODE> usa parte de la ayuda de <EM>babel</EM>. Es f&aacute;cil
escribir estilos que combinen con <EM>babel</EM>. Si tu estilo lo escribes
usando para los literales las macros que <EM>babel</EM> define, lo tendr&aacute;s
sin ning&uacute;n esfuerzo adicional para una veintena de idiomas. Es cierto
que la probabilidad de que uses serbo-croata es escasa, pero hay
franc&eacute;s, portugu&eacute;s, italiano, alem&aacute;n, etc.  Los convenios de
<EM>babel</EM> derivan del trabajo realizado por <EM>Hubert
Partl</EM>. Estilos escritos de forma compatible con el trabajo de
Partl, deben funcionar con <EM>babel</EM> en principio.  De hecho, es ya
est&aacute;ndar este convenio en las versiones de LaTeX posteriores a
octubre de 1991.</P>
<P>Babel puede conseguirse en:
<BLOCKQUOTE><CODE>
<PRE>
CTAN/languages/babel
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss7.4">7.4</A> <A HREF="FAQ-CervanTeX.html#toc7.4">¿Qu&eacute; son eTeX eLaTeX y <EM>omega</EM>?</A>
</H2>

<P>eTeX es una extensi&oacute;n de TeX con nuevas primitivas y algunas correcciones en
el c&oacute;digo de TeX para mejorar (aun m&aacute;s si cabe) sus capacidades
tipogr&aacute;ficas. Es solo un paso intermedio para <EM>NTS</EM>, que ser&aacute; el
nombre definitivo. eLaTeX es una versi&oacute;n de LaTeX para eTeX, que
en realidad es exactamente igual en su funcionamiento, solo que los
archivos de formato de TeX y eTeX no son compatibles.</P>
<P><EM>omega</EM> es similar en concepto, aunque distinto en realizaci&oacute;n, ya que
utiliza preprocesadores integrados con TeX. Adem&aacute;s, funciona con
<EM>unicode</EM> y permite escribir en cualquier lengua conocida (o por
conocer). <EM>lambda</EM> es una versi&oacute;n de LaTeX para <EM>omega</EM>, y se
puede decir lo mismo que sobre eLaTeX.</P>
<P>Ambas son prescindibles si solo quieres usar TeX; pero ambas son
imprescindibles si quieres ir m&aacute;s all&aacute; en tipograf&iacute;a.</P>

<H2><A NAME="que-es-revtex"></A> <A NAME="ss7.5">7.5</A> <A HREF="FAQ-CervanTeX.html#toc7.5">¿Qu&eacute; es RevTeX?</A>
</H2>

<P>RevTeX es un conjunto de macros y estilos en LaTeX realizado por la Sociedad
Americana de F&iacute;sica, la Sociedad Americana de &Oacute;ptica, y el Instituto
Americano de F&iacute;sica. Sirve para componer art&iacute;culos y res&uacute;menes para
muchas revistas de estas sociedades y algunas otras. Las ventajas son
las de LaTeX (texto en ASCII que puede enviarse por <EM>e-mail</EM> y
entre distintas plataformas, archivos reducidos, m&aacute;s importancia al
contenido y la estructura que a la est&eacute;tica, f&oacute;rmulas matem&aacute;ticas
impecables, manejo sofisticado de referencias y citas, etc.) y las de
estar espec&iacute;ficamente desarrollado para art&iacute;culos de una revista
cient&iacute;fica. As&iacute;, es muy f&aacute;cil preparar <EM>preprints</EM> que se asemejan
mucho al resultado final y donde es muy f&aacute;cil calcular el n&uacute;mero de
p&aacute;ginas. Es inmediato preparar separatas en formato PDF.</P>
<P>Aunque la versi&oacute;n RevTeX 3.1 no es del todo compatible con LaTeX (hay que
modificar algo las tablas, por ejemplo) est&aacute; en fase beta una versi&oacute;n
RevTeX 4 que solucionar&iacute;a estos problemas.</P>
<P>Se puede encontrar m&aacute;s informaci&oacute;n en la p&aacute;gina Web del Instituto Americano de
F&iacute;sica (en la secci&oacute;n de publicaciones, programa Compuscript)
<BLOCKQUOTE>
<A HREF="http://www.aip.org">http://www.aip.org</A></BLOCKQUOTE>
</P>


<H2><A NAME="que-es-box"></A> <A NAME="ss7.6">7.6</A> <A HREF="FAQ-CervanTeX.html#toc7.6">¿Qu&eacute; es una  <CODE>box</CODE> y cuando conviene utilizarlas?</A>
 </H2>

<P>Realmente esta es una pregunta m&aacute;s especializada. Una <CODE>box</CODE> es una forma
de guardar informaci&oacute;n para reutilizarla despu&eacute;s. Por ejemplo, se
podr&iacute;a guardar un logo con informaci&oacute;n con 
<BLOCKQUOTE><CODE>
<PRE>
\newsavebox{\logo}
\sbox{\logo}{\includegraphics{logo.eps}}
</PRE>
</CODE></BLOCKQUOTE>

y luego utilizarla con <CODE>\usebox{\logo}</CODE>. La diferencia con usar
<CODE>\newcommand{\logo}{\includegraphics{logo.eps}}</CODE> y luego poner
<CODE>\logo</CODE>  cada vez que se utilice es la siguiente:</P>

<P>Lo que hay en un <CODE>box</CODE> ya est&aacute; hecho y compuesto. Lo que hay en una macro son
ordenes que se ejecutan cuando se usa la macro, y por tanto no se
componen hasta ese momento. Cuando es necesario utilizar muchas veces
la definici&oacute;n sale m&aacute;s rentable usar un <CODE>savebox</CODE> ya que el
recuadro usado contiene siempre exactamente lo mismo y de esta forma,
no se llama a <CODE>\includegraphics</CODE> en cada pagina, sino tan solo
una vez. Sin embargo, una <CODE>box</CODE> no admite argumentos como lo hace
una macro.</P>


<HR>
<A HREF="FAQ-CervanTeX-8.html">Página siguiente</A>
<A HREF="FAQ-CervanTeX-6.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc7">Índice general</A>
</BODY>
</HTML>
