<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>FAQ de CervanTeX: Meta-preguntas (preguntas sobre esta FAQ):</TITLE>
 <LINK HREF="FAQ-CervanTeX-10.html" REL=previous>
 <LINK HREF="FAQ-CervanTeX.html#toc11" REL=contents>
</HEAD>
<BODY>
Página siguiente
<A HREF="FAQ-CervanTeX-10.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc11">Índice general</A>
<HR>
<H2><A NAME="s11">11.</A> <A HREF="FAQ-CervanTeX.html#toc11">Meta-preguntas (preguntas sobre esta FAQ):</A></H2>

<H2><A NAME="ss11.1">11.1</A> <A HREF="FAQ-CervanTeX.html#toc11.1">¿Cu&aacute;l es la historia de esta FAQ?</A>
</H2>

<P>La primera versi&oacute;n de esta FAQ se la debemos a Julio S&aacute;nchez que recopil&oacute;
preguntas y respuestas a partir de las discusiones habidas en la lista
<CODE>spanish-tex</CODE>.</P>
<P>Posteriormente Santiago Vila <CODE>(sanvila@unex.es)</CODE> se hizo cargo de la FAQ
se ha hecho cargo de la FAQ, a&ntilde;adiendo m&aacute;s preguntas y pas&aacute;ndola a <EM>texinfo</EM>.</P>
<P>M&aacute;s recientemente, Agust&iacute;n Mart&iacute;n <CODE>(agmartin@aq.upm.es)</CODE>
se ha hecho cargo de ella en el 99 y la ha pasado a SGML, con la misma intenci&oacute;n
con la que Santiago la pas&oacute; a texinfo, extraer de forma sencilla
versiones en distintos formatos.</P>
<P>Esta lista de preguntas y respuestas est&aacute; muy verde, y actualmente sigue siendo
algo ca&oacute;tica. Se ruega algo de <EM>intolerancia activa</EM>, es decir,
siempre que se vea algo mal, comun&iacute;quese al coordinador de la FAQ.  Se
aceptan cambios, correcciones (incluso ortogr&aacute;ficas o de estilo),
adiciones, etc. Ni Julio S&aacute;nchez ni Santiago Vila se hacen cargo en
este momento de la FAQ, as&iacute; que por favor no le mand&eacute;is las preguntas
a ellos, sino a la persona que en este momento se hace cargo de la FAQ.</P>


<H2><A NAME="ss11.2">11.2</A> <A HREF="FAQ-CervanTeX.html#toc11.2">¿Qui&eacute;n coordina actualmente la FAQ?</A>
</H2>

<P>El coordinador actual y a quien deben enviarse las  sugerencias acerca de esta
FAQ es: Agust&iacute;n Mart&iacute;n Domingo, <CODE>agmartin@aq.upm.es</CODE></P>
<P>Se ruega especificar en la cabecera del mensaje FAQ-CervanTeX. Por favor, para
dudas generales dirigirse a la lista de correo o al foro de
noticias. Utilizar esta direcci&oacute;n exclusivamente para asuntos
relacionados con la FAQ.</P>

<H2><A NAME="ss11.3">11.3</A> <A HREF="FAQ-CervanTeX.html#toc11.3">Agradecimientos</A>
</H2>

<P>Para hacer esta FAQ se han utilizado, adem&aacute;s de los originales de Julio S&aacute;nchez
y Santiago Vila las FAQ del grupo de noticias <CODE>comp.text.tex</CODE> y la
<EM>New TeX FAQ</EM>, versi&oacute;n de la anterior realizada por el grupo de
usuarios de TeX del Reino Unido. La versi&oacute;n <EM>html</EM> de esta FAQ
con un buscador CGI (
<A HREF="http://www.tex.ac.uk/cgi-bin/texfaq2html">http://www.tex.ac.uk/cgi-bin/texfaq2html</A>) tambi&eacute;n ha sido de
gran ayuda. Asimismo se han utilizado multitud 
de mensajes de las listas de correo y grupos de noticias relacionados
con TeX a cuyos autores agradezco sus ideas y contribuciones.</P>

<P>Fernando M. Fournon Gonz&aacute;lez Barcia <CODE>(furny@wd.estec.nl)</CODE> y Jes&uacute;s M. Gonz&aacute;lez
Barahona <CODE>(jgb@gsyc.inf.uc3m.es)</CODE> han proporcionado las citas de
las publicaciones de la Real Academia y del diccionario de Mar&iacute;a
Moliner. La secci&oacute;n acerca de las funciones matem&aacute;ticas en castellano
se la debemos a Juan Luis Varona <CODE>(jvarona@dmc.unirioja.es)</CODE> y las
de postscript y PDF a Enrique Melendez Asensio . Adem&aacute;s se han tomado muchos elementos (buena parte de las
secciones de libros en ingl&eacute;s y de ventajas y desventajas de LaTeX)
de las p&aacute;gina sobre LaTeX de Antonio Gonz&aacute;lez, de la Universidad de
Sevilla 
(
<A HREF="http://www.esi.us.es/~gonfer/tex.html">http://www.esi.us.es/~gonfer/tex.html</A>) 
y otros cuantos de la p&aacute;gina de Mart&iacute;n Pav&oacute;n 
(
<A HREF="http://mate.dm.uba.ar/~mpavon/tex.html">http://mate.dm.uba.ar/~mpavon/tex.html</A>)</P>

<H2><A NAME="ss11.4">11.4</A> <A HREF="FAQ-CervanTeX.html#toc11.4">¿D&oacute;nde encuentro la versi&oacute;n m&aacute;s reciente de esta FAQ?</A>
</H2>

<P>La versi&oacute;n m&aacute;s reciente de esta FAQ est&aacute; disponible en el directorio 
<BLOCKQUOTE>
<A HREF="http://corbu.aq.upm.es/~agmartin/latex/FAQ-CervanTeX/">http://corbu.aq.upm.es/~agmartin/latex/FAQ-CervanTeX/</A></BLOCKQUOTE>

en una amplia variedad de formatos. Se puede acceder a trav&eacute;s de la p&aacute;gina
<BLOCKQUOTE>
<A HREF="http://corbu.aq.upm.es/~agmartin/latex/FAQ-CervanTeX-main.html">http://corbu.aq.upm.es/~agmartin/latex/FAQ-CervanTeX-main.html</A></BLOCKQUOTE>
 </P>

<H2><A NAME="ss11.5">11.5</A> <A HREF="FAQ-CervanTeX.html#toc11.5">¿D&oacute;nde puedo encontrar otras FAQ, aunque sea en otros idiomas?</A>
</H2>

<P>Adem&aacute;s de la FAQ en castellano existen FAQ en otros idiomas que, si se salva la
barrera del lenguaje pueden ser de utilidad adicional. Sin duda en
ellas existen elementos que podr&iacute;an entrar bien en esta FAQ, as&iacute; que
todo aquel que vea una pregunta de gran inter&eacute;s que est&aacute; en una de
ellas y no en la FAQ en castellano est&aacute; invitado a traducirla y
envi&aacute;rsela al responsable de esta FAQ. Las FAQ en otros idiomas m&aacute;s
interesantes son las siguientes
<UL>
<LI>El grupo de usuarios de TeX/LaTeX del Reino Unido mantiene una
excelente FAQ en ingl&eacute;s que puede encontrarse en <EM>CTAN</EM> en el
directorio <CODE>CTAN/usergrps/uktug/faq</CODE>. La p&aacute;gina web de la
UK-FAQ 
<A HREF="http://www.tex.ac.uk/cgi-bin/texfaq2html">http://www.tex.ac.uk/cgi-bin/texfaq2html</A> tiene adem&aacute;s un
buscador CGI para facilitar las consultas  </LI>
<LI>Asimismo, el grupo alem&aacute;n <EM>DANTE</EM> de usuarios de TeX/LaTeX mantiene su
FAQ (en alem&aacute;n) que puede encontrarse en el <EM>CTAN</EM> en el
directorio <CODE>CTAN/help/de-tex-faq</CODE>.</LI>
<LI>Aunque congelada desde hace alg&uacute;n tiempo, existe una FAQ en franc&eacute;s en
<CODE>CTAN/help/LaTeX-FAQ-francaise</CODE></LI>
</UL>
</P>
<HR>
Página siguiente
<A HREF="FAQ-CervanTeX-10.html">Página anterior</A>
<A HREF="FAQ-CervanTeX.html#toc11">Índice general</A>
</BODY>
</HTML>
