<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Graphics">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Andr&eacute; Pascual
 =LF=CAT___: Graphics
 =LF=TITLE_: Fuentes y motivos con Gimp
 =LF=NUMBER: 116
 =LF=ANAME_: article116.html
 -->
 <TITLE>lf116, Graphics: Fuentes y motivos con Gimp</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG alt="[Photo de l&aacute;uteur]" height=147
src="../../common/images/Andre-Pascual.jpg" width=132>
<BR>por  Andr&eacute; Pascual <br> <small>&lt;apascual(at)club-internet.fr&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Inicialmente dibujante industrial, actualmente ense&ntilde;a CAD. Una
de sus pasiones es la infograf&iacute;a, en particular la 3D.
</P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Walter Echarri <small>&lt;wecharry(at)yahoo.com&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#116lfindex0">Preliminares</A></LI>
  <LI><A HREF="#116lfindex1">Instalar las Freefont y las Sharefont</A></LI>
  <LI><A HREF="#116lfindex2">Resultados</A></LI>
  <LI><A HREF="#116lfindex3">Usar las True Type</A></LI>
  <LI><A HREF="#116lfindex4">Crear los motivos</A></LI>
  <LI><A HREF="#116lfindex5">Conclusi&oacute;n provisoria</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=116&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Fuentes y motivos con Gimp</H2>
 <IMG alt=[Illustration] height=100 hspace=10
src="../../common/images/illustration99.gif" width=100>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>He recibido una gran cantidad de correo por los tutoriales "Im&aacute;genes Pseudo 3D con Gimp"
y "Crear un efecto de fuego con Gimp" debido, en su mayor&iacute;a, a la dificultad de los ejercicios
propuestos. De hecho, se trataban de dificultades propias de principiantes.
El linuxero experimentado no se detiene ante la falta de una fuente o un motivo:
inmediatamente instala la fuente o busca un m&eacute;todo para evitarlo lo cual no fue el
caso de mis corresponsales...<BR><P>Todo el mundo ha sido principiante y &iquest;qui&eacute;n no sigue
si&eacute;ndolo en un tema u otro al utilizar Linux?. Asimismo, este art&iacute;culo est&aacute; dirigido a los
principiantes aunque los puristas se sientan ofendidos por los m&eacute;todos descriptos.</P><BR></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<!-- TRADUCTEURS ATTENTION: CET ARTICLE NE CONTIENTS PAS LES CHEMINS
CORRECTS POUR LES IMAGES. DANS LA VERSION DEFINITIVE, VOUS DEVREZ
REMPLACER "./fontes-gfx/" par "../../common/images/article116/" POUR QUE LES
IMAGES S&Aacute;FFICHENT CORRECTEMENT SUR LE SITE DE LINUXFOCUS -->

<A NAME="116lfindex0">&nbsp;</A>
<H2>Preliminares</H2>

<P>Servir&aacute;n de referencia en el presente art&iacute;culo el Mandrake 5.3 y el Gimp 1.0.4.
Las rutas, directorios y menus descriptos pueden diferir seg&uacute;n las versiones utilizadas.
Sin duda es de preveer alg&uacute;n tipo de adaptaci&oacute;n en las configuraciones especificadas.
<BR><P>Al referirnos a caracteres tipogr&aacute;ficos, diremos fuentes.
<BR>Al referirnos a motivos tapiz, diremos indistintamente motivos o dise&ntilde;os.
<BR>Al hablar de Xfree86, haciendo gala del nombre oficial, diremos X.
<BR><P>Cuando se  llame al Midnight Commander, que permite la gesti&oacute;n de archivos sin necesidad
de conocer las funciones b&aacute;sicas de Linux y su inmensa cantidad
de opciones, diremos MC. Todo usuario del Comandante Norton y del Xtree Gold del
Dos, o del WinCommander de Windows, se hallar&aacute; en terreno conocido. &iexcl;Hasta
las teclas de funci&oacute;n tienen el mismo comportamiento en MC que en
WinCommander! Seamos entonces pragm&aacute;ticos. &iexcl;Sin duda es mejor ser torpe
y funcional que sofisticado e inoperante!
<A NAME="116lfindex1">&nbsp;</A>
<H2>Instalar las Freefont y las Sharefont</H2>

<P> Por defecto, los script-fu usan fuentes que las diferentes
distribuciones no  siempre instalan en forma autom&aacute;tica. Estas fuentes se
reparten en dos paquetes: Freefont y Sharefont. El primero es libre, en tanto que
el segundo se distribuye seg&uacute;n el principio del  shareware. Ambos son muy
interesantes y, sin lugar a dudas, incorporan un valor a&ntilde;adido a X mejorando su
presentaci&oacute;n.
<CENTER><BR><BR><IMG alt="[Figure 1]" height=573
src="../../common/images/article116/fig1_t1.jpg" width=619> </CENTER><BR><BR>
<P>Estos dos paquetes de Christoph Lameter est&aacute;n disponibles en archivos .tgz
en la siguiente direcci&oacute;n: <A href="mailto:clameter@waterf.org">clameter@waterf.org</A>.
(NT: o v&iacute;a ftp en la direcci&oacute;n que se indica m&aacute;s abajo). Sin embargo, diversas distribuciones
las ubican en el directorio /Contrib, o se las puede encontrar en los cd que acompa&ntilde;an a las
revistas inform&aacute;ticas. As&iacute; Linux Magazine 9 los ubican en el directorio /Gimp/fonts de su CD.
<BR><P>Supongamos que contamos con este cd y que estamos en modo consola (modo texto).
Proceder entonces de la siguiente manera:
<UL>
  <LI>1.1 "montar" el  CD
  <LI>1.2 Ejecutar MC
  <LI>1.3 En el panel de la izquierda, seleccionar el directorio / Gimp/fonts del CD
  <LI>1.4 En el panel de la derecha seleccionar el directorio
  /usr/X11R6/lib/X11/fonts del disco duro
  <LI>1.5 Copiar (F5) los archivos freefont.tgz y sharefont.tgz en el disco
  duro en el directorio se&ntilde;alado.
  <LI>1.6 Descomprimir los archivos (F2 despliega un men&uacute;, elegir "Gzip o Gunzip archivo
  actual")</LI></UL>
<P>Si esta opci&oacute;n no se encuentra en el men&uacute;, salir de MC (F10) con el cursor
posisionado en el panel que contiene los archivos copiados. Tomando la precauci&oacute;n
de agregar las siguientes l&iacute;neas en el .bashrc :<BR><P><CODE>mc () MC=`/usr/bin/mc -P
"$@"`; [ -n "$MC" ] &amp;&amp; cd "$MC"; unset MC ;</CODE><BR><P>solucionaremos
el problema. Si no, podemos hacer<BR><P><CODE>cd
/usr/X11R6/lib/X11/fonts</CODE><BR><P>y ejecutar el comando de descompresi&oacute;n
:<BR><P><CODE>tar xvfz *.tgz</CODE><BR>
<P>De esta manera se obienen dos nuevos directorios, uno denominado freefont y
otro sharefont. Ahora se pueden borrar los archivos comprimidos .tgz.
<BR><P>Freefont contiene 79 fuentes (casi todas utilizables) en tanto que
sharefont contiene 22.
<CENTER><BR><BR><IMG alt="[Figure 2]" height=320
src="../../common/images/article116/fig2_t1.jpg" width=420> </CENTER><BR><BR>
<P>Cada directorio contiene otro archivo especial e imprescindible
denominado fonts.dir. Este archivo informa a X las fuentes contenidas en cada
directorio. No es necesario ejecutar el comando mkfontdir para generar este
archivo ya que X tomar&aacute; en cuenta las fuentes en su pr&oacute;xima ejecuci&oacute;n siempre y
cuando as&iacute; se le indique. Para ello, es conveniente agregar
las siguientes l&iacute;neas en la secci&oacute;n "Files" del /etc/X11/XF86Config,
<BR><CODE><PRE>FontPath "/usr/X11R6/lib/X11/fonts/freefont"
<BR>FontPath "/usr/X11R6/lib/X11/fonts/sharefont"<BR>
</PRE>
</CODE>
<P>Algunos XF86Config denotan FontPath en una &uacute;nica l&iacute;nea, en estos casos las
diferentes rutas est&aacute;n separadas por ":" como en:<BR>
<CODE>FontPath&nbsp;"/usr/X11R8/lib/X11/misc:unscaled:/usr/X11R6/lib/X11/fonts/freefont:
                          /usr/X11R6/lib/X11....."
</CODE>
<P>Si se est&aacute; en modo gr&aacute;fico, y no en modo consola, el procedimiento descripto
anteriormente sigue siendo v&aacute;lido con la particularidad de emplear un terminal (rxvt,
kvt, wmterm...). Cabe destacar que las fuentes no ser&aacute;n inmediatamente tenidas en cuenta
sino tras un nuevo lanzamiento de X, o bien ejecutando en el terminal
reci&eacute;n abierto los siguientes comandos:<BR><BR><CODE>xset fp+
/usr/X11R6/lib/X11/fonts/freefont<BR>xset fp rehash<BR>xset fp+
/usr/X11R6/lib/X11/fonts/sharefont<BR>Xset fp rehash </CODE>
<A NAME="116lfindex2">&nbsp;</A>
<H2>Resultados</H2>

<P>Se puede verificar si se han cargado las fuentes ejecutando xfontsel, gtkfontsel o simplemente
el gestor de fuentes de KDE. A partir de este momento las fuentes ser&aacute;n accesibles desde
cualquier aplicaci&oacute;n X (lo cual no siempre es estrictamente cierto). Estas fuentes pueden
agruparse en una tabla, como en este art&iacute;culo, usando Gimp con el comando:<BR><P><CODE>xtns&gt;
Script-Fu&gt;Utils&gt;Font Map (Extensiones&gt;Script-Fu&gt;Utilidades&gt;Mapa de Caracteres)
</CODE><BR><P>&iexcl;Cuidado! se trata de una herramienta implacable.Un m&iacute;nimo error al ingresar
el nombre de la fuente nos obligar&aacute; a comenzar todo de nuevo. Lo m&aacute;s conveniente resulta
operar con el gestor de fuentes de KDE abierto al mismo tiempo que Gimp ya que de esta
forma se podr&aacute; visualizar el nombre correcto de la fuente en todo momento. La figura 3
muestra algunas de estas fuentes, &uacute;tiles para crear fant&aacute;sticos logos o titulares.
<CENTER><BR><BR><IMG alt="[Figure 3]" height=608
src="../../common/images/article116/fig3_t1.jpg" width=498> </CENTER><BR><BR>
<A NAME="116lfindex3">&nbsp;</A>
<H2>Usar las True Type</H2>

<P>Las fuentes que se acaban de instalar son interesantes, pero &iquest;qui&eacute;n no tiene en su disco
r&iacute;gido una partici&oacute;n Windows y su legi&oacute;n de fuentes True Type de excelente factura?.
 Es comprensible el querer utilizarlas. Las &uacute;ltimas distribuciones de Linux, que cada vez son
m&aacute;s, naturalmente preveen su uso. No ocurre lo mismo con una distribuci&oacute;n m&aacute;s antigua
como la Mandrake 5.3. Sin embargo, al menos existe una soluci&oacute;n.
Se trata de un servidor denominado Xfstt (un simple archivo
ejecutable de 130 Kb luego de su compilaci&oacute;n) disponible, entre otros lugares,
en la siguiente direcci&oacute;n:<A
href="ftp://sunsite.unc.edu/pub/Linux/X11/fonts/">ftp://sunsite.unc.edu/pub/Linux/X11/fonts/</A>
<P>El archivo se denomina Xfstt-1.1.tar.gz de 80 Kb. El n&uacute;mero de versi&oacute;n indica
que el programa no ha sido a&uacute;n finalizado pero funciona sin grandes problemas.
Antes de la compilaci&oacute;n, hay que preparar el terreno creando un directorio
destinado a contener las fuentes TrueType, este directorio es /usr/share/fonts/truetype
(mkdir /usr/share/fonts/truetype o F7 en MC). A continuaci&oacute;n hay que copiar en este directorio
las fuentes a utilizar o crear un enlace simb&oacute;lico (En MC, F9, File y SymLink -Archivo y Crear
enlace) que apunte al directorio Fuentes de Windows. En mi configuraci&oacute;n, /usr/share/fonts/truetype
contiene el enlace  ~fuenteswin que apunta a  /mnt/Win98/windows/fuentes,
teniendo en cuenta que /mnt/Win98 es el punto de montaje de mi partici&oacute;n
Windows.<BR><P>A continuaci&oacute;n se puede iniciar la compilaci&oacute;n del programa. Para ello, nos
ubicamos en /tmp/xfstt11 creado tras la descompresi&oacute;n del archivo y a continuaci&oacute;n
ejecutamos el comando:<BR><P><CODE>make xfstt &amp;&amp; make install<BR>
</CODE><P>Cuando termina el proceso, el archivo binario ejecutable resultante
<CODE>xfstt</CODE> quedar&aacute; instalado en /usr/X11R6/bin. Conviene ahora indicar
al servidor xfstt las fuentes True Type que deber&aacute; utilizar. Para ello, ejecutar el comando:
<BR><P><CODE>xfstt --sync</CODE><BR><P>El efecto final es la creaci&oacute;n de dos archivos en
<CODE>/usr/share/fonts/truetype </CODE> denominados <CODE>ttinfo.dir</CODE> y <CODE>ttname.dir.</CODE>
 El servidor se ejecuta mediante el comando: <CODE>xfstt &amp;</CODE>. Pero tras la ejecuci&oacute;n
del comando nada parece ocurrir. En efecto, al ser usadas &uacute;nicamente  por X
estas fuentes no est&aacute;n disponibles en modo consola y s&iacute; en modo gr&aacute;fico. Hay que informarle
a X de su existencia. Esto se logra, tras lanzar X-Window, con el comando:<BR><P><CODE>xset fp+
unix/:7101</CODE><BR><P>A continuaci&oacute;n se puede verificar con xfontsel o el gestor de fuentes
de KDE que las TrueType est&aacute;n disponibles. Debieran estarlo para (&iexcl;casi!) todas las
aplicaciones X. StarOffice5 las acepta para StarDraw, StarImpress,  StarCalc...
pero extra&ntilde;amente no para StarWriter, salvo que exista una opci&oacute;n que deba activarse
que ha escapado a mi astucia :-). De todos modos, son utilizables por Gimp
<CENTER><BR><BR><IMG alt="[Figure 4]" height=504
src="../../common/images/article116/fig4_t1.jpg" width=664> </CENTER><BR><BR>La
documentaci&oacute;n del programa indica la posibilidad de agregar la siguiente l&iacute;nea en la secci&oacute;n
"Files" del XF86Config: FontPath "unix/:7101". En mi caso esto no
funciona. Asimismo se sugiere ejecutar xfstt antes de iniciar una sesi&oacute;n
X, lo que implica ejecutar los otros comandos en un terminal, corriendo el riesgo
de olvidarse. Lo mejor es automatizar las tareas escribiendo dos peque&ntilde;os
scripts, uno para activar el servidor y otro para desactivarlo. No debe olvidarse
transformar estos scripts en ejecutables (en MC, F9 luego File &gt; Chmod -Archivo &gt; cambiar permisos)
y guardarlos, por ejemplo, en /usr/local/bin. El script de activaci&oacute;n se lo puede denominar
ftt y al de desactivaci&oacute;n dftt.<P>El primero contendr&iacute;a las siguientes l&iacute;neas:
<PRE>#!/bin/sh
xfstt --sync
xfstt &amp;
xfstt fp+ unix/:7101
</PRE>
<P>En tanto que el segundo, simplemente: <PRE>#!/bin/sh
xset -fp unix/:7101
</PRE>
<P>Es soluci&oacute;n que uso y funciona.
<A NAME="116lfindex4">&nbsp;</A>
<H2>Crear los motivos</H2>

<P>Los motivos no son otra cosa que archivos de imagen bitmap en el formato .pat
espec&iacute;fico (por no decir propietario) de Gimp. Sirven para cubrir una superficie
con ayuda del "bote de pintura" y son guardados en el directorio /usr/local/share/gimp
/patterns. Los que han sido creados pueden ser guardados en
este lugar (en donde todos los usuarios tendr&aacute;n acceso) o en el directorio personal
 ~/.gimp/patterns, en cuyo caso s&oacute;lo el administrador (root) y uno mismo tendr&aacute; acceso.
<P>Supongamos que se quiere utilizar la figura 5 para  "tapizar" el fondo
de una imagen.
<CENTER><BR><BR><IMG alt="[Figure 5]" height=143
src="../../common/images/article116/fig5_t1.jpg" width=144> </CENTER><BR><BR>
<P>Se puede proceder en forma manual mediante copiar-pegar, pero la operaci&oacute;n es tediosa
y poco precisa: &iquest;se pueden acercar los motivos a un pixel de distancia?. Es conveniente
dejar esta tarea a Gimp que la har&aacute; si la imagen a replicar es para &eacute;l un
motivo, es decir un archivo .pat. Si este no es precisamente el caso se puede
solucionar el problema procediendo de la siguiente manera:<BR>
<UL>
  <LI>Cargar el motivo elegido en Gimp
  <LI>Guardarlo en uno de los directorios de arriba, teniendo cuidado de indicar
  que se quiere guardar en formato .pat,  haciendo clic derecho sobre la
  imagen Save as&gt; By extension&gt; Pat &gt; ~/.gimp/patterns/Tux1.pat&gt; ok
  (Guardar como&gt; Seg&uacute;n extensi&oacute;n&gt; Pat &gt;  ~/.gimp/patterns/Tux1.pat&gt; ok)
  <LI>Antes de guardar, Gimp pide que se le d&eacute; un nombre al motivo que no es el nombre
  con el que se lo guarda sino un r&oacute;tulo. Por defecto, el motivo se define como
  GIMP Pattern. Llam&eacute;mosle Tuxoro </LI></UL>
<P>Puesto que el nuevo motivo estar&aacute; disponible &uacute;nicamente al reabrir el programa,
salgamos de Gimp y ejecut&eacute;moslo nuevamente. En la caja de herramientas, hacer clic sobre
File&gt;Dialogs&gt;Patterns (Archivo&gt;Di&aacute;logos&gt;Motivos) con lo cual aparecer&aacute;
un muestrario con los motivos disponibles. Si se hace clic sobre una muestra
esta se visualizar&aacute; en escala natural bajo el puntero del rat&oacute;n. Adem&aacute;s, al hacer clic sobre
ella queda seleccionado el motivo que la representa. Puesto que los dise&ntilde;os
est&aacute;n ordenados alfab&eacute;ticamente, debemos buscar el motivo Tuxoro al final de las lista y
seleccionarlo para su utilizaci&oacute;n.<BR><P>Crear un &aacute;rea de trabajo mediante
File&gt;New&gt;Width 288 Height 286 (Archivo&gt;Nuevo&gt;Ancho 288 Alto 286)
(dimensiones para 4 motivos).
<BR><P>Hacer doble clic sobre Fill with a color or pattern (Rellenar con un color o motivo)
(bote de pintura). Seleccionar Pattern Fill (Rellenar con un motivo).
Al hacer clic en cualquier parte de la imagen vac&iacute;a &eacute;sta se
cubrir&aacute; con Tuxes de oro. <CENTER><BR><BR><IMG alt="[Figure 6]" height=358
src="../../common/images/article116/fig6_t1.jpg" width=330> </CENTER><BR><BR>
<P>Sin embargo, las "costuras" entre los motivos son visibles y el recubrimiento no resulta
est&eacute;tico. Esto proviene del propio motivo que no ha sido creado para hacer
un recubrimiento uniforme. Creemos uno. Abrir nuevamente la figura 5 y hacer clic derecho
en la imagen Filters&gt; Map&gt; Make Seamless (Filtros&gt; Transformaci&oacute;n&gt; Sin costura).
De esta forma, se obtiene un nuevo motivo
<CENTER><BR><BR><IMG alt="[Figure 7]" height=143
src="../../common/images/article116/fig7_t1.jpg" width=144> </CENTER><BR><BR>
<P>Guardarlo en el mismo lugar como Tux2.pat, con el identificador
Tuxazulejo. Salir de Gimp y ejecutarlo nuevamente. Preparar una imagen de 432x392 y llenarla con
el motivo Tuxazulejo. De esta manera se tiene una imagen uniforme con una apariencia un
tanto militar (que puede ser el buscado seg&uacute;n el uso que se le d&eacute; a la imagen).
A pesar de todo, el aspecto tiene una calidad superior al anterior.
<CENTER><BR><BR><IMG alt="[Figure 8]" height=471
src="../../common/images/article116/fig8_t1.jpg" width=474> </CENTER><BR><BR>
<P>No obstante, bien podr&iacute;amos querer una imagen m&aacute;s delicada, m&aacute;s difusa. Hagamos
el motivo adecuado:
<UL>
  <LI>Abrir nuevamente la figura 5
  <LI>Hacer clic derecho sobre la imagen Filters&gt;Map&gt;Illusion&gt;8&gt;OK
      (Filtros&gt;Transformaci&oacute;n&gt;Ilusi&oacute;n&gt;8&gt;OK)
  <LI>Se obtiene un nuevo motivo
  <CENTER><BR><BR><IMG alt="[Figure 9]" height=143
  src="../../common/images/article116/fig9_t1.jpg" width=144> </CENTER><BR><BR>
  <LI>Guardarlo en el mismo lugar como Tux3.pat, con el identificador
  TuxIllus
  <LI>Salir de Gimp, volver a ejecutarlo y preparar una imagen 432x392.
  <LI>Cubrirla con el motivo TuxIlus
  <LI>De esta manera se obtiene una colonia de Tuxes. &iquest;Es m&aacute;s linda, no?. Cuesti&oacute;n de gustos
  </LI></UL>
<CENTER><BR><BR><IMG alt="[Figure 10]" height=471
src="../../common/images/article116/fig10_t1.jpg" width=474> </CENTER><BR><BR>
<A NAME="116lfindex5">&nbsp;</A>
<H2>Conclusi&oacute;n provisoria</H2>

<P><A href="../../common/images/article116/fig11_t1.jpg">La imagen
final</A> muestra el uso que puede hacerse de estas fuentes adicionales
y como se pueden crear motivos diferentes a los motivos est&aacute;ndar de Gimp. Los
textos han sido hechos con el Sript-Fu logo... Es verdad, han sido un poco retocados
para tener este aspecto pero hacer lo mismo est&aacute; al alcance  de todos. Bastar&aacute; explorar
las innumerables posibilidades del programa y divertirse. </P>

<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=116&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Andr&eacute; Pascual, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article116.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">fr --&gt; -- : Andr&eacute; Pascual <small>&lt;apascual(at)club-internet.fr&gt;</small></font></td></tr>
  <tr><td><font size="2">fr --&gt; es: Walter Echarri &lt;wecharry(at)yahoo.com&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-11-05, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
