<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges     Tarbouriech
 =LF=CAT___: System Administration
 =LF=TITLE_: Nessus : Otro tabique en el muro de seguridad.
 =LF=NUMBER: 217
 =LF=ANAME_: article217.html
 -->
 <TITLE>lf217, System Administration: Nessus : Otro tabique en el muro de seguridad.</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Georges-Tarbouriech.jpg" alt=
    "[Photo of the Author]" height="124" width="115">
<BR>por  Georges Tarbouriech <br> <small>&lt;georges.t(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Georges es un viejo usuario de Unix. El piensa que la seguridad inform&aacute;tica es el principal desaf&iacute;o en
este siglo.<BR></P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Leo Trujillo Gomez  <small>&lt;aleogom(at)prodigy.net.mx&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#217lfindex0">Obteniendo e instalando nessus</A></LI>
  <LI><A HREF="#217lfindex1">Configurando y ejecutando nessus</A></LI>
  <LI><A HREF="#217lfindex2">Nessus en el trabajo</A></LI>
  <LI><A HREF="#217lfindex3">Plugins</A></LI>
  <LI><A HREF="#217lfindex4">Y ahora, &iexcl; algo completamente diferente !</A></LI>
  <LI><A HREF="#217lfindex5">&iexcl; Eso es todo !</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=217&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Nessus : Otro tabique en el muro de seguridad.</H2>
 <IMG src="../../common/images/article217/illustration217.png"
    hspace="10" width="241" height="180" alt="[illustration]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>
Nessus es un esc&aacute;ner de seguridad libre disponible en <A href=
    "http://www.nessus.org">http://www.nessus.org</A>. El proyecto fue iniciado y es mantenido por Renaud Deraison.
La versi&oacute;n estable, al momento de escribir este art&iacute;culo es la 1.09 y la versi&oacute;n experimental  la 1.14. El software es
liberado bajo GPL y mucha gente contribuye en el  proyecto, especialmente para plugins... En tanto que muchas
personas  se benefician del trabajo de nessus sin siquiera mencionar el nombre (m&aacute;s de esto al final del art&iacute;culo).
Nessus trabaja en muchos sabores de Unix, ya sea como cliente o servidor, y en Win32 como un cliente. Demos un
vistazo a esta gran herramienta.
    </P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="217lfindex0">&nbsp;</A>
<H2>Obteniendo e instalando nessus</H2>


    <P>
Visitando  <A href=
    "http://www.nessus.org">http://www.nessus.org</A>, puede obtener esta estupenda pieza de software. Dado que
nessus  est&aacute; disponible como cliente para Win32, obviamente consideraremos la versi&oacute;n Posix en este art&iacute;culo.<br>
Para usar nessus, necesita al menos nmap y Gtk (juego de herramientas  de Gimp). Los enlaces para esas
herramientas son proporcionados en el sitio web de nessus. Sin embargo, puesto que puede usar nessus
desde la l&iacute;nea de comandos, Gtk no es obligatorio.<br>
Puede obtener nessus en tres diferentes formas: la buena, la mala y la fea.<br>
La buena, es la forma est&aacute;ndar, esa en la que  descarga los archivos del sitio ftp que tenga m&aacute;s cercano. Tendr&aacute;
cuatro archivos: las librer&iacute;as nessus, librer&iacute;as nasl, el n&uacute;cleo de nessus y los plugins. Una vez desempacados, los
 tendr&aacute; que compilar e instalar como es usual: ./configure, make, make install, siguiendo el orden de los archivos
citados anteriormente.. Si  tiene una versi&oacute;n de nessus previa instalada en su
m&aacute;quina, tendr&aacute; que removerla. Para
hacer esto, nessus proporciona un archivo de comandos (script) de desinstalaci&oacute;n que ser&aacute; usado despu&eacute;s del
primer "./configure", el que esta en las librer&iacute;as nessus. Ejecute este script antes de escribir "make". Haga lo mismo
para cada paquete (excepto ejecutar otra vez el script de desinstalaci&oacute;n), y  habr&aacute; terminado.
La forma mala, consiste en ejecutar un script descargable llamado nessus-installer.sh. Entonces escriba "sh
nessus-installer.sh" para autoinstalar el paquete. Los cuatro paquetes viene en uno solo.<br>
La forma fea : tan pronto como lynx este instalado en su m&aacute;quina y usted conectado a internet, solo escriba
"lynx-source http://install.nessus.org | sh" y eso es todo. Usted NO necesita ser root para hacer esto.<br>
Obviamente, la forma recomendada es la "buena"... bien, si usted descargo
nessus, &iexcl; suponemos que la seguridad es
una preocupaci&oacute;n ! Dado que hablamos de la preocupaci&oacute;n, no olvide descargar la suma de verificaci&oacute;n (cheksum)
MD5.<br>
Nessus viene con diferentes utilidades (nasl, un lenguaje de script, nessus-adduser, nessus-build...). Cada una de
estas utilidades tiene su propia p&aacute;gina de manual (man), tanto para el cliente como el servidor. M&aacute;s documentaci&oacute;n
est&aacute; disponible dentro de la distribuci&oacute;n (README, INSTALL,...) o en el sitio web de nessus.


    </p>

    <A NAME="217lfindex1">&nbsp;</A>
<H2>Configurando y ejecutando nessus</H2>

    <p>
Vamos a hacer las cosas sencillas para entender, usaremos ejemplos de la versi&oacute;n de nessus para X11, que es la
que usa Gtk.

    </p>
    <strong>El servidor nessusd</strong>
    <p>

Para iniciar nessus, necesitar&aacute; obviamente ejecutar el demonio del servidor, nessusd. Cuando se inicia el demonio por
primera vez,  usted tendr&aacute; que declarar un nombre de usuario y contrase&ntilde;a, usando el comando nessus-adduser. Si
el paquete de las librer&iacute;as ha sido compilado con la opci&oacute;n "--enable-cipher" (que es recomendada, &iexcl; mas no
obligatoria !), una llave secreta ser&aacute; generada. Esta llave puede ser protegida con una contrase&ntilde;a. Muchas opciones
est&aacute;n disponibles cuando  se inicia el servidor y usted las encontrar&aacute; a  todas   en la p&aacute;gina man de nessusd.<br>
De all&iacute; puede crear la base de datos de usuarios y las reglas correspondientes. Es decir, qui&eacute;n est&aacute; autorizado para
ejecutar el demonio del servidor. qui&eacute;n est&aacute; autorizado para escanear (una m&aacute;quina, una red...). Las reglas son de la
forma "aceptar" (accept) o "denegar" (deny) seguido por la direcci&oacute;n de red IP, con su correspondiente m&aacute;scara de
red.<br>
Por ejemplo : accept 192.168.1.0/24, permite que el usuario pruebe la red 192.168.1 completa.<br>
Tambi&eacute;n es posible solamente definir un &uacute;nico usuario sin ninguna regla en absoluto. Si  desea permitir a varios
usuarios ejecutar nessusd tendr&aacute; que ser cuidadoso sobre lo que les permite hacer a ellos. No puede dejar que todo
mundo haga cualquier cosa en su red, &iquest;Puede hacerlo?<br>

Por &uacute;ltimo,  nessus cuenta con un archivo de configuraci&oacute;n  que (usualmente) se encuentra en
/usr/local/etc/nessus/nessusd.conf. Puede cambiar el contenido de este archivo manualmente, tan pronto como usted
sepa que es lo que est&aacute; haciendo.
    </p>
    <strong>El cliente nessus</strong>
    <p>
Usted puede, entonces, iniciar el cliente nessus para conectarse al servidor nessusd. Para ejecutar el cliente, basta
con escribir "nessus &" en un int&eacute;rprete de comandos.
Entonces se abre la ventana de configuraci&oacute;n, despu&eacute;s  se le pregunta la contrase&ntilde;&aacute; mencionada anteriormente. Esta
ventana le proporciona a usted siete pesta&ntilde;as.<br>
La primera de ellas es llamada "nessusd host". Desde la que  puede conectarse al anfitri&oacute;n nessusd dando clic en el
bot&oacute;n "Log in". Naturalmente, esto supone que usted esta autorizado para  conectarse como tal usuario, en otras
palabras, su nombre de usuario esta declarado en la base de datos de usuario.

    <br><br>
    <P><center><A HREF="../../common/images/article217/host.jpg"><IMG
    SRC="../../common/images/article217/hostth.jpg" ALT="nessusd
 host"></A></center>
    <br><br>

La segunda pesta&ntilde;a concierne a los plugins. Esta es donde usted seleciona o deselecciona los plugins que ser&aacute;n
usados para el escaneo. Por ejemplo, usted puede desactivar los plugins peligrosos (&iexcl; Los que son capaces de
colgar una m&aacute;quina !). Haciendo clic en un plugin se mostrar&aacute; alguna informaci&oacute;n  acerca del mismo en la parte inferior
de la ventana.
        <br><br>
    <center><A HREF="../../common/images/article217/plug.jpg"><IMG
    SRC="../../common/images/article217/plugth.jpg" ALT="plugins"
 ALIGN=TEXTTOP></A>
<A HREF="../../common/images/article217/plugd.jpg"><IMG
SRC="../../common/images/article217/plugdth.jpg" ALT="plugin detail"
ALIGN=TEXTTOP></A></center>
<br><br>
La tercer pesta&ntilde;a le permite definir las preferencias de los plugins. Esto concernientes a ping, TCP, FTP,... Aqu&iacute; muy
bien puede afinar la manera en que usar&aacute; nessus para escanear el anfitri&oacute;n(es)  destino o red.

<br><br>
    <P><center><A HREF="../../common/images/article217/prefs.jpg"><IMG
    SRC="../../common/images/article217/prefsth.jpg"
 ALT="preferences"></A></center>
    <br><br>

La cuarta pesta&ntilde;a le permite definir las opciones del esc&aacute;ner y los puertos que el escaneador usar&aacute;. Usualmente,
nmap es uno de ellos. M&aacute;s sobre nmap  <a
href="../July2001/article170.shtml">all&iacute;</a>.
<br><br>
    <P><center><A HREF="../../common/images/article217/scop.jpg"><IMG
    SRC="../../common/images/article217/scopth.jpg" ALT="scan
 options"></A></center>
    <br><br>
La quinta pesta&ntilde;a es donde le dir&aacute; a nessus los destinos de su exploraci&oacute;n.  En el campo target usted puede escribir
el nombre de un anfitri&oacute;n, el nombre de diferentes anfitriones separados por comas, una o m&aacute;s direciones IP, de nuevo
separadas por comas, o una direcci&oacute;n de red con su m&aacute;scara de red (por ejemplo 192.168.1.0/24). Existe tambi&eacute;n una
caja de comprobaci&oacute;n para ejecutar una zona de tranferencia DNS. Esto es, conect&aacute;ndose a un servidor DNS, nessus
tratar&aacute; de obtener la lista de hosts en este dominio.

    <br><br>
    <P><center><A HREF="../../common/images/article217/targ.jpg"><IMG
    SRC="../../common/images/article217/targth.jpg" ALT="target
 selection"></A></center>
    <br><br>
La sexta pesta&ntilde;a permite al usuario cambiar su contrase&ntilde;a, borrar su llave secreta o agregar reglas.
    <br><br>
    <P><center><A HREF="../../common/images/article217/user.jpg"><IMG
    SRC="../../common/images/article217/userth.jpg"
 ALT="user"></A></center>
    <br><br>

La &uacute;ltima, pero no  menos importante. La s&eacute;ptima  pesta&ntilde;a abre la ventana de cr&eacute;ditos conteniendo tambi&eacute;n el n&uacute;mero
de la versi&oacute;n. Esa es toda la informaci&oacute;n que se debe proporcionar cuando se est&aacute; usando nessus para un proyecto
distinto...  Bueno, &iexcl; eso tendr&iacute;a que ser as&iacute; !

    <br><br>
    <P><center><A HREF="../../common/images/article217/cred.jpg"><IMG
    SRC="../../common/images/article217/credth.jpg"
 ALT="credits"></A></center>
    <br><br>
Usted puede tener una octava pesta&ntilde;a si compila nessus con la opci&oacute;n de configuraci&oacute;n "--enable-save-kb".
Kb representa una "Base de Conocimiento". Esta es una caracter&iacute;stica experimental que permite usar los resultados
de una prueba previa. Esta funcionalidad estar&aacute; por defecto en nessus 1.1.0.
M&aacute;s acerca de kb en <A
    HREF="http://www.nessus.org/doc/kb_saving.html">kb_saving</a>.
Una vez que ha "visitado" cada pesta&ntilde;a, puede ejecutar la "bestia".  Basta con dar un clic en el bot&oacute;n "Start the scan".
&iquest;Qu&eacute; ocurre despu&eacute;s?

  </p>
     <A NAME="217lfindex2">&nbsp;</A>
<H2>Nessus en el trabajo</H2>

     <p>

Cuando usted inicia el esc&aacute;ner, nessus abre una ventana desplegando el estado del barrido. Por ejemplo,
supongamos que  est&aacute; probando una red completa, llamada 192.168.1.0/24.
Ocho m&aacute;quinas (anfitriones) ser&aacute;n desplegadas de inmediato, mostrando cual plugin est&aacute; usando para cada m&aacute;quina
junto a un indicador de progreso. Aqu&iacute; est&aacute; como aparece :

     <br><br>
    <P><center><A HREF="../../common/images/article217/atst.jpg"><IMG
    SRC="../../common/images/article217/atstth.jpg" ALT="scan
 status"></A></center>
    <br><br>
Como puede ver la prueba completa puede detenerse en cualquier momento. Dando clic en el bot&oacute;n correspondiente.
<br>
Obviamente, si  usted escanea una red completa con muchos anfitriones, la prueba se tomar&aacute; m&aacute;s tiempo.
Depender&aacute; de los Sistemas Operativos, la rapidez de la red, el rol de las m&aacute;quinas (m&aacute;s o menos puertos abiertos), el
n&uacute;mero de plugins activos, etc.
<br>
Usted tambi&eacute;n puede probar otras dos formas distintas:  los escaneos separados o los escaneos diferenciales.
Esto presupone que compil&oacute; nessus con la opci&oacute;n de configuraci&oacute;n citada anteriormente "--enable-save-kb".
El escaneo separado permite ejecutar pruebas en segundo plano mientras el escaneo diferencial, como su nombre lo
indica, solamente muestra las diferencias entre dos escaneos.
Encontrar&aacute; m&aacute;s informaci&oacute;n acerca de estas caracter&iacute;sticas dirigi&eacute;ndose a <A
    HREF="http://www.nessus.org/doc">la documentaci&oacute;n de nessus</a>.
<br>
Lo m&aacute;s importante, es el resultado que obtiene al final de el escaneo. Una de las m&aacute;s estupendas caracter&iacute;sticas de
nessus es la forma en  que le prove&eacute;  reportes.

    <br><br>
    <P><center><A HREF="../../common/images/article217/rep.jpg"><IMG
    SRC="../../common/images/article217/repth.jpg"
 ALT="report"></A></center>
    <br><br>
Estos reportes  son preferentemente detallados y  a menudo sugieren una soluci&oacute;n para
vulnerabilidades encontradas. A&uacute;n m&aacute;s, ellos en realidad son fiables. Si una vulnerabilidad es encontrada no es
precisamente que sea tal, nessus le informa que puede ser una  falsa alarma. Esto puede ocurrir, por ejemplo, con
versiones actualizadas de algunos demonios: una vulnerabilidad recientemente corregida puede ser detectada como
un riesgo potencial. Sin embargo, para esta clase de cosas, los plugins son r&aacute;pidamente actualizados.
<br>
Otro peque&ntilde;o error puede venir de nmap (2.53) cuando identifica la versi&oacute;n del Sistema Operativo. Pero, esto es
realmente de poco inter&eacute;s.
Personalmente, no me importa si un NoTerminado 4.0 con SP6 es identificado como
NoTerminado 4.0 con SP5, o si
el kernel de Linux 2.2.19 es detectado como 2.2.14. Yo no me lamentar&iacute;a sobre de si los "ex&oacute;tico" Sistemas Operativos
tales como AmigaOS o BeOS son identificados como una impresora o un enrutador. Quiero decir, no puedo
imaginarme
enviando yo un correo a fyodor (autor de nmap) dici&eacute;ndole tal cosa &iquest;Qui&eacute;n usa esos Sistemas Operativos en la
red hoy d&iacute;a? Para la AmigaOS, yo podr&iacute;a decir que cinco personas... en todo el Mundo :-(
<br>
Algunos otros Sistemas operativos tampoco  son perfectamente identificados. Pero ellos frecuentemente son m&aacute;s bien
"nuevos" o no son realmente usados. Esto es verdad para MacOS X o QNX. Pero, una vez m&aacute;s, eso no es importante
y esto puede ser ya resuelto en la nueva versi&oacute;n beta 2.54 de nmap.
(y, a prop&oacute;sito, esta nueva versi&oacute;n proporciona un port para MacOS X).
<br>
De cualquier manera, el punto principal es que nessus le proporciona toneladas de informaci&oacute;n, permiti&eacute;ndole
 corregir las vulnerabilidades de las m&aacute;quinas o debilidades de su red local.
<br>
Estos reportes pueden ser guardados como texto, NSR, HTML, HTML con gr&aacute;ficas en forma de pastel...  as&iacute; como
permitirle la comparaci&oacute;n
entre dos escaneos. Puede parecer obvio, pero el estado de una red en un tiempo dado puede ser  muy diferente de lo
que ser&aacute; 30 minutos despu&eacute;s. &iquest; Por qu&eacute; ?
&iexcl; Una red esta viva ! Esta en una las principales razones de por qu&eacute; la seguridad de una red no es f&aacute;cil : las cosas
cambian todo el tiempo. Si usted se pregunta acerca de las necesidades de usar herramientas tales como nessus y
nmap, aqu&iacute; esta la respuesta.<br>
Si ustedes son curiosos sobre la manera en que nessus trabaja, observen los registros del sistema o,  si usan snort,
observen los registros de snort. Otro lugar para encontrar informaci&oacute;n es en /usr/local/var/nessus.<br>
A partir de aqu&iacute;, usted probablemente tendr&aacute; alg&uacute;n trabajo por hacer para reducir la vulnerabilidad de muchas
m&aacute;quinas en su red. Cuanto m&aacute;s  pueda endurecer cada host, es lo mejor. Para ayudarlo en esta gran tarea, nessus
(y el mismo nmap) son las herramientas sin la que no puede vivir.

</p>
<A NAME="217lfindex3">&nbsp;</A>
<H2>Plugins</H2>

<p>
Los plugins son el "coraz&oacute;n" de nessus. Ellos son las pruebas de seguridad, esto significa descubrir una
vulnerabilidad
determinada. NASL (Nessus Attack Sripting Language) es un leguaje recomendado para escribir pruebas de
seguridad. Encontrar&aacute; mucho sobre NASL dirigi&eacute;ndose a este URL: <A
    HREF="http://www.nessus.org/doc/nasl.html">NASL</a>.
    <br>.
Consecuentemente, si usted quiere contribuir al proyecto nessus escribiendo plugins, este es el sitio donde
encontrar&aacute; la informaci&oacute;n correcta. Al momento de escribir esto, &iexcl; existen 756 plugins en la base de datos de nessus !
    <br>
Existen aproximadamente 20 familias de plugins : puertas traseras, denegaci&oacute;n de servicio, lograr accesos root
remotamente... Como ya lo mencionamos, cada plugin reporta informaci&oacute;n. Dici&eacute;ndole qu&eacute; esta incorrecto y que
deber&iacute;a
hacer usted para corregir el problema.
<br>
Nosotros no podemos hablar acerca de los plugins sin mencionar CVE (Common Vulnerabilities and Exposures -
Riesgos y vulnerabilidades comunes). Es una enorme base de datos de informaci&oacute;n disponible en <A
    HREF="http://cve.mitre.org">http://cve.mitre.org</a>.  All&iacute; encontrar&aacute; todo
    acerca de los riesgos de seguridad
conocidos.
Otro estupendo lugar de compartici&oacute;n de conocimiento.
Tal sitio web es la referencia absoluta que usted debe visitar.
<br>
Por supuesto, hay mucho que decir acerca de los plugins de nessus, pero un libro podr&iacute;a no ser suficiente. Una buena
manera de entender c&oacute;mo ellos trabajan, y c&oacute;mo est&aacute;n escritos es leerlos desde su directorio
/usr/local/lib/nessus/plugins. Gracias de nuevo a Renaud Deraison y los colaboradores por este estupendo trabajo.
</p>

 <A NAME="217lfindex4">&nbsp;</A>
<H2>Y ahora, &iexcl; algo completamente diferente !</H2>

 <p>
A&uacute;n si este t&iacute;tulo suena como el Monte Pyton, desafortunadamente, no hay humorismo en &eacute;l. Las tres o cuatro
personas  que est&aacute;n leyendo mis art&iacute;culos saben acerca de mis usuales frases fuera de tema : &iexcl; esta vez, esta es
 una secci&oacute;n entera ! Esto es realmente Fuera de Tema, esta es otra historia.
Veamos.
<br>
Dado que yo estoy muy interesado en la seguridad de las computadoras, frecuentemente visito los sitios web
dedicados a ella. Puede ser para aprender nuevas vulnerabilidades o descubrir nuevas herramientas de seguridad.
Casualmente, encontr&eacute; algunos productos basados en servicios de escaneo en L&iacute;nea. De hecho, ellos se llaman a s&iacute;
mismos (al menos por ahora) ASP (Application Service Provider - Provedor de servico de aplicaci&oacute;n). Si usted va un
poco m&aacute;s all&aacute; , r&aacute;pidamente descubrir&aacute; que el motor que est&aacute; detr&aacute;s del servicio es nessus. Hasta el momento, todo
bien. Sin embargo, cuando usted trata de encontrar la informaci&oacute;n expl&iacute;cita  no puede ver la palabra "nessus".  &iexcl; De tal
manera que me siento herido !

    <br>
Mucha gente trabajando para la comunidad del Software Libre, hacen este trabajo para que sea libre de cargo y no como
sustento. El &uacute;nico pago que ellos obtienen es llamado : Cr&eacute;dito. nessus es liberado bajo GPL. Esto es, todo Mundo
puede usar el producto, modificarlo, adaptarlo...  con la condici&oacute;n de que el autor(es) original sea mencionado. Desde
luego, esta
licencia dice mucha m&aacute;s que eso. Si usted no sabe qu&eacute; es la GPL, puede verla  <A
    HREF="http://www.gnu.org/licenses/licenses.html">aqu&iacute;</a>.
 <br>
Para m&iacute;, esto parece como un robo. Quiero decir, yo no necesito una licencia para acreditar el trabajo de otras
personas. Tengo mucho respeto  hacia aquellas personas que trabajan por la Libertad (casi siempre) y lo comparten
con una  comunidad. Ellos merecen el reconocimiento de esa comunidad. Esto es especialmente cierto cuando la
gente trata de hacer dinero del trabajo de alg&uacute;n otro. Usted puede llamar a eso respeto, reconocimiento, o no importa
como.
El hecho es, que esas palabras parecen haber perdido su significado.
Seguramente, podr&iacute;amos decir que la GPL es la
causa de tales comportamientos.
 Con ASP, usted no tiene en cuenta como vender el software. Seg&uacute;n el pa&iacute;s, la GPL puede que no tenga valor
legal.
<br>
Una soluci&oacute;n podr&iacute;a ser que los usuarios de los servicios ASPs soliciten el nombre del motor de escaneo que hace el
verdadero trabajo. La respuesta dada ser&iacute;a al menos decir si la gente que proporciona el servicio es "honesta". Si
no responden o si dicen que ellos "inventaron" el motor (en el cual usted identifica como nessus), &iexcl; sencillamente ya
no lo use ! En lugar de eso instale nessus (el verdadero), en todo caso ser&aacute; mas seguro.<br>
 Pero, una vez m&aacute;s, &iquest; nosotros necesitamos una licencia para decir "Gracias" a la gente que ha hecho posible este
gran y estupendo trabajo ? Y, por cierto, Renaud Deraison no quiere cambiar la licencia de nessus : nessus seguir&aacute;
estando bajo GPL.<br>
Lo siento por esta larga disgresi&oacute;n, pero creo que esto deber&iacute;a ser dicho.

</p>
<A NAME="217lfindex5">&nbsp;</A>
<H2>&iexcl; Eso es todo !</H2>

<p>

A pesar de la &uacute;ltima secci&oacute;n, lo que hay que recordar de este art&iacute;culo es que nessus es un est&aacute;ndar de alta calidad.
Es un software bastante impresionante. Usado en conjunci&oacute;n con nmap, se convierte en algo que debe tener cuando
 la seguridad es una preocupaci&oacute;n. Es una herramienta muy responsable, que se mejora cada d&iacute;a. Gracias a
Renaud y amigos por su constante actualizaci&oacute;n de plugins.<br>
Hoy, un administrador de sistemas no puede trabajar sin nessus y nmap. Estas herramientas son capaces de
encontrar vulnerabilidades que usted pensaba estaban resueltas. Esto es verdad para muchos de los Sistemas
Operativos que se encuentran en su red.  Y cuando usted sepa que algunos Sistemas Operativos son como cribas,
nessus le permitir&aacute; a usted relajarse un poco.
<br>
A&uacute;n m&aacute;s, nessus puede ayudarle a entender la forma que una red (o una m&aacute;quina) puede ser comprometida.
<br>
Si lee cuidadosamente los reportes que le prove&eacute;, t&oacute;melos  en cuenta y haga las correcciones apropiadas.
Usted mejorar&aacute; mucho la seguridad de esa red (o m&aacute;quina). De nuevo, yo dije "mejorar" : su red no puede ser 100%
segura
simplemente porque usted ejecute nessus. El camino de la seguridad es muy amplio y estamos lejos del final de &eacute;l.
<br>
Una vez m&aacute;s, gracias a la comunidad del Software Libre por este trabajo acerca de la seguridad.
<br>
En cuanto a aquellas simp&aacute;ticas personas que hacen dinero del trabajo de los miembros de esta comunidad de
Software Libre, yo quisiera agregar algo. Decir "Gracias" no es una verg&uuml;enza. Ser honesto no es horrible &iquest;O s&iacute;? Si
esta clase de comportamientos crece, el riesgo es el f&iacute;n de la comunidad o un gran cambio en el licenciamiento (&iexcl; y
probablemente m&aacute;s y m&aacute;s patentes !).  En ambos casos, se har&aacute; cargo de s&iacute; mismo y las cosas se volver&aacute;n m&aacute;s
dif&iacute;ciles para usted. Y desafortunadamente, nosotros no seremos capaces de usar software libre de ning&uacute;n modo. Esto
no significa que ser&aacute; capaz de vender el de usted. &iexcl; meditelo !
<br>
&iquest;No vivimos en una &eacute;poca maravillosa?
<br>
<!-- vim: set sw=2 ts=2 et: -->
  





<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=217&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges     Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article217.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Georges Tarbouriech <small>&lt;georges.t(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Leo Trujillo Gomez  &lt;aleogom(at)prodigy.net.mx&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-11-05, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
