<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.5 [es] (Win95; I) [Netscape]">
   <meta name="Author" content="Ismael Olea">
   <title>&iquest;C&oacute;mo escribir un documento en Linuxdoc-SGML?</title>
</head>
<body>

<h1>
&iquest;C&oacute;mo escribir un documento en Linuxdoc-SGML?</h1>
Por Ismael Olea (<a href="mailto:olea@iname.com">olea@iname.com</a>)
<br>&nbsp;
<h2>
Introducci&oacute;n</h2>
C&oacute;mo deb&eacute;is saber, el formato <b>Linuxdoc-SGML</b> es el
formato oficial de la biblioteca de <b>Howtos</b> del <a href="http://metalab.unc.edu/LDP">LDP</a>.
<p>Igualmente lo es de la biblioteca oficial de &laquo;<i>c&oacute;mos</i>&raquo;
que mantiene <b><a href="http://www.insflug.org">Insflug</a></b> y replica
<b><a href="http://lucas.hispalinux.es">LuCAS</a></b>.
<p><b>Insflug</b> no acepta m&aacute;s que documentos en este formato por
una serie de motivos:
<ul>
<li>
es el &laquo;oficial&raquo;;</li>

<li>
las herramientas de creaci&oacute;n son omnipresentes en cualquier distribuci&oacute;n
moderna;</li>

<li>
el original puede ser procesado autom&aacute;ticamente;</li>

<li>
el original puede ser editado con cualquier clase de programa;</li>

<li>
los formatos de salida son m&uacute;ltiples: <i>texto</i>, <i>man</i>,
<i>info</i>,
<i>lyx</i>, <i>html</i>, <i>rtf</i>, <i>latex</i>, <i>postcript</i>,
<i>pdf</i>...</li>

<li>
Las estructuras de <b>Insflug</b> y <b>Lucas</b> est&aacute;n dise&ntilde;adas
para manejar este tipo de documentos autom&aacute;ticamente;</li>

<li>
es muy f&aacute;cil de aprender.</li>
</ul>
Pod&eacute;is comprender que si no se edita con <b>Linuxdoc-SGML</b>, un
&laquo;<i>c&oacute;mo</i>&raquo; nunca tendr&aacute; tanta difusi&oacute;n,
ya que no se beneficia de la red de r&eacute;plicas a nivel mundial y que
alcanza igualmente a todas y cada una de las distribuciones modernas merced
a la red de replicaci&oacute;n de <b>Insflug</b>.
<p>Y no resta que documento no pueda ser categorizado como &laquo;<i>c&oacute;mo</i>&raquo;
para que no us&eacute;is <b>Linuxdoc-SGML</b> en su maquetaci&oacute;n.
Us&aacute;ndolo disfrutamos de la mayor&iacute;a de las ventajas enumeradas
anteriormente y facilit&aacute;is la labor a los administradores de <b>Lucas</b>.
<p>Es importante se&ntilde;alar que el pr&oacute;ximo formato est&aacute;ndar
que usar&aacute; el <b>LDP</b> en alg&uacute;n momento del futuro est&aacute;
igualmente basado en <b><i>SGML</i></b> y est&aacute; asegurada la transici&oacute;n
del antiguo formato (<b>Linuxdoc-SGML</b>) al que lo suceder&aacute; (<b>DocBook</b>).
<br>&nbsp;
<h2>
&iquest;Qu&eacute; es Linuxdoc-SGML?</h2>
<b>Linuxdoc-SGML</b> es una aplicaci&oacute;n de <i>SGML</i>.
<p><i>SGML</i> es un metalenguaje para la construcci&oacute;n de lenguajes
de marcas.
<p><b>HTML</b> es un ejemplo, en sus diferentes versiones, de lenguaje
de marcas creado con <i>SGML</i>.
<p><b>Linuxdoc-SGML</b> es, como <b>HTML</b>, otra aplicaci&oacute;n <i>SGML</i>.
<p><b>Linuxdoc-SGML</b> est&aacute; dise&ntilde;ado para la estructuraci&oacute;n,
mediante marcas, de documentos t&eacute;cnicos.
<p>Desgraciadamente no est&aacute; dise&ntilde;ado con exhaustivo rigor.
Sin embargo es muy &uacute;til y su simplicidad hace que sea muy f&aacute;cil
de aprender y de usar.
<p>El usuario t&iacute;pico de <b>Linuxdoc-SGML</b> hace uso de la herramienta
<b>SGMLtools</b>
que puede encontrarse en cualquier distribuci&oacute;n conocida digna de
ese nombre.
<p>Pueden encontrarse versiones anteriores de <b>SGMLtools</b> con los
nombres <b>SGML-tools</b> y <b>Linuxdoc-SGML</b>.
<p>El kit <b>SGMLtools</b> incluye un analizador que sirve para comprobar
que el documento escrito es correcto (osea, que se atiene perfectamente
a la definici&oacute;n del lenguaje de marcas que se encuentra en el fichero
<i>linuxdoc-sgml.dtd</i>).
<p>Adem&aacute;s, el kit dispone de un conjunto de programas que permiten
exportar
el documento a los diferentes formatos abiertos enumerados m&aacute;s arriba.
<p>Para alguno de ellos puede necesitar otras herramientas t&iacute;picas
de un sistema <b>GNU</b>/<b>Linux</b> (<b>groff</b>, <b>latex</b>, etc).
<p>Una vez que su documento est&aacute; acabado y ha comprobado que el
analizador de <b>SGMLtools</b> lo abala puede enviarlo a los coordinadores
de <b>Lucas</b> o <b>Insflug</b> para proceder a su publicaci&oacute;n.
<p>Es <u>MUY</u> importante usar versiones 1.0.* de <b>SGMLtools</b>. Las
versiones 2.0.* son para <i>DocBook.dtd</i>.
<p>Puede encontrar <b>SGMLtools</b> en <a href="http://www.sgmltools.org">http://www.sgmltools.org</a>.
<br>&nbsp;
<h2>
&iquest;C&oacute;mo aprender Linuxdoc-SGML?</h2>
Insisto en que es muy f&aacute;cil aprender a usarlo. Y muy recomendable
puesto que la herramienta podemos usarla para nuestros propios documentos
prescindiendo de otras herramientas, conocidas de todos, que acaban siendo
bastante m&aacute;s dif&iacute;ciles de usar.
<p>Aseg&uacute;rate que tienes ya instalado en tu sistema el paquete <b>SGMLtools</b>.
Insisto en que debe tratarse de una versi&oacute;n 1.0.* &oacute; inferior.
<p>Hazte con los manuales de <b>SGMLtools</b> en espa&ntilde;ol que encontrar&aacute;s
en:
<ul>
<li>
<a href="http://www.insflug.org/detalle.php3?comoID=29">http://www.insflug.org/detalle.php3?comoID=29</a></li>

<li>
<a href="http://lucas.hispalinux.es/COMO-INSFLUG/COMOs/Linuxdoc-Como/Linuxdoc-Como.html">http://lucas.hispalinux.es/COMO-INSFLUG/COMOs/Linuxdoc-Como/Linuxdoc-Como.html</a></li>

<li>
<a href="http://www.insflug.org/detalle.php3?comoID=11">http://www.insflug.org/detalle.php3?comoID=11</a></li>

<li>
<a href="http://lucas.hispalinux.es/COMO-INSFLUG/COMOs/Linuxdoc-Ejemplo/Linuxdoc-Ejemplo.html">http://lucas.hispalinux.es/COMO-INSFLUG/COMOs/Linuxdoc-Ejemplo/Linuxdoc-Ejemplo.html</a></li>
</ul>
Finalmente, y como ilustraci&oacute;n, pueden usarse los originales de
cualquier &laquo;<i>c&oacute;mo</i>&raquo; ya publicado. Un examen a su
contenido resultar&aacute; revelador.
<p>Con todo este material podr&eacute;is dar un paso en vuestro desarrollo
personal como autores, ya que a partir de ahora pod&eacute;is crear de
forma abstracta documentos, con m&aacute;s sencillez y rapidez que las
t&iacute;picas herramientas de autoedici&oacute;n y procesado de textos
que los tiempos est&aacute;n demostrando que caen en la obsolescencia arrastrando
con ellas a los usuarios.
</body>
</html>
