<HTML>
<HEAD>
<TITLE>Linux Information Sheet: Hardware</TITLE>
</HEAD>
<BODY>
<A HREF="InfoSheet-Como-2.html">Anterior</A>
<A HREF="InfoSheet-Como-4.html">Siguiente</A>
<A HREF="InfoSheet-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Hardware</A></H2>

<H2><A NAME="ss3.1">3.1 Configuraci&oacute;n m&iacute;nima</A></H2>

<P>La siguiente es posiblemente la m&iacute;nima configuraci&oacute;n sobre la que Linux
puede trabajar: 386SX/16, 2 Mb RAM, disquetera de 1.44 Mb o de 1.2 Mb y
cualquier tarjeta gr&aacute;fica soportada (m&aacute;s teclado, monitor y dem&aacute;s, por
supuesto). Esto deber&iacute;a permitirte arrancar y comprobar si trabaja en el
ordenador, pero no ser&aacute;s capaz de hacer nada &uacute;til.</P>
<P>Para hacer algo, necesitar&aacute;s adem&aacute;s algo de espacio en disco duro tambi&eacute;n, 5
o 10 Mb ser&aacute;n suficientes para una configuraci&oacute;n minim&iacute;sima (con s&oacute;lo los
comandos m&aacute;s importantes y quiz&aacute;s una o dos peque&ntilde;as aplicaciones
instaladas, como por ejemplo un programa de terminal). Esto es a&uacute;n muy, muy
limitado, y muy inc&oacute;modo, ya que no deja sufiente espacio para casi nada, a
menos que tus aplicaciones sean bastante limitadas. No es recomendable para
nada salvo para probar si las cosas funcionan y por supuesto para poder
alardear de los pocos recursos requeridos.</P>


<H2><A NAME="ss3.2">3.2 Configuraci&oacute;n usable</A></H2>

<P>Si vas a ejecutar programas de computaci&oacute;n intensiva, como gcc, X y TeX,
probablemente querr&aacute;s un procesador m&aacute;s r&aacute;pido que el 386SX/16, pero incluso
eso ser&iacute;a suficiente si fueras paciente.</P>
<P>En la pr&aacute;ctica necesitas al menos 4 Mb de RAM si no usas X, y 8 Mb en caso
contrario. Adem&aacute;s, si quieres tener muchos usuarios al mismo tiempo o
ejecutar muchos programas grandes (compiladores por ejemplo) al mismo
tiempo tambi&eacute;n, querr&aacute;s m&aacute;s de 4 Mb de memoria RAM. Puede trabajar con menor
cantidad de memoria (deber&iacute;a de hacerlo incluso con 2 Mb), pero usar&iacute;a
memoria virtual (usando el disco duro como una memoria lenta) y eso ser&iacute;a
tan lento como para calificarlo de in&uacute;til.</P>
<P>La cantidad de disco duro que necesites depende del software que pienses
instalar. El conjunto de utilidades t&iacute;picas de Unix, shells y programas de
administrador ocupan menos de 10 Mb, con un poco de espacio libre para
ficheros de usuario. Para un sistema m&aacute;s completo consigue la Slackware, MCC
o Debian, y asume que necesitar&aacute;s entre 60 y 200 Mb, seg&uacute;n lo que eligas
instalar y la distribuci&oacute;n de que se trate. A&ntilde;ade el espacio que desees
reservar para los archivos de usuario a estos totales. Con los precios de
los discos duros en la actualidad, si vas a comprar un nuevo sistema no
tiene sentido comprar una unidad demasiado peque&ntilde;a. Adquiere al menos 200
Mb, preferiblemente 500 Mb o m&aacute;s, y no te arrepentir&aacute;s.</P>
<P>A&ntilde;ade m&aacute;s memoria, m&aacute;s disco duro, un procesador m&aacute;s r&aacute;pido y otras cosas
seg&uacute;n tus necesidades, deseos y cartera para sobrepasar lo simplemente
usable. En general, una gran diferencia frente a DOS es que con Linux,
a&ntilde;adir memoria supone una grand&iacute;sima diferencia, mientras que con DOS m&aacute;s
memoria no supone tanta mejora. Esto por supuesto tiene algo que ver con los
640 Kb que pone por l&iacute;mite el DOS, hecho que no se da en absoluto bajo
Linux.</P>


<H2><A NAME="ss3.3">3.3 Hardware soportado</A></H2>

<P>
<DL>
<DT><B>CPU:</B><DD><P>Cualquiera que pueda ejecutar programas en modo protegido del 386
(todos los modelos de 386, 486, 586 y 686 deber&iacute;an valer; los 286 no 
funcionan ni lo har&aacute;n jam&aacute;s). Adem&aacute;s, una versi&oacute;n para las CPU's 680x0 (para 
x=2 con MMU externa, 3 y 4) que est&aacute; implementada en Amigas y Ataris est&aacute; 
siendo desarrollada y puede ser encontrada en tsx-11.mit.edu en el 
directorio 680x0. Muchas Alphas son soportadas. Se est&aacute; portando a PowerPC,
ARM y a arquitecturas MIPS. M&aacute;s detalles disponibles en cualquier otro lugar.</P>

<DT><B>Architecturas:</B><DD><P>Buses ISA o EISA. MCA (el de los PS/2) no funciona. Los
buses locales (VLB y PCI) funcionan.</P>

<DT><B>RAM:</B><DD><P>Te&oacute;ricamente hasta 1 Gb, aunque jam&aacute;s ha sido probado hasta este
extremo. Algunas personas (incluido Linus) han notado que a&ntilde;adiendo memoria
sin incrementar el cach&eacute; al mismo tiempo su m&aacute;quina se ha ralentizado
extremadamente, por ello si a&ntilde;ades memoria y encuentras tu m&aacute;quina m&aacute;s lenta
prueba a ponerle m&aacute;s cach&eacute;. Por encima de 64Mb de ram se requiere un
par&aacute;metro de arranque, ya que la BIOS no puede detectar m&aacute;s que 64 Mb por su
implementaci&oacute;n.</P>

<DT><B>Almacenamiento de datos:</B><DD><P>Las unidades tipo AT (IDE, controladores de
disco duro de 16 bits con MFM o RLL, o ESDI) son soportadas, como tambi&eacute;n lo
son los discos duros y CD-ROM SCSI, con un adaptador SCSI soportado. Las
cotroladoras tipo XT (controladoras de 8 bits con MFM o RLL) tambi&eacute;n son
soportadas. Adaptadores SCSI soportados: Adaptec 1542, 1522, 1740 y la serie
27xx, controladoras Buslogic v&iacute;a compatibilidad con Adaptec o con su propio
driver, controladoras basadas en NCR53c810, Seagate ST-01 y ST-02, de Future
Domain la serie TMC-88x (o cualquier placa basada en el chip TMC950) y
TMC1660/1680, Ultrastor 14F, 24F y 34F, Western Digital wd7000 y otras. Las
unidades de cinta SCSI y algunas QIC-02 y QIC-80 tambi&eacute;n son soportadas.
Bastantes unidades de CD-ROM tienen soporte tambi&eacute;n, incluyendo
Matsushita/Panasonic, Mitsumi, Sony, Soundblaster, Toshiba, ATAPI y otras.
Para modelos exactos consulta el HOWTO de compatibilidad de hardware.</P>

<DT><B>Video:</B><DD><P>VGA, EGA, CGA y Hercules (y compatibles) trabajan en modo
texto. Para gr&aacute;ficos y X hay soporte para (al menos) VGA normal, algunas
tarjetas super-VGA (la mayor&iacute;a de las basadas en ET3000, ET4000, Paradise, y
algunas Trident), S3, 8514/A, ATI MACH8, ATI MACH32 y Hercules. (Linux usa
XFree86 como servidor X y &eacute;ste es quien determina qu&eacute; tarjetas son
soportadas).</P>

<DT><B>Redes:</B><DD><P>Western Digital 80x3, ne1000, ne2000, 3com503, 3com509, 3com589
PCMCIA, Allied Telliesis AT1500, la mayor&iacute;as de las placas LANCE, adaptadores
de bolsillo d-link, PPP, SLIP, CSLIP, PLIP (Parallel Link IP) y m&aacute;s.</P>

<DT><B>Serie:</B><DD><P>La mayor&iacute;a de las placas basadas en UART 16450 and 16550,
incluyendo AST Fourport, la Usenet Serial Card II y otras. Las placas
inteligentes soportadas incluyen a la serie Cyclades Cyclom (soporte del
propio fabricante), la serie Comtrol Rocketport (soporte del fabricante
tambi&eacute;n), Stallion (la mayor&iacute;a de placas y con soporte por parte del
fabricante) y Digi (algunas placas y sin soporte por parte del fabricante).</P>

<DT><B>Otro hardware:</B><DD><P>SoundBlaster, ProAudio Spectrum 16, Gravis Ultrasound,
varios tipos de rat&oacute;n de bus (Microsoft, Logitech, PS/2).</P>
</DL>
</P>


<HR>
<A HREF="InfoSheet-Como-2.html">Anterior</A>
<A HREF="InfoSheet-Como-4.html">Siguiente</A>
<A HREF="InfoSheet-Como.html#toc3">Indice</A>
</BODY>
</HTML>
