<HTML>
<HEAD>
<TITLE>Linux Information Sheet: Caracter&iacute;sticas de Linux</TITLE>
</HEAD>
<BODY>
<A HREF="InfoSheet-Como-1.html">Anterior</A>
<A HREF="InfoSheet-Como-3.html">Siguiente</A>
<A HREF="InfoSheet-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Caracter&iacute;sticas de Linux</A></H2>

<P>
<UL>
<LI> multitarea: varios programas (realmente procesos) ejecut&aacute;ndose al
mismo tiempo.</LI>
<LI> multiusuario: varios usuarios en la misma m&aacute;quina al mismo tiempo (¡y
<B>sin</B> licencias para todos!).</LI>
<LI> multiplataforma: corre en muchas CPUs distintas, no s&oacute;lo Intel.</LI>
<LI> funciona en modo protegido 386.</LI>
<LI> tiene protecci&oacute;n de la memoria entre procesos, de manera que uno de 
ellos no pueda colgar el sistema.</LI>
<LI> carga de ejecutables por demanda: Linux s&oacute;lo lee de disco aquellas 
partes de un programa que est&aacute;n siendo usadas actualmente.</LI>
<LI> pol&iacute;tica de copia en escritura para la compartici&oacute;n de p&aacute;ginas entre
ejecutables: esto significa que varios procesos pueden usar la misma 
zona de memoria para ejecutarse. Cuando alguno intenta escribir en 
esa memoria, la p&aacute;gina (4Kb de memoria) se copia a otro lugar. Esta 
pol&iacute;tica de copia en escritura tiene dos beneficios: aumenta la 
velocidad y reduce el uso de memoria.</LI>
<LI> memoria virtual usando paginaci&oacute;n (sin intercambio de procesos 
completos) a disco: una partici&oacute;n o un archivo en el sistema de 
archivos, o ambos, con la posibilidad de a&ntilde;adir m&aacute;s &aacute;reas de 
intercambio sobre la marcha (se sigue denominando intercambio, es en 
realidad un intercambio de p&aacute;ginas). Un total de 16 zonas de 
intercambio de 128Mb de tama&ntilde;o m&aacute;ximo pueden ser usadas en un 
momento dado con un l&iacute;mite te&oacute;rico de 2Gb para intercambio.</LI>
<LI> la memoria se gestiona como un recurso unificado para los programas de
usuario y para el cach&eacute; de disco, de tal forma que toda la memoria 
libre puede ser usada para cach&eacute; y &eacute;ste puede a su vez ser reducido 
cuando se ejecuten grandes programas.</LI>
<LI> librer&iacute;as compartidas de carga din&aacute;mica (DLL's) y librer&iacute;as est&aacute;ticas
tambi&eacute;n, por supuesto.</LI>
<LI> se realizan volcados de estado (core dumps) para posibilitar los 
an&aacute;lisis post-mortem, permitiendo el uso de depuradores sobre los 
programas no s&oacute;lo en ejecuci&oacute;n sino tambi&eacute;n tras abortar &eacute;stos por 
cualquier motivo.</LI>
<LI> casi totalmente compatible con POSIX, System V y BSD a nivel fuente.</LI>
<LI> mediante un m&oacute;dulo de emulaci&oacute;n de iBCS2, casi completamente 
compatible con SCO, SVR3 y SVR4 a nivel binario.</LI>
<LI> todo el c&oacute;digo fuente est&aacute; disponible, incluyendo el n&uacute;cleo completo y
todos los drivers, las herramientas de desarrollo y todos los 
programas de usuario; adem&aacute;s todo ello se puede distribuir 
libremente. Hay algunos programas comerciales que est&aacute;n siendo 
ofrecidos para Linux actualmente sin c&oacute;digo fuente, pero todo lo que 
ha sido gratuito sigue siendo gratuito.</LI>
<LI> control de tareas POSIX.</LI>
<LI> pseudo-terminales (pty's).</LI>
<LI> emulaci&oacute;n de 387 en el n&uacute;cleo, de tal forma que los programas no 
tengan que hacer su propia emulaci&oacute;n matem&aacute;tica. Cualquier m&aacute;quina 
que ejecute Linux parecer&aacute; dotada de coprocesador matem&aacute;tico. Por 
supuesto, si tu ordenador ya tiene una FPU (unidad de coma flotante), 
ser&aacute; usada en lugar de la emulaci&oacute;n, pudiendo incluso compilar tu 
propio kernel sin la emulaci&oacute;n matem&aacute;tica y conseguir un peque&ntilde;o 
ahorro de memoria.</LI>
<LI> soporte para muchos teclados nacionales o adaptados y es bastante 
f&aacute;cil a&ntilde;adir nuevos din&aacute;micamente.</LI>
<LI> consolas virtuales m&uacute;ltiples: varias sesiones de login a trav&eacute;s de la
consola entre las que se puede cambiar con las combinaciones 
adecuadas de teclas (totalmente independiente del hardware de video).
Se crean din&aacute;micamente y puedes tener hasta 64.</LI>
<LI> soporte para varios sistemas de archivo comunes, incluyendo minix-1,
Xenix y todos los sistemas de archivo t&iacute;picos de System V, y tiene un
avanzado sistema de archivos propio con una capacidad de hasta 4 Tb y
nombres de archivos de hasta 255 caracteres de longitud.</LI>
<LI> acceso transparente a particiones MS-DOS (o a particiones OS/2 FAT)
mediante un sistema de archivos especial: no necesitas ning&uacute;n comando
especial para usar la partici&oacute;n MS-DOS, parece un sistema de archivos
normal de Unix (excepto por algunas graciosas restricciones en los
nombres de archivo, permisos, y esas cosas). Las particiones comprimidas
de MS-DOS 6 no son accesibles en este momento, y no se espera que lo sean
en el futuro. El soporte para VFAT (WNT, Windows 95) ha sido a&ntilde;adido al
n&uacute;cleo de desarrollo y estar&aacute; en la pr&oacute;xima versi&oacute;n estable.</LI>
<LI> un sistema de archivos especial llamado UMSDOS que permite que Linux 
sea instalado en un sistema de archivos DOS.</LI>
<LI> soporte en s&oacute;lo lectura de HPFS-2 del OS/2 2.1</LI>
<LI> sistema de archivos de CD-ROM que lee todos los formatos est&aacute;ndar de
CD-ROM.</LI>
<LI> TCP/IP, incluyendo ftp, telnet, NFS, etc.</LI>
<LI> Appletalk disponible en el actual n&uacute;cleo de desarrollo.</LI>
<LI> software cliente y servidor Netware disponible en los n&uacute;cleos de
desarrollo.</LI>
</UL>
</P>


<HR>
<A HREF="InfoSheet-Como-1.html">Anterior</A>
<A HREF="InfoSheet-Como-3.html">Siguiente</A>
<A HREF="InfoSheet-Como.html#toc2">Indice</A>
</BODY>
</HTML>
