<HTML>
<HEAD>
<TITLE>Linux Information Sheet: Noticias sobre Linux</TITLE>
</HEAD>
<BODY>
<A HREF="InfoSheet-Como-8.html">Anterior</A>
<A HREF="InfoSheet-Como-10.html">Siguiente</A>
<A HREF="InfoSheet-Como.html#toc9">Indice</A>
<HR>
<H2><A NAME="s9">9. Noticias sobre Linux</A></H2>

<P> Una revista mensual, llamada <EM>Linux Journal</EM>, apareci&oacute; hace m&aacute;s de un
a&ntilde;o. Incluye art&iacute;culos destinados a casi cualquier nivel y pretende ser de
ayuda a todos los usuarios de Linux. La subscripci&oacute;n por un a&ntilde;o cuesta
$22 en U.S., $27 en Canada y M&eacute;jico, y $32 en cualquier
otro pa&iacute;s, pagables en moneda USA. Las solicitudes de subscripci&oacute;n pueden ser
enviadas por email a subs@ssc.com, por fax a +1-206-782-7191, por tel&eacute;fono a
+1-206-782-7733 o por correo a Linux Journal, PO Box 85867, Seattle, WA
98145-1867 USA. SSC tiene una clave PGP p&uacute;blica disponible para encriptar tu
correo y proteger el n&uacute;mero de tu tarjeta de cr&eacute;dito; haz finger a
info@ssc.com para obtener la clave.</P>
<P>Hay diversos grupos de noticias (newsgroups) de Usenet para discusi&oacute;n sobre
Linux adem&aacute;s de diversas listas de correo. Ver la Linux FAQ para m&aacute;s
informaci&oacute;n sobre las listas de correo (deber&iacute;as poder encontrar la FAQ o en
el grupo de noticias o los FTP sites).</P>
<P>El grupo de noticias comp.os.linux.announce es un grupo de noticias moderado
para anuncios sobre Linux (nuevos programas, correcci&oacute;n de errores, etc).</P>
<P>El grupo de noticias comp.os.linux.answers es un grupo de noticias moderado
al que se env&iacute;an la Linux FAQ, los HOWTO's y otros documentos.</P>
<P>El grupo de noticias comp.os.linux.admin es un grupo de noticias no moderado
para la discusi&oacute;n sobre la administraci&oacute;n de un sistema Linux.</P>
<P>El grupo de noticias comp.os.linux.development.system es un grupo de
noticias no moderado dedicado espec&iacute;ficamente a la discusi&oacute;n sobre el
desarrollo del <B>n&uacute;cleo</B> de Linux. Las &uacute;nicas cuestiones sobre desarrollo
de aplicaciones que deben ser discutidas aqu&iacute; son aquellas que est&aacute;n
&iacute;ntimamente ligadas al n&uacute;cleo. Todas las dem&aacute;s cuestiones de desarrollo son
probablemente gen&eacute;ricas de Unix y deben ser dirigidas un grupo de comp.unix,
a menos que sean preguntas muy ligadas a Linux, en cuyo caso deben ser
enviadas a comp.os.linux.apps.</P>
<P>El grupo de noticias comp.os.linux.development.apps es un grupo de noticias
no moderado destinado a la discusi&oacute;n sobre el desarrollo de aplicaciones en
relaci&oacute;n con Linux. No est&aacute; para discutir sobre el lugar en el que se puede
conseguir una aplicaci&oacute;n para Linux, ni para discusi&oacute;n entre aquellos que
quieren aplicaciones para Linux.</P>
<P>El grupo de noticias comp.os.linux.hardware es para preguntas de hardware
espec&iacute;ficas de Linux.</P>
<P>El grupo de noticias comp.os.linux.networking es para preguntas espec&iacute;ficas
de Linux sobre desarrollo de redes y su puesta a punto.</P>
<P>El grupo de noticias comp.os.linux.x es para cuestiones sobre X-Windows
relativas a Linux.</P>
<P>El grupo de noticias comp.os.linux.misc es el sustituto del original
comp.os.linux y sirve para cualquier discusi&oacute;n que no est&eacute; cubierta en las
tem&aacute;ticas de los anteriores grupos.</P>
<P>Por norma, <B>no</B> reenv&iacute;es entre los grupos de noticias de Linux. El
<B>&uacute;nico</B> reenv&iacute;o que es aceptable es un env&iacute;o ocasional de un grupo no
moderado a comp.os.linux.announce. La raz&oacute;n para dividir comp.os.linux en
varios grupos es reducir el tr&aacute;fico en cada uno. Aquellos que no sigan esta
regla ser&aacute;n fulminados sin piedad...</P>
<P>Linux est&aacute; en el Web (World Wide Web, WWW, W3, etc). La direcci&oacute;n URL es 
http://sunsite.unc.edu/mdw/linux.html</P>


<HR>
<A HREF="InfoSheet-Como-8.html">Anterior</A>
<A HREF="InfoSheet-Como-10.html">Siguiente</A>
<A HREF="InfoSheet-Como.html#toc9">Indice</A>
</BODY>
</HTML>
