<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.5b1 [en] (WinNT; I) [Netscape]">
   <TITLE>Apartad6</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#0000EE" VLINK="#551A8B" ALINK="#FF0000">

<DL>
<H2>
<A NAME="6.0.0.- Internet/Infovia: [i] Estructura de"></A><B><A HREF="#6.0.0.- Internet/Infovia: Estructura de">6.0.0.-
Internet/Infovia: [i] Estructura de comunicaciones</A></B></H2>
<B>(Nota: </B>los marcados con<B> *** </B>est&aacute;n en obras<B>)</B>
<DT>
<B><A HREF="#6.0.-">6.0.- Qu&eacute; es Internet??</A></B></DT>

<UL>6.0.1.- Historia ***
<BR>6.0.2.- IP ***
<BR>6.0.3.- TCP/IP ***
<BR>6.0.4.- Protocolos FTP, SMTP, NNTP, etc.. ***
<BR><A HREF="#6.0.5.- RFC (Request For Comments)">6.0.5.- RFC (Request
For Comments)</A><IMG SRC="nuevo.gif" HEIGHT=10 WIDTH=64>
<BR>6.0.6.- Direccionamiento IP ***
<BR>6.0.7.- IPv6. RSVP. ***</UL>

<DT>
<B><A HREF="#6.1.-">6.1.- Qu&eacute; es Infov&iacute;a?</A></B></DT>

<UL><A HREF="#6.1.1.- El 055">6.1.1.- El 055</A>
<BR><A HREF="#6.1.2.- Los Centros de Servicio Infovía (CSIV)">6.1.2.- Los
Centros de Servicio Infov&iacute;a (CSIV)</A>
<BR><A HREF="#6.1.3.- Los carriers">6.1.3.- Los carriers</A>
<BR><A HREF="#6.1.4.- Los proveedores">6.1.4.- Los proveedores</A></UL>

<DT>
<B><A HREF="#6.2.- Acceso desde un usuario final hacia un">6.2.- Acceso
desde un usuario final hacia un proveedor.</A></B></DT>

<DL><A HREF="#6.2.1.- Modem.">6.2.1.- Modem.</A>
<BR><A HREF="#6.2.2.- Vía Infovía.">6.2.2.- V&iacute;a Infov&iacute;a.</A>
<BR><A HREF="#6.2.3.- Otros.">6.2.3.- Otros.</A></DL>

<DT>
<B><A HREF="#6.3.- Salida hacia Internet de los proveedores">6.3.- Salida
hacia Internet de los proveedores</A></B></DT>

<DL><A HREF="#6.3.1.- Lineas punto a punto.">6.3.1.- Lineas punto a punto.</A>
<BR><A HREF="#6.3.2.- Frame Relay.">6.3.2.- Frame Relay.</A>
<BR><A HREF="#6.3.4.- Satelites.">6.3.4.- Satelites.</A>
<BR>6.3.5.- Otros ****</DL>

<DT>
<B><A HREF="#6.4.- Que son Frame-Relay, CIR, Clase de servicio,">6.4.-
Que son Frame-Relay, CIR, Clase de servicio, etc..</A></B></DT>

<DL><A HREF="#6.4.1.- Frame Relay.">6.4.1.- Frame Relay.</A>
<BR><A HREF="#6.4.2.- CIR.">6.4.2.- CIR.</A>
<BR><A HREF="#6.4.3.- Clase de Caudal infovía.">6.4.3.- Clase de Caudal
infovia.</A></DL>

<DT>
<B><A HREF="#6.5.- Otras cuestiones">6.5.- Otras cuestiones</A></B></DT>

<DL><A HREF="#6.5.1.-">6.5.1.- ATM a 34 Mbps???</A>
<BR>6.5.2.- Infov&iacute;a a 56 Kbps??? ****
<BR>6.5.3.- Infov&iacute;a a 128 Kbps??? ****</DL>
</DL>

<HR WIDTH="100%">
<H1>
<A NAME="6.0.0.- Internet/Infovia: Estructura de"></A><B>6.0.0.- Internet/Infovia:
Estructura de comunicaciones</B></H1>

<HR WIDTH="100%">
<H2>
<A NAME="6.0.-"></A>6.0.- Qu&eacute; es Internet?</H2>
Existe infinidad de literatura sobre qu&eacute; es y la historia de Internet,
as&iacute;, con mayusculas. No vamos a repetirla aqu&iacute;, simplemente
un par de detalles. Internet, cuando hablamos de _I_nternet, nos estamos
refiriendo a una gran (seguramente la mayor) red de ordenadores, mejor
dicho red de redes de ordenadores. Estas redes, pueden ser la de tu universidad,
la de tu proveedor, la de tu empresa, etc.. Estas redes pueden (y lo son)
muy diferentes, tanto en n&uacute;mero y tipo de m&aacute;quinas conectadas
como de sistemas operativos soportados. Sin embargo, todas comparten algo,
que es el protocolo IP.
<P>El TCP, es el que se ocupa de dar una conexi&oacute;n 'limpia', encargandose
de corregir errores, ordenar los datos, etc. Es el equivalente a un protocolo
de Nivel 4 en la capa OSI.
<P>Utilizando TCP, todas las aplicaciones internet t&iacute;picas: FTP,
E-mail, web, etc.. Todas esas aplicaciones utilizan protocolos bien definidos,
FTP para transferencia de ficheros, SMTP/POP para correo, NNTP para news,
HTTP para web..
<P>Todas las m&aacute;quinas que est&aacute;n conectadas a Internet han
de tener un identificativo (como si fuera un n&uacute;mero de tel&eacute;fono)
que permita llegar a ellas. Es la direcci&oacute;n IP. Actualmente son
4 octetos de la forma a.b.c.d. Esta direcci&oacute;n (en principio) es
&uacute;nica para cada m&aacute;quina. Normalmente los proveedores de acceso
Internet disponen de un rango de direcciones, que van asignando a sus usuarios
de forma din&aacute;mica, de manera que hoy puedes tener una direcci&oacute;n
IP y ma&ntilde;ana otra distinta.
<H3>
<A NAME="6.0.5.- RFC (Request For Comments)"></A>6.0.5.- RFC (Request For
Comments)<IMG SRC="nuevo.gif" HEIGHT=10 WIDTH=64></H3>
RFC viene de Request For Comments y son una serie de notas y comentarios,
iniciados en 1969, acerca de Internet (originariamente Arpanet). En estos
documentos se habla sobre aspectos de computaci&oacute;n y comunicaci&oacute;n
entre ordenadores con especial atenci&oacute;n en los protocolos de red,
procedimientos, programas y definiciones, aunque tambi&eacute;n incluyen
partes de conversaciones, opiniones, y en ocasiones, algo de humor (extracto
de "what-is-rfc-editor").
<P>En cuanto a la distribuci&oacute;n de estos documentos, no s&oacute;lo
son de libre distribuci&oacute;n, sino que &eacute;sta puede ser casi en
cualquier forma, incluso cortando la parte que interese, haciendo traducciones,
... aunque se recomienda citar al autor (m&aacute;s informaci&oacute;n
en "rfc-copyright-story").
<P>Para buscar informaci&oacute;n sobre un tema en concreto, se utiliza
el documento de texto "rfc-index.txt", en el que aparece un listado de
todas las rfc's con una breve pero clara explicaci&oacute;n sobre el tema
tratado en cada fichero.
<P>Una rfc muy interesante es la 2200 ("rfc220.txt") que habla acerca de
los protocolos est&aacute;ndar oficiales de Internet. En ella se incluye
tambi&eacute;n una referencia en cada protocolo a la rfc en la que se puede
ampliar la documentaci&oacute;n sobre el mismo (por ejemplo, el TCP es
la 793, el Telnet la 854 y 855, el Ftp la 959, el POP3 la 1939, ..)
<P>En el documento "rfc-retrieval.txt" se explica c&oacute;mo y d&oacute;nde
coger las rfc's v&iacute;a e-mail o a trav&eacute;s del Ftp. Aunque no
lo dice en este documento, en Espa&ntilde;a las RFC se pueden obtener del
Ftp de Rediris <A HREF="ftp://ftp.rediris.es">ftp.rediris.es</A>
<BR>&nbsp;
<H2>
<A NAME="6.1.-"></A>6.1.- Qu&eacute; es Infov&iacute;a?</H2>
La describiremos m&aacute;s adelante un poco m&aacute;s en profundidad,
aqu&iacute; s&oacute;lo unas pinceladas.
<P>Infov&iacute;a es una red de acceso a proveedores de servicios. En realidad
no es red, sino que est&aacute; compuesta por una serie de nodos que recogen
las lamadas v&iacute;a Red Telef&oacute;nica B&aacute;sica (RTB) o Red
Digital de Servicios Integrados (RDSI), y permiten encaminarlas hacia los
proveedores de servicios. Estos servicios pueden ser informaci&oacute;n,
puede ser acceso a Internet, puede ser una intranet corporativa, etc...
<P>Est&aacute; basada en protocolos TCP/IP, y sus direcciones IP son del
rango reservado para redes privadas, por eso no se puede conectar desde
infov&iacute;a hacia internet y viceversa, de forma directa. Puede accerse
algo similar, pero siempre se mantienen los dos mundos.
<P>La gran ventaja de Infov&iacute;a es que desde cualquier punto de Espa&ntilde;a,
con una llamada a un &uacute;nico n&uacute;mero (055), y con la misma tarifa
(metropolitana) puedo acceder a los proveedores, eliminando la necesidad
de llamadas de larga distancia (interprovinciales) para algunos usuarios,
con el consiguiente ahorro.
<H3>
<A NAME="6.1.1.- El 055"></A>6.1.1.- El 055</H3>
Las llamadas a Infov&iacute;a marcando el 055 son encaminadas por las centrales
locales hacia las Agencias de Inteligencia de Red (AIR) de la Red Inteligente
de Telef&oacute;nica de Espa&ntilde;a (TESA). En estas centrales se recogen
estas llamadas, y son re-encaminadas utilizando accesos primarios RDSI
hacia los Centros de SErvicio Infov&iexcl;a (CSIV). Actualemtne (30/6/97)
existen 5 CSIV en funcionamiento, Madird, Barcelona, Sevilla, Valencia
y Bilbao, con una capacidad de algo m s de 15000 llamadas simultaneas.
<P>El hecho de pasar las llamadas por la Red Inteligente permite aplicar
la misma tarifa (metroplitana) independientemetne del lugar donde se origine
la llamada, e independientemetne del destino, ya que en funci&oacute;n
de la carga, ocupaci&oacute;n, etc. de los enlaces con los CSIV se encaminar&nbsp;
a uno u otro.
<H3>
<A NAME="6.1.2.- Los Centros de Servicio Infovía (CSIV)"></A><B>6.1.2.-
Los Centros de Servicio Infov&iacute;a (CSIV)</B></H3>
Los CSIV es donde se recogen las llamadas y se 'descuelgan'. Existen unos
servidores de acceso remoto, (hasta la fecha, routers ASCEND MAX 4000)
que tienen cada uno conexiones via accesos primarios RDSI (30 canales de
64 Kbps) con la RI. Si la RI les encamina una llamada RDSI, la aceptan
directametne. Si es una llamada de modem RTB, la aceptan en unos modems
internos, actualmente de 33.600 bps.
<P>Estos routers est n conectados en un segmento de una red Ethernet conmutada,
&uml;con un switch ATM?. A esta red &uml;o al switch aTM? es donde se conectan
los routers de los carriers, como Telef&oacute;nica Transmisi&oacute;n
de datos (TTD), Global One, BT, etc..
<H3>
<A NAME="6.1.3.- Los carriers"></A><B>6.1.3.- Los carriers</B></H3>
Los carriers (TTD, BT, Global One, France Telecom, Telemedia, IBM, etc..)
est n conectados a los CSIV por medio de los routers antes mencionados,
y mediante l&iexcl;neas &uml;frame relay? &uml;punto a punto? a su propia
red de transmisi&oacute;n de datos (Red UNO en el caso de TTD).
<P>Evidentemente, un carrier ha de tener uni&oacute;n con los 5 CSIV actuales,
y con todos los que se instalen en un futuro, si quiere dar cobertura nacional
para sus clientes.
<P>Para evitar pasar a sus clientes (que son los proveedores) el hecho
de tener 5 (o las que sean) coenxiones, una con cada CSIV, e independizar
la conexi&oacute;n del proveedor del n&uacute;mero de CSIV activos en cada
momento, el carrier normalmente busca una soluci&oacute;n.
<P>*TTD ha montado una red IP interna, con la que se unen los proveedores.
De esta red IP salen las 'n' conexiones con los 'n' CSIV.
<H3>
<A NAME="6.1.4.- Los proveedores"></A><B>6.1.4.- Los proveedores</B></H3>
Los proveedores (a quien tu pagas tu cuota mensual) est&aacute;n conectados
a la red de transmisi&oacute;n de datos del carrier, de esta manera pueden
tener conexi&oacute;n con Infov&iacute;a.
<P>Normalmente esta conexi&oacute;n es v&iacute;a Frame Relay (se explicar&nbsp;
despues), lo que permite definir y compartir en una &uacute;nica linea
conexi&oacute;n con Internet, con Infov&iacute;a, o con cualesquiera otro
servicio. Independientemente de esta uni&oacute;n con infov&iacute;a, pueden
tener m&aacute;s lineas (incluso por sat&eacute;lite) con Internet, p.e.
<H2>
<A NAME="6.2.- Acceso desde un usuario final hacia un"></A><B>6.2.- Acceso
desde un usuario final hacia un proveedor</B></H2>
Un usuario final, para conectarse con su proveedor (centros proveedores
de informacion (CPI), centros servidores de informaci&oacute;n (CSI), proveedores
de servicios internet (en ingl&eacute;s ISP), etc.) lo puede hacer de las
siguientes maneras.
<H3>
<A NAME="6.2.1.- Modem."></A><B>6.2.1.- Modem.</B></H3>
El proveedor dispone de una bateria o pool de modems, conectados a la Red
Telefonica Basica (RTB). Tambien puede disponer de terminales de Red Digital
de Servicios Integrados (RDSI), permitiendo el acceso a mayor velocidad.
Este modo de acceso permite una conexion directa entre el usuario y el
proveedor, eliminando por tanto pasos intermedios que pueden afectar a
la comunicaci&oacute;n. Y tiene la desventaja de un numero de conexiones
limitadas por el numero de modems/lineas instalados, ademas de tener que
realizar el usuario una llamada que puede ser metropolitana, provincial
e incluso nacional, dependiendo de la distancia.
<H3>
<A NAME="6.2.2.- Vía Infovía."></A><B>6.2.2.- V&iacute;a Infov&iacute;a.</B></H3>
El proveedor ha contradado con un carrier (TTD, BT, Global One....) un
acceso dedicado, tipicamente Frame Relay (FR), que le une con los centros
de servicio Infov&iacute;a (CSIV), o con la soluci&oacute;n que el carrier
haya implantado (tipicamente una Red IP).
<P>En este acceso frame relay se define un Canal Virtual Permanente (CVP)
bien con cada uno de los CSIV, bien con la red IP. A este CVP se le asocia
un CIR (se explica despues en el apartado de FR), enfunci&oacute;n del
n&uacute;mero de usuarios esperado, del tipo de tr&aacute;fico, de las
pelas que se quiera gastar el proveedor, etc..
<P>Por esta conexion le llegan al proveedor las llamadas de los usuarios,
como conexiones TCP/IP. La ventaja de este modo de acceso es que el numero
de conexiones no esta limitado en principio, salvo por la capacidad de
los CSIV, y que el usuario llamante solo paga una llamada metropolitana
(al 055).
<H3>
<A NAME="6.2.3.- Otros."></A><B>6.2.3.- Otros.</B></H3>
Esto ya no ser&iacute;an usuarios finales 'de la calle', sino m&aacute;s
bien empresas.
<P>Una empresa, por volumen, por seguridad, comodidad, etc, puede querer
una conexi&oacute;n con un proveedor que ni sea directa a traves de modem
o RDSI ni sea a trav&eacute;s de infov&iacute;a. En ese caso, suelen contratar
conexiones directas entre ellos y el proveedor, bien mediante l&iexcl;neas
punto a punto de la velocidad que sea, bien a trav&eacute;s de un acceso
frame relay en su domicilio conectado mediante un CVP al FR del proveedor.
De esta manera tienen conexi&oacute;n 24 horas, generalmente con tarifa
plana, o tienen conexiones de alta velocidad y seguridad con su proveedor,
que es quien se ocupa de todo el tema de las comunicaciones. Un ejemplo
de esto &uacute;ltimo puede ser un periodico, que elabora todas las noticias
dia a dia, y se las vuelca a su proveedor v&iacute;a un enlace punto a
punto, ya que no quiere 'pringarse' con los temas de comunicaciones.
<H2>
<A NAME="6.3.- Salida hacia Internet de los proveedores"></A><B>6.3.- Salida
hacia Internet de los proveedores</B></H2>
Si el proveedor es un CSI o un ISP, ha de tener conexi&oacute;n con Internet.
Esta conexi&oacute;n puede ser:
<H3>
<A NAME="6.3.1.- Lineas punto a punto."></A><B>6.3.1.- Lineas punto a punto.</B></H3>
El proveedor dispone de una conexi&oacute;n dedicada punto a punto con
un backbone de Internet. No suele ser asi ya que el coste de esta conexi&oacute;n
es muy elevado. Este tipo de lineas lo suelen tener carriers o grandes
empresas, o empresas multinacionales.
<H3>
<A NAME="6.3.2.- Frame Relay."></A><B>6.3.2.- Frame Relay.</B></H3>
El proveedor ha contratado con un carrier (TTD, BT, Global One,...) un
acceso FR que va desde su domicilio hasta el backbone de dicho carrier,
que a su vez dispone de lineas directas (punto a punto) con backbones de
Internet. Sobre este acceso FR se define un (o varios) CVP con los nodos
del carrier, y a ese CVP se asocia un CIR, que puede ser distinto para
cada sentido de transmisi&oacute;n.
<H3>
<A NAME="6.3.4.- Satelites."></A><B>6.3.4.- Satelites.</B></H3>
Ultimamente se est&aacute;n viendo proveedores que se anuncian con enlaces
via sat&eacute;lite. No es m&aacute;s que un caso especial de lineas punto
a punto, s&oacute;lo que en este caso el medio f&iacute;sico de uni&oacute;n
entre el proveedor/carrier y el backbone correspondietne es un enlace via
sat&eacute;lite, de mayor o menor velocidad.
<H3>
<A NAME="6.3.5.- Otros ****"></A><B>6.3.5.- Otros ****</B></H3>

<H2>
<A NAME="6.4.- Que son Frame-Relay, CIR, Clase de servicio,"></A><B>6.4.-
Que son Frame-Relay, CIR, Clase de servicio, etc..</B></H2>
Accesos Frame Relay (FR), Commited Information Rate (CIR), Clase de servicio...
son conceptos asociados (en este entorno!) tipicamente al medio de uni&oacute;n
entre un proveedor y su carrier.
<H3>
<A NAME="6.4.1.- Frame Relay."></A><B>6.4.1.- Frame Relay.</B></H3>
Frame Relay es un protocolo l&oacute;gico (un lenguaje, vaya) de acceso
a una red de transmisi&oacute;n de datos, siguiendo normas y recomendaciones
internacionales (ITU-T (la antigua CCITT), FR Vendor Forum, ANSI, ..).
De esta manera, al acceder a una red de datos, puedo 'llegar' hasta donde
llegue esa red de datos. Otros protocolos que podrian ser X.25, PPP, HDLC,
SMDS, etc...
<P>Por extension, se denomina acceso FR tambien a la linea digital que
une al proveedor con el carrier, es decir, la l&iexcl;nea desde el domicilio
del proveedor hasta el nodo m s cercano del carrier. Estas lineas pueden
ser desde 64, 128, 256, 512 Kbps y 2 Mbps (caso especial es el de un circuito
de 34 Mbps). Algunos carriers ofrecen tambien l&iexcl;neas de 192, 384
y 1024 Kbps, pero no es muy usual.
<P>En las lineas digitales antiguas, la tasa de error era elevada. Por
eso se dise&ntilde;aron protocolos que detectaran el error y pidieran el
reenvio de los datos perdidos, o que frenaran al emisor si el receptor
no estaba disponible (p.e. de todos conocido es Zmodem). El protocolo t&iacute;pico
del que se habla en este entorno es X.25, que permite correci&oacute;n
de errores, control de flujo ('espera un momento, no transmitas que no
estoy listo'), etc.. A cambio, incrementa la sobrecarga (overhead) sobre
los datos, de forma que p.e. de cada 100 datos transmitidos 20 corresponder&iacute;an
al X.25 y s&oacute;lo 80 a datos reales. Eso reduce el ancho de banda real
de una l&iacute;nea.
<P>Con el paso del tiempo, se han ido utilizando e imponiendo protocolos
como TCP/IP, que ya ellos mismos realizan tambien su propio control de
errores, pidiendo las tramas perdidas, etc. Por eso, utilizar TCP/IP sobre
una conexi&oacute;n X.25 es redundante e ineficiente.
<P>Sin embargo Frame Relay est&nbsp; pensado para lineas digitales con
baja tasa de error, (las nuevas tecnolog&iacute;as permiten mayores velocidades
con menores tasas de error) ya que no realizan ese control de flujo, ni
control de errores. Simplemente deja que niveles superiores, en este caso
el software, el stack de protocolos TCP/IP, sea quien se ocupe del error.
Esto permite 'aligerar' el protocolo, y reducir el overhead, aumentando
el rendimiento efectivo de la linea.
<P>En realidad FR si hace un peque&ntilde;o control de errores. En caso
de producirse un error en la trama FR (que se detecta con un fallo en el
CRC, pe.), se descarta. El control de flujo es minimo, existiendo dos niveles:
en el primero la red avisa al terminal que baje su velocidad de transmisi&oacute;n,
ya que empieza a haber congesti&oacute;n, y en el segundo la red descarta
-tira- las tramas del usuario que no puede transmitir.
<P>Para que dos usuarios (p.e. el carrier y el proveedor) se puedan comunicar,
FR prevee dos posibilidades, basadas en Canales Virtuales. Un CV es un
'camino l&oacute;gico' entre dos extremos de una conexi&oacute;n, de manera
que cada trama queda identificada con un n&uacute;mero de CV. Si en la
cabecera de la trama va el 100, es que esa trama 'va' por el CV n&uacute;mero
100, que puede tener como destino p.e. el CSIV de Barcelona. Si la trama
lleva el 101, es otro CV, que puede ser p.e. el CSIV de Madrid. Y si lleva
el 158, pues puede ser una comunicaci&oacute;n hacia el backbone de internet.
<P>Los CV pueden ser Permanentes (CVP, o PVC en ingl&eacute;s) o Conmutados
(CVC, o SVC en ingl&eacute;s). El CVP es un canal que se fija en tablas
al instalar la linea, y que siempre es el mismo, y que siempre une el mismo
extremo con el mismo destino. Un CVC es un canal que permite 'llamar' a
distintos extremos, l&oacute;gicamente con un proceso previo de llamada.
Por ejemplo imaginaros un 'telefono rojo' y telefono normal. El 'rojo'
una vez que lo levantas va a pi&ntilde;&oacute;n fijo a un sitio determinado,
y la comunicaci&oacute;n no es necesario establecerla. Un telefono normal,
para llamar has de marcar el destino. Pues el rojo ser&iexcl;a el CVP y
el normal el CVC.
<P>Actualmente, la mayor parte de proveedores cuyo medio de uni&oacute;n
con su carrier es FR utilizan CVP's, (en el caso de TTD se espera que la
Red UNO soporte CVC en breve), con uno, dos, tres, etc., CVP con los CSIV,
o bien uno s&oacute;lo con la red IP del carrier, y un CVP con la salida
a internet del carrier.
<H3>
<A NAME="6.4.2.- CIR."></A><B>6.4.2.- CIR.</B></H3>
CIR es el acronimo ingl&eacute;s de Commited Information Rate, (en espa&ntilde;ol
clase de caudal de trafico -CCT-). Representa la velocidad minima garantizada
por la red al usuario de capacidad de transferencia de informaci&oacute;n,
esto es, el flujo minimo que la red garantiza al usuario que puede transmitir
y llegar&nbsp; al otro extremo, sin problemas de control de flujo ('espera
no transmitas que no estoy preparado').
<P>Este flujo o cantidad minima se puede definir de forma independiente
para cada CVP y para cada sentido de transmisi&oacute;n (transmisi&oacute;n
y recepci&oacute;n). Por ejemplo puedo ser un servidor de FTP, con lo que
me interesa que la cantidad de informaci&oacute;n que salga de mi sea m&aacute;s
alta que la que yo recibo, en ese caso contrato mayor CIR saliente de mi
que entrante a mi.
<P>El CIR es el m&iacute;nimo garantizado, que se deber&iacute;a contratar
en funci&oacute;n del n&uacute;mero de usuarios, tipo de servicio ofrecido,
etc, para que aun habiendo congesti&oacute;n en la red, el servicio que
doy est&aacute; dentro de una calidad dada. Por encima del CIR se define
el EIR -Excess Information Rate-. Este es el m ximo que la red va a aceptar
que yo transmita, sin embargo este tr&aacute;fico no est&aacute; garantizado
y puede ser que no llegue al extremo si la red est&aacute; congestionada
en alg&uacute;n punto. Y si transmito por encima de ese EIR la red se autoprotege
descartando ese tr fico en exceso, con el mecanismo de dos niveles de control
de flujo explicado antes.
<P>Y por supuesto, el limite &uacute;ltimo de transmisi&oacute;n es la
velocidad de la linea. Ya puedo tener un CIR de 256 Kbps que si la linea
_f&iacute;sica_ es de 64 Kbps, 64 Kbps es el l&iacute;mite. Claro que quien
tenga un CIR de 256 Kbps en una linea de 64... :-))
<P>O sea, puedo tener una linea de 128 Kbps, un CIR de 32 Kbps y un EIR
de 32 Kbps. Si transmito a 10, no pasa nada. Si transmito a 32, tampoco.
Si transmito a 33, la red marca ese tr&aacute;fico como 'posible descartable',
pero lo saca en la medida que pueda. Si transmito a 40, igual. Si transmito
a 64, igual. Si transmito a 65 Kbps (perfectametne posible porque la linea
del ejemplo es de 128 Kbps), por ejemplo 65 tramas de 1 K en un segundo,
un total de 32 tramas pasar&aacute;n, 32 tramas llevar&aacute;n una marca,
y tirar&aacute; una trama.
<P>*TTD Al principio no existia limitaci&oacute;n del EIR (o estaba limitado
a 256 Kbps), de manera que en el ejemplo anterior podr&iexcl;a haber transmitido
hasta a 128 Kbps. Esto era usado por varios proveedores 'por la cara',
que contrataban l&iacute;neas de 2 Mbps con un CIR de 8 Kbps. De esta manera,
y por estar Red UNO sobredimensionada, daban buen servicio, en agravio
comparativo con aquellos proveedores que s&iacute; ten&iacute;an un CIR
'razonable'. Como el CIR representa enlaces y nodos de red, que cuestan
mucha $, se ha limitado el EIR acorde al CIR contratado.
<P>En un acceso Frame Relay se pueden definir varios CVP, con diferentes
destinos, y cada uno de ellos tener diferente CIR. La suma de CIR totales
de los CVP, para transmisi&oacute;n y para recepci&oacute;n por separado,
puede exceder de la velocidad real de la linea -sobrecontrataci&oacute;n-
si se supone que no ha haber simultaneidad en el trafico, o que este va
a ser claramente asimetrico. En este entorno no tiene aplicaci&oacute;n,
pero imaginaros una empresa con 6 delegaciones. Puedo perfectamente contratar
lineas de 64 Kbps en cada una, y 64 en la central, con 16 Kbps de CIR encada
delegaci&oacute;n. La suma de CIR es 92 Kbps, que es mayor que la velocidad
de linea de la central, 64 Kbps, sin embargo puedo hacerlo y definirlo
as&iacute;, siempre y cuando la simultaneidad entre delegaciones no sea
mayor de 4.
<H3>
<A NAME="6.4.3.- Clase de Caudal infovía."></A><B>6.4.3.- Clase de Caudal
infov&iacute;a.</B></H3>
Esto en principio es aplicable a TTD. otros carriers pueden tener otros
conceptos.
<P>La clase de caudal infov&iacute;a esta directamente asociada al Servicio
Infov&iacute;a de Telef&oacute;nica. Actualmente esta definida como el
CIR (tanto de entrada como de salida, definido de forma sim&eacute;trica)
asociado al CVP de uni&oacute;n del proveedor con la Red IP de TTD. Esta
Red IP es quien tiene despues las uniones con los CSIV que haya en cada
momento.
<H2>
<A NAME="6.5.- Otras cuestiones"></A><B>6.5.- Otras cuestiones</B></H2>

<H3>
<A NAME="6.5.1.-"></A><B>6.5.1.- ATM a 34 Mbps???</B></H3>
Este es un caso especial, y lo que sigue se aplica a TTD como carrier.
<P>Cuando un proveedor no tiene sufiente con l&iexcl;neas de 2 Mbps, 4
o 5 l&iacute;neas de 2 Mbps, es m&aacute;s rentable e interesante colocar
un nodo de red directamente en su domicilio. Este nodo de red es un nodo
'passport', de tecnologia northern telecom (nortel), que es con los que
est&aacute; constituida Red UNO. Este nodo se une a la red por un enlace
a 34 Mbps, bien sea directo por un enlace punto a punto, bien utilizando
el servicio Gigacom (ATM) de Telef&oacute;nica. El nodo en domicilio de
cliente 'habla' con el resto de la red utilizando protocolo ATM. Del nodo
hacia el cliente se siguen sacando 'n' lineas de 2 Mbps con protocolo Frame
relay, s&oacute;lo que ahora s&oacute;lo implica un cable del nodo al router,
simplificando. Tambien ser&iacute;a posible, dotando al nodo passport de
las tarjetas adecuadas, unirlo hacia el router con lineas serie de mayor
velocidad (p.e. 8 Mbps) o &uml;?conectarlo directamente a la red de&nbsp;
rea local&uml;?
<H3>
<A NAME="6.5.2.-"></A>6.5.2.- Infov&iacute;a a 56 Kbps??? ****</H3>

<H3>
<A NAME="6.5.3.-"></A>6.5.3.- Infov&iacute;a a 128 Kbps??? ****</H3>

<DL>
<CENTER>
<DT>

<HR WIDTH="100%"></DT></CENTER>

<LI>
<I>FAQ.ESP.INTERNET Versi&oacute;n 2.0.9</I></LI>

<LI>
<I>Recopilado por Agustin MuNoz 2:346/201.9@fidonet.org</I></LI>

<LI>
<!-- date start --><I>Ultima Actualizaci&oacute;n el Viernes 4 de Septiembre
de 1998.</I><!-- date end --></LI>

<ADDRESS>

<HR WIDTH="100%"></ADDRESS>

<ADDRESS>
<I>Para reproducciones totales o parciales de este FAQ por favor lee atentamente
el Apartado </I><A HREF="Apart1.htm#1.5.0.- Copyright">1.5.0.- Copyright</A></ADDRESS>
</DL>

</BODY>
</HTML>
