<HTML>
<HEAD>
<TITLE>Impresi&oacute;n Como: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Configuracion-Impresion-Como-2.html">Siguiente</A>
<A HREF="Configuracion-Impresion-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>Esta es la versi&oacute;n espa&ntilde;ola del Printing-HOWTO de Linux. &Eacute;ste documento
forma parte de la segunda generaci&oacute;n de linux FAQ
<SL>Nota del
Revisor <BR>O <I>PUF</I>s, <I>Preguntas de Uso Frecuente</I></SL>
 El
<I>Linux-FAQ</I> original devino en una bestia inmanejable, por lo que se
cambi&oacute; el esquema y se fraccion&oacute; en secciones independientes para cada
aspecto del sistema operativo.</P>
<P>Este <I>COMO</I> en particular trata de c&oacute;mo administrar los distintos
aspectos de impresi&oacute;n bajo Linux, configurar impresoras, instalar
aplicaciones para hacerlas funcionar...  Originalmente escrito por Grant
Taylor <CODE>
<A HREF="mailto:gtaylor@cs.tufts.edu">gtaylor@cs.tufts.edu</A></CODE>), posteriormente incorpor&oacute; el
<I>lpd-FAQ</I> de Brian McCauley (<CODE>
<A HREF="mailto:B.A.McCauley@bham.ac.uk">B.A.McCauley@bham.ac.uk</A></CODE>). </P>
<P>Otros <I>COMO</I>s detallan aspectos acerca de la conexi&oacute;n en red.... Aunque
pueden encontrarse estos documentos en los lugares m&aacute;s insospechados, su
"domicilio" oficial es:  </P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/linux/docs/Howto">ftp://sunsite.unc.edu/pub/linux/docs/Howto</A></CODE>
<SL>Igualmente,
la mayor&iacute;a de los <I>mirrors</I> de Sunsite contendr&aacute;n las traducciones de los
COMO, en su directorio <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/es">ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/es</A></CODE></SL>
</P>
<P>(busque mejor en los Mirrors.  Sunsite es una playa muy concurrida) Junto
con el resto de los FAQ de usenet, podemos encontrarlos en <CODE>
<A HREF="ftp://rtfm.mit.edu">ftp://rtfm.mit.edu</A></CODE></P>
<P>Env&iacute;en los comentarios, errores detectados y sugerencias a Brian y Grant a
<CODE>
<A HREF="mailto:printing@god.ext.tufts.edu">printing@god.ext.tufts.edu</A></CODE> (versi&oacute;n en ingl&eacute;s) o a Francisco
Escarpa para la traducci&oacute;n espa&ntilde;ola (<CODE>
<A HREF="mailto:escarpa@impronta.es">escarpa@impronta.es</A></CODE> ).</P>
<P>Les rogamos que nos comuniquen cualquier nuevo programa, fichero, ... que
conozcan y no figure en este documento. </P>
<P>Grant ha configurado un servidor de correo centrado en la impresi&oacute;n y
visualizaci&oacute;n bajo Linux, incluyendo la &uacute;ltima versi&oacute;n de este documento
(en ingl&eacute;s). Para acceder, env&iacute;e un mensaje de correo electr&oacute;nico a
<CODE>
<A HREF="mailto:listserv@god.ext.tufts.edu">listserv@god.ext.tufts.edu</A></CODE>, con el cuerpo de
mensaje '<CODE>INFO</CODE>'. Recibir&aacute; como respuesta una lista de los ficheros
disponibles. Si el cuerpo del mensaje es '<CODE>get fich1 [fich2 fich3]</CODE>',
recibir&aacute; una copia de los ficheros pedidos.</P>
<P>Para esta traducci&oacute;n se ha reelaborado ligeramente el documento original,
eliminado repeticiones, reducido los detalles particulares de cada
programa al m&iacute;nimo imprescindible, remitiendo al lector a la documentaci&oacute;n
correspondiente, y a&ntilde;adiendo alguna peque&ntilde;a novedad conocida.
Agradeceremos las sugerencias, notificaci&oacute;n de errores y dem&aacute;s. </P>

<HR>
Anterior
<A HREF="Configuracion-Impresion-Como-2.html">Siguiente</A>
<A HREF="Configuracion-Impresion-Como.html#toc1">Indice</A>
</BODY>
</HTML>
