<HTML>
<HEAD>
<TITLE>Impresi&oacute;n Como: ¿C&Oacute;MO SE IMPRIME ... ?</TITLE>
</HEAD>
<BODY>
<A HREF="Configuracion-Impresion-Como-4.html">Anterior</A>
<A HREF="Configuracion-Impresion-Como-6.html">Siguiente</A>
<A HREF="Configuracion-Impresion-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. ¿C&Oacute;MO SE IMPRIME ... ?</A></H2>


<P>Ya sabemos con qu&eacute; imprimimos bajo Linux. Ahora haremos una visita a los
programas m&aacute;s normales para generar el texto a imprimir usualmente
disponibles. Advierta que la mayor parte de los programas de impresi&oacute;n
bajo otros UNIX pueden ser muy f&aacute;cilmente adaptados a Linux. </P>

<H2><A NAME="ss5.1">5.1 Texto Llano</A></H2>


<P>Bajo Linux, (como cualquier otro U*X), lo m&aacute;s f&aacute;cil es imprimir texto
llano. Cualquier editor est&aacute;ndar de UNIX (<CODE>vi</CODE>, <CODE>emacs</CODE>), o alguno
m&aacute;s sofisticado (<CODE>nedit</CODE>, <CODE>jed</CODE>, .. ) le producir&aacute;n tantas arrobas
de letras como desee.</P>
<P>Adem&aacute;s, la mayor parte de los programas que a continuaci&oacute;n se describen
son capaces de generar documentos en texto llano, con las &oacute;rdenes
adecuadas. </P>

<H3><CODE>pr</CODE></H3>


<P>La mayor&iacute;a de los ficheros de texto llano en U*X tienen tendencia a ser un
mar de caracteres, sin saltos de p&aacute;gina ni nada que permita un documento
m&iacute;nimamente presentable. </P>
<P><CODE>pr</CODE> surgi&oacute; para obviar este inconveniente. Procesando el documento a
trav&eacute;s de <CODE>pr</CODE>, se le a&ntilde;aden cabeceras y/o pies, n&uacute;meros de p&aacute;gina,
m&aacute;rgenes superior e inferior... Como cualquier otra utilidad UNIX, <CODE>pr</CODE>
tiene dos o tres millones de opciones, debidamente rese&ntilde;adas en la p&aacute;gina
del manual. </P>


<H2><A NAME="ss5.2">5.2 PostScript</A></H2>


<P>Si no tiene que imprimir texto llano, es muy probable que tenga que
imprimir PostScript. Si su impresora lo interpreta, sus problemas terminan
aqu&iacute;; si est&aacute; en el caso contrario, situaci&oacute;n normal para casi todos, la
cosa se complica un poco, pues necesitar&aacute; un programa que lea PS y lo
traduzca al lenguaje de su impresora. </P>

<H3>Ghostscript</H3>


<P>El modo normal de interpretar ps bajo Linux es usar ghostscript, que ,
como casi todas la utilidades, procede del proyecto GNU. Herramienta
vers&aacute;til donde las haya, <CODE>gs</CODE> traduce PostScript a formato X Window,
impresoras IBM, Epson, HP, Canon ..., fax, y casi para cualquier
dispositivo que se le ocurra. Los dispositivos soportados en cada versi&oacute;n
de ghostscript est&aacute;n debidamente relacionados en la documentaci&oacute;n del
programa; puede obtenerse una relaci&oacute;n con la orden '<CODE>gs -help</CODE>'. </P>
<P><CODE>gs</CODE> se ha convertido en utilidad est&aacute;ndar en la mayor&iacute;a de las
distribuciones de Linux, que la incluyen completa. Advierta que los
ejecutables binarios pueden necesitar '<CODE>libX.so.???</CODE>' tal como vienen
en el controlador de pantalla X Window.</P>
<P>La distribuci&oacute;n "oficial" en forma de ficheros fuente, que deben ser
compilados en su sistema puede encontrarse en: </P>
<P><CODE>
<A HREF="ftp://prep.ai.mit.edu/pub/gnu/ghostscript-*.tar.gz">ftp://prep.ai.mit.edu/pub/gnu/ghostscript-*.tar.gz</A></CODE></P>
<P><CODE>
<A HREF="ftp://prep.ai.mit.edu/pub/gnu/ghostscript-fonts-*.tar.gz">ftp://prep.ai.mit.edu/pub/gnu/ghostscript-fonts-*.tar.gz</A></CODE> </P>
<P>La instalaci&oacute;n m&iacute;nima de los binarios de <CODE>gs</CODE> y algunos otros programas
necesarios para imprimir la documentaci&oacute;n de Linux est&aacute; disponible en</P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/tex/texmin/texmin-*.tar.z">ftp://sunsite.unc.edu/pub/Linux/apps/tex/texmin/texmin-*.tar.z</A></CODE></P>
<P>Esta distribuci&oacute;n no contiene ning&uacute;n tipo de letra PostScript (ni las
necesitar&aacute; para imprimir ficheros <CODE>.dvi</CODE>). </P>
<P>La documentaci&oacute;n principal de ghostscript se encuentra en el fichero
<CODE>use.doc</CODE>, en el directorio de fuentes, o en
<CODE>/usr/lib/ghostscript/doc/</CODE> si no tiene los fuentes.</P>
<P>Para imprimir ps determine primero el nombre de su dispositivo con la
orden '<CODE>gs -help</CODE>', que lista los dispositivos instalados. Si el suyo
no est&aacute; en la lista, deber&aacute; recompilar <CODE>gs</CODE> (No se asuste, siga las
instrucciones que figuran en <CODE>make.doc</CODE>. Necesitar&aacute; libres 5 o 6 Mb de
espacio en disco). Con la orden: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# gs -dNOPAUSE - sDEVICE=???? -sOutputFile=/dev/???? fichero.ps 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>el documento aparecer&aacute; (eso esperamos) en su impresora sin problemas. Como
podr&aacute; imaginar, a mayor versi&oacute;n, m&aacute;s dispositivos soportados. En la
documentaci&oacute;n incorporada se describe el procedimiento para desarrollar
nuevos dispositivos si fuera necesario. </P>
<P><CODE>gs</CODE> puede imprimir en la mayor&iacute;a de las resoluciones soportadas por su
impresora; '<CODE>-r300</CODE>' '<CODE>-r150</CODE>', '<CODE>-r360x180</CODE>' son ejemplos de las
opciones para su control. Las impresoras matriciales necesitan que se fije
esta opci&oacute;n, al no soportar normalmente la resoluci&oacute;n por defecto de
300x300. </P>


<H2><A NAME="ss5.3">5.3 Mi impresora s&oacute;lo trabaja con PostScript </A></H2>


<P>Si su impresora s&oacute;lo trabaja con PostScript, o quiere ahorrarse andar
configurando el dispositivo cada vez que tiene que cambiar el tipo de
documento a imprimir, hay toda una familia de programas que transforman el
texto llano a PostScript. </P>

<H3><CODE>mpage</CODE></H3>


<P>Transforma texto llano a PostScript y/o imprime m&aacute;s de una p&aacute;gina en cada
hoja de papel a partir de PostScript o texto. Puede encontrarlo en</P>
<P><CODE>
<A HREF="ftp://wuarchive.wustl.edu/pub/mirrors/unix-c/PostScript/mpage-tar-z">ftp://wuarchive.wustl.edu/pub/mirrors/unix-c/PostScript/mpage-tar-z</A></CODE></P>
<P>el sufijo <CODE>-z</CODE> equivale a <CODE>.Z</CODE> (<CODE>compress</CODE>). La orden </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
man -t &lt;orden&gt; | mpage
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>enviar&aacute; una copia de la p&aacute;gina en formato PostScript a <CODE>lpr</CODE>.</P>

<H3><CODE>a2ps, enscript, nenscript</CODE></H3>


<P>A partir de un texto ascii llano, <CODE>a2ps</CODE> produce una p&aacute;gina debidamente
formateada, con cabeceras, pies, n&uacute;meros de p&aacute;gina ... Se encuentra en el
mismo lugar que <CODE>mpage</CODE>.</P>
<P><CODE>enscript</CODE> y <CODE>nenscript</CODE> hacen lo mismo que <CODE>a2ps</CODE>. Puede
encontrar <CODE>nenscript</CODE> en:</P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/Printing/nenscript*">ftp://sunsite.unc.edu/pub/Linux/system/Printing/nenscript*</A></CODE>
<SL>Nota del Traductor: <BR> Ojo; Aqu&iacute; podemos tener problemas con
los caracteres extendidos; por ejemplo: <CODE>a2ps</CODE> (la versi&oacute;n que tengo,
al menos) genera un fichero <CODE>ps</CODE> que no tiene acentos, e&ntilde;es .., al no
definir una tabla tipogr&aacute;fica para ellos. En cambio, <CODE>nenscript</CODE> si lo
hace. </SL>

</P>

<H3><CODE>gslp</CODE></H3>


<P>Incluida en la distribuci&oacute;n de ghostscript, <CODE>gslp</CODE> transforma un
fichero texto a PostScript. &Uacute;selo con la orden:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# gs -q -sDEVICE=???? -dNOPAUSE -- gslp.ps fich.text 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(el programa es <CODE>gslp.ps</CODE>, escrito en PostScript, que, en muchos
aspectos, es un lenguaje de programaci&oacute;n, m&aacute;s que un conjunto de &oacute;rdenes
de impresi&oacute;n). Hay un ejecutable en la distribuci&oacute;n que evita dar estos
rodeos.</P>

<H3>Utilidades para PostScript</H3>


<P>Existen cientos de peque&ntilde;os programas que permiten modificar ficheros ps.
Puede encontrarlos en</P>
<P>
<UL>
<LI><CODE>
<A HREF="ftp://achilles.doc.ic.ac.uk/tex/inter/psutils/">ftp://achilles.doc.ic.ac.uk/tex/inter/psutils/</A></CODE>
</LI>
<LI><CODE>
<A HREF="ftp://ftp.cs.psu.edu/pub/src/psutil.tar.gz">ftp://ftp.cs.psu.edu/pub/src/psutil.tar.gz</A></CODE>
</LI>
<LI><CODE>
<A HREF="ftp://ftp.uu.uunet">ftp://ftp.uu.uunet</A></CODE>
</LI>
<LI><CODE>
<A HREF="ftp://wuarchive.wustl.edu">ftp://wuarchive.wustl.edu</A></CODE></LI>
</UL>
</P>


<H2><A NAME="ss5.4">5.4 <CODE>TeX, LaTeX</CODE></A></H2>


<P>Si hay algo cierto en el mundo de UNIX, especialmente a nivel acad&eacute;mico,
es que antes o despu&eacute;s uno se acaba topando con &Eacute;l. <CODE>TeX</CODE> es un sistema
de formateado de textos
<SL>Nota del revisor: <BR> M&aacute;s bien un
<I>Procesador de Documentos</I></SL>
. Funciona de modo an&aacute;logo a un
compilador: El c&oacute;digo fuente corre a trav&eacute;s del programa tex, y obtenemos
un fichero <CODE>.dvi</CODE>, independiente del dispositivo, que normalmente debe
ser procesado de nuevo para obtener un documento impreso. La alt&iacute;sima
calidad del producto obtenido justifica la complejidad del proceso.</P>
<P>El trabajo con <CODE>TeX</CODE>, no obstante, se ve gratamente suavizado mediante
el uso de procesadores de texto, como <CODE>LyX</CODE>, con el que ha sido
reelaborado este documento.</P>
<P>Remitimos al lector al libro "<I>LaTeX, a document preparation system</I>" 
de Leslie Lamport (ed. <I>Addison Wesley</I>) 2ª edici&oacute;n, que analiza en
detalle la versi&oacute;n m&aacute;s popular de este extraordinario sistema de
tratamiento de textos. </P>

<H3><CODE>dvips</CODE></H3>


<P>Convierte el fichero dvi generado a partir de un documento <CODE>TeX</CODE> en un
fichero PostScript, que puede imprimir a trav&eacute;s de <CODE>gs</CODE>, o directamente
en la m&aacute;quina adecuada. La mayor&iacute;a de las distribuciones de Linux incluyen
este paquete. </P>
<P>La orden </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
dvips -f1 fich.dvi | lpr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>es t&iacute;pica. <CODE>dvips</CODE> responde tanto a los argumentos de la l&iacute;nea de
comandos como al fichero de configuraci&oacute;n "<CODE>config.ps</CODE>", donde puede
organizar las cosas para que la salida vaya directamente a la impresora,
por ejemplo. As&iacute;, bastar&aacute; escribir <CODE>dvips fichero.dvi</CODE> para obtener el
documento final.</P>
<P><CODE>dvips</CODE> tiene unas cuantas opciones interesantes; por ejemplo <CODE>dvips
-r1 fich.dvi</CODE> imprimir&aacute; el documento en orden inverso. Los propietarios de
impresoras HP apreciar&aacute;n esta caracter&iacute;stica. </P>

<H3><CODE>eps, dvilj, dvi500</CODE></H3>


<P>Transforman los ficheros dvi en los lenguajes de impresoras Epson y HP
LaserJet y DeskJet respectivamente. Suelen estar incluidos en la mayor
parte de las distribuciones, y, por supuesto, en
<CODE>
<A HREF="ftp://sunsite.unc.edu">ftp://sunsite.unc.edu</A></CODE></P>


<H2><A NAME="ss5.5">5.5 <CODE>texinfo</CODE></A></H2>


<P>Es el formato nativo del proyecto GNU. <CODE>emacs</CODE> puede ser forzado a
producir un fichero de informaci&oacute;n desde TeXinfo, y TeX producir&aacute; un
excelente resultado a partir de este mismo fichero. Realmente, el
documento est&aacute; en formato TeX, y necesita que el fichero de macros
<CODE>texinfo.tex</CODE> est&eacute; instalado en su sistema. Simplemente ejecute
'<CODE>tex fichero</CODE>' dos veces (con el fin de generar &iacute;ndices), y obtendr&aacute;
un fichero dvi que podr&aacute; imprimir o visualizar a su placer. </P>
<P>Con <CODE>emacs</CODE> puede teclear adem&aacute;s '<CODE>M-x texinfo-format-buffer</CODE>' para
convertir el fichero texinfo en un fichero info legible con emacs '<CODE>M-x
info</CODE>', u otro visor de su elecci&oacute;n.</P>
<P>Hay otros programas que leen y formatean info desde un fichero texinfo.
Est&aacute;n disponibles en <CODE>
<A HREF="ftp://prep.ai.mit.edu/pub/gnu/">ftp://prep.ai.mit.edu/pub/gnu/</A></CODE></P>


<H2><A NAME="ss5.6">5.6 <CODE>*roff</CODE>; p&aacute;ginas man</A></H2>


<P>Si hay un generador de documentos virtualmente universal es <CODE>troff</CODE>, y
sus primos cercanos, debido a que las p&aacute;ginas de manual se escriben para
ellos. Las &oacute;rdenes de formato de documentos ser&aacute;n ¿sorprendentemente?
familiares para los (no se si a&uacute;n queda alguno vivo) forofos de las
versiones m&aacute;s populares de <I>Wordstar</I>. </P>
<P>La orden para imprimir las p&aacute;ginas de manual es </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
man -t &lt;comando&gt; | lpr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><CODE>groff</CODE> traduce la p&aacute;gina a PostScript, que se procesa sin mayores
problemas, como ya sabemos. Obtendremos as&iacute; una p&aacute;gina impresa muy
aparente. Esto, sin embargo, depende mucho del programa '<CODE>man</CODE>' que
viene con su sistema. Si el suyo no lo permite, consiga la versi&oacute;n escrita
en <CODE>perl</CODE>, en:
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/Manual-pagers/">ftp://sunsite.unc.edu/pub/Linux/system/Manual-pagers/</A></CODE>.</P>
<P>Est&aacute; &iacute;ntegramente escrito en <CODE>perl</CODE>, y es por tanto muy personalizable. </P>
<P>Otro camino consiste en encontrar el fichero fuente de <CODE>nroff</CODE> de la
p&aacute;gina en los directorios de <CODE>man</CODE>, e imprimirlo con la orden:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
groff -fichman -Ttipo orden.1 | lpr 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>donde tipo puede ser '<CODE>ascii</CODE>', '<CODE>dvi</CODE>' '<CODE>ps</CODE>' '<CODE>X100</CODE>',
'<CODE>X75</CODE>', '<CODE>latin8</CODE>'</P>


<H2><A NAME="ss5.7">5.7 Adobe Acrobat. Ficheros PDF</A></H2>


<P>Est&aacute;ndar emergente donde los haya, los pap&aacute;s de PostScript han
desarrollado un formato de documentaci&oacute;n que permite (al menos eso venden) 
absoluta independencia del sistema operativo. Un fichero PDF se imprimir&aacute;
igual de bien en un ordenador con MS-Windows, un Mac*, un
CojoSuperOrdenador Cray, o un PC con Linux. </P>
<P>Los documentos PDF se traducen justo a la hora de imprimirlos al formato
que cada sistema operativo requiera; en UNIX, a PostScript. </P>
<P>Puede obtenerse una copia del lector de Adobe en
<CODE>
<A HREF="http://www.adobe.com">http://www.adobe.com</A></CODE>.</P>
<P>Si prefiere algo menos "comercial", <CODE>Xpdf</CODE> ser&aacute; de su agrado. La &uacute;ltima
versi&oacute;n est&aacute; en</P>
<P><CODE>
<A HREF="http://www.contrib.andrew.cmu.edu/usr/dn0o/xpdf/xpdf.html">http://www.contrib.andrew.cmu.edu/usr/dn0o/xpdf/xpdf.html</A></CODE></P>


<H2><A NAME="ss5.8">5.8 Tipos</A></H2>


<P>(Esta secci&oacute;n contiene informaci&oacute;n no espec&iacute;fica a los dispositivos). La
informaci&oacute;n pertinente al dispositivo X11 de <CODE>gs</CODE> (y ghostview) se
incluye en el apartado de visualizaci&oacute;n.</P>
<P>Todas las versiones de <CODE>gs</CODE> vienen provistas de un surtido de tipos de
dominio p&uacute;blico, muchas de ellas generadas a partir de mapas de bit, con
baja calidad. Sin embargo, <CODE>gs</CODE> puede usar cualquier tipo PostScript
clase 1 o 3 que tenga a mano. Por ejemplo, <I>Adobe Type Manager</I> (que no
sea de Mac) incluye tipos utilizables. Sit&uacute;elos (normalmente <CODE>*.pc?</CODE>)
en <CODE>lib/ghostscript/fonts/</CODE>, y a&ntilde;ada al fichero
<CODE>[...]/ghostscript/Fontmap</CODE>' l&iacute;neas del estilo</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/Courier            (com_______.pfb) ;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En el servidor de correo de impresi&oacute;n puede encontrar el fichero
<CODE>fontmap.atm</CODE>, que contiene un <I>fontmap</I> de los tipos
normalmente incluidos en <I>Adobe Type Manager</I>. </P>
<P>Puede encontrar tipos Adobe Type 1 en:</P>
<P><CODE>
<A HREF="ftp://ftp.cica.indiana.edu/pub/pc/win3/fonts">ftp://ftp.cica.indiana.edu/pub/pc/win3/fonts</A></CODE></P>
<P><CODE>
<A HREF="ftp://archive.umich.edu/msdos/mswindows/fonts">ftp://archive.umich.edu/msdos/mswindows/fonts</A></CODE></P>
<P>En el fichero <CODE>comp.fonts FAQ</CODE>, en <CODE>
<A HREF="ftp://rftm.mit.edu">ftp://rftm.mit.edu</A></CODE>, puede encontrar
informaci&oacute;n &uacute;til acerca de tipos de impresi&oacute;n.</P>
<P>La conversi&oacute;n entre familias de tipos es delicada. <CODE>gs</CODE> incluye
herramientas para generar tipos escalables a partir de mapas de bits
(cuanto m&aacute;s grandes, mejor).</P>
<P><CODE>groff</CODE> tiene tambi&eacute;n herramientas para usar tipos Tfm/mf (TeX) y pfb
(type 1) en documentos *roff. X11R5 incluye herramientas procedentes de
IBM para presentar tipos type 1, con sus correspondientes p&aacute;ginas de
manual. Eche un ojo tambi&eacute;n al <I>logical fontutils</I> en
<CODE>
<A HREF="ftp://prep.ai.mit.edu/pub/gnu/">ftp://prep.ai.mit.edu/pub/gnu/</A></CODE>.  </P>


<H2><A NAME="ss5.9">5.9 Documentos para fax. </A></H2>


<P>Aunque no parezca el lugar m&aacute;s adecuado para su rese&ntilde;a, ¿qu&eacute; hacemos al
enviar un fax m&aacute;s que imprimir un fichero en un terminal remoto?. Mediante
fax, puede transmitir documentos originalmente en PostScript, dvi, texto
llano.... </P>
<P>Para enviar un fax, el documento original debe ser transformado en una
imagen TIFF del grupo III que ser&aacute; transmitida por el fax-m&oacute;dem. Todos los
programas mencionados contienen utilidades que permiten transformar las
distintas clases de documentos al formato necesario. Adem&aacute;s, <CODE>gs</CODE>
(tambi&eacute;n aqu&iacute;) tiene dispositivos adecuados para ello
(<CODE>-sDEVICE=tiffg3</CODE>).</P>
<P>Tenga en cuenta que hay dos juegos de &oacute;rdenes que un fax puede soportar: 
Clase 1 y Clase 2. En el primer caso, hoy ya casi extintos, gran parte de
la gesti&oacute;n de transmisi&oacute;n de datos debe hacerla el ordenador anfitri&oacute;n v&iacute;a
el programa de fax. Esto hace que en condiciones de sincronizaci&oacute;n
cr&iacute;tica, el control se vuelve casi imposible. Los fax de clase 2 son m&aacute;s
caros, pero mucho menos propensos a dar guerra. No confunda la 'clase' y
el 'grupo'. Deber&aacute; tener, por supuesto, un fax-m&oacute;dem de grupo III. </P>

<H3><CODE>FLEXFAX</CODE></H3>


<P>FlexFax est&aacute; escrito en C++ (necesita instalar g++ para compilarlo), y
soporta fax de clase 1 y 2. Utiliza <CODE>ghostview</CODE> (o cualquier otro visor
de ps) . Puede ejecutarse en lugar de <CODE>getty</CODE>, y decide, seg&uacute;n el tipo
de llamada, si activar el fax, o presentar un login. Permite la emisi&oacute;n de
faxes a trav&eacute;s de una red, y tiene un zurill&oacute;n de utilidades. Se configura
v&iacute;a '<CODE>configure</CODE>', y para un ordenador aislado es un tanto
mastod&oacute;ntico. La versi&oacute;n actual (4.0 beta 018, seg&uacute;n escribo ) puede
encontrarse en:  <CODE>
<A HREF="http://www.vix.com/hylafax/">http://www.vix.com/hylafax/</A></CODE></P>

<H3><CODE>mgetty+sendfax</CODE></H3>


<P><CODE>mgetty+sendfax</CODE> controla s&oacute;lo fax de clase 2, y puede tambi&eacute;n
actuar como contestador autom&aacute;tico, si el m&oacute;dem lo soporta. Al igual que
FlexFax, se instala en lugar de <CODE>getty</CODE>, controlando qu&eacute; entra y sale.
Muy adecuado si no necesitas trabajar sobre red. Un excelente conjunto de
programas disponible en</P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/Serial/mgetty+sendfax*.tar.gz">ftp://sunsite.unc.edu/pub/Linux/system/Serial/mgetty+sendfax*.tar.gz</A></CODE></P>
<P><CODE>
<A HREF="ftp://tsx-11.mit.edu/pub/Linux/sources/sbin/mgetty+sendfax*">ftp://tsx-11.mit.edu/pub/Linux/sources/sbin/mgetty+sendfax*</A></CODE></P>
<P><CODE>
<A HREF="ftp://ftp.leo.org/pub/comp/networking/communication/modem/mgetty/">ftp://ftp.leo.org/pub/comp/networking/communication/modem/mgetty/</A></CODE></P>

<H3>EFAX</H3>


<P>Controla fax de clase 1 y 2; no discrimina entre una conexi&oacute;n de datos y un
fax, tiene su fuerte en su facilidad de uso. Necesita el paquete NetPBM
(ftp.x.org). Utiliza <CODE>xv</CODE> para ver los fax recibidos. Lo encontrar&aacute; en:</P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/comm/efax*">ftp://sunsite.unc.edu/pub/Linux/apps/comm/efax*</A></CODE></P>


<HR>
<A HREF="Configuracion-Impresion-Como-4.html">Anterior</A>
<A HREF="Configuracion-Impresion-Como-6.html">Siguiente</A>
<A HREF="Configuracion-Impresion-Como.html#toc5">Indice</A>
</BODY>
</HTML>
