<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Mutt-i, GnuPG y PGP Como: PGP y GnuPG</TITLE>
 <LINK HREF="Mutt-GnuPG-PGP-Como-6.html" REL=next>
 <LINK HREF="Mutt-GnuPG-PGP-Como-4.html" REL=previous>
 <LINK HREF="Mutt-GnuPG-PGP-Como.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="Mutt-GnuPG-PGP-Como-6.html">Página siguiente</A>
<A HREF="Mutt-GnuPG-PGP-Como-4.html">Página anterior</A>
<A HREF="Mutt-GnuPG-PGP-Como.html#toc5">Índice general</A>
<HR>
<H2><A NAME="s5">5. PGP y GnuPG</A></H2>

<P>
<P>Para usar cualquiera de las versiones de <EM>PGP</EM> con <EM>Mutt-i</EM>, primero ser&aacute;
necesario configurar adecuadamente <EM>PGP</EM> de modo que existan el fichero con
las claves p&uacute;blicas (anillo de claves p&uacute;blicas) y el fichero con las claves
privadas (anillo de claves privadas). Conviene probar previamente PGP desde la
l&iacute;nea de comandos para asegurarse de que firma y cifra correctamente.
<P>Recordemos que para <EM>Unix</EM> las versiones de <EM>PGP</EM> existentes son
<CODE>2.6.3(i)</CODE> y <CODE>5.0(i)</CODE>, que de ahora en adelante llamaremos <B>PGP2</B> y
<B>PGP5</B> respectivamente. <B>GnuPG</B> es un sistema de codificaci&oacute;n nuevo,
todav&iacute;a en desarrollo aunque muy avanzado, de c&oacute;digo abierto y libre, en muchos
aspectos superior a <B>PGP</B> (ver GnuPG mini como en <CODE>
<A HREF="http://www.insflug.org/documentos/GPG-Mini-Como/">http://www.insflug.org/documentos/GPG-Mini-Como/</A></CODE>).
<P>Aclararemos tambi&eacute;n que <EM>PGP</EM>, al ser un sistema desarrollado en los EE.UU.,
est&aacute; sujeto a ciertas leyes sobre la exportaci&oacute;n de programas que incluyen
c&oacute;digo criptogr&aacute;fico;  por esta raz&oacute;n existe una versi&oacute;n internacional para
casi todas las versiones num&eacute;ricas, y &eacute;sta vienen denotadas por la letra
«<B>i</B>» (<B>pgp - pgpi</B>).
<P>
<H2><A NAME="ss5.1">5.1 PGP2</A>
</H2>

<P>
<P><EM>PGP2</EM> genera claves con el algoritmo RSA (<CODE>
<A HREF="http://www.rsa.com">http://www.rsa.com</A></CODE>), y como algoritmo de
cifrado usa IDEA (<CODE>
<A HREF="http://www.ascom.ch">http://www.ascom.ch</A></CODE>).
<P>Ambos son algoritmos propietarios y su uso est&aacute; restringido por sus respectivas
patentes.
<P>Para su correcto funcionamiento, una vez instalado el programa, deberemos tener
un directorio <CODE>~/.pgp</CODE>, en el que se encuentren el fichero de
configuraci&oacute;n <CODE>pgp-i.conf</CODE> y los ficheros con los anillos de claves p&uacute;blicas
y privadas, <CODE>pubring.pgp</CODE> y <CODE>secring.pgp</CODE> respectivamente.
<P>
<H2><A NAME="ss5.2">5.2 PGP5</A>
</H2>

<P>
<P>Las claves generadas por <EM>PGP5</EM> son del tipo <B>DSS/DH</B> (Digital
Signature Standard / Diffie-Helman). PGP5 usa como algoritmos de cifrado
<B>CAST</B>, <B>Triple-DES</B>, e <B>IDEA</B>.  PGP5 puede trabajar con datos
cifrados y/o firmados con <EM>RSA</EM> (PGP2), e incluso usar estas claves para
cifrar y/o firmar digitalmente (con claves generadas por PGP2, ya que PGP5 no
puede generar dichas claves).  Por contra, PGP2 no reconoce las claves
<EM>DSS/DH</EM> de PGP5;  esto crea un problema de incompatibilidad, pues en
<EM>Unix/Linux</EM> todav&iacute;a muchos usuarios tienen instalado s&oacute;lo la versi&oacute;n de
PGP2.
<P>Para el correcto funcionamiento de PGP5, en el directorio
<CODE>~/.pgp</CODE>, se encontrar&aacute;n los anillos de claves p&uacute;blicas y privadas
(<CODE>pubring.pkr</CODE> y <CODE>secring.skr</CODE> respectivamente), as&iacute; como el fichero de
configuraci&oacute;n <CODE>pgp.cfg</CODE>.
<P>En caso de tener instaladas las dos versiones de <EM>PGP</EM> (por tanto, habremos
instalado y configurado PGP2 antes que PGP5), el fichero de configuraci&oacute;n
<CODE>~/.pgp/pgp.cfg</CODE> de PGP5 lo crearemos como un enlace simb&oacute;lico al
fichero de configuraci&oacute;n <CODE>~/.pgp/pgp-i.conf</CODE>,
<P>
<BLOCKQUOTE><CODE>
<PRE>
~/.pgp$ ln -s pgp-i.conf pgp.cfg
</PRE>
</CODE></BLOCKQUOTE>
<P>a&ntilde;adiendo las siguientes l&iacute;neas al final del fichero
<CODE>~/.pgp/pgp-i.conf</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
PubRing = "~/.pgp/pubring.pkr"
SecRing = "~/.pgp/secring.skr"
RandSeed = "~/.pgp/randseed.bin"
</PRE>
</CODE></BLOCKQUOTE>
<P>Los ficheros con los anillos de claves de las diferentes versiones pueden
coexistir sin ning&uacute;n problema en el mismo directorio.
<P>
<H2><A NAME="ss5.3">5.3 GnuPG</A>
</H2>

<P>
<P><B>GnuPG</B> es un programa con las mismas funciones que el anterior. A
diferencia de <EM>PGP</EM>, <EM>GnuPG</EM> evita el uso de algoritmos con patentes
restrictivas. <EM>PGP</EM> puede ser usado libremente con fines personales, pero no
comerciales, y su desarrollo es cerrado.  <EM>GnuPG</EM> es de libre uso, y de
desarrollo abierto, al igual que nuestro sistema operativo favorito (adem&aacute;s de
que su implementaci&oacute;n y desarrollo es principalmente en <EM>Linux</EM>).
<P>Las claves generadas por <EM>GnuPG</EM> son del tipo <B>DSA/ElGamal</B>
(<EM>Digital Signature Algorithm</EM>, tambi&eacute;n conocido como <EM>DSS</EM>). Es
totalmente compatible con <EM>PGP</EM>, excepto en el uso de los algoritmos con
patentes restrictivas <EM>RSA</EM> e <EM>IDEA</EM>.  No obstante, es posible
implementar cierta compatibilidad al respecto (ver GnuPG mini como en 
<A HREF="http://www.insflug.org/documentos/GPG-Mini-Como/">http://www.insflug.org/documentos/GPG-Mini-Como/</A> para su configuraci&oacute;n
e interacci&oacute;n con PGP2 y PGP5).
<P>
<HR>
<A HREF="Mutt-GnuPG-PGP-Como-6.html">Página siguiente</A>
<A HREF="Mutt-GnuPG-PGP-Como-4.html">Página anterior</A>
<A HREF="Mutt-GnuPG-PGP-Como.html#toc5">Índice general</A>
</BODY>
</HTML>
