<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Mutt-i, GnuPG y PGP Como: Macros interesantes para mutt</TITLE>
 <LINK HREF="Mutt-GnuPG-PGP-Como-8.html" REL=next>
 <LINK HREF="Mutt-GnuPG-PGP-Como-6.html" REL=previous>
 <LINK HREF="Mutt-GnuPG-PGP-Como.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="Mutt-GnuPG-PGP-Como-8.html">Página siguiente</A>
<A HREF="Mutt-GnuPG-PGP-Como-6.html">Página anterior</A>
<A HREF="Mutt-GnuPG-PGP-Como.html#toc7">Índice general</A>
<HR>
<H2><A NAME="s7">7. Macros interesantes para mutt</A></H2>

<P>
<P><EM>Mutt</EM> es altamente configurable y puede modificar su forma de trabajo de
modo muy flexible si se hace un uso adecuado de las opciones de <CODE>.muttrc</CODE>.
<P>Aqu&iacute; se presentan algunas macros que ayudar&aacute;n a generar firmas evitando seguir
el est&aacute;ndar <EM>PGP/MIME</EM>, para enviarlas a destinatarios que sabemos de
cierto que no pueden verificar las firmas <EM>PGP/MIME</EM>, y para editar el
fichero de alias y volver a cargarlo sin salir de <EM>Mutt</EM> (aunque esto &uacute;ltimo
no est&aacute; relacionado con <EM>PGP/GnuPG</EM>, se presenta como ejemplo para
mostrar el poder de las macros en <EM>Mutt</EM>).
<P>Es posible indicar a Mutt las combinaciones de teclado que queremos utilizar
para las opciones de <EM>PGP/GnuPG</EM> que deseamos implementar en el correo
electr&oacute;nico. Aun cuando algunas de estas opciones vienen configuradas por
defecto, podemos f&aacute;cilmente cambiarlas o a&ntilde;adir otras modificando la
configuraci&oacute;n.
<P>
<H2><A NAME="sec-app-pgp"></A> <A NAME="ss7.1">7.1 Firma sobre el propio texto del mensaje sin usar PGP/MIME con PGP5</A>
</H2>

<P>
<P>Antes de la existencia de <EM>PGP/MIME</EM>, la firma de un mensaje iba
incluida en el cuerpo del mensaje. Este caso sigue siendo com&uacute;n con muchos
lectores de correo.
<P>En caso de que queramos firmar de esta forma, tenemos dos opciones, dejar el
tipo <EM>MIME</EM> del mensaje intacto o modificarlo como <CODE>application/pgp</CODE>.
<P>Para implementar estas dos formas de firmar en <EM>Mutt</EM>, a&ntilde;adiremos las l&iacute;neas
siguientes al fichero <CODE>~/mutt.varios/mutt.macros</CODE>.  Previamente,
habremos indicado el origen de este fichero de configuraci&oacute;n opcional al
fichero de configuraci&oacute;n principal <CODE>.muttrc</CODE>; ver 
<A HREF="Mutt-GnuPG-PGP-Como-6.html#sec-opcion">ficheros de configuraci&oacute;n opcionales</A>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
macro   compose \Cp     "F/usr/bin/pgps\ny"
macro   compose S       "F/usr/bin/pgps\ny^T^Uapplication/pgp; format=text; x-action=sign\n"
</PRE>
</CODE></BLOCKQUOTE>
<P>y de esta forma, pulsando <CODE>&lt;Ctrl&gt;p</CODE> o <CODE>S</CODE> podremos incluir la firma
digital en el adjunto del mensaje sobre el que est&eacute; situado el cursor en la
pantalla, en la que se encontrar&aacute; el mensaje listo para ser enviado.
<P>
<H2><A NAME="sec-app-gpg"></A> <A NAME="ss7.2">7.2 Firma sobre el propio texto del mensaje sin usar PGP/MIME con GnuPG</A>
</H2>

<P>
<P>Igual que en el caso anterior, pero con GnuPG. Las macros quedan de la
siguiente manera:
<P>
<BLOCKQUOTE><CODE>
<PRE>
macro   compose \CP     "Fgpg --clearsign\ny"
macro   compose \CS     "Fgpg --clearsign\ny^T^Uapplication/pgp; format=text; x-action=sign\n"
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss7.3">7.3 Edici&oacute;n del fichero de alias y recarga del mismo</A>
</H2>

<P>
<P>Con esta macro para incluir en <CODE>~/mutt.varios/macros.mutt</CODE> puedes
editar con <EM>vi</EM> (modificando la linea puedes usar otro editor) el fichero de
alias sin salir de <EM>Mutt</EM> pulsando <CODE>&lt;Alt&gt;a</CODE>.
<P>
<BLOCKQUOTE><CODE>
<PRE>
macro   index   \ea     "!vi ~/Mail/.alias\n:source =.alias\n"
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss7.4">7.4 M&aacute;s ejemplos de macros</A>
</H2>

<P>
<P>El siguiente listado ha sido obtenido de Roland Rosenfeld y presenta macros
para cambiar el «sistema de firmado/cifrado por defecto» y firmar sin PGP/MIME
con GnuPG:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# ~/Mail/.muttrc.macros
# Fichero de configuraci&oacute;n del teclado en Mutt-i
# copiado, modificado y traducido del original:
#
################################################################
# The ultimative Key-Bindings for Mutt                         #
#                                                              #
# (c) 1997-1999 Roland Rosenfeld &lt;roland@spinnaker.rhein.de>   #
#                                                              #
# $ Id: keybind,v 1.36 1999/02/20 19:36:28 roland Exp roland $ #
################################################################
#
# Para su correcto funcionamiento, a&ntilde;adir al fichero de
# configuraci&oacute;n ~/.muttrc la l&iacute;nea:
# source ~/Mail/.muttrc.macros
#

# Generic keybindings
# (¡para todos los men&uacute;s de Mutt excepto el del paginador!)
# Con las tres siguientes podemos cambiar el sistema de cripto que
# estemos utilizando por defecto:

# &lt;ESC>1 para GnuPG
macro   generic \e1     ":set pgp_default_version=gpg ?pgp_default_version\n"\
                        "Switch to GNU-PG"

# &lt;ESC>2 para PGP2
macro   generic \e2     ":set pgp_default_version=pgp2 ?pgp_default_version\n"\
                        "Switch to PGP 2.*"

# &lt;ESC>5 para PGP5
macro   generic \e5     ":set pgp_default_version=pgp5 ?pgp_default_version\n"\ 
                        "Switch to PGP 5.*"


# index, OpMain, MENU_MAIN
# (Men&uacute; principal)
# La siguiente s&oacute;lo funciona desde el men&uacute; principal (el que nos
# encontramos nada m&aacute;s abrir Mutt).  La combinaci&oacute;n de las teclas
# &lt;CTRL>K nos permite extraer las claves p&uacute;blicas de un mensaje si las
# hubiere (esto se sabe porque el mensaje viene precedido por la letra
# K):

macro  pager   \Ck     ":set pipe_decode pgp_key_version=pgp2\n\e\ek:set pgp_key_version=pgp5\n\e\ek:set pgp_key_version=gpg\n\e\ek:set pgp_key_version=default nopipe_decode\n"\ "Extract PGP keys to PGP2, PGP 5, and GnuPG keyrings"


# pager, OpPager, MENU_PAGER
# (Men&uacute; del Paginador)
# Permite las mismas operaciones que en el primer caso, y con las mismas
# combinaciones de claves, pero en este caso desde el men&uacute; del
# paginador:

macro   pager   \e1     ":set pgp_default_version=gpg ?pgp_default_version\n"\
                        "switch to GNUPG"

macro   pager   \e2     ":set pgp_default_version=pgp2 ?pgp_default_version\n"\
                        "switch to PGP 2.*"

macro   pager   \e5     ":set pgp_default_version=pgp5 ?pgp_default_version\n"\
                        "switch to PGP 5.*"


# compose, OpCompose+OpGerneric, MENU_COMPOSE
# (Men&uacute; de composici&oacute;n)
# Las siguientes operaciones se realizan desde el men&uacute; de composici&oacute;n.
# Esto es, una vez hemos compuesto el mensaje y lo cerramos para
# enviarlo, justo antes de presionar la tecla "Y" que nos permita
# pas&aacute;rselo al MTA.

# En este caso creamos un men&uacute; que se abre al presionar la tecla "P".
# Las opciones de este men&uacute; las ligamos a MENU_PGP. Estas son las
# opciones de uso principal (codificaci&oacute;n y firma).

bind    compose p       pgp-menu

# Como muchos programas no son capaces de implementar las
# espicificaciones de MIME/PGP (especialmente los de M$), las teclas
# &lt;CTRL>P nos permitir&aacute;n firmar los mensajes "a la antigua"
# (Application/PGP):

macro   compose \CP     "Fgpg --clearsign\ny"

# A continuaci&oacute;n, &lt;CTRL>S nos permitir&aacute; firmar "a la MIME/PGP" con la
# clave que tengamos definida por defecto.  Esta macro no es necesaria
# ya que lo mismo podemos hacer desde el men&uacute; "P":
macro   compose \CS     "Fgpg --clearsign\ny^T^Uapplication/pgp; format=text; x-action=sign\n"
</PRE>
</CODE></BLOCKQUOTE>
<P>Es posible a&ntilde;adir m&aacute;s macros, y algunas otras vienen ya configuradas por
defecto en nuevas versiones de Mutt.  Algunas otras opciones incluyen:
<P>
<UL>
<LI>&lt;CTRL&gt;K (extraer claves p&uacute;blicas adjuntas a un mensaje)</LI>
<LI>&lt;ESC&gt;K (adjuntar una clave p&uacute;blica a un mensaje)</LI>
<LI>&lt;CTRL&gt;F (al usar la contrase&ntilde;a para firmar o descodificar un
mensaje, &eacute;sta queda grabada en memoria.  De este modo podemos borrar la
contrase&ntilde;a de la memoria)</LI>
<LI>etc...</LI>
</UL>
<P>Para ver qu&eacute; otras opciones tenemos activadas basta con ir al men&uacute; de ayuda (?)
desde el men&uacute; en que nos encontremos.
<P>
<HR>
<A HREF="Mutt-GnuPG-PGP-Como-8.html">Página siguiente</A>
<A HREF="Mutt-GnuPG-PGP-Como-6.html">Página anterior</A>
<A HREF="Mutt-GnuPG-PGP-Como.html#toc7">Índice general</A>
</BODY>
</HTML>
