<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Mutt-i, GnuPG y PGP Como: Configuraci&oacute;n de mutt</TITLE>
 <LINK HREF="Mutt-GnuPG-PGP-Como-5.html" REL=next>
 <LINK HREF="Mutt-GnuPG-PGP-Como-3.html" REL=previous>
 <LINK HREF="Mutt-GnuPG-PGP-Como.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="Mutt-GnuPG-PGP-Como-5.html">Página siguiente</A>
<A HREF="Mutt-GnuPG-PGP-Como-3.html">Página anterior</A>
<A HREF="Mutt-GnuPG-PGP-Como.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4. Configuraci&oacute;n de mutt</A></H2>

<P>
<P>El siguiente fichero de ejemplo es v&aacute;lido para comenzar a usar <EM>Mutt</EM> de
forma b&aacute;sica incluyendo caminos para los ficheros de alias, mensajes enviados y
mensajes postpuestos. Se puede realizar una mayor personalizaci&oacute;n atendiendo a
las indicaciones del manual de <EM>Mutt</EM> en <CODE>/usr/doc/mutt/</CODE> o
<CODE>/usr/doc/mutt-i/</CODE>
<P>Ejemplo simple de <CODE>~/.muttrc</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
set folder=~/Mail
set alias_file=.alias
set postponed=.postponed
set record=MensajesEnviados
set signature=.signature
my_hdr From: Nombre Apellido &lt;Nombre@dominio.com>
source =.alias
</PRE>
</CODE></BLOCKQUOTE>
<P>Es necesario que exista el directorio <CODE>~/Mail</CODE>, que es el que
aparece como un signo de «igual que» en el fichero de configuraci&oacute;n
<CODE>.muttrc</CODE> (esto es, <CODE>=.alias</CODE> quiere decir para <EM>Mutt</EM>
<CODE>~/Mail/.alias</CODE>, y <CODE>=.postponed</CODE> quiere decir para <EM>Mutt</EM>
<CODE>~/Mail/.postponed</CODE>). No obstante es posible tener estos ficheros
en otro directorio siempre y cuando indiquemos el camino completo en
<CODE>~/.muttrc</CODE>, y tengamos los permisos necesarios para trabajar en
dicho directorio.
<P>Tambi&eacute;n hay que personalizar la linea <CODE>my_hdr</CODE> con el nombre y la direcci&oacute;n
de correo electr&oacute;nico adecuados. En el fichero <CODE>~/Mail/.signature</CODE>
se puede incluir la firma que aparecer&aacute; en todos los mensajes que se env&iacute;en.
<P>Este fichero de configuracion puede llegar a hacerse muy grande, por lo que es
com&uacute;n separar algunos de sus comandos en ficheros diferentes. Por lo pronto,
son facilmente separables las lineas de configuraci&oacute;n de <EM>PGP</EM> o <EM>GnuPG</EM>
y las macros de teclado que personalicemos. Para ello seria necesario a&ntilde;adir
las lineas siguientes al fichero <CODE>~/.muttrc</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
source = ~/Mail/.mutt.macros
source = ~/Mail/.gnupgp.mutt
</PRE>
</CODE></BLOCKQUOTE>
<P>y utilizar los ficheros <CODE>~/Mail/.mutt.macros</CODE> y
<CODE>~/Mail/.gnupgp.mutt</CODE> para introducir en ellos las macros de
teclado y la configuraci&oacute;n de <EM>PGP</EM> o <EM>GnuPG</EM> que m&aacute;s adelante se
comentan.
<P>Para una informaci&oacute;n m&aacute;s extensiva y completa sobre el uso y configuraci&oacute;n de
<EM>Mutt</EM>, as&iacute; como de caracter&iacute;sticas avanzadas, ver el Manual de Mutt en
<CODE>
<A HREF="http://www.lucas.org/manual_mutt.html">http://www.lucas.org/manual_mutt.html</A></CODE>.
<P>
<HR>
<A HREF="Mutt-GnuPG-PGP-Como-5.html">Página siguiente</A>
<A HREF="Mutt-GnuPG-PGP-Como-3.html">Página anterior</A>
<A HREF="Mutt-GnuPG-PGP-Como.html#toc4">Índice general</A>
</BODY>
</HTML>
