<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_0.6">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <TITLE>Applications : C&oacute;mo usar un ramdisk bajo Linux</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Mark-Nielsen.jpg" ALT="[Photo of the Author]" HEIGHT=159 WIDTH=110>
<BR>por  <A HREF="mailto:mark@tcu-inc.com">Mark Nielsen</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>El autor (<a href="http://www.tcu-inc.com/mark">home page</a>) trabaja en 
<a href="http://www.tcu-inc.com">The Computer Underground, Inc.</a> como limpiador
de ficheros y como consultor profesional en <a href="http://www.800linux.com">
800linux.com</a>. En su tiempo libre, se dedica a trabajos voluntarios, como
escribir documentos como &eacute;ste, que ha sido editado usando NEdit junto
con ispell.
</P>
<P><FONT COLOR="#336633">Contenidos</FONT>:
<UL>
  <LI><A HREF="#lfindex0">Intoducci&oacute;n a ramdisk</A></LI>
  <LI><A HREF="#lfindex1">Como usar un ramdisk</A></LI>
  <LI><A HREF="#lfindex2">Eligiendo el tama&ntilde;o de su ramdisk</A></LI>
  <LI><A HREF="#lfindex3">Ejemplo: uso de ramdisk en un servidor de web.</A></LI>
  <LI><A HREF="#lfindex4">Comentarios a tener en cuenta</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>C&oacute;mo usar un ramdisk bajo Linux</H2>
 <IMG SRC="../../common/images/illustration35.gif" ALT="[Illustration]" HSPACE=10 HEIGHT=100 WIDTH=100><P><FONT COLOR="#336633">Resumen</FONT>:
<P>

Este art&iacute;culo muestra como usar la memoria RAM como un disco virtual.

</P><HR size="2" noshade><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Intoducci&oacute;n a ramdisk</H2>

Esto es un art&iacute;culo corto acerca de c&oacute;mo instalar un ramdisk
en una m&aacute;quina con RedHat Linux 6.0. El proceso deber&iacute;a ser
similar para otras distribuciones de Linux. 
<p>
Pero primero... ¿Qu&eacute; es un ramdisk? Es una parte de memoria que puede ser asignada para
usarla como si fuese una partici&oacute;n de disco. Consiste, en otras palabras, en reservar
una cierta cantidad de memoria y acceder a ella como si fuese una unidad de disco.
¿Qu&eacute; motivos puede haber para querer usar un ramdisk? 
Cuando un grupo de archivos va a ser accedido de forma intensiva, guardar
esos archivos en memoria incrementar&aacute; la velocidad de acceso debido
a la gran diferencia de velocidad que existe entre la memoria y un disco duro.
Un ejemplo de estos casos podr&iacute;a ser intentar acelerar el acceso a las 
p&aacute;ginas de un servidor de web.
Si adem&aacute;s, le gusta el riesgo y tiene un PII a 550Mhz con 1 Gb de
memoria pero con un disco no muy grande, como 500Mb, puede hacer uso de esta
t&eacute;cnica para incrementar el espacio disponible. 
De hecho, tener una m&aacute;quina sin disco duro tampoco ser&iacute;a ninguna
locura, despues de todo.
<p>
Algunas referencias &uacute;tiles:

<ol>
<li><a href="http://metalab.unc.edu/LDP/HOWTO/Kernel-HOWTO.html">
http://metalab.unc.edu/LDP/HOWTO/Kernel-HOWTO.html</a>
<li>
<a href="http://metalab.unc.edu/LDP/HOWTO/mini/LILO.html">
http://metalab.unc.edu/LDP/HOWTO/mini/LILO.html</a>
<li> 
/usr/src/linux/Documentation/ramdisk.txt
</ol>

<A NAME="lfindex1">&nbsp;</A>
<H2>Como usar un ramdisk</H2>


La verdad es que es muy f&aacute;cil. En primer lugar, la distribuci&oacute;n
RedHat ya viene con soporte para ramdisk, as&iacute; que todo lo que hay que hacer
es formatear el ramdisk y montarlo en un directorio. El comando para obtener
una lista de los ramdisks disponibles es "ls -al /dev/ram". Los ramdisks que
se listan est&aacute;n listos para ser usados, pero no ocupan memoria mientras
no se usan por primera vez (por ejemplo, al darles formato). 
&Eacute;ste es un ejemplo de como usar un ramdisk:
<pre>
# Crear el directorio donde montaremos el ramdisk
mkdir -p /tmp/ramdisk0
# Crear un sistema de ficheros en el disco (formatearlo)
mkfs -t ext2 /dev/ram0
# Montar el ramdisk en el directorio elegido:
mount /dev/ram0 /tmp/ramdisk0
</pre>

Esta secuencia de comandos crear&aacute; un directorio donde montar el
ramdisk, dar&aacute; formato al ramdisk (por defecto con un tama&ntilde;o de
4 Mb) y lo montar&aacute;. Ya est&aacute;: se puede usar ese directorio como
cualquier otra partici&oacute;n... ¡adelante!

<p>
Si no le permite formatear el ramdisk, es probable que el kernel no est&eacute; compilado
con soporte para ramdisk. La opci&oacute;n de configuraci&oacute;n del kernel que permite
activarlo se llama CONFIG_BLK_DEV_RAM. 

<p>
Como hemos visto, el tama&ntilde;o por defecto del ramdisk es 4 Mb = 4096 bloques. Puede
ver de qu&eacute; tama&ntilde;o es el ramdisk que ha obtenido observando la salida de mke2fs:
<code>mke2fs /dev/ram0</code>
deber&iacute;a haber escrito algo parecido a lo siguiente:

<pre>
mke2fs 1.14, 9-Jan-1999 for EXT2 FS 0.5b, 95/08/09
Linux ext2 filesystem format
Filesystem label=
<font color="#FF0000">1024 inodes, 4096 blocks</font>
204 blocks (4.98%) reserved for the super user
First data block=1
Block size=1024 (log=0)
Fragment size=1024 (log=0)
1 block group
8192 blocks per group, 8192 fragments per group
1024 inodes per group
</pre>

La orden <code>df -k /dev/ram0</code> le permite saber cuanto de ese espacio es realmente 
utlizable (el sistema de ficheros ocupa una peque&ntilde;a parte del espacio total)
<br>
<pre>
&gt;df -k /dev/ram0
Filesystem  1k-blocks  Used Available Use% Mounted on
/dev/ram0        3963    13      3746   0% /tmp/ramdisk0
</pre>

<p>
Pero cuidado, hay que tener en cuenta algunas cosas... Por ejemplo, cuando el ordenador
se reinicia, todo el contenido del ramdisk se borra, as&iacute; que no guarde all&iacute;
datos que no est&eacute;n salvados en un disco "de verdad" si son importantes. Tambi&eacute;n
hay que tener presente que si se modifica alg&uacute;n fichero del ramdisk y no quiere
perder los cambios deber&aacute; grabarlo tambi&eacute;n en otro sitio.

<A NAME="lfindex2">&nbsp;</A>
<H2>Eligiendo el tama&ntilde;o de su ramdisk</H2>

Para usar un ramdisk, necesita activar la opci&oacute;n correspondiente en la configuraci&oacute;n
del kernel. Puede incluirlo en el kernel o compilarlo como m&oacute;dulo. Esta &uacute;ltima opci&oacute;n tiene
la ventaja que le permite cambiar el tama&ntilde;o del ramdisk sin tener que recompilar el kernel.<br>

<p>
Vamos a ver pues qu&eacute; formas hay de cambiar ese tama&ntilde;o por defecto de 4Mb:
<p>
Primero la forma dif&iacute;cil: consiste en a&ntilde;adir la siguiente l&iacute;nea al fichero de configuraci&oacute;n de lilo 
(lilo.conf):
<br>    ramdisk=10000
<br> A partir del momento en que se reinicie el ordenador (ejecutar antes lilo), el tama&ntilde;o por defecto para los
ramdisk ser&aacute; de 10 Mb. Como ejemplo, este es mi fichero lilo.conf

<pre>
boot=/dev/hda
map=/boot/map
install=/boot/boot.b
prompt
timeout=50
image=/boot/vmlinuz-2.2.5-15
	label=linux
	root=/dev/hda2
	read-only
	ramdisk=10000
</pre>

Con esta configuraci&oacute;n, el tama&ntilde;o utilizable del ramdisk es un poco m&aacute;s de 9 Mb.

<p>
En cambio, si ha compilado el soporte para ramdisk como m&oacute;dulo, entonces puede decidir que 
tama&ntilde;o desea que tenga en el momento de cargar el m&oacute;dulo.
Esto se puede hacer tanto con una opci&oacute;n en el fichero /etc/conf.modules:
<pre>
options rd rd_size=10000
</pre>
como pasando los par&aacute;metros adecuados al llamar a insmod desde la l&iacute;nea de comandos:
<pre>
insmod rd rd_size=10000
</pre>

Por ejemplo, para usar el m&oacute;dulo, seguir&iacute;amos los siguientes pasos:
<ol>
<li>Desmontar el ramdisk montado en el cap&iacute;tulo anterior, <code>umount /tmp/ramdisk0 </code>
<li>Eliminar de memoria el m&oacute;dulo (fue cargado automaticamente en el cap&iacute;tulo anterior), <code>rmmod rd</code>
<li>Cargar de nuevo el m&oacute;dulo y darle un tama&ntilde;o de 20Mb, <code>insmod rd_size=20000</code>
<li>Crear un sistema de ficheros, <code>mke2fs /dev/ram0</code>
<li>Montarlo, <code>mount /dev/ram0 /tmp/ramdisk0</code>
</ol> 

<A NAME="lfindex3">&nbsp;</A>
<H2>Ejemplo: uso de ramdisk en un servidor de web.</H2>


Este ejemplo muestra como configurar 3 ramdisks para un servidor de web. Comprobamos que
la instalaci&oacute;n por defecto de Apache para RedHat 6.0 no usa m&aacute;s de 9 Mb. para
sus cgis, p&aacute;ginas html y archivos de iconos. Bien, pues vamos a ello...

<br> En primer lugar, ejecutamos estos comandos para trasladar el contenido del home directory del
webserver a un sitio diferente, al que llamaremos /home/httpd_real. Tambi&eacute;n creamos los directorios
para montar los ramdisks:

<pre>
mv /home/httpd/ /home/httpd_real
mkdir /home/httpd
mkdir /home/httpd/cgi-bin
mkdir /home/httpd/html
mkdir /home/httpd/icons
</pre>

A continuaci&oacute;n, a&ntilde;adimos estos comandos al fichero /etc/rc.d/rc.local

<pre>

### Make the ramdisk partitions (damos formato a los ramdisks)
/sbin/mkfs -t ext2 /dev/ram0
/sbin/mkfs -t ext2 /dev/ram1
/sbin/mkfs -t ext2 /dev/ram2

### Mount the ramdisks to their appropriate places (los montamos)
mount /dev/ram0 /home/httpd/cgi-bin
mount /dev/ram1 /home/httpd/icons
mount /dev/ram2 /home/httpd/html

### Copying real directory to ramdisks (copiamos los datos en los ramdisks)
tar -C /home/httpd_real -c . | tar -C /home/httpd -x

#### Restarting the webserver (iniciamos el servidor de web)
/etc/rc.d/init.d/httpd restart	

</pre>
Para que los cambios tengan efecto, reiniciamos el ordenador. Se puede evitar reiniciarlo simplemetne
ejecutando de nuevo el script rc.local que hemos modificado:

<pre>
/etc/rc.d/rc.local
</pre> 

<A NAME="lfindex4">&nbsp;</A>
<H2>Comentarios a tener en cuenta</H2>


<ol>
<li>Por favor, acu&eacute;rdese de COPIAR LOS DATOS A UN SITIO SEGURO SI LOS MODIFICA, ya que
cuando reinicie su ordenador, el contenido de los ramdisk se perder&aacute;. Una forma de hacerlo autom&aacute;ticamente
es a trav&eacute;s de una tarea de cron que cada 5 minutos compruebe si se ha modificado alg&uacute;n archivo en 
el directorio del ramdisk y grabe los cambios en un sitiio seguro. Hay otras formas mejores de hacer esto, pero no voy
a entrar en ello. Otra forma de hacer las cosas, mucho m&aacute;s segura, es realizar los cambios sobre el
directorio real (el que est&aacute; guardado en un disco de verdad) en vez de hacerlos en el ramdisk y a continuaci&oacute;n
copiar los cambios al ramdisk.

<li> Una utilidad para los ramdisks ser&iacute;a usar un ramdisk de, por ejemplo 256 Mb para el
directorio /tmp. Si tiene una m&aacute;quina con 1 Gb de RAM se lo puede permitir: en caso que haya muchos
procesos que usen el /tmp, acelerar&iacute;a el sistema. De paso, el /tmp se borrar&aacute; autom&aacute;ticamente
al reiniciar el equipo, cosa que puede ser interesante.

<li> Linux usa toda la memoria que no est&aacute; ocupada por programas como cache general de disco, pero mi 
experiencia es que los ramdisks dan, a pesar de todo, un aumento significativo de velocidad.

</ol>



<!-- vim: set sw=2 ts=2 et: -->

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Mark Nielsen <BR>LinuxFocus 1999</FONT>
<BR></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:mark@tcu-inc.com"><FONT COLOR="#FFFFFF">Mark Nielsen</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:lhernandez@eq.upc.es"><FONT COLOR="#FFFFFF">Lluis Hern&aacute;ndez</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2000-03-10, generated by lfparser version 0.6</font></p></BODY></HTML>
