<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_0.6">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <TITLE>Applications : Revisi&oacute;n de juegos : FreeCiv</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Harald-Radke.gif" WIDTH=121 HEIGHT=147 ALT="[Photo of the Author]">
<BR>por  <A HREF="mailto:harryrat@gmx.de">Harald Radke</A>
<BR><BR><I>Sobre el Author:</I><BR><P>
Harry estudia inform&aacute;tica en la 
<I>
Universidad de Tecnolog&iacute;a
de Aachen
</I>
, en Alemania desde 1994.
Utiliza Linux desde 1995. Desde entonces ha jugado con &eacute;l,
sorprendi&eacute;ndose siempre de lo buen software que es. Ha programado un
poco en X, le gustan los gr&aacute;ficos y por supuesto jugar con los
juegos. Otros hobbies son: jugar a juegos de tablero, leer novelas de
ciencia ficci&oacute;n, tocar la guitarra (&iexcl;mal!), cocinar,
practicar Jiu-Jutsu y pasar el tiempo con su novia.
<BR>
<B>
El traductor:
</B>
David ha trabajado en la internacionalizaci&oacute;n de
FreeCiv y en la localizaci&oacute;n del mismo al espa&ntilde;ol.

</P><P><FONT COLOR="#336633">Contenidos</FONT>:
<OL>
  <LI><A HREF="#lfindex0">Introduci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Requisitos</A></LI>
  <LI><A HREF="#lfindex2">Instalaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex3">Inicializando el juego</A></LI>
  <LI><A HREF="#lfindex4">Inicio del juego</A></LI>
  <LI><A HREF="#lfindex5">El mundo</A></LI>
  <LI><A HREF="#lfindex6">Ciudades</A></LI>
  <LI><A HREF="#lfindex7">Unidades</A></LI>
  <LI><A HREF="#lfindex8">Ciencia</A></LI>
  <LI><A HREF="#lfindex9">Diplomacia</A></LI>
  <LI><A HREF="#lfindex10">Estad&iacute;sticas y ayuda</A></LI>
  <LI><A HREF="#lfindex11">Cambiar los gr&aacute;ficos y las reglas</A></LI>
  <LI><A HREF="#lfindex12">Y al final...</A></LI>
  <LI><A HREF="#lfindex13">Referencias</A></LI>
  <LI><A HREF="#lfindex14">Internacionalizaci&oacute;n</A></LI>
</OL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Revisi&oacute;n de juegos : FreeCiv</H2>
 <IMG SRC="../../common/images/article117/freecivlogo.gif" WIDTH=80 HEIGHT=48 ALT="[Illustration]"><P><FONT COLOR="#336633">Resumen</FONT>:
<P>

FreeCiv es un clon de dominio publico del famoso juego de Sid Meier's <I>
Civilisation</I>. Daremos un vistazo al programa, desde su descarga hasta
algunos aspectos b&aacute;sicos del juego. La versi&oacute;n analizada
aqu&iacute; es <I>FreeCiv</I> 1.8.3 beta 3.
</P><HR size="2" noshade><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Introduci&oacute;n</H2>


<P>FreeCiv es (como su propio nombre indica) una versi&oacute;n de c&oacute;digo
libre de <I>Civ, Civ II, Civ Net</I>, la famosa serie, creada por Sid Meier en
Microprose. Actualmente, FreeCiv se parece a Civ I (aunque los gr&aacute;ficos
son mejores), sigue la mayor&iacute;a de las reglas de Civ II (aunque se han
hecho modificaciones&nbsp; donde se ha considerado necesario) y permite (desde
luego) jugar en red. </P>

<P>
Resumiendo, el objetivo de los jugadores es conducir a su naci&oacute;n desde
una tribu de trashumantes hasta una poderosa civilizaci&oacute;n fundando
ciudades, transformando el paisaje, investigando, comerciando o luchando
contra otras civilizaciones. Bueno, siendo honesto, la &uacute;nica meta
es eliminar a todos los contrincantes "unificando" as&iacute; el mundo.
Las unidades terrestres, a&eacute;reas o mar&iacute;timas son las encargadas
de luchar, comerciar o transformar el paisaje. Cada unidad tiene una
cantidad de puntos de movimiento, de ataque y de defensa, as&iacute; como
un estado de los da&ntilde;os recibidos. FreeCiv es un juego basado en
turnos, pero todos los jugadores juegan sus turnos en paralelo. Los jugadores
que hayan terminado su turno deben esperar a que terminen el resto.
Una vez que el &uacute;ltimo jugador ha finalizado su turno o se ha alcanzado
el tiempo m&aacute;ximo de turno el siguiente turno comienza.
</P>

<P>
Creo que FreeCiv es uno de los mayores proyectos de juegos para Unix.
Se ha trabajado mucho para hacer este juego tan adictivo. Tiene unos
gr&aacute;ficos agradables y un sistema f&aacute;cil de manejo.
El juego en s&iacute; consiste en dos programas, un servidor (civserver)
que es el responsable de la creaci&oacute;n del juego y <I>civclient</I>,
el programa que ejecuta el usuario para poder jugar. Antes de que puedas
jugar te tienes que conectar a un servidor con el cliente, ya sea a uno
local o a uno en cualquier lugar de la red.
</P>

<center><IMG SRC="../../common/images/article117/freecivpic1.gif"></center>
<A NAME="lfindex1">&nbsp;</A>
<H2>Requisitos</H2>


<P>
Para compilar y/o ejecutar el programa, se requiere que tengas instalado
cierto software. El archivo <TT>INSTALL</TT> de FreeCiv cita los siguientes
requisitos:
</P>

<p>
<center>
<tbody>
<tr>
  <td bgcolor="#ddaa66"><center><b>civserver</b></td>
</tr>
<tr>
  <td bgcolor="#ffdd99">
  <ul>
   <li>Unix o un entorno estilo Unix
   <li>Un compilador de C ANSI - si quieres construirlo partiendo del fuente.
   <li>El programa 'make' <p>
  </ul>
 </td>
</tr>
</table>
</center>

<P>
Desde luego el cliente tambi&eacute;n necesita los programas anteriores.
Adem&aacute;s se debe instalar el siguiente software:
</P>

<p>
<table border=0>
<tbody>
<tr>
 <td colspan=2 bgcolor="#ddaa66"><center><b>civclient</center></b>
 </td>
</tr>
<tr>
 <td bgcolor="#eecc77"><center><b>Cliente GTK+</b></center></td>
 <td bgcolor="#eecc77"><center><b>Cliente Athena widget</b></center></td>
</tr>
<tr>
 <td bgcolor="#ffdd99">
   <ul>
    <li>X Windows System
    <li>GTK+ widget library, Version 1.2.1 o superior.
    <li>Glib utility library, Version 1.2.1 o superior.
    <li>Imlib graphics library, Version 1.9.2 o superior.<p>
   </ul>
  </td>
 <td bgcolor="#ffdd99">  
  <ul>
   <li>X Windows System
   <li>Athena widget library (Xaw) o la versi&oacute;n con apariencia 3d.
   <li>The XPM library <p>
   </ul></td>
</tr>
</table>
</center>
  
<p>
Como puedes ver, hay dos versiones diferentes del cliente, para dos
presentaciones distintos de X. Desde la versi&oacute;n 1.8.0 (creo),
el cliente GTK es el que viene por defecto. GTK es el entorno de 
presentaci&oacute;n del programa <I>GIMP</I>, tiene una presentaci&oacute;n
moderna y si te es posible instala este. <br>
Pero si no tienes instalados todas las herramientas de GTK o no quieres
instalarlas instala el cliente de Athena. Esta presentaci&oacute;n es
b&aacute;sica y viene en la mayor&iacute;a de&nbsp; distribuciones de X,
es bastante seguro que ya lo tengas instalado. El precio que se debe pagar
por usarlo es que la presentaci&oacute;n ser&aacute; mucho m&aacute;s simple
y austera.
</p>

<center><IMG SRC="../../common/images/article117/freecivpic2.gif"></center>

<A NAME="lfindex2">&nbsp;</A>
<H2>Instalaci&oacute;n</H2>

<p>Hay dos formas de obtener e instalar FreeCiv:
<p>
<ul>
  <li>Archivo binario: Existen varias versiones precompiladas para cada una de
  las distribuciones de Linux. Utiliza la que mejor se adapte a ti. <p>
  <li>C&oacute;digo fuente. Posiblemente ninguna de las versiones
  precompiladas se adaptan bien a tu sistema, o la ultima versi&oacute;n
  de FreeCiv no se encuentra precompilada, o simplemente quieres ver como es
  el c&oacute;digo. En cualquiera de estos casos la versi&oacute;n con el
  c&oacute;digo fuente es la que necesitas. 
</ul>
</p>

<P>
Todos estos archivos se pueden obtener en la p&aacute;gina de FreeCiv
<A HREF="http://www.freeciv.org/">http://www.freeciv.org</A>.

<P>Si decides instalar una versi&oacute;n precompilada lo &uacute;nico que
tienes que hacer es instalarlo como has hecho con el resto de archivos de tu
distribuci&oacute;n.

<P>Para compilar e instalar los fuentes te recomiendo que leas el archivo 
<TT>INSTALL</TT>. En &eacute;l se ven detalladamente el proceso de
instalaci&oacute;n. Si les sigues paso a paso, no deber&iacute;as tener
ning&uacute;n problema. 

<p>De manera breve: </p>

<ul>
 <li>Descomprime el fichero con los fuentes y extrae los ficheros que contiene.
 <li>mu&eacute;vete al directorio con los fuentes.
 <li>ejecuta <TT>./configure</TT>, esto determinar&aacute; como es tu
 sistema y comprobar&aacute; si se encuentra todo el software que necesita.
 Para obtener m&aacute;s informaci&oacute;n de las opciones de
 configuraci&oacute;n ejecuta <TT>./configure --help</TT>. <I>Nota</I>:
 Por defecto se elige el cliente GTK, para cambiar esto utiliza las
 opciones <TT>--with-xaw</TT> o <TT>--with-xaw3d</TT>.
 <li>si todo ha ido bien, ejecuta <TT>make</TT>. 
 <li>si todo ha ido bien, tu puedes instalarlo para todo el sistema
 (&amp;iexcl;tienes que tener privilegios de root!) o ejecutarlo en el
 directorio donde se encuentre los fuentes.
 Si decides instalar FreCiv (y quien no), haz un <TT>su -c
 "make install"</TT>. Introduce la clave de <TT>root</TT>.
 Esto har&aacute; que se instalen todos los archivos del programa en el 
 directorio <TT>/usr/local/share/freeciv</TT> y los ejecutables en el
 directorio <TT>/usr/local/bin</TT>. Para cambiar el directorio donde se
 instalar&aacute;n da un vistazo al archivo <TT>INSTALL</TT>,
 secci&oacute;n 4.
</ul>

<P>Pero &amp;iquest;qu&eacute; es lo que se ha compilado e instalado? 
Evidentemente los dos programas. Estos se deben encontrar en un directorio
que se encuentre en la variable <TT>PATH</TT>, para que as&iacute;
puedas invocarlos sin necesidad de escribir su ruta completa. 
<br>
Adem&aacute;s de los ejecutables hay otra serie de ficheros que FreeCiv
necesita. Los pixmaps para los gr&aacute;ficos y los mapas, los archivos de
reglas para poder jugar, y m&aacute;s. Estos archivos se deben encontrar en
otro directorio que han sido creados al ejecutar <TT>make install</TT>.
<br>
&amp;iexcl;Realmente ya deber&iacute;as ser capaz de iniciar el cliente y
el servidor&amp;iexcl; </P>
<p>
Nota: Algunas distribuciones han separado las librer&iacute;as del estilo de
GTK e Imlib en dos archivos, uno conteniendo las librer&iacute;as para poder
ejecutar los ejecutables, y otro archivo conteniendo los archivos de cabecera
y configuraci&oacute;n para poder compilar programas que los utilicen.
Aseg&uacute;rate de que los dos tipos est&eacute;n instalados cuando intentes
compilar FreeCiv.</p>

<center><img src="../../common/images/article117/freecivpic4.gif"></center>

<A NAME="lfindex3">&nbsp;</A>
<H2>Inicializando el juego</H2>

<p>Como ya he dicho anteriormente, <TT>civserver</TT> se debe estar ejecutando
para que cualquiera se pueda unir y jugar. Todas las opciones de la partida
son controlados por este programa, por ejemplo el tama&ntilde;o del mapa,
el n&uacute;mero de jugadores, el nivel in&iacute;ciala de
investigaci&oacute;n cient&iacute;fica, el tama&ntilde;a m&iacute;nimo para
que una ciudad pueda tener disturbios y muchas m&aacute;s. No importa que tu
quieras jugar una partida con otros o s&oacute;lo contra el ordenador,
en alg&uacute;n lugar debe haber un servidor ejecut&aacute;ndose.
</p>

<p>Si estas participando en una partida en red, simplemente ejecuta el
cliente mediante <TT>civclient</TT>, el resto se describir&aacute;
m&aacute;s tarde, no tienes que preocuparte de cambiar las opciones del
servidor (a menos que hayas sido el que ha iniciado el servidor).
</p>

<p>
Bien, si lo que quieres es iniciar una partida, ya sea para ti
s&oacute;lito o para que jueguen otros humanos. Lo primero que tienes que
hacer es ejecutar <TT>civserver</TT>. Esto iniciar&aacute; el servidor y te
ofrecer&aacute; una l&iacute;nea de comandos para que lo controles. Todas las
opciones se pueden controlar mediante esta l&iacute;nea de comandos.
Para obtener ayuda sobre las distintas opciones de ejecuci&oacute;n del
servidor, ejec&uacute;talo con la opci&oacute;n <TT>--help</TT>. Si quieres
ver las opciones que puedes controlar una vez iniciado el servidor, escribe
<TT>help</TT> en la l&iacute;nea de comandos propia del servidor.
Se pueden a&ntilde;adir o quitar jugadores, hacer que algunos de estos sean
controlados por el ordenador (jugadores <B>I</B>nteligencia<B>A</B>rtifical),
establecer cuan buenos son estos jugadores IA y por &uacute;ltimo empezar
la partida.
</p>

<p>Todas las opciones de la partida (tama&ntilde;o del mapa,...) son
controladas mediante variables cuyos valores pueden cambiarse mediante el
comando <TT>set</TT>, por ejemplo <TT>set xsize 100</TT> establece el
n&uacute;mero de casillas en la direcci&oacute;n horizontal a 100.

<p>En la siguiente lista puedes ver unos <I>pocos</I> comandos y
<I>algunas</I> opciones. Para m&aacute;s informaci&oacute;n, lee el archivo
<TT>README</TT> que viene con FreeCiv.
</P>


<p>
<center>
<table border=0>
<tbody>
<tr>
 <td colspan=2 bgcolor="#ddaa66"><center><b>comandos del servidor</center></b>
 </td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>help</b>
 </td>
 <td bgcolor="#ffdd99">Muestra una lista de los comandos que acepta el servidor
 </td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>explain</b> <i>name</i>
 </td>
 <td bgcolor="#ffdd99">Muestra una breve ayuda sobre el comando
 (u opci&oacute;n) <I>name</I>.</td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>show</b>
 </td>
 <td bgcolor="#ffdd99">Muestra el estado de las opciones de la partida.
  </td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>set</b> <i>var</i> <i>newval</i>
 </td>
 <td bgcolor="#ffdd99">Cambia el valor de la variable <I>var</I> a 
 <I>newval</I>.</td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>create</b> <i>name</i>
 </td>
 <td bgcolor="#ffdd99">crea un nuevo jugador cuyo nombre ser&aacute;
 <I>name</I> en los que la gente se puede conectar.</td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>remove</b> <i>name</i>
 </td>
 <td bgcolor="#ffdd99">Quita al jugador <I>name</I> de la partida.</td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>ai</b> <i>name</i>
 </td>
 <td bgcolor="#ffdd99">Marca o desmarca al jugador <I>name</I> como IA.</td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>easy</b> <i>name</i>
 </td>
 <td bgcolor="#ffdd99">Establece el nivel de dificultad del jugador
  IA <I>name</I>.</td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>quit</b>
 </td>
 <td bgcolor="#ffdd99">Finaliza la partida y apaga el servidor.</td>
</tr>
<tr>
 <td bgcolor="#eecc77"><b>start</b>
 </td>
 <td bgcolor="#ffdd99">Empieza una nueva partida.</td>
</tr>
<tr>
<p>
</tr>
<tr>
 <td colspan=2 bgcolor="#0099dd"><center><b>opciones de partida</center></b>
 </td>
</tr>
<tr>
 <td bgcolor="#0099dd"><b>xsize</b>
 </td>
 <td bgcolor="#00ccff">Tama&ntilde;o del mapa en el eje x en n&uacute;mero
 de casillas.</td>
</tr>
<tr>
 <td bgcolor="#0099dd"><b>ysize</b>
 </td>
 <td bgcolor="#00ccff">N&uacute;mero de casillas en el eje y.</td>
</tr>
<tr>
 <td bgcolor="#0099dd"><b>generator</b>
 </td>
 <td bgcolor="#00ccff">M&eacute;todo para generar el m&aacute;pa
 (para ver m&aacute;s haz un <TT>explain generator</TT>)</td>
</tr>
<tr>
 <td bgcolor="#0099dd"><b>techlevel</b>
 </td>
 <td bgcolor="#00ccff">Nivel inicial de investigaci&oacute;n cient&iacute;fica.</td>
</tr>
<tr>
 <td bgcolor="#0099dd"><b>timeout</b>
 </td>
 <td bgcolor="#00ccff">N&uacute;mero m&aacute;ximo de segundos que puede
 durar un turno.</td>
</tr>
<tr>
 <td bgcolor="#0099dd"><b>maxplayers</b>
 </td>
 <td bgcolor="#00ccff">N&uacute;mero m&aacute;ximo de jugadores.</td>
</tr>
<tr>
 <td bgcolor="#0099dd"><b>settlers</b>
 </td>
 <td bgcolor="#00ccff">N&uacute;mero inicial de Colonos por jugador.</td>
</tr>
</tr>
</table>
</center>

<p>De nuevo, recomiendo ver el archivo <TT>README</TT>, y jugar con las
opciones y comandos del servidor (utiliza <TT>help</TT>, <TT>show</TT> y
<TT>explain</TT>, te pueden ayudar mucho). </p>

<p>Un nota sobre los metaservidores: Existen actualmente dos metaservidores
donde la gente puede registrar sus partidas de FreeCiv. De esta forma la
gente puede buscar partidas abiertas donde se puedan incorporar.
Como FreeCiv no limita el n&uacute;mero de jugadores, se puede hacer partidas
muy interesantes. Para registrarse el servidor proporcina el comando
<TT>metaserver adr</TT>, que notifica al servidor de una partida que se
est&aacute; celebrando en la direcci&oacute;n <TT>adr</TT>.
El comando <TT>meta msg</TT> permite a&ntilde;adir una l&iacute;nea
<TT>msg</TT> como comentario a tu partida. El metaservidor muesta la
informaci&oacute;n sobre las partidas en una p&aacute;gina HTML.
</p>
<center><IMG SRC="../../common/images/article117/freecivpic3.gif"></center>

<A NAME="lfindex4">&nbsp;</A>
<H2>Inicio del juego</H2>

No importa si te vas a conectar a tu propio servidor o a uno que se encuentre
en la red, el siguiente paso para jugar es iniciar el cliente mediante <TT>
civclient</TT>. Esto te mostrar&aacute; la ventana principal as&iacute; como
un cuadro de conexi&oacute;n en el que puedes especificar el servidor al que
te conectas, y el puerto en el que el servidor est&aacute; escuchando (existe
un valor por defecto que es el que debes intentar si no te dicen otra cosa) y
el nombre del jugador. Este &uacute;ltimo es el nombre con el que te quieres
inscribir en el servidor. Este nombre es importante si te tienes que
reconectar una vez empezada la partida, ya sea porque se haya ca&iacute;do
la conexi&oacute;n o por que el acceso al servidor es restringido (se ha
alcanzado el n&uacute;mero m&aacute;ximo de jugadores o los jugadores
est&aacute;n restringidos por el nombre).
El nombre te identifica y te permite unirte a la partida. Esta ventana se
volver&aacute; a mostrar cada vez que tu cliente no est&eacute; conectado a
un servidor. </p>

<p>Una vez registrados tenemos acceso a la ventana principal. Esta ventana
contiene a su vez una serie de ventanas. La m&aacute;s grande contiene el
mapa del mundo. Antes de que comience al partida muestra el logotipo de
FreeCiv. A la derecha hay un peque&ntilde;o mapa para poder tener una vista
m&aacute;s general del mundo en el que se desarrolla el juego, y una serie
de botones y cuadros que muestran informaci&oacute;n sobre ti. La ventana de
abajo contiene un cuadro de conversaci&oacute;n donde todos los jugadores
pueden mandar mensajes al resto (tanto a uno s&oacute;lo como a todos) y donde
se muestran los mensajes enviados a ti. </p>

<p>Una vez que todas las opciones han sido establecidas a los valores que
quiere el que controla el servidor (puede ejecutar <TT>show</TT> para ver los
valores de estas variables), el juego puede comenzar (para ello el que
controla el servidor ejecuta <TT>start</TT>). Ahora cada jugador selecciona
su civilizaci&oacute;n y el nombre de su jefe. Cada civilizaci&oacute;n
s&oacute;lo puede ser seleccionada por un jugador. </p>

<center><IMG SRC="../../common/images/article117/freecivpic5.gif"></center>

<A NAME="lfindex5">&nbsp;</A>
<H2>El mundo</H2>

<p>Dependiendo de las opciones del servidor, el mundo es generado con un
n&uacute;mero diferente de islas,&nbsp; conteniendo un n&uacute;mero de
jugadores en cada uno de ellas, y con diferentes tipos de terrenos. Cada uno
de los terrenos, desde polares a llanos, desde monta&ntilde;as a desiertos,
proporcionan una cierta cantidad de comida, recursos y comercio, lo cual
afectar&aacute; al crecimiento y tama&ntilde;o de las ciudades que construyas
en ellos. </p>

<p>Tu gobierno, que est&aacute; formado por ciudades, puede ser gobernado de
distintas formas. Hay diferentes tipos de gobiernos, desde la Anarqu&iacute;a
a la Democracia pasando por el Comunismo. Cada uno de ellos tiene su serie
de ventajas y limitaciones.&nbsp; Por lo que eres t&uacute; el que debe
decidir cual se ajusta mejor a tu situaci&oacute;n actual. </p>

<p>Tu cantidad de dinero es limitada as&iacute; que tienes que decidir cuanto
gastas en ciencia, cuanto en diversiones para el pueblo y cuanto ahorras en
impuestos. Tu elecci&oacute;n afectar&aacute; a los avances que descubra
tu civilizaci&oacute;n, a lo contentos que tengas a tus ciudadanos y a la
cantidad de dinero que contenga el tesoro. </p>

<p><center><A HREF="/common/images/article117/freecivfig1.jpg">
<IMG SRC="../../common/images/article117/freecivfig1_s.gif"></A><BR>
Ventana Principal de FreeCiv</center></P>

<p>Nota acerca de las &aacute;reas negras en la ventana de juego: Eso es
<I>terra incognita</I>, es decir territorio que todav&iacute;a no has
descubierto. Como ya hemos dicho, puedes mandar mensajes al resto de
jugadores, para ello utiliza el cuadro de texto que hay al fondo.
Para mandar un mensaje privado, empieza la l&iacute;nea de texto con el
nombre del jugador que quieres mandar el mensaje, seguido por dos puntos.
</p>

<center><IMG SRC="../../common/images/article117/freecivpic6.gif"></center>

<A NAME="lfindex6">&nbsp;</A>
<H2>Ciudades</H2>

<p>Como hemos dicho antes tu imperio esta formado por ciudades. Es tu labor
el fundar nuevas ciudades, el conquistar las de otros jugadores, el ayudarlas
para que crezcan, y el mantener a sus ciudadanos contentos.</p>

<p>Cada ciudad utiliza las casillas situadas a su alrededor para obtener
comida, recursos, comercio y dinero. Tienes que irrigar las llanuras,
construir minas en las monta&ntilde;as, construir carreteras, para poder
aprovechar al m&aacute;ximo cada casilla. Ten en cuenta que cada casilla
s&oacute;lo puede ser usada por una ciudad, as&iacute; que ten cuidado a
la hora de fundar ciudades, no sea que se limiten el crecimiento. </p>

<center><A HREF="/common/images/article117/freecivfig2.jpg">
<IMG SRC="../../common/images/article117/freecivfig2_s.gif"></A><BR>
Venta de ciudad</center></p>

<p>Puedes aumentar la investigaci&oacute;n, los impuestos o las diversiones
transformando a ciudadanos normales en especialistas en esos temas. Pero ten
en cuenta que entonces abandonaran sus tareas habituales lo cual
reducir&aacute; en la producci&oacute;n de comida, recursos, comercio...
As&iacute; que ten cuidado con lo que haces y lo que quieres. </p>

<p>Una ciudad s&oacute;lo podr&aacute; seguir creciendo hasta ciertos niveles
si se han construido en ella determinados edificios. Un tipo especial de
construcciones - Las Maravillas- te dan habilidades especiales si las
construyes. Cada Maravilla s&oacute;lo puede ser construida una vez y por
un s&oacute;lo jugador. Los edificios normales tiene un gasto de
mantenimientos que debes pagar cada turno si es que quieres conservarlos. </p>

<p>De vez en cuando los ciudadanos se cabrean, o incluso organizan motines.
Puedes restaurar el orden aumentando el n&uacute;mero de animadores,
construyendo determinados edificios o aumentando el n&uacute;mero de
tropas acuarteladas en la ciudad. </p>

<p>La construcci&oacute;n se realiza mediante los recursos adquiridos en las
casillas que rodean la ciudad. Cada turno esos recursos se pasan a la
producci&oacute;n de edificios o unidades. Normalmente suele llevar
m&aacute;s de un turno el terminar una construcci&oacute;n. Esto se puede
acelerar dando dinero para que se termine la construcci&oacute;n (la cantidad
depende de lo avanzada que este la construcci&oacute;n). </p>

<p>La comida es necesaria para prevenir que la gente se muera de hambre y
para mantener el crecimiento de la poblaci&oacute;n. Si las casillas de la
ciudad son pobres, o si esas casillas son abandonadas para producir
cient&iacute;ficos o animadores, la ciudad puede verse sin comida, y la gente
empezar a morir. </p>

<center><IMG SRC="../../common/images/article117/freecivpic7.gif"></center>

<A NAME="lfindex7">&nbsp;</A>
<H2>Unidades</H2>


<p>Las acciones fuera de las ciudades son realizadas por unidades, ya sean
terrestres, mar&iacute;timas o a&eacute;reas. Casi todas estas unidades son
unidades de combate, para proteger a tu civilizaci&oacute;n y para ocupar
ciudades extranjeras. Cada unidad tiene una serie de puntos para atacar y
defenderse, adem&aacute;s de puntos de movimientos y de da&ntilde;os
soportados. </p>

<p>Las unidades se construyen en las ciudades, lo mismo que los edificios.
Adem&aacute;s consumen comida y/o recursos, dependiendo del n&uacute;mero de
unidades que mantiene la ciudad y del actual sistema de gobierno. </p>

<p>Las unidades se mueven mediante las flechas del teclado, o asignando
un destino. En este &uacute;ltimo caso ser&aacute; el ordenador el que las
mueva cada turno, hasta que se llega al destino, se encuentra una unidad
enemiga o decides mover la unidad por ti mismo. </p>

<p>Los ataques se realizan moviendo las unidades de ataque sobre las que
defienden. Dependiendo de los valores de ataque y defensa, de los puntos de
da&ntilde;os y del terreno donde se desarrolle el combate, una de las dos
unidades ser&aacute; destruida. Si la unidad defensora es destruida y hay
m&aacute;s de una unidad en la misma casilla &amp;iexcl;todas la unidades
ser&aacute;n destruidas! </p>

<p>El atacar una ciudad es un poquito diferentes. Tienes que destruir todas
las unidades que hay en la ciudad una a una. Esto puede ser dif&iacute;cil
ya que las tropas que est&aacute;n en la ciudad aumenta su capacidad de
defensa. Adem&aacute;s el terreno en el que est&eacute; construida la ciudad
puede aumentar la capacidad de defensa, y determinadas construcciones aumentan
el poder de defensa de las unidades. 
Cada vez que una unidad defensora es destruida dentro de la ciudad la
poblaci&oacute;n disminuye (a menos que la ciudad tenga murallas). </p>

<p>Hay todo tipo de unidades: lanceros, caballeros, mosqueteros, fragatas,
bombarderos, cazas, bombas nucleares y un mont&oacute;n m&aacute;s.
Las unidades a&eacute;reas (excepto los helic&oacute;pteros) deben volver a
una ciudad, un portaaviones o una base a&eacute;rea antes de que se le acaben
los puntos de movimientos. </p>

<p>Pero una de las unidades m&aacute;s importantes no es de combate, son los
colonos (o m&aacute;s tarde los ingenieros). Los colonos pueden fundar
ciudades, transformar terrenos, irrigar o hacer minas, construir carreteras,
construir fortificaciones y pueden limpiar terrenos contaminados (ya sea por
las industrias de la ciudad o por una explosi&oacute;n nuclear).
Siempre tendr&aacute;s necesidad de ellos, as&iacute; que se cuidadoso con
ellos. Los colonos se construyen como el resto de unidades, pero son
reclutados del resto de poblaci&oacute;n por lo que la decrecen.
</p>

<center><IMG SRC="../../common/images/article117/freecivpic8.gif"></center>

<A NAME="lfindex8">&nbsp;</A>
<H2>Ciencia</H2>


<p>Solo puedes construir unidades y edificios que te permitan el nivel de
conocimientos que tengas actualmente. Lo mismo ocurre con los tipos de
gobierno. Si tus cientificos se estancan lo mismo le pasar&aacute; a tu
civilizaci&oacute;n mientras el resto seguir&aacute;n creciendo
construyendo ciudades mayores y nuevas armas. </p>

<p><center><IMG SRC="../../common/images/article117/freecivfig4.jpg"><br>
Ventana de investigaci&oacute;n</center></p>

<P>Los nuevos descubrimientos se adquieren gastando dinero en la 
investigaci&oacute;n y construyendo determinados edificios en las
ciudades. Tambi&eacute;n puedes intercambiar (o robar) descubrimientos
con otras civilizaciones. A la hora de decidir que tipo de descubrimiento
debes descubrir pr&oacute;ximamente debes tener en cuenta que es lo que vas
a necesitar en el futuro. Puedes ver un resumen de los descubrimientos en
el men&uacute; help, donde puedes ver que descubrimientos necesitas para 
poder construir una determinada unidad o edificio. </p>

<center><IMG SRC="../../common/images/article117/freecivpic9.gif"></center>

<A NAME="lfindex9">&nbsp;</A>
<H2>Diplomacia</H2>

<p>Desde luego puedes intentar luchar contra todos los jugadores, puedes
intentar explorar todos los mares y tierra por tu cuenta, puedes intentar
descubrir todo la cienta por tu cuenta... desde luego es una posibilidad.
Pero siempre es mejor intentar tener un par de amigos en este mundo tan #%@%$.
Os podeis ayudar a la hora de luchar contra un enemigo com&uacute;n, compartir
mapas de regiones o descubrimientos que todav&iacute;a no conoces, pero tus
amigos s&iacute; y puedes comerciar con ellos. La diplomacia es algo sin lo
que no se puede vivir, sobretodo si juegas con un moton de jugadores. </p>

<p>La diplomacia requiere que establezcas una embajada en el otro lado. 
Eso se hace mediante los diplomaticos, una unidad especial. Pero los
diplomaticos pueden hacer algo m&aacute;s que fundar embajadas.
Puedes intentar sobornar unidad enemigas, robar conocimientos, sabotear la
producci&oacute;n de una ciudad, o promover revueltas en una ciudad de forma
que esa ciudad se pase a tu bando, &amp;iquest;no es maravillosa la
diplomac&iacute;a? :-) </p>

<center><IMG SRC="../../common/images/article117/freecivpic10.gif"></center>

<A NAME="lfindex10">&nbsp;</A>
<H2>Estad&iacute;sticas y ayuda</H2>

<p>Los men&uacute;s adem&aacute;s de dar ordenes te permiten obtener
informaci&oacute;n acerca de tu civilizaci&oacute;n y su lugar en el mundo,
adem&aacute;s de informaci&oacute;n acerca de las unidades, edificios,
tipos de terreno y mucho, mucho m&aacute;s. Pueden ser muy &uacute;til a la
hora de hacer planes o iniciar una guerra.</p>

<p><center><IMG SRC="../../common/images/article117/freecivfig3.jpg"><BR>
Estad&iacute;sticas</center></P>

<P>Tambi&eacute;n deber&iacute;as ver la estad&iacute;sticas. Es una forma de
descubrir que estas haciendo mal (si est&aacute;s situado muy atr&aacute;s con
respecto a otros jugadores en uno o varios campos). </P>

<center><IMG SRC="../../common/images/article117/freecivpic11.gif"></center>

<A NAME="lfindex11">&nbsp;</A>
<H2>Cambiar los gr&aacute;ficos y las reglas</H2>


<p>
Es posible cambiar el aspecto de tus unidades y del mapa. Los archivos 
est&aacute;n en el directorio de datos mencionado anteriormente. De esta
forma tu juego puede tener la apariencia que tu quieras. 
Si hay cosas que no te gustan del juego, no hay problema, puedes cambiar 
ciertas reglas del juego a como a ti te gusten. Para m&aacute;s
informaci&oacute;n de como cambiar los gr&aacute;ficos y reglas hecha un
vistazo a los archivos <TT>README.graphics</TT> y <TT>README.rulesets</TT>.
</p>

<p>
Una cosa acerca de los archivos especificados: Esos archivos viene en el
archivo con el c&oacute;digo fuente de FreeCiv. No s&eacute; si tambi&eacute;n
est&aacute;n incluidos en el archivo binario.&nbsp;Si no, tendr&aacute;s que
obtenerlos de la p&aacute;gina web o del archivo fuente.</p>

<center><IMG SRC="../../common/images/article117/freecivpic12.gif"></center>
<A NAME="lfindex12">&nbsp;</A>
<H2>Y al final...</H2>

<P>Desafortunadamente este art&iacute;culo s&oacute;lo da una peque&ntilde;a
visi&oacute;n de FreeCiv. Hay un mont&oacute;n de cosas por descubrir y una
gran cantidad de formas&nbsp; Espero que hayas obtenido una primera
impresi&oacute;n de la complejidad de este juego, algo que a los les gusten
los juegos de estrategia les gustar&aacute;. Por otro lado no es demasiado
complejo por lo que lo dominar&aacute;s despu&eacute;s de unas pocas partidas.
&nbsp; Lo mejor que puedes hacer es echar un vistazo a los archivos, leer
unos pocos documentos y jugar con &eacute;l. </P>

<P>Yo mismo he gastado muchas, muchas horas jugando a FreeCiv. 
Desafortunadamente mi &eacute;poca de estudiante se acab&oacute;, y con ella 
la conexi&oacute;n permanente a Internet. Ahora tengo que usar la vieja
l&iacute;nea telef&oacute;nica lo cual es bastante m&aacute;s caro.
Pero te aseguro que FreeCiv es un juego que puedes jugar tanto contra la IA 
como contra otros humanos. Partidas de FreeCiv con gente llevando sus
ordenadores de casa en casa para conectarlos son frecuentes, as&iacute;
que ten cuidado es un juego muy adictivo :-)</P>

<center><IMG SRC="../../common/images/article117/freecivfig5.jpg"></center>

<p>&amp;iquest;Qu&eacute; es lo que nos deparar&aacute; el futuro para
FreeCiv? Bien, hay todav&iacute;a trabajo que hacer para los programadores.
Hay trabajo que hacer en el mismo juego, a&ntilde;adir m&aacute;s
caracter&iacute;sticas, incluso extender algunas caracter&iacute;sticas de
CivII. Adem&aacute;s los gr&aacute;ficos pueden ser mejorados, algunas
animaciones y dibujos ser&iacute;an un fest&iacute;n para los ojos.
Probablemente la forma de mostrar el mundo debe cambiar desde la prespectiva
2D a una isom&eacute;trica 3D. Actualmente no soporta ni m&uacute;sica ni
sonidos. Si tiene curiosidad sobre lo que nos deparar&aacute; FreeCiv
hecha un vistazo a la p&aacute;gina web. </p>
<center><IMG SRC="../../common/images/article117/freecivpic13.gif"></center>
<A NAME="lfindex13">&nbsp;</A>
<H2>Referencias</H2>


<UL>
<LI>La <A HREF="http://www.freeciv.org/">P&aacute;gina web</A> de FreeCiv </LI>
<LI>La <A HREF="http://www.freeciv.org/download.phtml">P&aacute;gina</A> donde obtener los programas</LI>
<LI>Los Metaservidores de FreeCiv: el <A HREF="http://www.freeciv.org/metaserver/">nuevo</A> y el <A HREF="http://www.daimi.aau.dk/~lancelot/freeciv.html">viejo</A></LI>
<LI>El <A HREF="http://www.freeciv.org/manual/manual.html">Manual</A>  de FreeCiv </LI>
<LI>Algunos <A HREF="http://www.freeciv.org/tutorials/tutorials.phtml">Tutoriales</A> </LI></UL>

<A NAME="lfindex14">&nbsp;</A>
<H2>Internacionalizaci&oacute;n</H2>


<I>Nota del traductor</I> Toda est&aacute; secci&oacute;n ha sido escrita
por mi mismo y no aparece en el art&iacute;culo original.<br>

La &uacute;ltima versi&oacute;n de FreeCiv es la 1.9. Respecto a la
versi&oacute;n analizada en este art&iacute;culo trae algunas mejoras, entre
ellas:

<ul>
 <li> Se han mejorado de los gr&aacute;ficos.
 <li> Se han a&ntilde;adido m&aacute;s civilizaciones.
 <li> Se ha ampliado el sistema de reglas.
 <li> Se ha procedido a la internacionalizaci&oacute;n.
</lu>

<p> Esta &uacute;ltima mejora es la que justifica el que se haga este
a&ntilde;adido al art&iacute;culo. La internacionalizaci&oacute;n es el
proceso de preparar un programa para que todos los mensajes que muestra
puedan verse en distintos idiomas. </p>

<p> Por ejemplo si descargas la nueva versi&oacute;n de FreeCiv y estableces
el valor de la variable <TT>LANGUAGE</TT> a <TT>ES</TT> todos los mensajes
de FreeCiv aparecer&aacute;n en espa&ntilde;ol (o mejor dicho cas&iacute;
todos ya que no se ha completado la traducci&oacute;n de todos los mensajes a
espa&ntilde;ol); si a esa variable la das el valor de <TT>DE</TT> todos los
mensajes aparecer&aacute;n en alem&aacute;n y as&iacute; con todos los
idiomas a los que est&aacute; traducido FreeCiv. (<I>Nota</I>: Para cambiar
el valor de la variable <TT>LANGUAGE</TT> con el bash ejecutar: <TT>set
LANGUAGE=ES; export LANGUAGE</TT>. Con el csh <tt>setenv LANGUAGE ES</tt>).
</p>

<p> La traducci&oacute;n al espa&ntilde;ol no est&aacute; todav&iacute;a
terminada. Si alguien quiere colaborar en ella (estar&iacute;a muy
agradecido por ello :-) por favor que contacte <A
HREF="mailto:dperezs@nexo.es">conmigo</A>. Tambi&eacute;n agradecer&iacute;a
cualquier colaboraci&oacute;n para hacer la traducci&oacute;n lo m&aacute;s
estandar posible, de forma que sea entendida por todos los que hablan
castellano en el mundo.</p>

<!-- vim: set sw=2 ts=2 et: -->



<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Harald Radke <BR>LinuxFocus 1999</FONT></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:harryrat@gmx.de"><FONT COLOR="#FFFFFF">Harald Radke</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:dperezs@nexo.es"><FONT COLOR="#FFFFFF">David P&eacute;rez Serrada</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>1999-11-15, generated by lfparser version 0.6</font></p></BODY></HTML>
