<HTML>
<HEAD>
<TITLE>``Infobia''- Como. : Gesti&oacute;n de Correo de Internet.</TITLE>
</HEAD>
<BODY>
<A HREF="Infobia-Como-4.html">Anterior</A>
<A HREF="Infobia-Como-6.html">Siguiente</A>
<A HREF="Infobia-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Gesti&oacute;n de Correo de Internet.</A></H2>


<P>A continuaci&oacute;n describir&eacute; dos m&eacute;todos para gestionar el correo en el caso
que nos ocupa, una m&aacute;quina aislada, con conexiones espor&aacute;dicas a su
Servidor de Acceso a Internet. El m&eacute;todo B es desde luego, poco ortodoxo y
se puede mejorar mucho, por lo que una colaboraci&oacute;n en lo que a
configuraciones ``ideales'' de red de este tipo de m&aacute;quinas ser&aacute; harto
agradecida.</P>

<H2><A NAME="ss5.1">5.1 M&eacute;todo ``A'' o f&aacute;cil y <EM>g&uuml;indosero</EM> ;-).</A></H2>


<P>Instalar, usar y configurar Netscape, Mosaic u otro navegador con
capacidad de gestionar correo, news, etc. </P>
<P>Como me consta que la inmensa mayor&iacute;a de los que empiezan a usar Linux o
bien no poseen una cantidad desmesurada de RAM, ni les sobra disco duro
como para sacrificar m&aacute;s de 6 megas en el Netscape, y adem&aacute;s desean
aprender a usar m&eacute;todos m&aacute;s *nixeros y eficaces de gesti&oacute;n de correo,
propongo el siguiente (m&aacute;s f&aacute;cil de configurar incluso que el netscape)
m&eacute;todo: </P>


<H2><A NAME="ss5.2">5.2 M&eacute;todo ``B''.</A></H2>



<H3>Requisitos</H3>


<P>
<OL>
<LI><B>Popclient.</B> Se precisa instalar el paquete Popclient. En caso de
que la versi&oacute;n de &eacute;ste use <CODE>perl</CODE>, se deber&aacute; instalar este &uacute;ltimo
tambi&eacute;n.
</LI>
<LI>popclient se ha quedado desfasado &uacute;ltimamente, siendo <CODE>fetchmail</CODE>
el que m&aacute;s se emplea ahora por ser m&aacute;s seguro. 
</LI>
<LI><B>Sendmail+IDA</B>. No, no os asust&eacute;is ;-) El <CODE>sendmail+IDA</CODE>, que 
viene en la inmensa mayor&iacute;a de las distribuciones, lo tendremos configurado 
con editar dos l&iacute;neas.</LI>
</OL>
</P>

<H3>Configuraci&oacute;n del sistema.</H3>


<P>
<OL>
<LI>Crear una cuenta en la m&aacute;quina con el mismo identificativo que se
tenga en el Proveedor. Por ejemplo, mi identificativo o <EM>login</EM> en mi
ISP es <CODE>pacopepe</CODE>, cosa f&aacute;cilmente deducible debido a mi direcci&oacute;n de
correo <EM>email</EM>;  por tanto, creo una cuenta en el sistema con login
<CODE>pacopepe</CODE>, con el comando <CODE>adduser</CODE>: (por supuesto, hay que hacerlo
como <CODE>root</CODE>). 

Supongamos el login ``<CODE>probancio</CODE>'':

<BLOCKQUOTE><CODE>
<PRE>
 /home/linuxdoc-sgml-1.5/working]# adduser probancio

Looking for first available UID... 502
Looking for first available GID... 502

Adding login: probancio...done.
Creating home directory: /home/probancio...done.
Creating mailbox: /var/spool/mail/probancio...done.

Don't forget to set the password.
</PRE>
</CODE></BLOCKQUOTE>


ahora, le asignamos un password:

<BLOCKQUOTE><CODE>
<PRE>
 /home/linuxdoc-sgml-1.5/working]# passwd probancio
Changing password for probancio
Enter an empty password to quit.
New password (? for help):
New password (again):
Password changed for probancio
</PRE>
</CODE></BLOCKQUOTE>


y tenemos creada su cuenta.</LI>
</OL>
</P>

<H3><CODE>popclient</CODE></H3>


<P>
<OL>
<LI>Ahora creamos el siguiente script, que ser&aacute; el que ejecutemos para
recoger el correo, al que llamamos, por ejemplo, <BR><CODE>/usr/local/bin/getmail</CODE>

<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh
#
# getmail, para bajarnos el correo...
#
PATH=/bin:/usr/bin:/usr/local/bin
echo Bajando el correo.....
popclient -3 -u &lt;nombre_usuario&gt; -p &lt;password_del_ISP&gt; -o /var/spool/mail/login &lt;servidor_POP&gt;
</PRE>
</CODE></BLOCKQUOTE>


Dado que este fichero contiene datos delicados como las passwords del ISP,
lo protegeremos d&aacute;ndole los permisos adecuados (<CODE>700</CODE> es lo
recomendable). 

Donde en:

<DL>

<DT><B>&lt;nombre_usuario&gt;</B><DD><P>pondremos nuestro identificativo, en mi
caso, <CODE>pacopepe</CODE>.</P>

<DT><B>&lt;password_del_ISP&gt;</B><DD><P>Pues exactamente eso, la clave con la
que accede a su servidor. </P>

<DT><B>&lt;...login&gt;</B><DD><P>Como se observar&aacute; tras crear la cuenta que
describimos anteriormente, en <CODE>/var/spool/mail/</CODE> se crear&aacute; un
fichero de igual nombre que el <EM>login</EM> de dicho usuario; en el caso
supuesto anterior, <CODE>probancio</CODE>, este fichero ser&iacute;a
<CODE>/var/spool/mail/probancio</CODE>. </P>

<DT><B>&lt;servidor_POP&gt;</B><DD><P>Aqu&iacute; ha de ponerse la direcci&oacute;n de vuestro
servidor POP; en mi caso (y suele ser com&uacute;n) <CODE>pop03.insflug.org</CODE>. </P>
</DL>


<B>Nota:</B> Al elaborar el script prescindiremos de los signos ``&lt;'' y
``&gt;''; en el ejemplo est&aacute;n simplemente para resaltar los par&aacute;metros a 
completar.

Juan Manuel Villar Navarro <CODE>
<A HREF="mailto:juanma@gaps.ssr.upm.es">juanma@gaps.ssr.upm.es</A></CODE>
apunta que en las versiones <CODE>3.xx</CODE> del <CODE>popclient</CODE> no se puede dar
por l&iacute;nea de comandos la contrase&ntilde;a del ISP, (con <CODE>-p</CODE>) para ello ha de
usarse el fichero <CODE>~/.poprc</CODE>, en el que podemos definir otros
par&aacute;metros de comportamiento, como el que mantenga los mensajes en el
servidor (<CODE>keep</CODE>) en caso de que estemos de pruebas, o por cualquier
otra raz&oacute;n.

I&ntilde;igo Gonz&aacute;lez <CODE>
<A HREF="mailto:nexus@adv.es">nexus@adv.es</A></CODE> recomienda usar versiones del <CODE>popclient</CODE>
superiores a la <CODE>3.0b6</CODE>, adem&aacute;s de sugerir el uso de un programa
filtrador de correo como <CODE>procmail</CODE>, para lo que deberemos a&ntilde;adir al
comando <CODE>getmail</CODE> el par&aacute;metro <CODE>-m procmail</CODE>.</LI>
</OL>
</P>

<H3><CODE>fetchmail</CODE></H3>


<P>En caso de usar fetchmail, un cliente muy potente y cuya documentaci&oacute;n
es bastante clara y precisa, la configuraci&oacute;n personal se almacena en el
fichero del directorio personal del usuario,
<CODE>~/.fetchmailrc</CODE>.</P>
<P>Un ejemplo del mismo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
poll host-servidor-pop proto pop3 user usuario password pass_usuario is usuario here;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>donde </P>
<P>
<DL>
<DT><B>host-servidor-pop</B><DD><P>ser&iacute;a el nombre del la m&aacute;quina servidora de correo
v&iacute;a pop del proveedor que utilicemos;</P>
<DT><B>pop3</B><DD><P>ser&iacute;a el protocolo a emplear, ya que <CODE>fetchmail</CODE> soporta
otros tambi&eacute;n, como <I>pop2</I> (obsoleto) <I>imap2bis</I> <I>imap4</I> y
<I>apop</I> y <I>kpop</I>.</P>
</DL>
</P>
<P>seguidamente, le otorgaremos permisos de lectura/escritura &uacute;nicamente para
el propietario, hecho muy importante, ya que de lo contrario podr&iacute;an ser
accesibles las contrase&ntilde;as, e incluso el programa  se
negar&iacute;a a funcionar:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
chmod 600 .fetchmailrc
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><CODE>fetchmail</CODE> ofrece una serie de prestaciones adicionales, como
temporizaci&oacute;n, reenv&iacute;o, funcionamiento en modo <I>daemon</I> etc... Es un
cliente muy potente y recomendable en cuanto a seguridad se refiere. </P>
<P>En caso de emplearlo, no har&iacute;a falta el <I>script</I> <CODE>getmail</CODE>, bastar&iacute;a
con invocar a <CODE>fetchmail</CODE> a secas.</P>

<H3><CODE>sendmail</CODE></H3>


<P>
<OL>
<LI>Modificaci&oacute;n de la llamada al demonio <CODE>sendmail</CODE>, hecha
normalmente en el arranque desde el script
<CODE>/etc/rc.d/init.d/sendmail.init</CODE>, (RedHat) o
<CODE>/etc/rc.d/rc.M</CODE> (Slackware) buscar la l&iacute;nea que dice algo as&iacute; como
<CODE>daemon sendmail ....</CODE> en RedHat, o <CODE>/usr/sbin/sendmail -bd -q
15m</CODE> en Slackware, y modificarla, edit&aacute;ndola para que quede: 

<BLOCKQUOTE><CODE>
<PRE>
[...]
        .... sendmail -bd -q2d
[...]
</PRE>
</CODE></BLOCKQUOTE>


Esto lo que hace es que <CODE>sendmail</CODE> no intente continuamente mandar el
correo que haya <EM>en la cola</EM> para salir, o en <EM>spool</EM>, ya que lo
haremos nosotros manualmente. 

Si no hacemos esto veremos que al enviar un email estando desconectados,
el programa donde estemos (el <CODE>pine</CODE>, por ejemplo) se quedar&aacute;
``congelado'' un buen rato, debido a que sendmail intentar&aacute; enviar
inmediatamente el email, y no encontrar&aacute; el destino, hasta que finalmente
se produzca un <EM>timeout</EM>.
</LI>
<LI>Modificaci&oacute;n de <CODE>/etc/sendmail.cf</CODE>. Aqu&iacute; buscaremos una l&iacute;nea
que comienza por <CODE>DS</CODE>: 

<BLOCKQUOTE><CODE>
<PRE>
# &quot;Smart&quot; relay host (may be null)
# DS
</PRE>
</CODE></BLOCKQUOTE>


y la modificaremos para que quede reflejado nuestro servidor SMTP o de
correo saliente: (en mi caso, <CODE>smtp.insflug.org</CODE>): 

<BLOCKQUOTE><CODE>
<PRE>
# &quot;Smart&quot; relay host (may be null)
DSsmtp.insflug.org
</PRE>
</CODE></BLOCKQUOTE>


ahora buscaremos otra que comienza por <CODE>DM</CODE>:

<BLOCKQUOTE><CODE>
<PRE>
# who I masquerade as (null for no masquerading)
# DM
</PRE>
</CODE></BLOCKQUOTE>


y la modificamos para que refleje el dominio de nuestra direcci&oacute;n de correo, 
en mi caso <CODE>insflug.org</CODE>:

<BLOCKQUOTE><CODE>
<PRE>
# who I masquerade as (null for no masquerading)
DMinsflug.org
</PRE>
</CODE></BLOCKQUOTE>


Con esto, lo que hemos hecho es b&aacute;sicamente, "enmascarar" nuestra
direcci&oacute;n en la m&aacute;quina propia; supongamos que nuestra m&aacute;quina se llama
<CODE>beastie.insflug.org</CODE> y enviamos un mensaje sin la modificaci&oacute;n
anterior; el mensaje llegar&aacute; correctamente a su destino, pero no podr&aacute; ser
respondido, ya que la direcci&oacute;n de retorno no existir&aacute;, al figurar la de
nuestra propia m&aacute;quina, que en nuestro caso ficticio ser&iacute;a
<CODE>probancio@beastie.insflug.org</CODE>, en lugar de la de la cuenta de nuestro
ISP, que es <CODE>probancio@insflug.org</CODE>. 

Realmente, lo &uacute;nico que enmascaramos es el dominio, de ah&iacute; la necesidad de
crear una cuenta en nuestra m&aacute;quina con el mismo login que en nuestro ISP
(<CODE>probancio</CODE> en este caso); la l&iacute;nea <CODE>DS...</CODE> hace que sendmail rute
todos los mensajes salientes hacia internet a trav&eacute;s de nuestro servidor
SMTP, que hace de servidor de <I>relevo</I> hacia internet.  Podr&iacute;amos no
decirle nada, y dejar que se encargara de contactar y enviar directamente
con el servidor de correo entrante de cada direcci&oacute;n, pero eso har&iacute;a m&aacute;s
lento el env&iacute;o de los correo, adem&aacute;s de que es mucho m&aacute;s r&aacute;pida la
transferencia con nuestro ISP, al no tener que salir a internet siquiera.

<CODE>DM...</CODE> cambia los <CODE>from</CODE> de nuestros mensajes por nuestra verdadera
direcci&oacute;n en el ISP.  </LI>
</OL>
</P>

<H3>C&oacute;mo escribir</H3>


<P>Para responder o escribir nuestro correo podremos usar cualquier programa
escritor de correo, los simples como <CODE>mail</CODE> o <CODE>mailx</CODE>, un poco m&aacute;s
completos como el facil&iacute;simo <CODE>elm</CODE>, o <CODE>pine</CODE>, el modo de correo del
vers&aacute;til <CODE>emacs</CODE>, etc... recordando <B>siempre</B> hacer uso de estos
programas desde la cuenta que creamos para tal fin (la de <CODE>probancio</CODE>
en nuestro caso ficticio). </P>


<H3>Procedimiento.</H3>


<P>
<OL>
<LI>Establecer la conexi&oacute;n <CODE>PPP</CODE> con nuestro servidor, con cualquiera
de los m&eacute;todos descritos en las secciones 
<A HREF="Infobia-Como-4.html#sininfovia">Conexiones sin mediar Infov&iacute;a</A> o 
<A HREF="Infobia-Como-3.html#ConexionesInfobia">Conexiones a trav&eacute;s de Infov&iacute;a</A>. Esto se har&aacute; normalmente como
<CODE>root</CODE>. 
</LI>
<LI>Ejecutar el script <CODE>getmail</CODE> en caso de que queramos recoger el
correo;  en caso de querer mandar el correo pendiente por salir, teclear
la orden: 

<BLOCKQUOTE><CODE>
<PRE>
sendmail -q
</PRE>
</CODE></BLOCKQUOTE>


que ordenar&aacute; a sendmail a enviar el correo. (el par&aacute;metro <CODE>-q</CODE> 
viene de <EM>queue</EM> o la ``cola'' de correo pendiente por salir).
</LI>
</OL>
</P>
<P>Por supuesto, los procedimientos para establecer la conexi&oacute;n y
recoger/mandar correo se pueden automatizar escribiendo scripts sencillos,
pero eso lo dejo ya al gusto y seg&uacute;n las circunstancias de cada uno.
Estar&eacute; encantado de recibirlos, a fin de incluirlos en la pr&oacute;xima versi&oacute;n
de este <EM>COMO</EM>. </P>


<H2><A NAME="ss5.3">5.3 M&eacute;todo ``C''.</A></H2>


<P>Empleando clientes de correo capaces de enmascarar al usuario/dominio,
podemos prescindir de la fase de configuraci&oacute;n del enmascaramiento de
dominio del <CODE>sendmail</CODE>. El cliente de correo
(<I>MUA</I>
<SL><I>Mail User Application</I>, aplicaci&oacute;n de gesti&oacute;n de
correo a nivel usuario)</SL>
 <CODE>mutt</CODE>, puede hacer esto, a nivel
tanto de dominio como de usuario, entre otras muchas prestaciones que
har&aacute;n las delicias de los amantes del modo texto: gesti&oacute;n <CODE>pgp</CODE>
integrada, <I>threads</I>, color... Un cliente muy recomendable. Su servidor
de ftp primario es:</P>
<P><CODE>
<A HREF="ftp://ftp.cs.hmc.edu/pub/me/mutt">ftp://ftp.cs.hmc.edu/pub/me/mutt</A></CODE></P>
<P>Es posible tambi&eacute;n prescindir de la ``<I>chapucilla</I>'' de tener que
emplear el mismo usuario que en el proveedor empleando un
<I>MTA</I>
<SL><I>Mail Tranfer Agent</I>, Agente de Gesti&oacute;n de
transferencia de Correo</SL>
 de configuraci&oacute;n m&aacute;s flexible y c&oacute;moda
que <CODE>sendmail</CODE>, como el prometedor <CODE>qmail</CODE>, f&aacute;cilmente obtenible en
Internet, que adem&aacute;s ofrece muchas otras prestaciones, sin la fragilidad
en cuanto a seguridad de <CODE>sendmail</CODE>, y menos exigente en cuanto a
recursos, lo que le hace ideal para listas de correo..</P>


<HR>
<A HREF="Infobia-Como-4.html">Anterior</A>
<A HREF="Infobia-Como-6.html">Siguiente</A>
<A HREF="Infobia-Como.html#toc5">Indice</A>
</BODY>
</HTML>
