<HTML>
<HEAD>
<TITLE>En Hora mini-COMO: Algunas consideraciones sobre xntpd</TITLE>
</HEAD>
<BODY>
<A HREF="En-Hora-Como-2.html">Anterior</A>
<A HREF="En-Hora-Como-4.html">Siguiente</A>
<A HREF="En-Hora-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Algunas consideraciones sobre <CODE>xntpd</CODE></A></H2>


<P>Su sistema actualmente dispone de dos relojes - el alimentado por la
bater&iacute;a reloj de tiempo real (<EM>real time clock</EM>) que mantiene la
hora cuando el sistema est&aacute; apagado (tambi&eacute;n conocido como el reloj de la
CMOS (<EM>CMOS clock</EM>, <EM>Hardware clock</EM> o <EM>RTC</EM>) y la
hora del n&uacute;cleo (<EM>kernel time</EM> o tambi&eacute;n conocido como <EM>software
clock</EM> o <EM>system clock</EM>)  que est&aacute; basado en interrupciones de
tiempo y que es inicializado con el reloj del CMOS en el momento del
arranque. Ambos relojes pueden diferir en el tiempo que marcan, de hecho
gradualmente difieren uno de otro a medida que pasa el tiempo, y tambi&eacute;n
difieren de la "hora real". </P>
<P>Todas las referencias al "reloj" (<EM>the clock</EM>) en la documentaci&oacute;n
de <CODE>xntpd</CODE> se refieren a la hora del n&uacute;cleo. Cuando ejecute <CODE>xntpd</CODE>
o <CODE>timed</CODE> (o cualquier otro programa que ajusta la llamada del sistema
de adjtimex), el n&uacute;cleo de linux asume que la hora del n&uacute;cleo es m&aacute;s
precisa que el reloj del CMOS, y ajusta el reloj del CMOS cada 11 minutos
(hasta que apague el sistema).  </P>
<P>Esto significa que <CODE>clock</CODE> no sabr&aacute; m&aacute;s cu&aacute;ndo el reloj del CMOS
fue ajustado por &uacute;ltima vez, y no podr&aacute; utilizar el factor de correcci&oacute;n
en <CODE>/etc/adjtime</CODE>.  Puede usar <CODE>ntpdate</CODE> en su archivo de
inicializaci&oacute;n para poner en hora el reloj desde un servidor de tiempo en
red, antes de iniciar <CODE>xntpd</CODE>.  Si no dispone de una fuente de hora
fiable de forma continua cuando arranque la m&aacute;quina, puede ser algo
complicado, ya que <CODE>xntpd</CODE> realmente no ha sido dise&ntilde;ado para ser usado
en situaciones como esta. </P>
<P><CODE>xntpd</CODE> incluye controladores para muchos radio relojes, y puede ser
tambi&eacute;n puesto en hora llamando peri&oacute;dicamente al servicio telef&oacute;nico NIST
(aseg&uacute;rese de calcular el efecto en su cuenta telef&oacute;nica cuando configure
el intervalo entre llamadas). Esto tambi&eacute;n sirve para obtener el factor de
correcci&oacute;n al reloj del n&uacute;cleo si se pierde el contacto con las otras
fuentes de ajuste por un per&iacute;odo largo de tiempo.</P>
<P>La mayor&iacute;a de los radio-reloj cuestan $3-4K, pero puede hacer
planes para tener una "caja negra" (actualmente un m&oacute;dem de 300 baudios) 
que est&eacute; ubicada entre su computador y una radio de onda corta sintonizada
en la estaci&oacute;n de tiempo CHU de Canad&aacute; (vea <CODE>
<A HREF="ftp://ftp.udel.edu/pub.ntp.gadget.tar.Z">ftp://ftp.udel.edu/pub.ntp.gadget.tar.Z</A></CODE>). </P>
<P>El receptor Heatkit WWV (el "reloj m&aacute;s exacto") est&aacute; a&uacute;n disponible
(aunque no como kit), y cuesta alrededor de $4-500. La se&ntilde;al de los
GPS tambi&eacute;n contiene informaci&oacute;n de la hora, y algunos receptores de GPS
pueden ser conectados a un puerto serie.  Esto podr&iacute;a constituir una
soluci&oacute;n de bajo costo en un futuro cercano.</P>
<P>En teor&iacute;a, cualquiera puede escribir un programa para usar los servicios
telef&oacute;nicos de NIST, a fin de calcular la variaci&oacute;n de tiempo entre el
reloj del CMOS y el del n&uacute;cleo autom&aacute;ticamente. No tengo noticia de
ning&uacute;n programa que haga esto por si s&oacute;lo, pero la mayor&iacute;a del c&oacute;digo
podr&iacute;a obtenerse de <CODE>xntpd</CODE>. </P>

<HR>
<A HREF="En-Hora-Como-2.html">Anterior</A>
<A HREF="En-Hora-Como-4.html">Siguiente</A>
<A HREF="En-Hora-Como.html#toc3">Indice</A>
</BODY>
</HTML>
