<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Forum">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Egon Willighagen
 =LF=CAT___: Forum
 =LF=TITLE_: Revisi&oacute;n de libros: "Linux System Administration - A User's Guide" por Marcel Gagn&eacute;
 =LF=NUMBER: 228
 =LF=ANAME_: article228.html
 -->
 <TITLE>lf228, Forum: Revisi&oacute;n de libros: "Linux System Administration - A User's Guide" por Marcel Gagn&eacute;</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/EgonWillighagen.jpg" alt=
    "[Photo of the Author]" height="102" width="79">
<BR>por  Egon Willighagen <br> <small>&lt;egonw(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Obtuvo un master en qu&iacute;mica en la Universidad de Nijmegen,
    y est&aacute; realizando su doctorado en f&iacute;sica sobre representaci&oacute;n
    molecular en la misma Universidad. Juega b&aacute;sket y programa
    aplicaciones Java.</P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Walter Echarri <small>&lt;wecharri(at)yahoo.com&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#228lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#228lfindex1">Temas tratados</A></LI>
  <LI><A HREF="#228lfindex2">Conclusi&oacute;n</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=228&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Revisi&oacute;n de libros: "Linux System Administration - A User's Guide" por Marcel Gagn&eacute;</H2>
 <IMG src="../../common/images/illustration228.jpg" alt=
    "[Illustration]" width="112" height="140" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>La presente es un rese&ntilde;a del libro titulado "Linux System Administration
    - A User's Guide" de Marcel Gagn&eacute;. El libro consta de 532 p&aacute;ginas
    y 26 cap&iacute;tulos que abarcan la instalaci&oacute;n, los demonios, los niveles de ejecuci&oacute;n,
    los sistemas de archivos, la pol&iacute;tica de contrase&ntilde;as, la construcci&oacute;n del kernel,
    el sistema de  impresi&oacute;n, los dispositivos, las copias de respaldo,
    la administraci&oacute;n de redes, la seguridad inform&aacute;tica y mucho m&aacute;s.
    </P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="228lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>


    <P>Empecemos por el final : se trata de un buen libro. Hace unos tres
    a&ntilde;os atr&aacute;s, recib&iacute; para mi cumplea&ntilde;os un libro sobre Linux. Era p&eacute;simo
    pero escrito en alem&aacute;n y ven&iacute;a acompa&ntilde;ado de un disco compacto con
    la distribuci&oacute;n Red Hat. No m&aacute;s de un mes despu&eacute;s compr&eacute; el n&uacute;mero
    especial de Nuevo A&ntilde;o/Navidad de Chip (revista de computaci&oacute;n alemana)
    que tra&iacute;a a Debian 2.1 y nunca m&aacute;s le&iacute; este libro. La raz&oacute;n por lo que digo
    esto es porque existen muchos libros sobre Linux p&eacute;simamente escritos.
    Parece que resulta dif&iacute;cil escribir una introducci&oacute;n sobre Linux o sobre
    su administraci&oacute;n que sea a la vez f&aacute;cil de leer y que cubra los temas
    m&aacute;s importantes. Marcel Gagn&eacute; logr&oacute; escribir un libro as&iacute;.</P>

    <P>Un importante aspecto de este libro es que el autor brinda un repaso
    general. Siempre menciona diferente alternativas para la mayor parte de
    las tareas administrativas: herramientas de l&iacute;nea de comando y tambi&eacute;n
    herramientas gr&aacute;ficas pertenecientes a KDE y Gnome. La mayor&iacute;a
    de los temas se complementan con capturas de pantallas, ejemplos y notas.
    Estas &uacute;ltimas proporcionan informaci&oacute;n adicional: un an&aacute;lisis m&aacute;s
    detallado, un breve resumen o alguna que otra terminolog&iacute;a. Por ejemplo,
    la segunda nota (p&aacute;gina 4) resulta bastante interesante:</P>
<P class="code">
Suposici&oacute;n de Marcel #312: no todo el mundo usa Red Hat Linux (o Caldera, o
Slackware, etc).
</P>

    <P>Esta cita se&ntilde;ala que el libro no se basa en una distribuci&oacute;n
    espec&iacute;fica lo que resulta algo muy conveniente y adecuado para
    cualquier administrador de Linux novicio que a&uacute;n no se ha decidido
    por una distribuci&oacute;n particular.</P>

    <P>Sin embargo, considero que es un buen libro (incluso un muy buen libro)
    aunque no perfecto. Algunas partes est&aacute;n un tanto desactualizadas o algo
    incompletas. El libro fue publicado en septiembre &uacute;ltimo pero parece que
    fue escrito hace un a&ntilde;o atr&aacute;s (el kernel 2.4 a&uacute;n no hab&iacute;a salido). No
    creo que sea una falta del autor sino a la propia naturaleza
    de los proyectos de la comunidad Linux/Open Source: su desarrollo
    es muy r&aacute;pido. Quiz&aacute;s demasiado r&aacute;pido para la publicaci&oacute;n de libros
    que quieren estar a la vanguardia. Esto lo menciona el propio autor
    en la p&aacute;gina siete.</P>

    <P>Otra caracter&iacute;stica destacable es que incluso con mis tres a&ntilde;os de experiencia,
    el libro contiene herramientas y trucos muy &uacute;tiles que jam&aacute;s he visto
    antes. Esto demuestra que el autor es de hecho un administrador de
    sistemas muy experimentado. Asimismo escribe diversas columnas en
    revistas tales como <I>Linux Journal</I> y <I>Sys Admin Magazine</I>.
    Esta &uacute;ltima se puede consultar en internet: <A href=
    "http://www.marcelgagne.com/nfljwritings.html">Sysadmin's Corner
    series</A>.</P>

    <A NAME="228lfindex1">&nbsp;</A>
<H2>Temas tratados</H2>


    <P>Los primeros dos cap&iacute;tulos describen brevemente qu&eacute; es Linux y cu&aacute;les
    son las distribuciones existentes. Tambi&eacute;n compara siete de las distribuciones
    m&aacute;s grandes. En el cap&iacute;tulo 3 el autor comienza a dar material pr&aacute;ctico, explica
    como obtener ayuda e informaci&oacute;n y  asigna la primera tarea: escribir "man ls".
    A lo largo de todo el libro el autor sigue con este mismo estilo: muchos
    ejemplos y comandos listos para usar. Muy similar a como se escriben los art&iacute;culos
    en LinuxFocus. Las fuentes de informaci&oacute;n que se discuten son las p&aacute;ginas del manual,
    las p&aacute;ginas info, los COMOS, LinuxDoc, los grupos de usuarios y UseNet.
    Pareciera faltar aqu&iacute; una breve lista con las revistas electr&oacute;nicas sobre Linux.</P>

    <P>Una vez que el libro explica qu&eacute; es Linux y c&oacute;mo obtener m&aacute;s informaci&oacute;n,
    el siguiente cap&iacute;tulo trata sobre su instalaci&oacute;n.
    Tras un an&aacute;lisis sobre los distintos tipos de hardware, muestra c&oacute;mo se realiza
    la instalaci&oacute;n de una distribuci&oacute;n Linux. Finaliza ense&ntilde;ando c&oacute;mo crear un disco
    de inicio y c&oacute;mo encender y apagar el sistema. Todas tareas importantes para un
    administrador de sistemas.</P>

    <P>Los cap&iacute;tulos 5 al 8 tratan sobre la administraci&oacute;n b&aacute;sica del sistema.
    Se incluyen los siguientes temas: l&iacute;nea de comandos, transferencia de datos
    de un programa a otro, permisos, usuarios y grupos, procesos, buscar
    informaci&oacute;n con grep, vi y emacs, demonios, niveles de ejecuci&oacute;n, contrase&ntilde;as
    seguras, discos duros, sistema de archivos y cuotas. B&aacute;sicamente, todo lo
    que se necesita para administrar nuestro sistema Linux. Que el autor es un
    administrador experimentado queda de manifiesto por los sorprendentes trucos
    que menciona. Uno que realmente me gust&oacute; es el que ense&ntilde;a c&oacute;mo crear una &uacute;nica
    cuenta de correo (p&aacute;gina
    99):</P>
<P class="code">
useradd -g popusers -s /bin/false aeinstein
</P>

    <P>El Cap&iacute;tulo 9 analiza los gestores de acceso gr&aacute;fico (tales como xdm y
    gdm), algunos administradores de ventanas y entornos de escritorio
    (KDE, Gnome) y algunas cuestiones t&eacute;cnicas como la configuraci&oacute;n de X Window,
    configuraci&oacute;n del teclado y ajuste de los modos de video.</P>

    <P>El cap&iacute;tulo 11 habla sobre la localizaci&oacute;n, construcci&oacute;n e instalaci&oacute;n
    de programas. Puesto que actualmente la b&uacute;squeda de software involucra a
    Internet el cap&iacute;tulo 10 trata de la configuraci&oacute;n de una conexi&oacute;n PPP.
    Las sedes web analizadas para localizar programas son: Freshmeat, Tucows, SourceForge,
    Rpmfind y Ibiblio. Se explica como compilar programas (./configure &amp;&amp; make).
    El cap&iacute;tulo continua con la discusi&oacute;n de los administradores
    de paquetes deb, tgz y rpm. Nuevamente se hace menci&oacute;n de las interfaces
    gr&aacute;ficas.</P>

    <P>El Cap&iacute;tulo 12 explica c&oacute;mo descargar, compilar y personalizar
    el n&uacute;cleo de nuestro sistema. No hay nada para destacar aqu&iacute;. El Cap&iacute;tulo 13
    habla sobre el sistema de impresi&oacute;n, filtros de impresi&oacute;n, spoolers, control
    de trabajos, PostScript, LPR, PDQ y CUPS. Este cap&iacute;tulo es un tanto breve
    pero contiene todo lo que se necesita saber para poder empezar.</P>

    <P>Los Cap&iacute;tulos 14-15 cubren los guiones de shell (shell scripting)
    y otros m&eacute;todos de automatizaci&oacute;n a fin de facilitar las tareas
    administrativas. Se analizan todos las clases de bucles (if, for, until do).
    Tambi&eacute;n se menciona a Perl como un lenguaje de script. Se explica Crontab
    y tambi&eacute;n algunas herramientas secundarias como expect.</P>

    <P>El cap&iacute;tulo d&eacute;cimosexto habla sobre dispositivos, dispositivos y m&aacute;s
    dispositivos. Se analizan las unidades SCSI/IDE y cd-roms/cd-rws (inclusive cdrecord).
    Asimismo se discuten los esc&aacute;neres aunque no con mucha profundidad. El cap&iacute;tulo
    finaliza haciendo menci&oacute;n de las unidades de cintas y otros dispositivos.</P>

    <P>El siguiente cap&iacute;tulo discute diversas maneras de realizar
    copias de seguridad. &iexcl;Esto es muy importante para los administradores de sistemas!.
    Se describen las herramientas cpio, dump y tar y se explica c&oacute;mo mantener
    los permisos e identidad de las copias de seguridad. Se analiza c&oacute;mo realizar una
    copia de respaldo
    usando un disco regrabable e incluye un script para automatizar la tarea, pero
    desgraciadamente no explica c&oacute;mo hacer en el caso de necesitar m&aacute;s de un cd-rw.
    Se discuten algunas interfaces gr&aacute;ficas de productos comerciales como, por ejemplo,
    Arkeia.</P>

    <P>El cap&iacute;tulo 18 trata sobre la administraci&oacute;n de redes:
    servicios/puertos, dominios, direcciones ip, m&aacute;scaras de red/subred,
    routing, servicios de nombres de dominios (DNS), sistema de archivos de red (NFS),
    servicio de informaci&oacute;n de red (NIS) y NTP.</P>

    <P>El cap&iacute;tulo 19 es un compendio de utilidades &uacute;tiles para la configuraci&oacute;n,
    del sistema tales como linuxconf y webmin. Tambi&eacute;n analiza las distribuciones
    que caben en un s&oacute;lo disquette utilizadas en casos espec&iacute;ficos o cuando
    el sistema se rehusa a arrancar donde resultan sumamente pr&aacute;cticas. El libro
    menciona a: Go-Anywhere Linux, Tomsrtbt, y Trinux. Se analiza VNC y se ense&ntilde;a
    c&oacute;mo controlar una m&aacute;quina en forma remota lo cual resulta sumamente
    pr&aacute;ctico en redes multiplataformas.</P>

    <P>Los dos cap&iacute;tulos siguientes se denominan "Aplicando los conceptos" y proporcionan
    dos ejemplos de la vida real. El primero analiza un servidor web en una intranet
    con PostgreSQL. El segundo ejemplo trata sobre la configuraci&oacute;n de los servicios
    de red en una intranet.</P>

    <P>El cap&iacute;tulo 22 explica c&oacute;mo integrar su sistema Windows
    en una red Linux. Se analiza Samba para compartir archivos e impresoras y
    tres programas para ejecutar programas windows en sistemas Linux:
    Wine, VMware y Win4Lin.</P>

    <P>Otra tarea administrativa importante es mantener el registro de actividades
    y obtener un resumen de &eacute;l. Esto se trata en el Cap&iacute;tulo 23. Se analiza
    los archivos /var/log y se explica c&oacute;mo lograr que se mantenga dentro
    de un tama&ntilde;o razonable.  Algunas p&aacute;ginas explican c&oacute;mo analizar los archivos
    log y se discuten las herramientas Analog y Webalizer para obtener un resumen
    de los mismos.</P>

    <P>En los cap&iacute;tulos 24-25 se analiza el tema de la seguridad inform&aacute;tica
    y c&oacute;mo proteger nuestro sistema. Se tratan los siguientes temas:
    shell segura (SSH), la versi&oacute;n
    de c&oacute;digo abierto OpenSSH, SSL para el tr&aacute;fico cifrado en internet
    (ejemplo HTTPS), PGP y GnuPG. Nuevamente, se indican todas las herramientas
    necesarias para poder empezar. La segunda parte habla sobre la detecci&oacute;n
    de intrusos y prevensi&oacute;n de vulnerabilidades en el sistema. Temas
    tratados: analizadores de puertos, rastreadores (sniffers), PortSentry y cortafuegos.
    </P>

    <P>Una vez que funciona el sistema y est&aacute; integrado a una red local,
    es posible que se quiera dedicar algo de tiempo para mejorar el monitoreo
    y puesta a punto del sistema. El monitoreo es &uacute;til para ver si
    va a producirse alg&uacute;n problema y la puesta a punto del sistema
    resulta interesante para sistemas muy cargados. Las herramientas
    analizadas para la primer tarea son: uptime, top (gtop, kpm), free
    vmscat y ps. Estas herramientas b&aacute;sicas pueden automatizarse para
    seguir el rastro de determinados procesos. El cap&iacute;tulo no menciona herramientas
    integradas para la inspecci&oacute;n en tiempo real de los servicios de red como
    Telemetry Box. Se dedican unas pocas p&aacute;ginas para poner a punto
    la red y mejorar el rendimiento del disco duro.</P>

    <A NAME="228lfindex2">&nbsp;</A>
<H2>Conclusi&oacute;n</H2>


    <P>Se trata de un buen libro. Resulta muy &uacute;til para administradores
    principiantes ya que cubre la mayor&iacute;a de las tareas administrativas.
    Incluye un extenso &iacute;ndice de 24 p&aacute;ginas lo que lo convierte en un
    c&oacute;modo manual de referencia. Algunos temas se tratan m&aacute;s exhaustivamente
    que otros lo que refleja el hecho de que ciertas tareas requieren
    de m&aacute;s dedicaci&oacute;n que otras. El libro brinda un repaso bastante extenso
    sobre el sistema operativo Linux y b&aacute;sicamente presenta un resumen de
    todo lo que se necesita saber para empezar a trabajar con &eacute;l.</P>

    <P>Mi puntaje (en una escala del 1 al 10): 8.5.</P>
  



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=228&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Egon Willighagen, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article228.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Egon Willighagen <small>&lt;egonw(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Walter Echarri &lt;wecharri(at)yahoo.com&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-02-21, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
