<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Mark Nielsen
 =LF=CAT___: System Administration
 =LF=TITLE_: Chroot de todos los servicios en Linux
 =LF=NUMBER: 225
 =LF=ANAME_: article225.html
 -->
 <TITLE>lf225, System Administration: Chroot de todos los servicios en Linux</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Mark-Nielsen.jpg" alt="[Photo of the Author]" height="159" width="110">
<BR>por  Mark Nielsen <a href="http://www.tcu-inc.com/mark"><font size="1">(homepage)</font></a>
<BR><BR>
<I>Sobre el autor:</I><BR>

 Mark trabaja como consultor independiente, dedicando su tiempo a causas
 como GNUJobs.com, escribir art&iacute;culos, escribir software libre, y trabajando
 como voluntario en <A href=
"http://www.eastmont.net">eastmont.net</A>.



<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Roberto Hernando (<a href="http://rhernando.ya.st"><font size="1">homepage</font></a>)
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#225lfindex0">Introducci&oacute;n </A></LI>
  <LI><A HREF="#225lfindex1">&iquest;C&oacute;mo vamos a hacer chroot a todo?</A></LI>
  <LI><A HREF="#225lfindex2">Mi script Perl para crear entornos chroot.</A></LI>
  <LI><A HREF="#225lfindex3">Haciendo chroot a Ntpd </A></LI>
  <LI><A HREF="#225lfindex4"> Haciendo chroot a DNS o a named </A></LI>
  <LI><A HREF="#225lfindex5">Haciendo chroot a Syslog con servicios y mis quejas.</A></LI>
  <LI><A HREF="#225lfindex6">Haciendo chroot a Apache </A></LI>
  <LI><A HREF="#225lfindex7">Haciendo chroot a Ssh </A></LI>
  <LI><A HREF="#225lfindex8">Haciendo chroot a PostgreSQL </A></LI>
  <LI><A HREF="#225lfindex9">Haciendo chroot a Sendmail </A></LI>
  <LI><A HREF="#225lfindex10">Otras cosas a las que hacer chroot.</A></LI>
  <LI><A HREF="#225lfindex11">Sugerencias</A></LI>
  <LI><A HREF="#225lfindex12">Conclusi&oacute;n </A></LI>
  <LI><A HREF="#225lfindex13">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=225&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Chroot de todos los servicios en Linux</H2>
 <IMG src="../../common/images/illustration225.jpg" width="122" height="92" alt="[illustration]" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

Mediante el 'chroot' de los servicios del sistema mejora la seguridad limitando
el da&ntilde;o que un intruso podr&iacute;a causar  en el sistema.

</P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->

<A NAME="225lfindex0">&nbsp;</A>
<H3>Introducci&oacute;n </H3>


&iquest;Qu&eacute; es chroot? B&aacute;sicamente chroot redefine el universo para un programa.
M&aacute;s exactamente redefine el directorio ra&iacute;z o "/" para un programa o una
sesi&oacute;n. B&aacute;sicamente todo lo que est&eacute; fuera del directorio en el que usamos chroot no existe
para el programa o el shell.
<p>
&iquest;Por qu&eacute; esto es &uacute;til? Si alguien entra sin autorizaci&oacute;n en nuestro ordenador,
no ser&aacute; capaz de ver todos los ficheros de nuestro sistema. El no ser capaz
de ver nuestros ficheros limita los comandos que puede utilizar y tampoco
le permite explotar otros ficheros que ser&iacute;an inseguros. El &uacute;nico inconveniente
es que seg&uacute;n creo no impide mirar en las conexiones de red y en otras cosas.
Por tanto, tendr&iacute;amos que hacer algunas cosas m&aacute;s que no se tratan a fondo
en este art&iacute;culo:
<ul>
<li>Asegurar los puertos de red.</li>
<li>Tener todos los servicios corriendo como un servicio bajo una cuenta
que no sea la de root.
  Adem&aacute;s, tener todos los servicios con chroot.</li>
<li>Transferir los logs de sistema a otra m&aacute;quina.</li>
<li>Analizar los ficheros de log.</li>
<li>Analizar intentos de detecci&oacute;n aleatoria de puertos en nuestro
ordenador.</li>
<li>Limitar los recursos de cpu y de memoria para un servicio.</li>
<li>Activar quotas para las cuentas de usuario.</li>
</ul>

Por lo que considero chroot (con un servicio no-root) una l&iacute;nea defensiva
es porque si alguien se introduce con una cuenta sin privilegios, y no hay
ficheros que pueda usar para entrar como root, entonces s&oacute;lo puede
da&ntilde;ar el &aacute;rea al que ha accedido. Adem&aacute;s, incluso si el &aacute;rea al que hubiera accedido
fuera propiedad de la cuenta de root, tendr&iacute;a menos posibilidades
para el ataque. Obviamente, hay algo err&oacute;neo si alguien tiene la posibilidad
de introducirse con nuestra cuenta, pero est&aacute; bien ser capaz de limitar el da&ntilde;o
que puede hacer.
<p>
<font size=+1><b>POR FAVOR RECUERDE</b></font>
que mi forma de hacer esto probablemente no sea 100% segura.
Es mi primer intento de hacer esto, y si parece que todo funciona bien
por separado, ser&iacute;a f&aacute;cil pulir las asperezas. Esto s&oacute;lo es un boceto para
un HOWTO que quiero hacer sobre chroot.

<A NAME="225lfindex1">&nbsp;</A>
<H3>&iquest;C&oacute;mo vamos a hacer chroot a todo?</a></H3>

Bien, creamos un directorio, "/chroot" y colgamos todos
nuestros servicios de ah&iacute; como sigue:
<ul>
<li>Syslogd ser&aacute; hecho chroot con cada servicio.</li>
<li>Apache estar&aacute; en /chroot/httpd. </li>
<li>Ssh estar&aacute; en /chroot/sshd.</li>
<li>PostgreSQL estar&aacute; en  /chroot/postmaster.</li>
<li>Sendmail ser&aacute; hecho chroot, pero no puede correr
bajo una cuenta sin privilegios, desafortunadamente.</li>
<li>ntpd ser&aacute; chroot en /chroot/ntpd</li>
<li>named ser&aacute; chroot en /chroot/named</li>
</ul>

Cada servicio deber&iacute;a estar completamente aislado.

<A NAME="225lfindex2">&nbsp;</A>
<H3>Mi script Perl para crear entornos chroot.</H3>

<a href="../../common/src/article225/Config_Chroot.pl.txt">Config_Chroot.pl.txt</a> se
debe renombrar Config_Chrooot.pl despu&eacute;s de descargarlo. Este script
perl permite listar los servicios instalados, ver los ficheros de configuraci&oacute;n,
configurar un servicio, e iniciar y parar los servicios. En general, esto es lo
que se debe hacer:

<ol>
<li>Crear el directorio chroot.<br>mkdir -p /chroot/Config/Backup</li>
<li>Descargar <a href="../../common/src/article225/Config_Chroot.pl.txt">Config_Chroot.pl.txt</a>
en /chroot/Config_Chroot.pl</li>
<li>Cambiar la variable $Home en el perl script si no se est&aacute; usando
/chroot como directorio personal.</li>
<li>Descargar mis <a href="../../common/src/article225/">ficheros de configuraci&oacute;n.</a></li>
</ol>

Hay que tener en cuenta que: <b>S&oacute;lo lo he probado en
RedHat 7.2 y RedHat 6.2</b>.
<p>
Modificar el script perl para nuestra distribuci&oacute;n.
<p>
Hab&iacute;a escrito un art&iacute;culo gigantesco sobre Chroot, pero con mi script Perl,
se ha vuelto mucho menor. Principalmente, not&eacute; despu&eacute;s de hacer
chroot a varios servicios que todos ellos ten&iacute;an ficheros  y
configuraciones similares para hacer chroot. La manera m&aacute;s sencilla
de imaginarse qu&eacute; ficheros es necesario copiar para un servicio particular
es mirar en la p&aacute;gina de manual y tambi&eacute;n escribir "ldd /usr/bin/file"  para
los programas que utilizan librer&iacute;as. Tambi&eacute;n se puede hacer chroot al servicio
que se est&aacute; instalando e iniciarlo manualmente para ver qu&eacute; errores
se obtienen o bien mirando los ficheros de log.
<p>
Normalmente, para instalar un servicio hay que hacer:
<pre>
cd /chroot
./Config_Chroot.pl config  SERVICIO
./Config_Chroot.pl install SERVICIO
./Config_Chroot.pl start   SERVICIO
</pre>


<A NAME="225lfindex3">&nbsp;</A>
<H3>Haciendo chroot a Ntpd </H3>

Ntpd simplemente es un servicio de tiempo que permite mantener
nuestra m&aacute;quina y otras m&aacute;quinas sincronizadas en tiempo real. Es
muy f&aacute;cil hacerle chroot.


<pre>
cd /chroot
# Descomentar la siguiente l&iacute;nea si no se usa mi fichero de configuraci&oacute;n.
#./Config_Chroot.pl config  ntpd
./Config_Chroot.pl install ntpd
./Config_Chroot.pl start   ntpd
</pre>


<A NAME="225lfindex4">&nbsp;</A>
<H3> Haciendo chroot a DNS o a named </H3>

Ya est&aacute; hecho, compru&eacute;belo
<br>
<a href="http://www.linuxdoc.org/HOWTO/Chroot-BIND8-HOWTO.html">
http://www.linuxdoc.org/HOWTO/Chroot-BIND8-HOWTO.html</a>
<br>o
<br>
<a href="http://www.linuxdoc.org/HOWTO/Chroot-BIND-HOWTO.html">
http://www.linuxdoc.org/HOWTO/Chroot-BIND-HOWTO.html</a>
<p>
O, si prefiere usar mi script,
<pre>
cd /chroot
# Descomentar la siguiente l&iacute;nea si no se usa mi fichero de configuraci&oacute;n.
#./Config_Chroot.pl config  named
./Config_Chroot.pl install named
./Config_Chroot.pl start   named
</pre>


<A NAME="225lfindex5">&nbsp;</A>
<H3>Haciendo chroot a Syslog con servicios y mis quejas.</H3>

Quiero hacer chroot a syslogd. Mi problema es que syslogd utiliza
por defecto /dev/log, que no puede ser visto por los servicios con
chroot. Por eso, no he podido hacer chroot a syslogd de una forma
sencilla. Aqu&iacute; est&aacute;n las posibles soluciones:
<ul>
<li>Hacer chroot a syslogd con todos los servicios. Lo estoy probando
actualmente, y s&iacute;, he conseguido los log. No me gusta esta forma porque
tengo un servicio funcionando como root.</li>
<li>Ver si podemos conectarnos a un sitio externo que nos facilite
los logs.</li>
<li>Enviar los logs a un fichero y no a trav&eacute;s de syslogd. Posiblemente
sea la opci&oacute;n m&aacute;s segura, aunque un intruso podr&iacute;a jugar con los logs.</li>
<li>Configurar el syslogd principal para buscar en varios lugares para
obtener todos los servicios. Se usa la opci&oacute;n -a de syslogd para hacer esto.</li>
</ul>
Mi &uacute;nica soluci&oacute;n para hacer seguro syslogd fue hacerle chroot con todos
los servicios. Querr&iacute;a un tipo de soluci&oacute;n en la que se pudiera tener logs
en una cuenta sin privilegios de root usando su propio entorno chroot, como
podr&iacute;a ser un puerto de red. Posiblemente se pueda hacer, pero tengo que
pararme donde estoy y pensar despu&eacute;s una soluci&oacute;n mejor.
<p>
Si no se quiere tener un syslogd separado para cada servicio,  con
el syslogd principal que se est&aacute; ejecutando en nuestro sistema hay que
a&ntilde;adir el siguiente comando cuando syslogd arranque:
<pre>
syslogd -a /chroot/SERVICIO/dev/log
</pre>
Si tuviera ssh y dns ejecut&aacute;ndose ser&iacute;a algo as&iacute;
<pre>
syslogd -a /chroot/ssh/dev/log -a /chroot/named/dev/log -a /dev/log
</pre>


<p>
Una &uacute;ltima nota sobre Syslogd, me gustar&iacute;a hacerlo correr bajo una cuenta
que no fuera la de root. He intentado un par de cosas sencillas, pero no
han funcionado y me he rendido. Si pudiese correr syslogd bajo una
cuenta distinta de la de root con cualquier servicio, mis prop&oacute;sitos de seguridad
estar&iacute;an satisfechos. Posiblemente, incluso teniendo los logs en otra m&aacute;quina.

<A NAME="225lfindex6">&nbsp;</A>
<H3>Haciendo chroot a Apache </H3>

Es muy sencillo. Una vez que lo configur&eacute;, pude ejecutar scripts Perl. Ahora
mi fichero de configuraci&oacute;n es m&aacute;s bien grande porque he tenido que
incluir Perl y las librer&iacute;as PostgreSQL en el &aacute;rea con chroot. Algo a tener en
cuenta, si nos estamos conectando a una base de datos, debemos asegurar
que nuestro servicio de base de datos est&aacute; corriendo en el dispositivo de
loopback 127.0.0.1 y especificar que el host es 127.0.0.1 en nuestros
scripts Perl para el m&oacute;dulo DBI. Aqu&iacute; hay un ejemplo de c&oacute;mo conectarse
a la base de datos usando conexi&oacute;n persistente en apache:
<pre>
$dbh = DBI-&gt;connect('dbi:Pg:dbname=DATABASE',"","", {PrintError=&gt;0});


if ($dbh ) {$dbh-&gt;{PrintError} = 1;}
else
  {$dbh = DBI-&gt;connect('dbi:Pg:dbname=DATABASE;host=127.0.0.1',"","",
      {PrintError=&gt;1});}
</pre>
<p>
C&oacute;digo fuente: <a href="http://httpd.apache.org/dist/httpd/">
http://httpd.apache.org/dist/httpd/</a>
<p>
Hay que compilar e instalar apache en el sistema principal en /usr/local/apache.
Despu&eacute;s usar el script perl.


<pre>
cd /chroot
# Descomente la siguiente l&iacute;nea si no usa mi fichero de configuraci&oacute;n
# ./Config_Chroot.pl config  httpd
./Config_Chroot.pl install httpd
./Config_Chroot.pl start   httpd
</pre>

He cambiado mi fichero http.conf para que tenga esta apariencia:

<pre>
ExtendedStatus On


&lt;Location /server-status&gt;
    SetHandler server-status
    Order deny,allow
    Deny from all
    Allow from 127.0.0.1
&lt;/Location&gt;


&lt;Location /server-info&gt;
    SetHandler server-info
    Order deny,allow
    Deny from all
    Allow from 127.0.0.1
&lt;/Location&gt;


</pre>

Ahora, s&oacute;lo hay que ir a

http://127.0.0.1/server-status
 o
http://127.0.0.1/server-info
desde nuestro navegador
y comprobar que funciona.



<A NAME="225lfindex7">&nbsp;</A>
<H3>Haciendo chroot a Ssh </H3>

Antes de nada lo ideal ser&iacute;a redirigir el puerto ssh del 22 al 2222.
Despu&eacute;s, al arrancar ssh, hay que hacerlo escuchar en el puerto
2222 bajo una cuenta que no sea la de root. Para la conexi&oacute;n ssh
inicial queremos tener cuentas seguras con contrase&ntilde;as s&oacute;lo para
permitir la entrada, pero para nada m&aacute;s. Despu&eacute;s de entrar, se tiene
un segundo programa ssh corriendo en el puerto 127.0.0.1:2322 con
en el que permitiremos conectarse al sistema real -- el segundo
programa ssh deber&iacute;a escuchar SOLAMENTE en el dispositivo de loopback.
Ahora esto es como yo lo har&iacute;a. No vamos a hacerlo as&iacute;. La &uacute;nica cosa que
vamos a hacer es hacer chroot a ssh para este ejemplo. Queda como
ejercicio para el lector poner sshd bajo una cuenta sin privilegios e instalar
un segundo sshd que escuche en el dispositivo de loopback para permitir
a la gente entrar en el sistema real.
<p>
 Una vez m&aacute;s, t&eacute;ngase en cuenta que s&oacute;lo vamos a hacer chroot a ssh
y hay que preocuparse sobre las consecuencias de hacer esto (no podremos
ver nuestro sistema por completo si s&oacute;lo hacemos esto). Adem&aacute;s, lo ideal ser&iacute;a
ser capaces de configurarlo para que guarde los logs fuera del sistema. Tambi&eacute;n,
podr&iacute;amos utilizar OpenSSH, pero estoy usando el SSH comercial por simplicidad
(que no es una buena excusa).
<p>
C&oacute;digo fuente: <A href="http://www.ssh.com/products/ssh/download.cfm">
http://www.ssh.com/products/ssh/download.cfm</a>
<p>
Instalar ssh en /usr/local/ssh_chroot. Despu&eacute;s usar el script Perl.
<pre>
cd /chroot
 # Descomente la siguiente l&iacute;nea si no usa mi fichero de configuraci&oacute;n
 # ./Config_Chroot.pl config  sshd
./Config_Chroot.pl install sshd
./Config_Chroot.pl start   sshd
</pre>

Supongo que una cosa realmente buena con poner ssh bajo un entorno
con chroot es que si queremos usarlo para reemplazar un servidor ftp,
se tendr&aacute; un acceso limitado a nuestro &aacute;rea.
Rsync y SCP van muy bien juntos para permitir a la gente subir ficheros.
No me gusta mucho poner un servidor ftp permitiendo la entrada al
sistema. Muchos servidores ftp tambi&eacute;n est&aacute;n con chroot, pero
todav&iacute;a env&iacute;an las contrase&ntilde;as en claro, lo que no me gusta.


<A NAME="225lfindex8">&nbsp;</A>
<H3>Haciendo chroot a PostgreSQL </H3>

Esto es casi tan simple como perl, excepto que requiere unas cuantas librer&iacute;as
m&aacute;s. De todas formas, no es muy duro hacerlo. Una cosa que he tenido que
hacer es poner PostgreSQL abierto a la red, pero s&oacute;lo al dispositivo de loopback.
Desde que se hizo chroot, otros servicios con chroot no pod&iacute;an acceder, como
el servidor web apache. He compilado Perl en PostgreSQL, por lo que he
tenido que a&ntilde;adir muchas cosas de Perl en mi fichero de configuraci&oacute;n.
<p>
C&oacute;digo fuente:
 <A href="ftp://ftp.us.postgresql.org/source/v7.1.3/postgresql-7.1.3.tar.gz">
ftp://ftp.us.postgresql.org/source/v7.1.3/postgresql-7.1.3.tar.gz</a>
<p>
Compilar e instalar apache en nuestro sistema principal en /usr/local/postgres.
Despu&eacute;s usar el script Perl.
<pre>
cd /chroot
 # Descomente la siguiente l&iacute;nea si no usa mi fichero de configuraci&oacute;n
 # ./Config_Chroot.pl config  postgres
./Config_Chroot.pl install postgres
./Config_Chroot.pl start   postgres
</pre>


<A NAME="225lfindex9">&nbsp;</A>
<H3>Haciendo chroot a Sendmail </H3>

Adelante, ejecute mi script.
<pre>
cd /chroot
 # Descomente la siguiente l&iacute;nea si no usa mi fichero de configuraci&oacute;n
 # ./Config_Chroot.pl config  sendmail
./Config_Chroot.pl install sendmail
./Config_Chroot.pl start   sendmail
</pre>

Ahora, &iquest;hay inconvenientes? S&iacute;. Todav&iacute;a se est&aacute; ejecutando como
root. &iexcl;Maldici&oacute;n!

Adem&aacute;s, algunos ficheros son creados de nuevo por  /etc/rc.d/init.d/sendmail
cuando se inicia. Mi script no controla esto. Cada vez que se hagan cambios
a sendmail bajo /etc/mail, es necesario copiar tambi&eacute;n esos cambios
en /chroot/sendmail/etc. Se podr&iacute;a enlazar /var/spool/mail a
/chroot/sendmail/var/spool/mail con lo que el programa sendmail
y los usuarios (cuando est&eacute;n conectados) ver&iacute;an los mismos ficheros.
<p>
Lo bueno es que siempre podremos enviar correo, el &uacute;nico problema
es al recibirlo. De este modo, he conseguido instalar sendmail con apache
sin ning&uacute;n problema. Algunos de mis scripts perl env&iacute;an correo, y adem&aacute;s,
he necesitado los ficheros de sendmail copiados en el &aacute;rea chroot para
apache.

<A NAME="225lfindex10">&nbsp;</A>
<H3>Otras cosas a las que hacer chroot.</H3>

&Eacute;sta es mi filosof&iacute;a:
<ol>
<li>Todo deber&iacute;a hacerse chroot, incluyendo sendmail, ssh, apache,
  postgresql, syslog, y cualquier servicio corriendo en la m&aacute;quina.
  </li>
<li>Todo deber&iacute;a ponerse bajo una cuenta sin privilegios (podr&iacute;a ser necesario
  redirigir puertos protegidos a puertos no protegidos). Esto incluye sendmail
  y syslog. </li>
<li>Los logs deber&iacute;an enviarse a otra m&aacute;quina.</li>

<li>Se deber&iacute;a configurar una partici&oacute;n para cada servicio para limitar
el tama&ntilde;o de disco que un hacker puede usar si decide escribir ficheros.
Se puede usar un dispositivo de loopback para montar ficheros como
sistemas de ficheros para alguno de estos servicios si se han agotado
las particiones.
</li>
<li>Root deber&iacute;a poseer todos los ficheros inmutables.</li>
</ol>
Ahora, al empezar con sendmail y syslogd, sigo pensando que deber&iacute;an
ejecutarse bajo una cuenta sin privilegios. Para sendmail esto deber&iacute;a ser
posible, pero he encontrado much&iacute;simas dificultades para ejecutarlo con
una cuenta sin privilegios. No he conseguido ejecutar sendmail con una
cuenta sin privilegios, y pienso que es un grave error. S&eacute; que hay problemas
para hacerlo, pero creo que TODO se puede conseguir. Teniendo en cuenta
los permisos de los ficheros, no veo porqu&eacute; sendmail necesita ejecutarse como
root. Habr&aacute; alguna raz&oacute;n que se me escapa, pero dudo si alguno de los obstaculos
ser&aacute; insalvable.
<p>
Para syslog, no lo he intentado, pero dir&iacute;a que los logs deber&iacute;an ser ejecutados
bajo una cuenta sin privilegios y no s&eacute; si esto es posible. Al menos he sido capaz
de conseguir hacer chroot a syslog para cada servicio.
<p>
Todos los servicios deber&iacute;an instalarse con cuentas sin privilegios. Incluso NFS. Todo.

<A NAME="225lfindex11">&nbsp;</A>
<H3>Sugerencias</H3>

<ul>
<li>Usar 2 logins para ssh y tener corriendo dos demonios sshd.</li>
<li>Piense c&oacute;mo conseguir ejecutar sendmail u otro programa de correo con
una cuenta sin privilegios.</li>
<li>Quitar las librer&iacute;as innecesarias de /lib. He copiado todo para simplific&aacute;rmelo.
La mayor&iacute;a no las necesito.</li>
<li>Conectarse remotamente a syslogd y encontrar si podemos
unir syslogd a un puerto de red y conseguir todos los servicios conectados
a ese puerto de red en el dispositivo de loopback. Ver si podemos tener
syslogd corriendo bajo una cuenta sin privilegios.</li>
</ul>


<A NAME="225lfindex12">&nbsp;</A>
<H3>Conclusi&oacute;n </H3>

Pienso que chroot est&aacute; bien para todos los servicios. Creo que es
un gran error no hacer chroot de todos los servicios bajo cuentas no-root.
Desear&iacute;a que lo hicieran las distribuciones grandes, o una distribuci&oacute;n peque&ntilde;a:
CUALQUIER distribuci&oacute;n. Mandrake comenz&oacute; tomando cosas de RedHat y
extendi&eacute;ndolas, luego quiz&aacute;s, alguien podr&iacute;a tomar Mandrake y extenderla
mediante chroot. Nada impide que alguien retome el trabajo de otro en GNU/Linux,
por lo que creo que es posible. Si alguna empresa quisiera hacer chroot a
todo y crear un entorno sencillo para controlar los servicios con chroot,
&iexcl;har&iacute;an una distribuci&oacute;n fant&aacute;stica! Recordemos la corriente que ahora
est&aacute; siguiendo Linux, la gente no quiere ver la l&iacute;nea de comandos, por lo
que todo se est&aacute; haciendo en entornos gr&aacute;ficos, no necesitan ver las tripas
y realmente no necesitan conocer lo que est&aacute; pasando -- s&oacute;lo necesitan
ser capaces de configurarlo y saber que funciona.
<p>
Estoy un 100% convencido de que todos los servicios deber&iacute;an
ser hechos chroot con cuentas sin privilegios y que cualquier
distribuci&oacute;n que no lo haga para m&iacute; no es conveniente para
utilizarla en un entorno en producci&oacute;n. Voy a hacer chroot a todo,
mientras sea posible -- puede que lo consiga.
<p>
He pensado crear un HOWTO sobre chroot. He enviado una petici&oacute;n
para que alguien me ayude a convertir este art&iacute;culo en formato LyX
para que lo pueda poner en los HOWTOs para Linux.


<A NAME="225lfindex13">&nbsp;</A>
<H3>Referencias</H3>



<ol>
<li>
Si este art&iacute;culo tuviese alg&uacute;n cambio estar&iacute;a disponible en
<a href="http://www.gnujobs.com/Articles/23/chroot.html">
http://www.gnujobs.com/Articles/23/chroot.html</a></li>
</ol>





<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=225&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Mark Nielsen, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article225.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Mark Nielsen (<a href="http://www.tcu-inc.com/mark"><font size="1">homepage</font></a>)</font></td></tr>
  <tr><td><font size="2">en --&gt; es: Roberto Hernando (<a href="http://rhernando.ya.st"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-07-10, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
