<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Applications">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Katja and Guido Socher
 =LF=CAT___: Applications
 =LF=TITLE_: Grabando CDs con Linux
 =LF=NUMBER: 227
 =LF=ANAME_: article227.html
 -->
 <TITLE>lf227, Applications: Grabando CDs con Linux</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/KatjaAndGuido.jpg" alt=
    "[Photo of the Authors]" height="150" width="168">
<BR>por  Katja and Guido Socher <a href="mplural"><font size="1">(homepage)</font></a>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Katja es la editora de idioma alem&aacute;n de LinuxFocus. A
    ella le gustan Tux, el cine, la fotograf&iacute;a y el mar.
    Encuentra su p&aacute;gina <A href=
    "http://linuxfocus.org/~katja/">aqu&iacute;</A>.</P><P>Guido es un fiel seguidor de Linux desde hace mucho tiempo. Le
    gusta Linux porque lo dise&ntilde;an personas honestas y abiertas.
    Esta es una de las razones por las cuales decimos que &eacute;ste
    es un recurso abierto. Su p&aacute;gina se encuentra en <A href=
    "http://linuxfocus.org/~guido/">linuxfocus.org/~guido</A>.</P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Gabriela Gonz&aacute;lez <small>&lt;tradugag(at)yahoo.com&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#227lfindex0">Lo que necesitas</A></LI>
  <LI><A HREF="#227lfindex1">Quemando CDs como usuario normal (no como usuario
    ra&iacute;z)</A></LI>
  <LI><A HREF="#227lfindex2">Notas generales sobre quemar CDs</A></LI>
  <LI><A HREF="#227lfindex3">Configuraci&oacute;n</A></LI>
  <LI><A HREF="#227lfindex4">(Pura) m&uacute;sica CDs (de audio)</A></LI>
  <LI><A HREF="#227lfindex5">(Puros) Datos en CDs</A></LI>
  <LI><A HREF="#227lfindex6">Copia de seguridad de tu directorio de inicio</A></LI>
  <LI><A HREF="#227lfindex7">Consejos y trucos:</A></LI>
  <LI><A HREF="#227lfindex8">Herramientas de la l&iacute;nea de comandos</A></LI>
  <LI><A HREF="#227lfindex9">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=227&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Grabando CDs con Linux</H2>
 <IMG src="../../common/images/article227/illustration227.jpg"
    width="100" height="121" alt="[Illustration]" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

    En este art&iacute;culo describimos c&oacute;mo puedes grabar CDs
    con Linux.

    </P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <P>Tal vez hayas le&iacute;do el art&iacute;culo de Katja <A href=
    "../November2001/article221.shtml">Un Completo Mundo Nuevo</A> en
    nuestra &uacute;ltima edici&oacute;n y hayas seguido el viaje con
    Tux. Ahora t&uacute; tienes un mont&oacute;n de "vistas" y
    "sonidos" que desear&iacute;as tener en tu casa y te preguntas
    c&oacute;mo hacerlo. Quemar todo en un CD es una buena
    soluci&oacute;n y en este art&iacute;culo te vamos a contar
    exactamente c&oacute;mo hacerlo.</P>

    <A NAME="227lfindex0">&nbsp;</A>
<H2>Lo que necesitas</H2>


    <P>Configuraci&oacute;n de hardware:<BR>
    Por supuesto necesitas que Linux funcione en tu computadora y
    adem&aacute;s debes tener una quemadora de CD para realizar el
    trabajo. Si tienes una quemadora de CD del tipo SCSI tienes muchas
    posibilidades de que &eacute;sta sea reconocida de inmediato por el
    n&uacute;cleo o kernel. S&oacute;lo tienes que corroborar que Linux
    contemple a tu adaptador de sistema anfitri&oacute;n o hostadapter
    SCSI (para ello puedes consultar <A href=
    "http://cdb.suse.de/">hardware database</A>). Todos los
    dispositivos para grabar CDs del tipo SCSI son compatibles con
    Linux. Para utilizar una quemadora ATAPI/IDE debes configurar la
    emulaci&oacute;n SCSI y de este modo tu quemadora se
    asemejar&aacute; a un dispositivo SCSI a&uacute;n cuando el
    hardware se encuentre f&iacute;sicamente conectado via bus IDE. Un
    ejemplo de c&oacute;mo hacer esto se describe en el archivo <A
    href=
    "../../common/src/article227/README.atapi.html">README.atapi</A> de
    xcdroast y tambi&eacute;n te recomendamos que leas C&oacute;mo
    Grabar CDs (the CD Writing HOWTO) en <A href=
    "http://www.linuxdoc.org/HOWTO/CD-Writing-HOWTO.html">linuxdoc.org</A><BR>

    Para quemadoras USB, consulta C&oacute;mo Grabar CDs con
    Dispositivos USB (USB-CD Writer HOWTO) en <A href=
    "http://mobilix.org/linux_usb_cd.html">mobilix.org/linux_usb_cd.html</A>.<BR>

    Como ambos tenemos experiencia &uacute;nicamente con quemadoras
    SCSI, s&oacute;lo podr&iacute;amos repetir lo que hemos
    le&iacute;do all&iacute;.</P>

    <P>Software para quemar CDs:<BR>
    Para poder quemar CDs necesitas los siguientes programas:<BR>
    </P>

    <OL>
      <LI>cdrecord: este es el programa que esencialmente se comunica
      con tu grabadora de CDs.</LI>

      <LI>mkisofs: lo necesitas para cargar datos en CDs. Se utiliza
      para generar una imagen de sistema de archivo para el CD llamada
      imagen ISO.</LI>

      <LI>cdda2wav: se utiliza para leer datos de audio digital de CDs
      de audio.</LI>
    </OL>
    Los tres se encuentran incluidos en el paquete cdrtools que puedes
    bajar de <A href="http://www.xcdroast.org">www.xcdroast.org</A><BR>
    o <A href=
    "ftp://ftp.fokus.gmd/pub/unix/cdrecord/">ftp.fokus.gmd/pub/unix/cdrecord/</A><BR>

    Con estas herramientas ya puedes quemar tus CDs utilizando la
    l&iacute;nea de comandos. Pero si deseas contar con una interfaz
    gr&aacute;fica de usuario mejor, necesitar&aacute;s agregar
    aplicaciones de interfaz. Existen muchas disponibles pero en este
    art&iacute;culo s&oacute;lo nos referiremos a xcdroast (<A href=
    "http://www.xcdroast.org">http://www.xcdroast.org</A>) y a koncd
    (<A href="http://www.koncd.org/">http://www.koncd.org/</A>).
    xcdroast parece ser la aplicaci&oacute;n de interfaz que brinda las
    mejores posibilidades y tambi&eacute;n nos gusta koncd porque es
    realmente muy f&aacute;cil de usar.<BR>
    <BR>
    <BR>
    Instalaci&oacute;n<BR>
    <BR>
    En muchos casos xcdroast ya se encontrar&aacute; instalada en tu
    computadora pero, a menos en lo que hace a la distribuci&oacute;n
    RedHat, se encuentra compilada con la biblioteca-pam lo que
    significa que siempre te pedir&aacute; la contrase&ntilde;a del
    usuario ra&iacute;z si deseas quemar CDs y probablemente no desees
    que todos los usuarios que quieran quemar CDs la conozcan. Una
    segunda desventaja consiste en que no te permitir&aacute; iniciar
    el programa de enlace remoto en una red. Por lo tanto es mejor
    bajar la &uacute;ltima versi&oacute;n de http://www.xcdroast.org.
    Esto deber&iacute;a resultar simple ya que existen paquetes
    pre-compilados disponibles para la mayor&iacute;a de las
    distribuciones comunes. koncd puede bajarse de www.koncd.org. Las
    versiones recientes de koncd dependen de las nuevas
    caracter&iacute;sticas de QT/KDE. Si no deseas invertir tiempo en
    actualizar tus bibliotecas QT y KDE, puedes utilizar una
    versi&oacute;n anterior de koncd. Para este art&iacute;culo hemos
    utilizado la versi&oacute;n koncd-0.7.5 que se ejecuta bajo redhat
    7.1.<BR>


    <A NAME="227lfindex1">&nbsp;</A>
<H2>Quemando CDs como usuario normal (no como usuario
    ra&iacute;z)</H2>

    Para quemar CDs en primer lugar debes contar con permisos de
    escritura para los dispositivos /dev/sg* que se utilizan para
    permitir la comunicaci&oacute;n con el hardware. Sin embargo
    cdrecord tambi&eacute;n utiliza algunas extensiones de tiempo real
    para evitar ejecuciones defectuosas del b&uacute;fer durante el
    proceso de escritura que requieren permisos de ra&iacute;z
    tambi&eacute;n. La mejor soluci&oacute;n por lo tanto consiste en
    utilizar SUID en cdrecord y cdda2wav. &iquest;C&oacute;mo?
    &iquest;SUID? No te preocupes. Puedes leer el art&iacute;culo de
    Guido sobre los archivos de permisos <A href=
    "../January1999/article77.html">file permissions</A> si deseas
    saber exactamente de qu&eacute; se trata pero por el momento es
    suficiente con que escribas los dos comandos siguientes y luego te
    olvides de ello :-)

    <P class="code">chmod 4111 /usr/bin/cdrecord<BR>
    chmod 4111 /usr/bin/cdda2wav</P>
    Debes saber que esto podr&iacute;a implicar un riesgo de seguridad
    potencial pero desde ya este riesgo ser&aacute; menor que decirle a
    todo el mundo que quiera quemar un CD c&uacute;al es la
    contrase&ntilde;a del usuario ra&iacute;z. <BR>
    Ahora puedes comprobar si tus dispositivos para grabar CDs son
    reconocidos correctamente. Simplemente ejecuta:

    <P class="code">cdrecord -scanbus</P>
    Si todo est&aacute; bien, deber&iacute;as ver algo como:<BR>
    <BR>
    0,6,0 6) 'PLEXTOR ' 'CD-ROM PX-W8220T ' '1.03' Removable CD-ROM<BR>
    <BR>
    Los n&uacute;meros y la descripci&oacute;n pueden variar de acuerdo
    con la configuraci&oacute;n de tu hardware.<BR>
    Otra alternativa es hacer click en el bot&oacute;n CONFIGURACION
    (Set Up) de xcdroast o koncd y comprobar all&iacute; si tu
    quemadora es reconocida correctamente.<BR>
     As&iacute; que ahora s&iacute;, empecemos a quemar un CD.<BR>


    <A NAME="227lfindex2">&nbsp;</A>
<H2>Notas generales sobre quemar CDs</H2>

    Existen cuatro pasos necesarios para grabar CDs:<BR>

    <OL>
      <LI>Tienes que seleccionar el/la dato/m&uacute;sica que deseas
      quemar en el CD.</LI>

      <LI>Tienes que establecer algunas opciones para el CD que vas a
      quemar. Por ejemplo, cuando deseas quemar un CD de audio, debes
      elegir entre los modos TAO y DAO o para un CD de datos debes
      establecer algunas opciones para el sistema de archivos.</LI>

      <LI>Debes crear un directorio de imagen con los archivos que
      deseas quemar en el CD. Si lo &uacute;nico que deseas es duplicar
      un CD por completo, "grabar&aacute;s sobre la marcha", de lo
      contrario primero tendr&aacute;s que crear una imagen en el disco
      duro.<BR>
      Un directorio de imagen es un lugar de almacenaje temporario para
      los datos que se grabar&aacute;n en el CD. Para los CDs de audio
      son archivos &iacute;ndice (index files) y archivos wav (wav
      files) que contienen la m&uacute;sica en tanto que para los CDs
      de datos &eacute;ste es un gran archivo llamado imagen ISO (ISO
      image).</LI>

      <LI>Quemas el CD.</LI>
    </OL>
    Generalmente los CDs necesitan grabarse "de una sola vez" y no debe
    interrumpirse el flujo de datos durante el proceso de
    grabaci&oacute;n. Gracias a las extensiones de tiempo real las
    ejecuciones defectuosas del b&uacute;fer que resultan en CDs que
    presentan fallas son s&oacute;lo un problema para usuarios de
    Windows. Con Linux realmente no necesitas "prueba de quemado"
    ("burn proof"). Hay una quemadora especial llamada FIFO dentro de
    la grabadora de CDs para compensar peque&ntilde;os inconvenientes
    la que, en general, resulta suficiente para evitar fallas al quemar
    CDs con Linux. De todos modos deber&iacute;as tener
    precauci&oacute;n y no hacer cosas que demanden demasiada
    energ&iacute;a a tu CPU. Puedes buscar en la Web, compilar
    software, ... pero borrar un archivo grande puede llegar a ser un
    problema y tal vez sea suficiente para perjudicar al proceso que
    resulta luego en CDs defectuosos. <BR>
    Si te preocupan las ejecuciones defectuosas del b&uacute;fer puedes
    utilizar la opci&oacute;n de grabaci&oacute;n simulada (dummy
    write) para ver primero si grabar CDs funcionar&iacute;a, antes de
    iniciar un proceso de quemado. As&iacute;, el proceso de quemar CDs
    se prueba con datos reales pero el l&aacute;ser que se encuentra
    dentro de la grabadora de CDs est&aacute; apagado. Siempre es mejor
    realizar una prueba antes que empezar a hacer todo de nuevo.<BR>
     El hecho de que generalmente tengas que quemar "de una sola vez"
    significa que si te has olvidado de algo, a&uacute;n si se tratara
    de un &uacute;nico peque&ntilde;o archivo, tendr&aacute;s que
    quemar el CD de nuevo. Existe la posibilidad de una
    multisesi&oacute;n en donde puedes agregar algo m&aacute;s tarde
    pero no trataremos ese tema aqu&iacute; porque mediante una
    multisesi&oacute;n no podr&aacute;s leer el CD en muchas grabadoras
    de CD ya que no se encuentra contemplada esta opci&oacute;n y el
    precio de un CD es tan bajo que nunca hemos encontrado una buena
    raz&oacute;n para utilizarla.<BR>


    <A NAME="227lfindex3">&nbsp;</A>
<H2>Configuraci&oacute;n</H2>

    Al iniciar koncd o xcdroast advertir&aacute;s que ambos tienen un
    bot&oacute;n de configuraci&oacute;n. Aqu&iacute;
    descubrir&aacute;s si tu quemadora es reconocida correctamente y
    establecer&aacute;s opciones generales.<BR>
    <A href=
    "../../common/images/article227/xcdroast_configfirst.gif"><IMG src=
    "../../common/images/article227/xcdroast_configfirst_th.gif" width=
    "198" height="82" alt="[xcdroast: run as root to configure]" align=
    "right"></A> Observemos la configuraci&oacute;n de xcdroast y
    koncd:<BR>

    <UL>
      <LI>
        xcdroast:<BR>
        La primera vez encontrar&aacute;s una ventana contextual que
        indica que la ra&iacute;z deber&iacute;a iniciar el programa
        primero y configurarlo para que cada usuario no tenga que
        hacerlo todo otra vez.<BR>

        <UL>
          <LI>Buscar dispositivos: aqu&iacute; ver&aacute;s todos los
          dispositivos conectados a tu bus SCSI.</LI>

          <LI>Configuraci&oacute;n CD: aqu&iacute; puedes seleccionar
          tu quemadora de CD y el dispositivo desde donde
          deber&iacute;an leerse el/la dato/m&uacute;sica.<BR>
          Para el " Modo de Grabaci&oacute;n " (CD writer mode) debes
          indicar el controlador correcto pero generalmente
          "autodetectar " ("autodetect") deber&iacute;a estar bien.<BR>
           El Tama&ntilde;o de Buffer FIFO de la grabadora: esto
          depende de tu hardware. Debes remitirte al manual de tu
          grabadora de CD para ver el tama&ntilde;o. Los valores
          comunes para la quemadora son 4MB o 8MB.<BR>
          Como el CD debe grabarse sin interrupci&oacute;n en el flujo
          de datos (dado el dise&ntilde;o de las quemadoras de CD)
          existe una quemadora (=FIFO) que la evita, simplemente porque
          los peque&ntilde;os inconvenientes causar&aacute;n la falla
          en el proceso de quemado.</LI>

          <LI>Configuraci&oacute;n Disco Duro: aqu&iacute; necesitas
          especificar un directorio de almacenaje temporario para la
          imagen ISO. Deber&iacute;a haber m&aacute;s de 800MB de
          espacio libre disponible (puedes comprobar c&uacute;al es tu
          espacio libre con el comando de shell df -k /the/directory o
          utilizando un administrador de archivos).</LI>

          <LI>
            Miscel&aacute;nea:<BR>

            <UL>
              <LI>Audio: esto s&oacute;lo te interesar&aacute; si
              quieres que xcdroast toque las canciones, no tiene
              influencia alguna sobre el proceso de quemado. DSP
              significa procesador de se&ntilde;ales digitales y es la
              parte que env&iacute;a el sonido al parlante.</LI>

              <LI>Red: para muchos CDs existe informaci&oacute;n sobre
              los t&iacute;tulos disponibles en una base de datos en
              Internet. Al quemar tu CD puedes solicitar esta
              informaci&oacute;n la que te ahorrar&aacute; mucho tiempo
              de grabaci&oacute;n si as&iacute; lo deseas.</LI>

              <LI>Hist&oacute;ricos: para crear un archivo
              hist&oacute;rico.</LI>

              <LI>Internacionalizaci&oacute;n: aqu&iacute; puedes
              elegir tu idioma y todo aparecer&aacute; en el que hayas
              elegido.</LI>
            </UL>
          </LI>

          <LI>Opciones: aqu&iacute; puedes establecer, por ejemplo, si
          deseas recibir avisos, en los botones de opciones al
          se&ntilde;alarlos con el puntero del mouse. Te recomendamos
          tener estos avisos particularmente en el caso de que no
          conozcas bien el programa.</LI>

          <LI>Usuarios: este panel aparece &uacute;nicamente si
          est&aacute;s registrado como usuario ra&iacute;z. Aqu&iacute;
          podr&aacute;s establecer qu&eacute; es lo que a los usuarios
          normales se les permite hacer.</LI>
        </UL>
        <BR>
         <IMG src="../../common/images/article227/koncd_setup.gif"
        width="206" height="198" alt="[koncd_setup]" align="right">
      </LI>

      <LI>koncd:<BR>
      Ves los dispositivos que koncd detect&oacute;
      autom&aacute;ticamente en un cuadro de selecci&oacute;n. Le
      puedes indicar al programa qu&eacute; grabadora de CD debe
      utilizar durante el proceso de quemado (&eacute;sta
      deber&iacute;a ser tu quemadora de CD) y desde donde
      deber&iacute;a leer los CDs. Podr&iacute;a ser tu CD ROM o si
      s&oacute;lo tienes esta quemadora de CD se la puede utilizar
      entonces para leer y grabar CDs. Aqu&iacute; tambi&eacute;n
      puedes seleccionar "prueba de quemado" (burn proof) si es
      compatible con tu quemadora de CD. Realizar la prueba de quemado
      disminuye la velocidad de tu grabadora de CD cuando FIFO (ver
      arriba) est&aacute; casi vac&iacute;a.</LI>
    </UL>

    <A NAME="227lfindex4">&nbsp;</A>
<H2>(Pura) m&uacute;sica CDs (de audio)</H2>

    Aqu&iacute; deber&iacute;as pensar un poco en el formato primero.
    Si la canci&oacute;n es de otro CD no hay problema. Simplemente
    puedes continuar y copiarla. Si fuera de otro modo, deber&iacute;as
    tener en cuenta que cdrecord reconoce archivos au y wav y los
    convierte autom&aacute;ticamente al formato correcto para tocarlos
    en tu lectora de CD pero en el caso de otros formatos
    necesitar&aacute;s convertirlos a wav primero si m&aacute;s tarde
    no quieres o&iacute;r s&oacute;lo ruido en tu CD. Para convertir un
    archivo de mp3 en wav puedes hacer lo siguiente en la l&iacute;nea
    de comandos:<BR>
    mpg123 -w /tmp/song.wav song.mp3<BR>
    Esto te permite conseguir CDs normales de audio de m&uacute;sica
    mp3. Ocupa m&aacute;s espacio pero se puede ejecutar en
    pr&aacute;cticamente todas las lectoras de CD. <BR>
    Cuando finalmente quemes el CD puedes elegir si deseas que la copia
    est&eacute; en modo TAO o DAO. En el modo TAO contar&aacute;s con 2
    segundos de pausa entre cada canci&oacute;n mientras que en el modo
    DAO no tendr&aacute;s esa posibilidad lo que lo convierte en el
    modo de elecci&oacute;n para m&uacute;sica grabada en vivo. TAO=
    Track at Once (Pista de inmediato) y DAO= Disk at Once (Disco de
    inmediato).<BR>
    Puedes copiar un CD por completo o mezclar canciones de CDs
    diferentes, u otros archivos de sonido, por ejemplo aqu&eacute;llos
    que bajas de Internet.<BR>
    <BR>
    Veamos primero c&oacute;mo puedes copiar un CD sin cambios:<BR>
     <BR>


    <CENTER>
      <A href="../../common/images/article227/xcdroast_dupcd.gif"><IMG
      src="../../common/images/article227/xcdroast_dupcd_th.gif" width=
      "399" height="282" alt="[xcdroast Duplicate CD]"></A>
    </CENTER>
    <BR>


    <UL>
      <LI>
        xcdroast:<BR>
        Selecciona "Duplicar".<BR>
        A tu izquierda encontrar&aacute;s un men&uacute; en el que
        podr&aacute;s ver:<BR>
        Informaci&oacute;n Imagen CD, Leer CD, Verificar CD, Escuchar
        Pistas Audio (CD/Image Info, Read Tracks, Verify CD, Play
        Audio-Tracks):<BR>
        Desconocemos la causa por la cual estas entradas al men&uacute;
        se encuentran disponibles. No tienen sentido alguno si
        s&oacute;lo quieres duplicar un CD. Al menos en la
        versi&oacute;n utilizada en este art&iacute;culo
        (xcdroast-0.98alpha9) xcdroast s&oacute;lo te permite "grabar
        en la marcha" para lo cual s&oacute;lo necesitas el men&uacute;
        "Grabar CD". Por lo tanto recurre directamente a "Grabar CD "
        (Write CD).<BR>
         Grabar CD:

        <UL>
          <LI>En la parte superior nuevamente debes especificar el
          dispositivo desde el c&uacute;al leer&aacute; y a qu&eacute;
          velocidad. Luego selecciona la quemadora de CD y su
          velocidad. La velocidad de la lectora deber&iacute;a ser un
          poco m&aacute;s alta que la de grabaci&oacute;n (para evitar
          ejecuciones defectuosas del b&uacute;fer).</LI>

          <LI>A la izquierda ver&aacute;s "CD a Grabar" (CD to
          write)<BR>
          Esto es s&oacute;lo para tu informaci&oacute;n. No tienes
          otra elecci&oacute;n m&aacute;s que "grabar en la
          marcha".</LI>

          <LI>A la derecha ver&aacute;s "par&aacute;metros de
          grabaci&oacute;n" (write parameters)<BR>
          CD del tipo R/RW (CD-R/RW type): aqu&iacute; deber&aacute;s
          especificar c&uacute;antos minutos corresponder&aacute;n al
          CD al que le est&aacute;s quemando m&uacute;sica<BR>
           y luego tienes que elegir entre los modos TAO o DAO (ver
          arriba).<BR>
          Puedes entonces realizar una simulaci&oacute;n de
          grabaci&oacute;n primero (ver arriba) y si deseas que el CD
          sea expulsado una vez concluido el proceso de quemado.
          "Rellenar pistas" no es importante cuando se duplican
          CDs.<BR>
          Con "Borrar CD-RW" (Blank CD-RW) puedes borrar CDs
          regrabables y finalmente con "Grabar CD" (Write CD) puedes
          quemar tu CD. Eso es todo.</LI>
        </UL>
      </LI>

      <LI>koncd:<BR>
      Elige "Copiar CD" (Copy CD).<BR>
      En la parte superior puedes borrar el contenido de un CD
      regrabable y establecer la velocidad de quemado. En "opciones"
      (options) no necesitas realizar ninguna selecci&oacute;n.
      Presiona "Inicio" (START) y all&iacute; comienza el proceso de
      quemado.</LI>
    </UL>
    <BR>
    Veamos ahora qu&eacute; debes hacer si quieres quemar un CD con
    m&uacute;sica de varios lugares:<BR>

    <UL>
      <LI>
        xcdroast<BR>
        Ahora debes seleccionar "Crear CD" (Create CD).<BR>

        <CENTER>
          <A href=
          "../../common/images/article227/xcdroast_createcd.gif"><IMG
          src="../../common/images/article227/xcdroast_createcd_th.gif"
          width="399" height="282" alt="[xcdroast Create CD]"></A>
        </CENTER>
        <BR>
         Veamos el men&uacute;:<BR>

        <UL>
          <LI>Informaci&oacute;n Imagen CD: CD/Image info<BR>
          A la izquierda ves el contenido del CD del que se lee. A la
          derecha ves el contenido del directorio de imagen si tienes
          algo all&iacute;. No hay nada para hacer aqu&iacute;. Sigue
          directamente con "Leer pistas" (Read Tracks)</LI>

          <LI>Leer pistas (Read Tracks):<BR>
          En la parte superior debes elegir el dispositivo desde donde
          deber&iacute;a leerse la m&uacute;sica y el directorio de
          imagen. Ahora en este caso se grabar&aacute;n las pistas como
          archivos wav individuales y no como un &uacute;nico gran
          archivo imagen. Para CDs de m&uacute;sica no deber&iacute;as
          establecer una velocidad muy alta porque los CDs de audio
          est&aacute;n preparados para ser le&iacute;dos a "1 x" de
          velocidad y una velocidad mayor aumenta la posibilidad de
          errores bit lo que reduce la calidad. Sin embargo una
          velocidad de "4 x" o "8 x" ser&iacute;a apropiada.<BR>
          Para leer las pistas de m&uacute;sica en el directorio de
          imagen, selecciona las pistas que quieres copiar y luego
          presiona LEER PISTAS SELECCIONADAS (Read selected
          tracks).</LI>

          <LI>Verificar pistas: (Verify CD)<BR>
          Si presionas el bot&oacute;n VERIFICAR (verify) se verifica
          que la lectura de las pistas de m&uacute;sica se
          realiz&oacute; sin errores bit.</LI>

          <LI>Escuchar Pistas Audio (Play Audio-Tracks):<BR>
          Mediante esto puedes escuchar las canciones como se
          encuentran en el directorio de imagen. Para seleccionar una
          canci&oacute;n que deseas escuchar debes hacer doble click en
          ella.</LI>

          <LI>Masterizar pistas (Master tracks):<BR>
          Esto es &uacute;nicamente para CDs de datos. Ign&oacute;ralo
          por el momento.</LI>

          <LI>Borrar pistas (Delete Tracks):<BR>
          Aqu&iacute; puedes ver c&uacute;anto espacio ya has utilizado
          y c&uacute;anto te queda. Asimismo puedes borrar todas o
          algunas pistas del directorio de imagen de acuerdo con tus
          preferencias.</LI>

          <LI>Grabar pistas (Write Tracks):<BR>
          Aqu&iacute; primero necesitas ir al segundo panel "Preparar
          las pistas" (Layout tracks). A la derecha ver&aacute;s el
          contenido del directorio de imagen. Selecciona las pistas y
          presiona "a&ntilde;adir" (add) para copiarlas a la izquierda
          en el panel para pistas de grabaci&oacute;n. Regresa al panel
          " Grabar pistas" (write tracks). Aqu&iacute;
          encontrar&aacute;s las mismas opciones que ya se explicaron
          en " Duplicar CD" (Duplicate CD). Pero ahora debes
          seleccionar la opci&oacute;n " Rellenar pistas" (PAD tracks).
          Esto asegura que todos los wavs se encuentran apropiadamente
          terminados en el entorno del sector. El formato Audio CD
          requiere que todos los archivos wav sean m&uacute;ltiplos de
          2352 Bytes de extensi&oacute;n. " Rellenar pistas"(PAD
          tracks) agrega algunos cero-bytes para asegurar la
          extensi&oacute;n correcta. Presiona " Grabar pistas" (WRITE
          CD) para quemar el CD.</LI>
        </UL>
      </LI>

      <LI>koncd:<BR>
      Elige "audio CD". La versi&oacute;n utilizada para este
      art&iacute;culo (0.7.5) a&uacute;n no cuenta con la posibilidad
      de leer pistas de audio individuales desde otro CD de audio. Sin
      embargo puedes seleccionar un n&uacute;mero de archivos wav en
      alguna parte de tu disco duro y grabarlas como pistas audio en el
      CD. Haz click en "Agregar pistas" (Add track) y a&ntilde;ade
      varios archivos wav a la lista de pistas seleccionadas. En
      "opciones" (options) selecciona "Usar relleno" (Use padding) y
      luego haz un click en "Inicio" (Start) para quemar tu CD.</LI>
    </UL>

    <A NAME="227lfindex5">&nbsp;</A>
<H2>(Puros) Datos en CDs</H2>

    Para los CDs de datos necesitas un sistema de archivos o como a
    menudo se dice, el CD debe estar formateado. Debes elegir
    qu&eacute; sistema de archivos deseas. Esta decisi&oacute;n
    depender&aacute; del/de los sistema(s) operativo(s) que desees
    puedan leer los datos. El ISO-9660 standard que describe el sistema
    de archivos de CD, por ejemplo, no permite nombres de archivos
    largos. Por lo tanto las extensiones han sido pensadas para este
    standard. Para Linux y Unix se utilizan extensiones RockRidge,
    mientras que Microsoft utiliza extensiones Joliet.Con el formato
    RockRidge tambi&eacute;n puedes tener permisos, etc. como ya
    conoces del sistema. <BR>
    La soluci&oacute;n recomendada es utilizar extensiones RockRidge y
    Joliet en el mismo CD.<BR>
    Si simplemente deseas copiar un CD de otro CD existente no debes
    preocuparte por ello porque en ese caso el CD ya cuenta con un
    sistema de archivos el que tambi&eacute;n se copia.<BR>

    <UL>
      <LI>xcdroast:<BR>
      Elige " Duplicar CD" (Duplicate CD)<BR>
      y luego sigue los pasos que se describieron arriba. Simplemente
      dir&iacute;gete a "Grabar CD" (Write CD)</LI>

      <LI>koncd:<BR>
      Elige "Copiar CD" (Copy CD) ( ver arriba).</LI>
    </UL>
    <BR>


    <CENTER>
      <A href="../../common/images/article227/xcdroast_master.gif"><IMG
      src="../../common/images/article227/xcdroast_master_th.gif"
      width="399" height="282" alt="[xcdroast Master CD]"></A>
    </CENTER>
    <BR>
     Si deseas copiar datos de tu disco duro :<BR>

    <UL>
      <LI>
        xcdroast:<BR>
        Elige " Crear CD" (Create CD) y luego "Masterizar pistas"
        (Master tracks) del men&uacute; que se encuentra a la
        izquierda.<BR>

        <UL>
          <LI>En "Masterizar la fuente" (Master source) eliges los
          directorios que deseas grabarle a tu CD. Tambi&eacute;n
          puedes elegir las rutas y los nombres que estos directorios
          deber&iacute;an tener en el CD (utiliza el bot&oacute;n
          "redirigir" (redirect) que se encuentra a la izquierda para
          poder hacer esto.</LI>

          <LI>Opciones ISO 9660:<BR>
          Puedes elegir uno de los tipos de imagen predefinidos:
          Simplemente utiliza RockRidge + Joliet si deseas que tu CD
          pueda ser le&iacute;do por computadoras con Linux y
          Windows.</LI>

          <LI>En las opciones de arranque puedes crear CDs susceptibles
          de ser iniciados pero esto va m&aacute;s all&aacute; de lo
          que tratamos en este art&iacute;culo. Si deseas un CD que se
          pueda iniciar te recomendamos que utilices una de las
          im&aacute;genes ISO preconstruidas (consulta las referencias
          que se encuentran al final del art&iacute;culo)</LI>

          <LI style="list-style: none">.</LI>

          <LI>Crear sesi&oacute;n/imagen (Create session/image): Este
          es el panel m&aacute;s importante. Aqu&iacute; puedes crear
          ahora una imagen ISO de los archivos seleccionados en el
          primer panel. Para ello presiona el bot&oacute;n "masterizar
          imagen al archivo" (master image to file).<BR>
          Siempre elige "fijaci&oacute;n" (fixation) (o mejor: no
          elijas "No fijar despu&eacute;s de grabar" (Do not fixate
          after write) a menos que desees hacer una multisesi&oacute;n.
          De otro modo, si no eliges fijaci&oacute;n, no se
          crear&aacute; una Tabla de Contenidos (TOC= Table of
          Contents) y muchas lectoras no podr&aacute;n leer tu CD.</LI>
        </UL>
        Ahora vayamos a "Grabar pistas" (Write tracks):<BR>
        Aqu&iacute; utilizas la imagen que creaste en el panel
        "Masterizar pistas"(Master tracks). En el panel "Preparar las
        pistas" (Layout tracks), selecciona tu imagen y presiona
        "a&ntilde;adir" (add). Luego regresa al panel "Grabar pistas"
        (Write tracks) y presiona el bot&oacute;n que aparece al final
        "Grabar pistas" (Write tracks). Ahora has quemado tu CD.
      </LI>
    </UL>

    <CENTER>
      <A href="../../common/images/article227/koncd_mster.gif"><IMG
      src="../../common/images/article227/koncd_mster_th.gif" width=
      "279" height="242" alt="[koncd Master CD]"></A>
    </CENTER>

    <UL>
      <LI>koncd:<BR>
      Copia todos los archivos que quieras grabar en el CD en un
      directorio (Utilizando o bien el comando shell cp o un
      administador de archivos).<BR>
      Abre koncd y elige "Masterizar CD" (Master CD).<BR>
      En "datos" (data) debes indicar el directorio fuente en donde
      copiaste los archivos. Ahora cuentas con varias posibilidades
      para crear el CD. Te sugerimos crear una imagen ISO primero y
      luego grabar la imagen en tu CD. En Dato-&gt; "archivo de imagen"
      ( Data -&gt; "image file") ingresa el nombre del archivo de
      imagen que ser&aacute; creado. La versi&oacute;n utilizada para
      este art&iacute;culo requiri&oacute; que el archivo ya existiera.
      Por lo tanto crea un archivo vac&iacute;o llamado "imagen"
      (image) con el comando shell "imagen al tacto" (touch image).<BR>
      En "opciones" (options) debes hacer click en "Crear Imagen CD"
      (Create CD image), presionar "calcular tama&ntilde;o" (calculate
      size) a la derecha y luego "Inicio" (start). Una vez que la
      imagen haya sido creada, haz un click en la opci&oacute;n "Grabar
      CD" (Write CD) y desactiva "Crear Imagen de CD" (Create
      CD-image). Ahora la grabadora de CD quemar&aacute; el CD por
      t&iacute;.</LI>
    </UL>

    <A NAME="227lfindex6">&nbsp;</A>
<H2>Copia de seguridad de tu directorio de inicio</H2>

    Basicamente puedes realizar una copia de seguridad de absolutamente
    todo en CD con el m&eacute;todo que describimos en "(Puros) datos
    en CDs". Si los datos en tu directorio de inicio son muchos y
    exceden la capacidad del CD entonces debes seleccionar
    sub-directorios individuales y grabarlos en un CD diferente.<BR>


    <A NAME="227lfindex7">&nbsp;</A>
<H2>Consejos y trucos:</H2>

    Puede resultar &uacute;til verificar si la imagen ISO es correcta
    antes de proceder a quemarla. Para ello puedes insertar la imagen
    ISO como si se tratara de un CD real:

    <P class="code">Cambiar a ra&iacute;z: su -<BR>
    Crear un directorio vac&iacute;o (conocido como punto de
    inserci&oacute;n): mkdir /tmp/mycd<BR>
    Insertar la imagen ISO (conectar la imagen ISO al directorio):<BR>
    mount -o loop -t iso9660 Image.iso /tmp/mycd<BR>
    Ahora puedes utilizar el comando "ls" para inspeccionar la imagen
    del CD: ls /tmp/mycd<BR>
    Si se ve bien, ret&iacute;rala: umount /tmp/mycd</P>
    ... y quema la imagen en tu CD.<BR>


    <A NAME="227lfindex8">&nbsp;</A>
<H2>Herramientas de la l&iacute;nea de comandos</H2>

    Arriba hemos visto dos aplicaciones gr&aacute;ficas de interfaz
    para quemar CDs pero tambi&eacute;n se pueden quemar CDs utilizando
    &uacute;nicamente la l&iacute;nea de comandos. Si observas la
    p&aacute;gina principal de cdrecord ver&aacute;s que existen
    cientos de opciones, uuuhh... no te asustes. Es mucho m&aacute;s
    f&aacute;cil de lo que parece al principio. Baja las dos secuencias
    de comandos Perl cdrecordeasy y mkisofseasy. <BR>
    Est&aacute;n incluidas en el paquete easycdscripts <A href=
    "../../common/src/article227/">easycdscripts (download
    page)</A><BR>
    Debes deshacerlas con el comando

    <P class="code">tar zxvf easycdscripts-0.1.tar.gz</P>
    Ahora ejecuta el comando cdrecord -scanbus. Observa la l&iacute;nea
    donde ves tu quemadora de CD y memoriza los n&uacute;meros que
    aparecen al principio. Deber&iacute;an ser algo como 0,4,0 or 0,6,0
    ....<BR>
    Edita el archivo cdrecordeasy ingresando este n&uacute;mero al
    final de la l&iacute;nea que dice $dev=... La encontrar&aacute;s en
    alguna parte al comienzo.<BR>
     Ahora la instalaci&oacute;n de tus dos peque&ntilde;as scripts ha
    terminado. Crear un CD de datos ahora es muy f&aacute;cil:<BR>

    <OL>
      <LI>Copia todos los archivos que quieres tener en un CD en un
      directorio (e.g ~/cdrom). Los discos duros son grandes y
      econ&oacute;micos actualmente y no deber&iacute;a constituir un
      problema copiar unos pocos cientos MB.</LI>

      <LI>Ejecuta el comando: mkisofseasy ~/image.iso ~/cdrom<BR>
      Esto crear&aacute; una imagen ISO image de todos los archivos en
      el directorio ~/cdrom.</LI>

      <LI>Quema el CD ejecutando el comando: cdrecordeasy
      ~/image.iso<BR>
      </LI>
    </OL>
    Eso es todo. &iquest;No es mucho m&aacute;s f&aacute;cil de lo que
    parec&iacute;a al principio?:-)<BR>
     &iexcl;Qu&eacute; te diviertas con tus CDs!<BR>
    <BR>

    <A NAME="227lfindex9">&nbsp;</A>
<H2>Referencias</H2>


    <UL>
      <LI><A href=
      "http://www.linuxdoc.org/HOWTO/CD-Writing-HOWTO.html">CD Writing
      Howto: linuxdoc.org</A>(El HowTo para grabar CDs)<BR>
      </LI>

      <LI><A href=
      "http://www.ibiblio.org/pub/Linux/docs/HOWTO/mini/other-formats/html_single/MP3-CD-Burning.html">
      Linux MP3 CD Burning mini-HOWTO: linuxdoc.org</A>(C&oacute;mo
      lograr CDs de audio normales de archivos mp3)<BR>
      </LI>

      <LI><A href="http://mobilix.org/linux_usb_cd.html">USB CD howto:
      mobilix.org/linux_usb_cd.html</A><BR>
       (El HowTo c&oacute;mo hacer de CD USB)</LI>

      <LI><A href="http://rescuecd.sourceforge.net/">A big bootable CD
      image: http://rescuecd.sourceforge.net/</A>(Una gran imagen de CD
      que puede ser iniciada)<BR>
      </LI>

      <LI><A href=
      "ftp://ftp.ibiblio.org/pub/Linux/system/recovery">(Varios CDs de
      arranque y Linux en sistemas de disco flexible)</A><BR>
      </LI>
    </UL>
    <!-- vim: set sw=2 ts=2 et: -->
  



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=227&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Katja and Guido Socher, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article227.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Katja and Guido Socher (<a href="mplural"><font size="1">homepage</font></a>)</font></td></tr>
  <tr><td><font size="2">en --&gt; es: Gabriela Gonz&aacute;lez &lt;tradugag(at)yahoo.com&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-01-20, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
