<HTML>
<HEAD>
<TITLE>BitchX Mini Como: Variables del Bitchx</TITLE>
</HEAD>
<BODY>
<A HREF="BitchX-Como-4.html">Anterior</A>
<A HREF="BitchX-Como-6.html">Siguiente</A>
<A HREF="BitchX-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Variables del Bitchx</A></H2>


<P>El BitchX tiene muchas variables que pueden transformar completamente su
aspecto y funcionamiento. Los <I>settings</I> actuales los puedes consultar
poniendo <CODE>set</CODE>. Estas variables son: </P>
<P>
<UL>
<LI><CODE>ainv NUM</CODE> si est&aacute; en ON invita al canal a los miembros de la
<I>Friend List</I>. 
</LI>
<LI><CODE>always_split_biggest ON-OFF</CODE> si est&aacute; en ON siempre parte la
ventana mayor. 
</LI>
<LI><CODE>aop ON-OFF</CODE> si est&aacute; en ON da el @ a los miembros de la
<I>Friend List</I>. 
</LI>
<LI><CODE>append_log ON-OFF</CODE> no destruye el Irclog en caso de que ya
exista, sino que escribe a continuaci&oacute;n. 
</LI>
<LI><CODE>autokick_on_version ON-OFF</CODE> echa del canal al que nos haga un
<CODE>ctcp version</CODE>. 
</LI>
<LI><CODE>auto_away ON-OFF</CODE> nos pone <I>away</I> al cabo de cierto tiempo
sin escribir. 
</LI>
<LI><CODE>auto_away_time NUM</CODE> fija el tiempo en segundos.
</LI>
<LI><CODE>auto_nslookup ON-OFF</CODE> intenta resolver autom&aacute;ticamente las
direcciones num&eacute;ricas. 
</LI>
<LI><CODE>auto_reconnect ON-OFF</CODE> cuando se corta la conexi&oacute;n con el server
intenta conectarse de nuevo. 
</LI>
<LI><CODE>auto_rejoin NUM</CODE> si est&aacute; a 1 intenta entrar de nuevo en el canal
cuando nos echan de &eacute;l. 
</LI>
<LI><CODE>auto_response 0/1</CODE> desactiva/activa esta opci&oacute;n.
</LI>
<LI><CODE>auto_response_str CADENA</CODE> CADENA es una lista de palabras que
activan esta <I>feature</I>. Por defecto se le asigna el nick y es la
que hace que cuando alguien escribe una linea que comienza por nuestro
nick, el suyo aparezca resaltado. 
</LI>
<LI><CODE>auto_unban NUM</CODE> tiempo en segundos en quitar un <I>ban</I> que
hayamos puesto. 
</LI>
<LI><CODE>auto_unmark_away ON-OFF</CODE> nos quita el estado de <I>away</I> cuando
volvemos a escribir.
</LI>
<LI><CODE>auto_whowas ON-OFF</CODE> hace un whowas autom&aacute;tico cuando hacemos un
<CODE>/whois</CODE>.
</LI>
<LI><CODE>beep ON-OFF</CODE> activa o desactiva los <I>beeps</I>.
</LI>
<LI><CODE>beep_always ON-OFF</CODE> pita siempre.
</LI>
<LI><CODE>beep_max NUM</CODE> n&uacute;mero m&aacute;ximo de pitidos.
</LI>
<LI><CODE>beep_on_msg  MSGS</CODE> pita cuando nos mandan un privado.
</LI>
<LI><CODE>beep_when_away NUM</CODE> pita aunque estemos away.
</LI>
<LI><CODE>bitchx_help RUTA</CODE> fija la ruta al fichero <CODE>BitchX.help</CODE>
(normalmente en <CODE>~/.BitchX/BitchX.help</CODE>). 
</LI>
<LI><CODE>blink_video ON-OFF</CODE> activa o desactiva el "parpadeo".
</LI>
<LI><CODE>bold_video ON-OFF</CODE> activa o desactiva la "negrita".
</LI>
<LI><CODE>bot_log ON-OFF</CODE> graba la actividad del bot.
</LI>
<LI><CODE>bot_logfile FILE</CODE> fichero donde est&aacute; el log del bot (normalmente
tcl.log).
</LI>
<LI><CODE>bot_mode ON-OFF</CODE> activa o no el modo bot.
</LI>
<LI><CODE>BOT_PASSWD PASSWD</CODE> fija la contrase&ntilde;a para acceder al bot. 
</LI>
<LI><CODE>cdcc_flood_after NUM</CODE> n&uacute;mero de m&aacute;ximos mensajes del tipo <I>cdcc</I>. 
</LI>
<LI><CODE>cdcc_flood_rate NUM</CODE> velocidad m&aacute;xima del flood.
</LI>
<LI><CODE>cdcc_prompt CADENA</CODE> cadena para mostrar el <I>prompt</I> en los cdcc.
</LI>
<LI><CODE>cdcc_security NUM</CODE> rechaza o no los cdcc potencialmente
peligrosos (por ejemplo un .rhost ;) ). 
</LI>
<LI><CODE>cd_device DEV</CODE> dispositivo donde est&aacute; el cdrom (normalmente
<CODE>/dev/cdrom</CODE>). 
</LI>
<LI><CODE>change_nick_on_kill ON-OFF</CODE> cambia de nick cuando nos echan de un
canal.
</LI>
<LI><CODE>channel_name_width NUM</CODE> n&uacute;mero de caracteres para mostrar el
nombre del canal (0 para infinito). 
</LI>
<LI><CODE>client_information</CODE> fija la informaci&oacute;n del cliente que se
dar&aacute; a los que nos hacen un <CODE>/version</CODE>. 
</LI>
<LI><CODE>cloak NUM</CODE> si est&aacute; a 1 no contestar&aacute; a los <I>ctcp versions</I>.
</LI>
<LI><CODE>clock ON-OFF</CODE> muestra el reloj en la barra de estado.
</LI>
<LI><CODE>clock_24hour ON-OFF</CODE> muestra el reloj con formato 12/24 horas.
</LI>
<LI><CODE>clock_format CADENA</CODE> fija el formato del reloj.
</LI>
<LI><CODE>clone_check 0</CODE> busca clones en el canal.
</LI>
<LI><CODE>clone_count 0</CODE> n&uacute;mero m&aacute;ximo de clones.
</LI>
<LI><CODE>cmdchars</CODE> establece con qu&eacute; car&aacute;cter empiezan los comandos
(normalmente con un <CODE>/</CODE>).
</LI>
<LI><CODE>command_mode ON-OFF</CODE> hace que todo lo que se escriba sea
interpretado como un comando. 
</LI>
<LI><CODE>connect_timeout TIEMPO</CODE> tiempo m&aacute;ximo despu&eacute;s del cual nos
desconecta si no hay respuesta del servidor (en segundos). 
</LI>
<LI><CODE>continued_line CADENA</CODE> cadena con la que nos indica que un l&iacute;nea
se sale de la pantalla. 
</LI>
<LI><CODE>ctcp_delay NUM</CODE> tiempo de espera antes de mandar/aceptar un ctcp.
</LI>
<LI><CODE>ctcp_flood_protection ON-OFF</CODE> activa la protecci&oacute;n
<I>anti-flood</I>. 
</LI>
<LI><CODE>ctcp_flood_ban ON-OFF</CODE> banea al que hace un <I>ctcp-flood</I>.
</LI>
<LI><CODE>ctcp_verbose ON-OFF</CODE> nos muestra toda la informaci&oacute;n en los ctcp .
</LI>
<LI><CODE>ctoolz_dir DIR</CODE> directorio donde est&aacute;n los scripts (normalmente
en <CODE>$HOME/.BitchX</CODE>). 
</LI>
<LI><CODE>dcc_autoget ON_OFF</CODE> activa la recogida autom&aacute;tica de los DCC.
</LI>
<LI><CODE>dcc_autorename ON-OFF</CODE> si al enviarnos un fichero por dcc este
ya existe lo renombra autom&aacute;ticamente. 
</LI>
<LI><CODE>dcc_bar_type NUM</CODE> tipo de barra de estado para los dcc.
</LI>
<LI><CODE>dcc_block_size NUM</CODE> tama&ntilde;o de los paquetes del dcc (normalmente
2049 bits). 
</LI>
<LI><CODE>dcc_dldir DIR</CODE> directorio donde guarda los dccs.
</LI>
<LI><CODE>dcc_fast ON-OFF</CODE> emula el formato r&aacute;pido de dcc del mirc. 
</LI>
<LI><CODE>dcc_get_limit NUM</CODE> n&uacute;mero m&aacute;ximo de dcc simultaneos. 
</LI>
<LI><CODE>dcc_max_autoget_size TAMA&Ntilde;O</CODE> tama&ntilde;o m&aacute;ximo de fichero para los dcc.
</LI>
<LI><CODE>dcc_queue_limit NUM</CODE> n&uacute;mero m&aacute;ximo de dcc en espera, una vez
superado este n&uacute;mero de peticiones se le dice al que pide un dcc que lo
intente m&aacute;s tarde. 
</LI>
<LI><CODE>dcc_send_limit NUM</CODE> n&uacute;mero m&aacute;ximo de dcc que se env&iacute;an
simult&aacute;neamente. 
</LI>
<LI><CODE>dcc_uldir DIR</CODE> directorio por defecto que usa para buscar
ficheros cuando los enviamos por dcc. 
</LI>
<LI><CODE>debug NUM</CODE> activa la informaci&oacute;n de debug.
</LI>
<LI><CODE>default_reason CADENA</CODE> cadena por defecto para los <I>reason</I>
</LI>
<LI><CODE>deopflood ON</CODE> quita el @ al que hace un flood.
</LI>
<LI><CODE>deopflood_time NUM</CODE> tiempo en segundos que se quita el @ 
al hacer un flood. 
</LI>
<LI><CODE>deop_on_deopflood NUM</CODE> quita el @ al hacer un deopflood.
</LI>
<LI><CODE>deop_on_kickflood NUM</CODE> quita el @ al hacer alguien un
kickflood.
</LI>
<LI><CODE>display ON</CODE> hace que se muestren o no los comandos al introducirlos. 
</LI>
<LI><CODE>display_ansi NUM</CODE> muestra caracteres ASCII.
</LI>
<LI><CODE>display_pc_characters NUM</CODE> muestra caracteres normales.
</LI>
<LI><CODE>double_status_line NUM</CODE> tama&ntilde;o de la barra de estado.
</LI>
<LI><CODE>eight_bit_characters ON-OFF</CODE> muestra caracteres de 8 bits (hay
que ponerlo en ON si se quieren ver los acentos y las e&ntilde;es). 
</LI>
<LI><CODE>exec_protection ON-OFF</CODE> activa la protecci&oacute;n de ejecuci&oacute;n de
Comandos mediante el comando <CODE>exec ORDEN</CODE>. 
</LI>
<LI><CODE>flood_after NUM</CODE> n&uacute;mero m&aacute;ximo de mensajes despu&eacute;s de los cuales
se considera un flood. 
</LI>
<LI><CODE>flood_kick ON-OFF</CODE> echa del canal al que hace flood.
</LI>
<LI><CODE>flood_protection ON-OFF</CODE> activa o desactiva la protecci&oacute;n contra
floods. 
</LI>
<LI><CODE>flood_warning ON-OFF</CODE> avisa al que hace flood.
</LI>
<LI><CODE>ftp_grab ON-OFF</CODE> guarda en un fichero las direcciones de ftp que
se mencionan en el canal.(se recuperan con el comando <CODE>/ftp</CODE> y se
guardan en el fichero <CODE>~/.BitchX/BitchX.ftp </CODE>. 
</LI>
<LI><CODE>full_status_line ON-OFF</CODE> muestra la linea de estado completa.
</LI>
<LI><CODE>hebrew_toggle ON-OFF</CODE> activa los caracteres hebreos.
</LI>
<LI><CODE>help_pager ON-OFF</CODE> muestra la ayuda paginada.
</LI>
<LI><CODE>help_path RUTA</CODE> ruta al fichero con la ayuda del irc
(normalmente en <CODE>/usr/local/lib/irc/help</CODE>. 
</LI>
<LI><CODE>help_prompt ON-OFF</CODE> muestra el prompt de la ayuda.
</LI>
<LI><CODE>hide_private_channels ON-OFF</CODE> esconde los canales privados.
</LI>
<LI><CODE>highlight_char INVERSE-NORMAL</CODE> muestra los colores brillantes
como inversos.
</LI>
<LI><CODE>history NUM</CODE> n&uacute;mero de lineas que guarda el bitchx en el buffer del
historial.
</LI>
<LI><CODE>http_grab ON-OFF</CODE> guarda en un fichero las direcciones de http
que se mencionan en el canal. (se recuperan con el comando <CODE>/http</CODE>
y se guardan en el fichero <CODE>~/.BitchX/BitchX.http</CODE>). 
</LI>
<LI><CODE>ident_hack FICHERO</CODE> fichero que guarda la identidad falsa que se
muestra al hacernos un <CODE>/who</CODE> (normalmente el fichero
<CODE>.authlie</CODE>). 
</LI>
<LI><CODE>ignore_time NUM</CODE> tiempo que duran los ignores.
</LI>
<LI><CODE>input_prompt CADENA</CODE> cadena de entrada.
</LI>
<LI><CODE>insert_mode ON-OFF</CODE> fija el modo de inserci&oacute;n o sobre escritura.
</LI>
<LI><CODE>inverse_video ON-OFF</CODE> muestra caracteres de video inverso. 
</LI>
<LI><CODE>joinflood ON</CODE> activa la protecci&oacute;n contra <I>joinfloods</I>.
</LI>
<LI><CODE>joinflood_time NUM</CODE> tiempo m&iacute;nimo en segundos entre cada
<CODE>join</CODE> para que no salte la alarma anti-flood.
</LI>
<LI><CODE>kickflood ON-OFF</CODE> activa la protecci&oacute;n contra <I>kickfloods</I>.
</LI>
<LI><CODE>kickflood_time NUM</CODE> tiempo m&iacute;nimo en segundos entre cada
<CODE>kick</CODE> para que no salte la alarma anti-flood.
</LI>
<LI><CODE>kick_if_banned ON-OFF</CODE> echa del canal al que nos banee.
</LI>
<LI><CODE>kick_on_deopflood NUM</CODE> echa al que hace flood de deops.
</LI>
<LI><CODE>kick_on_joinflood NUM</CODE> echa al que hace flood de joins.
</LI>
<LI><CODE>kick_on_kickflood NUM</CODE> echa al que hace flood de kicks.
</LI>
<LI><CODE>kick_on_nickflood NUM</CODE> echa al que hace flood de nicks.
</LI>
<LI><CODE>kick_on_pubflood  NUM</CODE> echa al que hace flood de publicos.
</LI>
<LI><CODE>kick_ops ON-OFF</CODE> permite el echar del canal a los ops.
</LI>
<LI><CODE>lamelist ON-OFF</CODE> guarda una lista de "enemigos".
</LI>
<LI><CODE>lastlog NUM</CODE> m&aacute;ximo n&uacute;mero de comandos que guarda en el buffer.
</LI>
<LI><CODE>lastlog_ansi ON-OFF</CODE> guarda el log en formato ansi.
</LI>
<LI><CODE>lastlog_level ALL</CODE> guarda todo lo que ocurre.
</LI>
<LI><CODE>llook ON-OFF</CODE> busca splits en la red del irc.
</LI>
<LI><CODE>llook_delay NUM</CODE> tiempo entre cada llook.
</LI>
<LI><CODE>load_path DIRECTORIO</CODE> directorio en el que busca los scripts
(normalmente $HOME/.BitchX). 
</LI>
<LI><CODE>log ON-OFF</CODE> guarda el log de la sesi&oacute;n.
</LI>
<LI><CODE>logfile FICHERO</CODE> fichero donde se guarda el log(normalmente en
IrcLog). 
</LI>
<LI><CODE>max_deops NUM</CODE> n&uacute;mero de deops seguidos a partir de los cuales
se considera que alguien est&aacute; haciendo flood. 
</LI>
<LI><CODE>max_idlekicks NUM</CODE> n&uacute;mero de mensajes de idle seguidos a partir
de los cuales se considera que alguien est&aacute; haciendo flood. 
</LI>
<LI><CODE>max_server_reconnect NUM</CODE> n&uacute;mero m&aacute;ximo de intentos de conexi&oacute;n
a un servidor. 
</LI>
<LI><CODE>mircs ON-OFF</CODE> detecta los mircs. 
</LI>
<LI><CODE>msglog ON-OFF</CODE> guarda un log de los mensajes mientras estamos away.
</LI>
<LI><CODE>msglog_file FICHERO</CODE> fichero donde se guardan los mensajes
mientras estamos away (normalmente en <CODE>~/.BitchX/BitchX.away</CODE>). 
</LI>
<LI><CODE>msglog_level MSGS-NOTICES-SEND_MSG</CODE> tipos de mensajes que se
guardan. 
</LI>
<LI><CODE>nickflood ON</CODE> activa la protecci&oacute;n contra <I>nickfloods</I>.
</LI>
<LI><CODE>nickflood_time NUM</CODE> tiempo m&iacute;nimo en segundos entre un cambio de
nick y otro para que no salte la alarma anti-flood. 
</LI>
<LI><CODE>nick_completion ON</CODE> activa la finalizaci&oacute;n autom&aacute;tica de nicks.
</LI>
<LI><CODE>nick_completion_char CARACTER</CODE> car&aacute;cter usado como separador en
el <CODE>nick completion</CODE>. 
</LI>
<LI><CODE>nick_completion_type NUM</CODE> tipo de <CODE>nick completion</CODE>.
</LI>
<LI><CODE>notify_level ALL</CODE> nivel de notificaci&oacute;n.
</LI>
<LI><CODE>no_ctcp_flood ON-OFF</CODE> Evita los ctcp floods.
</LI>
<LI><CODE>num_banmodes N</CODE> fija el tipo de ban.
</LI>
<LI><CODE>num_of_whowas N</CODE> fija el tipo de whowas.
</LI>
<LI><CODE>oper_modes </CODE> fija los modos de operador.
</LI>
<LI><CODE>ping_type N</CODE> fija el tipo de ping. 
</LI>
<LI><CODE>protect_channels *</CODE> canales en los que se usa la protecci&oacute;n
contra floods.
</LI>
<LI><CODE>pubflood ON-OFF</CODE> activa la protecci&oacute;n contra floods para los
<CODE>public</CODE>. 
</LI>
<LI><CODE>pubflood_time N</CODE> fije el tiempo (en minutos) que dura el ignore
despu&eacute;s de un public flood. 
</LI>
<LI><CODE>realname NOMBRE</CODE> nombre real (el que sale al hacer un <CODE>whois</CODE>).
</LI>
<LI><CODE>reason_type N</CODE> tipo de raz&oacute;n (si est&aacute; a 1 utiliza las del
fichero <CODE>$HOME/.BitchX/BitchX.reasons</CODE>. 
</LI>
<LI><CODE>reverse_status ON-OFF</CODE> muestra la informaci&oacute;n en video inverso.
</LI>
<LI><CODE>SAVEFILE</CODE> fichero en el que se guardan las configuraciones. 
</LI>
<LI><CODE>script_help RUTA </CODE> indica la ruta al fichero de ayuda
(normalmente en <CODE>$HOME/.BitchX/BitchX.help</CODE>. 
</LI>
<LI><CODE>scrollback N</CODE> n&uacute;mero de lineas que se guardan en el buffer.  
</LI>
<LI><CODE>send_away_msg ON-OFF</CODE> indica si se env&iacute;an el mensaje que hayamos
elegido cuando estemos <I>away</I>. 
</LI>
<LI><CODE>send_ignore_msg ON-OFF</CODE> indica si le comunicamos o no a un
usuario que le estamos ignorando cuando nos manda un mensaje. 
</LI>
<LI><CODE>server_prompt CADENA</CODE> cadena para mostrarnos el server.
</LI>
<LI><CODE>shell /bin/sh</CODE> shell que usa cuando ejecutamos comandos con
<CODE>exec</CODE>. 
</LI>
<LI><CODE>shell_flags CADENA</CODE> par&aacute;metros que se le pasan al shell al
ejecutar un <CODE>exec</CODE>. 
</LI>
<LI><CODE>shell_limit N</CODE> n&uacute;mero m&aacute;ximo de shells que se pueden ejecutar
simult&aacute;neamente.
</LI>
<LI><CODE>shitlist ON-OFF</CODE> mantiene una lista de personas <I>non-gratas</I> :) .
</LI>
<LI><CODE>shitlist_reason CADENA</CODE> raz&oacute;n por la que metemos a una persona
en la lista de <I>non-gratos</I>.
</LI>
<LI><CODE>show_away_once ON-OFF</CODE> muestra el away solo una vez. 
</LI>
<LI><CODE>show_channel_names ON-OFF</CODE> muestra el nombre del canal en el que
estamos. 
</LI>
<LI><CODE>show_numerics_str CADENA</CODE> cadena de caracteres que sale antes de los comandos.
</LI>
<LI><CODE>show_status_all ON-OFF</CODE> muestra el estado. 
</LI>
<LI><CODE>suppress_server_motd ON-OFF</CODE> elimina el <I>mensaje de d&iacute;a</I> del
servidor al conectarnos. 
</LI>
<LI><CODE>swatch</CODE> sirve para ver que mensajes del server se reciben y
cuales no. 
</LI>
<LI><CODE>tab ON-OFF</CODE> activa la tecla del tabulado para el <CODE>nick
completion</CODE>. 
</LI>
<LI><CODE>tab_max N</CODE> n&uacute;mero m&aacute;ximo de espacios al darle al <CODE>tab</CODE>.
</LI>
<LI><CODE>underline_video ON-OFF</CODE> activa los caracteres subrayados. 
</LI>
<LI><CODE>userlist ON-OFF</CODE> activa la lista de amigos.
</LI>
<LI><CODE>usermode MODE</CODE> fija los modos de usuario (suele ser +iw).
</LI>
<LI><CODE>user_information </CODE> fija la informaci&oacute;n de usuario.
</LI>
<LI><CODE>window_quiet ON-OFF</CODE> permite hacer scroll.
</LI>
<LI><CODE>word_break CADENA</CODE> fija la separaci&oacute;n de palabras.       
</LI>
<LI><CODE>xterm RUTA</CODE> fija la ruta para la xterm. 
</LI>
<LI><CODE>xterm_options OPCIONES</CODE> fija las opciones para la xterm. 
</LI>
<LI><CODE>xterm_title ON-OFF </CODE> activa el t&iacute;tulo en las xterms.
</LI>
<LI><CODE>_cdcc_close_idle_sends_time N</CODE> cierra un cdcc al pasar N
segundos sin responder. 
</LI>
</UL>
</P>
<P>Los par&aacute;metros m&aacute;s importantes los podemos cambiar mediante el comando
<CODE>/toggle &lt; setting &gt;</CODE>/, si ponemos <CODE>/toggle</CODE> nos saldr&aacute;
una pantalla parecida a esta: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
-----------[ BitchX Toggles ]----------------------------------------------
|   auto_nslookup [Off]    ctcp_flood_protection [ On]    beep        [ On]
|   pubflood      [Off]    flood_protection      [ On]    kickflood   [Off]
|   dcc_autoget   [ On]    flood_kick            [ On]    msglog      [Off]
|   llook         [Off]    deopflood             [ On]    joinflood   [ On]
|   auto_whowas   [Off]    verbose_ctcp          [ On]    nickflood   [ On]
|   cloak         [Off]    operview              [Off]    shitlist    [ On]
|   kick_ops      [ On]    annoy_kick            [Off]    userlist    [ On]
|   hacking       [Off]    nick_completion       [ On]    auto_rejoin [ On]
|   aop           [ On]    auto_away             [Off]    auto_reconn [ On]
|   bitch         [Off]    dcc_fast              [ On]    kick_if_ban [ On]
|   ftp_grab      [Off]    mircs                 [Off]    http_grab   [   ]
|   display_ansi  [ On]    type /toggle &lt;setting&gt;         log         [ On]
</PRE>
</CODE></BLOCKQUOTE>
</P>

<HR>
<A HREF="BitchX-Como-4.html">Anterior</A>
<A HREF="BitchX-Como-6.html">Siguiente</A>
<A HREF="BitchX-Como.html#toc5">Indice</A>
</BODY>
</HTML>
