<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>CODA COMO: Introducci&oacute;n</TITLE>
 <LINK HREF="Coda-COMO-5.html" REL=next>
 <LINK HREF="Coda-COMO-3.html" REL=previous>
 <LINK HREF="Coda-COMO.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="Coda-COMO-5.html">Página siguiente</A>
<A HREF="Coda-COMO-3.html">Página anterior</A>
<A HREF="Coda-COMO.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4. Introducci&oacute;n</A></H2>

<P>
<P>Un sistema de ficheros distribuido almacena ficheros en uno o m&aacute;s
ordenadores sincronizados entre s&iacute; llamados servidores, y los hace
accesibles a otros ordenadores llamados clientes, para quienes el acceso a
estos ficheros es transparente. La principal ventaja es la compartici&oacute;n de
ficheros y su gesti&oacute;n centralizada desde los servidores (como por ejemplo
el control de acceso y la gesti&oacute;n de copias de seguridad). Esta
compartici&oacute;n de ficheros es especialmente &uacute;til para grupos de trabajo que
comparten documentos, aunque tambi&eacute;n es posible compartir software, como
por ejemplo, un procesador de textos. 
<P>Un buen sistema de ficheros distribuido debe tener en cuenta cosas tan
importantes como la latencia de la red, los posibles cuellos de botella y
sobresaturaci&oacute;n del servidor, la seguridad de datos comprometidos y los
posibles fallos de red y servidores. Evidentemente todo esto toma especial
importancia en el caso de que el sistema funcione bajo una <I>WAN</I>.
<P>El Sistema de Ficheros Distribuido Coda es el sucesor de <I>Andrew File
System</I> (<B>AFS</B>) y es un desarrollo de la Universidad de
Carnegie-Mellon como ejemplo de entorno de trabajo distribuido. Coda
destaca sobre AFS por permitir la Computaci&oacute;n M&oacute;vil (trabajar en modo
desconectado), soportar mejor la tolerancia a fallos del sistema (por
ejemplo ca&iacute;da de los servidores o fallos de la red) y por disponer de
t&eacute;cnicas de replicaci&oacute;n de los servidores. Al ser gratuito, su c&oacute;digo
fuente est&aacute; disponible (la licencia de Coda se puede encontrar en 
<CODE>
<A HREF="ftp://ftp.coda.cs.cmu.edu/pub/coda/LICENSE">ftp://ftp.coda.cs.cmu.edu/pub/coda/LICENSE</A></CODE>) y est&aacute; 
dise&ntilde;ado para trabajar tanto en <I>LAN</I> como en <I>WAN</I>. 
<P>Coda se implement&oacute; originalmente en <B>Mach 2.6</B> y ha sido portado
recientemente a <B>Linux</B>, <B>NetBSD</B> y <B>FreeBSD</B>.
Tambi&eacute;n se est&aacute; portando a Windows95/NT, pero el estado de desarrollo es
menor.
<P>La Computaci&oacute;n M&oacute;vil [MAR99] permite por ejemplo que un usuario pueda 
trabajar con su port&aacute;til enganchado a la red Coda, llev&aacute;rselo a su casa
para trabajar con &eacute;l, y cuando vuelva a conectarse a la red los datos se
reintegrar&aacute;n autom&aacute;ticamente, sin que el usuario se percate de ello
(entendiendo por reintegrar el proceso en el que tras una reconexi&oacute;n se
ponen al d&iacute;a en los servidores los cambios realizados por el cliente
durante la desconexi&oacute;n).
<P>
<H2><A NAME="ss4.1">4.1 El cliente Coda </A>
</H2>

<P>[BRA98] Bajo el directorio <CODE>/coda</CODE> el cliente monta un sistema 
de ficheros de tipo «Coda», desde donde se acceder&aacute;n a todos los
ficheros del Sistema Coda. Un cliente se conecta a todo el sistema Coda y
no a un servidor individual como ocurre en NFS, donde existe un &uacute;nico
directorio o punto de montaje por servidor. La ventaja de un s&oacute;lo punto
de montaje reside en que todos los clientes pueden ser configurados de
forma id&eacute;ntica, y en que los usuarios siempre ver&aacute;n el mismo &aacute;rbol de
ficheros. Con NFS los clientes necesitan actualizar la lista de
servidores y la ruta de directorios que exportan en <CODE>/etc/fstab</CODE>,
mientras que en Coda los clientes s&oacute;lo deben acceder al directorio
<CODE>/coda</CODE> para ver los cambios incluso cuando se a&ntilde;aden nuevos
servidores. En las dos siguientes figuras se aprecia la diferencia
funcional entre un sistema NFS y un sistema Coda [MAR99]:
<P>
<BLOCKQUOTE><CODE>
<PRE>
Sistema de Ficheros Distribuido, entorno Cliente-Servidor NFS:

                                RED
              +---------+     +-----+
              |         |     |     |
              |Servidor |&lt;----|-----|------->Cliente 1
              |  NFS 1  |&lt;----|-----|--+    
              |         |     |     |  |
              +---------+     |     |  +---->Cliente 2
                              |     |  |
                              |     |  |
              +---------+     |     |  |
              |         |     |     |  |
              |Servidor |&lt;----|-----|--+
              |  NFS 2  |&lt;----|-----|------->Cliente 3
              |         |     |     |
              +---------+     +-----+

Sistema de Ficheros Distribuido, entorno Coda:

              Sistema Coda
            +-------------+       RED
            | +---------+ |     +-----+
            | |         | |     |     |
            | |Servidor | |&lt;----|-----|------->Cliente 1
            | | Coda 1  | |     |     |
            | |         | |     |     |  
            | +----+----+ |&lt;----|-----|------->Cliente 2
            |      |      |     |     |  
            |      |      |     |     |  
            | +----+----+ |     |     |  
            | |         | |     |     |  
            | |Servidor | |     |     |
            | | Coda 2  | |&lt;----|-----|------->Cliente 3
            | |         | |     |     |
            | +---------+ |     +-----+
            +-------------+
</PRE>
</CODE></BLOCKQUOTE>
<P>La implementaci&oacute;n de Coda en Linux est&aacute; constituida por un conjunto de
demonios que se ejecutan en los servidores, normalmente llamados
<EM>Vice</EM>, y un demonio (<EM><B>Venus</B></EM>) m&aacute;s un m&oacute;dulo del
<I>N&uacute;cleo</I> en la parte del cliente. La comunicaci&oacute;n se establece
entre los demonios, siendo el m&oacute;dulo del <I>n&uacute;cleo</I> la interfaz
entre el Sistema Coda y el <B>VFS</B> (<I>Virtual File System</I>)
de Linux. 
<P>Cuando un usuario intenta leer un fichero del Sistema Coda (por ejemplo
con <CODE>cat /coda/users/user15/doc.txt</CODE>) el programa cat realizar&aacute;
unas llamadas al sistema relacionadas con el fichero, que se comunicar&aacute;n
con el VFS del <I>n&uacute;cleo</I>. El VFS comprueba entonces que la petici&oacute;n
se refiere a un fichero Coda, y encamina la petici&oacute;n al m&oacute;dulo del sistema
de ficheros Coda en el <I>N&uacute;cleo</I> (<I>Coda FS</I>). Este m&oacute;dulo
mantiene una cach&eacute; de peticiones recientes resueltas, y si la respuesta no
se encuentra en esta cach&eacute;, se encamina de nuevo la petici&oacute;n al gestor de
cach&eacute; Coda Venus (a trav&eacute;s del dispositivo de caracter
<CODE>/dev/cfs0</CODE>). Venus comprobar&aacute; si el fichero
<CODE>user15/doc.txt</CODE> se encuentra en una segunda cach&eacute;, almacenada en
disco, y en caso contrario contactar&aacute; con los servidores (<CODE>Vice</CODE>)
para obtenerlo. Una vez conseguido el fichero, Venus responder&aacute; al
<I>n&uacute;cleo</I>, quien devolver&aacute; la respuesta al programa <CODE>cat</CODE>. 
<P>Cuando el <I>n&uacute;cleo</I> solicita a Venus la apertura de un fichero
por primera vez, &eacute;ste obtiene el fichero completo de los servidores
utilizando las llamadas a procedimientos remotos (RPC) para comunicarse
con los ellos. Despu&eacute;s almacena el fichero en el &aacute;rea de cach&eacute; (en el
directorio <CODE>/usr/coda/venus.cache/</CODE>), desde donde ser&aacute; controlado
por el sistema de ficheros <CODE>ext2</CODE> de Linux. Si un fichero ya se
encuentra en la cach&eacute; del cliente, Venus permitir&aacute; trabajar con &eacute;l sin
contactar con los servidores, de modo que si el fichero se abre una
segunda vez, no se obtendr&aacute; del almac&eacute;n remoto (trabajo en modo
desconectado) sino de la cach&eacute;.
<P>As&iacute; pues, Venus s&oacute;lo almacena aquella informaci&oacute;n que necesita el
cliente, como ficheros o directorios (los directorios en Linux son
ficheros) y sus atributos (propietario, permisos y tama&ntilde;o). Si el fichero
ha sido modificado y cerrado, entonces Venus actualiza los servidores
envi&aacute;ndoles el nuevo fichero. Cualquier otra operaci&oacute;n que modifique el
sistema de ficheros (como la creaci&oacute;n o eliminaci&oacute;n de directorios y
enlaces -<I>links</I>-) se propagar&aacute; tambi&eacute;n a los servidores. 
<P>Coda ofrece distintos niveles de seguridad mediante <B>Kerberos</B>: no
cifrar; cifrar s&oacute;lo los paquetes de protocolo interno; cifrar adem&aacute;s las
cabeceras de los mensajes; y cifrado completo.
<P>
<H2><A NAME="ss4.2">4.2 Las operaciones desconectadas </A>
</H2>

<P>Si el cliente est&aacute; desconectado e intenta actualizar un fichero que tiene
en la cach&eacute;, Venus se da cuenta que los servidores no est&aacute;n
disponibles, se declara en modo desconectado y registra los cambios
realizados en el <B>CML</B> (<I>Client Modification Log</I> o Registro
de Modificaci&oacute;n del Cliente) sobre el sistema de ficheros para
actualizarlos en los servidores durante la
siguiente conexi&oacute;n. Este proceso es transparente para el usuario, quien no
se percata que ha cambiado a modo desconectado. Asimismo el CML est&aacute;
optimizado (por ejemplo, si un fichero es creado y luego borrado, se
eliminan estos pasos del CML). 
<P>En ocasiones un cliente intenta acceder a un fichero que no tiene en su
cach&eacute;. Si est&aacute; conectado lo consigue de los servidores, pero si no lo
est&aacute;, no hay nada que hacer y se devuelve un error al programa que haya
hecho la petici&oacute;n. Para evitarlo existen los <B>ficheros HOARD</B>, que son
un conjunto de ficheros relativamente importantes establecidos por el
usuario que se mantienen en la cach&eacute;. El usuario define la base de datos
de ficheros HOARD, y puede solicitar a los servidores las &uacute;ltimas
actualizaciones antes de desconectarse. Esta base de datos la puede
construir autom&aacute;ticamente el sistema haciendo un seguimiento de los
accesos que hace el usuario. Los ficheros Hoard permiten, por ejemplo, que
un cliente forzar la carga del cach&eacute; local antes de entrar en modo
desconectado, y tener la garant&iacute;a de que todo lo que necesita estar&aacute; en
su port&aacute;til tras la desconexi&oacute;n.
<P>Puede ocurrir que dos o m&aacute;s clientes hayan actualizado el mismo fichero
cuando estaban en modo desconectado. Cuando los clientes se conecten se
producir&aacute; un <B>conflicto LOCAL/GLOBAL</B> entre cliente y servidor y
se debe decidir por una de las actualizaciones. Para «reparar» este
conflicto, el usuario dispone de la orden <CODE>repair</CODE>. La reparaci&oacute;n
la puede realizar a veces autom&aacute;ticamente «reparadores» espec&iacute;ficos de la
aplicaci&oacute;n (por ejemplo, si dos usuarios modifican registros distintos de
una misma base de datos, la propia base de datos los actualizar&iacute;a sin que
existiera un posible conflicto).
<P>
<H2><A NAME="ss4.3">4.3 Vol&uacute;menes, servidores y replicaciones.</A>
</H2>

<P>Los servidores Coda no almacenan los ficheros en un sistema de ficheros
tradicional. En lugar de disco, partici&oacute;n o directorio, se utiliza el
concepto de <EM><B>volumen</B></EM>. F&iacute;sicamente [MAR99] representa un 
grupo de ficheros 
mapeados
en memoria por el demonio servidor <CODE>codasrv</CODE>, que contienen la
informaci&oacute;n almacenada en dicho volumen. Los vol&uacute;menes proporcionan mayor
flexibilidad al administrador, y su tama&ntilde;o medio aproximado es de 10 MB,
llegando a existir cientos de vol&uacute;menes por servidor.
<P><B>RVM</B> (<I>Recoverable Virtual Memory</I> o Memoria Virtual Persistente)
registra la informaci&oacute;n de
vol&uacute;menes y directorios, listas de control de accesos y atributos de los
ficheros en particiones «crudas»
<P>
<P>(<I> raw</I> en ingl&eacute;s, aquellas que tienen escrituras s&iacute;ncronas).
En caso de una ca&iacute;da del host repara el sistema accediendo a
la informaci&oacute;n de estas particiones, consiguiendo velocidad y
consistencia. Hay dos particiones crudas: <I>Log Partition</I> y
<I>Data Partition</I>.
<P>Existe un volumen ra&iacute;z que se monta bajo <CODE>/coda</CODE>, desde donde se
montan el resto de los vol&uacute;menes. Obviamente este volumen es propiedad del
administrador Coda. Un volumen tiene un nombre y un identificador <EM>Id</EM>,
y se monta en cualquier subdirectorio de <CODE>/coda</CODE> (por ejemplo el
volumen de un usuario <CODE>users.user15</CODE> se puede montar bajo
<CODE>/coda/users/user15</CODE>). Cada fichero se identifica con un
identificador <CODE>Fid</CODE> &uacute;nico en un sistema Coda y est&aacute; compuesto 
por tres enteros de 32 bits:
<P>
<DL>
<DT><B>VolumeId:</B><DD><P>identifica el volumen en el que reside el fichero.  
<DT><B>VnodeId:</B><DD><P>n&uacute;mero de inodo del fichero. 
<DT><B>Uniquifier:</B><DD><P>identificador necesario para la resoluci&oacute;n de conflictos. 
</DL>
<P>Un volumen replicado es aqu&eacute;l que est&aacute; almacenado en un grupo de
servidores que pertenecen al mismo <B>VSG</B> (<I>Volume Storage
Group</I>), de modo que cualquier operaci&oacute;n sobre los ficheros de ese volumen
afectar&aacute; a todo el VSG al que pertenece (lo cual no supone mucho
coste, ya que Coda implementa difusi&oacute;n
-<I>multicast</I> en 
ingl&eacute;s- ).El objetivo de esto es la alta
disponibilidad del volumen. Asimismo existe el subgrupo <B>AVSG</B>
(<I>Available VSG</I>), que son aquellos servidores accesibles y
pertenecientes a un mismo VSG (puede ocurrir por ejemplo que uno de
los servidores del VSG se aver&iacute;e, con lo cual deja de ser accesible y
deja de pertenecer al AVSG). Otros tipos de vol&uacute;menes son los locales
(no replicados) y vol&uacute;menes <I>backup</I>. Los vol&uacute;menes <I>backup</I> permiten
realizar copias de seguridad del Sistema de Ficheros Coda; sin embargo no se 
tratar&aacute; en este documento. 
<P>La replicaci&oacute;n de servidores puede provocar <B>conflictos globales</B> cuando 
el n&uacute;mero de servidores que forman parte de un mismo AVSG es inferior al
VSG (por ejemplo si las m&aacute;quinas de un VSG son separados de los
dem&aacute;s por una ca&iacute;da de la red). En este caso las actualizaciones de los
ficheros no pueden propagarse a todos los miembros del VSG y es
necesario resolver el conflicto con la orden <CODE>repair</CODE> (muchas
veces s&oacute;lo hay que decirle a Coda que lo repare como cuando hay que
sustituir un disco duro y el sistema se encarga de actualizarlo).
<P>
<H2><A NAME="ss4.4">4.4 Aplicaciones de Coda</A>
</H2>

<P>En Internet, las r&eacute;plicas de <B>servidores FTP</B> podr&iacute;an ser clientes Coda
que se actualizar&iacute;an cada vez que los servidores Coda sufrieran cualquier
modificaci&oacute;n. Lo mismo pasar&iacute;a con la r&eacute;plica de <B>servidores WWW</B>, 
los cuales tambi&eacute;n pueden ser clientes Coda (los cuales pueden ser
optimizados guardando en su cach&eacute; local todos los datos a replicar). En
ambos casos NFS es inadecuado ya que est&aacute; dise&ntilde;ado para un entorno
<I>LAN</I>, y hasta la aparici&oacute;n de Coda eran necesarias herramientas de
sincronizaci&oacute;n entre servidores como <CODE>rsync</CODE>, que peri&oacute;dicamente
contrastan las diferencias entre nodos y actualizan las diferencias. La
computaci&oacute;n m&oacute;vil de Coda tambi&eacute;n puede ser aprovechada para aquellos
clientes de proveedores de Internet que actualizan su p&aacute;gina Web tras
dise&ntilde;arla en modo desconectado.
<P>En las redes locales un usuario podr&iacute;a, por ejemplo, conectarse al sistema
Coda cargando en su cach&eacute; local los datos que vaya a utilizar ese d&iacute;a
(promoviendo el acceso a servicios locales frente a remotos, lo cual
incrementa el rendimiento disminuyendo los costes de comunicaci&oacute;n),
desconectarse<CODE>*</CODE>
<P>
<P>y, cuando
acabe el d&iacute;a, volver a conectarse para reintegrar los cambios efectuados.
<P><CODE>*</CODE>: sin desconectarse tambi&eacute;n se consigue aumentar
el rendimiento, ya que siempre es m&aacute;s eficiente trabajar sobre una cach&eacute;
local que sobre un fichero remoto (tal y como ocurre en NFS).
<P>
<H2><A NAME="ss4.5">4.5 Desventajas </A>
</H2>

<P>[MAR99] Debido a sus caracter&iacute;sticas Coda tiene una serie de desventajas
(algunas ya mencionadas):
<P>
<UL>
<LI>Las operaciones de bloqueo de ficheros no est&aacute;n implementadas debido
a que no es posible un algoritmo de bloqueo que tenga en cuenta un
funcionamiento en modo desconectado.</LI>
<LI>Existe un problema de sincronizaci&oacute;n intr&iacute;nseco al modo
desconectado: cuando al reconectar un cliente, un fichero ha cambiado
tanto en el cliente como en el servidor, ¿c&uacute;al es la versi&oacute;n que se debe
sincronizar con el resto del sistema?. Existen diversos algoritmos, pero
frecuentemente se requiere la mano del operador.</LI>
<LI>La implementaci&oacute;n de cuotas es limitada y s&oacute;lo existe para los
directorios (no existen cuotas para usuarios). Para solucionarlo se puede
asignar un volumen por usuario, pero cambiar la cuota a un usuario es
complicado porque los vol&uacute;menes Coda no son redimensionables. </LI>
<LI>Coda no es estable y actualmente no se soportan bien vol&uacute;menes de
m&aacute;s de 100 usuarios, ni mezcla de servidores Coda que no est&eacute;n replicados 
(cada servidor Coda sirviendo un volumen independiente). </LI>
<LI>Todas las operaciones de administraci&oacute;n deben hacerse desde un
cliente Coda sin que se pueda trabajar directamente con los vol&uacute;menes.
Esto dificulta enormemente las tareas de mantenimiento y administraci&oacute;n.</LI>
<LI>Una m&aacute;quina no puede ser a la vez cliente y servidor Coda.</LI>
</UL>
<P>
<HR>
<A HREF="Coda-COMO-5.html">Página siguiente</A>
<A HREF="Coda-COMO-3.html">Página anterior</A>
<A HREF="Coda-COMO.html#toc4">Índice general</A>
</BODY>
</HTML>
