<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.15">
 <TITLE>El C&oacute;mo del sonido en Linux: Introducci&oacute;n.</TITLE>
 <LINK HREF="Sonido-COMO-2.html" REL=next>

 <LINK HREF="Sonido-COMO.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Sonido-COMO-2.html">Página siguiente</A>
Página anterior
<A HREF="Sonido-COMO.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1.</A> <A HREF="Sonido-COMO.html#toc1">Introducci&oacute;n.</A></H2>


<P>Este es el documento Linux Sound HOWTO. Debe ser entendido como una gu&iacute;a
de referencia r&aacute;pida que cubre todo lo que se necesita saber para instalar y
configurar el soporte de sonido bajo Linux. Se contestan las preguntas m&aacute;s
frecuentes sobre el sonido en Linux, adem&aacute;s de incluir referencias a otras
fuentes de informaci&oacute;n sobre m&uacute;ltiples caracter&iacute;sticas relativas a la
generaci&oacute;n de sonido y m&uacute;sica por ordenador. </P>
<P>El alcance est&aacute; limitado a los aspectos sobre las tarjetas de sonido
relacionadas con Linux. Rem&iacute;tase a los otros documentos listados en la
secci&oacute;n Referencias para informaci&oacute;n m&aacute;s general sobre tarjetas de sonido
y generaci&oacute;n de sonido y m&uacute;sica por ordenador.</P>


<H2><A NAME="ss1.1">1.1</A> <A HREF="Sonido-COMO.html#toc1.1">Reconocimientos.</A>
</H2>


<P>La mayor parte de esta informaci&oacute;n proviene de los ficheros
<CODE>README</CODE> que vienen junto con el c&oacute;digo fuente del controlador de
sonido, de Hannu Savolainen 
<A HREF="mailto:hannu@voxware.pp.fi">hannu@voxware.pp.fi</A>.  Doy las gracias a Hannu y toda esa gente que
ha desarrollado los controladores de sonido del n&uacute;cleo y todas las utilidades. </P>
<P>Gracias al paquete 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/text/sgml-tools-0.99.0.tar.gz">SGML Tools</A>, este documento C&Oacute;MO est&aacute; disponible en varios
formatos, todos generados a partir de un mismo fichero fuente.</P>

<H2><A NAME="ss1.2">1.2</A> <A HREF="Sonido-COMO.html#toc1.2">Historial de Versiones</A>
</H2>


<P>
<DL>

<DT><B>Versi&oacute;n 1.1</B><DD><P>primera versi&oacute;n; enviada al canal SOUND de la lista 
de correo de activistas de Linux</P>

<DT><B>Versi&oacute;n 1.2</B><DD><P>actualizaciones menores; primera versi&oacute;n disponible para
descarga</P>

<DT><B>Versi&oacute;n 1.3</B><DD><P>convertido a SGML; ahora disponible en bastantes formatos
utilizando las herramientas Linuxdoc-SGML de Matt Welsh; la apariencia cambi&oacute;
debido al nuevo formato, pero s&oacute;lo hubo cambios menores en el contenido</P>

<DT><B>Versi&oacute;n 1.4</B><DD><P>cambios menores de SGML; a&ntilde;adida respuesta a las 
incompatibilidades entre PAS16 y el adaptador SCSI Adaptec1542A </P>

<DT><B>Versi&oacute;n 1.5</B><DD><P>el controlador de sonido 2.5a se encuentra en la 
distribuci&oacute;n 1.1 del n&uacute;cleo; nota acerca del soporte de GUS-MAX; otras 
actualizaciones menores</P>

<DT><B>Versi&oacute;n 1.6</B><DD><P>a&ntilde;adida informaci&oacute;n acerca del error "no hay espacio en
el dispositivo"; a&ntilde;adida anotaci&oacute;n de que la Gu&iacute;a del Hacker est&aacute; en un directorio
oculto; a&ntilde;adida pregunta acerca del modo bidireccional; informaci&oacute;n acerca de los
errores de "dispositivo ocupado"; otros cambios menores</P>

<DT><B>Versi&oacute;n 1.7</B><DD><P>a&ntilde;adida informaci&oacute;n acerca de ASP y AWE32; VoxWare 2.9 est&aacute; 
disponible; respuesta a la pregunta acerca de la utilizaci&oacute;n de IRQ2; referencias
a los documentos COMO de Sonido y SCSI</P>

<DT><B>Versi&oacute;n 1.8</B><DD><P>a&ntilde;adida pregunta acerca de los errores bajo DOS; actualizaci&oacute;n
de muchas cosas para ajustarse a la versi&oacute;n 2.90 del controlador de sonido; informaci&oacute;n
acerca del DOOM, respuesta para reducir ruido</P>

<DT><B>Versi&oacute;n 1.9</B><DD><P>preguntas acerca de grabaci&oacute;n y de tarjetas cl&oacute;nicas</P>

<DT><B>Versi&oacute;n 1.10</B><DD><P>se menciona que el documento est&aacute; disponible en la WWW, en copias
impresas, y traducciones; informaci&oacute;n acerca del conflicto DMA con el controlador de 
cinta QIC; informaci&oacute;n acerca de Sound Galaxy NX Pro y Rat&oacute;n Bus Logitech</P>

<DT><B>Versi&oacute;n 1.11</B><DD><P>Una larga actualizaci&oacute;n (He estado ocupado); documento bajo licencia
GPL; puesto al d&iacute;a con la versi&oacute;n 3.0 del controlador de sonido; informaci&oacute;n acerca de 
muchas tarjetas de sonido ya soportadas; m&aacute;s informaci&oacute;n acerca de configuraci&oacute;n y resoluci&oacute;n
de problemas; cientos de enlaces HTML a&ntilde;adidos; puesto al d&iacute;a con el formato de CD-ROM HOWTO</P>

<DT><B>Versi&oacute;n 1.12</B><DD><P>nuevos controladores de sonido en el n&uacute;cleo 1.3.34; nuevos nombres de
dispositivos de sonido; la direcci&oacute;n de la 1542 es 334, no 333; clarificaci&oacute;n del estado de
Creative Labs Emu y ASP; enlaces a los sitios Web de Creative Labs y Mediatrix</P>

<DT><B>Versi&oacute;n 1.13</B><DD><P>nota acerca del nombre VoxWare; actualizado para reflejar las &uacute;ltimas
tarjetas de sonido soportadas y sus opciones de configuraci&oacute;n; pregunta acerca del soporte
Plug and Play; pregunta acerca del problema de tama&ntilde;o de bloque; nuevas opciones xconfig y
menuconfig; modutils tiene soporte de dispositivos de sonido; la lista de correo vger 
desaparece; &eacute;nfasis en la Web del autor; otros cambios menores</P>

<DT><B>Versi&oacute;n 1.14</B><DD><P>Audio Excell DSP16 no est&aacute; soportada actualmente (deber&iacute;a funcionar
de nuevo en unos pocos meses); cambios en el programa de configuraci&oacute;n; versi&oacute;n italiana del
documento disponible; pista para ajustar las ganancias del mezclador cuando se carga el 
m&oacute;dulo de sonido; el &uacute;ltimo n&uacute;cleo estable es ahora 2.0; nuevo nombre para el controlador de
sonido; pregunta acerca de los permisos de root en ficheros del dispositivo de sonido</P>

<DT><B>Versi&oacute;n 1.15</B><DD><P>eliminadas algunas preguntas que eran muy viejas y quedaron obsoletas;
nuevas direcciones de correo electr&oacute;nico del autor; arreglados algunos enlaces para apuntar
a los &uacute;ltimos paquetes de software; m&aacute;s informaci&oacute;n acerca del libro multimedia; 
cambios gramaticales menores</P>

<DT><B>Versi&oacute;n 1.16</B><DD><P>muchas actualizaciones y correcciones realizadas por Hannu
Savolainen; a&ntilde;adido enlace a la traducci&oacute;n espa&ntilde;ola; cambios gramaticales menores</P>

<DT><B>Versi&oacute;n 1.17</B><DD><P>versi&oacute;n china disponible; controlador alternativo de la GUS;
packet radio modem; la guia Linux Multimedia se encuentra disponible en franc&eacute;s y 
japon&eacute;s; referencias a un par de mini-HOWTOs importantes; notas acerca del IBM ThinkPad</P>

<DT><B>Versi&oacute;n 1.18</B><DD><P>traducci&oacute;n coreana disponible; m&aacute;s informaci&oacute;n acerca del 
soporte de sonido en MIPS; informaci&oacute;n actualizada acerca del soporte de varias
tarjetas; debe ser root al ejecutar fuser</P>

<DT><B>Versi&oacute;n 1.19</B><DD><P>a&ntilde;adidas entradas al &iacute;ndice; documento C&Oacute;MO bajo licencia LDP
mejor que GPL</P>

</DL>
</P>

<H2><A NAME="ss1.3">1.3</A> <A HREF="Sonido-COMO.html#toc1.3">Nuevas versiones de este documento.</A>
</H2>


<P>Nuevas versiones de este documento ser&aacute;n enviadas peri&oacute;dicamente al grupo
de noticias <CODE>comp.os.linux.answers</CODE>. Tambi&eacute;n ser&aacute;n enviadas a
varios ftp an&oacute;nimos que archivan este tipo de informaci&oacute;n, incluyendo 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/">ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/</A>.</P>
<P>Hay disponibles versiones de hipertexto de &eacute;ste y otros HOWTOs en muchos
lugares, como por ejemplo 
<A HREF="http://sunsite.unc.edu/LDP/">http://sunsite.unc.edu/LDP/</A>
La mayor&iacute;a de las distribuciones de Linux en formato CD-ROM incluyen los
COMOs en el directorio <CODE>/usr/doc/</CODE>, aunque tambi&eacute;n los puedes
comprar en formato impreso a muchos vendedores. A veces los documentos
COMO disponibles en los distribuidores de CD-ROM, sitios FTP y en formato
impreso est&aacute;n obsoletos. Si la fecha de este HOWTO es de hace seis meses,
o m&aacute;s, probablemente pueda conseguir una nueva versi&oacute;n de Internet.</P>
<P>Una traducci&oacute;n en franc&eacute;s de este documento est&aacute; disponible en
<A HREF="ftp://ftp.ibp.fr/pub2/linux/french/docs/HOWTO/">ftp://ftp.ibp.fr/pub2/linux/french/docs/HOWTO/</A>.</P>
<P>Una traducci&oacute;n en japon&eacute;s de este documento est&aacute; disponible en
<A HREF="http://yebisu.ics.es.osaka-u.ac.jp/linux/">http://yebisu.ics.es.osaka-u.ac.jp/linux/</A>.</P>
<P>Una traducci&oacute;n en italiano de este documento est&aacute; disponible en
<A HREF="http://www.psico.unipd.it/ildp/docs/HOWTO/Sound-HOWTO.html">http://www.psico.unipd.it/ildp/docs/HOWTO/Sound-HOWTO.html</A>.</P>
<P>Una traducci&oacute;n en espa&ntilde;ol de este documento est&aacute; disponible en
<A HREF="http://www.insflug.nova.es/howtos/online/sonido/sonido-COMO.html">http://www.insflug.nova.es/howtos/online/sonido/sonido-COMO.html</A></P>
<P>Una traducci&oacute;n en chino de este documento est&aacute; disponible en
<A HREF="http://linux.ntcic.edu.tw/~yorkwu/linux/howto/sound/">http://linux.ntcic.edu.tw/~yorkwu/linux/howto/sound/</A></P>
<P>Una traducci&oacute;n de este documento al coreano Hangul est&aacute; disponible 
en 
<A HREF="http://members.iWorld.net/mangchi/HOWTO/Sound-HOWTO.html">http://members.iWorld.net/mangchi/HOWTO/Sound-HOWTO.html</A></P>
<P>La mayor&iacute;a de las traducciones de este y otros documentos COMO de Linux
puede ser encontrada tambi&eacute;n en 
<A HREF="http://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/">http://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/</A>
y en 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/">ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/translations/</A>.</P>
<P>Si realiza una traducci&oacute;n de este documento a otro idioma, comun&iacute;quemelo y lo
incluir&eacute; como una referencia en este apartado.</P>

<H2><A NAME="ss1.4">1.4</A> <A HREF="Sonido-COMO.html#toc1.4">Sugerencias, cr&iacute;ticas y comentarios.</A>
</H2>

<P>Conf&iacute;o en que a usted, el lector, este documento le sea de utilidad. Si tiene alguna
sugerencia, correcci&oacute;n, o comentario, por favor env&iacute;emelos 
<A HREF="mailto:jeff_tranter@mitel.com">jeff_tranter@mitel.com</A>,
y tratar&eacute; de incorporarlas en la pr&oacute;xima revisi&oacute;n.</P>
<P>Tambi&eacute;n estoy deseando contestar preguntas generales sobre tarjetas de sonido y
Linux, tan correctamente como pueda. Antes de hacerlo, por favor lea toda la informaci&oacute;n
de este HOWTO, y env&iacute;eme informaci&oacute;n detallada sobre el problema.</P>
<P>Si usted publica este documento en un CD-ROM o impreso en papel, una copia
complementaria ser&aacute; apreciada. Env&iacute;eme un email para decirle mi direcci&oacute;n
postal. Considere tambi&eacute;n hacer una donaci&oacute;n al Linux Documentation
Project para colaborar con la libre documentaci&oacute;n de Linux. Contacte
con el coordinador de los HOWTO de Linux, Tim Bynum 
<A HREF="mailto:linux-howto@sunsite.unc.edu">linux-howto@sunsite.unc.edu</A> para m&aacute;s
informaci&oacute;n. </P>

<H2><A NAME="ss1.5">1.5</A> <A HREF="Sonido-COMO.html#toc1.5">Pol&iacute;tica de distribuci&oacute;n.</A>
</H2>

<P>Copyright 1995-1998 por Jeff Tranter. Este documento puede ser distribuido
bajo los t&eacute;rminos ajustados en la licencia LDP disponible en
<A HREF="http://sunsite.unc.edu/LDP/COPYRIGHT.html">http://sunsite.unc.edu/LDP/COPYRIGHT.html</A>.</P>

<HR>
<A HREF="Sonido-COMO-2.html">Página siguiente</A>
Página anterior
<A HREF="Sonido-COMO.html#toc1">Índice general</A>
</BODY>
</HTML>
