<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.15">
 <TITLE>El C&oacute;mo del sonido en Linux: Tecnolog&iacute;a de la tarjeta de sonido.</TITLE>
 <LINK HREF="Sonido-COMO-3.html" REL=next>
 <LINK HREF="Sonido-COMO-1.html" REL=previous>
 <LINK HREF="Sonido-COMO.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Sonido-COMO-3.html">Página siguiente</A>
<A HREF="Sonido-COMO-1.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2.</A> <A HREF="Sonido-COMO.html#toc2">Tecnolog&iacute;a de la tarjeta de sonido.</A></H2>

<P>Esta secci&oacute;n da unas nociones <EM>muy simples</EM> de tecnolog&iacute;a de sonido en ordenador, para ayudarle
a entender los conceptos usados m&aacute;s tarde en el documento. Deber&iacute;a consultar un
libro de sonido digital o de proceso de se&ntilde;al digital si desea aprender m&aacute;s.</P>
<P>El sonido es una propiedad <EM>anal&oacute;gica</EM>; puede tomar cualquier valor en un intervalo
continuo. Los ordenadores son <EM>digitales</EM>; trabajan con valores discretos.
Las tarjetas de sonido usan un dispositivo conocido como <EM>conversor anal&oacute;gico
digital</EM> (A/D o ADC) para convertir los voltajes correspondientes a las ondas
de sonido anal&oacute;gico en valores digitales o num&eacute;ricos los cuales pueden ser guardados
en memoria. De manera similar un <EM>conversor digital anal&oacute;gico (D/A o DAC)</EM> convierte
valores num&eacute;ricos en un voltaje anal&oacute;gico el cual puede ser reconducido a un
altavoz, produciendo sonido.</P>
<P>El proceso de conversi&oacute;n anal&oacute;gico-digital, conocido como muestreo (sampling),
introduce algunos errores. Dos factores son fundamentales para determinar con qu&eacute;
fidelidad la se&ntilde;al de muestra representa a la original. <EM>La frecuencia de muestreo</EM>
(sampling rate) es el n&uacute;mero de muestras hechas por unidad de tiempo (generalmente
expresado en muestras por segundo o hertzios). Una frecuencia de muestreo baja
genera una representaci&oacute;n de menos calidad de la se&ntilde;al anal&oacute;gica. El tama&ntilde;o de
muestreo (sample size) es el rango de valores usados para representar cada muestra,
generalmente expresado en bits. Cuanto mayor sea el tama&ntilde;o de muestra, de mayor
calidad ser&aacute; la se&ntilde;al digital.</P>
<P>Las tarjetas de sonido usan com&uacute;nmente muestras de 8 o de 16 bits y frecuencias
de muestreo desde 4000 hasta 44000 muestras por segundo. Las muestras pueden
estar contenidas en un canal (mono) o en dos (est&eacute;reo).</P>
<P><EM>La s&iacute;ntesis FM</EM> es una t&eacute;cnica antigua para producir sonido. 
Se basa en la combinaci&oacute;n de diferentes formas de onda (por ejemplo sinoidal, triangular,
cuadrada). La s&iacute;ntesis FM es m&aacute;s f&aacute;cil de implementar en hardware que
la conversi&oacute;n D/A, pero es m&aacute;s dif&iacute;cil de programar y menos flexible. 
Muchas tarjetas de sonido proporcionan s&iacute;ntesis de FM para conservar la
compatibilidad con otras tarjetas y software anteriores. Generalmente
se proporcionan varias <EM>voces</EM>, es decir, generadores de sonido independientes. </P>
<P><EM>La s&iacute;ntesis de tabla de ondas (WaveTable)</EM> combina la flexibilidad de la
conversi&oacute;n D/A con la capacidad de m&uacute;ltiples canales de la s&iacute;ntesis de FM. 
Con este esquema las voces digitalizadas pueden ser cargadas en una
memoria dedicada, y despu&eacute;s reproducidas, combinadas, y modificadas con
un consumo m&iacute;nimo de recursos de la CPU. Todas las tarjetas de sonido de &uacute;ltima
generaci&oacute;n proporcionan s&iacute;ntesis de tabla de ondas.</P>
<P>La mayor&iacute;a de las tarjetas de sonido proporcionan la capacidad de <EM>mezclado</EM>,
la combinaci&oacute;n de se&ntilde;ales de diferentes fuentes de entrada y el control de sus niveles
de ganancia. </P>
<P><EM>MIDI</EM> significa Musical Intrument Digital Interface (interfaz digital para
instrumentos musicales), y es el hardware est&aacute;ndar y el protocolo software
que permite a los instrumentos musicales comunicarse con cualquier otro.
Los eventos enviados a trav&eacute;s de un bus MIDI tambi&eacute;n pueden ser guardados
como ficheros MIDI para editarlos m&aacute;s tarde y reproducirlos. Algunas
tarjetas de sonido traen un interfase MIDI. Las que todav&iacute;a no pueden
reproducir ficheros MIDI usan las capacidades de la placa de la tarjeta de
sonido.</P>
<P><EM>Los ficheros MOD</EM> son un formato com&uacute;n para las canciones generadas por ordenador.
Como informaci&oacute;n sobre las notas musicales a ser reproducidas los ficheros contienen
muestras digitalizadas de los instrumentos (o voces). Los ficheros MOD son originarios
de los ordenadores Amiga, pero pueden ser reproducidos en otros sistemas, incluyendo
Linux, con el software adecuado.</P>

<HR>
<A HREF="Sonido-COMO-3.html">Página siguiente</A>
<A HREF="Sonido-COMO-1.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc2">Índice general</A>
</BODY>
</HTML>
