<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.15">
 <TITLE>El C&oacute;mo del sonido en Linux: Hardware soportado.</TITLE>
 <LINK HREF="Sonido-COMO-4.html" REL=next>
 <LINK HREF="Sonido-COMO-2.html" REL=previous>
 <LINK HREF="Sonido-COMO.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="Sonido-COMO-4.html">Página siguiente</A>
<A HREF="Sonido-COMO-2.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc3">Índice general</A>
<HR>
<H2><A NAME="s3">3.</A> <A HREF="Sonido-COMO.html#toc3">Hardware soportado.</A></H2>

<P>Esta secci&oacute;n lista las tarjetas de sonido y los interfaces que actualmente
son soportados bajo Linux. Esta informaci&oacute;n est&aacute; basada en los &uacute;ltimos
n&uacute;cleos de Linux.</P>
<P>El controlador de sonido tiene su propio n&uacute;mero de versi&oacute;n. El &uacute;ltimo n&uacute;cleo
estable de Linux realizado hasta ahora era la versi&oacute;n 2.0.33, usando la versi&oacute;n
3.5.4-960630 del controlador de sonido.</P>
<P>El autor del controlador de sonido, Hannu Savolainen, normalmente tambi&eacute;n realiza
nuevas versiones beta del controlador de sonido como parches del n&uacute;cleo antes de
que sean incluidas como parte de la distribuci&oacute;n est&aacute;ndar del n&uacute;cleo de
Linux.La m&aacute;s reciente lista de tarjetas soportadas est&aacute; disponible en 
<A HREF="http://www.4front-tech.com/ossfree/new_cards.html">http://www.4front-tech.com/ossfree/new_cards.html</A> (EE.UU.) or
<A HREF="http://personal.eunet.fi/pp/voxware/new_cards.html">http://personal.eunet.fi/pp/voxware/new_cards.html</A>
(Europa). Estas p&aacute;ginas indican qu&eacute; controlador de sonido se requiere para
un tipo concreto de tarjeta de sonido, o si su soporte est&aacute; todav&iacute;a en fase de 
desarrollo. El fichero <CODE>/usr/src/linux/drivers/sound/Readme.cards</CODE> 
distribuido con el controlador de sonido del n&uacute;cleo contiene informaci&oacute;n acerca
de las tarjetas soportadas, pero no est&aacute; siempre puesto al d&iacute;a.</P>
<P>Esta informaci&oacute;n s&oacute;lo es v&aacute;lida para Linux en la plataforma Intel.</P>
<P>El controlador de sonido tamb&iacute;en deber&iacute;a funcionar con la mayor parte de las
tarjetas de sonido en la plataforma Alpha. Sin embargo, algunas tarjetas pueden
dar problemas con los puertos de E/S de otros dispositivos de los sistemas Alpha
a&uacute;nque funcionaran perfectamente en m&aacute;quinas i386, por lo que, en general, no es
posible decir si una tarjeta dada funciona o no sin llegar a probarla.</P>
<P>En el momento de la escritura, el controlador de sonido a&uacute;n no funcionaba en la
versi&oacute;n para Linux de PowerPc, pero lo har&aacute; en un futuro.</P>
<P>El sonido puede configurarse en el n&uacute;cleo bajo el puerto de Linux para
MIPs, y algunas m&aacute;quinas MIPs tienen ranuras EISA y/o hardware de
sonido interno. Me han comentado que el grupo Linux-MIPs est&aacute; interesado en 
a&ntilde;adir soporte de sonido en un futuro.</P>
<P>El n&uacute;cleo de Linux incluye un controlador separado para las versiones de Linux para
Amiga y Atari que implementa una subsecci&oacute;n compatible del controlador de sonido para
Intel utilizando el hardware de sonido propio de estas m&aacute;quinas.</P>
<P>El puerto SPARC de Linux no tiene, por ahora, soporte para sonido. Al igual que el Amiga y
el Atari, las m&aacute;quinas SPARC tienen hardware de sonido propio, por lo que puede
conseguirse con un nuevo controlador (esto es algo ir&oacute;nico, ya que bajo linux, el fichero <CODE>/dev/dsp</CODE>
emula el dispositivo de sonido SunOS.</P>

<H2><A NAME="ss3.1">3.1</A> <A HREF="Sonido-COMO.html#toc3.1">Tarjetas de sonido.</A>
</H2>

<P>Las siguientes tarjetas de sonido son soportadas por el controlador de sonido del
n&uacute;cleo de Linux:</P>
<P>
<UL>
<LI>ATI Stereo F/X (ya no se fabrica)</LI>
<LI>AdLib (ya no se fabrica)</LI>
<LI>Ensoniq SoundScape (y compatibles fabricados por Reveal y Spea)</LI>
<LI>Gravis Ultrasound</LI>
<LI>Gravis Ultrasound ACE</LI>
<LI>Gravis Ultrasound Max</LI>
<LI>Gravis Ultrasound con opci&oacute;n de sampling de 16 bit</LI>
<LI>Logitech Sound Man 16</LI>
<LI>Logitech SoundMan Games</LI>
<LI>Logitech SoundMan Wave</LI>
<LI>MAD16 Pro (chipsets OPTi 82C928, 82C929, 82C930, 82C924)</LI>
<LI>Media Vision Jazz16</LI>
<LI>MediaTriX AudioTriX Pro</LI>
<LI>Microsoft Windows Sound System (MSS/WSS)</LI>
<LI>Mozart (OAK OTI-601)</LI>
<LI>Orchid SW32</LI>
<LI>Personal Sound System (PSS)</LI>
<LI>Pro Audio Spectrum 16</LI>
<LI>Pro Audio Studio 16</LI>
<LI>Pro Sonic 16</LI>
<LI>Roland MPU-401 MIDI interface</LI>
<LI>Sound Blaster 1.0</LI>
<LI>Sound Blaster 16</LI>
<LI>Sound Blaster 16ASP</LI>
<LI>Sound Blaster 2.0</LI>
<LI>Sound Blaster AWE32</LI>
<LI>Sound Blaster Pro</LI>
<LI>TI TM4000M notebook</LI>
<LI>ThunderBoard</LI>
<LI>Turtle Beach Tropez ("cl&aacute;sica", no la Plus)</LI>
<LI>Yamaha FM synthesizers (OPL2, OPL3 and OPL4)</LI>
<LI>6850 UART MIDI Interface</LI>
</UL>
</P>
<P>Debe remarcarse que las tarjetas de sonido Plug and Play (PnP) no son
completamente compatibles con los modelos m&aacute;s antiguos no-PnP del mismo
dispositivo. Por ejemplo, la SoundBlaster 16PnP no es del todo compatible
con la SoundBlaster 16 original. Ocurre lo mismo con la Soundscape PnP y
las GUS PnP. Puede encontrarse m&aacute;s informaci&oacute;n relacionada con Plug and
Play en este mismo documento.</P>
<P>Las siguientes tarjetas <EM>no</EM> son soportadas, bien porque son obsoletas, bien
porque el fabricante no proporcion&oacute; la informaci&oacute;n de programaci&oacute;n necesaria
para escribir un controlador:</P>
<P>
<UL>
<LI>Pro Audio Spectrum (original)</LI>
<LI>Pro Audio Spectrum+</LI>
<LI>antiguas tarjetas (basadas en la Sierra Aria) fabricadas por Diamond</LI>
</UL>
</P>
<P>Otras tarjetas de sonido que se suponen compatibles con alguna de
las que s&iacute; que son soportadas deben funcionar si tienen hardware compatible
(por ejemplo nivel de registro). </P>
<P>De hecho, de la mayor parte de las tarjetas descritas como "100% compatibles
con SoundBlaster", muy pocas son lo suficientemente compatibles para trabajar
con el controlador de SoundBlaster de Linux. Estas tarjetas suelen trabajar
mejor utilizando el controlador MSS/WSS o MAD16. S&oacute;lo las tarjetas de sonido
SoundBlaster hechas por Creative Labs, que usan los propios chips de Creative
(p.e. SoundBlaster 16 Vibra), la MV Jazz16 y la ESS688/1688 funcionan, generalmente,
con el controlador SoundBlaster. Intentar utilizar una "tarjeta de sonido de
16 bits compatible con SoundBlaster Pro" con el controlador SoundBlaster es,
simplemente, una p&eacute;rdida de tiempo.</P>
<P>El n&uacute;cleo de Linux da soporte al puerto SCSI proporcionado en algunas tarjetas
de sonido (p.e. ProAudioSpectrum 16) y a los interfaces propietarios de algunas
unidades CD-ROM (p.e. SoundBlaster Pro): Vea los documentos 
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/SCSI-HOWTO.html">SCSI-C&Oacute;MO</A> y
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/CDROM-HOWTO.html">CDROM-COMO</A>
para m&aacute;s informaci&oacute;n.</P>
<P>Un m&oacute;dulo cargable del n&uacute;cleo para soportar los puertos de joystick, incluyendo 
aquellos proporcionados en algunas tarjetas de sonido, tambi&eacute;n est&aacute; disponible.</P>
<P>D&eacute;se cuenta de que para los controladores del n&uacute;cleo para SCSI, CD-ROM, joystick y
sonido son completamente independientes los unos de otros.</P>
<P>Para conseguir la &uacute;ltima informaci&oacute;n acerca del controlador de sonido, visite la
p&aacute;gina Web de Hannu Savolainen, cuya direcci&oacute;n encontrar&aacute; en la secci&oacute;n 
Referencias.</P>

<H2><A NAME="ss3.2">3.2</A> <A HREF="Sonido-COMO.html#toc3.2">Controladores de sonido alternativos.</A>
</H2>

<P>Hay disponibles algunos controladores de sonido "no oficiales", no incluidos en
la distribuci&oacute;n est&aacute;ndar del n&uacute;cleo de Linux, y usados en lugar del controlador
est&aacute;ndar de sonido.</P>
<P>Una versi&oacute;n comercial del controlador de sonido de Linux es vendida por 4Front
Technologies. Ofrece un n&uacute;mero de caracter&iacute;sticas adicionales a&ntilde;adidas a la versi&oacute;n
gratuita incluida en el n&uacute;cleo de Linux. Para m&aacute;s informaci&oacute;n visite la p&aacute;gina Web
de 4Front en 
<A HREF="http://www.4front-tech.com/">http://www.4front-tech.com/</A>.</P>
<P>Markus Mummert (
<A HREF="mailto:mum@mmk.e-technik.tu-muenchen.de">mum@mmk.e-technik.tu-muenchen.de</A>) un paquete de controladores
para las tarjetas Turtle Beach MultiSound (cl&aacute;sica), Tahiti y Monterey. La
documentaci&oacute;n afirma:
<BLOCKQUOTE>
"Est&aacute; dise&ntilde;ado para la reproducci&oacute;n/grabaci&oacute;n de alta calidad en
disco duro sin perder sincronizaci&oacute;n alguna en un sistema ocupado.
Otras caracter&iacute;sticas como la s&iacute;ntesis de ondas, MIDI y el procesador
digital de se&ntilde;al no pueden ser usadas. Tampoco es posible la grabaci&oacute;n
y reproducci&oacute;n simult&aacute;neas.
Actualmente reemplaza a VoxWare y ha sido probado en bastantes
versiones de n&uacute;cleos, desde la 1.0.9 hasta la 1.2.1. Tambi&eacute;n se puede
instalar en sistemas UN*X SysV386R3.2."
</BLOCKQUOTE>
</P>
<P>Se puede encontrar en 
<A HREF="http://www.cs.colorado.edu/~mccreary/tbeach">http://www.cs.colorado.edu/~mccreary/tbeach</A>.</P>
<P>Kim Burgaard (
<A HREF="mailto:burgaard@daimi.aau.dk">burgaard@daimi.aau.dk</A>) ha escrito un controlador de dispositivo y
utilidades para el interfaz MIDI de la Roland MPU-401. El acceso al mapa
de software Linux da esta descripci&oacute;n:
<BLOCKQUOTE>
"Un controlador de dispositivo para los interfaces MIDI de la Roland
MPU-401 (incluyendo Roland SCC-1 y RAP-10/ATW-10). Le acompa&ntilde;a
una importante colecci&oacute;n de utilidades, incluyendo un reproductor
y grabador de ficheros MIDI est&aacute;ndar.
</BLOCKQUOTE>
</P>
<P>
<BLOCKQUOTE>
Han sido hechos numerosos avances desde la versi&oacute;n 0.11a. entre
otras cosas, el controlador incorpora ahora la pol&iacute;tica de compartici&oacute;n
de IRQ y cumple con el nuevo m&oacute;dulo interfase del n&uacute;cleo.
Funcionabilidad metr&oacute;noma, posibilidad de sincronizaci&oacute;n (por ejemplo
gr&aacute;ficos en una base de ritmos sin perder precisi&oacute;n), interfaz
avanzado de reproducci&oacute;n/grabaci&oacute;n y mucho, mucho m&aacute;s."
</BLOCKQUOTE>
</P>
<P>Se puede encontrar en 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/kernel/sound/mpu-401-0.2.tar.gz">ftp://sunsite.unc.edu/pub/Linux/kernel/sound/mpu-401-0.2.tar.gz</A></P>
<P>Jarloslav Kysela y otros han escrito un controlador de sonido alternativo 
para la Gravis UltraSound. Para m&aacute;s informaci&oacute;n, visite la p&aacute;gina Web
del Proyecto Linux UltraSound 
<A HREF="http://romeo.pf.jcu.cz/~perex/ultra">http://romeo.pf.jcu.cz/~perex/ultra</A>.</P>
<P>Otro uso novedoso para una tarjeta de sonido bajo Linux es como un modem para paquetes
de radio aficcionado. Los n&uacute;cleos 2.1.x recientes incluyen un controlador que trabaja
con tarjetas SoundBlaster y compatibles Windows Sound System que implementan protocolos
de paquetes AFSK a 1200 bps y FSK a 9600 bps. Vea el documento Linux AX25 HOWTO para m&aacute;s
detalles. (yo mismo soy radioaficcionado. Contrase&ntilde;a VE3ICH).</P>

<H2><A NAME="ss3.3">3.3</A> <A HREF="Sonido-COMO.html#toc3.3">Altavoz del PC.</A>
</H2>

<P>Un controlador alternativo de sonido est&aacute; disponible y no requiere hardware adicional
de sonido: usa el altavoz interno del PC. Es compatible con la mayor&iacute;a
del software del controlador de la tarjeta de sonido, pero como era de esperar,
ofrece una salida de mucha peor calidad y consume muchos recursos de la CPU.
Los resultados pueden variar dependiendo de las caracter&iacute;sticas internas del
altavoz. Para m&aacute;s informaci&oacute;n, lea la documentaci&oacute;n que acompa&ntilde;a a su versi&oacute;n.</P>
<P>La versi&oacute;n actual es la 1.1 y se puede encontrar en
<A HREF="ftp://ftp.informatik.hu-berlin.de/pub/os/linux/hu-sound">ftp://ftp.informatik.hu-berlin.de/pub/os/linux/hu-sound</A></P>

<H2><A NAME="ss3.4">3.4</A> <A HREF="Sonido-COMO.html#toc3.4">Puerto paralelo.</A>
</H2>

<P>Otra opci&oacute;n es hacer un conversor digital/anal&oacute;gico usando el puerto paralelo
de la impresora y algunos componentes adicionales. &Eacute;ste genera una mejor calidad
de sonido que el altavoz interno, pero consume todav&iacute;a m&aacute;s recursos del
sistema. El paquete del controlador de altavoz del PC menciona por encima el soporte
de esto, e incluye las instrucciones para construir el hardware necesario.</P>

<HR>
<A HREF="Sonido-COMO-4.html">Página siguiente</A>
<A HREF="Sonido-COMO-2.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc3">Índice general</A>
</BODY>
</HTML>
