<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.15">
 <TITLE>El C&oacute;mo del sonido en Linux: Referencias</TITLE>
 <LINK HREF="Sonido-COMO-8.html" REL=next>
 <LINK HREF="Sonido-COMO-6.html" REL=previous>
 <LINK HREF="Sonido-COMO.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="Sonido-COMO-8.html">Página siguiente</A>
<A HREF="Sonido-COMO-6.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc7">Índice general</A>
<HR>
<H2><A NAME="s7">7.</A> <A HREF="Sonido-COMO.html#toc7">Referencias</A></H2>

<P>Si tiene una tarjeta de sonido que soporte CD-ROM o un interfaz SCSI,
el Linux 
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/SCSI-HOWTO.html">SCSI HOWTO</A> y el Linux 
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/CDROM-HOWTO.html">CD-ROM HOWTO</A> tienen informaci&oacute;n adicional que puede serle muy &uacute;til.</P>
<P>El 
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/Sound-Playing-HOWTO.html">Sound Playing HOWTO</A> describe c&oacute;mo reproducir los diversos tipos de ficheros
de m&uacute;sica y sonido bajo Linux.</P>
<P>El 
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/mini/Gravis-Ultrasound">Ultrasound Plug and Play Mini-Howto</A> describe c&oacute;mo conseguir que una tarjeta
Gravis Ultrasound Plug and Play funcione bajo Linux.</P>
<P>El 
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/mini/Soundblaster-16">Linux SoundBlaster 16 PnP Mini-HOWTO</A> describe como conseguir que una tarjeta 
SoundBlaster16 PnP funcione bajo Linux.</P>
<P>El 
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/mini/Soundblaster-AWE64">Linux SoundBlaster AWE64 PnP Mini-HOWTO</A> describe c&oacute;mo conseguir que una tarjeta
SoundBlaster AWE64 PnP funcione bajo Linux.</P>
<P>Hay un viejo documento llamado <EM>Hacker's Guide to VoxWare</EM>, disponible de 
<A HREF="ftp://nic.funet.fi/pub/Linux/ALPHA/sound/">ftp://nic.funet.fi/pub/Linux/ALPHA/sound/</A>. La mayor parte de la informaci&oacute;n
existente ah&iacute; ha sido actualizada por los documentos en 
<A HREF="http://www.4front-tech.com/pguide">http://www.4front-tech.com/pguide</A>, pero la secci&oacute;n acerca de
<CODE>/dev/sequencer</CODE> a&uacute;n puede ser util.</P>
<P>Las siguientes PUF ser&aacute;n enviadas regularmente al grupo de noticias de
Usenet 
<A HREF="news:news.announce">news.announce</A> y tambi&eacute;n ser&aacute;n archivadas en
<A HREF="ftp://rtfm.mit.edu/pub/usenet/news.answers">ftp://rtfm.mit.edu/pub/usenet/news.answers</A>:</P>
<P>
<UL>
<LI>PCsoundcards/generic-faq (PUF gen&eacute;ricas acerca de tarjetas de sonido para PC)</LI>
<LI>PCsoundcards/soundcard-faq (comp.sys.ibm.pc.soundcard PUF)</LI>
<LI>PCsoundcards/gravis-ultrasound/faq (PUF acerca de Gravis UltraSound)</LI>
<LI>audio-fmts/part1 (Descripciones de formatos de ficheros de audio)</LI>
<LI>audio-fmts/part2 (Descripciones de formatos de ficheros de audio)</LI>
</UL>
</P>
<P>Las PUF tambi&eacute;n muestran bastantes listas de correo y sitios
de archivos sobre productos espec&iacute;ficos. Los siguientes grupos de noticias de Usenet tratan sobre
temas de sonido y/o m&uacute;sica:</P>
<P>
<UL>
<LI> 
<A HREF="news:alt.binaries.sounds">alt.binaries.sounds.*</A> (varios grupos para enviar ficheros de sonido)</LI>
<LI> 
<A HREF="news:alt.binaries.multimedia">alt.binaries.multimedia</A> (para enviar ficheros Multimedia)</LI>
<LI> 
<A HREF="news:alt.sb.programmer">alt.sb.programmer</A>(temas de programaci&oacute;n de la Soundblaster)</LI>
<LI> 
<A HREF="news:comp.multimedia">comp.multimedia</A>(temas acerca de multimedia)</LI>
<LI> 
<A HREF="news:comp.music">comp.music</A> (Teor&iacute;a e investigaci&oacute;n sobre la m&uacute;sica por ordenador)</LI>
<LI> 
<A HREF="news:comp.sys.ibm.pc.soundcard">comp.sys.ibm.pc.soundcard.*</A> (varios grupos acerca de tarjetas de sonido para el IBM PC)</LI>
</UL>
</P>
<P>Podemos encontrar una p&aacute;gina Web dedicada a multimedia en
<A HREF="http://viswiz.gmd.de/MultimediaInfo/">http://viswiz.gmd.de/MultimediaInfo/</A>. Creative Labs tiene su p&aacute;gina Web
en 
<A HREF="http://www.creaf.com/">http://www.creaf.com/</A>. MediaTrix tiene su p&aacute;gina Web en
<A HREF="http://www.mediatrix.com/">http://www.mediatrix.com/</A>.</P>
<P>Las listas de correo de Linux tienen un n&uacute;mero de "canales" dedicados a
diferentes temas, inclu&iacute;do el sonido. Para saber c&oacute;mo suscribirse, env&iacute;e un
mensaje con la palabra "help" como cuerpo del mensaje a
<A HREF="mailto:majordomo@vger.rutgers.edu">majordomo@vger.rutgers.edu</A>.
Estas listas de correo no son recomendadas para preguntas acerca de la configuraci&oacute;n
de la tarjeta de sonido, sino que se orientan hacia discusiones relacionadas con
el desarrollo.</P>
<P>Como he mencionado en varias ocasiones, el controlador de sonido del
n&uacute;cleo incluye una serie de ficheros <CODE>Readme</CODE> que contienen informaci&oacute;n
acerca del controlador de la tarjeta de sonido. Generalmente se encuentran en el
directorio
<CODE>/usr/src/linux/drivers/sound</CODE>.</P>
<P>Puede contactar con el autor del controlador de sonido del n&uacute;cleo, Hannu
Savolainen, en la direcci&oacute;n 
<A HREF="mailto:hannu@voxware.pp.fi">hannu@voxware.pp.fi</A>. Tambi&eacute;n tiene una p&aacute;gina
Web en 
<A HREF="http://personal.eunet.fi/pp/voxware">http://personal.eunet.fi/pp/voxware</A>. Esta p&aacute;gina es el mejor sitio
para enterarse de las &uacute;ltimas tarjetas de sonido soportadas, problemas y
soluci&oacute;n de errores.</P>
<P>Informaci&oacute;n acerca de OSS, el controlador de sonido comercial para Linux y otros
sistemas compatibles Unix, puede encontrarse en la p&aacute;gina Web de 4Front Technologies en
<A HREF="http://www.4front-tech.com/">http://www.4front-tech.com/</A>.</P>
<P>El Mapa de Software de Linux (Linux Software Map (LSM)) es una referencia
de gran valor para localizar software de Linux. Buscar palabras en el LSM
como por ejemplo sonido es una buena forma de identificar aplicaciones
referentes a hardware de sonido. El LSM se puede encontrar en varios FTP
an&oacute;nimos, incluyendo
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/LSM.gz">ftp://sunsite.unc.edu/pub/Linux/docs/LSM.gz</A>.</P>
<P>El Proyecto de Documentaci&oacute;n de Linux ha producido varios libros acerca Linux, incluyendo
<CODE>Linux: Instalaci&oacute;n y Primeros Pasos</CODE>
<BLOCKQUOTE>Disponible en castellano en <CODE>http://www.infor.es/LuCAS</CODE></BLOCKQUOTE>
. Est&aacute;n disponibles libremente
en la mayor&iacute;a de FTP an&oacute;nimos de archivos de Linux, o tambi&eacute;n pueden ser
comprados en formato impreso.</P>
<P>Por &uacute;ltimo, una puntualizaci&oacute;n un poco sinverg&uuml;enza: Si desea aprender
un poco m&aacute;s sobre multimedia bajo Linux (especialmente programaci&oacute;n de
aplicaciones para tarjetas de sonido y CD-ROM), compre mi libro
<CODE>Gu&iacute;a Linux Multimedia</CODE>, ISBN 1-5692-219-0, publicado por O'Reilly and Associates
Adem&aacute;s de la versi&oacute;n original inglesa, ahora est&aacute;n a la venta tambi&eacute;n las versiones francesa y japonesa. 
Para m&aacute;s detalles, llame al 800-998-9938 en Norte Am&eacute;rica, o visite la p&aacute;gina Web 
<A HREF="http://www.ora.com/catalog/multilinux/noframes.html">http://www.ora.com/catalog/multilinux/noframes.html</A> o mi p&aacute;gina personal
<A HREF="http://www.pobox.com/~tranter">http://www.pobox.com/~tranter</A>.</P>

<HR>
<A HREF="Sonido-COMO-8.html">Página siguiente</A>
<A HREF="Sonido-COMO-6.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc7">Índice general</A>
</BODY>
</HTML>
