<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.02b7 [en] (X11; I; Linux 2.0.29 i586) [Netscape]">
</HEAD>
<BODY>

<CENTER>
<H2>
<FONT SIZE=+2>Copyright Faq-Slug</FONT></H2></CENTER>
<FONT SIZE=+2>La informaci&oacute;n que seguidamente se expone esta sacada
en su mayor parte de la lista l-linux que como es sabido es la lista de&nbsp;</FONT>
<FONT SIZE=+2><A HREF="slug.ctv.es">Slug</A> .</FONT>

<P><FONT SIZE=+2>Esta faq esta siendo remodelada actualmente con el objeto
de dividirla en dos partes bien distintas.</FONT>

<P><FONT SIZE=+2><U>La primera</U> se llamar&aacute; <B>Preguntas y respuestas</B>
contiene consejos generales y respuestas a las preguntas m&aacute;s frecuentes
aparecidas en la lista l-linux. La informaci&oacute;n se obtiene fundamentalmente
de la propia lista.</FONT>

<P><FONT SIZE=+2>El criterio&nbsp; seguido ha sido coleccionar aquellas
preguntas que me parec&iacute;an m&aacute;s interesantes refundiendo la
informaci&oacute;n sobre un mismo tema de forma que ganara en legibilidad.
Hay que recordar que el contenido de la lista l-linux es accesible y por
tanto no se trataba de volver a reproducir la misma informaci&oacute;n.
Cuando se produce un encadenamiento de preguntas y respuestas se procura
sacar la esencia de la misma. Como es l&oacute;gico se suprime la informaci&oacute;n
subjetiva y sin interes t&eacute;cnico, y se procura presentar la informaci&oacute;n
en un tono m&aacute;s impersonal. M&aacute;s facil resulta cuando la persona
que ha sido asesorada deja un mensaje de resumen de las soluciones obtenidas.
Si existe alguna incorrecci&oacute;n tanto en temas de derechos como en
el de contenidos contactar con&nbsp;&nbsp;</FONT><FONT SIZE=+1> </FONT><FONT SIZE=+2><A HREF="mailto://acastro@ctv.es">Antonio
Castro</A></FONT>
<BR>&nbsp;

<P><FONT SIZE=+2><U>La segunda</U>&nbsp; se llamar&aacute; <B>Art&iacute;culos-Slug</B>
est&aacute; formada por una serie de&nbsp; articulos con el nombre de las
personas que han colaborado en ellos. Estos &uacute;ltimos no est&aacute;n
necesariamente sacados de 'l-linux' sino que fueron escritos&nbsp; especificamente
para la 'faq de slug' .&nbsp; En este segundo caso los comentarios deber&aacute;n
dirigirse a los autores que figuren en las mismas.</FONT>

<P>
<HR WIDTH="100%">

<P><FONT SIZE=+2>&nbsp;Son muchos los autores de esta valiosa informaci&oacute;n.
Las personas que participan en l-linux dando asistencia lo hacen de forma
altruista. Esta informaci&oacute;n es de dominio p&uacute;blico, y puede
ser publicada sin m&aacute;s requisito que la obligaci&oacute;n de citar
como fuente a la lista 'l-linux', o a sus autores en caso de los art&iacute;culos.
Tampoco estar&iacute;a de m&aacute;s mencionar a la 'faq de slug'.</FONT>

<P><FONT SIZE=+2>En cualquier caso toda la informaci&oacute;n debe tomarse
como aportaciones altruistas y por ello los autores de las mismas no se
hacen responsables de los da&ntilde;os de cualquier tipo que puedan ocasionarse
derivados del uso o interpretaci&oacute;n de la informaci&oacute;n contenida
en parte alguna de esta Faq de Slug.</FONT>

<P>&nbsp; <A HREF="slugfaq.htm">Vuelta al Indice general</A>

<P>.
</BODY>
</HTML>
