
<HTML>
<HEAD>
<TITLE> FAQ de conexi&oacute;n a Centros Proveedores de Internet (CPI) </TITLE>
</HEAD>
<BODY>
<A HREF="slugfaq.html#toc3">Faq general de Slug Contenidos</A>
<HR>
<H2><A NAME="faq-cpi.htm">3.2 Conexi&oacute;n a Internet desde Linux (con o sin infov&iacute;a)<BR>
y configuracion del correo en Linux</A></H2>
<P>
<BR>
<HR>
<H4>INTRODUCCION</H4>
<P>
Esta FAQ esta realizada por Antonio Castro en base a su propia 
configuraci&oacute;n, lo cual puede no ser igual de util para todo el mundo, pero
permite exponer un caso concreto en detalle.
<P>
No soy un experto en la materia pero con los procedimientos que en su d&iacute;a
publico Luis Colorado para conectarse a traves de infov&iacute;a 
<A HREF=http://slug.ctv.es/cont/infovia/linux-cpi.html> 
http://slug.ctv.es/cont/infovia/linux-cpi.html</A>
 consegu&iacute; conectarme enseguida y luego he ido tocando cosillas. 
<BR>
Particularmente he llegado a configurar mi equipo de una manera bastante 
aceptable que me permite una comoda gestion del correo.
<P>
Una sesi&oacute;n tipica con el correo puede ser la siguiente:

<P>
<OL>
<LI> Me conecto a mi centro proveedor.<BR>
<LI Traigo el correo. Los mensajes recibidos se borran del servidor.<BR>
El correo se distribuye en carpetas gracias a un filtro procmail.<BR>
El procedimiento de carga del correo me muestra las carpetas que han cambiado. <BR>
<LI> Atiendo en primer lugar los mensajes personales, y contesto inmediatamente lo que sea necesario. <BR> 
<LI> Como no he cortado la conexi&oacute;n lo que env&iacute;o sale inmediatamente, por la linea.<BR>
<LI> Corto la comunicaci&oacute;n.  <BR>
<LI> Continuo leyendo los demas mensajes fuera de linea.<BR>
<LI> Los mensajes que decido contestar quedaran esta vez encolados automaticamente al no existir ya conexi&oacute;n.<BR>
<LI> Por &uacute;ltimo me conecto nuevamente con el fin de enviar los mensajes acumulados en el buz&oacute;n de salida.
</OL>
<P>

Como este comportamiento parece razonable expongo en detalle todos los ficheros
Es una soluci&oacute;n particular, en concreto la mia y estoy seguro sera de gran 
ayuda para todo aquel que ande mas despistado que yo. :-)
<P>
Quizas alguien se pregunte porque se trata conjuntamente el tema de la
conexi&oacute;n y el tema del correo.  
En primer lugar ambos temas son bastante delicados y muy necesarios.
Y en segundo lugar porque estan parcialmente relacionados.
<P>
<HR>
<H2>INDICE</H2>
<P>
Con todo lo que viene a continuaci&oacute;n se dar&aacute; respuesta a unas cuantas 
preguntas relacionadas con estos temas:
<P>
<UL>
<LI><A HREF="#conexion"> Conexi&oacute;n a Internet desde Linux (con y sin infov&iacute;a)</A>
<LI><A HREF="#DOC"> OTROS DOCUMENTOS</A> 
<LI><A HREF="#REQ"> REQUISITOS</A>
<LI><A HREF="#REAL"> UN CASO REAL</A> 
<LI><A HREF="#mail"> Correo Linux</A>
<LI><A HREF="#PGP"> Como usar el PGP con el correo.(Firma de autentificaci&oacute;n y encriptaci&oacute;n).</A>
<LI><A HREF="#procmail"> Como separar el correo entrante en carpetas (personal, l-linux, varios, majordomo, etc)</A>
<LI><A HREF="#ENV"> Personalizaci&oacute;n de entorno (/home/acastro/.*) para el correo </A>
<LI><A HREF="#masc"> TRANSPORTE DEL CORREO CON SENDMAIL.</A>
<LI> Contenido de los directorios <A HREF="local-bin/index.html"> /usr/local/bin </A> y <A HREF="etc-ppp/index.html"> /etc/ppp</A> 
</UL>
<P>
La presente propuesta se resume en una serie de ficheros. Algunos
son ficheros de <A HREF=#confsist> configuraci&oacute;n del sistema ppp </A> otros son de <A HREF=#ENV>configuraci&oacute;n del usuario de correo</A> y otros son shells que deberan ser
ejecutadas desde <A HREF=#ROOT>root</A> o desde el <A HREF=#USER>usuario de correo</A>.

<P>
<P>
<HR>
<H4><A NAME="DOC"> OTROS DOCUMENTOS</A></H4>
<P>
Adem&aacute;s puede consultar otros documentos como los man relativos a los comandos
que vamos a usar aqui.
<P>
Para conectarme a internet y para gestionar el correo uso lo siguiente:
<P>


<TABLE BORDER CELLPADDING="2">
<TR> <TD> ppp<BR>pppd(8)</TD>
     <TD>(Point to Point Protocol)</TD></TR>
<TR> <TD> procmail(1)<BR>procmailex(5)</TD>
     <TD>Para filtar el correo y procesarlo.<BR> (Por ejemplo separarlo en carpetas )</TD>/<TR>
<TR> <TD> fetchpop(1L)</TD>
     <TD>Para bajar el correo borrandolo en el servidor y<BR> clasificarlo usando procmail</TD></TR>
<TR> <TD> pine(1)</TD>
     <TD> Para gestion del correo y de las News</TD></TR>
<TR> <TD> pgp -h<BR>pgp -k</TD>
     <TD>(Private Good Privacy)<BR> Criptografia de clave publica.</TD></TR>
<TR> <TD> sendmail(8)</TD>
     <TD>Para el transporte de correo.</TD></TR>
</TABLE>
<P>
<P>
Algunos documentos relativos a este tema ya han sido traducidos al Español.
<P>
INSFLUG (Traduce documentos breves como Howtos y Faqs)<BR>
LuCas (Traduce libros, y guias )
<P>
<H4><A NAME=links>Enlaces interesantes</A></H4>
<P>
<A HREF=http://www.insflug.nova.es/traducciones.htm> Traducciones de Faqs y Howtos realizadas por el grupo INSFLUG </A><BR>
Entre estas ultimas estan Noticias-Como, PPP-Como, Infovia-Como.
<P>
Esta ultima merece una referencia especial.
<P>
<A HREF=http://www.insflug.nova.es/howtos/online/Infobia.html> Guia rapida de conexi&oacute;n (con y sin infov&iacute;a usando ppp)</A><BR> Por Francisco Jose Montilla (pacopepe@nova.es)
<P>
La parte de conexi&oacute;n directa (sin infovia) la he sacado entera de aqui y
no la he podido probara siquiera, porque mi centro proveedor solo es accesible atraves de invof&iacute;a.

En cambio para la parte de conexi&oacute;n a infov&iacute;a he utilizado los procedimientos que en su dia publico Luis Colorado para conectarse a traves de infov&iacute;a.
<A HREF=http://slug.ctv.es/cont/infovia/linux-cpi.html> http://slug.ctv.es/cont/infovia/linux-cpi.html</A>
<BR> 
Para preguntas complicadas sobre estos temas creo que es mejor que recurrais a
<A HREF=mailto:luis@slug.ctv.es> Luis Colorado</A> trabaja en Telef&oacute;nica de sistemas y fu&eacute; la primera persona de la que yo tuve noticia que hab&iacute;a conseguido este tipo de conexi&oacute;n. Yo soy un aprendiz.

<BR>
<P>
Entre los <A HREF=http://www.infor.es/LuCas/manuales.html> Manuales de LuCAS</A>
Tenemos la versi&oacute;n alpha de la traducci&oacute;n de Linux'Network Administration Guide 
Coordinada por Juan Jose Amor. 

<P>
<HR>
<H4><A NAME="REQ"> REQUISITOS</A></H4>
<P>
El kernel debe estar compilado con soporte para ppp, y TCT/IP.
<P>

Como orientaci&oacute;n para una persona que empieza que solo quiere usar cosas normalitas
para acceder a internet para su uso personal puede usar lo siguiente:
<P>
 
       Networking support (CONFIG_NET) [y] y<BR>
       TCP/IP networking (CONFIG_INET) [y] y<BR>
       IP forwarding/gatewaying (CONFIG_IP_FORWARD) [n] n<BR>
       IP multicasting (CONFIG_IP_MULTICAST) [n] n<BR>
       IP firewalling (CONFIG_IP_FIREWALL) [n] n<BR>
       IP accounting (CONFIG_IP_ACCT) [n] n<BR>
       PC/TCP compatibility mode (CONFIG_INET_PCTCP) [n] n<BR>
       Reverse ARP (CONFIG_INET_RARP) [n] n<BR>
       Assume subnets are local (CONFIG_INET_SNARL) [y] y<BR>
       Disable NAGLE algorithm (normally enabled) (CONFIG_TCP_NAGLE_OFF) [n] n<BR>
       The IPX protocol (CONFIG_IPX) [n] n<BR>
       Network device support? (CONFIG_NETDEVICES) [y] y<BR>
       Dummy net driver support (CONFIG_DUMMY) [n] n<BR>
       SLIP (serial line) support (CONFIG_SLIP) [y] n<BR>
        CSLIP compressed headers (CONFIG_SLIP_COMPRESSED) [y] y<BR>
        16 channels instead of 4 (SL_SLIP_LOTS) [n] n<BR>
       PPP (point-to-point) support (CONFIG_PPP) [y] y<BR>
       PLIP (parallel port) support (CONFIG_PLIP) [n] n<BR>
<P>

La compilacion de un kernel se sale un poco de este tratado.
Crear un kernel nuevo es muy facil pero recuerde que<STRONG> SIEMPRE debe permitir 
arrancar con el kernel antiguo</STRONG> por si algo sale mal.
<P>
<HR>
<H4><A NAME="REAL"> UN CASO REAL</A></H4>
<P>
Puesto que todo esta basado en mi propio caso particular hay que
tomarlo como un ejemplo donde cada cual tendr&aacute; que realizar sus
pequeñas adaptaciones:
<P>
Donde vea  'acastro'  sustituya por su nombre de usuario. Deber&aacute; tener una cuenta
en susistema que coincida con el nombre de usuario de correo.
Nunca use el correo desde root, porque la respuesta podr&iacute;a llegar a un root que
no es usted.
<BR>
Donde vea 'ctv' ponga el nombre de su centro proveedor internet.
<BR>
Donde vea 'ctv.es' ponga el nombre y dominio de su centro proveedor internet.
<BR>
Donde vea 'midas' ponga el nombre de su m&aacute;quina.
<BR>
Donde vea 'sandra' ponga el nombre de su servidor de correo.
<BR>
Donde vea 'password' ponga su palabra clave para el correo.
<BR>
<P>
<HR>
<H4><A NAME="ROOT"> COMANDOS A EJECUTAR DESDE ROOT</A></H4>
<P>
Los comandos que proponemos usar a continuaci&oacute;n deben ejecutarse siempre desde la cuenta de root.
<P>
<TABLE BORDER CELLPADDING="2">
<TR> <TD> /usr/local/bin/ctv </TD>
     <TD> Permite conectar con CTV (mi CPI)<BR> atraves de infov&iacute;a</TD></TR>
<TR> <TD> /usr/local/bin/upcremote </TD>
     <TD> Permite conexion directa con un CPI sin infov&iacute;a. <BR>(Yo no lo he probado). Vease la<BR><A HREF=#links> Gu&iacute;a r&aacute;pida de conexi&oacute;n de pacopepe@nova.es </A> </TD></TR>
<TR> <TD> /usr/local/bin/killppp </TD>
     <TD> Para desconectar</TD></TR>
</TABLE>


<P>
<HR>
<H4><A NAME="USER"> COMANDOS A EJECUTAR DESDE EL USUARIO</A></H4>
<H4><A NAME="mail"> Correo en Linux</A></H4>
<P>
Desde la cuenta de usuario personal se propone el uso de los siguientes comandos.
<P>
<TABLE BORDER CELLPADDING="2">
<TR> <TD><A NAME=fetchpop>/usr/local/bin/traecorreo </A> </TD>
     <TD>Traer el correo usando procmail y borrando los mensajes<BR> recibidos en el servidor remoto  (Usa <STRONG>fetchpop -pr)</STRONG> </TD></TR>
<TR> <TD> mailq</TD>
     <TD> Consultar la cola de salida de correo.</TD></TR>
<TR> <TD> sendmail -q </TD>
     <TD> Forzar el env&iacute;o de correo pendiente<BR>(vaciar la cola de salida de correo) </TD></TR>
<TR> <TD> pine </TD>
     <TD> Gestor de correo.</TD></TR>
<TR> <TD> pgp </TD>
     <TD> (Private Good Privacy)<BR> Sistema de criptograf&iacute;a de clave p&uacute;blica.</TD></TR>
</TABLE>

<P>
<HR>
<H4>CONTENIDO DE LOS DIFERENTES FICHEROS</H4>
<UL>
<LI><E>/etc/ppp/options (vac&iacute;o)</E>
<P>
<LI><E>/etc/resolv.conf</E>
<P>
 (debera contener la direcc&iacute;on de su servido de nombres y el nombre de su dominio.)
<PRE>
domain ctv.es
nameserver 194.xxx.yyy.zzz
</PRE>
<P>
<LI><STRONG> Ejecutables </STRONG>
<A HREF="local-bin/index.html"> Ficheros necesarios en  /usr/local/bin </A>
<P>
<LI><STRONG><A NAME=confsist>Ficheros de configuracion del sistema </A></STRONG>
<A HREF="etc-ppp/index.html"> Ficheros necesarios en  /etc/ppp</A> 
</UL>

<P>
<HR>
<H4><A NAME="ENV"> PERSONALIZACION DEL ENTORNO (/home/acastro/.*) </A></H4>
<P>
<UL>
<LI>
<P>
<A NAME="Firma"> Fichero de firma </A>
<BR>
<E>.signature (Mi firma)</E>
<PRE>
        /\     /\  La calidad de LINUX no se discute.
          \\W//    Su precio tampoco. Pero somos una
         _|0 0|_   minoria. Probemos a ser simpaticos.
+-oOOO--(___o___)--OOOo--------------------------+ 
| .........U.U........ Antonio Castro Snurmacher |
| http://slug.ctv.es/~acastro.    acastro@ctv.es |
+()()()----------()()()--------------------------+  
</PRE>
Es importante que las firmas no ocupen mucho.
<P>
<LI> <A NAME="redir"> Redirigir el correo a procmail. </A><BR>
<E>.forward (Redirigir a procmail)</E>
<P>
<PRE>
| /usr/bin/procmail<BR>
</PRE>
Mas sobre <A HREF=#procmail> procmail </A> mas adelante.
<P>
<LI>
<P>
<E>.pinerc (Puff..)</E>
 (Demasiado largo  :-) )<BR>
 Se configura desde pine.  Yo tengo configurado el editor de mensajes para usar 'vi'. Y para vi tengo configurado .exrc <BR>
 Para poder firmar y encriptar los mensajes usando una tecla de funci&oacute;n.<BR>
 El fichero .exrc queda como sigue a continuaci&oacute;n.<BR>
<P>
<LI>
<P>
<H4><A NAME="PGP"> Como usar el PGP con el correo.</A></H4>
<P>
<E>.exrc (F1: Firmar con PGP   , F2: Encriptar con PGP)</E>
<PRE>
:map [[A 1G!Gpgp -satf 2>/dev/tty
:map [[B !'apgp -eatf 2>/dev/tty 
</PRE>
<BR>
El sistema propuesto es declarar unas macros para vi, y poner a vi
como editor de pine. Para obtener una breve descripci&oacute;n de los comandos
generales de PGP usar 'pgp -h' y para obtener una descripci&oacute;n de los comandos
de gesti&oacute;n de llaves 'pgp -k'.<BR>
PGP tiene una base matem&aacute;tica muy solida. Multiplicar dos numeros primos muy
grandes es trivial y muy r&aacute;pido, comparado con hacer la operaci&oacute;n inversa.
Es decir dado el producto anterior averiguar cuales son los factores.<BR>
Puesto que esto no es una FAQ de PGP no voy a comentar m&aacute;s pero si no conoce
este sistema se esta perdiendo algo que realmente merece la pena. Puede 
necesitarlo en cualquier momento porque es una de las mejores maneras de
proteger la informaci&oacute;n. Cosa muy necesaria en la Internet.

<P>
<LI>
<E>.fetchhost</E> 
<P>
Este fichero esta encriptado se inicializa solo la primera vez que un usuario utilice fetchost porque pregunta nombre de la m&aacute;quina nombre del usuario, la password, y periodo de tiempo entre bajada y bajada de correo cuando esta como demonio)
<P>
<LI><H4><A NAME="procmail"> Como separar el correo entrante en carpetas (personal, l-linux, varios)</A></H4>
<BR>
<E>.procmailrc (filtro para separacion en carpetas)</E>
<P>
Este filtro es solo un ejemplo. Si desea ver mas ejemplos y sacar mas partido a la
potencia de procmail consulte la pagina man procmailex(5).
<P>
<PRE>
MAILDIR=$HOME/mail
DEFAULT=$MAILDIR/varios
VERBOSE=yes
LOGFILE=$HOME/log/procmail.log

:0:
* ^Sender.*owner-l-linux@calvo.teleco.ulpgc.es
l-linux

## Cuando dos reglas hacen blanco en el mismo mensage solo actuara la primera
:0:
* ^From:.*[Ll]uis.*
luis

:0:
* (^From:|^To:|^Cc:).*[Mm]ajordomo.*
majordomo

:0:
* (^To:|^Cc:).*acastro.*
personal

:0:
* (^To:|^Cc:).*linux-admin@vger.rutgers.edu
linux-admin

:0:
* (^To:|^Cc:).*@vger.rutgers.edu
linux-mmm

:0:
* (^To:|^Cc:).*Linux-Announce@senator-bedfellow.MIT.EDU
Linux-Announce

:0:
* (^To:|^Cc:).*linux-prog@compendium.com.ar.*
linux-prog
</PRE>

Para usar procmail con <A HREF=#fetchpop> fectchpop </A> vease <A HREF=#redir>.forward </A>
</UL>
<P>
<HR>
<H2><A NAME="masc"> TRANSPORTE DEL CORREO CON SENDMAIL.</A></H2>
<BR>
Estas modificaciones en sendmail.cf me las facilito Luis Colorado.
Las pongo porque a muchos les puede servir para su propio caso.
<BR>
Tengo las siguientes direcciones de correo:
<BR>
acastro@midas.ctv.es	En la m&aacute;quina de mi casa.  <BR>
acastro@sandra.ctv.es	En el servidor de correo de mi CPI.  <BR>
acastro@sag.es		En el trabajo.  <BR>
acastro@slug.ctv.es	En Slug.   <BR>

<P>
<HR>
<E>/etc/sendmail.cf</E>
<P>
Este fichero tiene una estructura muy complicada, que no es facil
entender. Solo se muestran tres  cambios efectuados en el fichero
original de sendmail.cf (generalmente las distribuciones 
proporcionan un fichero sendmail.cf que funciona. Solo hay que
tocarlo un poco).<BR> Concretamente 
Cwlocalhost, DS, y DM
<P>
<PRE>
Cwlocalhost midas midas.ctv.es

# "Smart" relay host (may be null)
DSsandra.ctv.es

# who I masquerade as (null for no masquerading) (see also $=M)
DMctv.es
</PRE>
<HR>
<P>
Ojo para la m&aacute;quina de casa 'midas' hemos tenido la precaucion de 
usar un dominio que existe, porque sino no se podria mandar por un 
dominio inexistente. <BR>
No se env&iacute;a al destino sino a Sandra porque as&iacute; no se bloquea el pine. 
Si estamos conectados lo enviar&aacute; online, y si no lo deja encolado.
Sandra no reconocera la m&aacute;quina 'midas' por lo que dejar&aacute; el correo
all&iacute; por un tiempo y seremos nostros los que nos conectaremos para
traernos ese correo.<BR>
Dado que la m&aacute;quina midas.ctv.es no existe enmascaramos ctv.es
<BR>
La filosof&iacute;a general del correo es que un mensaje es un objeto que se desplaza 
por si mismo. Si el dominio al que va dirigido es conocido viajar&aacute; hasta all&iacute;, 
si dentro de ese dominio la m&aacute;quina es conocida viajar&aacute; hasta ella, pero en 
caso contrario quedara por un tiempo esperando que alguien lo recoja.
<BR>
Para el ejemplo vamos a suponer que intercambio correspondencia con
un amigo que esta dado de alta en el mismo centro proveedor que yo.
Curiosamente se llama Angel Castro pero yo llegue primero y a el le
negaron el nombre de 'acastro' su nombre para el correo es 'angel'
y su m&aacute;quina tiene un nombre proporcionado por CTV por ejemplo 'x5555'
Esto es asi porque el solicito una cuenta especial con direccion IP
fija mas cara.
<BR>
Asi pues cuando le escribo mando los mensajes a 'angel@x5555.ctv.es'.
<BR>
En un mismo dominio no deberia existir dos usuarios con el mismo nombre
si no tienen nombre de m&aacute;quina valida en internet, lo cual supone tener 
direccion IP fija.
<BR>
De la forma que tengo configurado mi sendmail mis mensajes salen con el campo 
from correcto porque CTV no tiene un usuario acastro que no sea yo. 
(He usado el mismo nombre de usuario acastro en todas las m&aacute;quinas donde uso 
correo).  Supongamos que mi mujer tiene cuenta en mi m&aacute;quina 
(pilar@midas.ctv.es) y que env&iacute;a un mensaje por internet. 
Dado que la &uacute;nica cuenta que tengo en CTV es la de acastro,
su mensaje no podr&iacute;a salir como de pilar@ctv.es. Para eso tendr&iacute;a que haber
reservado el nombre de pilar como cuenta de ctv.  Tampoco puede salir como
pilar@midas.ctv.es, porque midas.ctv.es no es una m&aacute;quina oficial de
internet.
<BR>
Mi amigo Angel tiene un ordenador en su casa de Madrid y una cuenta en CTV 
pero su situaci&oacute;n es distinta ya que tiene asignada una direcci&oacute;n IP fija, 
por ello su mujer si podr&iacute;a enviar correo con una cuenta creada en la 
m&aacute;quina de Angel porque el nombre de la m&aacute;quina de Angel no es algo ficticio. 
<BR>
Si yo pido a mi amigo Angel que me habra una cuenta en su m&aacute;quina y env&iacute;o
desde ella un mensaje como acastro@ctv.es, la respuesta me llegara a mi
cuenta de ctv, pero si lo hago como acastro@x5555.ctv.es, la respuesta,
llegar&aacute; a mi cuenta en el ordenador de Angel.
<BR>
Si mi amigo Angel tuviera una cuenta normalita en CTV del mismo tipo que yo.
Cada vez que se conectara tendr&iacute;a una direcci&oacute;n IP distinta y por lo tanto 
el nombre de su m&aacute;quina no ser&iacute;a un nombre valido en internet y podr&iacute;a ser 
cualquiera. Por ejemplo angelix.ctv.es. 
<BR>
En esta otra situaci&oacute;n si yo enviara desde ella un mensaje como acastro@ctv.es 
o como acastro@angelix.ctv.es llegar&iacute;a en ambos casos a CTV y all&iacute; al ser
correo para acastro de una m&aacute;quina desconocida en el dominio ctv.es ser&iacute;a 
recogida por mi m&aacute;quina midas@ctv.es.
<BR>
Esta es la diferencia en cuanto a correo de tener una direcci&oacute;n internet
v&aacute;lida (y fija) o no.
<BR>
Hay que observar que en el caso de m&aacute;quinas como 'midas' o 'angelix' que
cada vez que se conectan tienen una direccion IP distinta el correo viaja
hasta el servidor de correo de CTV 'sandra' porque alli ya no sabe continuar
y por eso hay que solicitarlo. Pero en el caso de una direccion IP fija el
nombre de m&aacute;quina es un nombre de m&aacute;quina valido en internet y el correo
viajara solito hasta su destino. 
<BR>
Usaremos sendmail como un demonio (opcion -bd), pondremos que gestione
la cola de salida cada 2 minutos. (opcion -q2m). Cuando queramos que
envie el correo inmediatamente podemos hacer 'sendmail -q' aunque este
arrancado como demonio. Esto vacia la cola de mensajes enviando el correo 
pendiente.
<P>
El sendmail tiene un modo debug "sendmail -bt"
<BR>
Ponemos el resultado de unas cuantas para ver como funciona, el 
disfraz de 'ctv.es' (enmascaramiento sonaba muy feo  :-) ).
<P>
<PRE>
Comienzo ejemplo de traza
[root@midas /root]# sendmail -bt
ADDRESS TEST MODE (ruleset 3 NOT automatically invoked)
Enter <ruleset> <address>
> 3,0 acastro
rewrite: ruleset   3   input: acastro
rewrite: ruleset  96   input: acastro
rewrite: ruleset  96 returns: acastro
rewrite: ruleset   3 returns: acastro
rewrite: ruleset   0   input: acastro
rewrite: ruleset  98   input: acastro
rewrite: ruleset  98 returns: acastro
rewrite: ruleset   0 returns: $# local $: acastro
> 3,0 acastro@ctv.es
rewrite: ruleset   3   input: acastro @ ctv . es
rewrite: ruleset  96   input: acastro < @ ctv . es >
ctv.es: Name server timeout
rewrite: ruleset  96 returns: acastro < @ ctv . es >
rewrite: ruleset   3 returns: acastro < @ ctv . es >
== Ruleset 3,0 (3) status 75
rewrite: ruleset   0   input: acastro < @ ctv . es >
rewrite: ruleset  98   input: acastro < @ ctv . es >
rewrite: ruleset  98 returns: acastro < @ ctv . es >
rewrite: ruleset  95   input: < sandra . ctv . es > acastro < @ ctv . es >
rewrite: ruleset  95 returns: $# relay $@ sandra . ctv . es $: acastro < @ ctv . es >
rewrite: ruleset   0 returns: $# relay $@ sandra . ctv . es $: acastro < @ ctv . es >
> 3,0 acastro@midas.ctv.es
rewrite: ruleset   3   input: acastro @ midas . ctv . es
rewrite: ruleset  96   input: acastro < @ midas . ctv . es >
rewrite: ruleset  96 returns: acastro < @ localhost . ctv . es . >
rewrite: ruleset   3 returns: acastro < @ localhost . ctv . es . >
rewrite: ruleset   0   input: acastro < @ localhost . ctv . es . >
rewrite: ruleset  98   input: acastro < @ localhost . ctv . es . >
rewrite: ruleset  98 returns: acastro < @ localhost . ctv . es . >
rewrite: ruleset  95   input: < sandra . ctv . es > acastro < @ localhost . ctv . es . >
rewrite: ruleset  95 returns: $# relay $@ sandra . ctv . es $: acastro < @ localhost . ctv . es . >
rewrite: ruleset   0 returns: $# relay $@ sandra . ctv . es $: acastro < @ localhost . ctv . es . >
> 3,0 acastro@slug.ctv.es
rewrite: ruleset   3   input: acastro @ slug . ctv . es
rewrite: ruleset  96   input: acastro < @ slug . ctv . es >
rewrite: ruleset  96 returns: acastro < @ slug . ctv . es . >
rewrite: ruleset   3 returns: acastro < @ slug . ctv . es . >
rewrite: ruleset   0   input: acastro < @ slug . ctv . es . >
rewrite: ruleset  98   input: acastro < @ slug . ctv . es . >
rewrite: ruleset  98 returns: acastro < @ slug . ctv . es . >
rewrite: ruleset  95   input: < sandra . ctv . es > acastro < @ slug . ctv . es . >
rewrite: ruleset  95 returns: $# relay $@ sandra . ctv . es $: acastro < @ slug . ctv . es . >
rewrite: ruleset   0 returns: $# relay $@ sandra . ctv . es $: acastro < @ slug . ctv . es . >
> 3,0 acastro@sag.es
rewrite: ruleset   3   input: acastro @ sag . es
rewrite: ruleset  96   input: acastro < @ sag . es >
sag.es: Name server timeout
rewrite: ruleset  96 returns: acastro < @ sag . es >
rewrite: ruleset   3 returns: acastro < @ sag . es >
== Ruleset 3,0 (3) status 75
rewrite: ruleset   0   input: acastro < @ sag . es >
rewrite: ruleset  98   input: acastro < @ sag . es >
rewrite: ruleset  98 returns: acastro < @ sag . es >
rewrite: ruleset  95   input: < sandra . ctv . es > acastro < @ sag . es >
rewrite: ruleset  95 returns: $# relay $@ sandra . ctv . es $: acastro < @ sag . es >
rewrite: ruleset   0 returns: $# relay $@ sandra . ctv . es $: acastro < @ sag . es >
> 3,1,11,4 acastro
rewrite: ruleset   3   input: acastro
rewrite: ruleset  96   input: acastro
rewrite: ruleset  96 returns: acastro
rewrite: ruleset   3 returns: acastro
rewrite: ruleset   1   input: acastro
rewrite: ruleset   1 returns: acastro
rewrite: ruleset  11   input: acastro
rewrite: ruleset  51   input: acastro
rewrite: ruleset  51 returns: acastro
rewrite: ruleset  61   input: acastro
rewrite: ruleset  61 returns: acastro < @ *LOCAL* >
rewrite: ruleset  94   input: acastro < @ *LOCAL* >
rewrite: ruleset  94 returns: acastro < @ midas . ctv . es . >
rewrite: ruleset  11 returns: acastro < @ midas . ctv . es . >
rewrite: ruleset   4   input: acastro < @ midas . ctv . es . >
rewrite: ruleset   4 returns: acastro @ midas . ctv . es
> [root@midas /root]#
</PRE>
Fin traza
<BR>

<HR>
<A HREF="slugfaq.html#toc3">Faq general de Slug Contenidos</A>
</BODY>
</HTML>
