<HTML><HEAD> 
<TITLE>faq-tcp</TITLE>
</HEAD>
<BODY BGCOLOR="#ffffff">
<CENTER><H1><U>FAQ-TCP</U></H1></CENTER>

<P>

<U><EM>INTRODUCCIÓN:</EM></U>

<P>

El protocolo TCP/IP es uno de los protocolos mas ampliamente usados en todo
el mundo. Ello es debido a que es el protocolo usado por Internet (la red de
redes) y por que su uso esta muy extendido en UNIX.<BR>
Este documento pretende aclarar los conceptos b&aacute;sicos relativos a TCP/IP,
con el fin de poder adentrase en el fascinante mundo de las comunicaciones.

<P>

<U><EM>RECONOCIMIENTOS</EM> </U>

<P>

La informaci&oacute;n ha sido obtenida de diversos libros que se mencionan al final
como bibliograf&iacute;a, pero sobre todo de una extensa comunicaci&oacute;n por correo 
electr&oacute;nico de mi amigo Luis Colorado en respuesta a mis numerosas dudas. <BR>
El lector sagaz deduzca por si mismo quien me anim&oacute;, ( o sea comprometi&oacute; )
a escribir este documento. :-)
Una vez m&aacute;s gracias Luis.

<P>

<EM><STRONG>Autores:</STRONG></EM> <BR>
<I>Luis Colorado Urcola  "luis@slug.ctv.es" <BR>
Antonio Castro Snurmacher "acastro@ctv.es" </I><BR>
<P>
<HR>
<H4>INDICE DE TEMAS TRATADOS EN ESTILO DE FAQ</H4>

 
<UL>

<LI><A HREF="#historia"> Un poco de historia. </A> </LI>

<LI><A HREF="#modelo-osi"> Modelo OSI. </A> </LI>

<LI><A HREF="#dir-ip"> Direcciones tcp/ip. </A></LI>

<LI><A HREF="#clases-red"> Clases de redes. </A></LI>

<LI><A HREF="#ejemplo"> Ejemplo de red. </A></LI>

<LI><A HREF="#mascara-red"> Mascara de red. </A></LI>

<LI><A HREF="#subnet"> Subnetear una red. </A></LI>

<LI><A HREF="#tabla-ruta"> Tablas de rutas. </A></LI>

<LI><A HREF="#backbon"> Backbon. </A></LI>

<LI><A HREF="#conf"> Configuracion de un nodo. </A></LI>


</UL>


<HR>

<BR>
<EM>Q:</EM> <BR>
Cual fue el origen del protocolo TCP/IP ?

<P>

<EM>A:</EM><BR> <A NAME="historia"></A>
Hagamos un poco de *<STRONG>historia</STRONG>*.
A mediados de los 70, el departamento de Defensa de los Estados Unidos se vio 
obligado a dar soluci&oacute;n a los problemas de comunicaci&oacute;n electr&oacute;nica interna
que usaban sistemas inform&aacute;ticos variados. Por ello se encargo al ARPA 
(Avanced Research Projects Agency) que desarrollara, junto con las principales
universidades y fabricantes de equipos inform&aacute;ticos, un protocolo estandar de 
comunicaciones. Todo ello dio lugar a dos redes. Una de uso exclusivamente 
militar MILNET y otra con fines experimentales de investigaci&oacute;n ARPANET. 
Todo ello constituy&oacute; el origen del actual Internet y del protocolo TCP/IP.

<P>

<EM>Q:</EM><BR> <A NAME="modelo-osi"></A>
Tiene algo que ver TCP/IP con el modelo OSI de 7 niveles ?

<P>

<EM>A:</EM><BR>
La estandarizaci&oacute;n de las comunicaciones tambien se ha desarrollado con
un modelo alternativo llamado modelo OSI en el que se describen perfectamente
siete distintos niveles. El modelo TCP/IP realmente no describe una estructura
tan precisa de niveles aunque se pueden asimilar y comparar ambos modelos de 
la forma siguiente.

<P>

<IMG SRC="mod-osi.gif" WIDTH="500" HEIGHT="300">

<P>

Observese que el nivel TCP-UDP no tiene una correspondencia perfecta con el 
modelo OSI. Los protocolos TCP est&aacute;n orientados a conexi&oacute;n con lo que, si se
podr&iacute;a hablar de sesi&oacute;n asimilandose al nivel 4 y 5 OSI pero UDP no esta
orientado a conexi&oacute;n y por ello no se puede hablar propiamente de sesi&oacute;n.
UDP utiliza datagramas. Es decir que en lugar de abrir una conexi&oacute;n con el
destino para establecer un dialogo, envia a la red fragmentos de informaci&oacute;n.
FTP, y TELNET son servicios muy populares y son un buen ejemplo de
protocolos orientados a conexi&oacute;n. NFS es un servicio que permite montar un
sistema de ficheros remoto de forma que podamos acceder a dicho sistema de 
ficheros sin apenas percibir que est&aacute; en una m&aacute;quina remota. Este &uacute;ltimo es
un cl&aacute;sico ejemplo de servicio orientado a datagramas. <BR>
En el nivel 3 junto al protocolo IP existen tambien los protocolos siguientes:
ICMP (Internet Control Message Protocol)
ARP  (Address Resolution Protocol)
RARP (Reverse Address Resolution Protocol)
Por parte del govierno de los Estados Unidos se procura la convergencia de
los protocolos OSI e Internet GOSIP (Protocolo Gubernamental OSI), pero habr&aacute;
que esperar para que sea una realidad.

<P>

<EM>Q:</EM><BR> <A NAME="dir-ip"></A>
Las direcciones IP vienen como cuatro numeritos separados por un punto.
Que significa esto ?

<P>

<EM>A:</EM><BR>
Las *<STRONG>direcciones tcpip</STRONG>* son cadenas de treinta y dos bits organizadas como 
una secuencia de cuatro bytes.  Todas las tramas IP llevan una direcci&oacute;n
de origen (donde se origino la trama) y una direcci&oacute;n destino (a donde va 
la misma).  Basicamente esto es todo lo que hay que saber cuando se 
conecta uno a la red y la direcci&oacute;n IP te la asigna un administrador de red.  
Estas direcciones tienen una representaci&oacute;n como cuatro numeros enteros 
separados por puntos y en notacion decimal, en la jerga habitual de internet.
Las direcciones representan el interface de conexi&oacute;n de un host con la red.
Asi, un host que esta conectado a varias redes como regla general, no tendr&aacute;
una &uacute;nica direcci&oacute;n de red, sino varias (normalmente una por cada red a la
que esta conectado).<BR>
Pero internamente, Esto no es del todo cierto.  Las direcciones IP se
dividen en dos partes (cada una con un cierto numero de bits) cuyo 
significado tiene que ver con el sistema de enrutado de tramas.  La primera 
parte (cuya longitud no es fija y depende de una serie de factores) representa 
la red, y debe ser igual para todos los hosts que esten conectados a una misma 
red f&iacute;sica.  La segunda parte representa el host, y debe ser diferente para 
todos los hosts que estan conectados a la misma red f&iacute;sica.

<P>

<EM>Q:</EM><BR>
Como se hace llegar un mensaje a su destino ?

<P>

<EM>A:</EM><BR>
El mecanismo de decisi&oacute;n de IP que hace que todas las tramas lleguen a su
destino es el siguiente:  Cuando la direcci&oacute;n origen y la direcci&oacute;n destino
estan ambas en la misma red (esto se sabe por que su *<STRONG>direccion de red</STRONG>* es
igual en ambas, la direccion de red sera la consecuencia de sustituir por
ceros toda la parte de host en la direccion considerada) IP supone que existe
un mecanismo de nivel inferior (en este caso Ethernet, Token Ring, etc.) que
sabe como hacer llegar la trama hasta el host destino.  Cuando la direcci&oacute;n
de red origen y la de destino no coinciden, entonces hay que enrutar.<BR>
Para enrutar, se dispone de una tabla que contiene entradas para cada una
de las redes a las que se quieren hacer llegar tramas, que no sean locales a
este host (un host, en general, esta conectado a varias redes, de las que hace
de gateway (pasarela), si la direcci&oacute;n destino de la trama tiene una direcci&oacute;n de red que
coincide con alguna de las direcciones de red propias---<U>las que resultan de
sustituir por ceros la parte de host en cada uno de los interfaces</U>---, entonces
no hace falta enrutar).  Esta tabla tiene mas o menos entradas en funci&oacute;n de
la complejidad de una internet (o red de redes) y la direcci&oacute;n del siguiente
host en el camino hasta la red de destino.<BR>
Por otro lado, la parte que corresponde a red y la parte que corresponde al
host, se realiza usando este esquema (salvo para el subnetting, que a#ade
algo de complejidad).

<P> <A NAME="clases-red"></A>

Existen 5 tipos de direcciones IP.  A cada tipo se le asigna una letra, asi,
existen direcciones de clases A, B, C, D, E.  Las direcciones pertenecen a
estas clases en funci&oacute;n de los cuatro bits mas significativos del primer byte.

<P>

<P>
<TABLE BORDER="4" CELLPADDING="2">
<TR> <TD>Clase A</TD>  <TD>0nnnnnnn</TD>  <TD>hhhhhhhh</TD>  <TD>hhhhhhhh</TD>  <TD>hhhhhhhh</TD>  </TR>
<TR> <TD>Clase B</TD>  <TD>10nnnnnn</TD>  <TD>nnnnnnnn</TD>  <TD>hhhhhhhh</TD>  <TD>hhhhhhhh</TD>  </TR>
<TR> <TD>Clase C</TD>  <TD>110nnnnn</TD>  <TD>nnnnnnnn</TD>  <TD>nnnnnnnn</TD>  <TD>hhhhhhhh</TD>  </TR>
<TR> <TD>Clase D</TD>  <TD>1110xxxx</TD>  <TD>xxxxxxxx</TD>  <TD>xxxxxxxx</TD>  <TD>xxxxxxxx</TD>  </TR>
<TR> <TD>Clase E</TD>  <TD>1111xxxx</TD>  <TD>xxxxxxxx</TD>  <TD>xxxxxxxx</TD>  <TD>xxxxxxxx</TD>  </TR>
</TABLE>
<P>

<STRONG><EM>Nota:</EM></STRONG> <STRONG>n</STRONG> representa la parte de red de la direcci&oacute;n y <STRONG>h</STRONG> la parte de host. 
<STRONG>x</STRONG> tiene otro tratamiento. 

<P>

 Las clases D y E no entran en la discusi&oacute;n del sistema de enrutado IP y 
no vienen al caso en esta discusion (las direcciones de clase D se usan 
en multicasting y las direcciones de clase E estan reservadas, por ello 
no deben usarse para configurar hosts en internet)
Asi, puesto en notaci&oacute;n punto, las redes de clase A son de la 1.0.0.0 a la
127.0.0.0, las redes de clase B son de la 128.0.0.0 a la 191.255.0.0 y las
redes de clase C son de la 192.0.0.0 a la 223.255.255.0 (Como se puede ver
hay muy pocas redes de clase A, que permiten tener muchos hosts---<U>InfoV&iacute;a;
Muchas redes de clase C para poquitos hosts</U>---Los centros proveedores de
Internet; y un rango intermedio para redes que tengan ambos requisitos).
Por otro lado, las redes de clase A tienen el primer byte como parte de
red y los tres restantes como parte de host, las redes de clase B tienen
los dos primeros bytes como parte de red y los dos ultimos como parte de
host y las redes de clase C tienen como parte de red los tres primeros bytes
y como parte de host el &uacute;ltimo.

<P>

<EM>Q:</EM><BR> <A NAME="ejemplo"></A>
Como construiriamos por ejemplo tres redes pequeñas interconectadas entre si ? <BR>
Que direcciones podriamos usar ?<BR>
<P>
<EM>A:</EM><BR>
Usaremos un ejemplo sencillo para explicar esto.<BR>
Existen una serie de direcciones especialmente reservadas para usos privados.<BR>
Es decir no se usaran en una red publica de internet.<BR>
Para la clase A  10.0.0.0 <BR>
Para la clase B  172.16.0.0  --> 172.31.0.0<BR>
Para la clase C  192.168.0.0 --> 192.168.255.0<BR>
Para nuestro ejemplo usaremos tres redes de clase B de tipo 172.22.n.n<BR>
En todas las redes (incluidas las que tienen subnetting) existen dos
direcciones de host que estan reservadas.  La primera es la que tiene todos
los bits correspondientes a la parte de host a cero.  Esta direcci&oacute;n se
utiliza para representar a la propia red y por tanto no se debe asignar a
ningun host.  La otra es la que tiene todos los bits puestos a uno, y
representa a todos los hosts que estan conectados a una misma red.  En  redes
donde se permite el broadcast (donde un host puede hacer que todos reciban
el mensaje que ha enviado) esta direcci&oacute;n se utiliza para este fin.  Estas
direcciones se llaman direcciones de red y de broadcast resp.  Tambi&eacute;n est&aacute;
reservada la direcci&oacute;n IP que tiene todos los bits a cero en la parte de
red para indicar *<STRONG>esta red</STRONG>*, aunque esta solo est&aacute; permitido usarla cuando
aun no conocemos nuestra direcci&oacute;n IP completamente (por ejemplo cuando hay
que adquirirla por la propia red, en el arranque, al configurar, etc.)


<P>
<IMG SRC="ejemplo.gif" WIDTH="500" HEIGHT="350">
<P>
<TABLE BORDER="5" CELLPADDING=2">
<TR><TD></TD> <TD>          A    </TD><TD>            B   </TD><TD>              C    </TD><TD>         D</TD></TR>
<TR><TD>IP.ADR  </TD><TD>  172.22.22.21   </TD><TD>  172.22.22.22  </TD><TD>    172.22.23.21   </TD><TD>   172.22.23.22</TD></TR>
<TR><TD>N.MASK  </TD><TD>  255.255.255.0  </TD><TD>  255.255.255.0   </TD><TD>  255.255.255.0   </TD><TD>  255.255.255.0</TD></TR>
<TR><TD>BROADK  </TD><TD>  0.0.0.255   </TD><TD>     0.0.0.255    </TD><TD>     0.0.0.255   </TD><TD>      0.0.0.255</TD></TR>
<TR><TD>NETWRK  </TD><TD>  172.22.22.0   </TD><TD>   172.22.22.0   </TD><TD>    172.22.23.0   </TD><TD>    172.22.23.0</TD></TR>
</TABLE>
<P>

Seg&uacute;n lo que hemos explicado, la red 172.22.0.0 es una red clase B y por
tanto su m&aacute;scara por defecto es la 255.255.0.0  en el ejemplo est&aacute; subneteada 
con m&aacute;scara 255.255.255.0.

<P>
* Hay tres redes:<BR>
	La 172.22.22.0/255.255.255.0 <BR>
	La 172.22.23.0/255.255.255.0 <BR>
	La 172.22.21.0/255.255.255.0<BR>
	(Ponemos la mascara ya que no es la mascara por defecto).

<P>
* Hay dos gateways, con dos direcciones cada uno:
<P>
<TABLE BORDER="5" CELLPADDING=2">
<TR> <TD></TD>    </TD><TD>           GW1  </TD><TD>                           GW2</TD></TR>
<TR>  <TD>IP.Addr    </TD><TD>   172.22.22.2/172.22.21.2  </TD><TD>       172.22.23.1/172.22.21.1</TD></TR>
<TR>  <TD>N.Mask     </TD><TD>   255.255.255.0(ambas)      </TD><TD>      255.255.255.0(ambas)</TD></TR>
<TR>  <TD>Broadc     </TD><TD>   172.22.22.255/172.22.21.255  </TD><TD>   172.22.23.255/172.22.21.255</TD></TR>
<TR>  <TD>NetAddr    </TD><TD>   172.22.22.0/172.22.21.0     </TD><TD>    172.22.23.0/172.22.21.0</TD></TR>

</TABLE>
<P>
  y para los hosts.
<P>

<TABLE BORDER="5" CELLPADDING=2">
<TR><TD></TD><TD> A    </TD> <TD>           B     </TD> <TD>           C   </TD> <TD>             D</TD></TR>
<TR><TD> IP.ADR</TD> <TD>   172.22.22.21  </TD><TD>   172.22.22.22  </TD><TD>    172.22.23.21   </TD><TD>   172.22.23.22</TD></TR>
<TR><TD> N.MASK</TD> <TD>   255.255.255.0 </TD><TD>   255.255.255.0 </TD><TD>    255.255.255.0  </TD><TD>   255.255.255.0</TD></TR>
<TR><TD> BROADK</TD> <TD>   172.22.22.255 </TD><TD>   172.22.22.255 </TD><TD>    172.22.23.255  </TD><TD>   172.22.23.255</TD></TR>
<TR><TD> NETWRK</TD> <TD>   172.22.22.0   </TD><TD>   172.22.22.0   </TD><TD>    172.22.23.0     </TD><TD>  172.22.23.0</TD></TR>
</TABLE>


<P>



<EM>Q:</EM><BR> <A NAME="mascara-red"></A>
Que es una m&aacute;scara, y como funciona ?

<P>

<EM>A:</EM><BR>
La red del ejemplo est&aacute; formada por tres subredes de la red de
clase B 172.22.0.0 con m&aacute;scaras 255.255.255.0 (o sea, consideradas como
o si  la red 172.22.0.0 se hubiera subneteado)<BR>
La *<STRONG>m&aacute;scara de red</STRONG>* no es m&aacute;s que una direcci&oacute;n IP donde se ha sustituido todos
los bits de la parte de red de la direcci&oacute;n por unos y los bits correspondientes 
a la parte de host por ceros.  As&iacute;, la m&aacute;scara de red de una red
de clase A ser&aacute; 255.0.0.0, la de una red de clase B ser&aacute; 255.255.0.0 
y la de una clase C ser&aacute; 255.255.255.0.<BR>
Por que se usa entonces la m&aacute;scara de red si est&aacute; implicita en el tipo de
direccion?<BR> 
Se ha comprobado que a veces el sistema de clases no es apropiado.  A un
proveedor le dan una clase C completa pero el quiere dividirla en cuatro
redes diferentes (y no va a usar cuatro clases C para esto---1000 direcciones
IP, se malgastar&iacute;an muchas).  Pues bien, dentro de una misma red, se puede
extender el mecanismo de routing, considerando que la parte de host son los
bits cero y la parte de red son los bits uno de la m&aacute;scara y asociando a cada
direcci&oacute;n IP una m&aacute;scara en el momento de configurarla (por supuesto, los
valores por defecto ser&aacute;n los de la clase de la red, aunque se podr&aacute;n añadir,
y solamente añadir, bits uno a la m&aacute;scara, con el fin de *<STRONG>subnetearla</STRONG>*)
En el caso del ejemplo de este parrafo, el proveedor podr&iacute;a extender la
mascara de subred dos bits m&aacute;s all&aacute; de la frontera impuesta por el tipo de
la direcci&oacute;n adquirida y considerar que tiene cuatro redes (en este caso
la parte de red ser&iacute;an los primeros tres bytes y dos bits del cuarto y la
parte del host los restantes)

<P>

<EM>Q:</EM><BR> <A NAME="tabla-ruta"></A>
Por ejemplo partiendo de la red 21.0 para ir a la 23.0 habria que usar el GW1,
y para ir de la 23.0 a la 22.0 habria que usar GW1 y GW2.<BR>
Como se indica la ruta a tomar para cada destino ?

<P>

<EM>A:</EM><BR> 
Para ello se usan las *<STRONG>tablas de rutas</STRONG>*.
Para construir las tablas de rutas, formaremos para cada m&aacute;quina, una tabla
con la forma de dirigir las tramas hacia las redes que no vemos directamente,
con la ventaja adicional de que como la direcci&oacute;n 0.0.0.0 representa obviamente
la red local, podemos usar esta direcci&oacute;n especial para indicar la ruta por
defecto (es decir, la direcci&oacute;n local a la que enviar las tramas que no tienen
ruta y que necesariamente hay que enrutar).  As&iacute;, las tablas de rutas quedar&iacute;an:

<P>
Host A: 0.0.0.0(default) ---> 172.22.22.2<BR>

Host B: 0.0.0.0(default) ---> 172.22.22.2<BR>

Host C: 0.0.0.0(default) ---> 172.22.23.1<BR>

Host D: 0.0.0.0(default) ---> 172.22.23.1<BR>

GW1: 172.22.22.0 ---> 172.22.21.2<BR>

GW2: 172.22.23.0 ---> 172.22.21.1<BR><BR>
<P>

Si nos fijamos, podemos ver que la *<STRONG>ruta por defecto</STRONG>* es el gateway por 
defecto que aparece en la configuraci&oacute;n de muchas m&aacute;quinas Linux, pero para 
los gateways no aparece ningun gateway por defecto. Esto es una caracter&iacute;stica
de las redes que tienen backbones.

<P>

<EM>Q:</EM><BR> <A NAME="backbon"></A>
Que es un backbon?

<P>

<EM>A:</EM><BR>
Literalmente, backbone significa columna vertebral. <BR>
Las tramas se canalizan hacia el backbone, pero este, al final debe decidir a 
donde van a parar las tramas.  Como conclusi&oacute;n de esta &uacute;ltima frase se 
desprende que en todo backbone (red de nivel jer&aacute;rquico superior donde no hay 
ninguna red mas importante---p.ej. el backbone de Internet, o la red principal
de una empresa que no tiene conexiones con el exterior) los gateways que forman
el backbone deben tener rutas a todas las redes y no aparecer una ruta por 
defecto en sus tablas de rutas, mientras que para el resto de las redes, la 
ruta por defecto (y para los hosts) sera siempre la que lleve hacia el backbon.

<P>

<EM>Q:</EM><BR> <A NAME="conf"></A>
Como se configura un puesto?

<P>

<EM>A:</EM><BR>
Una vez comprendidos los conceptos pasemos a calcular las direcciones.
Con la direcci&oacute;n IP y la m&aacute;scara de red se pueden obtener las demas.
Tomando como ejemplo el nodo A observamos que se cumplen las siguientes
relaciones:
    

<P>
<IMG SRC="conf.gif" WIDTH="500" HEIGHT="150">
<P>

<EM>Q:</EM><BR><A NAME="subnet"></A>
Que criterios se usan para dividir una gran red en redes mas pequeñas con
el mecanismo de subnetting.

<P>

<EM>A:</EM><BR>
Subnetear una red no sirve unicamente a criterios topol&oacute;gicos. Puede servir
para facilitar la administraci&oacute;n delegando a cada administrador la gesti&oacute;n de
direcciones de una subred. Puede facilitar la adaptaci&oacute;n de la red a la
estructura de una organizaci&oacute;n. Tambi&eacute;n puede aislar redes con tr&aacute;fico 
interno abundante y facilitar el diagn&oacute;stico de problemas en la red.

<P>

<EM>Q:</EM><BR>
Se podr&iacute;an juntar dos redes f&iacute;sicas en una sola sin m&aacute;s ?

<P>

<EM>A:</EM><BR>
Consideremos que pasar&iacute;a en el ejemplo anterior al unir fisicamente las redes 
22.0 con la 23.0. En este caso construiriamos una internet.
(todos los hosts tendr&iacute;an que tener la misma direcci&oacute;n de red) formada por dos
redes que se unen en dos puntos. Si unieramos y ya esta (sin cambiar nada en
las configuraciones) el sistema funcionar&aacute;, pero con la salvedad de que los
hosts que est&aacute;n en redes diferentes no se podr&aacute;n enviar tramas directamente
(sin un gateway)

<P>

Tengamos en cuenta que una red ethernet es un bus y por tanto en un instante de
tiempo dado, solo lo usan dos/varios contendientes (el que habla y el/los que
escucha/n).  Si usamos una red tipo bus para implementar dos redes disjuntas,
nos estamos cargando el ancho de banda de dos redes (hasta 10Mbps + 10Mbps) para
dejarlo todo en una red (hasta 10Mbps, max)

<P>

<EM>Q:</EM><BR>
Que otros dispositivos se utilizan para unir redes ?

<P>

<EM>A:</EM><BR>
Los t&eacute;rminos Pasarelas (Gateways), Routers (Routers) y Puentes (Bridges) se
refieren a una serie de dispositivos para interconectar redes. Muchas veces
estos dispositivos son un PC con un par de tarjetas de comunicaciones para
conectarse simultaneamente a dos redes funcionando con un software apropiado. 
Un puente conecta dos redes parecidas (por ejemplo pueden ser distintas en su 
velocidad) sin cambiar la estructura de los mensajes que circulan por ellas. 
Un Router conecta dos redes que son iguales (o parecidas). No hay traducci&oacute;n 
de un protocolo a otro pero si traducci&oacute;n de direcciones. 
Una pasarela puede conectar redes distintas (por ejemplo una ethernet y una 
token ring) realiza la conversi&oacute;n de protocolos y la traducci&oacute;n de direcciones.
Si recordamos los modelos OSI y TCP/IP explicados anteriormente vemos que en
los distintos dispositivos actuar&iacute;an a distinto nivel del modelo de comunicaciones.

<P>
<IMG SRC="osi-tcp.gif" WIDTH="500" HEIGHT="250">
<P>

<EM>Q:</EM><BR>
Puesto que un router incluye la funci&oacute;n de puente, y la pasarela engloba las 
funciones de router y de puente.
Porque entonces no se usa siempre una pasarela (gateway)? 

<P>

<EM>A:</EM><BR>
Cuando todos los nodos de una red deben alcanzar todos los nodos de otra red,
se provoca una sobre carga de la red debido a los protocolos de rutado. En este
caso y cuando ambas redes utilizen el mismo protocolo de red, la mejor 
solucion es un puente.<BR>
Existe otro tipo de dispositivo que sirve para conectar dos redes y que se
llama Firewall. Se trata de un dispositivo l&oacute;gico que sirve para conectar
de forma segura la parte privada de una red con la parte p&uacute;blica. Estos 
dispositivos pueden establecer una pol&iacute;tica de restricciones a la informaci&oacute;n
que circula por ellos. 

<P>

<EM>Q:</EM><BR>
Para determinar una ruta como la mas idonea, que criterio se sigue ?

<P>

<EM>A:</EM><BR>
El protocolo de informaci&oacute;n de rutado (RIP) es un protocolo que esta basado 
unicamente en el coste.<BR>
A cada ruta se le asocia un coste en funci&oacute;n del rendimiento de la red, tipo de
la linea, etc. Esto permite determinar de entre varias rutas posibles cual es la
de menor coste. <BR>
Cada ruter de una red env&iacute;a y recibe informaci&oacute;n de rutado que permite
actualizar las tablas de rutado cada 30 segundos. Cuando el coste de una ruta
supera el valor 16 el sistema se considera fuera de alcance. La caida de un
nodo de la red suele provocar la perdida de algunos mensajes hasta que las 
tablas de rutado de todos los ruters se reajustan.

<P>
<HR>


<U><EM>BILIOGRAFIA:</EM></U>

<P>
<I>
"UNIX Wetwork Programming" by W. Richard Stevens, Ed Prentice Hall.<BR>
"TCP/IP Network Administration" by Carig Hunt, Ed. O'Reilly & Associates, Inc.<BR>
"LINUX Network Administrators's Guide" by Olaf Kirch Ed. O'Reilly & Assoc. Inc.<BR>
"Utilizando Linux", by Tacket & Gunter", Ed. Prentice Hall.<BR>
</I>
