<HTML><HEAD>
<TITLE>FAQ DISTRIBUCIONES DE LINUX</TITLE>
</HEAD><BODY><H2>versi&oacute;n: 23-Octubre-1.996
</H2><P>
<H3>INTRODUCCI&Oacute;N
</H3><P>
Esta faq trata sobre sobre las distribuciones de Linux, (es la primera faq
que se 
realiza para Slug). Esta Faq tiene su origen en las preguntas y contestaciones



realizadas en la <A HREF="http://calvo.teleco.ulpgc.es/~/kuko/l-linux">lista



l-linux</A>..
Me ha sido imposible no a&ntilde;adir algo de informaci&oacute;n de mi cosecha,






pero en candidad &iacute;nfima y totalmente objetiva y contrastable. Son
muchos
los 
que han participado en esta lista y c&oacute;mo no ser&iacute;a justo olvidar
a nadie se remite a la fuente original de esta Faq,.Esta Faq parti&oacute;
de la
consulta realizada por Manuel Trujillo el 11-Agosto con Subject 
"Slackware vs. RedHat". Esto, provoc&oacute; una lluvia de comentarios que



duraron

algunos d&iacute;as y que hemos enlazado con algunos que se han producido
con

posterioridad. 
Dichos mensajes se pueden consultar en:






  
<A HREF="http://calvo.teleco.ulpgc.es/~/kuko/l-linux">lista l-linux</A>..

Dado que el autor de este arreglo o recopilaci&oacute;n no es ninguna autoridad




en
el tema, y que los participantes en la lista no han mostrado un acuerdo



un&aacute;nime



en algunas cuestiones, ser&iacute;a sorpredente que no existan errores o
malos



entendidos. Esto pretende ser una visi&oacute;n, lo m&aacute;s objetiva posible,



de los debates



producidos en torno a las distribuciones de Linux. 

Para cualquier informaci&oacute;n complementaria, o correcci&oacute;n podeis



dirigiros
a:
Antonio Castro Snurmacher (acastro@ctv.es)

<FONT SIZE=+1><B>






<A HREF=mail.htm><FONT SIZE=+1>email</FONT></A><FONT SIZE=+1>








</FONT><IMG ALIGN=Right SRC="buzon.gif" ALT="Mi buzon"><U><FONT SIZE=+1>-</FONT></U>&nbsp;









&nbsp; &nbsp; &nbsp; 
</B></FONT>
<P>
<P><HR>Q: &#191;Qu&eacute; distribuci&oacute;n de Linux podr&iacute;a calificarse


de mas
puro
Linux?


<P>A:
&nbsp;Aunque es muy frecuente usar el termino de S.O Linux, o Distribuci&oacute;n



de Linux lo cierto es que resulta una simplificaci&oacute;n que puede inducir
a errores. Lo que habitualmente se
llama "Linux" es todo un conglomerado de software de diversas
procedencias. Solamente el kernel es verdaderamente "Linux". Para ser







verdaderamente justo, habr&iacute;a que llamar al sistema operativo 
"sistema GNU con kernel Linux".
&nbsp;Slackware es la heredera de la distribuci&oacute;n SLS, una de las
primeras 
que hubo, cuando Linux era "solo para hackers". 
Pero el concepto de "puro Linux" no es f&aacute;cil de defender c&oacute;mo
algo

valorable en una distribuci&oacute;n. 
<P>
<P><HR>Q:
&#191;Qu&eacute; importancia tiene y en que consiste el Formato binario de
una


distribuci&oacute;n?

<P>A:&nbsp;En la actualidad la comunidad Linux esta abandonando el formato "a.out"






para incorporar el nuevo formato ELF que ofrece varias ventajas sobre el






anterior. Son ventajas fundamentalmente para los desarrolladores de Software.
Por ejemplo los iconos no fueron considerados cuando se dise&ntilde;o el
formato ELF pero este formato es f&aacute;cilmente ampliable. Este nuevo
formato
es el utilizado en Unix System V Release 4, lo cual no quiere decir que sean






compatibles.Una distribuci&oacute;n puede estar &iacute;ntegramente <U>*basada*</U> en
ELF
careciendo
de
binarios "a.out" Sin embargo hay distribuciones totamente realizada sen formato &nbsp;"a.out"
que icluyen librer&iacute;as ELF y se dice que tienen <U>*soporte*</U> para
ELF.
&nbsp;Existe una clara tendencia en las distribuciones hacia el formato ELF.
<P>

<HR>
<P>Q:
&#191;Qu&eacute; distribuci&oacute;n de Linux es la mejor?


<P>A:
No se puede recomendar una sola distribuci&oacute;n de Linux c&oacute;mo
la mejor,

porque


distintos usuarios tienen distintas necesidades. En realidad Linux es una




porci&oacute;n peque&ntilde;a del sistema operativo llamado nucleo (kernel).
Esta


porci&oacute;n es la responsable de controlar directamente el hardware del



sistema.


(memoria, cpu, y dispositivos de entrada salida,) El resto del sistema operativo






est&aacute; compuesto de programas de distintas procedencias. 
Hay muchas distribuciones de Linux. Unas son comerciales y otras son gratuitas.


<P>En las distribuciones comerciales es normal proporciornar un valor






a&ntilde;adido que es en realidad lo que se vende. Por ejemplo,







<A HREF="http://www.caldera.com">Caldera</A> &nbsp;incorpora su Caldera
Network Desktop, y <A HREF="http://www.wgs.com">WorkGroup Solutions</A>







&nbsp;utilizaba c&oacute;mo base de su distribuci&oacute;n la de Slackware
y en
la
actualidad


est&aacute; cambiando a la de Red Hat. El inter&eacute;s que tengamos por
un determinado

valor a&ntilde;adido es fundamental a la hora de elegir una distribuci&oacute;n.






La cuesti&oacute;n es si eso que a&ntilde;aden nos resulta necesario
en nuestro caso particular. Por ejemplo si necesitamos un Linux muy completo
y
que adem&aacute;s cumpla los estandares de Posix habr&aacute; que comprar



posiblemente


Linux-FT, que es

bastante caro.

El Linux Journal de Septiembre de 1.996 tiene
un art&iacute;culo sobre las distribuciones de Linux disponibles en el mercado.




Comparan unas 10 distribuciones y dan suficientes detalles para que el
personal se entere de c&oacute;mo va cada distribuci&oacute;n. En esta Faq
se comentaran




sobre todo las tres m&aacute;s conocidas (Slakware, RedHat, y Debian) y alguna




otra de pasada.

Slackware la mantiene una sola persona. Red-Hat lo mantiene una empresa 
(varias personas), y Debian un numeroso grupo de voluntarios. Por orden de






antig&uuml;edad (o veteran&iacute;a c&oacute;mo se quiera mirar) ser&iacute;a

Slackware,

RedHat, y Debian.
<P><EM>SLACKWARE
</EM>
<P>INTRODUCCION- A pesar de todas estas cr&iacute;ticas es la versi&oacute;n




m&aacute;s instalada
en 
Espa&ntilde;a, esta
distribuci&oacute;n ha sido muy copiada por algunas revistas, y distribuidores
de programas Shareware en CD-Roms. Por ello y por ser una de las
primeras viene su popularidad.
- Est&aacute; mantenida por una sola persona (Patrick Volkerding), apoyada

por una empresa (Lasermoon)
Slackware es la heredera de la distribuci&oacute;n SLS, una de las primeras



<P>PROS- Slackware es &nbsp;criticada por algunos usuarios que han tenido






ocasi&oacute;n de compararla con Redhat o Debian pero lo cierto es que






actualmente es la distribuci&oacute;n m&aacute;s utilizada en Espa&ntilde;a,
y tiene 
a&uacute;n sus defensores que principalmente ven en Slackware una 
oportunidad de cacharrear con Linux.
Estos encuentran interesante aprender a configurar cada d&iacute;a una
cosita m&aacute;s, (cosa muy necesaria en Slakware que no trae todo prefectamente






configurado).
Algunos defensores de Slakware hablan de cosas c&oacute;mo de la pureza de
Linux indicando con ello que quizas otras distribuciones tienen m&aacute;s
cosas que las que tradicionalmente tra&iacute;a el Linux. 
Para algunos en RedHat la instalaci&oacute;n va m&aacute;s all&aacute; de
lo necesario,


configurando
cosas con criterios algo subjetivos que pueden adaptarse o no a nuestras






necesidades, o a nuestros gustos. Por ejemplo pides que te
instale las X y de paso te instala un escritorio muy bonito que no es
lo que necesitas. O pides que te instale un servidor de news y te lo
monta todo c&oacute;mo le parece.  Y es que para algunos los adornos en un
S.O.




representan una amenaza (s&iacute;ndrome de Windows). Para otros en
cambio no. 

Adem&aacute;s existe mucha documentaci&oacute;n (libros, FAQ's y HOWTO's)
que hacen referencia a Slackware. Algunos son documentos que se han
ido modificando pero que empezaron cuando apenas existia gran cosa 
aparte de Slakware. En muchos ftp sites abundan los *.tgz de Slackware. Ojo
un paquete de Slackware tiene la extensi&oacute;n tgz pero un fichero con
la extesion tgz no es necesariamente un paquete de Slackware. En ambos casos
son ficheros creados con tar y comprimidos con gzip pero en Slackware



adem&aacute;s suele haber un directorio /install con una shell para completar
la instalaci&oacute;n.

En algunas distribuciones se incluyen Faqs y Howtos que parecen estar pensadas



para Slackware.
<P>CONTRAS- Esta distribuci&oacute;n no sigue la FSSTND, sino que instala
cada paquete 
donde su creador "piensa" que deben ir los ficheros.
Para algunos en este aspecto resulta bastante an&aacute;rquico, y existen
algunos errores de configuraci&oacute;n que comprometen la seguridad del
sistema, lo hacen poco recomendable en una m&aacute;quina conectada a la
red.

- Su men&uacute; de instalaci&oacute;n 'setup' es adecuado para realizar
una instalaci&oacute;n
completa de principio a fin , pero salirse del men&uacute; y volver a 
entrar puede significar empezar desde el principio. Por ejemplo los
datos para construir el 'fstab' son capturados en las etapas iniciales 
de la instalaci&oacute;n donde pregunta qu&eacute; dispositivos queremos
montar.
Estos datos no se guardan en 'fstab' hasta haber finalizado casi toda
la instalaci&oacute;n.
En otras distribuciones la detecci&oacute;n de hardware es m&aacute;s completa
y
la instalaci&oacute;n se simplifica. Esto se pone de manifiesto por ejemplo
en la


instalaci&oacute;n de las X-Windows. Ultimamente la gente se ha quejado que
la versi&oacute;n 3.0 no estaba del
todo fina. Esta distribuci&oacute;n y otras por ser
ELF y estar este formato en sus primeras andaduras, no ten&iacute;an la






estabilidad que se puede pedir para un uso profesional
- Actualizar una versi&oacute;n completa de Slackware se puede convertir
en una

pesadilla. Concretamente el cambio de versi&oacute;n de a.out a ELF ha supuesto



m&aacute;s de un quebradero de cabeza para muchos usuarios de Slakware.

- En el directorio slackware_source (en FTP, o
del CD-ROM) hay unos "scripts" llamados "SlackBuild", que crean los
paquetes .tgz de Slackware a partir del c&oacute;digo fuente original.
,
pero incluso el autor reconoce que para algunos
paquetes *no* hay SlackBuild, es decir, que estan hechos a mano. O sea:
Slackware puede ser tan GPL c&oacute;mo Red-Hat o Debian, pero no te puedes
hacer
"tu propio Slackware", c&oacute;mo no sea escribiendo los "SlackBuild"s que


faltan...  Uno de los atractivos del software libre es que puedes
analizarlo, estudiarlo, y aprender de &eacute;l, pero con Slackware, esto
no 
siempre es posible.

- 
<P><EM>REDHAT
</EM>
<P>INTRODUCCION- Es una versi&oacute;n comercial pero se puede obtener via
ftp,
y en algunos
CD's c&oacute;mo distribuci&oacute;n no oficial.
- Esta distribuci&oacute;n es bastante joven. Empezaron hace unos 2 a&ntilde;os
a
crear

distribuciones de Linux, en la actualidad es la base de Caldera,
Linux-FT y WGS, sigue al pie de la letra la FSSTND, c&oacute;mo tal puedes
coger una documentaci&oacute;n existente y saber d&oacute;nde reside cada
cosa
- RedHat tiene 3 versi&oacute;nes, 2.0, 2.1, 3.0.3, todas ellas en formato
ELF,
la 2.1 no ten&iacute;a una gran estabilidad (mismo problema que Slackware
3.0)
pero la 3.0.3 es una roca
- La 3.0.3 es la que se llama Picasso, 
y la 3.0.4 (que est&aacute; en beta) se llama Rembrant.


<P>PROS- Su formato de paquetes RPM se est&aacute; convirtiendo, poco a poco,
en
un
estandar dentro de Linux
- Es la &uacute;nica que presenta un interfaz gr&aacute;fico de



configuraci&oacute;n
del
sistema
- Est&aacute; conceptuada y mantenida por una empresa RedHat, tienen un ftp
site de donde se puede sacar parches o actualizaciones.
- Tienen un WEB  (www.redhat.com) donde tienes el &uacute;ltimo chisme sobre
las distribuciones o actualizaciones
- En muchas instalaciones profesionales usan RedHat. 
- Es de pago (49.95$), pero tiene c&oacute;mo a&ntilde;adido, runtime de
Motif y Metro-X server)
.RedHat le lleva alguna ventaja respecto a Debian en el tiempo que 
lleva disponible. Eso significa por ejemplo, que ya tienen distribuci&oacute;n






para Sparc, Alpha, etc. (Las de Debian van mas lentas, pero llegar&aacute;n).
- Tanto  Debian c&oacute;mo RedHat ofrecen las mismas ventajas de

instalaci&oacute;n,

de hecho, Debian ha seguido algunas de las ideas de RedHat. 

Adem&aacute;s de la disposici&oacute;n de listas de usuarios donde pod&eacute;is



resolver todos los problemas que tengais. Ademas el servidor web de redhat
dipone de servicios increibles para el beneficio de tanto clientes 
c&oacute;mo de cualquier otro usuario de RedHat y Linux en general. Debian
no dispone de estos servicios a&uacute;n. 

RedHat cuenta con mayor cantidad de software y upgrades 
disponibles que Debian, en el momento presente. Aquellos que esten en duda
echad un vistazo a





<A HREF="ftp://ftp.redhat.com/pub/redhat/contrib">ftp://ftp.redhat.com/pub/redhat/contrib</A>.





Debian carece
de estas librer&iacute;as de paquetes (en el momento presente). RedHat son
muy

eficientes publicando listas de erratas en cada una de las distribuciones

y de paquetes para arraglar los errores. Si echais un vistazo a las 
erratas de Picasso (RedHat 3.0.3), ver&eacute;is que el n&uacute;mero es
muy


peque&ntilde;o,

lo cual indica que son muy cuidadosos en su trabajo.

Antes RedHat ten&iacute;a un selecci&oacute;n de paquetes menos espec&iacute;fica




que la de slackware. Sin embargo esto no es as&iacute; en la versi&oacute;n



Rembrandt.



Existe una edici&oacute;n mensual llamada  MO'Linux, un CD con bastantes








actualizaciones, programas nuevos que van saliendo para Linux. 
Lleva un "apartado" dedicado exclusivamente a actualizaciones 
Red Hat, que unido a su programa bajo X de mantenimiento es una 
gran ventaja.


<P>CONTRAS Los paquetes rpm se est&aacute;n convirtiendo en
un standard de facto y existen muchas m&aacute;s cosas en rpm que en deb



(paquetes de Debian). Sin embargo tiene el inconveniente de no tener una



herramienta de alto nivel para configurar el sistema (c&oacute;mo el dselect
de Debian).


<P><EM>CALDERA

</EM>
<P>Es comercial y est&aacute; basada en RedHat incorporando algunos paquetes






propietarios de Caldera y de otras empresas (Caldera desktop, 
nwclient, netscape, XBasic, ...etc) Caldera ha adquirido los derechos de






Lasermoon, la autora de Linux-FT
 y hacia finales de 1.996 va a sacar una nueva distribuci&oacute;n Caldera
Open
Linux
que tambi&eacute;n va a ser POSIX.1 compatible y puede que tambi&eacute;n


POSIX.2.



Tambien ha adquirido los derechos de DR-DOS y tiene intenci&oacute;n de publicar




los
fuentes y hacerlos de dominio publico. Al parecer, sus relaciones con Microsoft



no son precisamente id&iacute;licas.


<P>PROS- El hecho de que empresas c&oacute;mo Software AG hayan elegido Calera

para




introducir su base de datos ADABAS en el mundo Linux dice mucho a favor de






Caldera.

<P>CONTRAS -Su entorno gr&aacute;fico no gusta a todo el mundo (Es lo que





coment&aacute;bamos
c&oacute;mo
s&iacute;ndrome de Windows).
<P><EM>LINUX-FT
</EM>
<P>Lo distribuye ABC Analog pero suprecio es realmente
 alto, unas 20.000 ptas.  Parece muy completa (aunque no la m&aacute;s




actualizada) y es la primera que es compatible POSIX.1, tambi&eacute;n viene
en
6 CDs.
(Al parecer es muy facil de configurar y dispone de un programa, xadmin,
que 
te permite administrar y configurar el sistema desde X-windows facilmente.



<P><EM>DEBIAN
</EM>
<P>
INTRODUCCION Debian es una distribuci&oacute;n desarrollada por un equipo
de voluntarios de todo el mundo.Factor
muy a tener en
cuenta. Debian es un proyecto distinto del de
GNU. En el pasado parece ser que hubo apoyos de GNU a Debian y en la actualidad





son grupos que se llevan bien. Para m&aacute;s informacion a este respecto





consultar <A HREF="http://www.debian.org">http://www.debian.org </A>. 
Debian es muy din&aacute;mica. Debido a que es una distribuci&oacute;n creada
y mantenida
por voluntarios de todo el mundo, est&aacute; en continuo proceso de





actualizaci&oacute;n
y crecimiento. En ese sentido funciona de manera similar al propio kernel
de Linux. Existe una distribuci&oacute;n 'inestable' en la que se encuentran
los

paquetes 'recien salidos del horno' que contienen las ultim&iacute;simas





versi&oacute;nes
de los distintos programas, aunque tambi&eacute;n pueden contener algunos


errores,
y cada tres meses (esa es la intenci&oacute;n) se presenta una distribuci&oacute;n






'estable', que ha sido refinada de errores y probada durante varios meses.

<P>PROS Al igual que RedHat, Debian sigu&eacute;n el FSSTND, que es un documento



que 
describe la estructura de directorios para que sea f&aacute;cil encontrar

las cosas en cualquier sistema Linux based.

En Debian el programa de instalaci&oacute;n funciona en modo de texto, pero
no parece


justo verlo c&oacute;mo un inconveniente.
Mas bien puede verse c&oacute;mo una ventaja, pues asi no se obliga a usar
X si
no se quiere (siempre puedes usar un 
programa de terminal desde X pero no a la inversa).

Debian esta muy cuidada. Muchos detalles. Buen soporte, muy r&aacute;pidas







actualizaciones. El gestor de paquetes tiene una herramienta visual 
(dselect) que hace innecesario aprenderse las muchas opciones de 
dpkg* (los equivalentes a rpm de RedHat). Al principio pueden parecer



inc&oacute;modas pero pronto se acostumbra uno y ya resultan imprescindibles.

Un ejemplo de el dinamismo de Debian lo da el hecho de que Debian fue la
primera,
con diferencia, en incluir el kernel 2.0. 
Adem&aacute;s, este sistema de producci&oacute;n te garantiza que la cantidad
de




paquetes disponibles para Debian crece en progresi&oacute;n geom&eacute;trica,






porque
a m&aacute;s usuarios de Debian, m&aacute;s posibles colaboradores, ya que
crear
un
paquete Debian en la mayor parte de los casos consiste b&aacute;sicamente
en coger

el fichero tar en el que se encuentran las fuentes del programa y a&ntilde;adirle



un 
Makefile modificado, que te compile el binario y te cree otro fichero tipo

tar que contenga dicho binario junto con los ficheros de configuraci&oacute;n
o

de datos que necesite y varios script que lleven a cabo la instalaci&oacute;n
y

desinstalaci&oacute;n del programa, respetando la configuraci&oacute;n antigua
si existe.

El m&eacute;todo de instalaci&oacute;n a base de men&uacute;s en modo texto
(en color donde
est&eacute; disponible) te va guiando en todo el proceso de crear particiones,







formatearlas e intalar un sistema b&aacute;sico, contenido en solo 3 diskettes






(m&aacute;s el diskette de arranque y el ra&iacute;z de instalaci&oacute;n).
El



m&eacute;todo permite

detener la instalaci&oacute;n en cualquier paso y continuar luego desde






ah&iacute;.
Con el sistema b&aacute;sico ("bare bones" para los angl&oacute;filos) ya
puedes arrancar

tu m&aacute;quina Linux y a partir de ah&iacute;, instalar todas las aplicaciones






(paquetes)
que desees, desde CD-rom, NFS, FTP o desde cualquier medio que se pueda 
montar c&oacute;mo directorio, incluso (aunque no se lo aconsejo a nadie)
desde





diskettes. 
De este modo, el kernel de arranque no tiene porqu&eacute; contener
todos los drivers existentes, ya que los que necesita el usuario se
pueden indicar c&oacute;mo m&oacute;dulos en uno de los pasos de la primera
fase
del
proceso de instalaci&oacute;n, y ser&aacute;n cargados por el kernel instalado,




al iniciar

esta segunda fase.
Adem&aacute;s, la divisi&oacute;n en dos fases diferenciadas permite distinguir



entre 
los componentes imprescindibles del sistema y los no imprescindibles. 

La &uacute;ltima versi&oacute;n estable de Debian es la 1.1.5.
De momento no existe una distribuci&oacute;n 'oficial' aunque mirrors del




servidor principal de Debian, conteniendo la &uacute;ltima versi&oacute;n
(o casi)
se
incluyen en los CDs de Pacific HiTech  y
en los de Yggdrasil. Tambi&eacute;n puedes obtener la ultim&iacute;sima



versi&oacute;n


directamente de iConnect Corp. que mantienen el nodo master.debian.org
(mirar en el






<A HREF="http://www.i-connect.net/i-connect/services/cdrom.html">ttp://www.i-connect.net/i-connect/services/cdrom.h






tml
</A>. )
Para informaci&oacute;n m&aacute;s al d&iacute;a p&aacute;sate por:






<A 
HREF="http://www.debian.org/order.html">http://www.debian.org/order.html
</A> 
Respecto a una nueva versi&oacute;n, actualmente se est&aacute; trabajando
en la

versis&oacute;n
1.2 (nombre clave 'rex') y seg&uacute;n la pol&iacute;tica del proyecto Debian
se


intentar&aacute; fijar c&oacute;mo estable en Octubre. (La idea es sacar
una nueva



versi&oacute;n
cada tres meses, aunque los cambios de una versi&oacute;n a otra normalmente





seran

muy pocos). De momento la puedes encontrar c&oacute;mo versi&oacute;n 'inestable'


en 
cualquier mirror de Debian.


<P><HR>
<P>Q:
Por qu&eacute; se le da tanta importancia al tema de c&oacute;mo est&aacute;n

montados
los
paquetes en una distribuci&oacute;n?


<P>A:
Teniendo una distribuci&oacute;n no se ata uno a nada, ya que se puede
seguir utilizando cualquier paquete de otra distribuci&oacute;n.
Las distribuciones se distribuyen en sources y nadie te
impide compilarte tu las cosas. O cogerlas de otros mundos. La ventaja
est&aacute; en que si usas paquetes tienes pleno control de lo que hay instalado,




de c&oacute;mo actualizarlo, de c&oacute;mo desinstalarlo, de qu&eacute;
ficheros son
necesarios, de las dependencias con otros paquetes. La desinstalaci&oacute;n
de un paquete puede tener efectos colaterales en otros
si no se utiliza un buen gestor de actualizaciones c&oacute;mo el de RedHat
o
el de Debian. Con un buen gestor de actualizaciones es posible 
actualizar una versi&oacute;n de la
distribuci&oacute;n a otra superior de forma autom&aacute;tica o casi






autom&aacute;tica sin 
necesidad de
reinstalar todo el software. Mediante cierta utilidad se detectan en tu
sistema los paquetes que han quedado obsoletos y los reemplaza por las
nuevas versi&oacute;nes, de esta manera tus ficheros de configuraci&oacute;n

siguen




intactos sin necesidad de hacer backups en los que luego te das cuenta que
te has olvidado de hacer una copia de aquel fichero de configuraci&oacute;n
de
las impresoras que tanto te cost&oacute; adaptar.

Aunque solo sea por eso, es ya una maravilla tener esa
alternativa.


<P><HR>
<P>Q: 
Qu&eacute; formatos tienen los paquetes de instalacion de Linux?
Se pueden intercambiar paquetes entre distribuciones distintas?


<P>A:
Los programas dise&ntilde;ados para Slackware pueden ser portados sin nig&uacute;n






problema a otras distribuciones c&oacute;mo RedHat (en vez de usar rpm, se
hace
 make install o se descomprime con tar y ya est&aacute;), pero la opci&oacute;n




inversa

en algunos casos es posible copiando el cpio,y el rpm, y en otros es 
imposible hagas lo que hagas.

Compilar directamente a partir de los fuentes, no siempre funcionan bien
 del todo en Linux, pueden necesitar algun ajuste o alg&uacute;n parche.

El ejemplo m&aacute;s claro es el gcc. No es buena idea instalarlo a partir
del

c&oacute;digo fuente, sin antes mirar los parches de H.J.Lu. 
(el que mantiene el gcc para Linux).

Un sistemas de empaquetamiendo c&oacute;mo el de Slackware, nos puede dejar
medio





colgado si borramos un paquete que no deb&iacute;amos.

Eso si, crear un paquete casero de Slackware (para instalar con installpkg)
es
relativamente f&aacute;cil, de esta forma se puede empaquetar (PGP, procmail)
que nunca han existido, e incluso se pueden actualizar otros.

Atendiendo al formato de los paquetes, (que es la "base" de una


distribuci&oacute;n), de mas a menos rudimentaria el orden ser&iacute;a el

siguiente:





Slackware, Red-Hat, Debian.

B&aacute;sicamente, un paquete Slackware es un fichero tar comprimido (con


extension .tgz), cuando ejecutas installpkg, se descomprime, si existe un
script llamado /install/doinst.sh (llamado de "post-instalaci&oacute;n"),







autom&aacute;ticamente se ejecuta, y adem&aacute;s, autom&aacute;ticamente
se crea en un
directorio de administraci&oacute;n una lista de los ficheros que contiene,


simplemente para qu&eacute; el sistema sepa que hay que borrar cuando haces


"removepkg" y para que al borrar un paquete no se borre ning&uacute;n fichero

que pertenezca a otro paquete (ficheros comunes). Esto puede parecer
complicado pero es lo m&aacute;s sencillo que hay hoy en d&iacute;a.

El sistema de empaquetamiento de Red-Hat es bastante m&aacute;s sofisticado,

y el de Debian, puede que m&aacute;s todav&iacute;a. 
Aunque no conozco ninguno de los dos, un paquete puede saber que 
ficheros son de configuraci&oacute;n, para conservarlos
al actualizar un paquete, puede haber scripts de pre-instalaci&oacute;n,
hay informaci&oacute;n sobre qu&eacute; paquetes dependen de otros, etc.

En la lista de Debian se habl&oacute; acerca de si
era posible convertir paquetes RPM de Red-Hat en paquetes .deb de
Debian. Parece que eso era posible pero no a la inversa, debido a que el
formato de Red-Hat era m&aacute;s sencillo que el de Debian.

Todo RPM binario se crea a partir de un Source RPM.
Un Source RPM (la idea de RPM es de Rick Faith -de la distribuci&oacute;n
Bogus- autor de varios drivers de SCSI de Linux) contiene el archivo
original, y los parches que se necesitan aplicar al archivo original
junto con el programa de control.  Gracias a esto es muy f&aacute;cil determinar



qu&eacute; cambios fueron realizados para portar el programa a Linux (o a
una





arquitectura en especial.  Por ejemplo: Linux/SPARC) y al mismo tiempo se

puede llevar un control de los cambios que deben de enviarse a los autores







originales.
En resumen: RPM fue dise&ntilde;ado por los programadores para facilitar
el
desarrollo y la sistematizaci&oacute;n en la generaci&oacute;n de una



distribuci&oacute;n.

Cambiar un kernel para compatibilidad de SunOS, podr&iacute;a suponer recompilar



cientos de paquetes.  Con el rpm, lo &uacute;nico que hay que hacer es teclear:





cd /usr/src/redhat/SRPMS; rpm --rebuild *.  Listo, todos los binarios
listos para ser usados con el nuevo kernel.


<P><HR>
<P>
Q:
c&oacute;mo puedo conseguir la ultim&iacute;sima versi&oacute;n del Kernel
de Linux?


<P>A:
No parece sensato estar cambiando continuamente de versi&oacute;n ni de



distribuci&oacute;n


solo para estar a la &uacute;ltima. Deber&iacute;a existir una buena raz&oacute;n




para hacerlo,
no obstante la &uacute;ltima versi&oacute;n del Kernel de linux puede obtenerse


en:










<A HREF="ftp://ftp.rediris.es/mirror/linux/kernel/sources/v2.0">ftp://ftp.rediris.es/mirror/linux/kernel/sources/v2.0






</A>
(Hacen mirror diariamente de los kernels de linux.) 
Rediris tiene unos 5GB de informaci&oacute;n relativa a Linux.
<P>La versi&oacute;n del kernel consta de tres partes.
<P>"The <B>major</B> versi&oacute;n number, the <B>minor</B>
versi&oacute;n number, and the <B>patch-level</B>."
<P> El kernel de Linux est&aacute; en permanente evoluci&oacute;n incorporando

mejoras
y corrigiendo deficiencias. Cuando se dispone de una versi&oacute;n estable






(suficientemente probada) se distribuye con un n&uacute;mero par de <EM>minor



versi&oacute;n number</EM> &nbsp;(segundo numerito) mientras
que en las versi&oacute;nes de desarrollo son impares.

Las versi&oacute;nes impares son las de desarrollo, y las pares de

producci&oacute;n
mas



estables. 
<P>
<TABLE BORDER CELLPADDING="2"><TR><TD>1.0.XX 
</TD><TD>Producci&oacute;n

</TD></TR><TR><TD>1.1.XX 
</TD><TD>Desarrollo

</TD></TR><TR><TD>1.2.XX 
</TD><TD>Producci&oacute;n

</TD></TR><TR><TD>1.3.XX 
</TD><TD>Desarrollo

</TD></TR><TR><TD>2.0.XX 
</TD><TD>Producci&oacute;n
&nbsp;(En fase de estabilizaci&oacute;n)
</TD></TR><TR><TD>2.1.XX 
</TD><TD>Desarrollo
(Ya existe la 2.10 y la 2.1.1)
</TD></TR></TABLE><P>
<P>Otra forma de actualizar un Kernel es traerse un patch.

Los patch son ficheros que se producen c&oacute;mo salida de diff -c y que


contienen las diferencias en ficheros fuente de una aplicaci&oacute;n.  Con
la
utilidad patch(1), se pueden aplicar al fichero fuente sin parchear y obtener
el parcheado.  Es la t&eacute;cnica m&aacute;s comunmente utilizada para
realizar parches
en aquellos programas en los que est&aacute; disponible el c&oacute;digo
fuente
(con lo
que queda claro que un *patch* de Linux no es c&oacute;mo un *patch* de Sun,
por





ejemplo.

Prueba a listar uno.  Ver&aacute;s que contiene un extracto del fichero

c&oacute;mo
estaba antes marcando (con '+', '-' o '!' las lineas que se a&ntilde;aden,
se
eliminan o cambian del fichero).  Son f&aacute;ciles de seguir y se puede



entender
lo que hacen a simple vista (de tal forma que puedes ver si te interesa







aplicarlos sin necesidad de hacerlo).  Es una forma de modificar un programa
y enviar las modificaciones sin necesidad de duplicar todos los fuentes.



&#161;Ojo!, si tienes la versi&oacute;n 1.2.13 y quieres actualizarte por
ejemplo a la

versi&oacute;n 1.2.16 tendr&aacute;s que aplicar sucesivamente los patch
de la 
1.2.14, 1.2.15 y 1.2.16 antes de poder compilar el nucleo.
 Para aplicarlas, podemos seguir los siguientes pasos:

cp /mi/path/para/patchXXX.gz /usr/src
cd /usr/src
gzip -d patchXXX.gz | patch -p0


<P><HR>
<P>Q: &#191;Donde puedo conseguir mas informaci&oacute;n sobre estos temas?
<P>A: Se puede consultar mas informaci&oacute;n en los siguientes lugares:
<P><EM>1) Slackware</EM>
<P>Es una distribuci&oacute;n no comercial. Est&aacute; mantenida por una
sola persona.
No
es f&aacute;cil de actualizar.
<P>

<A HREF="http://www.cdrom.com/titles/slackware.html">







http://www.cdrom.com/titles</A>
<P><EM>2) Red Hat</EM>
<P>
Es una distribuci&oacute;n comercial pero puede obtenerse por medio de ftp.
Es usada


c&oacute;mo base para otras distribuciones comerciales de linux c&oacute;mo

Caldera.
Adopta un sistema de paquetes
f&aacute;cilmente actualizable.
<P><A HREF="http://www.redhat.com">http://www.redhat.com</A>





<BR><A HREF="http://ftp.redhat.com">ftp://ftp.redhat.com</A>






<A HREF="http://www.cdrom.com/titles/slackware.html">/slackware.html</A>.

<P><EM>3) Debian</EM>
<P>Debian no est&aacute; basada en ninguna distribuci&oacute;n comercial.

Est&aacute;


desarrollada por un equipo de voluntarios de todo el mundo.
<P>































































































































































































































































































































<A HREF="ftp://ftp.debian.org/debian/info">ftp://ftp.debian.org/debian/info</A>








<BR><A HREF="http://www.debian.org/">http://www.debian.org/</A>.
<P>4<EM>) Yggdrasil Plug-and-Play Linux CD-ROM and the
Linux Bible</EM>
<P>Es la primera distribuci&oacute;n dise&ntilde;ada para CD, incluye soporte





multimedia.
Incluye parches probados pero no incluidos en linux estandar. Solo permite






instalar una versi&oacute;n completa de 600MB o una reducida de 250 MB.
<P><A HREF="http://yggdrasil.com">http://www.yggdrasil.com</A>
<BR> <A HREF="ftp://yggdrasil.com">ftp://yggdrasil.com
</A>
<P>
<EM>5) Caldera</EM>
<P><A HREF="http://www.caldera.com">http://www.caldera.com</A>
<P><EM>6) MCC Interim</EM>
<P>
<A HREF="ftp://ftp.mcc.ac.uk">ftp://ftp.mcc.ac.uk</A>
<P>7<EM>) BOGUS</EM>
<P>Es una versi&oacute;n no soportada de Linux. se puede conseguir por medio
de
ftp. No es apropiada para novatos ya que no es facil de instalar.
<P> 
<A HREF="ftp://ftp.cdrom.com/pub/bogus">ftp://ftp.cdrom.com:/pub/bogus
</A>






<BR><A HREF="ftp://ftp.gwd.de/pub/linux/bogus">ftp://ftp.gwdg.de:/pub/linux/bogus






</A>






<BR><A HREF="ftp://sunsite.unc.edu/pub/Linux/distributions/bogus">ftp://sunsite.unc.edu:/pub/Linux/distributions/bogus







</A>
<P><EM>8) Craftworks</EM>
<P>
Es una distribuci&oacute;n comercial, relativamente nueva y dispone de pocos



paquetes.
<P>(Todas las ditribuciones de Linux est&aacute;n obligadas a facilitar la
libre distribuci&oacute;n


de la parte no comercial incluida en la distribuci&oacute;n. Este detalle
parece que fu&eacute; olvidado en la primera distribuci&oacute;n)
<P><A HREF="ftp://ftp.craftwork.com/pub/v2.0">ftp://ftp.craftwork.com/pub/v2.0</A>.








<BR><A HREF="http://www.craftwork.com">http://www.craftwork.com</A>.
<P>9<EM>) Trans-Ameritech Linuxware</EM>
<P>

<A HREF="http://www.zoom.com/tae">http://www.zoom.com/tae </A>
<P>
<EM>10) Walnut Creek Slackware
</EM>
<P>Distribuci&oacute;n gratuita de libre uso.
<P>






<A HREF="http://www.cdrom.com/titles/slackware.html">http://www.cdrom.com/titles/slackware.html</A>






<BR>
<A HREF="ftp.cdrom.com/pub/slackware">ftp.cdrom.com/pub/slackware</A>
<P><EM>11)WGS Linux Pro</EM>
<P><A HREF="ftp://ftp.wgs.com/pub2/wgs/Filelist">ftp://ftp.wgs.com/pub2/wgs/Filelist</A>







<P><EM>12) S.u.S.E. GmbH German Linux CD-ROM
</EM>
<P>Distribuci&oacute;n europea en idioma alem&aacute;n.
<P>
<EM>13) Unifix 1.08 CD-ROM
</EM>
<P>Distribuci&oacute;n europea con certificaci&oacute;n POSIX. Est&aacute;



dise&ntilde;ada para una
f&aacute;cil y r&aacute;pida instalaci&oacute;n. (Basada en la de Slakware).
<P>

<EM>14) Craftworks Linux 2.0
</EM>
<P>

<A HREF="http://www.craftwork.com"> http://www.craftwork.com</A>.

<EM></EM>
<P><EM>15) Linux Universe
</EM>
<P>Incluye un libro y un CD. Est&aacute; basada completamente en ELF. Puede


funcionar desde CD implementando un sistema de acceso que copia a disco duro
los ficheros accedidos. 
<P>



<A HREF="http://www.springer-ny.com/samples/linux/linux.html">







http://www.springer-ny.com/samples/linux/linux.html</A>.


<P>
</BODY></HTML>
