<HTML>
<HEAD>
<TITLE>FAQ del Grupo Español de Usuarios de Linux (SLUG): Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="slugfaq2.htm">Siguiente</A>
<A HREF="slugfaq.htm#toc1">Contenidos</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>

<P>Esta recopilaci&oacute;n surge de la necesidad de recoger en un s&oacute;lo documento
las respuestas a las preguntas que una y otra vez aparec&iacute;an, aparecen y
aparecer&aacute;n en la lista de correo del SLUG. Si bien la misi&oacute;n de la lista
es resolver los problemas que se le pueden presentar a cualquier usuario
o administrador de Linux, siempre es &uacute;til contar con un texto que nos de
la soluci&oacute;n los problemas m&aacute;s frecuentes, o que nos indique donde podemos
encontrarla, aliviando de paso el tr&aacute;fico en la lista.</P>
<P>Con esta idea en mente tambien conviene recordar que Linux es s&oacute;lo el n&uacute;cleo
de un sistema operativo. En cualquier distribuci&oacute;n de Linux, adem&aacute;s del n&uacute;cleo, 
se incluyen una gran cantidad de aplicaciones y utilidades distintas, con 
fines y requerimientos muy diversos. </P>
<P>Ser&iacute;a muy complicado
tratar de reunir en un s&oacute;lo texto informaci&oacute;n detallada sobre configuraci&oacute;n y 
mantenimiento del n&uacute;cleo, utilidades del sistema, conexi&oacute;n a redes, 
correo electr&oacute;nico, grupos de noticias, sistema de ventanas, procesadores de 
texto, hojas de calculo, ... y as&iacute; hasta el infinito. 
Cada uno de dichos temas es suficiente
para llenar un pequeño manual (o no tan pequeño). Y como adem&aacute;s dichos
manuales existen, lo m&aacute;s recomendable es que cuando surja 
una duda, primero intentemos resolverla acudiendo a ellos.</P>
<P>Por si no se dispone de los manuales adecuados y no se sabe donde
encontrarlos, a lo largo de esta recopilaci&oacute;n se incluir&aacute;n las direcciones 
donde se puede obtener libremente dicha documentaci&oacute;n, bien en
forma de p&aacute;ginas Web, o bien como archivos accesibles mediante FTP 
(o FTPmail).</P>
<P>¿Pero toda esa documentaci&oacute;n no est&aacute; en ingl&eacute;s? Pues no. Si bien hace
relativamente poco tiempo era casi imposible encontrar documentaci&oacute;n
sobre Linux en castellano, actualmente existen ya muchos manuales
traducidos o redactados directamente en nuestra lengua, y el numero
de ellos aumenta mes a mes. As&iacute; que como el idioma oficial de la lista
es el castellano, se intentar&aacute; que las referencias que aparezcan sean a
textos en castellano (donde siempre se podr&aacute; encontrar la referencia al
original en el idioma que sea). </P>
<P>As&iacute; que si ya has repasado los HOWTO, te has empapado los manuales
del LDP, has usado repet&iacute;damente el comando 'man' y a&uacute;n as&iacute; no
encuentras respuesta, busca aqu&iacute;, que tal vez est&eacute;. 
Y si no aparece, entonces no dudes en enviar tu pregunta a la lista
de correo, que entre todos intentaremos responderla. </P>

<HR>
Anterior
<A HREF="slugfaq2.htm">Siguiente</A>
<A HREF="slugfaq.htm#toc1">Contenidos</A>
</BODY>
</HTML>
