<HTML>
<HEAD>
<TITLE>``Infobia''- Como. : Requisitos.</TITLE>
</HEAD>
<BODY>
<A HREF="Infobia-Como-1.html">Anterior</A>
<A HREF="Infobia-Como-3.html">Siguiente</A>
<A HREF="Infobia-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Requisitos.</A></H2>



<H2><A NAME="ss2.1">2.1 <I>Hardware</I></A></H2>



<H3>M&oacute;dems</H3>


<P>Est&aacute; claro: <CODE>:)</CODE> adem&aacute;s del ordenador, un m&oacute;dem. En cuanto al tipo de
m&oacute;dem, siempre he recomendado lo mismo: Externo. Un m&oacute;dem interno s&oacute;lo
tiene raz&oacute;n de ser en la poco probable situaci&oacute;n de no poseer UARTs
r&aacute;pidas (16550A). Si este no es su caso, la mejor apuesta ser&aacute; siempre
(hablando de m&oacute;dems por RTC
<SL>Red Telef&oacute;nica Conmutada, en
oposici&oacute;n a la reciente RDSI</SL>
) un m&oacute;dem externo, de cuanta mejor
reputaci&oacute;n mejor; no me gusta entrar en marcas y modelos, pero s&eacute; que esta
es un pregunta frecuente en aquellos que se disponen a actualizar o
adquirir uno, por lo que har&eacute; una excepci&oacute;n. </P>
<P>Las marcas aconsejables son las de siempre: <I>USR</I>, en sus
modelos <I>Sportster</I> o <I>Courier</I>, siempre que no sean <I>winmodems</I>
, <I>Supra</I> (actualmente <I>Diamond</I>) en su modelo <I>Fax</I>, <I>Zyxel</I>,
etc.  Siempre y cuando no sean <I>winmodems</I>. Recientemente ha pasado uno
por mis manos de fabricaci&oacute;n nacional, cuyo nombre era <I>Vayris</I> (o algo
as&iacute;), que no estaba nada mal. En cuanto a velocidades, comprar menos de
33.6 Kbps hoy en d&iacute;a es un desperdicio. </P>
<P>Una cosa s&iacute; que est&aacute; muy clara en todo caso: rehuir como de la
peste de los denominados <I>winmodems</I>; &eacute;stos no poseen chip inteligente,
y realizan sus funciones l&oacute;gicas a trav&eacute;s de software, que normalmente no
est&aacute; disponible (siendo poco probable que alguna vez lo est&eacute;, dada la
escasa calidad de dicho "hardware") en LiNUX y otros SOs.</P>
<P>Modelos y Marcas conocidos de &eacute;stos son:</P>
<P>
<UL>
<LI><I>USR Sportster Winmodem</I></LI>
<LI><I>IBM Aptiva MWAVE</I></LI>
<LI><I>Sitre Super PC336</I></LI>
<LI><I>Zoltrix VoiceMail 33600 Win HSP</I></LI>
<LI>M&oacute;dems con chip <I>Rockwell RPI</I></LI>
<LI>Tambi&eacute;n he recibido &uacute;ltimamente frecuentes preguntas de propietarios
de m&oacute;dems de chip <I>PCTEL HSP</I>, que desafortunadamente, no podr&aacute;n
beneficiarse de las capacidades de conexi&oacute;n de Linux, debido a que
pertenece a la funesta categor&iacute;a de <I>winmodems</I>. </LI>
</UL>
</P>
<P>Resumiendo: <B>NADA de winmodems</B>, a ser posible NO internos, y nada 
de PnP.</P>

<H3>Configuraci&oacute;n del m&oacute;dem</H3>


<P>Un problema frecuente es el hecho de que ``<I>el m&oacute;dem no
marca</I>''. En el 90% de los casos, y asumiendo que no son
<I>winmodems</I>, se debe a estar intentando que LiNUX comparta IRQ, bien
por estar usando un m&oacute;dem interno, en la t&iacute;pica configuraci&oacute;n DOS COM4,
irq 3, bien por tener la IRQ asignada a ese puerto ocupada con otro
dispositivo.</P>
<P>Linux NO puede compartir IRQs, y esto no es un fallo, es una necesidad.
As&iacute; pues, la estrategia es:</P>
<P>
<OL>
<LI>Configurar el m&oacute;dem para que su puerto interno pase a ser el COM2
(<CODE>/dev/ttyS1</CODE> en Linux); la configuraci&oacute;n en Linux por defecto para
este puerto es irq 3, direcci&oacute;n base 0x02f8. As&iacute; pues, si el m&oacute;dem admite
ser configurado <B>por jumpers</B> de tal modo, nos habremos ahorrado
trabajo. No olvidar desactivar el COM2 de la Placa madre. 
</LI>
<LI>Si lo anterior no puede hacerse, pero el m&oacute;dem admite (<B>por
jumpers, nada de PnP!</B>) al menos cambiar la IRQ que usar&aacute; el puerto
interno del m&oacute;dem, asignarle una IRQ distinta de la 3 o 4. Si se tiene
tarjeta de sonido, posiblemente &eacute;sta ocupe la IRQ 5, y la 7 es del LPT1
aunque no se emplee si utilizamos el driver de <I>polling</I> del n&uacute;cleo. La
9 est&aacute; en cascada con la 2, as&iacute; que una apuesta segura son las IRQs de la
10 a la 12. 
</LI>
<LI>Si esto tampoco puede hacerse, la estrategia a seguir es desactivar
el COM2 en la placa base, mediante los jumpers o como suele ser posible
con las placas Pentium, mediante la BIOS, a fin de dejar la IRQ 3 libre,
que ser&aacute; usada por defecto por el puerto interno del m&oacute;dem (COM4); o bien
cambiar la IRQ utilizada por el COM2 de la placa, a fin de que pueda ser
usada por el puerto interno del m&oacute;dem.
</LI>
<LI>Una vez nos hemos asegurado de que el <I>hardware</I> est&aacute; empleando
los recursos que debe, hemos de dec&iacute;rselo al <I>software</I>. Si hemos
conseguido poner el puerto interno del m&oacute;dem como COM2 (¡y hemos
desactivado el de la placa!), no hay m&aacute;s que hacer, todo lo que sigue est&aacute;
pensado para ese caso. Una respuesta t&iacute;pica del comando <CODE>setserial</CODE>
ser&iacute;a: 

<BLOCKQUOTE><CODE>
<PRE>
 ~]# setserial /dev/ttyS1
/dev/ttyS1, UART: 16550A, Port: 0x02f8, IRQ: 3
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>En caso de haber cambiado la IRQ a utilizar por el puerto interno
del m&oacute;dem, (COM4) deberemos dec&iacute;rselo a Linux cada vez que lo arranquemos
(incluyendo el comando en el <I>script</I> de arranque
<CODE>/etc/rc.serial</CODE>, si nuestra distribuci&oacute;n es una <I>Slackware</I>, o
en <CODE>/etc/rc.d/rc.serial</CODE> si es <I>RedHat</I>). Si le hemos puesto en
la IRQ 10, y tenemos un m&oacute;dem superior a 22.8 Kbps, el comando (o la l&iacute;nea
a poner en dicho <I>script</I>) ser&iacute;a:

<BLOCKQUOTE><CODE>
<PRE>
setserial -v /dev/ttyS3 irq 10 spd_vhi
</PRE>
</CODE></BLOCKQUOTE>


Con el cual le indicamos que el COM4 (<CODE>/dev/ttyS3</CODE>) usar&aacute; la IRQ
10, y que bloquee el puerto a alta velocidad (<I>SPeeD Very HIgh</I>). 

El par&aacute;metro <CODE>-v</CODE> har&aacute; que el comando devuelva la informaci&oacute;n de
configuraci&oacute;n final del puerto. </LI>
</OL>
</P>
<P>Si se contin&uacute;a com problemas, e incluso si no los tiene, es
recomendable leer el <I>Serie-Como</I>, disponible en <BR>
<CODE>
<A HREF="http://www.insflug.org">http://www.insflug.org</A></CODE> o en el directorio de
traducciones (<CODE>pub/Linux/docs/HOWTO/translations/es</CODE>) disponible en
cualquier <I>mirror</I> de <I>sunsite</I>.</P>


<H2><A NAME="ss2.2">2.2 <I>Software</I></A></H2>


<P>B&aacute;sicamente, lo &uacute;nico necesario es tener soporte ppp ya por parte del
n&uacute;cleo o <EM>kernel</EM> o por m&oacute;dulos, en cuyo caso son necesarios tener
cargados <CODE>shlc.o</CODE> y <CODE>ppp.o</CODE>, mediante por ejemplo la orden:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
modprobe ppp
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>existen m&eacute;todos m&aacute;s modernos como <CODE>kerneld</CODE> y otros en los que la carga
se automatiza al llamar al otro requisito, el ``demonio'' o <EM>daemon</EM>
<CODE>pppd</CODE>, que suele instalarse en un paquete aparte. T&eacute;ngase en cuenta
que si se emplea un kernel posterior al 1.3.95 ha de utilizarse una
versi&oacute;n de <CODE>pppd</CODE> posterior a la 2.2.0e. Para el kernel 1.2.13 vale a
partir de la 2.1.2d
<SL>Esto obviamente est&aacute; "obsoleto".</SL>
. </P>
<P>Los fuentes de distribuci&oacute;n del kernel contienen un m&oacute;dulo de compresi&oacute;n
ppp, <CODE>bsd_comp.o</CODE>, que por problemas de copyright no puede ser
compilado sino es como m&oacute;dulo, ni cargado autom&aacute;ticamente por
<CODE>kerneld</CODE>. El uso de este m&oacute;dulo mejora el rendimiento de la conexi&oacute;n,
especialmente en lo referente a transferencia de ficheros. Para evitarnos
el tener que cargarlo ``a mano'' tras <CODE>shlc.o</CODE> y <CODE>ppp.o</CODE>, podemos
crear un alias para <CODE>pppd</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
alias pppd=&quot;pppd; modprobe bsd_comp&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>que incluiremos en el fichero de personalizaci&oacute;n correspondiente, p. ej. 
<CODE>/etc/bashrc</CODE> si queremos que afecte a todos los usuarios
globalmente, o <CODE>~/.bash_profile</CODE> para cada uno de los 
usuarios de RedHat o <CODE>~/.bashrc</CODE> para Slackware. </P>
<P>Ciertamente, no es una soluci&oacute;n muy elegante, pero funciona :-).</P>
<P>Para conectarse a un <EM>ISP</EM> (<EM>Internet Service Provider</EM>, o Proveedor
de Acceso a Internet) a trav&eacute;s de nuestra querid&iacute;sima Infov&iacute;a, pueden
utilizarse los m&eacute;todos que a continuaci&oacute;n describo: </P>


<HR>
<A HREF="Infobia-Como-1.html">Anterior</A>
<A HREF="Infobia-Como-3.html">Siguiente</A>
<A HREF="Infobia-Como.html#toc2">Indice</A>
</BODY>
</HTML>
