<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf291, Applications: GWorkspace, el Administrador del &Aacute;rea de trabajo de GNUstep</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges Tarbouriech
 =LF=CAT___: Applications
 =LF=TITLE_: GWorkspace, el Administrador del &Aacute;rea de trabajo de GNUstep
 =LF=NUMBER: 291
 =LF=ANAME_: article291.html
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="Georges Tarbouriech"
WIDTH=115 HEIGHT=124>
<BR>por  Georges Tarbouriech <br> <small>&lt;gt(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<P>
Georges es un viejo usuario de Unix. GNUstep es uno de sus proyectos favoritos de software libre.
</P>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Leo Trujillo (<a href="http://leo.ciberlinea.com"><font size="1">homepage</font></a>)
<br>
<!--
 =LF=TRANSTO=es: Leo Trujillo
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#291lfindex0">&iquest; Qu&eacute; es un Administrador del &Aacute;rea de Trabajo (Workspace Manager) ?</A></LI>
  <LI><A HREF="#291lfindex1">Obteniendo e instalando GWorkspace</A></LI>
  <LI><A HREF="#291lfindex2">Personalizando GWorkspace</A></LI>
  <LI><A HREF="#291lfindex3">Usando GWorkspace</A></LI>
  <LI><A HREF="#291lfindex4">Menus</A></LI>
  <LI><A HREF="#291lfindex5">Visor de Archivos (File Viewer)</A></LI>
  <LI><A HREF="#291lfindex6">GWorkspace y Amigos</A></LI>
  <LI><A HREF="#291lfindex7">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=291">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>GWorkspace, el Administrador del &Aacute;rea de trabajo de GNUstep</H2>
 <img src="../../common/images/article291/FileManager.png" width="48" height="48" alt="[illustration]" hspace="5">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->
<P>
El concepto de  Workspace Manager (Administrador de &aacute;rea de trabajo) apareci&oacute; con NeXT a finales de los 80's.
Fue una completamente nueva forma de usar un sistema GUI. GWorkspace es la implementaci&oacute;n libre GNUstep de esta revoluci&oacute;n.
</P>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


<A NAME="291lfindex0">&nbsp;</A>
<H2>&iquest; Qu&eacute; es un Administrador del &Aacute;rea de Trabajo (Workspace Manager) ?</H2>

<P>
Como su nombre lo indica, &iexcl; es usado para administrar su &aacute;rea de trabajo! Hablando en serio, m&aacute;s bien es dif&iacute;cil de explicar esto hoy d&iacute;a, ya que la mayor parte de los administradores de ventanas o ambientes de escritorio proporcionan este tipo de caracter&iacute;sticas. Esas caracter&iacute;sticas son la habilidad de controlar todo desde un simple lugar usando men&uacute;es, &iacute;conos, etc.
Todos estos usados en conjunci&oacute;n con un Visor de Archivos (File Viewer) permitiendo navegar el sistema en forma de estructura de &aacute;rbol; naturalmente, pero tambi&eacute;n para lanzar aplicaciones, cambiar sus permisos, asignar aplicaciones a archivos, y as&iacute; por el estilo. La idea principal fue
reducir el n&uacute;mero de ventanas abiertas y ser capaz de tener el mismo comportamiento ya sea de men&uacute;es o &iacute;conos.
<br>
Claramente, este es un muy breve resumen. Como hemos dicho, esta es la manera
"normal" de funcionar con los ambientes GUI de las computadores hoy en d&iacute;a.
As&iacute; que, &iquest; Por qu&eacute; usar dicha herramienta si ya podemos beneficiarnos de las mismas caracter&iacute;sticas ? Bueno, &iexcl; es un asunto de gustos !
GNUstep es algo diferente  y as&iacute; son las aplicaciones usadas con &eacute;l.
Es importante entender el hecho de que GNUstep no es un administrador de ventanas, ni un ambiente de escritorio. Es una infraestructura que puede usar m&aacute;s delante, tanto si es llamado por Window Maker, KDE, Gnome o lo que sea. Sin embargo, dado que usted puede desarrollar aplicaciones espec&iacute;ficas o usar las existentes, puede compararlo con un ambiente de escritorio. Ahora bien, la mejor forma de usar GNUstep es probablemente en la que consiste en instalarlo encima de Window Maker. A decir verdad, Window Maker es el administrador de ventanas "oficial" de GNUstep, y puede ser tambi&eacute;n usado en muchos sistemas operativos, adem&aacute;s...
<br>
Hagamos una revisi&oacute;n de esta estupenda aplicaci&oacute;n : GWorkspace.
</p>
<A NAME="291lfindex1">&nbsp;</A>
<H2>Obteniendo e instalando GWorkspace</H2>

<p>
Nuevamente, GNUstep debe estar configurado y ejecut&aacute;ndose en su sistema. Al momento que escribo este art&iacute;culo, las &uacute;ltimas versi&oacute;nes estables son gnustep-make 1.6.0, gnustep-base 1.6.0, gnustep-gui 0.8.5 y gnustep-back 0.8.5. Tambi&eacute;n puede conseguir las &uacute;ltimas versi&oacute;n  del CVS.
<br>
Su sistema puede ser un Unix Libre tal como Linux o un BSD, o un Unix propietario como Solaris o Irix, o... a&uacute;n Windos. Obviamente, GNUstep es m&aacute;s o menos estable de acuerdo al sistema operativo que use.
Revise el <a href="http://www.gnustep.org/">Sitio web de GNUstep</a>
para m&aacute;s informaci&oacute;n, particularmente la gu&iacute;a para compilar GNUstep.
Un GNUstep-HOWTO est&aacute; tambi&eacute;n disponible como parte de la distribuci&oacute;n y le proporciona instrucciones especificas seg&uacute;n la plataforma.
<br>
Desde el mismo sitio web puede encontrar enlaces para descargar la mayor parte de las aplicaciones disponibles. Yendo a la secci&oacute;n User Apps encontrar&aacute; un enlace a GWorkspace.
De cualquier modo, el sitio web oficial est&aacute; en <a
href="http://www.gnustep.it/enrico/gworkspace/">http://www.gnustep.it/enrico/gworkspace/</a>.
Al momento que redacto  estas l&iacute;neas GWorkspace va en la versi&oacute;n 0.5.0. Es el trabajo de Enrico Sersale, Fabien Vallon y Alexey Froloff.
<br>
La Instalaci&oacute;n de GWorkspace se hace de la manera cl&aacute;sica : los dos comandos
<i>configure</i> y <i>make install</i> har&aacute;n lo que hace falta. Usted podr&iacute;a tener que reemplazar <i>make</i> con <i>gmake</i> en algunos sistemas (FreeBSD por ejemplo).
Por otro lado, el compilador recomendado es  gcc 3.2 (o al menos 3.0.4).
<br>
Para ejecutarlo, s&oacute;lo escriba el comando  usual GNUstep <i>openapp GWorkspace.app</i>. Si usa Window Maker, tambi&eacute;n puede lanzarlo como toda aplicaci&oacute;n GNUstep.
<br>
As&iacute; es como se ver&aacute; :
<br><br>
<a href="http://main.linuxfocus.org/common/images/article291/gw.png"><img
src="../../common/images/article291/gwth.jpg" alt="GWorkspace" width="256" height="192"></a>
<br><br>
A continuaci&oacute;n, tendr&aacute; que establecer sus preferencias.
</p>
<A NAME="291lfindex2">&nbsp;</A>
<H2>Personalizando GWorkspace</H2>

<p>
Usando el submen&uacute; Preferences del men&uacute; Info le permitir&aacute; definir varias alternativas. Puede seleccionar su editor por defecto, terminal por defecto, un orden para cuando los archivos ser&aacute;n deplegados en el Visor de Archivos (File Viewer),  el fondo del escritorio, comportamientos cuando se manipulan archivos (copia, movimiento, borrado, etc), los archivos a ocultar en el Visor de Archivos, la animaci&oacute;n de &iacute;conos y varias configuraciones de dimensi&oacute;n.
<br>
Aqu&iacute; tenemos un ejemplo de la configuraci&oacute;n del editor por defecto :
<br><br>
<a
href="http://main.linuxfocus.org/common/images/article291/editprf.png"><img
src="../../common/images/article291/editprfth.jpg" alt="Editor prefs" width="256" height="192"></a>
<br><br>
Esto nos conduce a una de las caracter&iacute;sticas importantes de GWorkspace : la App wrappers. Como mencionamos, el Visor de Archivos (File Viewer) original ten&iacute;a la habilidad de lanzar aplicaciones. As&iacute; lo hace el Visor de Archivos GWorkspace... en cuanto que ellas son aplicaciones GNUstep.
&iquest; Y qu&eacute; sucede con las otras ? Ellas son una envoltura. Es decir, cada aplicaci&oacute;n GNUstep (o NeXTstep, OpenStep o Mac OS X) es de hecho un directorio que puede ser visto como un archivo con la extensi&oacute;n "app" en el Visor de Archivos o como un directorio con el comando ls en un int&eacute;rprete de comandos. Cualquier otra aplicaci&oacute;n (que no sea GNUstep) puede convertirse en un directorio "app".
<br>
Usted debe crear un directorio para la aplicaci&oacute;n relacionada con una extensi&oacute;n app.
En muchos de los casos, este directorio debe contener el &iacute;cono de la aplicaci&oacute;n, un script que la lance y un subdirectorio de Recursos (Resources)
que mantienen un archivo llamado Info-gnustep.plist y los &iacute;conos ocasionales correspondientes al tipo de archivo que la aplicaci&oacute;n puede manejar. Por ejemplo, un editor podr&iacute;a tener &iacute;conos para archivos fuente *.m, *.c, *.h, *.txt, etc. O un navegador web podr&iacute;a tener &iacute;conos para archivos *.html, *.shtml, etc.
<br>
Naturalmente, estos directorios pueden ser vistos desde el Visor de Archivos usando el men&uacute; File y su submen&uacute; "Open as Folder" (Abrir como Carpeta). Aqu&iacute; tenemos como se ve :
<br><br>
<a
href="http://main.linuxfocus.org/common/images/article291/fold.png"><img
src="../../common/images/article291/foldth.jpg" alt="Open as folder" width="256" height="192"></a>
<br><br>
Consecuentemente, puede crear tantos directorios envoltura (wrappers) como desee usando los modelos existentes. Algunos wrappers est&aacute;n disponibles para descargar con GWorkspace.
Ciertamente, estos directorios deben estar en el lugar correcto, osea, en la ruta de las aplicaciones GNUstep (en GNUSTEP_LOCAL_ROOT/Applications o
GNUSTEP_SYSTEM_ROOT/Applications).
<br>
Otra agradable caracter&iacute;stica de GWorkspace es Fiend. Puede lanzar aplicaciones, agregar nuevas columnas, etc. En cierto modo, puede ser comparado al clip de Window Maker.
As&iacute; y todo, no existe redundancia sino que son complementarios.
<br>
El Fiend est&aacute; activado u oculto desde el menu de herramientas (Tools). Para agregar una aplicaci&oacute;n al Fiend, basta arrastrar y pegar el &iacute;cono del Visor de Archivos. El mismo men&uacute; tambi&eacute;n permite agregar capas. Usted se mueve a trav&eacute;s de ellos dando clic en las flechas del &iacute;cono de Fiend.
<br>
Los &iacute;conos as&iacute; creados en la nueva columna (dock) pueden tambi&eacute;n ser administrados desde el men&uacute;  de ventanas (Windows), esto &uacute;ltimo permite mostrar u ocultar &iacute;cono por &iacute;cono (como si cada &iacute;cono fuera considerado  como una ventana).
<br>
Aqu&iacute; tenemos una im&aacute;gen de lo que  Fiend puede hacer :
<br><br>
<a
href="http://main.linuxfocus.org/common/images/article291/fiend.png"><img
src="../../common/images/article291/fiendth.jpg" alt="Fiend" width="256" height="192"></a>
<br><br>
Ahora, esta usted listo para usar su completamente nuevo GWorkspace.
</p>
<A NAME="291lfindex3">&nbsp;</A>
<H2>Usando GWorkspace</H2>

<p>
Si es un "adicto al mouse", GWorkspace le permitir&aacute; hacer mucho de su trabajo sin usar el teclado.
Ser&aacute; capaz de copiar, mover, duplicar, borrar, o crear nuevos archivos,
los directorios jugar&aacute;n con el mouse dentro del Visor de Archivos.
De la misma forma ser&aacute; capaz de abrir documentos con la aplicaci&oacute;n correcta : estos documentos pueden ser archivos de texto, html, im&aacute;genes, etc.
Puede tambi&eacute;n renombrar archivos o directorios con solo dar clic en su nombre cuando ellos est&aacute;n en la ruta gr&aacute;fica (que es cuando est&aacute;n seleccionados).
<br>
Puede tambi&eacute;n notar en las pantallas de captura que GWorkspace agrega un reciclador a su escritorio. Innecesario decir que es usado para...
</p>
<A NAME="291lfindex4">&nbsp;</A>
<H3>Menus</H3>

<p>
El primer elemento que ver&aacute; es el llamado Info. Este le permite abrir el panel "Acerca de..." ("about") panel o abrir la ventana de Preferencias (Preferences).
<br>
El segundo elemento es el men&uacute; Archivo (File). Desde &eacute;l puede abrir, crear, destruir, duplicar, guardar archivos o carpetas, vaciar la papelera de reciclaje (&iexcl; si hay algo en &eacute;l !).
Tambi&eacute;n puede imprimir el archivo seleccionado.
<br>
El tercer elemento es el men&uacute; Editar (Edit) desde el cual puede cortar, copiar y pegar en el Visor de Archivos. Tambi&eacute;n puede seleccionar todos los archivos en una columna del Visor de Archivos.
<br>
El cuarto es el men&uacute; Ver (View). Como su nombre lo indica permite seleccionar el modo Ver del Visor de Archivos : navegar, &iacute;cono peque&ntilde;o, &iacute;cono.
<br>
El quinto es el men&uacute; Herramientas (Tools). A todas luces, contiene los bien conocidos inspectores.
<br>
Usando el inspector de Atributos ser&aacute; capaz de cambiar los permisos de lectura/escritura de archivos o directorios, o calcular el tama&ntilde;o de un directorio.
<br>
Con el inspector de Contenidos
ser&aacute; posible ver el contenido de un archivo de texto, un archivo de im&aacute;gen o el tipo de archivo seleccionado.
Cuando se trata de un directorio, usted ser&aacute; capaz de definir un m&eacute;todo de ordenaci&oacute;n para su contenido (por nombre, tama&ntilde;o, fecha, etc).
<br>
El inspector de Control de Acceso le permitir&aacute; cambiar todos los permisos de un archivo o recursivamente dentro de un directorio.
C&oacute;mo no, esto asume que usted es propietario de dicho archivo o directorio.
<br>
Por ultimo, con el inspector de Herramientas, ser&aacute; cap&aacute;z de definir una aplicaci&oacute;n por defecto para abrir un archivo.
<br>
Si es "adicto al mouse", no se preocupe: muchas teclas de atajo est&aacute;n disponibles.
Tan solo revise el men&uacute; de elementos para encontrar cuales son (usualmente
la meta tecla es ALT).
<br>
Puede tambi&eacute;n beneficiarse de un eficiente buscador (no en la terminolog&iacute;a de Mac OS X el cual es el Visor de Archivos pero con un comando gr&aacute;fico de b&uacute;squeda). Ha sido completamente reescrito para la versi&oacute;n 0.5.0 ay proporciona muchas nuevas opciones.
<br>
Puede tambi&eacute;n abrir un Hist&oacute;rico del Visor de Archivos.
<br>
El submen&uacute; Aplicaciones (Applications) despliega una lista de aplicaciones
en ejecuci&oacute;n y el submen&uacute; Operaciones con Archivos (File Operations) despliega
los procesos en segundo plano.
<br>
Como ya lo hemos mencionado, Fiend es activado o desactivado desde all&iacute; tambi&eacute;n.
Finalmente, una terminal puede ser iniciada desde el men&uacute; Herramientas (Tools).
<br>
La sexta opci&oacute;n es el men&uacute; Ventanas (Windows) el cual... administra ventanas.
<br>
La s&eacute;ptima es el men&uacute; Servicios (Services) y puede lanzar algunas aplicaciones espec&iacute;ficas.
<br>
La octava es el men&uacute; Ocultar (Hide) : el nombre lo dice todo.
<br>
Por &uacute;ltimo pero no menos importante, la opci&oacute;n novena es el men&uacute; Salir (Quit).
</p>
<A NAME="291lfindex5">&nbsp;</A>
<H3>Visor de Archivos (File Viewer)</H3>

<p>
Como ya indicamos, el Visor de Archivos es capaz de desplegar en diversos modos. El modo navegador es el cual usted vi&oacute; en las capturas de pantallas anteriores. Hay tambi&eacute;n un &iacute;cono o modo de &iacute;cono peque&ntilde;o. El &uacute;nico ausente si lo comparamos al visor de archivos de NeXT es el modo lista, que es el que se despliega como un comando <i>ls -l</i>.
Lo esperar&eacute; en una futura versi&oacute;n.
<br>
No podemos hablar sobre el Visor de Archivos sin mencionar el shelf y la ruta gr&aacute;fica (graphical path). El shelf es la parte m&aacute;s alta el Visor de Archivos. Permite almacenar temporalmente archivos o directorios, ya sea antes de moverlos/copiarlos o hacerlos r&aacute;pidamente disponibles. Puede hacer esto arrastrando y soltando un archivo o &iacute;cono de directorio desde la ventana de navegaci&oacute;n. Desde luego, Si arrastra una aplicaci&oacute;n o archivo al shelf, puede inciarlo desde all&iacute;.
<br>
El graphical path (entre el shelf y el navegador mismo) es una de las estupendas caracter&iacute;sticas del Visor de Archivos. Le permite saber en que parte se encuentra usted dentro del &aacute;rbol del sistema :
bastante &uacute;til en m&aacute;quinas Unix donde puede tener archivos o directorios profundamente ocultos en lo bajo de la jerarqu&iacute;a.
<br>
Juegue un poco con el Visor de Archivos, le permitir&aacute; descubrir otras caracter&iacute;sticas muy agradables.
</p>
<A NAME="291lfindex6">&nbsp;</A>
<H2>GWorkspace y Amigos</H2>

<p>
GNUstep y sus aplicaciones disponibles est&aacute;n mejorando mucho m&aacute;s r&aacute;pido que hace algunos a&ntilde;os.
La liberaci&oacute;n de Mac OS X parece haber estimulado a GNUstep. M&aacute;s y m&aacute;s aplicaciones tiene una compatibilidad con OS X. En breve, podemos esperar que muchas de ellas sean capaces de ejecutarse indistintamente en muchos Unixes, propietarios o libres, y a&uacute;n en Windos.
Esto ya es una realidad para muchas de ellas. Lo que significa que GNUstep esta cumpliendo su meta original que es proporcionar un ambiente de desarrollo de plataforma cruzada basado en las especificaciones OpenStep. Ciertamente, GNUstep no puede garantizar una completa compatibilidad con OS X. Apple es una gran compa&ntilde;&iacute;a con muchos desarrolladores y GNUstep es un proyecto de software libre con pocos voluntarios, esto marca la diferencia.
Como quiera, si usted lee los art&iacute;culos previos publicados en LinuxFocus relacionados a GNUstep, notar&aacute; las constantes mejoras (revise las referencias al final del art&iacute;culo).
<br>
Tambi&eacute;n, GNUstep es algo diferente. A&uacute;n si no le agrada el aspecto de NeXT,
el dise&ntilde;o es de la m&aacute;s alta calidad y como plataforma de desarrollo de GNUstep
es un modelo. Adem&aacute;s las herramientas de desarrollo disponibles hacen las cosas
a&uacute;n m&aacute;s sencillas. Una vez que usted asimile la filosof&iacute;a que hay detr&aacute;s de GNUstep, todo se volver&aacute; simple.
Desafortunadamente, parece que s&oacute;lo la gente que ha trabajado con NeXTstep u OpenStep sabe esto. Esto es, 15 a&ntilde;os despu&eacute;s, esta plataforma es silenciosamente adelantada y asi es su implementaci&oacute;n libre. En otras palabras, es amigable al usuario aunque tambi&eacute;n para el desarrollador.
<br>
Realmente, usted deber&iacute;a probarlo. La instalaci&oacute;n de GNUstep tambi&eacute;n le permitir&aacute; usar estupendas aplicaciones, tales como GWorkspace. Este &uacute;ltimo merece m&aacute;s que un sencillo art&iacute;culo ya que es m&aacute;s que un simple Visor de Archivos. No obstante, como Visor de Archivos, permanece como la mejor forma gr&aacute;fica de navegar un &aacute;rbol de sistema. Hoy, todo esto parece muy usual : &iexcl; trate de imaginar como fu&eacute; hace quince a&ntilde;os ! Y, por otro lado, desde entonces, nadie lo hace mejor. Solo vaya y pru&eacute;belo.
<br>
Hasta ahora, LinuxFocus ha revisado las "grandes" aplicaciones de GNUstep.
En el siguiente art&iacute;culo revisaremos algunas de las "peque&ntilde;as",
y estas son m&aacute;s numerosas de lo que la gente piensa frecuentemente.
<br>
&iquest; No vivimos una &eacute;poca maravillosa ?
</p>
<A NAME="291lfindex7">&nbsp;</A>
<H2>Referencias</H2>

<p>
El &uacute;nico y solitario :
<br>
<A href= "http://www.gnustep.org/">Sitio Web de GNUstep</a>.
<br>
Desde all&iacute;, encontrar&aacute; enlaces a aplicaciones de usuarios, aplicaciones para desarrolladores, y mucho m&aacute;s.
<br>
Un equivalente en Alem&aacute;n (e ingl&eacute;s) :
<br>
<A href= "http://www.gnustep.de/">Sitio Web GNUstep.de</a>.
<br>
Uno de los m&aacute;s importantes recursos GNUstep, con tutoriales, gu&iacute;as, etc :<br>
<A href= "http://www.gnustep.it/">Sitio web GNUstep.it</a>.
<br>
Otro sitio web relacionado donde se anuncia cada nueva liberaci&oacute;n de una aplicaci&oacute;n :
<br>
<A href= "http://www.gnustep.us/">Sitio web GNUstep.us</a>.
<br>
Si puede leer en Franc&eacute;s, un sitio web muy agradable con el aspecto de Aqua, desafortunadamente ca&iacute;do por el momento :
<br>
<A href= "http://www.clubstep.org/">Sitio web clubstep</a>.
<br><br>
Dos agradables proyectos de distribuci&oacute;n :
<br>
<A href= "http://simplygnustep.sourceforge.net/">Distribuci&oacute;n SimplyGNUstep</a>
<br>
<A href= "http://linuxstep.org/">Distribuci&oacute;n Linuxstep</a>
<br><br>
Mucha informaci&oacute;n relacionada a GNUstep :
<br>
<A href= "http://wiki.gnustep.org/">Wiki</a>
<br><br>
LinuxFocus ha publicado varios articulos relacionado a GNUstep. Los cuales son :
<br>
<A href= "http://main.linuxfocus.org/Castellano/March2001/article195.shtml">GNUstep, el OpenStep open source</a>.
<br>
<A href= "http://main.linuxfocus.org/Castellano/May2002/article241.shtml">GNUMail.app, la evidencia de la portabilidad</a>.
<br>
<A href= "http://main.linuxfocus.org/Castellano/November2002/article265.shtml">Gorm y ProjectCenter, las herramientas RAD de GNUstep</a>.
<br><br>
Otro Visor de Archivos para Window Maker estaba disponible hace algunos a&ntilde;os, pero su desarrollo fue detenido. Se llamaba FSViewer y funcionaba en GNUstep. A&uacute;n est&aacute; disponible
 desde
<a
href="http://www.bayerline.de/~gscholz/linux/fsviewer">http://www.bayerline.de/~gscholz/linux/fsviewer</a>.
Ha sido modificado para ser capaz de compilar con las nuevas versiones de Window Maker.
Puede ver una revisi&oacute;n en este viejo art&iacute;culo de LinuxFocus :<br>
<A href= "http://main.linuxfocus.org/Castellano/January2000/article127.shtml">FSViewer, un administrador de archivos para Window Maker</a>.
</p>


<!-- vim: set sw=2 ts=2 et tw=74: -->

<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=291"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Georges Tarbouriech <small>&lt;gt(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Leo Trujillo (<a href="http://leo.ciberlinea.com"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2003-05-06, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
