<HTML>
<HEAD>
<TITLE>Ftp An&oacute;nimo COMO: Configuraci&oacute;n. </TITLE>
</HEAD>
<BODY>
<A HREF="Ftp-Anonimo-Como-3.html">Anterior</A>
<A HREF="Ftp-Anonimo-Como-5.html">Siguiente</A>
<A HREF="Ftp-Anonimo-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="Configuracion"></A> <A NAME="s4">4. Configuraci&oacute;n. </A> </H2>


<P>La configuraci&oacute;n de un ftp es cosa f&aacute;cil, pero debemos estar atentos por
la seguridad del sistema. </P>

<H2><A NAME="CuentaUser"></A> <A NAME="ss4.1">4.1 Cuenta de usuario. </A></H2>


<P>Lo primero ser&aacute; a&ntilde;adir el usuario <CODE>ftp</CODE>, que en Debian se ha creado; pero
deber&iacute;amos repasar como est&aacute;, en RedHat tambi&eacute;n aparece, pero en SlackWare
no se crea. Para ello editaremos el archivo <CODE>/etc/passwd</CODE> y
miraremos si tenemos una l&iacute;nea parecida a esta:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ftp:*:100:101::/home/ftp:/bin/false
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si no fuera as&iacute;, la crear&iacute;amos.</P>
<P>
<OL>
<LI><CODE>ftp</CODE>:  ser&iacute;a el nombre de usuario. (F&iacute;jese que siempre es <CODE>ftp</CODE>,
sin distinci&oacute;n del nombre del servidor de ftp --- wu-ftpd en nuestro caso ---
).
</LI>
<LI><CODE>*</CODE>: Anulamos la capacidad de acceso shell al sistema del usuario
<CODE>ftp</CODE>. Como el demonio ftp necesita una, le pondremos una falsa, de
este modo el acceso al sistema como usuario ftp queda estrictamente
limitada a la funci&oacute;n de ejecutar el demonio. 
 </LI>
<LI><CODE>100</CODE>:   UID de usuario, puede variar.</LI>
<LI><CODE>101</CODE>: Grupo del usuario, que es variable tambi&eacute;n.
</LI>
<LI><CODE>/home/ftp</CODE>:  Este es el directorio ra&iacute;z del ftp para el
usuario <CODE>anonymous</CODE>. Si en este campo apareciera "<CODE>/</CODE>" 
compartir&iacute;amos todo nuestro linux, <B>muy inseguro</B>. En el caso de usuarios
del sistema, el directorio <CODE>home</CODE> ser&iacute;a el del usuario en cuesti&oacute;n.
</LI>
<LI><CODE>/bin/false</CODE>: Este ser&aacute; el nombre del shell a ejecutar.  Como
queremos limitar el acceso shell del usuario <CODE>ftp</CODE>, pero el demonio ftp
necesita una shell que <I>exista</I> ponemos <CODE>/bin/false</CODE>,
asegur&aacute;ndonos de que exista. Si no es as&iacute;, la creamos: 

<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh
exit 1
</PRE>
</CODE></BLOCKQUOTE>


Los permisos recomendables para este fichero son <CODE>rwxr-xr-x</CODE>. 

Adem&aacute;s, esta <I>shell</I> ha de aparecer listada en el fichero
<CODE>/etc/shells</CODE>, por lo que la habremos de a&ntilde;adir si no lo est&aacute;.</LI>
</OL>
</P>


<H2><A NAME="etcftpusers"></A> <A NAME="ss4.2">4.2 <CODE>/etc/ftpusers</CODE> </A></H2>


<P>Lo segundo es restringir los nombres de usuario que nunca deben entrar al
ftp. Para ello editaremos el archivo <CODE>/etc/ftpusers</CODE> e
introduciremos los que queramos: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
  # /etc/ftpusers: list of users disallowed ftp access. See ftpusers(5).

  root
  daemon
  bin
  sys
  .....
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Con esto cuando un usuario incluido en este archivo intente entrar, el
acceso le ser&aacute; denegado. </P>
<P>Si mantenemos un servidor para distintos usuarios, cuando se introduzca un
nombre y un password v&aacute;lido, el usuario aparecer&aacute; en su directorio
<CODE>$HOME</CODE>, y podr&aacute; acceder a aquellas partes del sistema a las que
tendr&iacute;a acceso por shell. </P>
<P>Si no queremos que acceda al servidor por ftp, a&ntilde;adiremos su nombre de
usuario a este archivo.</P>


<HR>
<A HREF="Ftp-Anonimo-Como-3.html">Anterior</A>
<A HREF="Ftp-Anonimo-Como-5.html">Siguiente</A>
<A HREF="Ftp-Anonimo-Como.html#toc4">Indice</A>
</BODY>
</HTML>
