<HTML>
<HEAD>
<TITLE>Ftp An&oacute;nimo COMO: Instalaci&oacute;n. </TITLE>
</HEAD>
<BODY>
<A HREF="Ftp-Anonimo-Como-2.html">Anterior</A>
<A HREF="Ftp-Anonimo-Como-4.html">Siguiente</A>
<A HREF="Ftp-Anonimo-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="Instalacion"></A> <A NAME="s3">3. Instalaci&oacute;n. </A></H2>


<P>La instalaci&oacute;n en las distintas distribuciones es muy variable, pero todas
se basan en lo mismo. Por ello empezar&eacute; en Debian que es la que yo uso, y
pasar&eacute; a RedHat y SlackWare hasta donde vea que puedo. </P>
<P>En Debian es muy f&aacute;cil, buscamos donde tenemos el paquete, y ejecutamos lo
siguiente: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
dpkg -i &quot;nombre de paquete&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En mi caso, ser&iacute;a:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
dpkg -i wu-ftpd-academ_2.4.2.16-9.deb
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Una vez realizado esto, se nos preguntar&aacute;n unas cuestiones.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Do you want to set up or update an anonymous FTP account now? [n]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esta pregunta nos indica si queremos crear una cuenta de ftp an&oacute;nimo en
este momento. Nosotros indicaremos que s&iacute;, puesto que queremos una
configuraci&oacute;n de este tipo, pero si no la deseamos decimos que no y no
ocurre nada m&aacute;s. </P>
<P>Al decir que s&iacute;, nos pregunta de nuevo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Enter the name of the FTP home directory: [/home/ftp]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Debemos indicar d&oacute;nde situaremos el directorio por defecto del ftp, por
defecto <CODE>/home/ftp</CODE> , donde nosotros lo dejaremos. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/home/ftp does already exist, should I use it? [n]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Diremos que s&iacute; para crear el directorio ra&iacute;z del ftp. La siguiente
pregunta, ser&aacute; si deseamos crear un directorio para permitir que nos
suban cosas, nosotros diremos que s&iacute;, aunque luego se explicar&aacute; c&oacute;mo
configurarlo para activar o desactivar esta cuesti&oacute;n. </P>
<P>Con todo esto, tendr&iacute;amos instalado el ftp, pero queda configurarlo. </P>
<P>Para comprobar que est&aacute; correcto, realizaremos lo siguiente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;kix@hell&gt;$ ftp 127.0.0.1
Connected to 127.0.0.1.
220-Welcome, archive user [unknown]@localhost !
220-
220-The local time is: Mon Jul 27 22:04:24 1998
220-
220-This is an experimental FTP server.  If have any unusual problems,
220-please report them via e-mail to &lt;root@hell.darkness.org&gt;.
220-
220-If you do have problems, please try using a dash (-) as the first
220-character of your password -- this will turn off the continuation
220-messages that may be confusing your ftp client.
220-
220 hell.darkness.org FTP server (Version wu-2.4.2-academ[BETA-16](1) Sat
May 23 19:56:02 CEST 1998) ready.
Name (127.0.0.1:root):
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si est&aacute; usando RedHat, Slackware o cualquier otra distribuci&oacute;n, no
se preocupe, posteriormente se indicar&aacute; c&oacute;mo configurar todo a mano. Aun
as&iacute;, indicare como se instala: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
rpm -i &quot;nombre_del_paquete_ftpd.rpm&quot;
rpm -i &quot;nombre_del_paquete_anon-ftp.rpm&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto es debido a que son dos paquetes, el del ftp an&oacute;nimo, que en RedHat 5
se llama <CODE>anonftp-2.5-1.i386.rpm</CODE> y el del demonio avanzado de ftp,
para nosotros el wu-ftpd, <CODE>wu-ftpd-2.4.2b16-4.i386.rpm</CODE>.</P>
<P>SlackWare: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
tar -xvzf &quot;nombre_del_paquete.tgz&quot; 
</PRE>
</CODE></BLOCKQUOTE>
</P>

<HR>
<A HREF="Ftp-Anonimo-Como-2.html">Anterior</A>
<A HREF="Ftp-Anonimo-Como-4.html">Siguiente</A>
<A HREF="Ftp-Anonimo-Como.html#toc3">Indice</A>
</BODY>
</HTML>
