<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_1.3">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Community">
 <TITLE>Community : Nerdbank - una iniciativa bancaria para el uso de interfaces abiertas en comercio electr&oacute;nico</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Holer-Blasum.gif" ALT="holger" WIDTH=100 HEIGHT=92>
<BR>por  <A HREF="mailto:Holger.Blasum@staticon.com,blasum@ffii.org">Holger Blasum</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Fue la necesidad de analizar ciertos datos bot&aacute;nicos y
microbiol&oacute;gicos de las sabanas de la meseta Qinghai-Tibet y
una oferta de traducir un libro sobre el sistema operativo DOS del
chino al alem&aacute;n lo que despert&oacute; el inter&eacute;s de
Holger (blasum.net/~holger) en el &aacute;rea inform&aacute;tica a
mitad de los 90s. En su &eacute;poca de vinculaci&oacute;n con
Staticon International y Weigl Interservice, desarroll&oacute; un
convertidor c&oacute;digo fuente abierto TIFF a PDF (c42pdf.ffii.org)
y particip&oacute; en un proyecto comercial semiabierto de tienda
virtual (avendo.de). Es un miembro activo de la campa&ntilde;a contra
las patentes de software en Europa (swpat.ffii.org). En la medida que
el software de c&oacute;digo abierto ha probado su fortaleza en &aacute;reas
relacionadas con seguridad, Holger visualiza un gran potencial para
negocios basados en software libre tales como Nerdbank: &quot;Existen
las condiciones temporales para que el paradigma del c&oacute;digo
fuente abierto penetre en &aacute;reas no programables de la
econom&iacute;a, especialmente aquellas donde la interacci&oacute;n
hombre-computadora ya es prevalente.&quot; 
</P>
<P><FONT COLOR="#336633">Contenidos</FONT>:
<UL>
  <LI><A HREF="#lfindex0">&iquest;Porqu&eacute; ha surgido repentinamente un mercado?</A></LI>
  <LI><A HREF="#lfindex1">&quot;Visi&oacute;n&quot; a largo plazo</A></LI>
  <LI><A HREF="#lfindex2">Redescubrir un est&aacute;ndar de transmisi&oacute;n abierto.</A></LI>
  <LI><A HREF="#lfindex3">Disponibilidad p&uacute;blica de las herramientas utilizadas por
el banco</A></LI>
  <LI><A HREF="#lfindex4">Opci&oacute;n: disponibilidad p&uacute;blica de los datos
usados por el banco</A></LI>
  <LI><A HREF="#lfindex5">Pasos hacia el &eacute;xito</A></LI>
  <LI><A HREF="#lfindex6">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=105&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Nerdbank - una iniciativa bancaria para el uso de interfaces abiertas en comercio electr&oacute;nico</H2>
 <IMG SRC="../../common/images/illustration105.jpg" ALT="nerdbank image" WIDTH=268 HEIGHT=170><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
<P>Nerdbank es un proyecto para desarrollar un sistema bancario
abierto y seguro para transacciones electr&oacute;nicas de dinero a
nivel mundial. 
</P></P><HR size="2" noshade><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>&iquest;Porqu&eacute; ha surgido repentinamente un mercado?</H2>

<P>Primero, entremos al mundo de la banca. Perm&iacute;tame recordar
que en &eacute;pocas premodernas los servicios financieros gozaban de
una baja estima social (&iquest;Recuerda usted el nombre de alg&uacute;n
mercader de la antig&uuml;edad griega, china o persa?). La fama
comercial siempre ha sido, comparativamente, ef&iacute;mera y s&oacute;lo
se ve&iacute;a justificada cuando alguno de los hijos de la familia
entraba en la carrera pol&iacute;tica o eclesial o, en el caso chino,
aprobaba los ex&aacute;menes para servir en la burocracia
estatal. El comercio pr&oacute;spero siempre ha sido una presa f&aacute;cil
para los l&iacute;deres pol&iacute;ticos. Como medida de defensa, una
cultura del secreto ten&iacute;a que surgir en los negocios,
especialmente en un negocio tan atractivo como el bancario.</P>

<P>Sin embargo, en sociedades estables, la
mente humana se ha desarrollado para buscar tanto el bienestar f&iacute;sico
como el intelectual. En las sociedades ricas y pos-materialistas del
mundo occidental esto significa que los consumidores se preocupan no
s&oacute;lo del producto en s&iacute; mismo sino tambi&eacute;n del
c&oacute;mo se produce y qu&eacute; pudo implicar su producci&oacute;n.
Las consecuencias morales han influenciado el &eacute;xito enorme
p.e. de un mercado para los productos agr&iacute;colas &quot;verdes
&quot;, las celdas solares etc. Desde tiempo largo, estas
manifestaciones de comportamiento aparentemente &quot;altruista &quot;
tambi&eacute;n han sido justificadas sobre una base acad&eacute;mica
en la teor&iacute;a de juegos (Ver Axelrod-R, Dion-D, Science
242:1385-1390; 1988). Tambi&eacute;n a este factor atribuyo el &eacute;xito
del movimiento del software de c&oacute;digo fuente abierto y de
empresas (p.e. las distribuidoras de de Linux fuente
abierto como RedHat y S.u.S.E.) y no solamente a la superioridad
t&eacute;cnica (que s&iacute; est&aacute;n alcanzado, sobre todo
recientemente) pero tambi&eacute;n a la idea m&aacute;s est&eacute;tica
de publicar y de compartir los desarrollos m&aacute;s profundos de un
sistema donde sea posible. Incluso el protocolo de hipertexto de la
WWW fue exitoso en raz&oacute;n de su simplicidad. 
</P>

<P>En consecuencia, en analog&iacute;a al
surgimiento de bancos ambientalmente comprometidos en los 80 (tal
como el Oekobank alem&aacute;n) conjeturar&iacute;a que ahora hay un
momento propicio para un mercado minorista apreciable para los
abastecedores de banca &quot;est&eacute;tica&quot;, es decir,
actividades bancarias en l&iacute;nea transparentes. No se implica
que esta forma sea t&eacute;cnicamente superior a priori a las formas
establecidas de actividades bancarias en l&iacute;nea, pero hay
buenas oportunidades de que algunas personas prefieran utilizar
productos que sienten, entienden y controlan mejor. Mi percepci&oacute;n
actual es que el mercado a&uacute;n est&aacute; virgen. Por ejemplo, la
Fundaci&oacute;n para el Software Libre, una de las organizaciones
mejor posicionadas en el mundo del software libre, no valida pagos en
la forma electr&oacute;nica debido a la carencia de est&aacute;ndares
apropiados (y se queja seguidamente por esta carencia,
&quot;quisi&eacute;ramos validar &oacute;rdenes recibidas del World
Wide Web pero debemos esperar a un software libre que maneje los
pagos de manera segura&quot;.
<A HREF="http://www.fsf.org/order/order.html">http://www.fsf.org/order/order.html</A>).
</P>

<A NAME="lfindex1">&nbsp;</A>
<H2>&quot;Visi&oacute;n&quot; a largo plazo</H2>

<P>A diferencia de la mayor&iacute;a de los bancos, el campo de
acci&oacute;n de Nerdbank probablemente no se encuentre en proveer
capital u otorgar cr&eacute;ditos, sino en las transacciones
competitivas y seguras a nivel global, especialmente v&iacute;a
internet. Se considera que la mayor parte de los clientes tendr&aacute;n
una cuenta de Nerdbank no como su primera y &uacute;nica
cuenta sino como una m&aacute;s y, quiz&aacute;s incluso secundaria. Al
comienzo Nerdbank deber&iacute;a abstenerse de pr&eacute;stamos a
largo plazo de cantidades de capital considerable. <BR>&nbsp; 
</P>

<A NAME="lfindex2">&nbsp;</A>
<H3>Redescubrir un est&aacute;ndar de transmisi&oacute;n abierto.</H3>


<P>Consideremos transmitir 0.25 Riggit a
un editor en Kuala Lumpur instant&aacute;neamente, en vez de llenar
una solicitud escrita o esperar hasta que, a base de click del rat&oacute;n su navegador
le conecte, v&iacute;a CGI, a un sitio web congestionado
de un banco. Desde su vieja m&aacute;quina 386 usted s&oacute;lo
env&iacute;a un mensaje electr&oacute;nico a la instituci&oacute;n
crediticia (p.e. Nerdbank). N&oacute;tese que el est&aacute;ndar
ARPA RFC 822 para formato de mensajes de texto en Internet
permite campos adicionales a definir. 
</P>
<CENTER>
<TABLE WIDTH=90% BORDER=0 CELLPADDING=2 CELLSPACING=2 BGCOLOR="#99b8f6">
<TR>
<TD>
<P>Asunto: Pago de Nerdbank4503160 <BR>
A: payment@nerdbank.com<BR>
Encriptado:[Esta parte debe ser encriptada por clave] <BR>
&nbsp;&nbsp;&nbsp; Fecha: 1999-10-15 <BR>
&nbsp;&nbsp;&nbsp; Verificaci&oacute;n-Activada: 1999-10-22 <BR>
&nbsp;&nbsp;&nbsp; Cantidad: 0.25 <BR>
&nbsp;&nbsp;&nbsp; Moneda: MRT <BR>
&nbsp;&nbsp;&nbsp; N&uacute;meroCuenta: 0554565<BR>
&nbsp;&nbsp;&nbsp; Banco: Bank of Malaysia, Kuala Lumpur <BR>&nbsp;&nbsp;&nbsp;
Receptor: chenhy@klwn.ma, Hongyan Chen, Kuala Lumpur Weekly News, Postbox 50034, Kuala Lumpur, Malaysia <BR>
&nbsp;&nbsp;&nbsp; IdentidadReceptor: kualaweekly <BR>&nbsp;&nbsp;&nbsp; Notas:<BR>
[fin de la parte opcionalmente encriptada] <BR>
Emisor: yo<BR>
ClaveEmisor: 98fdgkojdsfkl5efp?weidl?gkr6980fgliredsopr0?t8436dp?dsf?kd op940?6 59sgikwer0? 30?8 4eoue90r8e90t8ewfidsofu09<BR>
ClaveReceptor: 4365i590sdjkofjdslkjdfg0 ?89sdar dsfjksdlpfi dopfsdopfgje kpsd sdop sdklj ropfg sdlpk dfogkpod gopdsgsdg 
</P>
</TD>
</TR>
</TABLE>
</CENTER>

<P>IdentidadReceptor es un memo definido por el usuario (para
ser usado como un atajo), Verificaci&oacute;n-Activada es la fecha hasta
la cual puede revocarse o aprobarse la transacci&oacute;n (por
razones de seguridad, la transacci&oacute;n puede no efectuarse de
forma instant&aacute;nea) y ClaveEmisor una clave p&uacute;blica
PGP utilizada para encriptar el mensaje, ClaveReceptor ser&aacute; una clave
p&uacute;blica que confirme la autenticidad de los datos del receptor
(p.e. si se descarga de una p&aacute;gina web), pero que tambi&eacute;n
podr&iacute;a combinarse p.e. con una lectura biom&eacute;trica
retinal.</P>

<P>Este simple formato permite escribir aplicaciones simples que generen esta
clase de correos-e de programas tales como: 
</P>
<CENTER>
<TABLE WIDTH=90% BORDER=0 CELLPADDING=2 CELLSPACING=2 BGCOLOR="#99b8f6">
<TR>
<TD>
<P><BR>transferir -d 1015 -a 0.25 -c MRT -r 0554565 -a 'Bank of
Malaysia, Kuala Lumpur' -i kualaweekly -n 'chenhy@klwn.ma,
Hongyan Chen, Kuala Lumpur Weekly News, Postbox 50034, Kuala
Lumpur, Malaysia' -k /usr/local/keyfile 
</P>
</TD>
</TR>
</TABLE>
</CENTER>

<P>Esto puede lucir  bastante complejo, pero al menos aqu&iacute; el
programa por defecto no exhibe el nombre de usuario, el receptor
Nerdbank y la fecha de verificaci&oacute;n de una semana posterior a
la fecha actual (probablemente est&eacute;n guardados en el archivo
init/rc). 
</P>

<P>El programa, por supuesto, puede asociar la IdentidadReceptor
con otros datos. La pr&oacute;xima vez que queramos hacer una transferencia
&quot;transfer -r -a 0.5 -d 1115 -i kualaweekly&quot; har&aacute; el trabajo.
Y esto se convierte en algo mucho m&aacute;s pr&aacute;ctico y conveniente
que llenar una y otra vez el mismo formulario web.</P>

<P>La transacci&oacute;n inicial ser&iacute;a mucho m&aacute;s
fluida si los datos de kualaweekly se encontraran en una base de
datos (pero esto requiere que el receptor tambi&eacute;n entre a
ella) o hubieran sido obtenidos autom&aacute;ticamente. Un plug-in de
navegador podr&iacute;a intentar interpolar desde los formularios en
l&iacute;nea de las p&aacute;ginas web.</P>

<P>Localmente, la aplicaci&oacute;n deber&iacute;a registrar la
transacci&oacute;n en su servidor local o remoto en un formato de
f&aacute;cil comprensi&oacute;n; posiblemente XML puesto que
es un formato abierto, existe una gran cantidad de scripts (perl o lo
que ud. quiera) que manejan estos datos (por supuesto, el soporte XML
de Microsoft Explorer 5 har&iacute;a tambi&eacute;n ese trabajo, pero
no satisface a nuestra base de clientes). Tambi&eacute;n deber&iacute;amos
tener la opci&oacute;n de encriptar los datos. Como servicio, el
banco revisar&iacute;a si la cantidad puede ser transferida
(quiz&aacute;s ud. desee restringirla a, por ejemplo, pagos semanales
de US$500).</P>

<A NAME="lfindex3">&nbsp;</A>
<H3>Disponibilidad p&uacute;blica de las herramientas utilizadas por
el banco</H3>

<P>Asumamos que el banco que desarroll&oacute; estas herramientas
simples las publique bajo dominio p&uacute;blico (licencia
GNU), m&aacute;s a&uacute;n (de manera m&aacute;s radical) que
declare que su desarrollo futuro de software estar&aacute; bajo
dominio p&uacute;blico (p.e. en nerdbank.org). Por supuesto, el
banco (localizado, p.e. en nerdbank.com) tiene que cobrar por sus
servicios y buscar alg&uacute;n margen de beneficios, pero no a costa de
su desarrollo de software. As&iacute; que, al ser las herramientas
p&uacute;blicas, otros bancos podr&iacute;an utilizarlas. Creo
que la reputaci&oacute;n que nerdbank tendr&iacute;a por su labor
pionera en est&aacute;ndares abiertos de banca le asegurar&iacute;a
clientes a largo plazo. De otro lado, la libre
disponibilidad de todas las herramientas de transacci&oacute;n
tambi&eacute;n asegurar&iacute;a que los costos de transacci&oacute;n
se mantendr&iacute;an en niveles bajos gracias a las fuerzas del
mercado.</P>

<A NAME="lfindex4">&nbsp;</A>
<H3><B>Opci&oacute;n: disponibilidad p&uacute;blica de los datos
usados por el banco</B></H3>

<P>Como opci&oacute;n, es bastante viable que un nerdbank ideal
permitiera inclusive el acceso p&uacute;blico a sus servidores (s&oacute;lo
lectura, obviamente) permitiendo as&iacute; que cualquier
especialista en seguridad en cualquier parte del mundo ganara
reputaci&oacute;n se&ntilde;alando los fallos de seguridad.
Posiblemente esto se ver&iacute;a como una violaci&oacute;n a los
h&aacute;bitos tradicionales de secreto bancario, pero (posiblemente
a trav&eacute;s de una encriptaci&oacute;n parcial) el acceso de
cualquiera a los datos es mucho m&aacute;s democr&aacute;tico que
cuando dicho acceso s&oacute;lo se permite a la polic&iacute;a (por
supuesto que un abuso comercial de los datos por clientes web robots
deber&iacute;a ser penalizado.)</P>

<P>Como compromiso, es posible tambi&eacute;n configurar dos clusters
de servidores, uno privado y otro p&uacute;blico, de modo que los
usuarios puedan decidir cual usar con cada nueva transacci&oacute;n
(siendo casi id&eacute;ntico el software, aun cuando uno es abierto y
el otro protegido). Como resultado adicional, quedar&iacute;a as&iacute;
demostrada de una manera espectacular la seguridad real de los
algoritmos de encriptaci&oacute;n.</P>

<P>Una pol&iacute;tica as&iacute; deber&iacute;a, eventualmente,
posicionar a nerdbank como uno de los m&aacute;s seguros y confiables
bancos del mundo. A&uacute;n si todas las t&eacute;cnicas (abiertas)
fueran copiadas (lo cual, despu&eacute;s de todo, es lo que se
busca), la porci&oacute;n de confiabilidad obtenida ser&iacute;a lo
suficientemente grande para permanecer lucrativo.</P>

<P>Ahora, usted puede ridiculizar mi &quot;visi&oacute;n&quot; y
decirme que la mayor&iacute;a de estas tecnolog&iacute;as simples
como la transferencia por correo electr&oacute;nico han sido
utilizadas en los bancos desde la d&eacute;cada de 1960, pero es un
hecho triste que debido al reciente surgimiento de los GUIs y otras
herramientas para ocultar lo complejo, as&iacute; como las trabas
legales con las claves de encriptaci&oacute;n que ning&uacute;n banco
ofrece este servicio (donde las claves largas de encriptaci&oacute;n
est&eacute;n prohibidas, el banco podr&iacute;a aceptar claves m&aacute;s
cortas). Debemos tener en cuenta que no es necesario apuntar al gran
mercado sino al peque&ntilde;o segmento de la poblaci&oacute;n
deslumbrado por la tecnolog&iacute;a. Y esta desatenci&oacute;n es un
bello desaf&iacute;o para un plan de acci&oacute;n capaz de
aprovechar el momento:</P>

<A NAME="lfindex5">&nbsp;</A>
<H2>Pasos hacia el &eacute;xito</H2>

<P>La discusi&oacute;n del concepto con gente interesada y con
experiencia en banca, seguridad y est&aacute;ndares de Internet
llevar&aacute; a una serie de responsabilidades que tendr&aacute;n
que ser fijadas. Posiblemente se realice una oferta p&uacute;blica de
acciones. Los trabajos de este grupo deber&iacute;an ser
(moderadamente) bien pagados, con la meta de encontrar un compromiso
entre competitividad y responsabilidad social. Una organizaci&oacute;n
a mitad de camino entre una compa&ntilde;&iacute;a y una organizaci&oacute;n
sin &aacute;nimo de lucro deber&iacute;a crearse para tal fin.</P>

<P>Nota: La finalidad principal del banco no ser&iacute;a
necesariamente (pero posiblemente) ser un ejemplo de un autogobierno
&quot;pol&iacute;ticamente correcto&quot; sino el de ser un proveedor
y patrocinador de herramientas de c&oacute;digo fuente abierto (en el
modelo de Linux, ser&iacute;a m&aacute;s un RedHat que un Debian). La
apertura impl&iacute;cita del software y los datos actuar&iacute;a
como correctivo para las fallas de desarrollo, y el posible
descontento con los bancos llevar&iacute;a a que pueda surgir con
facilidad otro(s) banco(s) competidor(es) (el mismo mecanismo que ha
permitido que ninguna de la distribuciones de Linux prevalezca sobre
las dem&aacute;s).</P>

<P>El banco ofrecer&iacute;a cuentas desde el mismo comienzo.
Actualmente, el poseer una cuenta s&oacute;lo significa recibir por
correo electr&oacute;nico notificaciones acerca de las actividades
del banco. Existir&iacute;an &quot;cuentas normales&quot;,
completamente gratuitas y &quot;cuentas de patrocinador o apoyo&quot;
que tendr&iacute;an un costo anual (por defecto: 20 Euros) y que se
utilizar&iacute;an para financiar las actividades. Sin embargo, el
mercado principal de cuentas no ser&iacute;an estas &uacute;ltimas
sino alcanzar una masa cr&iacute;tica que permita negociar con las
grandes instituciones. Cuando una base de usuarios, (probablemente la
WWW, posiblemente en conjunci&oacute;n con
actividades de encriptaci&oacute;n)
haya sido establecida, se establecer&iacute;a a su vez una alianza
preliminar con uno varios bancos para el manejo de transacciones. Al
comienzo, el banco no asumir&aacute; la responsabilidad por ning&uacute;n
pago (y posiblemente desanime a los clientes individuales de realizar
grandes dep&oacute;sitos de dinero), tampoco cubrir&aacute; cuentas
con saldo negativo (por supuesto que los clientes recibir&iacute;an
verificaci&oacute;n instant&aacute;nea por correo electr&oacute;nico
si los pagos son rechazados por falta de fondos). Esta estrategia de
servicio tipo &quot;ALDI&quot; (cadena econ&oacute;mica de
supermercados alemanes) puede asegurar acceso global instant&aacute;neo
y sin burocracia.</P>

<P>Es de esperar que el proceso de establecer est&aacute;ndares
preliminares y negociaci&oacute;n de fondos tome entre seis y doce
meses. Luego los cuenta habientes ser&iacute;an animados a realizar
transacciones a nerdbank a trav&eacute;s de el formato (sea &eacute;ste
w3c o ISO), mientras que nerdbank pasar&aacute; las transacciones
electr&oacute;nicas con los bancos aliados que puedan soportarlas en
un modo tradicional. Mientras los servicios tradicionales y los
costos de administraci&oacute;n ser&aacute;n muy bajos, es
recomendable cobrar a los clientes (excepto a los &quot;patrocinadores&quot;)
s&oacute;lo en una base por transacci&oacute;n (probablemente, de
manera proporcional al monto de la transacci&oacute;n).</P>

<P>Cuando los est&aacute;ndares abiertos creados y soportados por
nerdbank comiencen a adquirir apoyo, los vendedores gradualmente los
adoptar&aacute;n (p.e. incluy&eacute;ndolos como datos XML en sus
p&aacute;ginas web o envi&aacute;ndolos a una base de datos p&uacute;blica).
En esta fase nerdbank se convertir&aacute; en una empresa global
creciente. Ir&oacute;nicamente, si la campa&ntilde;a es exitosa (y
copiada por otros bancos) eventualmente nerdbank se har&aacute; m&aacute;s
similar a otros bancos (un proceso en el cual ha entrado el alem&aacute;n
Oekobank), pero la manera de hacerlo y la cooperaci&oacute;n estrecha
con los desarrolladores de software abierto asegurar&aacute; algunos
momentos interesantes para clientes y desarrolladores.</P>

<P>El &eacute;xito de un banco basado en la apertura del software y
la administraci&oacute;n ser&iacute;a saludable para el crecimiento
futuro del glasnost y la racionalidad en otras industrias..As&iacute;
que fundar un nerdbank s&oacute;lo significar&iacute;a estar en esa
corriente. Desde una perspectiva alemana, uno de los lugares
agradables para recoger recursos ser&iacute;a la Conferencia Linux de
Ausburgo (8-10 Septiembre 1999,
<A HREF="http://www.linux-kongress.de/">http://www.linux-kongress.de/</A>),
un sitio hist&oacute;ricamente significativo por la fama previa de
los mercaderes Fuggers como creadores de la cita &quot;Es m&aacute;s
f&aacute;cil robar fundando un banco que asaltando a un banquero.&quot;
(Brecht). 
</P>

<A NAME="lfindex6">&nbsp;</A>
<H2>Referencias</H2>

<P>Para m&aacute;s informaci&oacute;n del proyecto Nerdbank visite su
sitio web <A HREF="http://www.nerdbank.org/">http://www.nerdbank.org/</A>.
</P>



<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=105&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Holger Blasum <BR>LinuxFocus 2000</FONT>
<BR><a href="http://linuxfocus.linuxbox.com/cgi-bin/lfcomment?lang=es&article=article105.html" target="_TOP"><FONT COLOR="#FFFFFF">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</FONT></A><BR></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:Holger.Blasum@staticon.com,blasum@ffii.org"><FONT COLOR="#FFFFFF">Holger Blasum</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:klingsor@starmedia.com"><FONT COLOR="#FFFFFF">Juan Manuel Triana</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2000-08-20, generated by lfparser version 1.3</font></p></BODY></HTML>
