<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.02b7 [en] (X11; I; Linux 2.0.29 i586) [Netscape]">
</HEAD>
<BODY>
<FONT SIZE=+2><B>CYRIX,AMD</B></FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>PREG></FONT>
<BR><FONT SIZE=+2>Segun creo tanto Cyrix como AMD necesitan de un compilador
un tanto especial para funcionar correctamente, dado que el microc&oacute;digo
de estos es distinto al Pentium, de momento el gcc NO soporta dichos chips,
asi que dichos procesadores se ver&aacute;n penalizados frente un Pentium.</FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>RESP></FONT>
<BR><FONT SIZE=+2>Bueno, una cosa es que no haya gcc *optimizado* para
Cyrix o AMD, y otra cosa es que no soporte dichos chips. Cualquier compilador
estandar deber&iacute;a funcionar. Yo tengo un Cyrix 6x86 P-166+ y el Linux
me va perfectamente, tanto compilando como ejecutando. Eso si, mejor no
utilizar las optimizaciones para Pentium y compilar como si fuera un 486
(supera al Pentium igualmente).</FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>&nbsp;<A HREF="admin.htm">Vuelta al Indice de Faq Admin</A></FONT>
<BR>
<HR WIDTH="100%">
<BR><FONT SIZE=+2>&nbsp;</FONT><A NAME="DESKJET"></A><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2><B>IMPRESORAS Deskjet</B></FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>PREG></FONT>
<BR><FONT SIZE=+2>Las impresoras de la familia Deskjet de HP tienen la
limitaci&oacute;n f&iacute;sica de que no pueden imprimir a menos de 0.5"
(14mm?) del borde inferior del papel. El driver cdj550 del ghostscript
parece que no lo tiene en cuenta, y algunos documentos al imprimirlos,
pierden varios mil&iacute;metros.</FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>RESP></FONT>
<BR><FONT SIZE=+2>Hay una soluci&oacute;n bastante chapucera pero que funciona:
El programa mpage permite modificar un documento postscript, y entre las
m&uacute;ltiples opciones que tiene, nos permite redefinir los m&aacute;rgenes
del papel. Lo que hice fue ajustar dichos m&aacute;rgenes a mi impresora,
y una vez que di con los parametros correctos, lo a&ntilde;adi al filtro
de impresi&oacute;n. Utilizo el filtro de impresi&oacute;n de RedHat 4.1.
En la configuraci&oacute;n de la impresora, tengo activada la opci&oacute;n
de convertir todo a postscript. Para hacer que todos los documentos pasaran
por el mpage con las opciones correctas antes de entregarselos al gs para
pasarlo al formato nativo de la impresora, modifiqu&eacute; el fichero
/usr/lib/rhs/printtool/ps-to-printer.fpi de forma que al final queda:</FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>-------------------------- 8&lt; --------------------</FONT>
<BR><FONT SIZE=+2>[Falta todo el principio del fichero]</FONT>
<BR><FONT SIZE=+2>else</FONT>
<BR><FONT SIZE=+2># we're using ghostscript</FONT>
<BR><FONT SIZE=+2># Modificado para arreglar los margenes en la HP690c</FONT>
<BR><FONT SIZE=+2>&nbsp;mpage -A -o -S -1 -m20l20r20t40b -M-45l-35r-30t-35b
| \</FONT>
<BR><FONT SIZE=+2>&nbsp;gs -q -sDEVICE=$GSDEVICE\</FONT>
<BR><FONT SIZE=+2>&nbsp;&nbsp; -r$RESOLUTION \</FONT>
<BR><FONT SIZE=+2>&nbsp;&nbsp; -sPAPERSIZE=$PAPERSIZE \</FONT>
<BR><FONT SIZE=+2>&nbsp;&nbsp; -dNOPAUSE&nbsp; -dSAFER\</FONT>
<BR><FONT SIZE=+2>&nbsp;&nbsp;&nbsp; -sOutputFile=- $COLOR \</FONT>
<BR><FONT SIZE=+2>&nbsp;&nbsp; $EXTRA_GS_OPTIONS \</FONT>
<BR><FONT SIZE=+2>&nbsp; -fi etc...</FONT>
<BR><FONT SIZE=+2>-----------------------------------------------------</FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>El que use otro filtro de impresi&oacute;n, simplemente
pasando los documentos por mpage antes de pasarlos al gs (como en el ejemplo),
le funcionar&aacute; igual. Las opciones del mpage son las siguientes:
-A: Papel A4 -o: No imprimir un marco alrededor de la p&aacute;gina (uso
a2ps y 'este ya los hace) -S: Permitir escalado irregular (no cuadrado)
-1: Imprimir en una p'agina -m: M&aacute;rgenes f&iacute;sicos de la p&aacute;gina
(man mpage ;) -M: M&aacute;rgenes l&oacute;gicos (man mpage)</FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>&nbsp;<A HREF="admin.htm">Vuelta al Indice de Faq Admin</A></FONT>
<BR>&nbsp;
</BODY>
</HTML>
