<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Filtros de impresi&oacute;n con Ghostscript: Impresi&oacute;n remota</TITLE>
 <LINK HREF="Filtros-Impresion-Como-8.html" REL=next>
 <LINK HREF="Filtros-Impresion-Como-6.html" REL=previous>
 <LINK HREF="Filtros-Impresion-Como.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="Filtros-Impresion-Como-8.html">Página siguiente</A>
<A HREF="Filtros-Impresion-Como-6.html">Página anterior</A>
<A HREF="Filtros-Impresion-Como.html#toc7">Índice general</A>
<HR>
<H2><A NAME="s7">7. Impresi&oacute;n remota</A></H2>

<P>
<P>En la impresi&oacute;n remota, los filtros se emplean de manera diferente seg&uacute;n se
trate de imprimir en una m&aacute;quina remota <B>unix</B> o <B>windows</B>.
En el primer caso, el administrador de la m&aacute;quina remota debe incluir la
nuestra en su <CODE>/etc/hosts.equiv</CODE> o, mejor, en <CODE>/etc/hosts.lpd</CODE>,
o permitirle la impresi&oacute;n solamente a ciertos usuarios empleando el atributo
<CODE>rs</CODE> (ver la p&aacute;gina <B>man</B> de <EM>lpd</EM>). Para imprimir en la m&aacute;quina
remota, a&ntilde;adiremos una nueva entrada a nuestro <CODE>/etc/printcap</CODE>.
Supongamos que la impresora de la m&aacute;quina remota (<CODE>hercules.us.es</CODE>)
es una Epson EPL 5700 y la cola de impresi&oacute;n por defecto (<CODE>lp</CODE>) es la que
queremos usar. La entrada ser&iacute;a:
<P>
<BLOCKQUOTE><CODE>
<PRE>
#Remote unix printer
epl5700|Remote unix printer
        :sd=/var/spool/lpd/epl5700:\
        :rm=hercules.us.es:\ #nombre de la m&aacute;quina remota (rm: remote machine)
        :rp=lp:\ #nombre de la cola de impresi&oacute;n en la m&aacute;quina remota (rp: remote printer)
        :mx#0:\
        :lp=/dev/null:\ 
        :sh:\
</PRE>
</CODE></BLOCKQUOTE>
<P>Es necesario tener un directorio <CODE>spool</CODE> en la m&aacute;quina local, porque si
la remota est&aacute; ocupada o desconectada, el trabajo a imprimir esperar&aacute; en
dicho directorio hasta que sea enviado.
<P>Cuando se trata de imprimir en una m&aacute;quina remota Windows, debemos usar el
paquete <B>SaMBa</B>. Es posible establecer una cola de impresi&oacute;n
mediante el programa <EM>smbclient</EM> (parte de samba) por el protocolo
<CODE>TCP/IP</CODE> mediante el servicio de impresi&oacute;n <CODE>SMB</CODE>. Samba incluye
un gui&oacute;n para realizar esto, llamado <EM>smbprint</EM>. En pocas palabras, se
a&ntilde;ade una entrada nueva al <CODE>/etc/printcap</CODE> de la m&aacute;quina local para
la impresora remota incluyendo en la entrada <CODE>if</CODE> el script
<EM>smbprint</EM>. Si la impresora remota es, por ejemplo, una HP Laserjet,
podr&iacute;amos poner:
<P>
<BLOCKQUOTE><CODE>
<PRE>
#Remote samba printer
HPlaserjet|Remote samba printer
        :sd=/var/spool/lpd/HPlaserjet:\
        :mx#0:\
        :lp=/dev/null:\ 
        :if=/usr/local/sbin/smbprint #Ruta del gui&oacute;n smbprint
        :sh:\
</PRE>
</CODE></BLOCKQUOTE>
<P>Para mayor informaci&oacute;n acerca de la impresi&oacute;n remota, consultar el
<EM>C&oacute;mo</EM> correspondiente a la configuraci&oacute;n de impresi&oacute;n.
<P>
<HR>
<A HREF="Filtros-Impresion-Como-8.html">Página siguiente</A>
<A HREF="Filtros-Impresion-Como-6.html">Página anterior</A>
<A HREF="Filtros-Impresion-Como.html#toc7">Índice general</A>
</BODY>
</HTML>
