<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Filtros de impresi&oacute;n con Ghostscript: Filtros m&aacute;gicos</TITLE>
 <LINK HREF="Filtros-Impresion-Como-6.html" REL=next>
 <LINK HREF="Filtros-Impresion-Como-4.html" REL=previous>
 <LINK HREF="Filtros-Impresion-Como.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="Filtros-Impresion-Como-6.html">Página siguiente</A>
<A HREF="Filtros-Impresion-Como-4.html">Página anterior</A>
<A HREF="Filtros-Impresion-Como.html#toc5">Índice general</A>
<HR>
<H2><A NAME="s5">5. Filtros m&aacute;gicos</A></H2>

<P>
<P>Un filtro puede ser tan sencillo como los que hemos visto, o complicarse
substancialmente, llegando a ser capaz de reconocer el tipo de fichero
que queremos imprimir y realizar las operaciones necesarias para que
obtengamos una salida correcta. Un «filtro m&aacute;gico» analiza la entrada que
recibe y, de acuerdo con los datos que le llegan, manda el trabajo a otro
filtro secundario. As&iacute;, cuando le llega un fichero en formato PS, lo
env&iacute;a a <EM>ghostcript</EM>, cuando es JPEG, lo manda a otro filtro adecuado para
la impresi&oacute;n correcta, etc. Los filtros m&aacute;gicos m&aacute;s conocidos son
<B>magicfilter</B>, <B>apsfilter</B> y los <B>filtros de impresi&oacute;n de
RedHat</B>.
<P>
<H2><A NAME="ss5.1">5.1 Magicfilter</A>
</H2>

<P>
<P>Magicfilter es un programa escrito por H. Peter Anvin
<CODE>
<A HREF="mailto:Peter.Anvin@linux.org">Peter.Anvin@linux.org</A></CODE> que puede encontrarse en cualquier
espejo de sunsite, en el directorio
<P>
<BLOCKQUOTE><CODE>
<PRE>
/mirror/linux/sunsite/system/printing/magicfilter-1.2.tar.gz
</PRE>
</CODE></BLOCKQUOTE>
<P>y tambi&eacute;n existe como paquete <CODE>.deb</CODE> y <CODE>.rpm</CODE>. Es el filtro m&aacute;gico
recomendado en la distribuci&oacute;n Debian. Para configurar una impresora en
este sistema, primero han de instalarse los paquetes <EM>magicfilter</EM> y
<EM>recode</EM>.
El programa <EM>magicfilterconfig</EM> se crea al instalar el paquete
<B>magicfilter</B> y permite una c&oacute;moda configuraci&oacute;n de la impresora,
escribiendo el fichero <CODE>/etc/printcap</CODE> a partir de las respuestas a
una serie de preguntas que nos hace interactivamente. Nos pregunta por el
puerto del dispositivo (<CODE>/dev/lp1</CODE> o <CODE>/dev/lp0</CODE>), as&iacute; como
los nombres que daremos a nuestra impresora: uno largo y descriptivo y
otro m&aacute;s corto que se usar&aacute; como nombre para el directorio <EM>spool</EM> y
luego muestra una serie de filtros disponibles para elegir. Lo mejor es
mirar, antes de ejecutar <EM>magicfilterconfig</EM>, en el directorio
<CODE>/etc/magicfilter</CODE> para ver cu&aacute;l es el filtro que mejor viene a
nuestra impresora. Los filtros son archivos de texto en cuyo cabecera se
indica la impresora que lo puede utilizar. <EM>magicfilterconfig</EM> genera
el fichero <CODE>/etc/printcap</CODE> con toda la informaci&oacute;n que le hemos
dado. Para el caso de mi Epson Stylus Color 600, el fichero
<CODE>/etc/printcap</CODE> generado por <EM>magicfilterconfig</EM> es (En
Debian 2.1 kernel 2.0.36):
<P>
<BLOCKQUOTE><CODE>
<PRE>
#
# Copyright (c) 1983 Regents of the University of California.
# All rights reserved.
#
# Redistribution and use in source and binary forms are permitted
# provided that this notice is preserved and that due credit is given
# to the University of California at Berkeley. The name of the University
# may not be used to endorse or promote products derived from this
# software without specific prior written permission. This software
# is provided ``as is'' without express or implied warranty.
#
#       @(#)etc.printcap        5.2 (Berkeley) 5/5/88
#
# This file was generated by /usr/sbin/magicfilterconfig.
#
lp|eps|ESC600:\
        :lp=/dev/lp1:sd=/var/spool/lpd/eps:\
        :sh:pw#80:pl#72:px#1440:mx#0:\
        :if=/etc/magicfilter/stylus_color_360dpi-filter:\
        :af=/var/log/lp-acct:lf=/var/log/lp-errs:
</PRE>
</CODE></BLOCKQUOTE>
<P>Una vez instalado, <EM>magicfilter</EM> permite que el sistema reconozca e
imprima gr&aacute;ficos (GIF, JPEG, TIFF, BMP...), ficheros PS, PDF, DVI, p&aacute;ginas
de manual, ficheros ASCII con acentos y &ntilde;, e incluso cualquier tipo de
fichero comprimido con gzip.
<P>
<H2><A NAME="ss5.2">5.2 Apsfilter</A>
</H2>

<P>
<P><EM>apsfilter</EM> es otro programa que permite configurar la impresora y
escribir un fichero <CODE>/etc/printcap</CODE> con los filtros adecuados para
muchos formatos de fichero (ASCII, DVI, PS, PDF, GIF, TIFF, BMP,
BITMAP...) y diversos tipos de compresi&oacute;n (compress, gzip, freeze).
<EM>apsfilter</EM> ha sido desarrollado por Andreas Klemm <CODE>
<A HREF="mailto:andreas@knobel.gun.de">andreas@knobel.gun.de</A></CODE> y es
el paquete incluido en el <EM>YaST</EM> de SuSE para la configuraci&oacute;n de la
impresora, as&iacute; como el que recomienda Pat Volkerding en su mensaje de
bienvenida a Slackware. Puede obtenerse de
<P>
<BLOCKQUOTE><CODE>
<PRE>
http://www.freebsd.org/~andreas/
</PRE>
</CODE></BLOCKQUOTE>
<P>El programa <EM>apsfilter</EM> ofrece las siguientes colas de impresi&oacute;n para
una computadora local:
<P>
<UL>
<LI><B>lp</B>: Cola est&aacute;ndar para todos los formatos de fichero.</LI>
<LI><B>lp-mono</B>: Se genera para las impresoras de color cuando ha de
imprimirse en blanco y negro. Procesa cualquier formato de fichero.</LI>
<LI><B>ascii</B>: Para imprimir ficheros de texto ASCII. </LI>
<LI><B>raw</B>: Para imprimir ficheros que ya tienen el formato espec&iacute;fico
de la impresora y por lo tanto no hay ning&uacute;n tipo de conversi&oacute;n.</LI>
</UL>
<P>El fichero <CODE>/etc/printcap</CODE> correspondiente a mi Epson Stylus Color
600, obtenido con <B>apsfilter</B>, es el siguiente (En SuSE 6.2 kernel
2.2.10):
<P>
<BLOCKQUOTE><CODE>
<PRE>
### BEGIN apsfilter: ### stcany.upp a4 color 360 ###
#   Warning: Configured for apsfilter, do not edit the labels!
#            apsfilter setup Thu Oct 14 01:30:42 CEST 1999
#
ascii|lp1|stcany.upp-a4-ascii-mono-360|stcany.upp a4 ascii mono 360:\
        :lp=/dev/lp0:\
        :sd=/var/spool/lpd/stcany.upp-a4-ascii-mono-360:\
        :lf=/var/spool/lpd/stcany.upp-a4-ascii-mono-360/log:\
        :af=/var/spool/lpd/stcany.upp-a4-ascii-mono-360/acct:\
        :if=/var/lib/apsfilter/bin/stcany.upp-a4-ascii-mono-360:\
        :la@:mx#0:\
        :tr=:cl:sh:
#
lp|lp2|stcany.upp-a4-auto-color-360|stcany.upp a4 auto color 360:\
        :lp=/dev/lp0:\
        :sd=/var/spool/lpd/stcany.upp-a4-auto-color-360:\
        :lf=/var/spool/lpd/stcany.upp-a4-auto-color-360/log:\
        :af=/var/spool/lpd/stcany.upp-a4-auto-color-360/acct:\
        :if=/var/lib/apsfilter/bin/stcany.upp-a4-auto-color-360:\
        :la@:mx#0:\
        :tr=:cl:sh:
#
lp-mono|lp3|stcany.upp-a4-auto-mono-360|stcany.upp a4 auto mono 360:\
        :lp=/dev/lp0:\
        :sd=/var/spool/lpd/stcany.upp-a4-auto-mono-360:\
        :lf=/var/spool/lpd/stcany.upp-a4-auto-mono-360/log:\
        :af=/var/spool/lpd/stcany.upp-a4-auto-mono-360/acct:\
        :if=/var/lib/apsfilter/bin/stcany.upp-a4-auto-mono-360:\
        :la@:mx#0:\
        :tr=:cl:sh:
#
raw|lp4|stcany.upp-a4-raw|stcany.upp a4 raw:\
        :lp=/dev/lp0:\
        :sd=/var/spool/lpd/stcany.upp-a4-raw:\
        :lf=/var/spool/lpd/stcany.upp-a4-raw/log:\
        :af=/var/spool/lpd/stcany.upp-a4-raw/acct:\
        :if=/var/lib/apsfilter/bin/stcany.upp-a4-raw:\
        :la@:mx#0:\
        :tr=:cl:sh:
#
### END   apsfilter: ### stcany.upp a4 color 360 ###
</PRE>
</CODE></BLOCKQUOTE>
<P>Despu&eacute;s de instalar el paquete <B>apsfilter</B>, la configuraci&oacute;n de la
impresora se lleva a cabo f&aacute;cilmente ejecutando el script <EM>SETUP</EM> que
encontraremos en el directorio <CODE>/var/lib/apsfilter</CODE> o
<CODE>/usr/lib/apsfilter</CODE>. <EM>SETUP</EM> nos ir&aacute; mostrando men&uacute;s de
opciones que seleccionaremos convenientemente, y al final nos escribir&aacute; el
fichero <CODE>/etc/printcap</CODE> como arriba aparece. Existe un fichero de
configuraci&oacute;n de <B>apsfilter</B> llamado <CODE>/etc/apsfilterrc</CODE> que
permite un mayor control del trabajo de los <EM>scripts</EM> de
<B>apsfilter</B> en el <EM>shell</EM>. Por ejemplo, <B>apsfilter</B> imprime los
ficheros ASCII del siguiente modo:
<P>
<OL>
<LI>Convierte el fichero ASCII a PS mediante <EM>a2ps</EM></LI>
<LI>El comportamiento de <EM>a2ps</EM> por defecto es imprimir el contenido
de 2 p&aacute;ginas ASCII en una p&aacute;gina apaisada</LI>
</OL>
<P>Esto no gusta a muchos usuarios que prefieren una salida «normal». Para
cambiar esto editaremos el fichero <CODE>/etc/apsfilterrc</CODE> y observaremos
que la variable <CODE>FEATURE</CODE> toma por defecto el valor <CODE>2n</CODE> («<EM>To print
two pages on one sheet without a header</EM>»). Debemos comentar (o borrar)
esa l&iacute;nea y a&ntilde;adir esta otra:
<P>
<BLOCKQUOTE><CODE>
<PRE>
FEATURE=1n
</PRE>
</CODE></BLOCKQUOTE>
<P>como se observa en este fragmento de mi fichero
<P>
<BLOCKQUOTE><CODE>
<PRE>
...
##############################################################################
# Description
# -----------
# FEATURE=1       tell a2ps to print 1 page  on one sheet with    header
# FEATURE=2       tell a2ps to print 2 pages on one sheet with    header
# FEATURE=1n      tell a2ps to print 1 page  on one sheet without header
# FEATURE=2n      tell a2ps to print 2 pages on one sheet without header
# FEATURE=1l      tell a2ps to print 1 pages in landscape with    header
# FEATURE=1ln     tell a2ps to print 1 pages in landscape without header
#
# This is the default I use now(the original default option was FEATURE=2n)
FEATURE=1n
...
</PRE>
</CODE></BLOCKQUOTE>
<P>Para suprimir por completo la conversi&oacute;n de ASCII a PS, e imprimir
directamente en el modo ASCII de la impresora, se debe quitar el s&iacute;mbolo
de comentario (#) al comienzo de la orden
<CODE>USE_RECODE_NOT_AP2S=yes</CODE>, y por supuesto haber instalado el
programa <EM>recode</EM>.
<P>
<H2><A NAME="ss5.3">5.3 Filtros de impresi&oacute;n Red Hat</A>
</H2>

<P>
<P>Red Hat cuenta con su propio sistema de configuraci&oacute;n de impresora
(<B>printtool</B>) y su propio sistema de filtros de impresi&oacute;n
(<CODE>/usr/lib/rhs/rhs-printfilters</CODE>), que incluye una herramienta de
configuraci&oacute;n visual y un administrador gr&aacute;fico de trabajos de impresi&oacute;n.
La configuraci&oacute;n de una impresora mediante <EM>printtool</EM> es muy sencilla y
puede hacerse sin muchos conocimientos sobre el sistema. El fichero
<CODE>/etc/printcap</CODE> para mi Epson Stylus Color 600 obtenido con
<EM>printtool</EM> es (En RedHat 6.0 kernel 2.2.7):
<P>
<BLOCKQUOTE><CODE>
<PRE>
#
# Please don't edit this file directly unless you know what you are doing!
# Be warned that the control-panel printtool requires a very strict format!
# Look at the printcap(5) man page for more info.
#
# This file can be edited with the printtool in the control-panel.
##PRINTTOOL3## LOCAL uniprint NAxNA a4 {} U_EpsonStylusColor stcany 0 
lp:\
        :sd=/var/spool/lpd/lp:\
        :mx#0:\
        :sh:\
        :lp=/dev/lp0:\
        :if=/var/spool/lpd/lp/filter:
</PRE>
</CODE></BLOCKQUOTE>
<P>El filtro de RedHat se parece m&aacute;s al de <B>magicfilter</B> que al de
<B>apsfilter</B> porque genera s&oacute;lo una cola de impresi&oacute;n para una
impresora &uacute;nica <CODE>lp</CODE>.
<P>
<HR>
<A HREF="Filtros-Impresion-Como-6.html">Página siguiente</A>
<A HREF="Filtros-Impresion-Como-4.html">Página anterior</A>
<A HREF="Filtros-Impresion-Como.html#toc5">Índice general</A>
</BODY>
</HTML>
