<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.7.4">
 <TITLE>COMO de Compatibilidad de Hardware con Linux: M&oacute;dems</TITLE>
 <LINK HREF="Compatibilidad-Hardware-Como-21.html" REL=next>
 <LINK HREF="Compatibilidad-Hardware-Como-19.html" REL=previous>
 <LINK HREF="Compatibilidad-Hardware-Como.html#toc20" REL=contents>
</HEAD>
<BODY>
<A HREF="Compatibilidad-Hardware-Como-21.html">Página siguiente</A>
<A HREF="Compatibilidad-Hardware-Como-19.html">Página anterior</A>
<A HREF="Compatibilidad-Hardware-Como.html#toc20">Índice general</A>
<HR>
<H2><A NAME="s20">20.</A> <A HREF="Compatibilidad-Hardware-Como.html#toc20">M&oacute;dems</A></H2>

<P>Todos los m&oacute;dems internos o externos conectados a un puerto serie deber&iacute;an de funcionar. Algunos fabricantes han creado m&oacute;dems que son s&oacute;lo compatibles con Windows 59. Mire el Ap&eacute;ndice E para ver el hardware incompatible con Linux. Adem&aacute;s, muchos m&oacute;dems actualizables v&iacute;a flash, s&oacute;lo disponen de estos programas para Win95/NT. Estos m&oacute;dems no se pueden actualizar bajo Linux.</P>
<P>Un peque&ntilde;o n&uacute;mero de m&oacute;dems vienen con software para DOS que cargan el
programa de control en ejecuci&oacute;n. Estos pueden ser usados cargando el
programa bajo DOS y haciendo un arranque en caliente. Sin embargo, estos
m&oacute;dems deben ser evitados ya que no podran ser usados con hardware no PC
en el futuro.</P>
<P>Todos los modems PCMCIA deber&iacute;an funcionar con los controladores PCMCIA.</P>
<P>Los modems Fax necesitan el apropiado software de fax para operar. Aseg&uacute;erese que la parte de fax de el m&oacute;dem soporta Clase 2 o Clase 2.0. Parece ser que para qualquier software de fax en Unix el soporte para Class 1.0 no est&aacute; disponible.</P>
<P>Una excepci&oacute;n a esto es el programa de Linux efax que soporte ambas clases, m&oacute;dems de Clase 1 y 2. En algunos casos puede haber unos pocos (menores) problemas t&eacute;cnicos con m&oacute;dems de Clase 1. Si tiene que elegir es recomendable elegir un m&oacute;dem de Clase 2.</P>
<P>
<UL>
<LI>Digicom Connection 96+/14.4+ - programde de descarga de c&oacute;digo DSP<BR>
<CODE>
<A HREF="ftp://metalab.unc.edu/pub/Linux/apps/serialcomm/smdl-linux.1.02.tar.gz">ftp://metalab.unc.edu/pub/Linux/apps/serialcomm/smdl-linux.1.02.tar.gz</A></CODE></LI>
<LI>Motorola ModemSURFR interno 56K. A&ntilde;ade un mont&oacute;n de lineas a RC.SERIAL para IRQ y puertos si no son est&aacute;ndr.</LI>
<LI>ZyXEL U-1496 series - ZyXEL 1.4, programa de control de modem/fax/voice<BR>
<CODE>
<A HREF="http://www.pe1chl.demon.nl/ZyXEL/ZyXEL-1.6.tar.gz">http://www.pe1chl.demon.nl/ZyXEL/ZyXEL-1.6.tar.gz</A></CODE></LI>
<LI>ZyXEL Elite 2864 series - programa de control de modem/fax/voice<BR>
<CODE>
<A HREF="http://www.pe1chl.demon.nl/ZyXEL/ZyXEL-1.6.tar.gz">http://www.pe1chl.demon.nl/ZyXEL/ZyXEL-1.6.tar.gz</A></CODE></LI>
<LI>ZyXEL Omni TA 128 - programa de control de modem/fax/voice<BR>
<CODE>
<A HREF="http://www.pe1chl.demon.nl/ZyXEL/ZyXEL-1.6.tar.gz">http://www.pe1chl.demon.nl/ZyXEL/ZyXEL-1.6.tar.gz</A></CODE></LI>
</UL>
</P>
<P>Tambi&eacute;n las tarjetas multim&oacute;dem est&aacute;n soportadas por Linux.
<UL>
<LI>Tarjeta multim&oacute;den Moreton Bay RAStel<BR>
Check <CODE>
<A HREF="http://www.moreton.com.au/linux.htm">http://www.moreton.com.au/linux.htm</A></CODE> para los drivers Linux.</LI>
</UL>
</P>
<P>El siguiente m&oacute;dem no est&aacute; soportado
<UL>
<LI>Aztech MDP3858 56.6 (PCI)</LI>
</UL>
</P>

<HR>
<A HREF="Compatibilidad-Hardware-Como-21.html">Página siguiente</A>
<A HREF="Compatibilidad-Hardware-Como-19.html">Página anterior</A>
<A HREF="Compatibilidad-Hardware-Como.html#toc20">Índice general</A>
</BODY>
</HTML>
