<HTML>
<HEAD>
<TITLE>Unidad ZIP: mini-COMO: Configuraci&oacute;n del kernel para la unidad ZIP</TITLE>
</HEAD>
<BODY>
<A HREF="ZIP-Como-2.html">Anterior</A>
<A HREF="ZIP-Como-4.html">Siguiente</A>
<A HREF="ZIP-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Configuraci&oacute;n del kernel para la unidad ZIP</A></H2>


<P>Para usar unidades ZIP con Linux, el kernel debe estar configurado para
dar el soporte correspondiente: en el caso de unidades SCSI, o paralelas,
son necesarios tres: soporte SCSI, soporte de discos SCSI y soporte para
la controladora que est&eacute; usando en el caso SCSI o para PPA en el caso
paralelo. Si es IDE, bastar&aacute; con soporte para unidades extra&iacute;bles ATAPI
(<CODE>IDE/ATAPI FLOPPY support</CODE>). </P>
<P>Si no est&aacute; familiarizado con la compilaci&oacute;n del kernel, deber&iacute;a ir al
directorio <CODE>/usr/src/linux</CODE> y estudiar el fichero <CODE>README</CODE>
que all&iacute; encontrar&aacute;
<SL>N del T:  Tambi&eacute;n dispones del Kernel-COMO,
comprueba la secci&oacute;n 
<A HREF="ZIP-Como-7.html#Grupos">Grupos</A></SL>
.  Tambi&eacute;n hay valiosa
informaci&oacute;n en el subdirectorio <CODE>Documentation</CODE> en versiones
recientes. </P>
<P>Debe empezar el proceso de compilaci&oacute;n del kernel con la configuraci&oacute;n del
mismo. Aqu&iacute;, identificar&aacute; los componentes espec&iacute;ficos del kernel que
necesita. <CODE>make config</CODE> es el m&eacute;todo tradicional, secuencial de
preguntas y respuestas de configuraci&oacute;n del kernel. </P>
<P>En kernels recientes
<SL>N del T: A partir de la versi&oacute;n
2.0</SL>
 hay nuevas alternativas:  <CODE>make menuconfig</CODE> hace lo
mismo con interfaz orientado por men&uacute;s, y <CODE>make xconfig</CODE> usa el kit
<EM>tk</EM> para mostrar men&uacute;s bajo X. </P>
<P>Una vez haya configurado el kernel, use <CODE>make dep</CODE>, <CODE>make
clean</CODE> y <CODE>make zlilo</CODE> (o <CODE>make zImage</CODE> si no usa
<EM>LILO</EM>) para compilar el nuevo kernel e instalarlo, y por supuesto,
¡no olvide reiniciar el sistema!.</P>
<P>Tambi&eacute;n puede compilar todo o parte del sistema SCSI como m&oacute;dulos. Si hace
esto, adem&aacute;s de los comandos anteriores, deber&aacute; hacer <CODE>make modules; make modules_install</CODE>. Aseg&uacute;rese de cargar <CODE>scsi_mod.o</CODE>,
entonces <CODE>sd_mod.o</CODE> y finalmente el driver de su controladora,
antes de acceder a la unidad ZIP SCSI
<SL>N de los T:  Generalmente,
de esto se encarga el sistema de forma transparente si previamente se han
computado las dependencias entre m&oacute;dulos, (<CODE>depmod -a</CODE> al arrancar)  al
cargar m&oacute;dulos semi-manualmente con el comando <CODE>modprobe</CODE>, o mejor a&uacute;n,
autom&aacute;ticamente si se usa <CODE>kerneld</CODE></SL>
.</P>

<H2><A NAME="ss3.1">3.1 Configuraci&oacute;n del kernel para la unidad IDE</A></H2>


<P>Para dar soporte espec&iacute;fico a esta unidad, lo &uacute;nico necesario es incluir
soporte en el kernel para ella en la secci&oacute;n de configuraci&oacute;n del kernel
<CODE>Floppy, IDE, and other block devices</CODE>, en el apartado <CODE>Include
IDE/ATAPI FLOPPY support</CODE>. </P>
<P>Dependiendo de la configuraci&oacute;n de la unidad, su nombre de
dispositivo ser&aacute; de la forma <CODE>hdX</CODE>, en donde <CODE>X</CODE> ser&aacute;:</P>
<P>
<UL>
<LI><CODE>a</CODE>: Unidad maestra del canal IDE primario (muy raramente, ya que
ah&iacute; normalmente estar&aacute; nuestro disco duro)</LI>
<LI><CODE>b</CODE>: Unidad esclava del canal IDE primario</LI>
<LI><CODE>c</CODE>: Unidad maestra del canal IDE secundario</LI>
<LI><CODE>d</CODE>: Unidad esclava del canal IDE secundario</LI>
</UL>
</P>
<P>Lo cual comprobaremos al arrancar, por el mensaje del kernel en el
registro del sistema (<CODE>/var/log/messages</CODE>): </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
hdX: IOMEGA ZIP 100 ATAPI, ATAPI FLOPPY drive
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En cuanto a gesti&oacute;n de los discos, aplica exactamente lo mismo que para el
resto de unidades, con la salvedad de que nos referiremos a ellos como
<CODE>hdX</CODE> en lugar de <CODE>sdX</CODE>. </P>
<P>Una vez comprendidos estos t&eacute;rminos, puede saltar directamente a la
secci&oacute;n 
<A HREF="ZIP-Como-4.html#uso">uso</A>.       </P>


<H2><A NAME="aha152x"></A> <A NAME="ss3.2">3.2 Versi&oacute;n SCSI </A></H2>


<P>Si ya tiene un disco SCSI en el sistema, y est&aacute; conectando la unidad ZIP a
la misma controladora, no hay necesidad de configurar el kernel. Si no,
tendr&aacute; que compilar un nuevo kernel.</P>
<P>Si compila el kernel para soportar la versi&oacute;n SCSI de la unidad ZIP, debe
seleccionar soporte SCSI y soporte de discos SCSI. Tambi&eacute;n debe
seleccionar un driver para la controladora que usar&aacute;. Si tiene la
controladora ZIP Zoom, seleccione el driver <CODE>aha152x</CODE>. </P>
<P>Aseg&uacute;rese de leer la documentaci&oacute;n de la controladora en el SCSI HOWTO y
cualquier fichero <CODE>README</CODE> en el subdirectorio
<CODE>drivers/scsi</CODE> del directorio ra&iacute;z de los fuentes de Linux. Preste
atenci&oacute;n a l&iacute;nea de par&aacute;metros que tendr&aacute; que usar para ayudar al kernel a
inicializar la controladora.</P>
<P>Por ejemplo, si est&aacute; usando la controladora ZIP Zoom, tendr&aacute; que a&ntilde;adir
algo como</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        aha152x=0x340,11,7,1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>al arrancar (o incluirlo en el fichero <CODE>/etc/lilo.conf</CODE> mediante la
cl&aacute;usula <CODE>append</CODE> (=a&ntilde;adir) ). Esto le dice al driver la direcci&oacute;n del
puerto y la <CODE>IRQ</CODE> de su tarjeta ZIP Zoom. Aseg&uacute;rese de usar los
par&aacute;metros que corresponden a la selecci&oacute;n de los <I>jumpers</I>, que son
por defecto IRQ 11 y direcci&oacute;n base 0x340. El tercer y cuarto par&aacute;metro
son asumidos por el <I>driver</I> en su configuraci&oacute;n por defecto, adem&aacute;s de
ser lo recomendable. </P>
<P>Si por el contrario, prefiere (y es lo m&aacute;s c&oacute;modo adem&aacute;s de recomendable) 
compilar soporte modularmente, y hacer uso de las ventajas de la
carga-descarga autom&aacute;tica de m&oacute;dulos mediante <CODE>kerneld</CODE>, deber&aacute; a&ntilde;adir
lo siguiente en el fichero <CODE>/etc/conf.modules</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
alias scsi_hostadapter aha152x
options aha152x aha152x=0x340,11,7,1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>S&iacute;, la l&iacute;nea <CODE>options aha152x aha152x=0x340,11,7,1</CODE> es correcta,
<B>ha</B> de aparecer <B>dos veces</B> el t&eacute;rmino <CODE>aha152x</CODE>. </P>
<P>Tras hacer esto, reinicie el sistema si no lo hizo al compilar el kernel,
o ejecute</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
depmod -a
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para que se genere la base de datos de dependencias entre m&oacute;dulos. </P>
<P>Se asume que la controladora est&aacute; con la configuraci&oacute;n que trae de f&aacute;brica
por defecto. Otras posibilidades (configurables por <EM>jumpers</EM> en la
propia controladora) son: </P>
<P>
<UL>
<LI>IRQs: 9, 10, 12.</LI>
<LI>IOs: 0x140 </LI>
</UL>
</P>
<P>Tambi&eacute;n debe leer el <EM>BOOTPROMPT HOWTO</EM> de Paul Gortmaker para
informaci&oacute;n sobre c&oacute;mo configurar el kernel con <EM>LILO</EM> o
<EM>LOADLIN</EM>. </P>


<H2><A NAME="ss3.3">3.3 Driver <CODE>PPA</CODE> para 1.2.13</A></H2>


<P>Si quiere usar la unidad ZIP de puerto paralelo con el kernel versi&oacute;n
1.2.13
<SL>N del Revisor <BR> Actualmente obsoleto</SL>
, debe
conseguir la versi&oacute;n 0.18 del driver que esta disponible v&iacute;a ftp an&oacute;nimo
en <CODE>
<A HREF="ftp://gear.torque.net/pub/ppa.c">ftp://gear.torque.net/pub/ppa.c</A></CODE></P>
<P>Las instrucciones de instalaci&oacute;n, as&iacute; como c&oacute;mo compilar el driver como
m&oacute;dulo cargable est&aacute;n inclu&iacute;das en el fichero fuente <CODE>ppa.c</CODE>. </P>
<P>Tendr&aacute; casi con toda seguridad que compilar un nuevo kernel. En
particular, ninguno de los kernels pre-compilados de <EM>Slackware</EM>
funcionar&aacute;n con <CODE>ppa</CODE>.</P>
<P>Sea cuidadoso al compilar el kernel con soporte SCSI y soporte de discos
SCSI, pero no incluya soporte del driver de impresora <CODE>lp</CODE>.  En el
1.2.13, los drivers no pueden co-existir en el mismo kernel.</P>
<P>Puede ajustar el n&uacute;mero del puerto y algunos par&aacute;metros de reloj con el
comando <CODE>insmod</CODE> cuando cargue el driver <CODE>ppa</CODE>.  Estos ajustes
est&aacute;n documentados en el fichero <CODE>ppa.c</CODE>.  Por defecto la unidad
asume que la unidad ZIP esta conectada al puerto paralelo en la direcci&oacute;n
<CODE>0x378</CODE>.</P>
<P>No habr&aacute; ninguna mejora a este driver para el kernel 1.2.13.  Se espera
que desaparezca unos meses despu&eacute;s de la salida del kernel 2.0 y las
principales distribuciones empiecen a usarlo. </P>


<H2><A NAME="ss3.4">3.4 El driver PPA en kernels actuales</A></H2>


<P>Desde la versi&oacute;n 1.3.74 el driver <CODE>ppa</CODE> ha sido una parte est&aacute;ndar del
kernel.  Hubo algunos cambios a otras partes del kernel alrededor de la
versi&oacute;n 1.3.78 que requer&iacute;an ciertas mejoras internas, pero desde 1.3.85
el driver ha sido completamente estable en su versi&oacute;n 0.26. Espero que la
versi&oacute;n 0.26 est&eacute; en la pr&oacute;xima versi&oacute;n estable del kernel. </P>
<P>Para compilar el kernel con soporte <CODE>ppa</CODE>, ha de incluirse soporte
SCSI, soporte de discos SCSI y seleccionar de la lista de controladoras
SCSI de bajo nivel (<I>low-level</I>) soporte para Iomega ZIP / PPA-3. 
Tambi&eacute;n puede compilar el driver como m&oacute;dulo. </P>
<P>Puede usar la l&iacute;nea de par&aacute;metros en <CODE>/etc/lilo.conf</CODE> o con
<CODE>insmod</CODE> para cargar el driver. Todo esto est&aacute; documentado en
<CODE>drivers/scsi/README.ppa</CODE> en la estructura del fichero fuente del
kernel. He inclu&iacute;do un sumario en la siguiente secci&oacute;n. </P>
<P>Si quiere usar tanto el driver <CODE>lp</CODE> como <CODE>ppa</CODE> en el mismo
puerto paralelo, tendr&aacute; que compilar ambos como m&oacute;dulos y cargar uno u
otro en cualquier momento, pero nunca los dos a la vez. </P>
<P>Las prestaciones de Linux en cuanto a m&oacute;dulos cargables se tornan cada vez
m&aacute;s potentes, y por tanto, m&aacute;s complejas d&iacute;a a d&iacute;a. Deber&iacute;a leer el
fichero <CODE>Documentation/modules.txt</CODE> en el &aacute;rbol de directorios de
los fuentes del kernel como punto de partida. </P>


<H2><A NAME="ss3.5">3.5 PPA: par&aacute;metros en la l&iacute;nea de comandos</A></H2>


<P>Si ha compilado <CODE>ppa</CODE> dentro del kernel, puede ajustar sus
par&aacute;metros desde la <EM>l&iacute;nea de comando</EM> del <CODE>LILO</CODE> o <CODE>LOADLIN</CODE>
con la siguiente sintaxis:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ppa=base[,speed_high[,speed_low[,nybble]]] 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Donde <CODE>base</CODE> es la direcci&oacute;n i/o del puerto paralelo,
<CODE>speed_high</CODE> es una constante de temporizaci&oacute;n para ciertos bucles
r&aacute;pidos del driver, <CODE>speed_low</CODE> es un par&aacute;metro de temporizaci&oacute;n
similar para otros m&aacute;s lentos, y <CODE>nybble</CODE> es un indicativo para
forzar al driver a usar 4-bit, o modo <I>nybble</I>, incluso si el
controlador quisiera hacerlo de otro modo. </P>
<P>Por ejemplo, por defecto podr&iacute;a ser especificado como:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ppa=0x378,1,6,0
</PRE>
</CODE></BLOCKQUOTE>
</P>


<HR>
<A HREF="ZIP-Como-2.html">Anterior</A>
<A HREF="ZIP-Como-4.html">Siguiente</A>
<A HREF="ZIP-Como.html#toc3">Indice</A>
</BODY>
</HTML>
