<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Diald Como: Descripci&oacute;n r&aacute;pida del funcionamiento de Diald</TITLE>
 <LINK HREF="Diald-Como-4.html" REL=next>
 <LINK HREF="Diald-Como-2.html" REL=previous>
 <LINK HREF="Diald-Como.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="Diald-Como-4.html">Página siguiente</A>
<A HREF="Diald-Como-2.html">Página anterior</A>
<A HREF="Diald-Como.html#toc3">Índice general</A>
<HR>
<H2><A NAME="s3">3. Descripci&oacute;n r&aacute;pida del funcionamiento de Diald</A></H2>

<P>
<P>En pocas palabras, <EM>Diald</EM> lo que hace es generar un interfaz de red
nuevo y establecerlo como ruta por defecto. Este interfaz no es real (en
la documentaci&oacute;n original lo llaman <CODE>proxy interface</CODE>). <EM>Diald</EM>
monitoriza este interfaz y cuando llegan paquetes hacia &eacute;l, lanza la
conexi&oacute;n <CODE>ppp</CODE>, espera a que se establezca y cambia la direcci&oacute;n de la
ruta por defecto sobre la nueva interface <CODE>ppp</CODE> (normalmente
<CODE>ppp0</CODE>).
<P><EM>Diald</EM> controla qu&eacute; paquetes han llegado al interface y de qu&eacute; tipo
para decidir si los considera a efectos de lanzar la conexi&oacute;n <CODE>ppp</CODE>,
mantenerla activa, hacerla caer o no hacer nada, y en caso de que hayan
sido paquetes para tener en cuenta, cu&aacute;nto tiempo debe estar levantado el
interface despu&eacute;s de que haya llegado el paquete.
<P>Finalmente, si no hay m&aacute;s tr&aacute;fico y se acaba el tiempo de espera que el
&uacute;ltimo de los paquetes enviados estableci&oacute;, <EM>Diald</EM> finaliza la
conexi&oacute;n.
<P>Asimismo, es posible controlar los d&iacute;as y horas a los que se puede
conectar y los que no, de modo que se puedan aprovechar tarifas bajas u
horarios de bajo tr&aacute;fico.
<P>Hasta aqu&iacute;, la descripci&oacute;n es v&aacute;lida tanto para la versi&oacute;n 0.16.5 de
<EM>Diald</EM> como para las posteriores, pero las versiones posteriores a
esta tambi&eacute;n incluyen funcionalidades adicionales, tales como lista de
permisos para decidir a qu&eacute; usuarios se aplican las normas que deciden si
el enlace se levanta, se mantiene o se tira, contabilizaci&oacute;n avanzada de
paquetes transmitidos, mejor integraci&oacute;n con lineas RDSI, mejora de
rendimiento en base a usar como interfaz proxy un dispositivo
<CODE>ethertap</CODE> (algo as&iacute; como un interfaz de red que lee/escribe sobre
un socket en vez de una tarjeta de red f&iacute;sica) en vez de <CODE>slip</CODE>,
conexiones de backup y algunas otras funcionalidades.
<P>
<HR>
<A HREF="Diald-Como-4.html">Página siguiente</A>
<A HREF="Diald-Como-2.html">Página anterior</A>
<A HREF="Diald-Como.html#toc3">Índice general</A>
</BODY>
</HTML>
