<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="SoftwareDevelopment">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf197, SoftwareDevelopment: Rese&ntilde;a bibliogr&aacute;fica: Beginning Linux Programming - Segunda edici&oacute;n</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Katja     Socher
 =LF=CAT___: SoftwareDevelopment
 =LF=TITLE_: Rese&ntilde;a bibliogr&aacute;fica: Beginning Linux Programming - Segunda edici&oacute;n
 =LF=NUMBER: 197
 =LF=ANAME_: article197.html
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/katjasocher.gif" alt=
    "[Photo of the Author]" height="148" width="120">
<BR>por  Katja Socher <br> <small>&lt;katja(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<P>Katja es la editora alemana de LinuxFocus. Comenz&oacute; a usar Linux
    cuando descubri&oacute; Gimp hace algunos a&ntilde;os. Puede visitar su
    p&aacute;gina personal en <A href=
    "http://www.toppoint.de/~utuxfan/k/">here</A>.</P>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
David Gonz&aacute;lez Fern&aacute;ndez <small>&lt;parmeno(at)wanadoo.es&gt;</small>
<br>
<!--
 =LF=TRANSTO=es: David Gonz&aacute;lez Fern&aacute;ndez
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#197lfindex0">El libro</A></LI>
  <LI><A HREF="#197lfindex1">Sinopsis</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=197">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Rese&ntilde;a bibliogr&aacute;fica: Beginning Linux Programming - Segunda edici&oacute;n</H2>
 <IMG src="../../common/images/tuxreading.gif" alt="[tuxreading]"
    vspace="10" hspace="10" height="116" width="100">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->

    Se trata de una rese&ntilde;a del libro:
    <BR>Beginning Linux Programming -
    Second Edition<BR>
    escrito por Richard Stones y Neil Matthew<BR>
    y publicado por Wrox press

    
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


    <TABLE border="0">
      <TR>
        <TD>
          <A NAME="197lfindex0">&nbsp;</A>
<H2>El libro</H2>

          "Beginning Linux Programming - Second Edition" es una
	  introducci&oacute;n a la progaramaci&oacute;n en Linux para programadores
	  con experiencia en C, que ya dispongan de ciertos conocimientos
	  b&aacute;sicos sobre este sistema operativo. El libro cubre los conceptos
	  e ideas que el entorno de programaci&oacute;n de Linux ofrece a los
	  programadores y, adem&aacute;s, introduce al lector en el uso de varias
	  excelentes herramientas para la programaci&oacute;n, disponibles en Linux,
          como son Perl, Tk o Gtk+.
        </TD>
      </TR>
    </TABLE>
    <BR>
    <IMG src="../../common/images/illustration197.gif" alt=
    "[Book cover]" hspace="10" height="151" width="120" align="right">

    <P>Comprar el libro no s&oacute;lo le proporcionar&aacute; unos 2Kg. de papel,
    sino tambi&eacute;n un mont&oacute;n de infomaci&oacute;n sobre un gran n&uacute;mero de temas.
    No es un libro para principiantes, m&aacute;s bien es el comienzo de un amplio
    espectro de conceptos y herramientas relativas al campo de la
    programaci&oacute;n en Linux. Cada cap&iacute;tulo proporciona una completa introducci&oacute;n
    de forma que, tras leerlo, habr&aacute; adquirido una importante cantidad de
    conocimientos sobre cada uno de los temas tratados, y ser&aacute; capaz
    de resolver un mont&oacute;n de tareas usted mismo. Naturalmente no se
    convertir&aacute; en un experto en cada uno de los conceptos depu&eacute;s de leer
    el libro pero, usualmente, ser&aacute; suficiente y, en cualquier caso,
    estar&aacute; capacitado para manejarse con los manuales u otra documentaci&oacute;n
    que ser&aacute; mucho m&aacute;s actual que un libro dedicado a un asunto de
    evoluci&oacute;n tan r&aacute;pida.</P>

    <P>Los autores nos explican que se puede hacer mejor con una herramienta
    en particular y en que tarea cada herramienta es especialmente buena
    y eficiente. Obtendr&aacute; ideas sobre lo que es posible hacer y sabr&aacute; que
    &uacute;til emplear y donde profundizar m&aacute;s para encontrar la soluci&oacute;n que
    necesita.</P>

    <P>Obtendr&aacute; una buena visi&oacute;n general de las muchas posibilidades que
    tiene como programador en Linux y podr&aacute; decidir entonces que cuesti&oacute;n
    merece una cantidad mayor de tiempo, que tiene m&aacute;s importancia para usted
    en vista a realizar un estudio m&aacute;s exhaustivo para llegar a ser un
    aut&eacute;ntico experto.</P>

    <P>A&uacute;n siendo s&oacute;lo una introducci&oacute;n dispone de tantos contenidos que,
    tras leerlo, querra usarlo a menudo como referencia cuando busque
    soluciones a problemas de programaci&oacute;n o la manera implementarlas.</P>

    <P>Claramente se trata de un libro hecho por programadores para
    programadores: dos programadores de Linux muy experimentados
    comparten sus conocimientos con otros programadores. Lo hacen por
    medio de  una gran cantidad de ejemplos de prueba explicados en
    gran detalle. A trav&eacute;s de estos ejemplos se meter&aacute; m&aacute;s facilmente
    en faena y ver&aacute; como las ideas y conceptos explicados pueden
    implementarse de forma pr&aacute;ctica. A menudo encontrar&aacute; que puede usar
    los ejemplos para sus propios programas tal cual, o con unos cambios
    m&iacute;nimos. Personalmente, yo recib&iacute; con agrado los ejemplos, y me
    ayudaron a entender y explorar el material del libro.</P>

    <P>Am&eacute;n de los abundantes ejemplos en cada uno de los cap&iacute;tulos
    los autores desarrollan una aplicaci&oacute;n CD a lo largo del libro
    en la que los nuevos conceptos aprendidos son implementados. Cap&iacute;tulo
    a cap&iacute;tulo la aplicaci&oacute;n aumenta en complejidad y prestaciones.
    Realmente apreci&eacute; bastante una aplicaci&oacute;n completamente implementada
    como esta que, adem&aacute;s, es explicada con detalle.</P>

    <A NAME="197lfindex1">&nbsp;</A>
<H2>Sinopsis</H2>


    <P>El libro comienza con una breve introducci&oacute;n sobre Linux y su
    filosof&iacute;a y el uso de C y sus librer&iacute;as bajo Linux antes de derivar
    en la programaci&oacute;n shell. Despu&eacute;s de mostrar unos conceptos generales
    del shell (como redireccionamiento y tuber&iacute;as) el libro nos presenta
    el shell como un lenguaje de programaci&oacute;n y conceptos como por ejemplo
    variables, condiciones, control del flujo del programa, listas, funciones,
    y "here documents" son explicados.</P>

    <P>El cap&iacute;tulo 3 explica el concepto de ficheros en Linux donde todo,
    incluidos los dispositivos f&iacute;sicos, es tratado como un fichero. Comienza
    las llamadas al sistema de bajo nivel y a lo largo del cap&iacute;tulo los autores
    explican la librer&iacute;a estandar de entrada/salida (Standard I/O library).</P>

    <P>El cap&iacute;tulo 4 se detiene en el entorno Linux. Los autores por ejemplo
    hablan sobre los argumentos de la l&iacute;nea de comandos y las variables de
    entorno con los que se puede variar el comportamiento por defecto de un
    programa. Tambi&eacute;n muestran como un programa puede hacer uso de funciones
    de librer&iacute;a para manipular la fecha y los valores temporales as&iacute; como
    para obtener informaci&oacute;n sobre si mismo, el usuario y la computadora
    en que est&aacute; corriendo.</P>

    <P>El siguiente cap&iacute;tulo trata sobre las terminales y diferentes
    aspectos sobre su control. Despu&eacute;s de esta introducci&oacute;n a las
    terminales aprenderemos cosas de la librer&iacute;a "curses" que ofrece
    un modo para mostrar resultados en una ventana de terminal de
    manera gr&aacute;fica.</P>

    <P>El cap&iacute;tulo 7, relativo al manejo de datos, habla sobre la gesti&oacute;n
    de la memoria din&aacute;mica, bloqueo de ficheros y de regiones de archivos
    compartidos y, finalmente hace una introducci&oacute;n a la base de datos dbm.</P>

    <P>En el cap&iacute;tulo 8 se introducen las herramientas de desarrollo que
    que facilitan el desarrollo y distribuci&oacute;n de los programas. Primero
    make y makefile para gestionar multiples ficheros fuente son explicadas
    para, a continuaci&oacute;n, pasar al control del c&oacute;digo fuente mediante el uso
    de RCS y CVS. Por &uacute;ltimo se hace menci&oacute;n a patch, tar y gzip que se usan
    para distribuir y actualizar los programas.</P>

    <P>El cap&iacute;tulo 9 trata la depuraci&oacute;n de c&oacute;digo. Despu&eacute;s de comentar t&eacute;cnicas
    generales de depuraci&oacute;n se presenta el depurador GNU gdb. Se habla tambi&eacute;n
    de herramientas de an&aacute;lisis est&aacute;tico como cflow y lclint. Finaliza el cap&iacute;tulo
    con Electric Fence y Checker, dos utilidades que ayudan a prevenir lagunas
    de memoria.</P>

    <P>El cap&iacute;tulo 10  se refiere a los procesos y se&ntilde;ales que controlan casi
    todas las actividades llevadas a cabo por un sistema linux. Empieza con
    la estructura de un proceso y seguidamente explica como se puede crear un
    nuevo proceso usando la llamada al sistema fork. Despu&eacute;s de esto unos cuantos
    ejemplos introducen la interfaz de programaci&oacute;n para las se&ntilde;ales.</P>

    <P>El cap&iacute;tulo 11 hace referencia a los hilos del estandar Posix. Empieza
    explicando la diferencia entre hilo y proceso y despu&eacute;s introduce los
    mutexes y sem&aacute;foros necesarios para escribir programas multihilo m&aacute;s complejos.</P>

    <P>Los siguientes cap&iacute;tolos son relaticos a la comunicaci&oacute;n entre procesos.
    Primero se explican las tuber&iacute;a. Tuber&iacute;as an&oacute;nimas normales, tuberias con nombre
    (FIFOs) y el paso de datos entre procesos no relacionados se explican.</P>

    <P>Despu&eacute;s se cubren los sem&aacute;foros, la memoria compartida y las colas de
    mensajes. Los sem&aacute;foros son necesarios para evitar que dos hilos o procesos
    accedan a una secci&oacute;n cr&iacute;tica a la vez y en el uso de memoria compartida
    que es una forma eficiente de compartir e intercambiar datos entre
    m&uacute;ltiples procesos. Las colas de mensajes proveen un medio razonablemente
    sencillo y eficiente para intercambiar datos entre dos processos no relacionados.</P>

    <P>Para terminar se explican los sockets que se pueden usar como las tuber&iacute;as
    funcionando en una red.</P>

    <P>El cap&iacute;tulo 15 cubre Tcl: Tool Command Language. Los autores
    por ejemplo hablan sobre las &oacute;rdenes y las estructuras de control,
    cadenas y listas en Tcl, entrada y salida adem&aacute;s de las ampliaciones
    y aplicaciones de Tcl.</P>

    <P>Tras una breve vista general de X aprenderemos sobre Tk, El kit
    de herramientas gr&aacute;ficas para Tcl en el pr&oacute;ximo cap&iacute;tulo. Se nos presentan
    los widgets que ofrece Tk como marcos, etiquetas, botones, cajas, barras de
    desplaczamientp, escalas, texto y paneles. Se da un ejemplo con un
    puzzle compuesto por una imajen dividida en 15 piezas  y los conceptos
    de men&uacute;s, di&aacute;logos, esquemas de colores, fuentes, "binding", manejo de la
    geometr&iacute;a y foco y navegaci&oacute;n son explicados.</P>

    <P>A continuaci&oacute;n aprenderemos sobre Gnome y Gtk+. Veremos la arquitectura
    de Gnome y su escritorio, programaci&oacute;n para Gnome usando Gtk+
    y el conjunto de widgets de Gtk+. Las posibilidades son enormes e incluso
    mayores que con TK. Los autores tambi&eacute;n desarrollan
    una aplicaci&oacute;n para Gnome: un reloj anal&oacute;gico Gnome.</P>

    <P>El siguiente cap&iacute;tulo es una introducci&oacute;n muy breve a la programaci&oacute;n
    b&aacute;sica en Perl.</P>

    <P>El cap&iacute;tulo 19 nos ense&ntilde;a las bases del HTML y sirve de
    introducci&oacute;n a la programaci&oacute;n CGI que se trata en el siguiente
    c&aacute;pitulo. aqu&iacute; los autores nos dicen como crear los formularios en HTML
    necesarios en el lado del cliente y despu&eacute;s como transmitir la
    informaci&oacute;n al servidor, decodificarla en C o Perl y dar respuesta de
    forma din&aacute;mica al cliente.</P>

    <P>El libro termina con un cap&iacute;tulo sobre los controladores de los
    dispositivos f&iacute;sicos que aporta una vista general de como se escriben.
    Habla por ejemplo de los dispositivos de caracteres y los de bloques
    as&iacute; como de la manera de depurar c&oacute;digo en el n&uacute;cleo.</P>

    <P>Si es usted un administrador de sistemas, un programador o un
    aut&eacute;ntico amante de Linux seguramente adorar&aacute; el libro.</P>
    <!-- vim: set sw=2 ts=2 et: -->
  










<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=197"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Katja     Socher, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Katja Socher <small>&lt;katja(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: David Gonz&aacute;lez Fern&aacute;ndez &lt;parmeno(at)wanadoo.es&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2003-01-01, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
