<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Vesafb Mini-COMO: ¿C&oacute;mo activo los drivers vesafb?</TITLE>
 <LINK HREF="Vesafb-Mini-Como-5.html" REL=next>
 <LINK HREF="Vesafb-Mini-Como-3.html" REL=previous>
 <LINK HREF="Vesafb-Mini-Como.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="Vesafb-Mini-Como-5.html">Página siguiente</A>
<A HREF="Vesafb-Mini-Como-3.html">Página anterior</A>
<A HREF="Vesafb-Mini-Como.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4. ¿C&oacute;mo activo los drivers vesafb?</A></H2>

<P>
<P>(nota: La informaci&oacute;n esta basada en lo que s&eacute; y he logrado usando el
n&uacute;cleo de Linux <CODE>2.1.112</CODE> en un P75+ con una tarjeta gr&aacute;fica ATI
VideoExpress 2MB. No dude en enviarme un email con informaci&oacute;n o casos
especiales para tarjetas gr&aacute;ficas diferentes).
<P>Asumiendo que usa <CODE>menuconfig</CODE> necesitar&aacute; realizar los siguientes
pasos:
<P>Entre en la secci&oacute;n <I>Code Maturity Level</I> del men&uacute;, y habilite la
opci&oacute;n para desarrollo y/o drivers incompletos (<I>Development and/or
Incomplete Drivers</I>) (nota: esto puede cambiar para n&uacute;cleos futuros; 
cuando esto suceda, este HOWTO ser&aacute; revisado).
<P>Entre en el submen&uacute; de dispositivos de consola (<I>Console
Drivers</I>), y habilite lo siguiente: 
<P>
<UL>
<LI> </LI>
<LI><I>VGA Text Console</I></LI>
<LI><I>Video Selection Support</I></LI>
<LI><I>Support for frame buffer devices (experimental)</I></LI>
<LI><I>VESA VGA Graphic console</I></LI>
<LI><I>Advanced Low Level Drivers</I></LI>
<LI><I>Select Mono, 2bpp, 4bpp, 8bpp, 16bpp, 24bpp y 32bpp packed</I></LI>
<LI><I>Pixel drivers</I></LI>
<LI><I>VGA character/attributes support</I></LI>
</UL>
<P><I>VGA Chipset Support (text only)</I> (<CODE>vgafb</CODE>) era parte de la
lista anterior, pero ha sido eliminado ya que est&aacute; obsoleto y no ser&aacute;
soportado. Se eliminar&aacute; en breve. Use <I>VGA Text Console</I> en su
lugar.  
<P>Aseg&uacute;rese de que <I>Mac variable bpp packed pixel support</I> no est&aacute;
habilitado (A partir del <CODE>2.1.111</CODE>, esto parece habilitarse si los
<I>Advanced Low Level Drivers</I> son seleccionados inicialmente). 
Aseg&uacute;rese de que no sean m&oacute;dulos (No es seguro que sea posible compilarlos
todav&iacute;a como m&oacute;dulos; por favor corr&iacute;jame si me equivoco en esto).
<P>A continuaci&oacute;n, recompile el n&uacute;cleo, modifique el fichero
<CODE>/etc/lilo.conf</CODE> de modo que incluya el par&aacute;metro <CODE>VGA=ASK</CODE>,
y ejecute (instalando) <CODE>lilo</CODE>, esto permitir&aacute; seleccionar el modo
deseado en el momento de arrancar.
<P>Reinicie, y como prueba, introduzca la entrada <CODE>0301</CODE> tras la
solicitud VGA (esto le dar&aacute; una resoluci&oacute;n de 640x480 a 256 colores), y
deber&aacute; verse un logotipo con un peque&ntilde;o Ping&uuml;ino durante el arranque.
<P>Una vez que pueda ver esto funcionando, puede explorar los distintos modos
VESA (ver abajo) y decidir cu&aacute;l es el que m&aacute;s le gusta, fije el par&aacute;metro
"<CODE>VGA=x</CODE>" en el fichero <CODE>/etc/lilo.conf</CODE>.  Cuando haya
escogido el que m&aacute;s le guste, consulte el valor decimal equivalente de las
tablas siguientes y use el n&uacute;mero decimal correspondiente (es decir, para
una resoluci&oacute;n de 1280x1024 a 256 colores, debe usar el valor
"<CODE>VGA=775</CODE>"), y reejecutar <CODE>lilo</CODE>. Esto es todo!.
<P>Para referencias m&aacute;s extensas, leer los documentos relacionados con
LoadLin y LILO.
<P>
<HR>
<A HREF="Vesafb-Mini-Como-5.html">Página siguiente</A>
<A HREF="Vesafb-Mini-Como-3.html">Página anterior</A>
<A HREF="Vesafb-Mini-Como.html#toc4">Índice general</A>
</BODY>
</HTML>
