<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges Tarbouriech
 =LF=CAT___: System Administration
 =LF=TITLE_: A trav&eacute;s del t&uacute;nel
 =LF=NUMBER: 202
 =LF=ANAME_: article202.html
 -->
 <TITLE>lf202, System Administration: A trav&eacute;s del t&uacute;nel</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="[Photo of the Author]" HEIGHT=124 WIDTH=115>
<BR>por  Georges Tarbouriech <br> <small>&lt;georges.t(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Georges es un usuario viejo de Unix (comercial o libre). Le interesa mucho la
seguridad y quiere agradecer a la comunidad del software libre su estupendo
trabajo en &eacute;ste asunto.
</P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Georges Tarbouriech <small>&lt;georges.t(at)linuxfocus.org&gt;</small>
<br>
Javier Palacios [proof read] <small>&lt;javier.pb(at)linuxfocus.org&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#202lfindex0">?Por qu&eacute; usar ssh?</A></LI>
  <LI><A HREF="#202lfindex1">SSH y VNC</A></LI>
  <LI><A HREF="#202lfindex2">SSH y MySQL</A></LI>
  <LI><A HREF="#202lfindex3">SSH y emulaci&oacute;n de terminal</A></LI>
  <LI><A HREF="#202lfindex4">A donde ir desde aqu&iacute;?</A></LI>
  <LI><A HREF="#202lfindex5">¡Por fin, se acab&oacute;!</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=202&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>A trav&eacute;s del t&uacute;nel</H2>
 <IMG SRC="../../common/images/illustration202.gif" HSPACE=10 >
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<p><a href="http://www.ssh.com">SSH</a>, el "secure shell" es un producto
comercial muy bueno. No obstante, hay varias versiones libres de ssh, clientes o
servidores, disponibles para Unix (comercial o libre) o para otros SO.
El m&aacute;s conocido es OpenSSH, disponible en
<a href="http://www.openssh.org">http://www.openssh.org</a>. Desde este sitio,
pueden encontrar alternativas para sistemas Unix, Windows, Mac... Para
productos tales como Windows, s&oacute;lo encontrar&aacute;n clientes libres.
</p><p>
En este art&iacute;culo, presentamos unos ejemplos con la manera de usar ssh para
que los datos de aplicaciones externas circulen por el "t&uacute;nel" creado con
ssh. VPN (Virtual Private Network) usa ssh, pero de otra manera mucho m&aacute;s
elaborada que el tema que tocamos aqu&iacute;. Otra soluci&oacute;n sofisticada
se llama <a href="http://vtun.sourceforge.net">VTun</a>.
</p><p>
Podemos considerar este "tunneling" como una manera simple y
f&aacute;cil de encriptar los datos en una red heterog&eacute;nea para que no se
pueda interceptar. Y eso vale para redes locales o lejanas. Sin embargo,
recuerden, ssh s&oacute;lo encripta los datos, no puede asegurar la red en
s&iacute; misma...
<br>
¡Han sido avisados!
</p></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="202lfindex0">&nbsp;</A>
<H2>?Por qu&eacute; usar ssh?</H2>

<p>
SSH es un reemplazo de telnet o de rsh y rlogin, como ya lo hemos dicho en un
<a href="../January2001/article180.shtml">art&iacute;culo anterior</a>.
Incluso aunque se encontraron problemas de seguridad en ssh hace poco,
sigue siendo una buena herramienta para encriptar los datos. A
prop&oacute;sito, &eacute;ste
problema de seguridad concern&iacute;a los passwords: ¡se recomienda usar passphrases y
claro claves RSA! Usar ssh no dispensa de usar otras herramientas de
seguridad tales como los tcpwrappers, por ejemplo.

<p>
Es muy f&aacute;cil de interceptar datos circulando por una red con herramientas
standard tales como tcpdump o snoop. Pueden probar &eacute;sto en una red en la cual
dos m&aacute;quinas comunican con telnet, por ejemplo. Desde una tercera
m&aacute;quina Linux, por ejemplo, arranquen tcpdump (como root, claro) y miren
lo que pasa. ¡Pueden leer todos los datos!
Claro, es demasiado r&aacute;pido para leer en la pantalla, pero pueden
redirigir la salida hacia un fichero, y leerlo tomando un caf&eacute;
o fumando un cigarrillo. Si es cierto para los datos, tambi&eacute;n lo es para
los passwords. Es decir, la puerta est&aacute; muy abierta para los
piratas. Les dan la llave para entrar en la casa. Imaginen si los datos que
circulan son confidenciales... Si eres el
sysadmin, tengo miedo a que tu jefe te sugiera encontrar otro empleo en cualquier
otro lugar.
Los comandos rsh, rcp, rlogin tambi&eacute;n son muy peligrosos, puesto que tampoco son
encriptados. Si ssh es un buen reemplazo para rlogin o rsh, viene con scp, lo
que tambi&eacute;n es un buen reemplazo para rcp.
Es decir, si usan ssh no necesitan m&aacute;s los "remote commands" o telnet.
O por lo menos no tendr&iacute;an que usarlos.

<p>
C&oacute;mo instalar ssh, c&oacute;mo generar las claves privadas y p&uacute;blicas...
no entra en el tema de &eacute;ste art&iacute;culo. Encontrar&aacute;n todo lo que
necesitan en el arca o leyendo toda la documentaci&oacute;n disponible en
el <a href="http://www.linuxdoc.org">Linux Documentation Project</a>,
por ejemplo.
Puesto que usar una computadora hoy, casi siempre significa transferir datos de
una manera u otra, ssh tendr&iacute;a que ser obligatorio... aunque es cosa tuya.
Sin embargo, ssh puede hacer mucho m&aacute;s que reemplazar telnet o los
"remote commands".
Pueden usarlo para encriptar los datos circulando entre aplicaciones externas y
claro entre diferentes SO. Tambi&eacute;n puede comprimir estos datos. Muy a menudo se
usa con protocolos tales como pop, ftp, http... sea por compresi&oacute;n o
encriptaci&oacute;n. Esto es muy &uacute;til, siendo un sysadmin, para conectar
desde casa al trabajo o viceversa.

<p>
Siendo una aplicaci&oacute;n cliente/servidor, ssh necesita ambos para funcionar:
necesitan una m&aacute;quina corriendo un servidor ssh y otra corriendo un
cliente ssh (¡Han notado que listo soy!).
¿Por qu&eacute; insistir en &eacute;sta evidencia? Puesto que hablamos de software libre,
aparte de Unix, muchos SO no tienen servidores. Es decir, a veces no
podr&aacute;n hacer lo evidente, sino que tendr&aacute;n que dar la vuelta al problema:
la clave se llama "redirecci&oacute;n". M&aacute;s sobre ese asunto un poco
m&aacute;s tarde. Esto significa que usando SO tales como Mac OS o Windows, no
tendr&aacute;n servidores libres. Tendr&aacute;n que trabajar con clientes y no
parece tan evidente. A ver con unos ejemplos.
</p>

<A NAME="202lfindex1">&nbsp;</A>
<H2>SSH y VNC</H2>

<p>
Si no conocen VNC, le faltan una de las herramientas m&aacute;s estupenda nunca
vista. Pueden echar un vistazo
<a href="../July2000/article155.shtml">aqu&iacute;</a> para saber un poco
m&aacute;s.
<br>
Si van a visitar el sitio de VNC en <a href="http://www.uk.research.att.com/vnc/docs.html">
http://www.uk.research.att.com/vnc/docs.html</a> encontrar&aacute;n mucha
documentaci&oacute;n concerniendo el asunto del cual hablamos.
Por ejemplo, encontrar&aacute;n c&oacute;mo usar VNC con ssh, desde un cliente
ssh para Windows hacia un servidor ssh para Unix. Por eso no voy a reescribir el
muy buen trabajo de Frank Stajano que es mucho mejor de lo que yo
podr&iacute;a hacer.
Entonces, a ver c&oacute;mo puede funcionar eso.
Primero, tienen que elegir un cliente ssh libre para Windows. En el ejemplo
usaremos Teraterm Pro con su extensi&oacute;n Ttssh. Pueden encontrarlo a
<a href="http://hp.vector.co.jp/authors/VA002416/teraterm.html">http://hp.vector.co.jp/authors/VA002416/teraterm.html</a>.
De hecho, se llama Ttssf, puesto que es una versi&oacute;n autorizada en
Francia. Todo eso va cambiando, pero tienen que saber que muchos pa&iacute;ses
todav&iacute;a no aceptan encriptaci&oacute;n.
Visiten el URL siguiente para conocer la situaci&oacute;n de la
encriptaci&oacute;n en su propio pa&iacute;s: <a href=
"http://www2.epic.org/reports/crypto2000/countries.html">http://www2.epic.org/reports/crypto2000/countries.html</a>.

<p>
Ahora, decimos que han arrancado un servidor ssh en una m&aacute;quina Unix.
En el mismo servidor, suponemos que pueden arrancar un servidor VNC (vncserver).
Una vez que los dos servidores funcionan, conecten por ejemplo una
m&aacute;quina NT al servidor Unix usando Ttssh. Es decir, ya tienen una
conexi&oacute;n encriptada entre ambas m&aacute;quinas. Pero eso a&uacute;n no
permite tener un protocolo vncviewer (cliente vnc) encriptado desde el ordenador
funcionando bajo NT. Para hacer eso necesitan decir a ssh que tiene que
"redirigir" el buen puerto (¡ya hemos llegado!).
El ordenador Unix corriendo el servidor vnc se llama "bandit" y usa el puerto
5901, porque es el "display" numero 1, el X display por defecto en &eacute;sta
m&aacute;quina siendo el 0. El uso normal ser&iacute;a mandar el comando
"vncviewer bandit:1". Claro, esto funciona pero sin los datos encriptados.
En vez de eso, usando el "shell" de NT (es decir el interfaz DOS...), hay
que mandar el comando "/ssh-L5902:bandit:5901" sin espacio. Esto significa que
crean un puerto local 5902. Ahora un comando "vncviewer localhost:2" empieza una
conexi&oacute;n encriptada del protocolo VNC en la m&aacute;quina NT. Se puede
hacer lo mismo sin usar la linea de comando puesto que Ttssh tiene un
interf&aacute;z gr&aacute;fico. Podemos a&ntilde;adir que la sintaxis esa
s&oacute;lo concierne Ttssh. El comando en Unix ser&iacute;a:
"ssh -L 5902:bandit:5901 bandit".

<p>
Claro, es un ejemplo muy basico: pueden hacer cosas m&aacute;s complicadas.
Den un vistazo a la documentaci&oacute;n disponible en el sitio de VNC,
particularmente la de Frank Stajano.
</p>

<A NAME="202lfindex2">&nbsp;</A>
<H2>SSH y MySQL</H2>

<p>
<a href="http://www.mysql.org">MySQL</a> es probablemente una de las bases de datos
m&aacute;s usadas, particularmente en Internet. De nuevo, hacer MySQL
m&aacute;s seguro no entra en el objeto de &eacute;ste art&iacute;culo. Sin embargo,
encriptar los datos circulando entre un servidor y un cliente MySQL mejora la
seguridad de la conexi&oacute;n. SSH permite hacer eso, de la misma manera que
lo hemos hecho con VNC, es decir "redirigiendo" el puerto.
Vamos con un ejemplo en una intranet. El servidor MySQL es
una m&aacute;quina Linux y la mayor&iacute;a de los clientes son m&aacute;quinas
NT. De nuevo, usamos el cliente Ttssh en las computadoras Windows.

<p>
El puerto por defecto de MySQL es 3306. Esta vez la "redirecci&oacute;n" concierne el mismo
puerto (3306).
Pueden hacer una "redirecci&oacute;n" local o distante.
Un "forward" local parece a "/ssh-L3306:localhost:3306" en la m&aacute;quina NT
o "ssh -L 3306:localhost:3306" en la m&aacute;quina Unix. Usar "localhost"
permite mandar los datos por el interf&aacute;z loopback en vez del
interf&aacute;z del "host".
Un "forward" distante ser&iacute;a "/ssh-R3306:bandit:3306" para NT y "ssh -R
3306:bandit:3306" para Unix.
Esto s&oacute;lo concierne la propia conexi&oacute;n. Para el "login" en la base
de datos necesitan el hostname y el username que tienen para el
servidor MySQL, &eacute;ste &uacute;ltimo siendo probablemente diferente del username
que tienen para el login en el sistema. Den un vistazo a los man pages por la
opci&oacute;n "-l".
Claro, &eacute;sto funcionara si tienen un cliente MySQL en el ordenador NT.
Si no tienen, necesitar&aacute;n el uso de una aplicaci&oacute;n ODBC, Sybase
por ejemplo (o si no tienen miedo, la maravilla de "Peque&ntilde;oFlojo" llamada
Access). Es decir, tienen que arrancar &eacute;sta aplicaci&oacute;n. Usen el piloto
ODBC para crear un enlace hacia el servidor MySQL. Ahora pueden conectar al
localhost, no el host del servidor MySQL , para entrar en el servidor MySQL.
Ahora, los datos circulando entre el servidor y el cliente estan encriptados.
Pueden averiguarlo con snoop o tcpdump.

<p>
Este ejemplo concierne una red local. Si quieren hacer lo mismo en WANs,
ser&aacute; un poco m&aacute;s complejo, si por ejemplo se encuentran
detr&aacute;s de un firewall. Esto puede ser una manera de administrar a
distancia desde casa si eres un sysadmin pero no ser&iacute;a tan bueno para
entrar en un base de datos en un sitio web. Para eso tendr&iacute;an que buscar
algo m&aacute;s sofisticado, tal como VPN por ejemplo, pero esta es la idea.
De todo modos, no crean que basta para la seguridad de un servidor
que transfiere datos confidenciales como n&uacute;meros de tarjetas de
cr&eacute;dito. A prop&oacute;sito, ¿qui&eacute;n cree alguien que dice que tiene un
servidor capaz de transferir &eacute;ste tipo de datos sin riesgo? Personalmente,
¡¡no lo creo!!
</p>

<A NAME="202lfindex3">&nbsp;</A>
<H2>SSH y emulaci&oacute;n de terminal</H2>

<p>
Ya estamos usando emulaci&oacute;n de terminal de modo que ¿qu&eacute; significa esto?
<br>
Imaginamos que tienen una vieja aplicaci&oacute;n en Cobol en un servidor Unix.
De nuevo, los clientes son ordenadores bajo NT. Para conectar, necesitan una
emulaci&oacute;n de terminal algo m&aacute;s sofisticada que vt100, vt220 o
vt320, puesto que tienen que obtener tambi&eacute;n el interfaz de usuario. Los
acentos, las tablas... Definir una emulaci&oacute;n standard (vt100, vt220...)
en 8 bits no funcionar&aacute; correctamente. Lo que se obtiene no se puede ni
usar. Entonces, puesto que el producto es bastante antiguo, utilizan un software
"antiguo" de emulaci&oacute;n de terminal.
Depu&eacute;s de una larga batalla para obtener la emulaci&oacute;n correcta,
encuentran que "ibm3151", por ejemplo, da un buen resultado. ¡Menos mal!
</p>

<p>
Pero, puesto que el software fue desarrollado hace a&ntilde;os, no sabe nada
de seguridad. ¡La conexi&oacute;n se establece con telnet! De hecho, los datos
son confidenciales... ¿Entonces qu&eacute;? Por lo menos, hay que encontrar una manera
de encriptar los datos. Otra vez, ssh nos ayuda y, de nuevo,
"There Is More Than One Way to Do It" (Hay m&aacute;s de una manera de hacerlo) ...
<br>
Sea redirigir telnet hacia puerto 22 (ssh), sea redirigir el puerto de la
emulaci&oacute;n. Pero... no creo que el servidor acepte que un usuario
redirija el puerto telnet (23 por defecto): tienen que ser root para hacer eso
(¡por lo menos lo espero!). Concerniendo la aplicaci&oacute;n de terminal, puede
ser utilizada por muchos usuarios al mismo tiempo, usando diferentes
puertos para cada conexi&oacute;n. Por ejemplo: 10 usuarios = 10 puertos.
Se vuelve un poco m&aacute;s complicado, no?
</p>

<p>
Primero, el servidor de aplicaci&oacute;n tiene que correr el servidor
ssh escuchando al puerto 22.
Desde un cliente NT, hay que conectar al servidor de aplicaci&oacute;n, ya sea
usando Ttssh o usando la linea de comandos. Es decir, establecen una
conexi&oacute;n encriptada entre el servidor y el cliente como un usuario
especifico. Desde las opciones de Ttssh, redirigen el puerto local 50000 hacia
el puerto 23 (telnet) del servidor distante. Usando la linea de comando
ser&iacute;a algo as&iacute;: "ssh-L50000:servername:23". Ahora pueden decir a
la emulaci&oacute;n de terminal que use el puerto 50000 en vez del 23, y los
datos circulan por un canal seguro, lo que significa encriptado. Pueden
averiguarlo con snoop o tcpdump. Claro que tendr&aacute;n que hacer lo mismo
por cada cliente autorizado a conectar a la aplicaci&oacute;n, cambiando el
n&uacute;mero de puerto. Por ejemplo, podr&iacute;a ser 50001, 50002, etc.
</p>

<p>
Podr&iacute;an preguntar: ¿por qu&eacute; puertos tan altos? La respuesta es: ¡por
muchas razones! La causa m&aacute;s importante es que pueden manipular puertos
altos sin ser root.
La segunda raz&oacute;n es que el puerto seleccionado no tiene que estar en uso
en ambas m&aacute;quinas. Por ejemplo: si el servidor funciona bajo Solaris,
muchos puertos altos ya se usan por los servicios corriendo. As&iacute;
el puerto 50000 y mayores tendr&iacute;an que funcionar.
Todo esto funcionar&aacute; en muchos SO capaces de usar clientes ssh.
Respecto a la manera de automatizar el proceso en las m&aacute;quinas
clientes, a ti te toca. No pueden pedir un usuario "normal" que haga todo eso
antes de conectarse. Dejamos eso como ejercicio para los lectores...
</p>

<A NAME="202lfindex4">&nbsp;</A>
<H2>A donde ir desde aqu&iacute;?</H2>

<p>
Estos ejemplos ense&ntilde;an las numerosas utilizaciones de ssh. Pueden hacer
mucho m&aacute;s con muchas aplicaciones con ssh. Depende de lo que necesitan.
No obstante, la "filosof&iacute;a" es casi siempre la misma: redirecci&oacute;n
de puerto.
Sin embargo, tengan cuidado si usan redirecciones m&aacute;s complejas. Por
ejemplo, si redirigen hacia una tercera computadora, los datos circulando por la
conexi&oacute;n del medio no ser&aacute;n encriptados.
Otro problema concierne clientes Windows usando Ttssh. La conexi&oacute;n hacia
puertos redirigidos depiende de las se&ntilde;as IP como los "remote" comandos,
as&iacute; permitiendo ataques de "spoofing". Por eso, la necesidad de usar
otras herramientas con ssh, tales como tcpwrappers.
</p>

<p>
Busquen en la "literatura" sobre ssh, le ense&ntilde;ar&aacute; mucho. Su
imaginaci&oacute;n har&aacute; el resto.
</p>

<A NAME="202lfindex5">&nbsp;</A>
<H2>¡Por fin, se acab&oacute;!</H2>

<p>
La seguridad tendr&iacute;a que ser una preocupaci&oacute;n para cada uno, ¡pero
no lo es! ssh s&oacute;lo es una de las herramientas de seguridad que pueden usar
cada d&iacute;a. Es una buena herramienta si la consideran por lo que es, es
decir una herramienta de encriptaci&oacute;n o de compresi&oacute;n.
En s&iacute; mismo, ssh casi no sirve para nada, puesto que no va a suprimir los
numerosos "agujeros" que pueden tener en un ordenador o en una red. Hacer una
m&aacute;quina, una red, m&aacute;s seguros es una tarea de importancia y las
herramientas no lo hacen todo, aunque sean muy buenas.
Las tareas b&aacute;sicas son una obligaci&oacute;n cuando se trata de
seguridad. No olviden suprimir los servicios que no sirven, controlar los
programas SUID root, desactivar los programas con riesgos... Hay mucho que hacer
y nunca bastar&aacute;. Pueden instalar todas las herramientas de seguridad
disponibles, no servir&aacute; para nada si dejan una puerta
abierta. Claro, es otra historia, pero no olviden lo evidente.
Volviendo a ssh, podemos decir que es una herramienta sin la que no se puede
vivir, si la usan correctamente y para lo que ha sido hecha. De nuevo, usenla
con passphrases, claves RSA, no con passwords. Controlen los permisos de los
ficheros en el directorio .ssh y los permisos del propio directorio.
Y otra, otra vez, ¡por lo menos, usen tcpwrappers!
</p>

<p>
No obstante, recuerden que pueden mandar por el t&uacute;nel ssh la mayor&iacute;a
de los protocolos existentes. Puede ser muy &uacute;til para que las conexiones
sean un poco m&aacute;s seguras.
Hay otro uso muy com&uacute;n de ssh del cual no hemos hablado: la
redirecci&oacute;n de sesiones X. Puesto que eso necesita tener X bajo
diferentes SO, lo hemos olvidado intencionalmente. Sin embargo, el asunto es
parte del tema. X no es muy seguro, y ssh puede mejorar las cosas.
Para usos m&aacute;s sofisticados, ssh no bastar&aacute;. Como ya lo hemos dicho,
estudien VPNs o herramientas como VTun que ayudar&aacute;n mucho.
</p>

<p>
Ultimo pero no menos importante: averiguen la situaci&oacute;n de la encriptaci&oacute;n
para su propio pa&iacute;s. Ser&iacute;a triste encontrarse en la carcel por ser
un esp&iacute;a, s&oacute;lo porque han usado un software prohibido.
Es as&iacute;...
</p>

<p>
De todo modos, ¡vivimos una &eacute;poca estupenda!



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=202&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article202.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Georges Tarbouriech <small>&lt;georges.t(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Georges Tarbouriech &lt;georges.t(at)linuxfocus.org&gt;</font></td></tr>
  <tr><td><font size="2">es --&gt; es: Javier Palacios &lt;javier.pb(at)linuxfocus.org&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-11-06, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
