<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>BTTV Mini-Como : Requisitos de Software</TITLE>
 <LINK HREF="BTTV-Mini-COMO-4.html" REL=next>
 <LINK HREF="BTTV-Mini-COMO-2.html" REL=previous>
 <LINK HREF="BTTV-Mini-COMO.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="BTTV-Mini-COMO-4.html">Página siguiente</A>
<A HREF="BTTV-Mini-COMO-2.html">Página anterior</A>
<A HREF="BTTV-Mini-COMO.html#toc3">Índice general</A>
<HR>
<H2><A NAME="s3">3. Requisitos de Software</A></H2>

<P> 
Para usar estas tarjetas de TV bajo Linux, necesitar&aacute; los
controladores de dispositivo apropiados en el n&uacute;cleo. Los controladores
de dispositivo de bttv son parte de la distribuci&oacute;n del n&uacute;cleo de
Linux desde la versi&oacute;n 2.2.0.
<P>
<P> 
<P>Opcionalmente puede obtener la &uacute;ltima versi&oacute;n del paquete de los
controladores de dispositivo y usarlo con los kernel 2.0.35 y
superiores. Aun as&iacute;, no se garantiza que funcione con la
anterior serie de n&uacute;cleos 2.0.x. El paquete actualizado de bttv est&aacute;
disponible en 
<A HREF="http://www.strusel007.de/linux/bttv/">http://www.strusel007.de/linux/bttv/</A>.
<P>
<P> 
Si es Usted nuevo en el mundo de los controladores de dispositivo de
bttv, le sugerimos que comience con la versi&oacute;n incluida en el &uacute;ltimo
n&uacute;cleo. Si experimenta problemas con &eacute;l, o encuentra que su tarjeta no
est&aacute; soportada, entonces atr&eacute;vase con la serie 0.6 actualizada de los
controladores de dispositivo en las direcciones arriba indicadas. Si
te siente aventurero, puede probar la serie de drivers 0.7 de Gerd
Knorr, que se incorporar&aacute;n en los n&uacute;cleos 2.4. Estos est&aacute;n disponibles
en 
<A HREF="http://www.strusel007.de/linux/bttv/">http://www.strusel007.de/linux/bttv/</A>.
<P>
<P> 
<P>Este documento est&aacute; basado principalmente en los controladores de
dispositivo del n&uacute;cleo 2.2.14, con alguna menci&oacute;n de las
caracter&iacute;sticas de la serie 0.6. La serie 0.7 no est&aacute; actualmente
cubierta, ya que est&aacute; en desarrollo mientras escribimos este documento.
<BLOCKQUOTE>Los nuevos controladores de dispositivo de la serie 0.7.x no
funcionan con los n&uacute;cleos 2.0.x</BLOCKQUOTE>
<P>
<HR>
<A HREF="BTTV-Mini-COMO-4.html">Página siguiente</A>
<A HREF="BTTV-Mini-COMO-2.html">Página anterior</A>
<A HREF="BTTV-Mini-COMO.html#toc3">Índice general</A>
</BODY>
</HTML>
