<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML lang="en">

<HEAD>
<META http-equiv="Content-Type" 
      content="text/html; charset=iso-8859-1">

<TITLE>
LinuxFocus Enero 1999
</TITLE>
  <STYLE>
<!--
      P { text-indent: 1em } 
-->
    </Style>
</HEAD>

<BODY bgcolor="#ffffff" 
      text="#000000" 
      alink="#336633" 
      link="#336633" 
      vlink="#336633">

<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../">

<AREA shape="rect" 
      coords="423, 9, 457, 30" 
      alt="Map" 
      href="../map.html">

<AREA shape="rect" 
      coords="463, 9, 508, 30" 
      alt="Index" 
      href="../indice.html">

<AREA shape="rect" 
      coords="514, 9, 558, 30" 
      alt="Search" 
      href="Search/">

</MAP>

<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" 
      coords="78, 0, 163, 15"  
      alt="News" 
      href="../News/">

<AREA shape="rect" 
      coords="189, 0, 284, 15"  
      alt="Archives" 
      href="../Archives/">

<AREA shape="rect" 
      coords="319, 0,  395, 15" 
      alt="Links" 
      href="../Links">

<AREA shape="rect" 
      coords="436, 0,  523, 15" 
      alt="About LF" 
      href="../aboutus.html">
</MAP>


<!-- Top and Bottom navegation bars -->
<CENTER>
<IMG src="../../common/images/Topbar-en.gif" 
     width="600" 
     height="40" 
     border="0" 
     alt="[Top Bar]" 
     ismap 
     usemap="#top" >
<BR>

<IMG src="../../common/images/Bottombar-en.gif" 
     width="600" 
     height="21" 
     border="0" 
     alt="[Bottom Bar]" 
     ismap 
     usemap="#bottom">

</CENTER>


<TABLE align="center" 
       width="100%"  
       cellspacing="0" 
       cellpadding="5" 
       border="0">

       <TR>
       <TD>
       <H1>Enero 1999:  Robots Basados en Linux</H1>
       </TD>       
       </TR>


       <TR valign="top">            <!-- Row 2 --> 

       <TD>


       <!-- Monthly cover illustration -->
       <IMG src="../../common/images/cover9.jpg"
            width="400"
	    height="281"
	    align="left">

	<H3>
	<FONT face="Helvetica, Arial" 
	      color="#660033">
	Editorial
	</FONT>
	</H3>
	por Ismael Ripoll<BR>

        <P>Cuando entr&eacute; a formar parte de LinuxFocus lo hice pensando
        que hac&iacute;a falta una revista en castellano que tratara temas
        relacionados con GNU/Linux.  Por entonces, todos los art&iacute;culos
        que llegaban a LF estaban escritos en ingl&eacute;s y el trabajo
        consist&iacute;a fundamentalmente en traducirlos al castellano. No
        era f&aacute;cil prever la gran aceptaci&oacute;n que LF iba a tener tanto
        en Espa&ntilde;a como el resto de pa&iacute;ses hispano
        parlantes. Aceptaci&oacute;n que se demuestra por el gran n&uacute;mero de
        colaboradores con los que cuenta, el elevado n&uacute;mero de
        lectores, as&iacute; como por el propio reconocimiento de la prensa
        escrita.</p>

	      <p>
		Mucho antes de la creaci&oacute;n de LinuxFocus, proyectos
		como <a href="http://lucas.ctv.es">LuCAS</a> (Linux en
		CAStellano) o <a href="http://slug.ctv.es">SLUG</a> (Spanish Linux
		User Group) ya produc&iacute;an documentaci&oacute;n en castellano
		sobre Linux.  El objetivo principal de estos proyectos
		ha sido, y continua siendolo, traducir al castellano
		la documentaci&oacute;n producida en ingl&eacute;s en el proyecto
		LPD (Linux Documentation Project). El objetivo de
		LinuxFocus es similar en cuanto a producci&oacute;n de
		documentaci&oacute;n en castellano, pero desde un punto de
		vista mucho m&aacute;s educativo, y por que no,
		divertido. Pensamos que tan importante es que los
		contenidos de los art&iacute;culos sean de una buena calidad
		t&eacute;cnica, como que la presentaci&oacute;n sea lo m&aacute;s cuidada y
		amena posible.</p>


<p>
LinuxFocus no es solo un hobby y una fuente inagotable de
entretenimiento para los que formamos parte de este proyecto, sino
tambi&eacute;n una forma de ampliar el &aacute;mbito profesional. Desde el que
colabora como autor enviando art&iacute;culos, como los que trabajan en las
traducciones y las revisiones, est&aacute;n continuamente ejercitando y
demostrando unas habilidades y conocimientos que son necesitados por
muchas empresas.</p>

<p>
LinuxFocus es un punto de encuentro entre personas con conocimientos y
ganas de comunicarlos, y lectores que no se contentan con ara&ntilde;ar en la
superficie de un tema, sino que demandan una informaci&oacute;n m&aacute;s completa.
</p>


	<IMG src="../../common/images/Esperanza-S.gif" 
	     width="154" 
	     height="205"
	     align = "left">

	<H3>
	<FONT face="Helvetica, Arial" 
	      color="#660033">
	Bienvenida de nuevo
	</FONT>
	</H3>
	   

		<p>Despu&eacute;s de mucho tiempo, Esperanza Sepulveda vuelve
		  a formar parte de la familia de LinuxFocus. Gracias
		  a su experiencia, LinuxFocus no s&oacute;lo disfrutara de
		  ilustraciones de alta calidad, sino que tambi&eacute;n
		  conseguiremos reducir el tama&ntilde;o de las imagenes de
		  la revista.</p>

		<p>Ella es dise&ntilde;adora gr&aacute;fica, licenciada en Bellas
		  Artes por la Facultad de Bellas Artes de
		  Madrid. Actualmente est&aacute; cursando estudios de
		  post-graduado en la misma universidad y participa en 
		  un proyecto de investigaci&oacute;n  sobre medios digitales 
		  y arte. Trabaja en el departamento de dise&ntilde;o gr&aacute;fico 
		  en una empresa y tiene experiencia en dise&ntilde;o y
		  retoque gr&aacute;fico. Su interes en la internet como
		  medio de comunicaci&oacute;n le ha llevado a participar en LinuxFocus.</p>
  


	</TD>
	</TR>


	<TR>                   <!--  Row 3 -->

	<TD colspan="2">
	<HR size=1 noshade>

	<H3>
	<FONT face="Helvetica, Arial" 
	      color="#660033">
	Contenidos
	</FONT>
	</H3>
 
        <H4>
	<FONT face="Helvetica, Arial" 
              color="#660033">
        Hardware
        </FONT>
        </H4>
 
        <UL>
          <LI>
	    
	    <IMG src="../../common/images/frame.gif" 
                 border="0" 
		 height="" 
		 width="" 
		 alt="" 
		 align="absmiddle">
           



	    <A href="article73.html">
	    Un veh&iacute;culo autoguiado basado en Linux
	    </A> 
	    por
	    Vicente Egea, Jorge Garrido, Roberto Guzm&aacute;n, Ranko Zotovic
	    <BR>
		  Robot m&oacute;vil controlado por un PC equipado con
		  RT-Linux. "El empleo de Linux y de su extensi&oacute;n de
		  tiempo real RT-Linux ha facilitado enormemente la
		  realizaci&oacute;n del proyecto."


          </LI>


          <LI>
	    
	    <IMG src="../../common/images/frame.gif" 
                 border="0" 
		 height="" 
		 width="" 
		 alt="" 
		 align="absmiddle">
           

	    <A href="article75.html">
	    Teclado "Happy Hacking" Revisi&oacute;n del producto
	    </A> 
	    por
	    <a href="mailto:sepulveda@linuxfocus.org">
	    Miguel &Aacute;ngel Sep&uacute;lveda</a>
	    <BR>
"Happy Hacking" es un Teclado producido por PFU Am&eacute;rica Inc y sometido
a revisi&oacute;n por LinuxFocus. Este art&iacute;culo describe las primeras
impresiones de este  peque&ntilde;o y robusto teclado.


          </LI>

          <LI>
	    
	    <IMG src="../../common/images/frame.gif" 
                 border="0" 
		 height="" 
		 width="" 
		 alt="" 
		 align="absmiddle">
           



	    <A href="article74.html">
	    Instalaci&oacute;n y Configuraci&oacute;n de un Sistema RAID
	    </A> 
	    por
	    <A href="mailto:acastro@ctv.es"> 
	    Antonio Castro
	    </A>  
	    <BR>
 RAID (Redundant Array of Inexpensive Disks) Consiste
                         en una serie de sistemas para organizar varios discos como si de
                         uno solo se tratara pero haciendo que trabajen en paralelo para
                         aumentar la velocidad de acceso o la seguridad frente a fallos del
                         hardware o ambas cosas. 


          </LI>


        </UL>

        <H4>
	<FONT face="Helvetica, Arial" 
              color="#660033">
        UNIX Basics
        </FONT>
        </H4>
 
        <UL>

          <LI>
	    
	    <IMG src="../../common/images/frame.gif" 
                 border="0" 
		 height="" 
		 width="" 
		 alt="" 
		 align="absmiddle">
           

	    <A href="article77.html">
	    Permisos de Acceso a Ficheros
	    </A> 
	    por 
	    <A href="mailto:guido@bearix.oche.de"> 
	    Guido Socher
	    </A>  
	    <BR>
	    
Este art&iacute;culo se divide en dos partes: 
                                La primera parte (Permisos b&aacute;sicos de acceso a ficheros) es una introducci&oacute;n
                                muy corta al concepto b&aacute;sico de permisos de ficheros bajo Unix. 
                                La segunda parte (T-bit, SUID y SGID) cubre algunas caracter&iacute;sticas m&aacute;s
                                avanzadas de linux que van mas all&aacute; de los flags (banderolas) b&aacute;sicos de
                                "lectura-escritura-ejecuci&oacute;n". 



          </LI>


        </UL>





        <H4>
	<FONT face="Helvetica, Arial" 
              color="#660033">
        Software
        </FONT>
        </H4>
 
        <UL>


          <LI>
	    
	    <IMG src="../../common/images/frame.gif" 
                 border="0" 
		 height="" 
		 width="" 
		 alt="" 
		 align="absmiddle">
           
	    <A href="article76.html">
	    PG2CGI Acceso a Bases de Datos desde el Web
	    </A> 
	    por 
	    <A href="mailto:luis.colorado@slug.ctv.es">
	    Luis Colorado
	    </A>
	    <BR>
            PG2CGI es un programa para permitir el acceso a bases de
            datos desde consultas HTML. El autor del programa nos da
            una peque&ntilde;a descripci&oacute;n del dise&ntilde;o del programa y su
            funcionamiento.  Es un art&iacute;culo muy interesante para los
            administradores de Webs y sistemas de informaci&oacute;n.


          </LI>

	</UL>


<H4><FONT face="Helvetica, Arial" color="#660033">Programaci&oacute;n</FONT></H4>
<UL>
		<LI>
		  
		    <IMG src="../../common/images/frame.gif" border="0" height="" width="" alt="" align="absmiddle">
		 
		  <A href="article78.html">Java. Parte II
		  </A> por <A href="mailto:fgcia@correoweb.com">Jose M. Fern&aacute;ndez </A> <BR>
		    
		    Esta serie de art&iacute;culos tiene como modelo los
		    libros cl&aacute;sicos de programaci&oacute;n por lo que
		    intentaremos seguir su estructura en la forma de
		    presentar los contenidos. Una vez realizada una
		    introducci&oacute;n y definidas las caracter&iacute;sticas del
		    lenguaje en el primer art&iacute;culo, continuaremos en
		    este segundo con los tipos de datos, variables,
		    sentencias de control etc., hasta llegar a las
		    clases, el tema central y m&aacute;s importante de toda
		    la serie de art&iacute;culos. Las clases son la base de
		    este lenguaje de programaci&oacute;n. Para poder
		    centrarnos en el tema de las clases la primera
		    parte la haremos lo m&aacute;s esquem&aacute;tica posible ya que
		    al fin y al cabo no var&iacute;a mucho respecto al resto
		    de lenguajes de programaci&oacute;n.

		</LI>
	      </UL>

	</TD>
	</TR>

</TABLE>

<!-- Page Foot -->
<BR clear="all">
<CENTER>
<TABLE width="95%">

<TR>
 <TD align="center" bgcolor="#666666">
  <FONT color="#ffffff">
  P&aacute;ginas Web mantenidas por Miguel Angel Sepulveda &amp; Ismael Ripoll<BR>
 <B>&copy; 1999  LinuxFocus</B>
  </FONT>
 </TD>
</TR>

</TABLE>
</CENTER>



</BODY>

</HTML>












