<HTML
><HEAD
><TITLE
>Uso de las Utilidades de Configuración</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.76b+
"><LINK
REL="HOME"
TITLE="Guía de Administración de Redes con Linux"
HREF="index.html"><LINK
REL="UP"
TITLE="Configuración del Hardware Serie"
HREF="x-087-2-serial.html"><LINK
REL="PREVIOUS"
TITLE="Hardware Serie"
HREF="x-087-2-serial.hardware.html"><LINK
REL="NEXT"
TITLE="Dispositivos Serie y el Indicador login: (ingreso)"
HREF="x-087-2-serial.getty.html"><LINK
REL="STYLESHEET"
TYPE="text/css"
HREF="publicacoes.css"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Guía de Administración de Redes con Linux</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="x-087-2-serial.hardware.html"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Capítulo 4. Configuración del Hardware Serie</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="x-087-2-serial.getty.html"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="X-087-2-SERIAL-CONFIGURATION">4.5. Uso de las Utilidades de Configuración</H1
><P
></P
><P
>Dediquemos algo de tiempo a examinar las dos utilidades más comunes:
<B
CLASS="COMMAND"
>setserial</B
> y <B
CLASS="COMMAND"
>stty</B
>.</P
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="X-087-2-SERIAL-SETSERIAL">4.5.1. La orden setserial</H2
><P
>El núcleo hará su mayor esfuerzo en determinar cómo está configurado
su hardware serie, pero las diversas variantes en la configuración de
dispositivos serie hace difícil obtener una determinación fiable al
100%. Un buen ejemplo de este problema son los módems internos
que discutimos anteriormente. La UART que usan tiene un búfer
FIFO de 16 bytes, pero parece una UART 16450 para el núcleo:
a no ser que específicamente informemos al manejador que el puerto
es realmente un dispositivo 16550, el núcleo no hará uso del búfer
extendido. Otro ejemplo es el de las tarjetas de cuatro puertos sin
procesamiento que permiten compartir una misma IRQ entre un número
de dispositivos serie. Probablemente tengamos que especificarle al
núcleo qué IRQ se supone que usará el puerto, y que las IRQ pueden
estar compartidas.</P
><P
><B
CLASS="COMMAND"
>setserial</B
> fue creado para configurar el manejador
serie en tiempo de ejecución. La orden <B
CLASS="COMMAND"
>setserial</B
>
se ejecuta por lo común al arrancar, desde un script llamado
<TT
CLASS="FILENAME"
>0setserial</TT
> en unas distribuciones, y
<TT
CLASS="FILENAME"
>rc.serial</TT
> en otras. Este script está al cargo de iniciar
adecuadamente el manejador de puerto serie para dar cabida a cualquier
hardware no estándar o inusual que haya en la máquina.</P
><P
>La sintaxis general para la orden <B
CLASS="COMMAND"
>setserial</B
> es:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    setserial <TT
CLASS="REPLACEABLE"
><I
>dispositivo</I
></TT
> [<TT
CLASS="REPLACEABLE"
><I
>parámetos</I
></TT
>]</PRE
></TD
></TR
></TABLE
>
donde el dispositivo es uno de los dispositivos serie, como <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>ttyS0</I
></SPAN
>.</P
><P
>La orden <B
CLASS="COMMAND"
>setserial</B
> tiene un gran número de
parámetros. Los más comunes vienen descritos en <A
HREF="x-087-2-serial-configuration.html#X-087-2-SERIAL-SETSERIAL-PARAMETERS"
>Tabla 4-1</A
>. Para más información
sobre el resto de los parámetros, consulte la página de manual de
<B
CLASS="COMMAND"
>setserial</B
>.</P
><DIV
CLASS="TABLE"
><A
NAME="X-087-2-SERIAL-SETSERIAL-PARAMETERS"><P
><B
>Tabla 4-1. Parámetros de Línea de Órdenes de setserial</B
></P
><TABLE
BORDER="1"
CLASS="CALSTABLE"
><THEAD
><TR
><TH
ALIGN="LEFT"
VALIGN="TOP"
>Parámetro</TH
><TH
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
>Descripción</TH
></TR
></THEAD
><TBODY
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>port</TT
> <TT
CLASS="REPLACEABLE"
><I
>número_puerto</I
></TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Especifica la dirección de E/S del dispositivo serie. Los números de puerto
	deben ser especificados en notación hexadecimal, p.ej. <TT
CLASS="LITERAL"
>0x2f8</TT
>.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>irq</TT
> <TT
CLASS="REPLACEABLE"
><I
>núm</I
></TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Especifica la línea de petición de interrupción que emplea el dispositivo serie.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>uart</TT
> <TT
CLASS="REPLACEABLE"
><I
>tipo_uart</I
></TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Especifica el tipo de UART del dispositivo serie. Los valores más comunes son
	<TT
CLASS="LITERAL"
>16450</TT
>, <TT
CLASS="LITERAL"
>16550</TT
>, etc. Ajustar este valor a
	<TT
CLASS="LITERAL"
>none</TT
> desactivará el dispositivo serie.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>fourport</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	El uso de este parámetro informará al manejador de puertos serie del núcleo
	de que este puerto forma parte de una tarjeta AST Fourport.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>spd_hi</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Programar la UART para emplear una velocidad de 57,6 kbps cuando
	un proceso solicita 38,4 kbps.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>spd_vhi</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Programar la UART para emplear una velocidad de 115 kbps cuando
	un proceso solicita 38,4 kbps.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>spd_normal</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Programar la UART para emplear la velocidad predefinida de 38,4
	kbps cuando se le solicite. Este parámetro sirve para deshacer el
	efecto de un <TT
CLASS="LITERAL"
>spd_hi</TT
> o <TT
CLASS="LITERAL"
>spd_vhi</TT
>
	aplicado en el dispositivo serie especificado.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>auto_irq</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Este parámetro provocará que el núcleo trate de determinar
	automáticamente la IRQ del dispositivo especificado. Este intento
	puede no ser fiable completamente, así que quizá sea mejor entenderlo
	como una solicitud al núcleo para que adivine la IRQ. Si conoce usted
	la IRQ del dispositivo, debe especificar que se use el parámetro
	<TT
CLASS="LITERAL"
>irq</TT
> en su lugar.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>autoconfig</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Este parámetro debe ser especificado simultáneamente con el
	parámetro <TT
CLASS="LITERAL"
>port</TT
>. Cuando se suministra este
	parámetro, <B
CLASS="COMMAND"
>setserial</B
> ordena al núcleo que
	intente determinar automáticamente el tipo de UART localizada en
	la dirección de puerto proporcionada. Si el parámetro
	<TT
CLASS="LITERAL"
>auto_irq</TT
> también es suministrado, el núcleo
	tratará también de determinar la IRQ automáticamente.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>skip_test</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Con este parámetro se solicita que el núcleo no se ocupe de determinar
	el tipo de UART en la auto-configuración. Esto es necesario cuando
	la UART es detectada de forma incorrecta por el núcleo.
	</P
></TD
></TR
></TBODY
></TABLE
></DIV
><P
>Un fichero <TT
CLASS="FILENAME"
>rc</TT
> típico y sencillo para configurar sus
puertos serie al arrancar puede parecerse a lo mostrado en
<A
HREF="x-087-2-serial-configuration.html#X-087-2-SERIAL-RC.SERIAL.SETSERIAL"
>Ejemplo 4-1</A
>.
Una mayoría de distribuciones de GNU/Linux incluirán algo más sofisticado
que este ejemplo.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="X-087-2-SERIAL-RC.SERIAL.SETSERIAL"><P
><B
>Ejemplo 4-1. Ejemplo de órdenes setserial en rc.serial</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    # /etc/rc.serial - script de configuración de líneas serie.
    #
    # Configurar dispositivos serie.
    /sbin/setserial /dev/ttyS0 auto_irq skip_test autoconfig
    /sbin/setserial /dev/ttyS1 auto_irq skip_test autoconfig
    /sbin/setserial /dev/ttyS2 auto_irq skip_test autoconfig
    /sbin/setserial /dev/ttyS3 auto_irq skip_test autoconfig
    #
    # Mostrar la configuración de dispositivos serie.
    /sbin/setserial -bg /dev/ttyS*</PRE
></TD
></TR
></TABLE
></DIV
><P
>El argumento <TT
CLASS="LITERAL"
>-bg /dev/ttyS*</TT
> en la última orden
mostrará un pulcro sumario de la configuración hardware de todos
los dispositivos serie activos. Esta salida se parecerá a la mostrada en
<A
HREF="x-087-2-serial-configuration.html#X-087-2-SERIAL.SETSERIAL.OUTPUT"
>Ejemplo 4-2</A
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="X-087-2-SERIAL.SETSERIAL.OUTPUT"><P
><B
>Ejemplo 4-2. Salida de la orden setserial -bg /dev/ttyS*</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    /dev/ttyS0 at 0x03f8 (irq = 4) is a 16550A
    /dev/ttyS1 at 0x02f8 (irq = 3) is a 16550A</PRE
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="X-087-2-SERIAL-STTY">4.5.2. La Orden stty</H2
><P
>&#13;
&#13;</P
><P
>El nombre <B
CLASS="COMMAND"
>stty</B
> probablemente signifique &ldquo;set tty,&rdquo;
pero la orden <B
CLASS="COMMAND"
>stty</B
> también puede ser empleada para
mostrar la configuración de un terminal. Quizás aún más que <B
CLASS="COMMAND"
>setserial</B
>,
la orden <B
CLASS="COMMAND"
>stty</B
> proporciona un desconcertante número
de características configurables. Cubriremos las más importantes en breve.
Puede usted encontrar descrito el resto en la página de manual de
<B
CLASS="COMMAND"
>stty</B
>.</P
><P
>La orden <B
CLASS="COMMAND"
>stty</B
> se utiliza principalmente para configurar
parámetros del terminal, tales como qué caracteres serán mostrados, o
qué tecla deberá generar una señal de parada. Explicamos anteriormente
que los dispositivos serie son dispositivos tty, y por tanto la orden
<B
CLASS="COMMAND"
>stty</B
> es igualmente aplicable a ellos.</P
><P
>Uno de los usos más importantes de <B
CLASS="COMMAND"
>stty</B
> para
dispositivos serie es habilitar la negociación por hardware en ellos.
Anteriormente describimos someramente la negociación por hardware.
La configuración por defecto en dispositivos serie es que esta
negociación hardware esté deshabilitada. Esta disposición permite
que los cables serie de &ldquo;tres hilos&rdquo; funcionen;
estos cables no aceptan las señales necesarias para la negociación por
hardware, y si estuviera activada por defecto, serían incapaces de
transmitir ningún carácter para desactivarla.</P
><P
>Sorprendentemente, algunos programas de comunicación serie no
habilitan la negociación por hardware, así que si su módem la permite,
deberá configurar el módem para emplearla (diríjase al manual de
su módem para averiguar qué orden usar), y también deberá configurar
el dispositivo serie para utilizar negociación por hardware. La orden
<B
CLASS="COMMAND"
>stty</B
> tiene una bandera <TT
CLASS="LITERAL"
>crtscts</TT
>
que habilita la negociación por hardware en un dispositivo; tendrá
que utilizar esto. El lugar más apropiado para ejecutar esta orden
probablemente sea el fichero <TT
CLASS="FILENAME"
>rc.serial</TT
> (o
equivalente) al arrancar, utilizando sentencias como las mostradas en
<A
HREF="x-087-2-serial-configuration.html#X-087-2-SERIAL-RC.SERIAL.STTY"
>Ejemplo 4-3</A
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="X-087-2-SERIAL-RC.SERIAL.STTY"><P
><B
>Ejemplo 4-3. Órdenes stty de Ejemplo en rc.serial</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    #
    stty crtscts &lt; /dev/ttyS0
    stty crtscts &lt; /dev/ttyS1
    stty crtscts &lt; /dev/ttyS2
    stty crtscts &lt; /dev/ttyS3
    #</PRE
></TD
></TR
></TABLE
></DIV
><P
>La orden <B
CLASS="COMMAND"
>stty</B
> trabaja en el terminal en uso de
forma predefinida, pero mediante la redirección de entrada (&ldquo;&lt;&rdquo;)
facilitada por el intérprete de órdenes, podemos hacer que
<B
CLASS="COMMAND"
>stty</B
> maneje cualquier dispositivo tty. Es un
error común olvidar si se ha de emplear &ldquo;&lt;&rdquo; o &ldquo;&gt;&rdquo;;
las versiones más modernas de <B
CLASS="COMMAND"
>stty</B
> tienen una
sintaxis más clara de especificarlo. Con esta nueva sintaxis, nuestro ejemplo
quedaría como en <A
HREF="x-087-2-serial-configuration.html#X-087-2-SERIAL-RC.SERIAL.STTY.NEW"
>Ejemplo 4-4</A
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="X-087-2-SERIAL-RC.SERIAL.STTY.NEW"><P
><B
>Ejemplo 4-4. Órdenes stty de Ejemplo en rc.serial Empleando Sintaxis Moderna</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    #
    stty crtscts -F /dev/ttyS0
    stty crtscts -F /dev/ttyS1
    stty crtscts -F /dev/ttyS2
    stty crtscts -F /dev/ttyS3
    #</PRE
></TD
></TR
></TABLE
></DIV
><P
>Antes mencionamos que la orden <B
CLASS="COMMAND"
>stty</B
> puede ser
usada para mostrar los parámetros de configuración de un dispositivo
tty. Para mostrar todos los parámetros activos de un dispositivo tty se hace:</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    $ <TT
CLASS="USERINPUT"
><B
>stty -a -F /dev/ttyS1</B
></TT
></PRE
></TD
></TR
></TABLE
></P
><P
>La salida de esta orden, mostrada en <A
HREF="x-087-2-serial-configuration.html#X-087-2-SERIAL.STTY.OUTPUT"
>Ejemplo 4-5</A
>,
le muestra el estado de todas las banderas para ese dispositivo;
una bandera precedida por un signo menos, como en <TT
CLASS="OPTION"
>&ndash;crtscts</TT
>,
significa que la bandera ha sido desactivada.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="X-087-2-SERIAL.STTY.OUTPUT"><P
><B
>Ejemplo 4-5. Salida de una Orden stty -a</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    speed 19200 baud; rows 0; columns 0; line = 0;
    intr = ^C; quit = ^\; erase = ^?; kill = ^U; eof = ^D; eol = &lt;undef&#62;;
             eol2 = &lt;undef&#62;; start = ^Q; stop = ^S; susp = ^Z; rprnt = ^R;
             werase = ^W; lnext = ^V; flush = ^O; min = 1; time = 0;
    -parenb -parodd cs8 hupcl -cstopb cread clocal -crtscts
    -ignbrk -brkint -ignpar -parmrk -inpck -istrip -inlcr -igncr -icrnl -ixon
            -ixoff -iuclc -ixany -imaxbel
    -opost -olcuc -ocrnl onlcr -onocr -onlret -ofill -ofdel nl0 cr0 tab0
             bs0 vt0 ff0
    -isig -icanon iexten echo echoe echok -echonl -noflsh -xcase -tostop
             -echoprt echoctl echoke</PRE
></TD
></TR
></TABLE
></DIV
><P
>Una descripción de las banderas más importantes se da en <A
HREF="x-087-2-serial-configuration.html#X-087-2-SERIAL.STTY.FLAGS"
>Tabla 4-2</A
>. Cada una de ellas se habilita suministrándola
a <B
CLASS="COMMAND"
>stty</B
>, y se deshabilita de la misma forma, pero
precedida por un carácter &ndash; delante. Así, para deshabilitar la
negociación hardware, se haría:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    $ <TT
CLASS="USERINPUT"
><B
>stty -crtscts -F /dev/ttyS0</B
></TT
></PRE
></TD
></TR
></TABLE
></P
><DIV
CLASS="TABLE"
><A
NAME="X-087-2-SERIAL.STTY.FLAGS"><P
><B
>Tabla 4-2. Banderas de stty Más Relevantes Para Configurar Dispositivos Serie</B
></P
><TABLE
BORDER="1"
CLASS="CALSTABLE"
><THEAD
><TR
><TH
ALIGN="LEFT"
VALIGN="TOP"
>Bandera</TH
><TH
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
>Descripción</TH
></TR
></THEAD
><TBODY
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>N</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Ajustar la velocidad de línea a <TT
CLASS="LITERAL"
>N</TT
> bits por segundo.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>crtsdts</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Habilitar/Deshabilitar negociación por hardware.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>ixon</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Habilitar/Deshabilitar control de flujo mediante XON/XOFF.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>clocal</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Habilitar/Deshabilitar señales de control del módem como DTR/DTS y
	DCD. Esto es necesario si se usa cable serie de &ldquo;tres hilos&rdquo;
	ya que no proporciona estas señales.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>cs5 cs6 cs7 cs8</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Ajustar el número de bits de datos a 5, 6, 7 u 8, respectivamente.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>parodd</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Habilitar paridad impar. Desactivar esta bandera activa la paridad par.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>parenb</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Habilitar comprobación de paridad. Si esta bandera se niega, no se
	utiliza paridad.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>cstopb</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Ajustar los bits de parada a dos por carácter. Al negar esta
	bandera, se usará sólo un bit de parada por carácter.
	</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
><TT
CLASS="LITERAL"
>echo</TT
></TD
><TD
WIDTH="343"
ALIGN="LEFT"
VALIGN="TOP"
><P
>	Habilitar/Deshabilitar el eco de caracteres recibidos al que los envía.
	</P
></TD
></TR
></TBODY
></TABLE
></DIV
><P
>El siguiente ejemplo combina algunas de estas banderas y configura
el dispositivo <TT
CLASS="FILENAME"
>ttyS0</TT
> a 19.200 bps, 8 bits de
datos, sin paridad, con negociación por hardware y eco deshabilitado:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    $ <TT
CLASS="USERINPUT"
><B
>stty 19200 cs8 -parenb crtscts -echo -F /dev/ttyS0</B
></TT
></PRE
></TD
></TR
></TABLE
>&#13;</P
><P
></P
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="x-087-2-serial.hardware.html"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Inicio</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="x-087-2-serial.getty.html"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Hardware Serie</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="x-087-2-serial.html"
ACCESSKEY="U"
>Subir</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Dispositivos Serie y el Indicador login: (ingreso)</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>