<HTML
><HEAD
><TITLE
>Usando dip</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.76b+
"><LINK
REL="HOME"
TITLE="Guía de Administración de Redes con Linux"
HREF="index.html"><LINK
REL="UP"
TITLE="SLIP: IP por línea serie"
HREF="x-087-2-slip.html"><LINK
REL="PREVIOUS"
TITLE="Trabajando con direcciones de red IP privadas"
HREF="x6095.html"><LINK
REL="NEXT"
TITLE="Funcionamiento en modo Servidor"
HREF="x-087-2-slip.server.html"><LINK
REL="STYLESHEET"
TYPE="text/css"
HREF="publicacoes.css"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Guía de Administración de Redes con Linux</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="x6095.html"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Capítulo 7. SLIP: IP por línea serie</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="x-087-2-slip.server.html"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="X-087-2-SLIP.DIP">7.4. Usando dip</H1
><P
>Lo visto anteriormente es simple. Sin embargo, se pueden automatizar estas tareas.
Es mucho más práctico tener solamente un orden que realice los pasos necesarios para
activar la línea serie, que el módem llame al proveedor de Internet, comenzar la sesión, 
activar la disciplina de línea SLIP, y por último, configurar la interfaz de red. 
Para todo esto esta la orden <B
CLASS="COMMAND"
>dip</B
>.</P
><P
><B
CLASS="COMMAND"
>dip</B
> significa <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>Dialup IP</I
></SPAN
> (enlace IP telefónico). Fue 
escrito por Fred van Kempen y ha sufrido bastantes modificaciones de mucha gente.
Es actualmente utilizado por todo el mundo. La versión <TT
CLASS="LITERAL"
>dip337p-uri</TT
>, se encuentra en
casi todas las distribuciones de GNU/Linux actuales, o también a través de FTP en
<SPAN
CLASS="SYSTEMITEM"
>metalab.unc.edu</SPAN
>.</P
><P
><B
CLASS="COMMAND"
>dip</B
> provee un intérprete para un lenguaje de guiones simple que puede
manejar el módem , convertir la línea a modo SLIP y configurar las interfaces.
Este lenguaje de guiones es poderoso a la hora de manejar diferentes configuraciones.</P
><P
>&#13;


Para poder configurar la interfaz SLIP, <B
CLASS="COMMAND"
>dip</B
>
requiere privilegios de superusuario. Puede hacerse cambiando al programa <B
CLASS="COMMAND"
>dip</B
> 
el bit setuid como <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> para que todos los usuarios puedan 
conectarse a cualquier servidor SLIP sin tener privilegios de superusuario. Esto es muy peligroso, ya que una 
configuración incorrecta del encaminamiento de <B
CLASS="COMMAND"
>dip</B
> puede estropear el encaminamiento 
en su red. Aun peor, esto dará a los usuarios la posibilidad de conectarse a <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>cualquier</I
></SPAN
>
servidor SLIP y lanzar desde allí, peligrosos ataques a su red.
Si desea que los usuarios puedan activar conexiones SLIP, escriba pequeños programas empaquetados por cada perspectiva
de conexión a los diferentes servidores SLIP y que esos pequeños programas invoquen a <B
CLASS="COMMAND"
>dip</B
>
con guiones (scripts) específicos para establecer las conexiones.
Bien escritos, estos programas pueden ser fácilmente habilitados con el bit setuid de superusuario <SPAN
CLASS="SYSTEMITEM"
>(root)</SPAN
>.<A
NAME="X-087-2-FNSL1"
HREF="#FTN.X-087-2-FNSL1"
>[1]</A
> Una alternativa un poco más flexible, es darle a los usuarios,
acceso verdadero a <B
CLASS="COMMAND"
>dip</B
> como superusuario, utilizando alguna herramienta como por ejemplo
<B
CLASS="COMMAND"
>sudo</B
>.&#13;</P
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="X-087-2-SLIP.DIP.SAMPLE">7.4.1. Un guión de ejemplo</H2
><P
>Asumiendo que el servidor al cual nos queremos conectar vía SLIP se llama 
<SPAN
CLASS="SYSTEMITEM"
>cowslip</SPAN
>, y que se ha escrito un guión para que <B
CLASS="COMMAND"
>dip</B
>
 lo interprete llamado <TT
CLASS="FILENAME"
>cowslip.dip</TT
>, el cual hará la conexión.
Al programa  <B
CLASS="COMMAND"
>dip</B
>,  hay que pasarle como argumento, el nombre del guión:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    # <TT
CLASS="USERINPUT"
><B
>dip cowslip.dip</B
></TT
>
    DIP: Dialup IP Protocol Driver version 3.3.7 (12/13/93)
    Written by Fred N. van Kempen, MicroWalt Corporation.
    connected to cowslip.moo.com with addr 192.168.5.74
    #</PRE
></TD
></TR
></TABLE
></P
><P
>El codigo del guión es mostrado en el <A
HREF="x-087-2-slip.dip.html#X-087-2-SLIP.FIG.SCRIPT"
>Ejemplo 7-1</A
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="X-087-2-SLIP.FIG.SCRIPT"><P
><B
>Ejemplo 7-1. Un ejemplo de guión para dip</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    # Ejemplo de guión en dip para conectarse al servidor cowslip
    # Configurar los nombres locales y remotos  y las direcciones
    	get $local vlager-slip
    	get $remote cowslip
    	port ttyS3               # Selección del puerto serie
    	speed 38400              # Configurar la velocidad máxima
    	modem HAYES              # Selección del modelo del Módem 
    	reset                    # reiniciar el módem y la terminal
    	flush                    # limpiar el búffer de respuesta del módem 
    # Prepararse para marcar.
    	send ATQ0V1E1X1\r
    	wait OK 2
    	if $errlvl != 0 goto error
    	dial 41988
    	if $errlvl != 0 goto error
    	wait CONNECT 60
    	if $errlvl != 0 goto error
    
    # Bien, se estableció la conexión
    	sleep 3
    	send \r\n\r\n
    	wait ogin: 10
    	if $errlvl != 0 goto error
    	send Svlager\n
    	wait ssword: 5
    	if $errlvl != 0 goto error
    	send knockknock\n
    	wait running 30
    	if $errlvl != 0 goto error
    # Se comenzó la sesión, y del extremo remoto se activó SLIP.
    	print Conectado a $remote con dirección $rmtip
    	default                  # hacer que este enlace sea la ruta predeterminada
    	mode SLIP                # Pasemos a modo SLIP
    # en caso de error se ejecuta lo siguiente
    error:
    	print La onexión SLIP a $remote ha fallado.</PRE
></TD
></TR
></TABLE
></DIV
><P
>&#13;
Una vez conectado a <SPAN
CLASS="SYSTEMITEM"
>cowslip</SPAN
>
y activo el SLIP, <B
CLASS="COMMAND"
>dip</B
> pasará a ejecutarse en segundo plano.
Ahora puede empezar a trabajar con sus los programas habituales de red a través del enlace SLIP.
Para terminar la conexión, simplemente invoque a <B
CLASS="COMMAND"
>dip</B
> con el parámetro
<TT
CLASS="OPTION"
>&ndash;k</TT
>. Esto envía la señal de cortar (hangup) a
<B
CLASS="COMMAND"
>dip</B
>, junto con  el identificador de proceso que <B
CLASS="COMMAND"
>dip</B
>
escribió en el fichero <TT
CLASS="FILENAME"
>/etc/dip.pid</TT
> al comenzar:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    # <TT
CLASS="USERINPUT"
><B
>dip -k</B
></TT
></PRE
></TD
></TR
></TABLE
></P
><P
>En el lenguaje  de guiones que <B
CLASS="COMMAND"
>dip</B
> interpreta, las palabras clave precedidas con el signo 
de dólar significan nombre de variables. <B
CLASS="COMMAND"
>dip</B
> tiene un conjunto de variables que están
listadas a continuación. <SPAN
CLASS="SYSTEMITEM"
>$remote</SPAN
> y
<SPAN
CLASS="SYSTEMITEM"
>$local</SPAN
>, por ejemplo, contienen los nombres de
los computadores remoto y local involucrados en la conexión SLIP.</P
><P
>Las dos primeras declaraciones en el ejemplo, son órdenes <B
CLASS="COMMAND"
>get</B
>,
que es la forma en que <B
CLASS="COMMAND"
>dip</B
> declara una variable. Aquí, los nombres de las 
computadoras local y remota son <SPAN
CLASS="SYSTEMITEM"
>vlager</SPAN
> y
<SPAN
CLASS="SYSTEMITEM"
>cowslip</SPAN
>, respectivamente.</P
><P
>&#13;las cinco declaraciones siguientes preparan la terminal de línea y el módem . la orden
<SPAN
CLASS="SYSTEMITEM"
>reset</SPAN
> envía la cadena de reinicio al módem.
La siguiente sentencia limpia el búffer de salida del módem , para conseguir que el
diálogo de  registro (login) en las siguientes líneas trabaje correctamente. 
Este dialogo es extremadamente simple: simplemente marca 41988, el número telefónico 
de <SPAN
CLASS="SYSTEMITEM"
>cowslip</SPAN
>, y ae regiatra en la cuenta
<SPAN
CLASS="SYSTEMITEM"
>Svlager</SPAN
> usando la contraseña
<SPAN
CLASS="SYSTEMITEM"
>knockknock</SPAN
>. La orden
<SPAN
CLASS="SYSTEMITEM"
>wait</SPAN
> hace que <B
CLASS="COMMAND"
>dip</B
>
espere una cadena dada como primer argumento; el número dado como segundo argumento es el tiempo (en segundos)
que se debe esperar por esa cadena. la orden <SPAN
CLASS="SYSTEMITEM"
>if</SPAN
> ,en 
el proceso de entrada, revisa que no se produzcan errores.</P
><P
>Las órdenes finales, tras un correcto registro, son <SPAN
CLASS="SYSTEMITEM"
>default</SPAN
>,
que hace que el enlace SLIP sea la ruta predeterminada a todos los servidores, y <SPAN
CLASS="SYSTEMITEM"
>mode</SPAN
>,
que activa el modo SLIP en la línea y configura la interfaz y la tabla de rutas.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="X-087-2-SLIP.DIP.REFERENCE">7.4.2. Referencia de dip</H2
><P
>En esta sección, se hará referencia a las órdenes de <B
CLASS="COMMAND"
>dip</B
> más usadas.
usted puede obtener un vistazo de todos los órdenes reconocidos invocando a <B
CLASS="COMMAND"
>dip</B
> en modo prueba
e introduciendo la orden <SPAN
CLASS="SYSTEMITEM"
>help</SPAN
>.
Para conocer más sobre la sintaxis de una orden, se  debe teclear 
sin argumentos. Recuerde que esto no funcionará con órdenes que no aceptan argumentos.
El siguiente ejemplo ilustra el funcionamiento de la orden <SPAN
CLASS="SYSTEMITEM"
>help</SPAN
>:</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    # <TT
CLASS="USERINPUT"
><B
>dip -t</B
></TT
>
    DIP: Dialup IP Protocol Driver version 3.3.7p-uri (25 Dec 96)
    Written by Fred N. van Kempen, MicroWalt Corporation.
    Debian version 3.3.7p-2 (debian).
    
    DIP&#62; <TT
CLASS="USERINPUT"
><B
>help</B
></TT
>
    DIP knows about the following commands:
    
    	beep         bootp        break        chatkey      config       
    	databits     dec          default      dial         echo         
    	flush        get          goto         help         if           
    	inc          init         mode         modem        netmask      
    	onexit       parity       password     proxyarp     print        
    	psend        port         quit         reset        securidfixed 
    	securid      send         shell        skey         sleep        
    	speed        stopbits     term         timeout      wait         
    
    DIP&#62; <TT
CLASS="USERINPUT"
><B
>echo</B
></TT
>
    Usage: echo on|off
    DIP&#62;</PRE
></TD
></TR
></TABLE
></P
><P
>En los párrafos siguientes, los ejemplos que muestran el cursor <B
CLASS="COMMAND"
>DIP&thinsp;&#62;</B
> 
indican como teclear un orden en modo prueba y cual será su respuesta. 
Los ejemplos mostrados sin el cursor, deben tomarse como trozos de guiones.</P
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN6230">7.4.2.1. Las órdenes del módem</H3
><P
> 
<B
CLASS="COMMAND"
>dip</B
> provee algunas órdenes para configurar el puerto serie y el modem .
Algunos son obvios como la orden
<SPAN
CLASS="SYSTEMITEM"
>port</SPAN
>, que selecciona el puerto serie, y
<SPAN
CLASS="SYSTEMITEM"
>speed</SPAN
>,
<SPAN
CLASS="SYSTEMITEM"
>databits</SPAN
>,
<SPAN
CLASS="SYSTEMITEM"
>stopbits</SPAN
>, y
<SPAN
CLASS="SYSTEMITEM"
>parity</SPAN
>, que configura los parámetros más 
comunes de la línea.

La orden <SPAN
CLASS="SYSTEMITEM"
>módem </SPAN
> selecciona el tipo de módem .
Actualmente, sólo esta soportado el tipo <SPAN
CLASS="SYSTEMITEM"
>HAYES</SPAN
> (en mayúsculas).
Se debe proveer a  <B
CLASS="COMMAND"
>dip</B
> con el tipo de módem , o éste se negará a ejecutar las órdenes
<SPAN
CLASS="SYSTEMITEM"
>dial</SPAN
> y
<SPAN
CLASS="SYSTEMITEM"
>reset</SPAN
>. La orden
<SPAN
CLASS="SYSTEMITEM"
>reset</SPAN
> envía la cadena de reinicio (reset) al módem;
el tipo de cadena depende del modelo y marca del módem. Para modems compatibles con Hayes, esta cadena es 
<SPAN
CLASS="SYSTEMITEM"
>ATZ</SPAN
>.</P
><P
>la orden <SPAN
CLASS="SYSTEMITEM"
>flush</SPAN
> puede usarse para vaciar todas las 
respuestas que el módem envió hasta ese momento. De otro modo, un guión de diálogo que ejecute un
<SPAN
CLASS="SYSTEMITEM"
>reset</SPAN
> podría confundirse si leyese un
<SPAN
CLASS="SYSTEMITEM"
>OK</SPAN
> como respuesta de algún orden anterior.</P
><P
>La orden <SPAN
CLASS="SYSTEMITEM"
>init</SPAN
> selecciona la cadena de 
inicialización enviada al módem antes de marcar.
predeterminada, para modems Hayes es &ldquo;<SPAN
CLASS="SYSTEMITEM"
>ATE0 Q0
V1 X1</SPAN
>&rdquo;, que activa el eco de las órdenes y los códigos de retorno, además
selecciona el modo de marcado a ciegas (no comprueba si la línea tiene tono).
Los modems modernos, vienen con una buena configuración de fabrica, así que esto es 
un poco innecesario, pero no hace daño alguno.</P
><P
>La orden <SPAN
CLASS="SYSTEMITEM"
>dial</SPAN
> envía la cadena de inicialización 
al módem y llama al sistema remoto. La orden predeterminada para modems tipo Hayes es <SPAN
CLASS="SYSTEMITEM"
>ATD</SPAN
>.</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN6260">7.4.2.2. La Orden echo</H3
><P
>La orden <SPAN
CLASS="SYSTEMITEM"
>echo</SPAN
> sirve como depurador.
Invocar <SPAN
CLASS="SYSTEMITEM"
>echo on</SPAN
> hace que
<B
CLASS="COMMAND"
>dip</B
> copie en la consola todo lo que se envía por el puerto serie.
Este modo puede desactivarse invocando <SPAN
CLASS="SYSTEMITEM"
>echo off</SPAN
>.</P
><P
><B
CLASS="COMMAND"
>dip</B
>  Puede salir del modo guión temporalmente para entrar en modo terminal.
En este modo, usted puede usar a <B
CLASS="COMMAND"
>dip</B
> como cualquier programa de terminal ordinario,
enviando caracteres a través de la línea serie, leyéndolos y mostrarlos. Para abandonar este modo, presione Ctrl-].</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN6270">7.4.2.3. La Orden get</H3
><P
> 
la orden <SPAN
CLASS="SYSTEMITEM"
>get</SPAN
> es la forma en que
<B
CLASS="COMMAND"
>dip</B
> carga una variable. Su uso más simple es inicializar una constante,
como se vió en el ejemplo de <TT
CLASS="FILENAME"
>cowslip.dip</TT
>.
usted también puede utilizarlo desde la consola en conjunto con <SPAN
CLASS="SYSTEMITEM"
>ask</SPAN
>:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    DIP&#62; <TT
CLASS="USERINPUT"
><B
>get $local ask</B
></TT
>
    Enter the value for $local: _</PRE
></TD
></TR
></TABLE
></P
><P
>Un tercer método, es usado para obtener el nombre del servidor remoto.
Aunque extraño parezca al principio, es muy útil en algunos casos.
Algunos servidores, no permiten que usted use su propia dirección IP en un enlace SLIP,
sino que le asignará una de un conjunto ya establecido cuando se establezca la conexión,
mostrando un mensaje que le informe que dirección le fue asignada. 
Si el mensaje luce parecido a &ldquo;<TT
CLASS="LITERAL"
>Your address: 192.168.5.74</TT
>&rdquo;,
el siguiente ejemplo hará que <B
CLASS="COMMAND"
>dip</B
> use la dirección asignada:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    # finish login
    wait address: 10
    get $locip remote</PRE
></TD
></TR
></TABLE
></P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN6285">7.4.2.4. La Orden print</H3
><P
> 
Esta orden es usado para enviar cualquier texto a la consola cuando se invoque a
<B
CLASS="COMMAND"
>dip</B
>. Cualquier variable usada por <B
CLASS="COMMAND"
>dip</B
>
puede ser utilizada para enviar mensajes, como por ejemplo:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    DIP&#62; <TT
CLASS="USERINPUT"
><B
>print Usando puerto $port a la velocidad de $speed baudios</B
></TT
>
    Usando puerto ttyS3 a la velocidad de 38400 baudios</PRE
></TD
></TR
></TABLE
></P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN6294">7.4.2.5. Nombres de variables</H3
><P
><B
CLASS="COMMAND"
>dip</B
> entiende solamente un grupo predefinido de variables. Un 
nombre de variable siempre debe comenzar con el signo de dólar y debe estar en minúsculas.</P
><P
>Las variables <SPAN
CLASS="SYSTEMITEM"
>$local</SPAN
> y <SPAN
CLASS="SYSTEMITEM"
>$locip</SPAN
> contienen el nombre de la máquina local y su dirección IP.
Cuando se guarda el nombre canónico de la máquina local en <SPAN
CLASS="SYSTEMITEM"
>$local</SPAN
>,
<B
CLASS="COMMAND"
>dip</B
> intentará resolverlo para conseguir la dirección IP y 
guardarla en la variable <SPAN
CLASS="SYSTEMITEM"
>$locip</SPAN
>.
Un proceso similar, pero al revés, sucede cuando se guarda la dirección IP en la variable
<SPAN
CLASS="SYSTEMITEM"
>$locip</SPAN
>;
<B
CLASS="COMMAND"
>dip</B
> intentará resolver el nombre de la máquina local a partir de la dirección IP
y guardarlo en la variable <SPAN
CLASS="SYSTEMITEM"
>$local</SPAN
>.</P
><P
>Las variables <SPAN
CLASS="SYSTEMITEM"
>$remote</SPAN
> y
<SPAN
CLASS="SYSTEMITEM"
>$rmtip</SPAN
> operan de la misma manera,
pero con el nombre y la dirección IP de la máquina remota.
la variable <SPAN
CLASS="SYSTEMITEM"
>$mtu</SPAN
> contiene el valor MTU 
para la conexión actual.</P
><P
>Estas cinco variables son las únicas que pueden ser asignadas con valores usando la orden
<SPAN
CLASS="SYSTEMITEM"
>get</SPAN
>. El contenido de algunas variables,
son el resultado de configuraciones realizadas por órdenes que llevan el mismo nombre, 
pero pueden ser utilizadas junto con la orden <SPAN
CLASS="SYSTEMITEM"
>print</SPAN
>;
Estas variables son <SPAN
CLASS="SYSTEMITEM"
>$modem</SPAN
>,
<SPAN
CLASS="SYSTEMITEM"
>$port</SPAN
>, y
<SPAN
CLASS="SYSTEMITEM"
>$speed</SPAN
>.</P
><P
>La variable <SPAN
CLASS="SYSTEMITEM"
>$errlvl</SPAN
> contiene el resultado
de la última orden ejecutada.
Un nivel de error 0 indica que la orden se ejecutó satisfactoriamente, si este número 
es mayor o menor, indica que hubo algún problema en la ejecución.</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN6319">7.4.2.6. Órdenes if y goto</H3
><P
>la orden <SPAN
CLASS="SYSTEMITEM"
>if</SPAN
> ejecuta un salto condicional,
y se comporta de la misma manera que su par usado en programación. 
Su sintaxis es:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    if <TT
CLASS="REPLACEABLE"
><I
>var</I
></TT
> <TT
CLASS="REPLACEABLE"
><I
>op</I
></TT
> <TT
CLASS="REPLACEABLE"
><I
>number</I
></TT
> goto <TT
CLASS="REPLACEABLE"
><I
>label</I
></TT
></PRE
></TD
></TR
></TABLE
></P
><P
>La expresión, realiza una simple comparación entre una de estas variables
<SPAN
CLASS="SYSTEMITEM"
>$errlvl</SPAN
>,
<SPAN
CLASS="SYSTEMITEM"
>$locip</SPAN
>, y
<SPAN
CLASS="SYSTEMITEM"
>$rmtip</SPAN
>.
<TT
CLASS="REPLACEABLE"
><I
>var</I
></TT
> debe ser un numero entero (integer); el operador
<TT
CLASS="REPLACEABLE"
><I
>op</I
></TT
> debe ser uno de estos: <TT
CLASS="LITERAL"
>==</TT
>,
<TT
CLASS="LITERAL"
>!=</TT
>, <TT
CLASS="LITERAL"
>&lt;</TT
>, <TT
CLASS="LITERAL"
>&gt;</TT
>,
<TT
CLASS="LITERAL"
>&lt;=</TT
>, y <TT
CLASS="LITERAL"
>&gt;=</TT
>.</P
><P
>La orden <SPAN
CLASS="SYSTEMITEM"
>goto</SPAN
> (ir a) hace que la ejecución del guión
continúe donde se encuentra definida la etiqueta pasada como parámetro a la orden
(<TT
CLASS="REPLACEABLE"
><I
>label</I
></TT
>).
Una etiqueta (label) debe ser la primer palabra en una línea, seguida de dos puntos(:)</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN6343">7.4.2.7. Órdenes send, wait, y sleep</H3
><P
>Estas órdenes ayudan a implementar sencillos guiones de diálogo en <B
CLASS="COMMAND"
>dip</B
>.
la orden <SPAN
CLASS="SYSTEMITEM"
>send</SPAN
> envía sus argumentos 
a la línea serie. No soporta el uso de variables, pero entiende todas las secuencias de escape al 
estilo del lenguaje C, como <SPAN
CLASS="SYSTEMITEM"
>\n</SPAN
> para nueva línea y <SPAN
CLASS="SYSTEMITEM"
>\b</SPAN
> para retroceso. El carácter de tilde (~)
puede ser usada como una abreviatura del carácter de retorno de carro / nueva línea.</P
><P
>La orden <SPAN
CLASS="SYSTEMITEM"
>wait</SPAN
> toma una palabra como
argumento y leerá todo lo que entre por la línea serie hasta que detecte una secuencia de caracteres
que coincida con esa palabra. Esa palabra no puede contener caracteres en blanco.
Opcionalmente, se le puede pasar a <SPAN
CLASS="SYSTEMITEM"
>wait</SPAN
> un tiempo de espera como segundo argumento;
Si la palabra esperada, no es recibida en ese tiempo de espera la variable <SPAN
CLASS="SYSTEMITEM"
>$errlvl</SPAN
> se cargará con un 1. Esta orden se usa 
generalmente en la detección de registros (login) y otros símbolos de espera.</P
><P
>La orden <SPAN
CLASS="SYSTEMITEM"
>sleep</SPAN
> puede usarse para esperar
una determinada cantidad de tiempo; Por ejemplo, esperar pacientemente a que la secuencia de 
ingreso se complete. Nuevamente, el intervalo se expresa en segundos.</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN6356">7.4.2.8. Órdenes mode y default</H3
><P
>Estas órdenes se usan para pasar la línea de modo serie a modo 
SLIP y para configurar la interfaz. </P
><P
>La orden <SPAN
CLASS="SYSTEMITEM"
>mode</SPAN
> es la última ejecutada por
<B
CLASS="COMMAND"
>dip</B
> antes de pasar al modo demonio. A menos que ocurra un error, 
esta orden no retorna.</P
><P
><SPAN
CLASS="SYSTEMITEM"
>mode</SPAN
> toma el nombre del protocolo como argumento.
La versión actual de <B
CLASS="COMMAND"
>dip</B
> reconoce los siguientes:
<SPAN
CLASS="SYSTEMITEM"
>SLIP</SPAN
>,
<SPAN
CLASS="SYSTEMITEM"
>CSLIP</SPAN
>,
<SPAN
CLASS="SYSTEMITEM"
>SLIP6</SPAN
>,
<SPAN
CLASS="SYSTEMITEM"
>CSLIP6</SPAN
>,
<SPAN
CLASS="SYSTEMITEM"
>PPP</SPAN
>,
y <SPAN
CLASS="SYSTEMITEM"
>TERM</SPAN
> como nombres válidos.
Esta versión de <B
CLASS="COMMAND"
>dip</B
> no entiende SLIP adaptable.</P
><P
>Después de poner la línea en modo SLIP, <B
CLASS="COMMAND"
>dip</B
> ejecuta
<B
CLASS="COMMAND"
>ifconfig</B
> para configurar la interfaz como enlace punto a punto,
e invocar a <B
CLASS="COMMAND"
>route</B
> para cambiar el 
encaminamiento hacia el servidor remoto.</P
><P
>Si, además, el guión se ejecutase la orden <SPAN
CLASS="SYSTEMITEM"
>default</SPAN
> antes que <SPAN
CLASS="SYSTEMITEM"
>mode</SPAN
>, <B
CLASS="COMMAND"
>dip</B
> hará 
que el camino predeterminado de los paquetes sea encaminado al enlace SLIP.</P
></DIV
></DIV
></DIV
><H3
CLASS="FOOTNOTES"
>Notas</H3
><TABLE
BORDER="0"
CLASS="FOOTNOTES"
WIDTH="100%"
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.X-087-2-FNSL1"
HREF="x-087-2-slip.dip.html#X-087-2-FNSL1"
>[1]</A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
><B
CLASS="COMMAND"
>diplogin</B
>
debe activarse con el bit setuid como <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
>.
Examine la sección al final de este capítulo. </P
></TD
></TR
></TABLE
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="x6095.html"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Inicio</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="x-087-2-slip.server.html"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Trabajando con direcciones de red IP privadas</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="x-087-2-slip.html"
ACCESSKEY="U"
>Subir</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Funcionamiento en modo Servidor</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>