<HTML
><HEAD
><TITLE
>Dispositivos Serie y el Indicador login: (ingreso)</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.76b+
"><LINK
REL="HOME"
TITLE="Guía de Administración de Redes con Linux"
HREF="index.html"><LINK
REL="UP"
TITLE="Configuración del Hardware Serie"
HREF="x-087-2-serial.html"><LINK
REL="PREVIOUS"
TITLE="Uso de las Utilidades de Configuración"
HREF="x-087-2-serial-configuration.html"><LINK
REL="NEXT"
TITLE="Configuración del Protocolo TCP/IP"
HREF="x-087-2-iface.html"><LINK
REL="STYLESHEET"
TYPE="text/css"
HREF="publicacoes.css"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Guía de Administración de Redes con Linux</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="x-087-2-serial-configuration.html"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Capítulo 4. Configuración del Hardware Serie</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="x-087-2-iface.html"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="X-087-2-SERIAL.GETTY">4.6. Dispositivos Serie y el Indicador login: (ingreso)</H1
><P
>Llegó a ser muy común que una instalación basada en Unix incluyera
una máquina servidor y muchos terminales &ldquo;tontos&rdquo; (sin
procesamiento) de caracteres o módems para acceso telefónico. Hoy
en día este tipo de configuraciones son menos comunes, lo que
supone una buena noticia para mucha gente interesada en trabajar
así, ya que estos terminales sin procesamiento son muy baratos
actualmente. Las configuraciones con módems de acceso telefónico
no han dejado de ser comunes, pero en estos tiempos probablemente
se utilicen como soporte para ingresos mediante SLIP o PPP (temas
tratados en <A
HREF="x-087-2-slip.html"
>Capítulo 7</A
> y <A
HREF="x-087-2-ppp.html"
>Capítulo 8</A
>&thinsp;) más que para un simple ingreso.
En cualquier caso, cada uno de estos métodos puede hacer uso
de un programa sencillo llamado programa <B
CLASS="COMMAND"
>getty</B
>.</P
><P
>El término <B
CLASS="COMMAND"
>getty</B
> es probablemente una abreviatura
de &ldquo;get tty&rdquo; (conseguir tty). Un programa
<B
CLASS="COMMAND"
>getty</B
> abre un dispositivo serie, lo configura
apropiadamente, configura opcionalmente un módem, y espera a que
se realice una conexión. Una conexión activa en un dispositivo serie se indica
normalmente mediante la patilla Data Carrier Detect (DCD) en el dispositivo
serie que ha sido activado. Cuando se produce esta detección,
el programa <B
CLASS="COMMAND"
>getty</B
> llama a un programa que
muestra el punto indicativo <TT
CLASS="LITERAL"
>login:</TT
>, y es el que maneja
realmente el ingreso al sistema. Cada uno de los terminales virtuales (por
ejemplo, <TT
CLASS="FILENAME"
>/dev/tty1</TT
>) en GNU/Linux tiene un
<B
CLASS="COMMAND"
>getty</B
> ejecutándose para él.</P
><P
>Hay varias implementaciones distintas de <B
CLASS="COMMAND"
>getty</B
>,
cada una diseñada para adaptarse a ciertas configuraciones mejor que
a otras. El <B
CLASS="COMMAND"
>getty</B
> que describiremos aquí
se llama <B
CLASS="COMMAND"
>mgetty</B
>. Es bastante conocido porque
proporciona todo tipo de características que lo hacen especialmente
indicado para uso con módems, aceptando incluso programas automáticos
para fax y módems de voz. Nos concentraremos en configurar
<B
CLASS="COMMAND"
>mgetty</B
> para responder a las llamadas
convencionales de datos, y dejaremos el resto para que explore usted
en función de sus necesidades.</P
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="X-087-2-SERIAL.GETTY.MGETTY">4.6.1. Configuración del Demonio mgetty</H2
><P
>El demonio <B
CLASS="COMMAND"
>mgetty</B
> está disponible en forma de
código fuente en <SPAN
CLASS="SYSTEMITEM"
>ftp://alpha.greenie.net/pub/mgetty/source/</SPAN
>,
y prácticamente todas las distribuciones de GNU/Linux lo incluyen como paquete.
El demonio <B
CLASS="COMMAND"
>mgetty</B
> se diferencia de la mayoría
de las implementaciones de programas <B
CLASS="COMMAND"
>getty</B
> en
que ha sido diseñado específicamente para módems compatibles con
Hayes. Admite aún conexiones directas de terminales, pero se adapta
de forma especialmente buena a aplicaciones de llamadas telefónicas.
En lugar de emplear la señal DCD para detectar una llamada entrante,
espera a la escucha del mensaje <TT
CLASS="LITERAL"
>RING</TT
> generado
por la mayoría de módems modernos cuando detectan una llamada entrante
y no están configurados para responder automáticamente.</P
><P
>El ejecutable principal es <TT
CLASS="FILENAME"
>/usr/sbin/mgetty</TT
>,
y su fichero de configuración se llama
<TT
CLASS="FILENAME"
>/etc/mgetty/mgetty.config</TT
>. Hay otros
programas y ficheros de configuración que cubrirán otros rasgos
concretos de <B
CLASS="COMMAND"
>mgetty</B
>.</P
><P
>La configuración, en gran parte de los sistemas, es cuestión únicamente
de editar el fichero <TT
CLASS="FILENAME"
>/etc/mgetty/ mgetty.config</TT
>
y añadir las entradas apropiadas a <TT
CLASS="FILENAME"
>/etc/inittab</TT
>
para que <B
CLASS="COMMAND"
>mgetty</B
> se ejecute automáticamente.</P
><P
><A
HREF="x-087-2-serial.getty.html#X-087-2-SERIAL.MGETTY.CONF"
>Ejemplo 4-6</A
> muestra un fichero
muy simple de configuración de <B
CLASS="COMMAND"
>mgetty</B
>.
Este ejemplo configura dos dispositivos serie. El primero,
<TT
CLASS="FILENAME"
>/dev/ttyS0</TT
>, se refiere a un módem
compatible con Hayes a 38.400 bps. El segundo,
<TT
CLASS="FILENAME"
>/dev/ttyS1</TT
>, se corresponde con un terminal
VT100 conectado directamente, a 19.200 bps.</P
><P
><DIV
CLASS="EXAMPLE"
><A
NAME="X-087-2-SERIAL.MGETTY.CONF"><P
><B
>Ejemplo 4-6. Fichero /etc/mgetty/mgetty.config de ejemplo</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    #
    # fichero de configuración de mgetty
    #
    # este es un fichero de ejemplo de configuración, vea mgetty.info para obtener detalles
    #
    # las líneas de comentario  comienzan con "#", las líneas vacías son deshechadas
    #
    # ----- sección global -----
    #
    # En esta sección van los valores globales por defecto, la configuración por puertos va debajo
    #
    # acceder al módem (o módems) a 38400 bps
    speed 38400
    #
    # ajustar el nivel global de depuración a "4" (valor por defecto de policy.h)
    debug 4
    #
    
    # ----- sección específica de puerto -----
    #
    # Aquí se pondran las cosas que sean válidas sólo para una línea, no las demás
    #
    #
    # Módem Hayes conectado a ttyS0: no usar como fax, menos registro de actividad
    #
    port ttyS0
      debug 3
      data-only y
    #
    # conexión directa de un terminal VT100 que no gusta de bajadas en la señal DTR
    #
    port ttyS1
      direct y
      speed 19200
      toggle-dtr n
    #</PRE
></TD
></TR
></TABLE
></DIV
></P
><P
>El fichero de configuración acepta opciones globales y específicas de cada puerto.
En nuesto ejemplo, empleamos una opción global para fijar la velocidad a
38.400 bps. Este valor es heredado por el puerto <TT
CLASS="FILENAME"
>ttyS0</TT
>.
Los puertos a los que aplicamos <B
CLASS="COMMAND"
>mgetty</B
> emplean
este ajuste de velocidad a no ser que sea reemplazado por un ajuste de
velocidad explícito para el puerto, tal y como hemos hecho en la configuración
de <TT
CLASS="FILENAME"
>ttyS1</TT
>.</P
><P
>La palabra clave <TT
CLASS="LITERAL"
>debug</TT
> controla la cantidad de texto
del registro de actividad de <B
CLASS="COMMAND"
>mgetty</B
>. La palabra
clave <TT
CLASS="LITERAL"
>data-only</TT
> en la configuración de
<TT
CLASS="FILENAME"
>ttyS0</TT
> hace que <B
CLASS="COMMAND"
>mgetty</B
>
desprecie las características de fax del módem, para que funcione
únicamente como módem de datos. La palabra <TT
CLASS="LITERAL"
>direct</TT
>
en la configuración de <TT
CLASS="FILENAME"
>ttyS1</TT
> avisa a
<B
CLASS="COMMAND"
>mgetty</B
> para que no lleve a cabo ninguna
inicialización para módem en ese puerto. Finalmente, con
<TT
CLASS="LITERAL"
>toggle-dtr</TT
> se consigue que
<B
CLASS="COMMAND"
>mgetty</B
> no trate de colgar la línea
bajando la patilla DTR (Data Terminal Ready) en el interfaz serie;
algunos terminales no reaccionan bien ante esto.</P
><P
>También puede usted elegir dejar vacío el fichero
<TT
CLASS="FILENAME"
>mgetty.config</TT
> y emplear argumentos en la
línea de órdenes para especificar la mayoría de esos mismos
parámetros. La documentación que acompaña a la aplicación
incluye una completa descripción de los parámetros
del fichero de configuración de <B
CLASS="COMMAND"
>mgetty</B
>
y los argumentos de línea de órdenes. Observe el siguiente ejemplo.</P
><P
>Hemos de añadir dos entradas al fichero <TT
CLASS="FILENAME"
>/etc/inittab</TT
>
para activar esta configuración. El fichero <TT
CLASS="FILENAME"
>inittab</TT
>
es el fichero de configuración de la orden <B
CLASS="COMMAND"
>init</B
>
de Unix System V. Esta orden es la encargada de la iniciación
del sistema; proporciona un medio para ejecutar programas
automáticamente al iniciar la máquina y volver a ejecutarlos
cuando terminan. Es muy apropiada para los objetivos de ejecutar
un programa <B
CLASS="COMMAND"
>getty</B
>.</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    T0:23:respawn:/sbin/mgetty ttyS0
    T1:23:respawn:/sbin/mgetty ttyS1</PRE
></TD
></TR
></TABLE
></P
><P
>Cada línea del fichero <TT
CLASS="FILENAME"
>/etc/inittab</TT
> contiene
cuatro campos, separados por dos puntos. El primero es un identificador
que etiqueta de forma única cada entrada del fichero; tradicionalmente
se utilizan dos caracteres, pero las versiones más modernas permiten
cuatro. El segundo campo es la lista de niveles de ejecución en los
que deberá estar activa. Un nivel de ejecución es un mecanismo para
proporcionar distintas configuraciones del equipo y se implementa
mediante el uso de árboles de scripts de inicio, almacenados en
directorios llamados <TT
CLASS="FILENAME"
>/etc/rc1.d</TT
>,
<TT
CLASS="FILENAME"
>/etc/rc2.d</TT
>, etc. Esta característica
es implementada típicamente de forma muy simple, por lo
que usted debe modelar sus entradas en el fichero basándose en
otras del mismo, o bien consultar la documentacion de su
sistema para obtener más información. El tercer campo describe
cuándo hay que llevar a cabo la acción. Para los propósitos de
ejecutar un programa <B
CLASS="COMMAND"
>getty</B
>, este campo
debe ser ajustado a <TT
CLASS="LITERAL"
>respawn</TT
>, lo que significa que
la orden se re-ejecutará automáticamente cuando muera. Hay
otras opciones también, pero no son útiles para nuestros propósitos
aquí. El cuarto campo es la orden real que ha de ejecutarse; aquí
es donde especificamos la orden <B
CLASS="COMMAND"
>mgetty</B
>
y cualquier argumento que queramos pasarle. En nuestro ejemplo simple,
ejecutamos y reiniciamos <B
CLASS="COMMAND"
>mgetty</B
> siempre que
el sistema está operando en los niveles de ejecución dos o tres, y le
suministramos como argumento el nombre del dispositivo que queremos
utilizar. La orden <B
CLASS="COMMAND"
>mgetty</B
> asume
<TT
CLASS="FILENAME"
>/dev/</TT
>, así que no hemos de proporcionarlo.</P
><P
>Este capítulo ha sido una introducción rápida a <B
CLASS="COMMAND"
>mgetty</B
>
y cómo ofrecer un punto identificativo de ingreso al sistema en
dispositivos serie. Podrá encontrar información más extensiva en el
Serial-HOWTO.</P
><P
>Una vez que haya editado los ficheros de configuración ha de
recargar <B
CLASS="COMMAND"
>init</B
> para hacer efectivos los cambios.
Simplemente envíe una señal hangup al proceso <B
CLASS="COMMAND"
>init</B
>;
siempre tiene un identificador de proceso 1, así que puede usar sin
problemas:</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>    # <TT
CLASS="USERINPUT"
><B
>kill -HUP 1</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="x-087-2-serial-configuration.html"
ACCESSKEY="P"
>Anterior</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Inicio</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="x-087-2-iface.html"
ACCESSKEY="N"
>Siguiente</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Uso de las Utilidades de Configuración</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="x-087-2-serial.html"
ACCESSKEY="U"
>Subir</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Configuración del Protocolo TCP/IP</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>