<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>FAQ de R34.LINUX: Introducci&oacute;n</TITLE>
 <LINK HREF="FAQ-R34.LINUX-2.html" REL=next>

 <LINK HREF="FAQ-R34.LINUX.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-R34.LINUX-2.html">Página siguiente</A>
Página anterior
<A HREF="FAQ-R34.LINUX.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>

<P>
<P>Estas <B>FAQ</B> se redactan con varios prop&oacute;sitos. En primer lugar, el
servir de referencia r&aacute;pida para todo reci&eacute;n llegado a Linux que se
encuentra con peque&ntilde;os problemas que no ve otra forma de resolver m&aacute;s que
preguntando. En segundo lugar, el reducir el tr&aacute;fico de mensajes con
preguntas <B>muy respetables</B>, pero repetidas, que consumen una parte
considerable del <EM>ancho de banda</EM> de nuestro area. El tiempo dir&aacute; si
se consigue. Por &uacute;ltimo, y no menos importante, el aliviar un poco a
nuestros <EM>gur&uacute;s</EM> particulares del trabajo de responder siempre a las
mismas preguntas. Ellos lo hacen encantados, pero... <BR>
<P>Todas las preguntas y respuestas recopiladas han aparecido en uno u otro
momento en el area. Habitualmente en bastantes momentos :-). Han sido
retocadas levemente con la idea de ahorrar espacio y hacerlas lo m&aacute;s &uacute;tiles
posible. A algunos parecer&aacute;n importantes y a otros obvias; otros pensar&aacute;n
que faltan o que sobran. A todos, estar&eacute; encantado con vuestras sugerencias.
Tambi&eacute;n se ha inclu&iacute;do alguna referencia a BBSs de Fido o incluso a alg&uacute;n
distribuidor, con el &uacute;nico inter&eacute;s de ser util.
<P>A lo largo de este documento, y al final de cada una de las FAQs se podr&aacute;n
ver l&iacute;neas como la siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
[1] [5]
</PRE>
</CODE></BLOCKQUOTE>
<P>Se trata de referencias a <B>HOWTO</B>s y <B>FAQ</B>s, habitualmente
redactadas en ingl&eacute;s, que suelen acompa&ntilde;ar todas las distribuciones de
Linux. Por ejemplo, en la distribuci&oacute;n <EM>Slackware</EM> hay un disco o
dos, que constituyen la serie <B>F</B>, en el que se encuentra gran
cantidad de documentos de este tipo. Estos documentos pueden ser asimismo
encontrados en numerosos sites de Internet, entre ellos,
<EM>metalab.unc.edu:/pub/Linux/docs/HOWTO</EM> y todos sus mirrors y
<EM>rtfm.mit.edu</EM>.
<P>Asimismo, existe una serie "<B>I</B>", que constituye el sistema de ayuda
<EM>info</EM>, que incluye gran cantidad de informaci&oacute;n detallada y muy
interesante, aunque tambi&eacute;n en ingl&eacute;s. Si se hace interesante referenciar a
este sistema de documentaci&oacute;n de GNU, se incluir&aacute; el s&iacute;mbolo:
<P>
<BLOCKQUOTE><CODE>
<PRE>
[I]
</PRE>
</CODE></BLOCKQUOTE>
<P>Al final del documento, en el Cap&iacute;tulo 10, hay una relaci&oacute;n de todas las FAQs
y HOWTOs referenciadas.
<P>El autor (y el mantenedor) no se responsabiliza del contenido de las
presentes FAQ ni del presunto da&ntilde;o que pudiera ocasionar una correcta o
incorrecta aplicaci&oacute;n de sus contenidos.
<P>Esta FAQ se mantiene siempre actualizada (en formato texto) en Cyberiada
BBS, 2:346/3, (Tel. +34-965140619) bajo el nombre LNX34FAQ.ZIP. Los ficheros
pueden ser descomprimidos con UNZIP de Linux o PKUNZIP de MSDOS y OS/2. El
c&oacute;digo fuente en SGML o las p&aacute;ginas en HTML pueden encontrarse en:
<P>
<UL>
<LI>Home Page del FAQ de R34.LINUX<BR>
<A HREF="http://www.ctv.es/USERS/pbrufal"> http://www.ctv.es/USERS/pbrufal</A></LI>
<LI>El Rinc&oacute;n de Fidonet, que es la P&aacute;gina Oficial de R34.LINUX<BR>
<A HREF="http://www.marqueze.net">http://www.marqueze.net</A> </LI>
<LI>Proyecto LuCAS, Linux en castellano<BR> 
<A HREF="http://lucas.hispalinux.es">http://lucas.hispalinux.es</A></LI>
<LI>P&aacute;gina personal de Jaime Robles<BR>
<A HREF="http://www.geocities.com/SiliconValley/5161/linux.html">http://www.geocities.com/SiliconValley/5161/linux.html</A></LI>
<LI>P&aacute;gina personal de Arturo Vald&eacute;s<BR>
<A HREF="http://www.arturovaldes.com">http://www.arturovaldes.com</A></LI>
<LI>P&aacute;gina personal de Jos&eacute; Francisco G&oacute;mez<BR>
<A HREF="http://www.geocities.com/Eureka/6263">http://www.geocities.com/Eureka/6263</A></LI>
</UL>
<P>
<HR>
<A HREF="FAQ-R34.LINUX-2.html">Página siguiente</A>
Página anterior
<A HREF="FAQ-R34.LINUX.html#toc1">Índice general</A>
</BODY>
</HTML>
