<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>FAQ de R34.LINUX: Informaci&oacute;n. Documentaci&oacute;n y Ayuda</TITLE>
 <LINK HREF="FAQ-R34.LINUX-10.html" REL=next>
 <LINK HREF="FAQ-R34.LINUX-8.html" REL=previous>
 <LINK HREF="FAQ-R34.LINUX.html#toc9" REL=contents>
</HEAD>
<BODY>
<A HREF="FAQ-R34.LINUX-10.html">Página siguiente</A>
<A HREF="FAQ-R34.LINUX-8.html">Página anterior</A>
<A HREF="FAQ-R34.LINUX.html#toc9">Índice general</A>
<HR>
<H2><A NAME="s9">9. Informaci&oacute;n. Documentaci&oacute;n y Ayuda</A></H2>

<P>
<DL>
<P>Hay con alguna frecuencia preguntas sobre estos temas en el area. Se ha
intentado resumir las respuestas en los siguientes cap&iacute;tulos. Por supuesto,
no se har&aacute; m&aacute;s menci&oacute;n a FAQs ni HOWTOs, cuya utilidad ya ha quedado
expuesta.
</DL>
<P>
<H2><A NAME="ss9.1">9.1 Libros</A>
</H2>

<P>
<P>
<DL>
<P>Los libros sobre UNIX System V Release 4, m&aacute;s f&aacute;ciles de encontrar que los
espec&iacute;ficos de Linux, suponen una acercamiento importante al conocimiento de
&eacute;ste &uacute;ltimo. Sobrar&aacute;n cap&iacute;tulos, se echar&aacute;n de menos otros, pero para
iniciarse como usuario (c&oacute;mo borrar un fichero, permisos, ordenes b&aacute;sicas,
pipes, etc) son interesantes. <BR>
<P><B>Sobre UNIX en general y otros UN*X</B>:
<P>
<UL>
<LI>UNIX Sistema V Versi&oacute;n 4. Manual de Referencia. Coffin. McGraw-Hill</LI>
<LI>El Entorno de Programaci&oacute;n UNIX, Kernighan y Pike.</LI>
</UL>
</DL>
<P>
<DL>
<P><B>Libros espec&iacute;ficos de Linux</B>:
<P>
<UL>
<LI>Linux Bible. Recopilaci&oacute;n de HOWTOs y FAQs, ingl&eacute;s.
</LI>
<LI>EDICION ESPECIAL LINUX, castellano, traducci&oacute;n de la obra: -- USING
LINUX Special Edition --. Editorial Que y Prentice Hall. Trae un CD con la
distribuci&oacute;n Slackware 2.20. </LI>
</UL>
 
</DL>
<P>
<H2><A NAME="ss9.2">9.2 Linux Documentation Project</A>
</H2>

<P>
<P>Se han publicado una serie de libros (bajo licencia GNU, es decir, de uno u
otro modo, gratu&iacute;tos) que cubren, siempre en ingl&eacute;s, determinados aspectos
de Linux. Todos se renuevan con una u otra frecuencia. Todos ellos est&aacute;n
disponibles en <EM>metalab.unc.edu</EM> y son aut&eacute;nticos libros que pueden ser
impresos en cualquier impresora, sea postscript o no, con el programa
<EM>ghostscript</EM>, que existe tambi&eacute;n para MS-Windows. Para los que no est&eacute;n
en internet, tambi&eacute;n se pueden encontrar en las distribuciones Infomagic y
en algunos BBSs (Lineas Aereas 2:341/43, Elektra 95-4164934) con diversos
nombres:
<P>
<UL>
<LI>Installation &amp; Getting Started, Matt Welsh</LI>
<LI>Network Administration Guide (NAG)</LI>
<LI>Kernel Hackers Guide, Michael K. Johnson</LI>
<LI>Linux Programmers Guide, Sven Goldt et al.</LI>
<LI>Linux System Administrator's Guide, Lars Wirzenius</LI>
<LI>Linux User's Guide, Larry Greenfield</LI>
</UL>
<P>Se incluye un apartado sobre documentaci&oacute;n en Castellano m&aacute;s abajo.
<P>
<H2><A NAME="ss9.3">9.3 Ayuda On-line</A>
</H2>

<P>
<P>Se incluye esta secci&oacute;n al no existir ninguna FAQ, ni siquiera en ingl&eacute;s,
sobre el particular. En parte porque no es un tema espec&iacute;fico Linux; pero
sin duda es de gran inter&eacute;s entre los que leemos el area. Quiz&aacute; en un futuro
sea mejor escindir o eliminar esta secci&oacute;n por completo. Una vez m&aacute;s, se
admiten sugerencias.
<P>Existen varios sistemas de ayuda en l&iacute;nea en Linux (UNIX?). La calidad y
tipo y profundidad de la informaci&oacute;n que contienen es muy variable, con lo
cual es interesante conocerlos todos. El orden en el que se exponen es de
mayor a menor inter&eacute;s para el que suscribe.
<P><B>MAN PAGES</B>. El primero de ellos, y m&aacute;s conocido, es el manual en l&iacute;nea o
"man-pages". Se trata de una larga serie de documentos (a grandes rasgos,
uno por cada ejecutable instalado), que permiten una referencia r&aacute;pida a la
utilizaci&oacute;n de dicha orden o ejecutable. Es habitual encontrar en ellas,
entre otras informaciones, los par&aacute;metros permisibles, la versi&oacute;n del
programa que describen, la ubicaci&oacute;n y contenido de ficheros de
configuraci&oacute;n, etc. En las distribuciones se acompa&ntilde;an una serie de paquetes
denominados 'man*' que incorporan distintas colecciones de p&aacute;ginas. Las
p&aacute;ginas se dividen en bloques, dependiendo del tema tratado, del 1 al 9.
Para no insistir innecesariamente, lo mejor es probar:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ man man
</PRE>
</CODE></BLOCKQUOTE>
<P>entrega toda la informaci&oacute;n sobre el comando man. De ah&iacute; en adelante... cada
uno, solo. :-)
<P>Para imprimirlas hay que utilizar distintos comandos dependiendo del formato
en que est&eacute;n almacenadas, que puede deducirse f&aacute;cilmente de la trayectoria
bajo la que est&eacute;n almacenadas.
<DL>
<P>
<DT><B>Preformateadas</B><DD><P>Para las p&aacute;ginas bajo <I>/usr/man/preformat</I>:
<BLOCKQUOTE><CODE>
<PRE>
$ zcat /usr/man/preformat/cat2/bind.2.gz | groff -Tlatin1 | lpr
</PRE>
</CODE></BLOCKQUOTE>
<P>
<DT><B>Fuente no comprimidas</B><DD><P>P&aacute;ginas bajo <I>/usr/man/man?</I>
<BLOCKQUOTE><CODE>
<PRE>
$ groff -mandoc -Tascii /usr/man/man1/ircII.1 | lpr
</PRE>
</CODE></BLOCKQUOTE>
<P>
<DT><B>Texto ASCII, comprimidas</B><DD><P>P&aacute;ginas bajo <I>/usr/man/cat?</I>
<BLOCKQUOTE><CODE>
<PRE>
$ zcat /usr/man/cat1/groff.1.gz | lpr
</PRE>
</CODE></BLOCKQUOTE>
<P>
</DL>
<P><B>Atenci&oacute;n</B>: Se agradecer&iacute;a conocer comentarios sobre posibles problemas
surgidos con el p&aacute;rrafo anterior.
<P><B>INFO</B>. Se trata de un programa que permite leer documentaci&oacute;n en l&iacute;nea con un
formato determinado. En la Serie I de la distribuci&oacute;n Slackware se incluye
una gran cantidad de documentos para Info, muy recomendables. De nuevo, el
camino r&aacute;pido para empezar a usarlo:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ info
</PRE>
</CODE></BLOCKQUOTE>
<P>Esto nos mostrar&aacute; en el terminal toda la documentaci&oacute;n disponible. Info es
en principio engorroso (al menos para m&iacute;) de usar, pero muchas veces la
calidad de la informaci&oacute;n encontrada merece el esfuerzo.
<P><B>LOCATE</B>. Es muy habitual necesitar localizar un archivo determinado por
el sistema de archivos. La orden <CODE>find</CODE> hace el cometido perfectamente, pero
a costa de tiempo y una sintaxis un poco puntillosa. Sugiero montar el CDROM
y los floppies favoritos y ejecutar:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# updatedb
</PRE>
</CODE></BLOCKQUOTE>
<P>Tarda un poco. Al terminar podemos pedir:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ locate XF86Con (yo nunca recuerdo donde est&aacute; :-))
</PRE>
</CODE></BLOCKQUOTE>
<P>y obtendremos, inmediatamente, una lista de los archivos y directorios cuyo
nombre coincide con nuestra petici&oacute;n.
<P><B>APROPOS</B>. Otro nuevo sistema. <EM>apropos</EM> permite consultar, de modo
r&aacute;pido, todas las cabeceras de p&aacute;ginas <EM>man</EM> antes descritas de cara a
encontrar palabras clave que nos permitan una b&uacute;squeda m&aacute;s concreta. Por
ejemplo. Deseamos copiar un archivo, pero no recordamos la orden UNIX que lo
hace.
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ apropos copy
</PRE>
</CODE></BLOCKQUOTE>
<P>(en ingl&eacute;s, claro) nos entrega una lista de p&aacute;ginas man que incluyen la
cadena <EM>copy</EM> en su cabecera. Y seguro que la lista incluye el comando
<EM>cp</EM> que probablemente sea lo que necesit&aacute;bamos. Para que esto funcione,
previamente hay que construir la base de datos, con:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# makewhatis -c
</PRE>
</CODE></BLOCKQUOTE>
<P>La construcci&oacute;n de esta base de datos es lenta, quiz&aacute; unos 40 minutos en un
486/66-8Mb. Aviso. Y algunas p&aacute;ginas man no est&aacute;n escritas en el formato
est&aacute;ndar, como las de Tcl/tk, y manchan la base de datos resultante, que
queda, normalmente, en /usr/man/whatis, y que puede ser editada a posteriori
de cara a recuperar los formatos da&ntilde;ados. (1 minuto, sin experiencia).
<P>NOTA: <EM>apropos</EM> hace exactamente lo mismo que <EM>man -k</EM>.
<P>
<HR>
<A HREF="FAQ-R34.LINUX-10.html">Página siguiente</A>
<A HREF="FAQ-R34.LINUX-8.html">Página anterior</A>
<A HREF="FAQ-R34.LINUX.html#toc9">Índice general</A>
</BODY>
</HTML>
