<HTML>
<HEAD>
<TITLE>C&Oacute;MO Programar el puerto serie en Linux: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Programacion-Serie-Como-2.html">Siguiente</A>
<A HREF="Programacion-Serie-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>Este es el COMO Programar el puerto serie en Linux. Todo sobre c&oacute;mo
programar comunicaciones con otros dispositivos/ordenadores sobre una
l&iacute;nea serie, bajo Linux. Explicaremos diferentes t&eacute;cnicas: E/S Can&oacute;nica
(s&oacute;lo se transmiten/reciben l&iacute;neas completas), E/S as&iacute;ncrona, y espera
para una entrada de origen m&uacute;ltiple. </P>
<P>Este documento no describe c&oacute;mo configurar un puerto serie, ya que esto ha
sido descrito por Greg Hankins en el Serial-HOWTO
<SL>Disponible en
castellano como <I>Serie-COMO</I>.</SL>
</P>
<P>Tengo que hacer notar encarecidamente que no soy un experto en este campo,
pero he tenido problemas con un proyecto que necesitaba tales
comunicaciones. Los ejemplos de c&oacute;digo a&ntilde;adidos aqu&iacute; se derivaron del
c&oacute;digo de <I>miniterm</I> disponible en la gu&iacute;a de programadores del
<I>Linux Documentation Project</I>: </P>
<P>(<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/LDP/programmers-guide/">ftp://sunsite.unc.edu/pub/Linux/docs/LDP/programmers-guide/</A></CODE> y
espejos)  en el directorio de ejemplos. Si alguien tiene alg&uacute;n comentario,
con gusto lo incorporar&eacute; a este documento (ver secci&oacute;n 
<A HREF="#revisiones">revisiones</A>).</P>
<P>Todos los ejemplos fueron comprobados usando un n&uacute;cleo Linux 2.0.29 sobre
un i386. </P>

<H2><A NAME="ss1.1">1.1 Copyright</A></H2>


<P>El C&Oacute;MO Programar el puerto serie en Linux es propiedad inteletual (C) 
1997 de Peter Baumann.  Los documentos Linux HOWTO - Linux COMO pueden ser
reproducidos y distribuidos completos o en parte, en cualquier medio
f&iacute;sico o electr&oacute;nico, con la &uacute;nica condici&oacute;n de que mantengan esta nota de
propiedad intelectual en todas sus copias. La redistribuci&oacute;n comercial
est&aacute; permitida y fomentada; de todas formas al autor le <EM>gustar&iacute;a</EM> que
se le notificaran tales distribuciones.</P>
<P>Todas las traducciones, trabajos derivados o trabajos agregados que
incorporen cualquier documento Linux HOWTO-Linux COMO debe estar cubierto
por esta nota de propiedad intelectual. En resumen, no puede crear un
trabajo derivado de un HOWTO-COMO e imponer restricciones adicionales a su
distribuci&oacute;n. Se pueden conceder excepciones a estas reglas bajo ciertas
condiciones; por favor contacte con el coordinador de los HOWTO en la
direcci&oacute;n dada abajo.</P>
<P>Resumiendo, queremos promover la difusi&oacute;n de esta informaci&oacute;n a trav&eacute;s de
tantos canales com sea posible. No obstante queremos retener la propiedad
intelectual de los docuentos HOWTO-COMO, y nos <EM>gustar&iacute;a</EM> que se nos
notificara cualquier plan para redistribuir los HOWTO-COMO. </P>
<P>Si tiene preguntas, por favor contacte con Greg Hankins, el coordinador de
los HOWTO de Linux, en <CODE>
<A HREF="mailto:gregh@sunsite.unc.edu">gregh@sunsite.unc.edu</A></CODE> mediante correo electr&oacute;nico.</P>


<H2><A NAME="ss1.2">1.2 Versiones futuras de este Documento</A></H2>


<P>Las nuevas versiones de COMO Programar el puerto serie en Linux estar&aacute;n
disponibles en: 
<CODE>
<A HREF="ftp://sunsite.unc.edu:/pub/Linux/docs/HOWTO/Serial-Programming-HOWTO">ftp://sunsite.unc.edu:/pub/Linux/docs/HOWTO/Serial-Programming-HOWTO</A></CODE>
y sus espejos.  Hay otros formatos, como versiones PostScript y DVI en el
directorio <CODE>other-formats</CODE>. </P>
<P>C&Oacute;MO Programar el puerto serie en Linux tambi&eacute;n est&aacute; disponible en
<CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/Serial-Programming-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/Serial-Programming-HOWTO.html</A></CODE> y ser&aacute; enviado a <CODE>
<A HREF="news:comp.os.linux.answers">comp.os.linux.answers</A></CODE> mensualmente.</P>


<H2><A NAME="revisiones"></A> <A NAME="ss1.3">1.3 Revisi&oacute;n </A></H2>


<P>Por favor, m&aacute;ndeme cualesquiera correcci&oacute;n, pregunta, comentario,
sugerencia o material adicional. Me gustar&iacute;a mejorar este HOWTO-COMO. 
D&iacute;game exactamente qu&eacute; es lo que no entiende, o qu&eacute; deber&iacute;a estar m&aacute;s
claro. Me puede encontrar en <CODE>
<A HREF="mailto:Peter.Baumann@dlr.de">Peter.Baumann@dlr.de</A></CODE> v&iacute;a
email. Por favor, incluya el n&uacute;mero de versi&oacute;n del C&Oacute;MO Programar el
puerto serie en Linux cuando escriba. Esta es la versi&oacute;n 0.3.</P>


<HR>
Anterior
<A HREF="Programacion-Serie-Como-2.html">Siguiente</A>
<A HREF="Programacion-Serie-Como.html#toc1">Indice</A>
</BODY>
</HTML>
