<HTML>
<HEAD>
<TITLE>C&oacute;mo pasar de DOS a Linux.: Un poco de Programaci&oacute;n</TITLE>
</HEAD>
<BODY>
<A HREF="Dos-a-Linux-Como-6.html">Anterior</A>
<A HREF="Dos-a-Linux-Como-8.html">Siguiente</A>
<A HREF="Dos-a-Linux-Como.html#toc7">Indice</A>
<HR>
<H2><A NAME="s7">7. Un poco de Programaci&oacute;n</A></H2>



<H2><A NAME="ss7.1">7.1 Los Scripts del Shell: Ficheros <CODE>.BAT</CODE> con esteroides</A></H2>


<P>Si ha utilizado ficheros <CODE>.BAT</CODE> para crear atajos de largas l&iacute;neas de
comando (yo suelo hacerlo), el objetivo puede ser obtenido insertando las
l&iacute;neas de alias convenientes (ver ejemplo de m&aacute;s arriba) en el
<CODE>profile</CODE> o en el <CODE>.profile</CODE>. Pero si sus ficheros <CODE>.BAT</CODE> son m&aacute;s
complicados, le encantar&aacute; el lenguaje de Script que el shell pone a su
disposici&oacute;n: es tan potente como el Qbasic (o m&aacute;s). Tiene variables,
estructuras como <CODE>while</CODE>, <CODE>for</CODE>, <CODE>case</CODE>, <CODE>if-then-else</CODE>, y
montones de nuevas caracter&iacute;sticas: puede ser una buena alternativa a un
lenguaje de programaci&oacute;n "de verdad". </P>
<P>Para escribir un script ---el equivalente a un fichero <CODE>.BAT</CODE> bajo DOS---
todo lo que tiene que hacer es escribir un fichero ASCII est&aacute;ndar que
contenga las instrucciones, guardarlo, y entonces hacerlo ejecutable con
el comando <CODE>chmod +x fichero</CODE>. Para ejecutarlo, teclee su nombre. </P>
<P>Aviso: el editor del sistema se llama <CODE>vi</CODE>, y es un hecho probado que
la mayor parte de los nuevos usuarios lo encuentran muy dif&iacute;cil de usar. 
No voy a explicar c&oacute;mo usarlo, porque no me gusta y no lo uso. Vea el
manual "<I>Linux: Instalaci&oacute;n y Primeros Pasos</I>" de Matt Welsh (aunque ser&iacute;a
mejor utilizar otro editor tal como <CODE>joe</CODE> o <CODE>emacs</CODE> para X).
Baste decir aqu&iacute; unos comandos muy b&aacute;sicos: </P>
<P>
<UL>
<LI>para insertar texto, pulse <CODE>i</CODE> y despu&eacute;s el texto;
</LI>
<LI>para salir de <CODE>vi</CODE> sin guardar, pulse <CODE>ESC</CODE> y despu&eacute;s <CODE>:q!</CODE>
</LI>
<LI>para guardar y salir, pulse <CODE>ESC</CODE> y luego <CODE>:wq</CODE></LI>
</UL>
</P>
<P>Escribir scripts bajo bash es una materia tan extensa que requerir&iacute;a un
libro para abarcarla toda, y no voy a profundizar m&aacute;s all&aacute; en este tema.
S&oacute;lo dar&eacute; un ejemplo de script, del cual se pueden extraer las reglas
b&aacute;sicas: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh
# ejemplo.sh
# Soy un comentario
# no cambie la primera linea: debe estar ahi
echo &quot;Este sistema es: `uname -a`&quot; # usa la salida del comando
echo &quot;Me llamo $0&quot; # variables intrinsecas
echo &quot;Usted me dio $# parametros: &quot;$*
echo &quot;El primer parametro es: &quot;$1
echo -n &quot;¿Como se llama? &quot; ; read su_nombre
echo fijese en la diferencia: &quot;Hola, $su_nombre&quot; # entrecomillando con &quot;
echo fijese en la diferencia: 'Hola, $su_nombre' # entrecomillando con '
DIRS=0 ; FILES=0
for fichero in `ls .` ; do
  if [ -d ${fichero} ] ; then # si el fichero esta en el directorio
    DIRS=`expr $DIRS + 1`  # DIRS = DIRS + 1
  else if [ -f ${fichero} ] ; then
   FILES=`expr $FILES + 1`
  fi
  case ${fichero} in
    gif|*jpg) echo &quot;${fichero}: fichero grafico&quot; ;;
    *.txt|*.tex) echo &quot;${fichero}: fichero de texto&quot; ;;
    *.c|*.f|*.for) echo &quot;${fichero}: fichero de codigo fuente&quot; ;;
    *) echo &quot;${fichero}: fichero generico&quot; ;;
  esac
done
echo &quot;Hay ${DIRS} directorios y ${FILES} ficheros&quot;
ls | grep &quot;ZxY--!!!WKW&quot;
if [ $? != 0 ] ; then # Sacar el codigo del ultimo comando
  echo &quot;ZxY--!!!WKW no encontrado&quot;
fi
echo &quot;ya es suficiente... Para mas informacion teclee 'man bash'.&quot; 
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss7.2">7.2 Sus programas en C</A></H2>


<P>Bajo Unix, el lenguaje del sistema es C, le guste o no. Pero otros
lenguajes como FORTRAN, Pascal, Lisp, Basic, Perl, awk... tambi&eacute;n est&aacute;n
disponibles. </P>
<P>Suponiendo que usted sepa C, hay un par de gu&iacute;as para aquellos que han
utilizado Turbo C++ o uno de sus hermanos bajo DOS. El compilador de C se
denomina gcc y carece de todas las florituras que normalmente acompa&ntilde;an a
sus an&aacute;logos bajo DOS: no tiene IDE, ni ayuda en l&iacute;nea, ni debugger
integrado, etc... Es s&oacute;lo un r&uacute;stico compilador de l&iacute;nea de comandos, muy
potente y eficiente. Para compilar el t&iacute;pico programa <CODE>hello.c</CODE> esto es
lo que debe teclear: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gcc hello.c
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>lo que crear&aacute; un fichero ejecutable llamado <CODE>a.out</CODE>. Para cambiar el
nombre del ejecutable a otro nombre: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gcc -o hola hello.c
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para enlazar una librer&iacute;a al programa, a&ntilde;ada la opci&oacute;n
<CODE>-lnombre_de_librer&iacute;a</CODE>. Por ejemplo, para enlazar la librer&iacute;a
<CODE>math</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gcc -o mathprog mathprog.c -lm
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(<CODE>-lnombre_libreria</CODE> fuerza a gcc a enlazar la librer&iacute;a
<CODE>/usr/lib/libnombre_librer&iacute;a.a</CODE>; por lo tanto <CODE>-lm</CODE> enlaza
<CODE>/usr/lib/libm.a</CODE>). </P>
<P>Bien. Pero cuando su programa est&aacute; compuesto por varios ficheros de c&oacute;digo
fuente, necesitar&aacute; usar la utilidad <CODE>make</CODE>. Supongamos que ha escrito
un evaluador de expresiones: su c&oacute;digo fuente se denomina <CODE>parser.c</CODE> e
tiene un <CODE>#include</CODE> de dos ficheros en su cabecera: <CODE>parser.h</CODE> y
<CODE>xy.h</CODE>. Entonces, desea utilizar las rutinas de <CODE>parser.c</CODE> en otro
programa, <CODE>calc.c</CODE>, que hace un <CODE>#include</CODE> de <CODE>parser.h</CODE>. ¡Vaya
l&iacute;o! ¿C&oacute;mo se puede compilar <CODE>calc.c</CODE>? </P>
<P>Debe escribir un fichero llamado <CODE>makefile</CODE>, el cual muestra al
compilador las dependencias entre los ficheros de c&oacute;digo fuente y los
ficheros de c&oacute;digo objeto. En nuestro ejemplo: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# Este es el makefile, utilizado para compilar calc.c
# ¡Pulse la tecla &lt;TAB&gt; en las posiciones marcadas!

calc: calc.o parser.o
&lt;TAB&gt;gcc -o calc calc.o parser.o -lm
# calc depende de dos ficheros de codigo objeto: calc.o and parser.o

calc.o: calc.c parser.h
&lt;TAB&gt;gcc -c calc.c
# calc.o depende de dos ficheros de codigo fuente

parser.o:  parser.c parser.h xy.h
&lt;TAB&gt;gcc -c parser.c
# parser.o depende de tres ficheros de codigo fuente

# fin de makefile.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Guarde esto como <CODE>makefile</CODE> y teclee</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ make
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>para compilar su programa; alternativamente, gu&aacute;rdelo como <CODE>calc.mak</CODE> y
teclee</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ make -f calc.mak
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Y, por supuesto, LPM.</P>
<P>Puede pedir ayuda acerca de las funciones de C, que se encuentra en las
p&aacute;ginas <CODE>man</CODE>, secci&oacute;n 3; por ejemplo: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ man 3 printf
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Hay muchas librer&iacute;as disponibles por ah&iacute;; entre las primeras que desear&aacute;
usar est&aacute;n las <CODE>ncurses</CODE>, para manejar efectos en modo de texto, y
<CODE>svgalib</CODE>, para hacer gr&aacute;ficos. Si se siente suficientemente valiente
para atacar la programaci&oacute;n de las X, consiga XForms (<CODE>
<A HREF="ftp://bloch.phys.uwm.edu/pub/xforms">bloch.phys.uwm.edu/pub/xforms</A></CODE>) y/o MGUI (<CODE>
<A HREF="http://www.volftp.vol.it/IT/IT/ITALIANI/MORELLO/index.htm">http://www.volftp.vol.it/IT/IT/ITALIANI/MORELLO/index.htm</A></CODE>),
dos fant&aacute;sticas librer&iacute;as que hacen de la programaci&oacute;n bajo X algo
realmente f&aacute;cil. M&aacute;s a&uacute;n, si no puede vivir sin un IDE al estilo Borland,
consiga el paquete <CODE>xwpe</CODE> de <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/editors/">ftp://sunsite.unc.edu/pub/Linux/apps/editors/</A></CODE>. Posiblemente
sea de su agrado.</P>


<HR>
<A HREF="Dos-a-Linux-Como-6.html">Anterior</A>
<A HREF="Dos-a-Linux-Como-8.html">Siguiente</A>
<A HREF="Dos-a-Linux-Como.html#toc7">Indice</A>
</BODY>
</HTML>
