<HTML>
<HEAD>
<TITLE>C&oacute;mo pasar de DOS a Linux.: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Dos-a-Linux-Como-2.html">Siguiente</A>
<A HREF="Dos-a-Linux-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>



<H2><A NAME="ss1.1">1.1 ¿Es Linux adecuado para usted?</A></H2>


<P>¿Quiere pasar de DOS a Linux? Buena idea, pero cuidado: puede no serle
&uacute;til. Quiero decir: no hay nada que sea <I>el mejor ordenador</I> o <I>el
mejor sistema operativo</I>: depende de a lo que se dedique, por lo que no
creo que Linux sea la mejor soluci&oacute;n para todos, incluso aunque sea
t&eacute;cnicamente superior a muchos sistemas operativos comerciales. Usted se
beneficiar&aacute; inmensamente de Linux si lo que necesita es software para
programar, Internet, TeX... software t&eacute;cnico en general. Pero si necesita
software comercial, o si no le apetece aprender y escribir comandos, deje
Linux y busque en otra parte.</P>
<P>Linux no es (por ahora) tan f&aacute;cil de usar y configurar como Windows o el
Mac, as&iacute; que prep&aacute;rese para trastear un poco. Despu&eacute;s de estos avisos,
d&eacute;jeme decir que conf&iacute;o al 100% en que usted pertenece a la clase de
usuario que encontrar&aacute; en Linux el Nirvana inform&aacute;tico. Est&aacute; hecho para
usted. Y recuerde que, de todos modos, Linux y DOS/Windows pueden
coexistir en la misma m&aacute;quina. </P>


<H2><A NAME="ss1.2">1.2 Requisitos previos para la lectura de este Como</A></H2>

<P> </P>
<P>Asumir&eacute; que:</P>
<P>
<UL>
<LI>conoce los comandos y conceptos b&aacute;sicos del DOS;
</LI>
<LI>Linux, posiblemente con el sistema X Window, est&aacute; adecuadamente
instalado en su ordenador;
</LI>
<LI>su shell ---el equivalente de <CODE>COMMAND.COM</CODE>--- es <CODE>bash</CODE>; 
</LI>
<LI>usted comprende que esta gu&iacute;a es s&oacute;lo un paso incompleto. Para m&aacute;s
informaci&oacute;n, busque en el <I>Linux, Instalaci&oacute;n y Primeros Pasos</I> de Matt
Welsh y en la <I>Gu&iacute;a del Usuario de Linux</I> de Larry Greenfield. Ambas,
en versi&oacute;n inglesa, disponibles en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/LDP">ftp://sunsite.unc.edu/pub/Linux/docs/LDP</A></CODE> y, traducidos al
castellano, en la p&aacute;gina del proyecto LuCAS: <CODE>
<A HREF="http://www.infor.es/LuCAS">http://www.infor.es/LuCAS</A></CODE></LI>
</UL>
</P>


<H2><A NAME="ss1.3">1.3 Ya est&aacute;. Ahora cu&eacute;nteme m&aacute;s.</A></H2>


<P>Supongo que acaba de instalar Linux y los programas que necesita en su
ordenador, que ya tiene una cuenta propia (si no la tiene a&uacute;n, ¡teclee
<CODE>adduser</CODE> ahora mismo!) y que Linux est&aacute; ejecut&aacute;ndose. Acaba de
introducir su nombre y su clave, y ahora est&aacute; mirando a la pantalla
pensando... <I>¿Y ahora qu&eacute;?</I></P>
<P>Bien, no se desespere. Puede hacer casi las mismas cosas que sol&iacute;a hacer
con DOS, y muchas m&aacute;s. Si estuviera ejecutando DOS en lugar de Linux,
estar&iacute;a realizando alguna de las siguientes tareas: </P>
<P>
<UL>
<LI>ejecutar programas y crear, copiar, ver, borrar, imprimir, renombrar
ficheros; 
</LI>
<LI>cambiar de directorio, crearlos, borrarlos y listar sus contenidos; 
</LI>
<LI>formatear disquetes y copiar ficheros de/hacia ellos;
</LI>
<LI>editar el <CODE>AUTOEXEC.BAT</CODE> y el <CODE>CONFIG.SYS</CODE>;
</LI>
<LI>escribir sus propios ficheros <CODE>.BAT</CODE> y/o programas Qbasic;
</LI>
<LI>el restante 1%.</LI>
</UL>
</P>
<P>Estar&aacute; contento al saber que todas esas tareas pueden llevarse a cabo bajo
Linux de una manera similar a como se hacen bajo DOS. Bajo DOS, el usuario
medio usa muy pocos de los m&aacute;s de 100 comandos disponibles: lo mismo,
hasta cierto punto, sucede con el Linux.</P>
<P>Unas pocas cosas que se&ntilde;alar antes de continuar:</P>
<P>
<UL>
<LI>primero, c&oacute;mo salir. Para apagar Linux: si ve una pantalla en modo
texto, pulse Ctrl-Alt-Supr, espere a que el sistema realice unas tareas y
le diga que todo est&aacute; bien, y entonces apague el ordenador. Si est&aacute;
trabajando bajo el sistema X Window, pulse primero Ctrl-Alt-Del, y
despu&eacute;s Ctrl-Alt-Supr. Nunca apague o reinicie el ordenador directamente:
el sistema de ficheros podr&iacute;a da&ntilde;arse. 
</LI>
<LI>al contrario que en DOS, Linux tiene mecanismos de seguridad
intr&iacute;nsecos, debido a su naturaleza multiusuario. Los ficheros y los
directorios tienen permisos asociados a ellos, y por lo tanto el usuario
normal puede no tener acceso a alguno de ellos; (ver la Secci&oacute;n 
<A HREF="Dos-a-Linux-Como-2.html#Permisos">Permisos</A>). S&oacute;lo el usuario cuyo nombre de acceso sea <CODE>root</CODE>
tiene el poder absoluto. (Esta persona es el administrador del sistema. Si
trabaja en un ordenador propio, usted tambi&eacute;n ser&aacute; root). DOS, por el
contrario le dejar&iacute;a machacar todos los contenidos de su disco duro. 
 </LI>
<LI>si est&aacute; realmente animado a experimentar, int&eacute;ntelo usted mismo:
seguramente no podr&aacute; hacer ning&uacute;n da&ntilde;o. Puede conseguir alguna ayuda
escribiendo en la l&iacute;nea de comandos ($ es el s&iacute;mbolo de la l&iacute;nea de
comandos est&aacute;ndar, # es el de root); 

<BLOCKQUOTE><CODE>
<PRE>
$ help
</PRE>
</CODE></BLOCKQUOTE>


Esto le porporcionar&aacute; ayuda acerca de <CODE>bash</CODE>; puede conseguir
informaci&oacute;n acerca de un comando concreto escribiendo: 

<BLOCKQUOTE><CODE>
<PRE>
$ man comando
</PRE>
</CODE></BLOCKQUOTE>


el cual, si tiene instaladas las p&aacute;ginas man, ejecutar&aacute; la p&aacute;gina de
manual <CODE>man</CODE> asociada al comando. Tambi&eacute;n puede probar con: 

<BLOCKQUOTE><CODE>
<PRE>
$ apropos comando
$ whatis comando
</PRE>
</CODE></BLOCKQUOTE>


y presionar <CODE>q</CODE> para salir; 
</LI>
<LI>la mayor parte del poder y la flexibilidad de Unix viene de los
conceptos simples de redirecci&oacute;n y <I>piping</I>, o entubamiento, m&aacute;s
potentes que bajo DOS.  Los comandos simples pueden agruparse para
realizar tareas complejas. ¡Use estas caracter&iacute;sticas! 
</LI>
<LI><B>Convenciones</B>: <CODE>&lt;...&gt;</CODE> significa algo que debe ser
especificado, mientras que <CODE>[...]</CODE> es algo opcional. Ejemplo: 

<BLOCKQUOTE><CODE>
<PRE>
$ tar -tf &lt;fichero.tar&gt; [&gt; fichero_redir]
</PRE>
</CODE></BLOCKQUOTE>


<CODE>fichero.tar</CODE> debe ser indicado, pero la redirecci&oacute;n a
<CODE>fichero_redir</CODE> es opcional.
</LI>
<LI>desde ahora <I>LPM</I> significa <I>para m&aacute;s informaci&oacute;n Lea las
P&aacute;ginas del Manual</I>.
</LI>
</UL>
</P>


<H2><A NAME="ss1.4">1.4 Para el Impaciente</A></H2>


<P>¿Quiere empezar ya? Eche un vistazo a esto: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
DOS                     Linux                          Notas

BACKUP                  tar -Mcvf dispositivo dir/     completamente distinto
CD nombredir\           cd nombredir/                  casi la misma sintaxis
COPY fich1 fich2        cp fich1 fich2                 idem
DEL fichero             rm fichero                     cuidado no hay undelete
DELTREE directorio      rm -R directorio/              idem
DIR                     ls                             no exactamente la misma sintaxis
EDIT fichero            vi fichero                     creo que no le gustara
                        emacs fichero                  este es mejor
                        joe fichero                    mas parecido al edit del DOS
FORMAT                  fdformat
                        mount, umount                  sintaxis bastante distinta
HELP comando            man comando                    misma filosofia
MD directorio           mkdir directorio/              casi la misma sintaxis
MOVE fich1 fich2        mv fich1 fich2                 idem
NUL                     /dev/null                      idem
PRINT fichero           lpr fichero                    idem
PRN                     /dev/lp0,
                        /dev/lp1                       idem
RD directorio           rmdir directorio/              idem
REN fich1 fich2         mv fich1 fich2                 no para varios ficheros
RESTORE                 tar -Mxpvf device              sintaxis distinta
TYPE fichero            less fichero                   mucho mejor
WIN                     startx                         ¡mundos aparte!
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si necesita m&aacute;s que una tabla de comandos, contin&uacute;e con las secciones
siguientes. </P>


<HR>
Anterior
<A HREF="Dos-a-Linux-Como-2.html">Siguiente</A>
<A HREF="Dos-a-Linux-Como.html#toc1">Indice</A>
</BODY>
</HTML>
