<HTML>
<HEAD>
<TITLE>C&oacute;mo pasar de DOS a Linux.: El restante 1%</TITLE>
</HEAD>
<BODY>
<A HREF="Dos-a-Linux-Como-7.html">Anterior</A>
<A HREF="Dos-a-Linux-Como-9.html">Siguiente</A>
<A HREF="Dos-a-Linux-Como.html#toc8">Indice</A>
<HR>
<H2><A NAME="s8">8. El restante 1%</A></H2>



<H2><A NAME="ss8.1">8.1 Gesti&oacute;n de Memoria Virtual</A></H2>


<P>Aunque Linux puede ejecutarse en teor&iacute;a con s&oacute;lo 2 megas de RAM, cuanto
m&aacute;s se tenga, m&aacute;s se puede hacer. El sistema X Window no se ejecutar&aacute; a
menos que tenga 8 megas. Para crear una memoria virtual de 8 megas
adicionales, teclee como root: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# dd if=/dev/zero of=/swapfile bs=1024 count=8192
# mkswap /swapfile 8192
# sync
# swapon /swapfile
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>A&ntilde;ada la &uacute;ltima l&iacute;nea en <CODE>/etc/rc.d/rc.local</CODE> para hacer que el
fichero de memoria virtual est&eacute; disponible la siguiente vez que arranque,
o a&ntilde;ada esta l&iacute;nea en <CODE>/etc/fstab</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/swapfile   swap   swap   defaults
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss8.2">8.2 Utilizaci&oacute;n de <CODE>tar</CODE> y <CODE>gzip</CODE></A></H2>


<P>Bajo Unix hay algunas aplicaciones ampliamente utilizadas para archivar y
comprimir ficheros. <CODE>tar</CODE> se utiliza para archivar varios ficheros en
uno ---es como PKZIP o ARJ, pero no comprime, s&oacute;lo archiva. Para archivar
varios ficheros en uno (que llamaremos archivo de ahora en adelante):</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ tar -cvf &lt;nombre_fichero_final.tar&gt; &lt;fichero1&gt; [fichero2...]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para extraer ficheros de un archivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ tar -xpvf &lt;nombre_fichero.tar&gt; [fichero]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para listar los ficheros contenidos de un archivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ tar -tf &lt;nombre_fichero.tar&gt; | less
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Puede comprimir los ficheros usando <CODE>compress</CODE>, el cual es obsoleto y no
deber&iacute;a ser utilizado nunca m&aacute;s, o usando <CODE>gzip</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ compress &lt;fichero&gt;
$ gzip &lt;fichero&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>eso crea un fichero comprimido con la extensi&oacute;n <CODE>.Z</CODE> (compress) o
<CODE>.gz</CODE> (gzip). Estos programas s&oacute;lo pueden comprimir un fichero cada
vez. Para descomprimir, use:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ compress -d &lt;fichero.Z&gt;
$ gzip -d &lt;fichero.gz&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>LPM.</P>
<P>Las utilidades <CODE>unarj</CODE>, <CODE>zip</CODE> y <CODE>unzip</CODE> (compatibles con ARJ y
PK??ZIP) tambi&eacute;n est&aacute;n disponibles. Los ficheros con la extensi&oacute;n
<CODE>.tar.gz</CODE> o <CODE>tgz</CODE> (archivados con <CODE>tar</CODE>, posteriormente
comprimidos con <CODE>gzip</CODE>) son tan comunes en el mundo Unix como los
ficheros <CODE>.ZIP</CODE> bajo DOS. Para listar los contenidos de un fichero
<CODE>.tar.gz</CODE> utilice:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gzip -dc &lt;fichero.tar.gz&gt; | tar tf - | less
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>o tambi&eacute;n:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ tar -cvzf &lt;fichero.tar.gz&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss8.3">8.3 Instalaci&oacute;n de aplicaciones</A></H2>


<P>Antes de nada: instalar paquetes es trabajo del root. Algunas aplicaciones
Linux se distribuyen como ficheros <CODE>.tar.gz</CODE> o <CODE>.tgz</CODE>, preparadas
espec&iacute;ficamente para que sean descomprimidas desde el directorio ra&iacute;z
<CODE>/</CODE> escribiendo el siguiente comando: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# gzip -dc &lt;fichero.tar.gz&gt; | tar xvf -
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Los ficheros se descomprimir&aacute;n en el directorio adecuado, el cual ser&aacute;
creado ``al vuelo''. Los usuarios de la distribuci&oacute;n Slackware tienen un
programa gestor de paquetes amigable para el usuario; otro programa es
<CODE>rpm</CODE>, el cual est&aacute; disponible para todas las distribuciones gracias a
Red Hat. </P>
<P>Los dem&aacute;s paquetes no deber&iacute;an ser instalados desde <CODE>/</CODE>; 
t&iacute;picamente, el paquete contendr&aacute; un directorio llamado
<CODE>nombrepaquete/</CODE> y un mont&oacute;n de ficheros y/o subdirectorios dentro
de <CODE>nombrepaquete/</CODE>. Una buena regla es instalar todos esos
paquetes bajo <CODE>/usr/local</CODE>. </P>
<P>Adem&aacute;s, otros paquetes se distribuyen con sus fuentes en C o C++, los
cuales han de ser compilados para crear los programas binarios. En la
mayor parte de los casos, todo lo que debe hacer es ejecutar <CODE>make</CODE>.
Obviamente, necesitar&aacute; el compilador <CODE>gcc</CODE>. </P>


<H2><A NAME="ss8.4">8.4 Trucos imprescindibles</A></H2>


<P>
<UL>
<LI><B>Terminaci&oacute;n de comandos</B>: presionando <CODE>TAB</CODE>
mientras teclea un comando completar&aacute; la l&iacute;nea por usted. Ejemplo: tiene
que teclear <CODE>gcc este_es_un_nombre_de_fichero_largo.c</CODE>; con teclear
<CODE>gcc este TAB</CODE> bastar&aacute;. (Si tiene otros ficheros que comienzan con los
mismos caracteres, proporcione los caracteres suficientes para resolver
cualquier ambig&uuml;edad.) 
</LI>
<LI><B>Visi&oacute;n de pantallas anteriores</B>: presionar <CODE>MAY&Uacute;S + RE P&Aacute;G</CODE>
(la tecla gris) le permite volver atr&aacute;s unas cuantas p&aacute;ginas, dependiendo
de la memoria de v&iacute;deo que posea. 
</LI>
<LI><B>Resetear la pantalla</B>: si por un casual hace un <CODE>cat</CODE> o un
<CODE>more</CODE> de un fichero binario, su pantalla puede acabar llena de basura.
Para arreglar las cosas, teclee <CODE>reset</CODE> a ciegas o pulse esta secuencia
de caracteres: <CODE>echo CTRL-V ESC c RETURN</CODE>.
</LI>
<LI><B>Pegar texto</B>: en consola, ver m&aacute;s abajo; en las X, haga click y
arrastre para seleccionar el texto en una ventana xterm, despu&eacute;s haga
click en el bot&oacute;n central (o con los dos a la vez si tiene un rat&oacute;n de dos
botones) para pegar. Tambi&eacute;n hay un <CODE>xclipboard</CODE> (portapapeles de X) 
(de momento, s&oacute;lo para texto); no se confunda por su muy baja velocidad de
respuesta. 
</LI>
<LI><B>Usar el rat&oacute;n</B>: instale <CODE>gpm</CODE>, el controlador de rat&oacute;n para
la consola. Haga click y arrastre para seleccionar texto, entonces haga un
click con el bot&oacute;n derecho para pegar el texto seleccionado. Funciona a
trav&eacute;s de diferentes consolas virtuales. 
</LI>
<LI><B>Mensajes del kernel</B>: &eacute;chele un vistazo a
<CODE>/var/adm/messages</CODE> o <CODE>/var/log/messages</CODE> como root para ver
lo que el kernel le dice, incluyendo los mensajes de inicio. </LI>
</UL>
</P>


<H2><A NAME="ss8.5">8.5 Programas y comandos &uacute;tiles</A></H2>


<P>Esta lista refleja mis preferencias y necesidades personales, por
supuesto. En primer lugar, d&oacute;nde encontrarlas. Ya que usted sabe c&oacute;mo
navegar por la red y c&oacute;mo utilizar <CODE>archie</CODE> y <CODE>ftp</CODE>, s&oacute;lo le dar&eacute;
tres de las m&aacute;s importantes direcciones para Linux: <CODE>
<A HREF="ftp://sunsite.unc.edu/">ftp://sunsite.unc.edu/</A></CODE>,
<CODE>
<A HREF="ftp://tsx-11.mit.edu/">ftp://tsx-11.mit.edu/</A></CODE>, y <CODE>
<A HREF="ftp://nic.funet.fi/">ftp://nic.funet.fi/</A></CODE>. Por favor, use
el mirror m&aacute;s cercano. </P>
<P>
<UL>
<LI><CODE>at</CODE> le permite ejecutar programas a una hora y fecha
especificados. 
</LI>
<LI> <CODE>awk</CODE> es un lenguaje simple pero potente de manipulaci&oacute;n de
ficheros de datos (entre otras cosas). Por ejemplo, siendo <CODE>datos.dat</CODE>
su fichero de datos multicampo,

<BLOCKQUOTE><CODE>
<PRE>
$ awk '$2 ~ &quot;abc&quot; {print $1, &quot;\t&quot;, $4}' datos.dat
</PRE>
</CODE></BLOCKQUOTE>


imprime los campos 1 y 4 de cada linea de <CODE>datos.dat</CODE> cuyo segundo
campo contenga ``<CODE>abc</CODE>''.
</LI>
<LI><CODE>delete-undelete</CODE> borran y recuperan ficheros; 
</LI>
<LI><CODE>df</CODE> da informaci&oacute;n acerca de los discos montados;
</LI>
<LI><CODE>dosemu</CODE> permite ejecutar bastantes (no todos) programas DOS
---incluyendo Windows 3.x--- con un poco de trasteo;
</LI>
<LI><CODE>file nombrefichero</CODE> le dice qu&eacute; tipo de fichero es
<CODE>nombrefichero</CODE> (texto ASCII, ejecutable, comprimido, etc.);
</LI>
<LI><CODE>find</CODE> (ver tambi&eacute;n la secci&oacute;n 
<A HREF="Dos-a-Linux-Como-3.html#Directorios">Directorios</A>) es uno de
los comandos m&aacute;s potentes y &uacute;tiles. Se utiliza para buscar ficheros que se
ajusten a unas determinadas caracter&iacute;sticas, y realizar acciones sobre
ellos. El uso general de <CODE>find</CODE> es:

<BLOCKQUOTE><CODE>
<PRE>
$ find &lt;directorio&gt; &lt;expresion&gt;
</PRE>
</CODE></BLOCKQUOTE>


donde <CODE>expresion</CODE> incluye criterios de b&uacute;squeda y acciones. Ejemplos:

<BLOCKQUOTE><CODE>
<PRE>
$ find . -type l -exec ls -l {} \;
</PRE>
</CODE></BLOCKQUOTE>


busca todos los ficheros que son enlaces simb&oacute;licos y dice a d&oacute;nde
apuntan. 

<BLOCKQUOTE><CODE>
<PRE>
$ find / -name &quot;*.old&quot; -ok rm {} \;
</PRE>
</CODE></BLOCKQUOTE>


busca todos los ficheros que se ajusten a lo especificado y los borra,
pidi&eacute;ndole antes confirmaci&oacute;n. 

<BLOCKQUOTE><CODE>
<PRE>
$ find . -perm +111
</PRE>
</CODE></BLOCKQUOTE>


busca todos los ficheros cuyos permisos sean <CODE>111</CODE> (ejecutables para
todos).

<BLOCKQUOTE><CODE>
<PRE>
$ find . -user root
</PRE>
</CODE></BLOCKQUOTE>


busca todos los ficheros que pertenecen al root. Hay muchas
posibilidades: LPM. 
</LI>
<LI><CODE>gnuplot</CODE> es un brillante programa para dibujos cient&iacute;ficos; 
</LI>
<LI><CODE>grep</CODE> busca cadenas de texto en ficheros. Por ejemplo: 

<BLOCKQUOTE><CODE>
<PRE>
$ grep -l &quot;geologia&quot; *.tex
</PRE>
</CODE></BLOCKQUOTE>


lista todos los ficheros <CODE>*.tex</CODE> que contienen la palabra
<CODE>geologia</CODE>. La variante <CODE>zgrep</CODE> trabaja en ficheros comprimidos con
gzip. LPM;
</LI>
<LI><CODE>gzexe</CODE> comprime binarios ejecutables manteni&eacute;ndolos ejecutables
(similar a PKLITE); 
</LI>
<LI><CODE>joe</CODE> es un excelente editor. Invoc&aacute;ndolo tecleando <CODE>jstar</CODE>
conseguir&aacute; los mismos caracteres de teclado que WordStar y sus
descendientes, incluyendo DOS y los editores Turbo... de Borland; 
</LI>
<LI><CODE>less</CODE> es, probablemente, el mejor navegador de texto, y si est&aacute;
adecuadamente configurado, permite navegar por ficheros <CODE>zip</CODE>, <CODE>tar</CODE>
o <CODE>gzip</CODE>. 
</LI>
<LI><CODE>lpr fichero</CODE> imprime un fichero en segundo plano. Para comprobar
el estado de la cola de impresi&oacute;n, use <CODE>lpq</CODE>; para quitar un fichero de
la cola de impresi&oacute;n, use <CODE>lprm</CODE>; 
</LI>
<LI><CODE>mc</CODE> es un maravilloso gestor de ficheros, clon del
<I>comandante norton</I>;
</LI>
<LI><CODE>pine</CODE> es un simp&aacute;tico programa gestor de correo electr&oacute;nico; 
</LI>
<LI><CODE>script fichero_script</CODE> copia a <CODE>fichero_script</CODE> lo que
aparece en pantalla antes de ejecutar el comando exit. Util para
depuraci&oacute;n;
</LI>
<LI><CODE>sudo</CODE> permite a los usuarios ejecutar algunas funciones del root
(p.e. formatear y montar discos; LPM); 
</LI>
<LI><CODE>uname -a</CODE> da informaci&oacute;n acerca del sistema;
</LI>
<LI><CODE>zcat</CODE> y <CODE>zless</CODE> son &uacute;tiles para ver ficheros de texto
comprimidos con <CODE>gzip</CODE> sin descomprimirlos. Un posible uso es: 

<BLOCKQUOTE><CODE>
<PRE>
$ zless ficherotexto.gz
$ zcat ficherotexto.gz | lpr
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI> Los siguientes comandos son a menudo utilizados: <CODE>bc, cal, chsh,
cmp, cut, fmt, head, hexdump, nl, passwd, printf, sort, split, strings,
tac, tail, tee, touch, uniq, w, wall, wc, whereis, write, xargs, znew</CODE>.
LPM. </LI>
</UL>
</P>


<H2><A NAME="ss8.6">8.6 Extensiones comunes y programas relacionados</A></H2>


<P>Se podr&aacute; encontrar con una gran variedad de extensiones de ficheros. 
Excluyendo los m&aacute;s ex&oacute;ticos (como los de fuentes, etc.), aqu&iacute; tenemos una
lista de los m&aacute;s usuales: </P>
<P>
<UL>
<LI><CODE>1 ... 8</CODE>: p&aacute;ginas de manual. En el extra&ntilde;o caso en que a&uacute;n
no lo tenga, consiga <CODE>man</CODE>. 
</LI>
<LI><CODE>arj</CODE>: archivo hecho con <CODE>arj</CODE>. Use <CODE>unarj</CODE> para
descomprimirlo. 
</LI>
<LI><CODE>dvi</CODE>: fichero de salida producido por TeX (ver m&aacute;s abajo).
Use <CODE>xdvi</CODE> para visualizarlo; Use <CODE>dvips</CODE> para transformarlo en un
fichero PostScript (<CODE>.ps</CODE>). 
</LI>
<LI><CODE>gif</CODE>: fichero gr&aacute;fico. Consiga <CODE>seejpeg</CODE>, <CODE>xpaint</CODE> o
<CODE>zgv</CODE> para visualizarlo. 
</LI>
<LI><CODE>gz</CODE>: archivo comprimido con <CODE>gzip</CODE>. 
</LI>
<LI><CODE>info</CODE>: archivo <EM>info</EM> (Algo as&iacute; como una alternativa a
las p&aacute;ginas de manual). Consiga <CODE>info</CODE>. 
</LI>
<LI><CODE>jpg, jpeg</CODE>: fichero gr&aacute;fico. Consiga <CODE>seejpeg</CODE> o
<CODE>zgv</CODE>. 
</LI>
<LI><CODE>lsm</CODE>: Fichero <EM>Linux Software Map</EM>. Es un fichero de
texto ASCII plano que contiene la descripci&oacute;n de un paquete. 
</LI>
<LI><CODE>ps</CODE>: Fichero PostScript. Para visualizarlo o imprimirlo
consiga <CODE>gs</CODE> y, opcionalmente, <CODE>ghostview</CODE>. 
</LI>
<LI><CODE>rpm</CODE>: Paquete de Red Hat. Puede instalarlo en cualquier
sistema utilizando el gestor de paquetes <CODE>rpm</CODE>. 
</LI>
<LI><CODE>taz, tar.Z</CODE>: archivo hecho con <CODE>tar</CODE> y posteriormente
comprimido con <CODE>compress</CODE>. 
</LI>
<LI><CODE>tgz, tar.gz</CODE>: archivo hecho con <CODE>tar</CODE> y posteriormente
comprimido con <CODE>gzip</CODE>. 
</LI>
<LI><CODE>tex</CODE>: fichero de texto para utilizar con TeX, un poderoso
formateador de textos. Consiga el paquete <CODE>tex</CODE>, disponible en muchas
distribuciones; pero tenga cuidado con NTeX, el cual ten&iacute;a fuentes
corruptas y estaba incluido en algunas versiones de la distribuci&oacute;n
Slackware. 
</LI>
<LI><CODE>texi</CODE>: fichero texinfo, a partir del cual se pueden producir
tanto archivos TeX como info. Consiga <CODE>texinfo</CODE>. 
</LI>
<LI><CODE>xbm, xpm, xwd</CODE>: fichero gr&aacute;fico. Consiga <CODE>xpaint</CODE>.
</LI>
<LI> <CODE>Z</CODE>: archivo hecho con <CODE>compress</CODE>.
</LI>
<LI> <CODE>zip</CODE>: archivo hecho con <CODE>zip</CODE>. Consiga <CODE>zip</CODE> y <CODE>unzip</CODE>.</LI>
</UL>
</P>


<HR>
<A HREF="Dos-a-Linux-Como-7.html">Anterior</A>
<A HREF="Dos-a-Linux-Como-9.html">Siguiente</A>
<A HREF="Dos-a-Linux-Como.html#toc8">Indice</A>
</BODY>
</HTML>
