<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Redes en Linux Como (Previamente Net-3 Como): Cables y Cableado</TITLE>
 <LINK HREF="Redes-En-Linux-Como-10.html" REL=next>
 <LINK HREF="Redes-En-Linux-Como-8.html" REL=previous>
 <LINK HREF="Redes-En-Linux-Como.html#toc9" REL=contents>
</HEAD>
<BODY>
<A HREF="Redes-En-Linux-Como-10.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-8.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc9">Índice general</A>
<HR>
<H2><A NAME="s9">9. Cables y Cableado</A></H2>

<P>
<P>Aquellos de ustedes que se manejen con un soldador puede que quieran construir
sus propios cables para interconectar dos m&aacute;quinas Linux.  Los siguientes
diagramas de cableado deber&iacute;an serles de ayuda.
<P>
<H2><A NAME="ss9.1">9.1 Cable serie M&oacute;dem NULO (NULL Modem)</A>
</H2>

<P>
<P>No todos los cables M&oacute;dem NULO son iguales. Muchos cables m&oacute;dem nulo hacen poco
m&aacute;s que un peque&ntilde;o truco para que el ordenador crea que est&aacute;n presentes todas
las se&ntilde;ales apropiadas, cruzando los cables de transmisi&oacute;n y recepci&oacute;n. Esto
vale, pero significa que deber&aacute; usar programas de control de flujo software
(XON/XOFF), que es menos eficiente que el control de flujo hardware. El
siguiente cable proporciona la mejor se&ntilde;alizaci&oacute;n posible entre las m&aacute;quinas y
permite usar control de flujo por hardware (RTS/CTS).
<P>
<BLOCKQUOTE><CODE>
<PRE>
Nombre Patilla Patilla                           Patilla
 Datos Tx       2  -----------------------------  3
 Datos Rx       3  -----------------------------  2
 RTS            4  -----------------------------  5
 CTS            5  -----------------------------  4
 Tierra         7  -----------------------------  7
 DTR            20 -\---------------------------  8
 DSR            6  -/
 RLSD/DCD       8  ---------------------------/-  20
                                              \-  6
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss9.2">9.2 Cable de puerto paralelo (cable PLIP)</A>
</H2>

<P>
<P>Si pretende usar el protocolo PLIP entre dos m&aacute;quinas, entonces este cable 
funcionar&aacute; independientemente del tipo de puertos paralelos que tenga
instalados.
<P>
<BLOCKQUOTE><CODE>
<PRE>
Nombre Patilla  Patilla        Patilla
 STROBE         1*
 D0->ERROR      2  ----------- 15
 D1->SLCT       3  ----------- 13
 D2->PAPOUT     4  ----------- 12
 D3->ACK        5  ----------- 10
 D4->BUSY       6  ----------- 11
 D5             7*
 D6             8*
 D7             9*
 ACK->D3        10 ----------- 5
 BUSY->D4       11 ----------- 6
 PAPOUT->D2     12 ----------- 4
 SLCT->D1       13 ----------- 3
 FEED           14*
 ERROR->D0      15 ----------- 2
 INIT           16*
 SLCTIN         17*
 GROUND         25 ----------- 25
</PRE>
</CODE></BLOCKQUOTE>
<P>Notas:
<P>
<UL>
<LI>No conecte las patillas marcadas con un asterisco, <CODE>*</CODE>.</LI>
<LI>Las tomas de tierra extra son 18,19,20,21,22,23 y 24.
</LI>
<LI>Si el cable que est&aacute; usando tiene apantallamiento met&aacute;lico, deber&iacute;a estar
conectado a la carcasa DB-25 en <B>s&oacute;lo uno</B> de los extremos.
</LI>
</UL>
<P><B>Cuidado: Un cable PLIP mal hecho puede destruir la tarjeta</B>
controladora. Sea muy cuidadoso y examine dos veces cada conexi&oacute;n para
asegurarse de que no va a hacer m&aacute;s trabajo ni a llevarse m&aacute;s infartos de lo
necesario.
<P>Aunque puede que sea capaz de tener cables PLIP para grandes distancias,
deber&iacute;a evitarlo. Las especificaciones del cable permiten una longitud de
alrededor de 1 metro. Por favor, tenga mucho cuidado cuando tienda cables PLIP
largos, ya que las fuentes de campos electromagn&eacute;ticos fuertes, como los rayos,
cables de corriente y emisoras de radio pueden interferir en los controladores,
y a veces da&ntilde;arlos. Si realmente quiere conectar dos ordenadores a larga
distancia, deber&iacute;a intentar obtener un par de tarjetas Ethernet para thin-net
(red de cable fino) y tender cable coaxial.
<P>
<H2><A NAME="ss9.3">9.3 Cableado Ethernet 10base2 (coaxial fino)</A>
</H2>

<P>
<P>10base2 es un est&aacute;ndar de cableado Ethernet que especifica el uso de cables
coaxiales de 52 ohmios con un di&aacute;metro de alrededor de 5 mil&iacute;metros. Hay un par
de reglas importantes a recordar cuando conectemos m&aacute;quinas con cableado
10base2. La primera es que debe usar terminadores en <EM>ambos extremos</EM> del
cable. Un terminador es una resistencia de 52 ohmios que ayuda a asegurar que
la se&ntilde;al es absorbida y no reflejada cuando alcanza el final del cable. Sin un
terminador a cada extremo del cable, podr&iacute;a pasar que la Ethernet sea
ineficiente o que no funcione.  Normalmente deber&iacute;a usar conectores en «T» para
interconectar las m&aacute;quinas por lo que terminar&aacute; con algo que se parezca a:
<P>
<BLOCKQUOTE><CODE>
<PRE>

 |==========T=============T=============T==========T==========|
            |             |             |          |
            |             |             |          |
          -----         -----         -----      -----
          |   |         |   |         |   |      |   |
          -----         -----         -----      -----
</PRE>
</CODE></BLOCKQUOTE>
<P>Donde el <CODE>|</CODE> a cada extremo representa un terminador, el <CODE>======</CODE>
representa cables coaxiales con conectores BNC a cada extremo y las <CODE>T</CODE>
representan conectores «en T». Deber&iacute;a hacer que la longitud del cable entre la
<CODE>T</CODE> y el PC lo m&aacute;s corto posible ya que, idealmente, la «T» deber&iacute;a estar
directamente enchufada a la tarjeta Ethernet.
<P>
<H2><A NAME="ss9.4">9.4 Cable Ethernet de Par Trenzado</A>
</H2>

<P>
<P>Si tiene s&oacute;lo dos tarjetas Ethernet de par trenzado y desea conectarlas,
entonces no necesita un concentrador. Puede cablear las dos tarjetas
directamente una a otra. Hay un diagrama que muestra c&oacute;mo hacerlo incluido en
el <CODE>
<A HREF="Ethernet-HOWTO.html">Ethernet Howto</A></CODE>
<P>
<HR>
<A HREF="Redes-En-Linux-Como-10.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-8.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc9">Índice general</A>
</BODY>
</HTML>
