<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Redes en Linux Como (Previamente Net-3 Como): Historia del documento</TITLE>
 <LINK HREF="Redes-En-Linux-Como-3.html" REL=next>
 <LINK HREF="Redes-En-Linux-Como-1.html" REL=previous>
 <LINK HREF="Redes-En-Linux-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Redes-En-Linux-Como-3.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-1.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2. Historia del documento</A></H2>

<P>
<P>El <I>NET-FAQ</I> original fue escrito por Matt Welsh y Terry Dawson para
responder preguntas frecuentes sobre las redes para Linux, un tiempo antes
de que comenzara formalmente el Proyecto de Documentaci&oacute;n de Linux. Cubr&iacute;a
las &uacute;ltimas versiones de desarrollo del Linux Networking Kernel. El
<I>NET-2-HOWTO</I> sobresey&oacute; el <I>NET-FAQ</I> y fue uno de los documentos HOWTO
originales del LDP. Cubr&iacute;a lo que se llam&oacute; versi&oacute;n 2 y posteriormente
versi&oacute;n 3 del Linux Kernel Networking software. Este documento a su vez lo
sobresee y s&oacute;lo se refiere a la versi&oacute;n 4 del Linux Networking Kernel: m&aacute;s
espec&iacute;ficamente a las versiones <CODE>2.0.x</CODE> y <CODE>2.2.x</CODE> del n&uacute;cleo.
<P>Las versiones anteriores de este documento llegaron a ser bastante
grandes a causa de la enorme cantidad de material que ca&iacute;a dentro de
su &aacute;mbito. Para ayudar a resolver este problema se han producido unos
cuantos Como que tratan con temas espec&iacute;ficos sobre redes. Este
documento proporciona referencias a dichos Como cuando sean relevantes y
cubre aquellas &aacute;reas de las que a&uacute;n no se habla en otros documentos.
<P>
<H2><A NAME="ss2.1">2.1 Comentarios y sugerencias</A>
</H2>

<P>
<P>Estamos interesados en que la gente nos proporcione sugerencias (que nos
informen de cambios, errores, etc.). Por favor, p&oacute;ngase en contacto con
nosotros en: 
<A HREF="mailto:poet@linuxports.com">poet@linuxports.com</A>.  De nuevo, si encuentra algo err&oacute;neo o cualquier
cosa que desear&iacute;a que fuese a&ntilde;adida, por favor, contacte con nosotros.
<P>
<HR>
<A HREF="Redes-En-Linux-Como-3.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-1.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
