<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux Networking-concepts HOWTO: ¿Qu&eacute; es una «red de ordenadores»?</TITLE>
 <LINK HREF="conceptos-de-redes-COMO-3.html" REL=next>
 <LINK HREF="conceptos-de-redes-COMO-1.html" REL=previous>
 <LINK HREF="conceptos-de-redes-COMO.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="conceptos-de-redes-COMO-3.html">Página siguiente</A>
<A HREF="conceptos-de-redes-COMO-1.html">Página anterior</A>
<A HREF="conceptos-de-redes-COMO.html#toc2">Índice general</A>
<HR>
<H2><A NAME="definition-computer-network"></A> <A NAME="s2">2. ¿Qu&eacute; es una «red de ordenadores»?</A> </H2>

<P> 
<A NAME="definition-node"></A>  Una red
de ordenadores es un conjunto de material preparado para que los nodos
puedan comunicarse uno con otro (con «nodos» me estoy refiriendo a
ordenadores, impresoras, m&aacute;quinas de refrescos de cola y cualquier otra cosa
que se le ocurra). No es realmente importante <B>c&oacute;mo</B> est&eacute;n conectados:
pueden usar cables de fibra &oacute;ptica o palomas mensajeras. Obviamente, algunas
elecciones son mejores que otras (especialmente si tiene gato).
<P>
<A NAME="definition-sub-network"></A> 
Normalmente, si se va a limitar a conectar dos ordenadores, no se le llama
red; realmente, necesitar&aacute; tres o m&aacute;s para tener una red. Pasa como con la
palabra «grupo»: dos personas son s&oacute;lo una pareja, pero tres ya pueden ser
«grupo». Adem&aacute;s, las redes suelen estar conectadas unas con otras, para
constituirse en redes m&aacute;s grandes. Cada peque&ntilde;a red (normalmente llamada
«subred») puede ser parte de una red m&aacute;s grande.
<P>
<A NAME="definition-network-link"></A> 
La verdadera conexi&oacute;n entre dos ordenadores se llama a menudo «enlace de
red» (network link). Si hay un cable que va de la parte posterior de su
ordenador hasta las otras m&aacute;quinas, ese es su enlace de red.
<P>Hay cuatro cuestiones que generalmente tenemos en cuenta al hablar de
redes de ordenadores:
<P>
<DL>
<DT><B>Tama&ntilde;o</B><DD><P>
<A NAME="definition-LAN"></A> 
Si va a conectar los cuatro ordenadores de casa, tiene lo que
llamamos LAN (Local Area Network - Red de Area Local). Si todo
est&aacute; a una distancia razonable que se pueda cubrir caminando,
se le suele llamar LAN, da igual cu&aacute;ntas m&aacute;quinas est&eacute;n
conectadas, y de qu&eacute; manera est&eacute; hecha la red.
<P>
<A NAME="definition-WAN"></A> 
El otro extremo del espectro es una WAN (Wide Area Network - Red
de Area Amplia). Si tiene un ordenador en Lahore, Pakist&aacute;n, otro
en Birmingham, Reino Unido y otro en Santiago de Chile, e intenta
conectarlos, tendr&aacute; una WAN.
<P>
<DT><B>Topolog&iacute;a: La Forma</B><DD><P>
<A NAME="definition-topology"></A> 
Dibuje un mapa de la red: las l&iacute;neas son los
<A HREF="#definition-network-link">enlaces de red</A>, y cada
nodo es un punto. Quiz&aacute; cada l&iacute;nea lleve a un nodo central, como
una gran estrella, lo que quiere decir que todo el mundo se
comunica a trav&eacute;s de un punto (una 
<A NAME="definition-star-topology"></A>  «topolog&iacute;a en estrella»):
<BLOCKQUOTE><CODE>
<PRE>
    o   o   o
     \_ | _/
       \|/
  o-----o-----o
      _/|\_
     /  |  \
    o   o   o
</PRE>
</CODE></BLOCKQUOTE>
<P>Quiz&aacute; todo el mundo hable en una &uacute;nica l&iacute;nea, como en este caso:
<BLOCKQUOTE><CODE>
<PRE>
    o------o------o-------o--------o
    |                              |
    |                              |
    |                              o
    |                              |
    o                              |
                                   o
</PRE>
</CODE></BLOCKQUOTE>
<P>O puede que tenga tres subredes conectadas a trav&eacute;s de un
nodo:
<BLOCKQUOTE><CODE>
<PRE>
                o
    o           |  o--o--o
    |           |  |
    o--o--o--o--o  o
           \       |
            o------o
           /       |
    o--o--o--o--o  o
    |           |  |
    o           |  o--o
                o
</PRE>
</CODE></BLOCKQUOTE>
<P>Ver&aacute; muchas topolog&iacute;as como estas en la vida real, y mucho m&aacute;s
complejas.
<P>
<DT><B>Aspecto f&iacute;sico: De qu&eacute; est&aacute; hecha</B><DD><P>
<A NAME="definition-sneakernet"></A>  La segunda cuesti&oacute;n a tener en
cuenta es con qu&eacute; ha construido la red. La m&aacute;s barata es la
«sneakernet» (red a zapato), donde gente mal vestida lleva
disquetes de un ordenador a otro. La sneakernet es casi siempre
una 
<A HREF="#definition-LAN">LAN</A>. Los disquetes cuestan
menos de 1 euro, y se puede comprar un s&oacute;lido par de deportivos
por unos 20 euros.
<P>
<A NAME="definition-modem"></A>  El dispositivo m&aacute;s com&uacute;n usado en
casa para conectar a redes mayores se llama «m&oacute;dem»
(MODulador/DEModulador), que convierte una l&iacute;nea de tel&eacute;fono
normal en un enlace de red. Transforma la informaci&oacute;n del
ordenador en sonidos, y escucha los sonidos que vienen del otro
extremo para convertirlos de nuevo en informaci&oacute;n para el ordenador.
Como puede imaginar, esto no es muy eficiente, y las l&iacute;neas de
tel&eacute;fono no fueron dise&ntilde;adas para este uso; pero es popular porque
las l&iacute;neas de tel&eacute;fono son comunes y baratas: se venden m&oacute;demes por
menos de 50 euros y una l&iacute;nea de tel&eacute;fono suele costar unos
doscientos euros al a&ntilde;o.
<P>
<A NAME="definition-ethernet"></A> 
<A NAME="definition-UTP"></A> 
<A NAME="definition-10base2"></A> 
<A NAME="definition-10baseT"></A> 
<A NAME="definition-100baseT"></A> 
<A NAME="definition-coax"></A> 
<A NAME="definition-gigabit-ethernet"></A> 
<A NAME="definition-terminator"></A> 
<A NAME="definition-hub"></A> 
La manera m&aacute;s com&uacute;n de conectar m&aacute;quinas en una LAN es usar
Ethernet. Ethernet se presenta en las siguientes modalidades
principales (listadas de m&aacute;s antigua a la m&aacute;s reciente):
Thinwire/Coax/10base2, UTP (Unshielded Twisted Pair/10baseT y
UTP/100baseT. Tambi&eacute;n se est&aacute; empezando a difundir Gigabit
ethernet (el nombre 1000baseT comenzaba a parecer est&uacute;pido). El cable
10base2 suele ser coaxial negro, con enlaces en forma de T para
conectarlos a los objetos: todos est&aacute;n conectados en una gran
fila, con «terminadores» especiales en ambos extremos. UTP suele
ser cable azul
<BLOCKQUOTE>(N. del T.: en Espa&ntilde;a lo suelo ver blanco
o gris)</BLOCKQUOTE>
 con conectores transparentes al estilo de los
tel&eacute;fonos que se enchufan: cada cable conecta un nodo a un «hub»
(un concentrador) central. El cable costar&aacute; menos de dos euros el
metro, y las tarjetas 10baseT/10base2 (muchas tienen ambos
conectores) est&aacute;n sobre los 30 euros. Las tarjetas 100baseT, que
tambi&eacute;n pueden trabajar con 10baseT, son diez veces m&aacute;s r&aacute;pidas, y
andan por menos de 80 euros.
<P>
<A NAME="definition-fiber"></A> En el otro extremo tenemos la Fibra; un
delgado filamento de cristal, encerrado en una capa protectora que
se puede tender entre continentes. La fibra cuesta miles (de
euros).
<P>
<A NAME="definition-network-interface"></A> Generalmente llamamos a cada
conexi&oacute;n a un nodo «interfaz de red», o «interfaz» para abreviar.
Linux les da nombres como «eth0» para la primera interfaz
ethernet, y «fddi0» para la primera interfaz de fibra. La orden
<CODE>/sbin/ifconfig</CODE> las enumera.
<P>
<DT><B>Protocolo: qu&eacute; se habla</B><DD><P>
<A NAME="definition-protocol"></A> 
El &uacute;ltimo detalle por tener en cuenta es el lenguaje que van a
hablar los ordenadores. Cuando dos 
<A HREF="#definition-modem">m&oacute;demes</A> se comunican por una l&iacute;nea de tel&eacute;fono, se
tienen que poner de acuerdo en el significado de cada sonido,
porque de lo contrario no funcionar&aacute;. Esta convenci&oacute;n se denomina
«protocolo». Seg&uacute;n se descubren nuevas formas de codificar
lo que dicen las computadores en sonidos m&aacute;s peque&ntilde;os, se inventan
nuevos protocolos, y la mayor&iacute;a de los m&oacute;demes probar&aacute;n con varios
protocolos hasta que encuentren uno que el otro extremo entienda.
<P>Otro ejemplo es la red 
<A HREF="#definition-100baseT">100baseT</A> que mencionamos antes: usa los mismos 
<A HREF="#definition-network-link">enlaces de red</A> f&iacute;sicos (
<A HREF="#definition-UTP">UTP</A>) que 
<A HREF="#definition-10baseT">10baseT</A>, pero habla diez veces m&aacute;s r&aacute;pido.
<P>
<A NAME="definition-link-level-protocol"></A> 
<A NAME="definition-hop"></A> 
Estos dos protocolos son lo que denominamos protocolos de «nivel de
enlace»; la manera en que se controla la informaci&oacute;n entre dos
enlaces individuales de red, o «un salto». La palabra «protocolo»
tambi&eacute;n se refiere a otras convenciones, como veremos m&aacute;s
adelante.
</DL>
<P>
<HR>
<A HREF="conceptos-de-redes-COMO-3.html">Página siguiente</A>
<A HREF="conceptos-de-redes-COMO-1.html">Página anterior</A>
<A HREF="conceptos-de-redes-COMO.html#toc2">Índice general</A>
</BODY>
</HTML>
