<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux Networking-concepts HOWTO: Interfaces de llamada: PPP</TITLE>
 <LINK HREF="conceptos-de-redes-COMO-8.html" REL=next>
 <LINK HREF="conceptos-de-redes-COMO-6.html" REL=previous>
 <LINK HREF="conceptos-de-redes-COMO.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="conceptos-de-redes-COMO-8.html">Página siguiente</A>
<A HREF="conceptos-de-redes-COMO-6.html">Página anterior</A>
<A HREF="conceptos-de-redes-COMO.html#toc7">Índice general</A>
<HR>
<H2><A NAME="s7">7. Interfaces de llamada: PPP</A></H2>

<P>
<A NAME="definition-PPP"></A> 
<A NAME="definition-point-to-point-protocol"></A> 
<A NAME="definition-ppp-daemon"></A> 
Cuando llama con su m&oacute;dem a un ISP (Proveedor de Servicios de Internet), y
conecta con el de ellos, el n&uacute;cleo no sabe c&oacute;mo enviar paquetes IP
mediante &eacute;l. Hay un protocolo llamado «Point-to-Point Protocol» (Protocolo
Punto a Punto) o «PPP», que se usa para negociar con el otro extremo antes
de permitir que pase ning&uacute;n paquete. El ISP lo utiliza para identificar
qu&eacute;n llama: en su m&aacute;quina Linux hay un programa llamado «demonio PPP» que
controla su extremo de la negociaci&oacute;n.
<P>
<A NAME="definition-dynamic-ip-address"></A> 
<A NAME="definition-static-ip-address"></A> 
Como hay tantos usuarios «de llamada» en el mundo, normalmente no tienen
su propia direcci&oacute;n IP: la mayor&iacute;a de los ISP le asignar&aacute;n de forma temporal
una de las que ellos poseen, mientras est&aacute; usted conectado (el demonio PPP
la negociar&aacute;). Generalmente se le denomina «direcci&oacute;n IP din&aacute;mica», en
contraposici&oacute;n a «direcci&oacute;n IP est&aacute;tica», que es el caso normal cuando
Usted tiene una conexi&oacute;n permanente. Normalmente van asignadas a los
m&oacute;demes de su ISP: la siguiente vez que marque, posiblemente acceda por un
m&oacute;dem diferente de la reserva de m&oacute;demes, y por lo tanto obtendr&aacute; una IP
diferente.
<P>
<HR>
<A HREF="conceptos-de-redes-COMO-8.html">Página siguiente</A>
<A HREF="conceptos-de-redes-COMO-6.html">Página anterior</A>
<A HREF="conceptos-de-redes-COMO.html#toc7">Índice general</A>
</BODY>
</HTML>
