<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar: Release Early, Release Often</TITLE>
<LINK HREF="cathedral-paper-5.html" REL=next>
<LINK HREF="cathedral-paper-3.html" REL=previous>
<LINK HREF="cathedral-paper.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-05.html">Siguiente</A>
<A HREF="cathedral-es-paper-03.html">Anterior</A> <A HREF="cathedral-es-paper-00.html#toc4">Indice</A>&nbsp;
<HR>
<H2>
<A NAME="s4"></A>4. L&aacute;nzalo pronto, l&aacute;nzalo a menudo</H2>
Los lanzamientos tempranos y frecuentes de versiones de prueba son una
parte cr&iacute;tica del modelo de desarrollo Linux. La mayor&iacute;a
de los programadores (incluy&eacute;ndome a m&iacute;) sol&iacute;an creer
que era una pr&aacute;ctica perjudicial para el desarrollo de cualquier
proyecto que no fuera simplemente trivial, por cuanto las versiones m&aacute;s
tempranas est&aacute;n casi por definici&oacute;n condenadas a ser defectuosas
y no parece conveniente agotar la paciencia de los usuarios.

<P>Esta creencia reforzaba la adhesi&oacute;n generalizada al modelo de
construcci&oacute;n de catedrales para el desarrollo de un programa. Si
el objetivo prioritario consist&iacute;a en exponer al usuario final al
menor n&uacute;mero posible de errores, no hab&iacute;a raz&oacute;n para
lanzar versiones de prueba en menos de seis meses (o incluso mucho menos
a menudo) y tener que trabajar como un perro para depurarlas entre lanzamiento
y lanzamiento. El n&uacute;cleo en C de Emacs se desarroll&oacute; as&iacute;.
La librer&iacute;a en Lisp, sin embargo, no -- por cuanto exist&iacute;an
dep&oacute;sitos activos de c&oacute;digo en Lisp fuera del control de
la FSF&nbsp; a los que se pod&iacute;a acudir para encontrar versiones
nuevas y en desarrollo salt&aacute;ndose los ciclos de lanzamiento de Emacs.

<P>El m&aacute;s importante de todos ellos, el dep&oacute;sito de 'elisp'
de la Universidad Ohio State, anticip&oacute; el esp&iacute;ritu y muchas
de las caracter&iacute;sticas de los grandes dep&oacute;sitos Linux de
la actualidad. Pero pocos de nosotros prestamos atenci&oacute;n a lo que
est&aacute;bamos haciendo, o a los problemas relacionados con el estilo
de construcci&oacute;n de catedrales empleado por la FSF que la mera existencia
de tales archivos implicaba. Hacia 1992, trat&eacute; seriamente de incorporar
formalmente una buena parte del c&oacute;digo Ohio a la librer&iacute;a
oficial de Emacs Lisp. Top&eacute; con problemas pol&iacute;ticos y fue
pr&aacute;cticamente un desastre...

<P>Pero cosa de un a&ntilde;o despu&eacute;s, conforme Linux se hac&iacute;a
cada vez m&aacute;s visible, qued&oacute; claro que algo distinto y mucho
m&aacute;s saludable estaba ocurriendo. La pol&iacute;tica de desarrollo
abierto de Linus era justo lo contrario del estilo catedral. Los dep&oacute;sitos
de 'sunsite' y 'tsx-11' estaban a rebosar, y aparecieron varias distribuciones.
Y todo ello era el fruto de lanzamientos del n&uacute;cleo del sistema
a una frecuencia ins&oacute;lita.

<P>Linus estaba tratando a sus usuarios como colaboradores de la forma
m&aacute;s eficaz que imaginarse pueda:

<P><I>7. L&aacute;nzalo pronto. L&aacute;nzalo a menudo. Y escucha a tus
usuarios.</I>

<P>La innovaci&oacute;n de Linus no consisti&oacute; tanto en c&oacute;mo
hacer las cosas (algo parecido hab&iacute;a sido ya tradici&oacute;n en
el mundo Unix durante mucho tiempo), sino en llevarlo a una escala del
mismo nivel que la complejidad del proyecto que estaba acometiendo. No
era raro que en aquellos tiempos &iexcl;lanzara m&aacute;s de una versi&oacute;n
nueva del n&uacute;cleo <I>al d&iacute;a</I>!. Y, debido a que cuidaba
su base de colaboradores y usaba los recursos ofrecidos por Internet para
la colaboraci&oacute;n mejor que nadie, funcion&oacute;.

<P>Pero &iquest;<I>c&oacute;mo funcion&oacute;</I>?. &iquest;Era algo que
yo pudiera reproducir o depend&iacute;a de alguna extra&ntilde;a habilidad
de Linus?.

<P>No lo cre&iacute;a as&iacute;. Por supuesto que Linus es un hacker condenadamente
capaz (&iquest;cuantos de nosotros ser&iacute;amos capaces de construir
el n&uacute;cleo completo de un sistema operativo con calidad a nivel de
producci&oacute;n?). Pero Linux no representaba ning&uacute;n salto conceptual
aterrador. Linus no es (o al menos no lo es todav&iacute;a) un genio innovador
del dise&ntilde;o a la manera en que lo son, por poner un par de ejemplos,
Richard Stallman o James Gosling. Linus me parece m&aacute;s bien un genio
de la ingenier&iacute;a, con un sexto sentido para evitar errores y v&iacute;as
muertas en el desarrollo y una maravillosa capacidad para encontrar el
camino de menor resistencia que conecta el punto A con el B. De hecho,
el propio dise&ntilde;o de Linux respira esta cualidad y refleja esa aproximaci&oacute;n
conservadora y simplificadora tan propia de Linus.

<P>Por tanto, si los lanzamientos r&aacute;pidos y el empleo de Internet
no eran accidentes sino partes integrales del genio ingenieril de Linus
que le llevaba a localizar el camino de m&iacute;nimo esfuerzo &iquest;qu&eacute;
era lo que estaba maximizando?. &iquest;Qu&eacute; produc&iacute;a su maquinaria?.

<P>As&iacute; planteada, la pregunta se contesta sola. Linus estaba manteniendo
a sus colaboradores/usuarios en un continuo est&iacute;mulo y una recompensa
constante -- estimulados por la perspectiva de tener un trozo de la acci&oacute;n
a su disposici&oacute;n para satisfacer su ego, y recompensados por la
visi&oacute;n de una mejora continua (incluso <I>diaria</I>) de su trabajo.

<P>Linus estaba intentando maximizar directamente el n&uacute;mero de horas
por persona dedicadas a la depuraci&oacute;n y el desarrollo a&uacute;n
a costa de aumentar la inestabillidad del c&oacute;digo y arriesgarse a
quemar a su base de usuarios si alg&uacute;n error serio terminaba por
ser imposible de solucionar. Linus se estaba comportando como si creyera
algo parecido a esto:

<P><I>8. Dada una base lo suficientemente amplia de probadores y colaboradores,
casi todos los problemas se identificar&aacute;n con rapidez y su soluci&oacute;n
ser&aacute; obvia para alguien.</I>

<P>O, expresado con menor formalidad, "Con un n&uacute;mero de ojos suficiente,
todos los errores son nader&iacute;as". Yo lo llamo "La ley de Linus".

<P>Al principio yo lo planteaba diciendo que todo problema "ser&iacute;a
transparente para alguien". Linus observ&oacute; que aquel que entiende
y soluciona un problema no necesariamente, y ni siquiera habitualmente,
es quien primero lo caracteriza. "Alguien encuentra un problema", dice,
"y <I>alg&uacute;n otro</I> lo entiende. Y me atrevo a decir que la parte
m&aacute;s dif&iacute;cil es encontrarlo". Pero lo importante es que ambas
cosas tienden a ocurrir con rapidez.

<P>Esta es, creo, la diferencia fundamental entre los estilos catedral
y bazar. De acuerdo con la forma en que contempla la programaci&oacute;n
quien lo hace al modo en que se construye una catedral, los errores y los
problemas de desarrollo son fen&oacute;menos insidiosos, profundos y retorcidos.
Hacen falta meses de escrutinio por un peque&ntilde;o n&uacute;mero de
gente dedicada a ello para poder confiar en que se hayan eliminado. De
ah&iacute; los periodos largos requeridos para el lanzamiento de nuevas
versiones, y el inevitable disgusto experimentado cuando las que tanto
tiempo se han esperado no resultan perfectas.

<P>A la luz del modelo bazar, en cambio, se supone que los errores son
normalmente asuntos leves -- o, al menos, que se convertir&aacute;n en
tales con bastante rapidez en cuanto se expongan a los ojos ansiosos de
algunos miles de colaboradores dedicados a poner del derecho y del rev&eacute;s
cada nueva versi&oacute;n.&nbsp; As&iacute; que te dedicas a lanzar versiones
con frecuencia para conseguir a&uacute;n m&aacute;s correcciones, y como
un beneficioso efecto colateral logras tener menos que perder si haces
alguna chapuza de vez en cuando.

<P>Y esto es todo. Y ya basta. Si la "ley de Linus" es falsa, entonces
cualquier sistema tan complejo como el n&uacute;cleo de Linux, producido
artesanalmente y de manera aficionada, deber&iacute;a haberse colapsado
en alg&uacute;n momento bajo el peso de interacciones perjudiciales no
previstas y de errores profundos no descubiertos. Por otra parte, si es
cierta, basta para explicar la relativa falta de defectos en Linux.

<P>Y quiz&aacute; no debiera haber sido una sorpresa. Hace algunos a&ntilde;os
que los soci&oacute;logos descubrieron que el promedio de las opiniones
de un grupo de observadores igualmente experto (o igualmente ignorante)
es un estimador bastante m&aacute;s fiable que el obtenido a partir de
un grupo elegido aleatoriamente. Lo llaman "efecto Delphi". Parece que
lo que Linus ha puesto de manifiesto es que lo anterior se aplica tambi&eacute;n
a la depuraci&oacute;n de un sistema operativo -- que el efecto Delphi
puede mitigar la complejidad del desarrollo incluso al nivel de complejidad
asociado al n&uacute;cleo de un sistema operativo.

<P>Tengo una deuda con Jeff Dutky &lt;dutky@wam.umd.edu> por apuntar que
la ley de Linus pod&iacute;a reformularse diciendo que "la depuraci&oacute;n
es paralelizable". Jeff hace notar que aunque la depuraci&oacute;n requiere
que los que la realizan se comuniquen a trav&eacute;s de alguien que coordine
el proceso, no precisa de una gran coordinaci&oacute;n entre ellos. No
est&aacute; sujeta por tanto a ese aumento cuadr&aacute;tico de complejidad
y costes que convierten en un problema la simple adici&oacute;n de programadores.

<P>En la pr&aacute;ctica, la p&eacute;rdida te&oacute;rica de eficacia
debida a la duplicaci&oacute;n del trabajo por los depuradores casi nunca
parece ser un problema en el mundo Linux. Otro efecto de la pol&iacute;tica
de lanzamientos tempranos y frecuentes consiste en minimizar tal redundancia
de esfuerzos mediante la difusi&oacute;n r&aacute;pida de correcciones
ya realizadas.

<P>Brooks incluso realiz&oacute; una observaci&oacute;n original relacionada
con la de Jeff: ``El coste total de mantenimiento de un programa de uso
generalizado viene a ser de un 40 por ciento o m&aacute;s del coste necesario
para su desarrollo. Resulta sorprendente, sin embargo, que este coste depende
fuertemente del n&uacute;mero de usuarios. <I>M&aacute;s usuarios implica
que se encuentran mas errores</I>." (El &eacute;nfasis es m&iacute;o).

<P>Un n&uacute;mero mayor de usuarios encuentra m&aacute;s errores debido
a que a&ntilde;ade muchas m&aacute;s formas diferentes de forzar el programa.
Este efecto se amplifica cuando los usuarios colaboran en el desarrollo.
Cada uno enfoca la caracterizaci&oacute;n de los errores con un esquema
de percepci&oacute;n y un conjunto de herramientas ligeramente distinto,
mirando el problema desde otro punto de vista. El "efecto Delphi" parece
funcionar precisamente por causa de esta diversidad. En el contexto de
la depuraci&oacute;n de un programa, esta variaci&oacute;n tiende tambi&eacute;n
a reducir la duplicaci&oacute;n de esfuerzos.

<P>En consecuencia, a&ntilde;adir m&aacute;s personas al ciclo de prueba
y depuraci&oacute;n puede no reducir la magnitud del error m&aacute;s profundo
existente en un momento dado desde el punto de vista <I>del que desarrolla
el programa</I>, pero aumenta la probabilidad de que las herramientas de
alguien resulten adecuadas a su detecci&oacute;n de tal manera que dicho
error resulte una nader&iacute;a <I>para esa persona</I>.

<P>Linus toma tambi&eacute;n algunas precauciones adicionales. Si es probable
que existan errores importantes, las versiones del n&uacute;cleo se numeran
de tal forma que los usuarios potenciales puedan elegir entre emplear la
&uacute;ltima versi&oacute;n etiquetada como "estable" o pasear por el
filo de la navaja exponi&eacute;ndose a errores si desean nuevas posibilidades.
La mayor&iacute;a de los 'hackers' del mundo Linux no imitan a&uacute;n
formalmente esta t&aacute;ctica, pero quiz&aacute; debieran hacerlo pues
el hecho de disponer de ambas opciones las hace m&aacute;s atractivas.

<P>
<HR><A HREF="cathedral-es-paper-05.html">Siguiente</A> <A HREF="cathedral-es-paper-03.html">Anterior</A>
<A HREF="cathedral-es-paper-00.html#toc4">Indice</A>
</BODY>
</HTML>
