<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar: The Importance of Having Users</TITLE>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-04.html">Siguiente</A>
<A HREF="cathedral-es-paper-02.html">Anterior</A> <A HREF="cathedral-es-paper-00.html#toc3">Indice</A>

<P>
<HR>
<H2>
<A NAME="s3"></A>3. La importancia de tener usuarios</H2>
O sea, que hered&eacute; 'popclient'. Y lo que es casi igual de importante,
hered&eacute; sus usuarios. Los usuarios son una gran cosa, y no s&oacute;lo
porque demuestren que est&aacute;s satisfaciendo una necesidad, que est&aacute;s
haciendo algo bien. Si los cuidas bien, pueden convertirse en tus ayudantes,
en programadores asociados.

<P>Otro de los puntos fuertes de la tradici&oacute;n Unix, y de nuevo uno
que Linux lleva hasta un feliz extremo, es que muchos usuarios son a la
vez 'hackers'. -- y puesto que el c&oacute;digo fuente est&aacute; disponible
pueden ser 'hackers' productivos. Esto puede resultar enormemente eficaz
para reducir el tiempo necesario para la depuraci&oacute;n. Con un poco
de motivaci&oacute;n, tus usuarios diagnosticar&aacute;n problemas, sugerir&aacute;n
correcciones, y ayudar&aacute;n a mejorar el c&oacute;digo mucho m&aacute;s
r&aacute;pidamente de lo que t&uacute; ser&iacute;as capaz&nbsp; de lograr
sin ayuda.

<P><I>6. Tratar a tus usuarios como colaboradores es el camino menos complicado
para mejorar con rapidez y depurar eficazmente un programa.</I>

<P>Resulta f&aacute;cil subestimar la potencia de este efecto. En realidad,
muchos de los que estamos involucrados en el desarrollo de software abierto
infravalor&aacute;bamos dr&aacute;sticamente lo bien que puede aumentarse
de escala sin m&aacute;s que recurrir a un n&uacute;mero a&uacute;n mayor
de usuarios y contribuir a reducir la complejidad del sistema, hasta que
Linus demostr&oacute; lo contrario.

<P>Llego a creer que el logro m&aacute;s brillante y trascendental de Linus
no fue la construcci&oacute;n del n&uacute;cleo de Linux en s&iacute; mismo,
sino m&aacute;s bien la invenci&oacute;n del modelo de desarrollo Linux.
Una vez que me atrev&iacute; a decir tal cosa en su presencia, se limit&oacute;
a sonreir y repiti&oacute; en voz baja algo que ha dicho a menudo: "Soy
b&aacute;sicamente una persona muy perezosa a la que le gusta recibir los
laureles de lo que otros han hecho". Perezoso como un zorro. O, como dir&iacute;a
Robert Heinlein, demasiado perezoso como para equivocarse.

<P>Mirando hacia atr&aacute;s, puede verse un claro precedente de los m&eacute;todos
y el &eacute;xito de Linux en el desarrollo de la librer&iacute;a Lisp
de GNU Emacs y en los archivos de c&oacute;digo Lisp. Al contrario de lo
ocurrido con el desarrollo en plan construcci&oacute;n de catedrales del
n&uacute;cleo en C de Emacs y de la mayor parte de las herramientas de
la FSF (Free Software Fundation), la evoluci&oacute;n del dep&oacute;sito
de c&oacute;digo en Lisp fu&eacute; fluida y estuvo sumamente orientada
al usuario final. Las ideas y los modos adicionales en desarrollo se escribieron
a menudo tres o cuatro veces antes de alcanzar un estado final estable.
Y fueron frecuentes las colaboraciones ocasionales mediante Internet,&nbsp;
en plan Linux.

<P>Sin ir m&aacute;s lejos, el desarrollo concreto de mayor &eacute;xito
que yo hab&iacute;a realizado antes de 'fetchmail' fue probablemente el
modo VC de Emacs, una colaboraci&oacute;n en la l&iacute;nea de Linux con
otras tres personas a trav&eacute;s de e-mail, de las cuales s&oacute;lo
he llegado a conocer hasta el momento a una de ellas (Richard Stallman).
Se trataba de un interfase de acceso a SCCS, RCS y posteriormente CVS desde
Emacs que permit&iacute;a llevar a cabo operaciones de control de versiones
de manera directa. El punto de partida fue un min&uacute;sculo y bastante
crudo sccs.el.mode que alg&uacute;n otro hab&iacute;a escrito. Y el desarrollo
de VC tuvo &eacute;xito debido a que, al contrario que el mismo Emacs,
los programas en Lisp de Emacs permit&iacute;an llevar a cabo ciclos de
lanzamiento/prueba/mejora muy r&aacute;pidamente.

<P>(Un efecto colateral inesperado de la pol&iacute;tica de la FSF de mantener
legalmente el c&oacute;digo bajo la licencia GPL consiste en que su gesti&oacute;n
dificulta la utilizaci&oacute;n del modelo bazar, ya que creen que deben
conseguir una transferencia del copyright para cada contribuci&oacute;n
que supera las veinte l&iacute;neas de c&oacute;digo con el fin de blindar
el c&oacute;digo bajo esta licencia de cualquier amenaza proveniente de
las leyes de propiedad intelectual. Aquellos que recurren a licencias del
tipo BSD o del consorcio MIT X&nbsp; no sufren este problema por cuanto
no tratan de reservar unos derechos que dif&iacute;cilmente alguien pudiera
tener inter&eacute;s en poner en peligro).

<P>
<HR><A HREF="cathedral-es-paper-04.html">Siguiente</A> <A HREF="cathedral-es-paper-02.html">Anterior</A>
<A HREF="cathedral-es-paper-00.html#toc3">Indice</A>
</BODY>
</HTML>
