<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar: For Further Reading</TITLE>
<LINK HREF="cathedral-paper-13.html" REL=next>
<LINK HREF="cathedral-paper-11.html" REL=previous>
<LINK HREF="cathedral-paper.html#toc12" REL=contents>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-13.html">Siguiente</A>
<A HREF="cathedral-es-paper-11.html">Anterior</A> <A HREF="cathedral-es-paper-00.html#toc12">Indice</A>&nbsp;
<HR>
<H2>
<A NAME="s12"></A>12. Lecturas adicionales</H2>
Se ha citado varias veces el cl&aacute;sico de&nbsp; Frederick P. Brooks's
<I>The Mythical Man-Month</I> debido a que, en muchos aspectos, sus observaciones
a&uacute;n no han sido superadas. Recomiendo ardientemente la edici&oacute;n
del 25 aniversario realizada por Addison-Wesley&nbsp; (ISBN 0-201-83595-9),
que le a&ntilde;ade su trabajo de 1986 <I>``No Silver Bullet''</I>.

<P>La nueva edici&oacute;n se ve completada por una inestimable retrospectiva
del tema 20 a&ntilde;os despu&eacute;s de haber sido propuesto en la que
Brooks aborda directamente los pocos juicios del texto original que no
han soportado el paso del tiempo. Le&iacute; por primera vez dicha retrospectiva
tras haber completado pr&aacute;cticamente este trabajo, y me sorprendi&oacute;
que Brooks &iexcl;atribuya pr&aacute;cticas similares al estilo bazar a
Microsoft!.

<P>El libro <I>The Psychology Of Computer Programming</I> (New York, Van
Nostrand Reinhold 1971) de Gerald P. Weinberg introdujo el desafortunado
t&eacute;rmino de "programaci&oacute;n sin ego". Aunque no fuera desde
luego la primera persona en darse cuenta de la futilidad del "principio
de mando", s&iacute; fue probablemente la primera en reconocer su importancia
y discutirlo en relaci&oacute;n con el desarrollo del software.

<P>Richard P. Gabriel, al estudiar la cultura Unix en la &eacute;poca anterior
a Linux, se vi&oacute; forzado a argumentar sobre la superioridad de un
primitivo modelo bazar en su trabajo de 1989 <I>Lisp: Good News, Bad News,
and How To Win Big</I>. Aunque haya quedado desfasado en algunos aspectos,
este ensayo es todav&iacute;a muy celebrado entre los incondicionales de
Lisp (en los que me incluyo). Un corresponsal me record&oacute; que la
secci&oacute;n titulada "Peor es lo mejor" puede considerarse casi como
una anticipaci&oacute;n de Linux. Este trabajo puede conseguirse a trav&eacute;s
de Internet en la direcci&oacute;n siguiente <A HREF="http://alpha-bits.ai.mit.edu/articles/good-news/good-news.html">http://alpha-bits.ai.mit.edu/articles/good-news/good-news.html</A>.

<P>El libro de De Marco y Lister <I>Peopleware: Productive Projects and
Teams</I> (New York; Dorset House, 1987; ISBN 0-932633-05-6) es una joya
menospreciada que me encant&oacute; ver citada por Fred Brooks en su retrospectiva.
Aunque poco de lo que proponen los autores pueda aplicarse a las comunidades
Linux o a la del software abierto, la visi&oacute;n del autor al estudiar
las condiciones precisas para realizar un trabajo creativo resulta aguda
y valiosa para cualquiera que intente tomar algunas de las virtudes del
modelo bazar con el fin de aplicarlas en un contexto m&aacute;s comercial.

<P>Finalmente, debo admitir que estuve muy cerca de titular este trabajo
"La catedral y el &aacute;gora", un t&iacute;tulo en el que "&aacute;gora"
indica el vocablo griego para designar un mercado abierto o una plaza p&uacute;blica.
Los trabajos seminales de Mark Miller y Eric Drexler sobre lo que ellos
denominaban "sistemas ag&oacute;ricos", en los que describ&iacute;an las
propiedades emergentes de ecolog&iacute;as computacionales similares a
las de un mercado, me ayudaron a pensar con claridad sobre fen&oacute;menos
an&aacute;logos en la cultura del software abierto cuando, cinco a&ntilde;os
m&aacute;s tarde,&nbsp; Linux me meti&oacute; de cabeza en &eacute;l. Estos
trabajos se pueden conseguir asimismo a trav&eacute;s de Internet en <A HREF="http://www.agorics.com/agorpapers.html">http://www.agorics.com/agorpapers.html</A>.

<P>
<HR><A HREF="cathedral-es-paper-13.html">Siguiente</A> <A HREF="cathedral-es-paper-11.html">Anterior</A>
<A HREF="cathedral-es-paper-00.html#toc12">Indice</A>
</BODY>
</HTML>
