<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar: Necessary Preconditions for the Bazaar Style</TITLE>
<LINK HREF="cathedral-paper-10.html" REL=next>
<LINK HREF="cathedral-paper-8.html" REL=previous>
<LINK HREF="cathedral-paper.html#toc9" REL=contents>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-10.html">Siguiente</A>
<A HREF="cathedral-es-paper-08.html">Anterior</A> <A HREF="cathedral-es-paper-00.html#toc9">Indice</A>&nbsp;
<HR>
<H2>
<A NAME="s9"></A>9. Condiciones previas necesarias para el modelo bazar</H2>
Los primeros jueces y audiencias de este trabajo plantearon constantemente
preguntas sobre las condiciones previas necesarias para el &eacute;xito
de un desarrollo que empleara el modelo bazar, relativas tanto a la calificaci&oacute;n
del l&iacute;der del proyecto como all estado en que debe encontrarse el
c&oacute;digo al ponerlo a disposici&oacute;n del p&uacute;blico para intentar
formar un grupo de colaboradores.

<P>Est&aacute; bastante claro que uno no puede empezar desde cero en el
modelo bazar. Se puede poner a prueba, depurar y mejorar en el estilo bazar,
pero parece dif&iacute;cil <I>iniciar</I> un proyecto con este modelo.
Linus no lo intent&oacute;. Yo tampoco. Tu naciente grupo de colaboradores
necesita algo que pueda ejecutar y probar para jugar con &eacute;l.

<P>Cuando empiezas a reclutar un grupo, hace falta que puedas presentarle
una <I>promesa plausible</I>. Tu programa no tiene que trabajar particularmente
bien. Puede ser tosco, incompleto, estar lleno de errores y escasamente
documentado. Pero no puede dejar de convencer a los potenciales colaboradores
sobre su capacidad de evolucionar hasta convertirse en algo brillante en
un futuro no demasiado lejano.

<P>Tanto Linux como 'fetchmail' se pusieron a disposici&oacute;n del p&uacute;blico
con dise&ntilde;os b&aacute;sicos robustos y atractivos. Mucha gente que
ha pensado sobre el modelo bazar como yo lo he expuesto ha considerado
acertadamente que esto era cr&iacute;tico y ha pasado de un salto a concluir
que el l&iacute;der del proyecto necesita contar con un alto grado de inteligencia
e intuici&oacute;n para el dise&ntilde;o.

<P>Pero Linus tom&oacute; su dise&ntilde;o de Unix. Yo cog&iacute; el m&iacute;o
inicialmente del ancestral 'popmail' (aunque luego cambi&oacute; en buena
medida, proporcionalmente mucho m&aacute;s que Linux). Por tanto &iquest;hace
falta de verdad que el l&iacute;der/coordinador de un esfuerzo en el modelo
bazar tenga un talento excepcional para el dise&ntilde;o, o puede bastar
con aprovechar el talento de los dem&aacute;s?.

<P>No creo que la capacidad del coordinador para crear dise&ntilde;os de
excepcional brillantez resulte cr&iacute;tica, pero s&iacute; lo es su
capacidad para <I>reconocer las buenas ideas de dise&ntilde;o de los dem&aacute;s</I>.

<P>Tanto Linux como 'fetchmail' muestran evidencias de esto &uacute;ltimo.
Mientras que Linus no es (como ya discutimos) un programador espectacularmente
original, ha exhibido un potente don para reconocer&nbsp; buenos dise&ntilde;os
e incorporarlos al n&uacute;cleo de Linux. Y yo ya he contado como la idea
m&aacute;s potente en el dise&ntilde;o de 'fecthmail' (el reenv&iacute;o
SMTP) la proporcion&oacute; otra persona.

<P>Los primeros oyentes de este trabajo me alagaron al sugerir que tend&iacute;a
a infravalorar la originalidad de los dise&ntilde;os en el modelo bazar
porque yo tengo mucha, y en consecuencia la daba por descontada. Puede
ser cierto; el dise&ntilde;o (en lugar de la programaci&oacute;n o la depuraci&oacute;n)
es desde luego mi punto fuerte.

<P>Pero el problema de ser listo y original a la hroa de dise&ntilde;ar
software consiste en que se convierte en un h&aacute;bito -- empiezas deliberadamente
a hacer las cosas brillantes y complicadas cuando deber&iacute;as tratar
de mantenerlas robustas y sencillas. He llevado bastantes proyectos a la
ruina al cometer esta equivocaci&oacute;n, pero consegu&iacute; que no
me ocurriera con 'fetchmail'.

<P>As&iacute; que creo que el proyecto 'fetchmail' tuvo &eacute;xito en
parte porque contuve mi tendencia a exhibir mi brillantez, y eso (al menos)
parece oponerse a que para que un proyecto al estilo bazar tenga &eacute;xito
sea preciso un alto grado de originalidad en el dise&ntilde;o. Y pensemos
en Linus. Supongamos que Linus Torvalds hubiera intentado introducir innovaciones
fundamentales en el dise&ntilde;o de sistemas operativos durante el desarrollo;
&iquest;es plausible que el n&uacute;cleo resultante fuera tan estable
y exitoso como el que tenemos?.

<P>Hace falta un cierto nivel de capacidad de dise&ntilde;o y programaci&oacute;n,
por supuesto, pero creo que casi cualquiera que piense seriamente en lanzar
un proyecto siguiendo el estilo bazar estar&aacute; por encima de ese m&iacute;nimo.
El mercado de reputaciones ligado a la comunidad del software abierto ejerce
una sutil presi&oacute;n sobre la gente para no embarcarse en esfuerzos
que no sean capaces de llevar a cabo. Hasta el momento, esto parece haber
funcionado bastante bien.

<P>Para tener &eacute;xito en el estilo bazar, hay otro tipo de habilidad
que no se asocia normalmente con el desarrollo de software que creo es
tan importante como la lucidez para el dise&ntilde;o -- y quiz&aacute;
lo sea m&aacute;s, incluso. El que coordina un proyecto en el modelo bazar
debe ser capaz de comunicarse con la gente.

<P>Esto &uacute;ltimo deber&iacute;a resultar obvio. Para formar una comunidad
de desarrollo, es preciso atraer a la gente, interesarlos en lo que est&aacute;s
haciendo, y mantenerlos contentos con el trabajo que est&aacute;n haciendo.
Tu habilidad t&eacute;cnica cuenta bastante para lograrlo, pero no es desde
luego toda la historia. Tu personalidad tambi&eacute;n cuenta.

<P>No es casualidad que Linus sea un tipo agradable que le cae bien a la
gente y al que no les importa ayudar. No es coincidencia que yo sea un
extrovertido en&eacute;rgico al que le encantan las multitudes y que posee
ciertos instintos m&aacute;s propios de un c&oacute;mico que otra cosaI.
Para que el modelo bazar funcione, ayuda enormemente que seas un poquito
habil cuando se trata de agradar a la gente.

<P>
<HR><A HREF="cathedral-es-paper-10.html">Siguiente</A> <A HREF="cathedral-es-paper-08.html">Anterior</A>
<A HREF="cathedral-es-paper-00.html#toc9">Indice</A>
</BODY>
</HTML>
