<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <TITLE>lf213, Applications: Analizando los ficheros log de sus aplicaciones de Internet</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://www.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://www.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/EgonWillighagen.jpg" width="79"
    height="102" alt="[EgonWillighagen]">
<BR>por  <A href="mailto:egonw@logreport.org">Logreport, Egon Willighagen</A>
<BR><BR>
<I>Sobre el autor:</I><BR>

    Adem&aacute;s de trabajar para el proyecto LinuxFocus, Egon tambi&eacute;n trabaja para
    la Fundaci&oacute;n Logreport, que desarrolla el software lire.

    
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Instalaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex2">Lire como una tarea temporizada</A></LI>
  <LI><A HREF="#lfindex3">Lire como herramienta stand-alone</A></LI>
  <LI><A HREF="#lfindex4">Conclusi&oacute;n</A></LI>
  <LI><A HREF="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=213&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Analizando los ficheros log de sus aplicaciones de Internet</H2>
 <IMG src="../../common/images/illustration213.png" width="300"
    height="65" alt="[illustration]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

    Este art&iacute;culo es el primero de una serie sobre el uso del lire para
    analizar los ficheros log de las aplicaciones servidoras de internet.
    No se limita a un servicio, por ejemplo Apache, sino que es un analizador
    integrado para muchos servicios. Se incluyen DNS, WWW y correo electr&oacute;nico.
    Este art&iacute;culo explica como empezar a manejarse con lire. Discute la
    instalaci&oacute;n y configuraci&oacute;n para generar informes.

    </P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>


    <P>La mayor&iacute;a de los servicios internet tienen la capacidad de registrar
    logs de su actividad. Por ejemplo, el servidor web Apache a&ntilde;ade una l&iacute;nea
    de informaci&oacute;n al fichero log por cada petici&oacute;n de una p&aacute;gina web. Dependiendo
    del formato de la l&iacute;nea, incluye informaci&oacute;n como la p&aacute;gina solicitada, el
    tama&ntilde;o de la p&aacute;gina, qu&eacute; navegador se utiliz&oacute;, y mucho m&aacute;s. En caso del
    servidor de correo electr&oacute;nico se genera un fichero similar. Contiene la
    direcci&oacute;n de email del remitente del mensaje, el destinatario, su tama&ntilde;o, etc.
    De hecho, todos los servicios de internet tienen esta capacidad.</P>

    <P>Estos ficheros de log contienen enormes cantidades de informaci&oacute;n, pero
    el formato es dif&iacute;cil de interpretar a mano. Se necesita una herramienta que
    realice res&uacute;menes de los datos para facilitar el an&aacute;lisis del contenido. En el
    caso de los servicios www, lo convierte a listas TopX para servidores web, dominios
    y plataformas, y entradas de diagramas de tiempos. La mayor&iacute;a de los <I>contadores</I>
    de produtos de terceros fabricantes muestran este tipo de descripciones.</P>

    <P>Existen herramientas para analizar el contenido de la mayor&iacute;a de tipos de
    fichero log. <A href="http://logreport.org/">lire</A> es una de esas herramientas.
    Pero lire es diferente de casi todas las dem&aacute;s herramientas. Lire es un sistema
    integrado que es capaz de analizar, no s&oacute;lo un tipo de servicio internet, sino muchos.
    Y los informes que resumen la informaci&oacute;n interesante ya est&aacute;n insertados. Aunque
    tambi&eacute;n se pueden dise&ntilde;ar informes a medida.</P>

    <P>Lire se puede utilizar de diferentes maneras. Se puede ejecutar desde la l&iacute;nea de
    comandos o tener un cron instalado que le env&iacute;e los informes por email. En el anterior
    caso usted puede elegir el formato de salida del informe. Los formatos de salida
    actuales incluyes texto plano, HTML, DocBook, PDF y LogML. En el caso del cron, el
    &uacute;nico formato en este momento es texto plano.</P>

    <P>Actualmente pueden ser analizados los ficheros los de estos servicios:</P>

    <UL>
      <LI>
        <B>www</B>

        <UL>
          <LI><A href="http://www.apache.org/">Apache</A></LI>

          <LI><A href="http://www.boa.org/">Boa</A></LI>
        </UL>
      </LI>

      <LI>
        <B>email</B>

        <UL>
          <LI><A href="http://www.exim.org/">Exim</A></LI>

          <LI><A href="http://www.postfix.org/">Postfix</A></LI>

          <LI><A href="http://www.sendmail.org/">Sendmail</A></LI>

          <LI><A href="http://www.qmail.org/top.html">Qmail</A></LI>
        </UL>
      </LI>

      <LI>
        <B>dns</B>

        <UL>
          <LI><A href=
          "http://www.isc.org/products/BIND/">Bind8/9</A></LI>
        </UL>
      </LI>
    </UL>

    <P>Lire est&aacute; en pleno desarrollo, actualmente con 3 personas contratadas trabajando
    en &eacute;l. La asistencia t&eacute;cnica es una de sus tareas, as&iacute; que si usted tiene alguna
    petici&oacute;n especial (por ejemplo, nuevos servicios) o preguntas de soporte general,
    por favor deje un mensaje en <A href=
    "http://sourceforge.net/projects/logreport/">LogReport's
    SourceForge site</A>.</P>

    <A NAME="lfindex1">&nbsp;</A>
<H2>Instalaci&oacute;n</H2>

    Se pueden descargar versiones recientes de lire desde el <A href=
    "http://sourceforge.net/project/showfiles.php?group_id=5049">website de SourceForge
    </A>. Existen paquetes tar.gz, RPM y Debian disponibles. <A href="http://packages.debian.org/testing/admin/lire.html">Debian
    Woody</A> and <A href=
    "http://packages.debian.org/unstable/admin/lire.html">Sid</A> tambi&eacute;n incluyen lire. La
    instalaci&oacute;n de paquetes binarios es la habitual. La instalaci&oacute;n del paquete tar.gz tambi&eacute;n
    funciona como se espera:
<PRE class="programlisting">
./configure
make
make install
</PRE>

    <P>El programa de configuraci&oacute;n tiene las siguientes opciones:</P>

    <TABLE>
      <TR>
        <TD align="center"><B>opci&oacute;n</B></TD>

        <TD align="center"><B>descripci&oacute;n</B></TD>
      </TR>

      <TR>
        <TD>--prefix=/some/dir</TD>

        <TD>Establece el directorio root para la instalaci&oacute;n. Por defecto es
        <I>/usr/local</I>.</TD>
      </TR>

      <TR>
        <TD>--with-perl5libdir=/some/dir</TD>

        <TD>Establece el directorio donde se instalan los m&oacute;dulos Perl de lire.
        Por defecto es <I>$prefix/share/perl5</I>.</TD>
      </TR>

      <TR>
        <TD>--with-sgmldir=/some/dir</TD>

        <TD>Path al directorio de instalaci&oacute;n de SGML. Por defecto son
        <I>$prefix/lib/sgml</I> y <I>$prefix/share/sgml</I>.</TD>
      </TR>
    </TABLE>

    <P>Si est&aacute; pensando en utilizar formatos de salida diferentes de texto plano, necesitar&aacute;
    instalar herramientas XML como las p&aacute;ginas de estilo DocBook XML, Jade, y un procesador XML
    como Xalan o Sablotron. Con la tercera opci&oacute;n para el programa de configuraci&oacute;n, se le puede
    decir d&oacute;nde se instalan sus ficheros SGML.</P>

    <A NAME="lfindex2">&nbsp;</A>
<H2>Lire como una tarea temporizada</H2>

    Una vez instalado lire, se puede utilizar el programa stand alone  <I>lr_log2report</I>.
    Pero si planea utilizar lire como tarea temporizada, lo deber&aacute; configurar primero. Esto se
    hace con el programa <I>lr_config</I>. Las preguntas se ofrecen comentadas una a una:

    <P><B>&iquest;Comenz&oacute; este script como este usuario?</B></P>

    <P>El script necesita ser ejecutado por un usuario que sea capaz de leer los ficheros log.
    Los ficheros log a menudo son legibles s&oacute;lamente por <I>root</I> y los usuarios del grupo
    <I>adm</I>. Compruebe que el usuario es capaz de leer los ficheros log. Un ejemplo:</P>
<PRE class="programlisting">
~&gt; cd /var/log
/var/log&gt; ls -al apache/access.combined.log
-rw-r----- 1 root root 70902 Jul 27 13:23 apache/access.combined.log
/var/log&gt; whoami
egonw
/var/log&gt; groups
egonw adm dialout
</PRE>

    <P>En este ejemplo, el usuario actual <I>egonw</I> no puede leer el fichero log de Apache.
    S&oacute;lo root puede leerlo actualmente. Sin embargo, el usuario pertenece al grupo <I>adm</I>,
    por lo que el problema puede resolverse haciendo que root cambie el grupo para el fichero
    log:</P>
<PRE class="programlisting">
/var/log# whoami
root
/var/log# chgrp adm apache/access.combined.log
/var/log# ls -al apache/access.combined.log
-rw-r--r-- 1 root adm 70902 Jul 27 13:23 apache/access.combined.log
</PRE>

    <P><B>Los ficheros temporales no se mantienen por defecto. &iquest;Quiere guardar &eacute;stos?</B></P>

    <P>Habitualmente deber&iacute;a responder no.</P>

    <P><B>&iquest;Est&aacute; pensando en ejecutar un online responder?</B></P>

    <P>El online responder es una herramienta que permite enviar el fichero log por correo a este
    responder y obtener como resultado un informe. Esto es &uacute;til para administradores de redes
    grandes. Usualmente habr&aacute; que responder que no.</P>

    <P><B>Por defecto, los ficheros temporales se almacenan en ~/tmp. &iquest;Desea cambiar esto?</B></P>

    <P>Por defecto, los ficheros temporales se almacenan en su directorio home. Usted puede
    sobreescribir esta propiedad respondiendo "si" e indicando el directorio en el que desea
    que se almacenen. Tenga en cuenta que tiene que ser un directorio en el que los usuarios que
    ejecuten lire tengan permiso.</P>

    <P><B>&iquest;Quiere enviar un disclaimer con los informes generados?</B></P>

    <P>Si usted env&iacute;a los informes a terceros, es posible que quiera a&ntilde;adir un aviso
    declinando responsabilidades, entonces conteste "si" a esta pregunta. Si los informes
    son &uacute;nicamente de uso interno, puede responder "no" aqui.</P>

    <P><B>Por defecto, los mensajes de estado y error son enviados a stderr.&iquest;Desea cambiar
    esto a syslog?</B></P>

    <P>Contestando "si" a esta pregunta, elige enviar los mensajes de error e informaci&oacute;n al
    logger(1) en lugar de al error est&aacute;ndar (STDERR). En este caso, usted debe tener
    instalado el logger(1) de syslog.</P>

    <P><B>Por defecto, los mensajes informativos y de debug son suprimidos. &iquest;Quiere ejecutar el
    sistema en modo debug?</B> Para un uso normal, deber&iacute;a decir que no.</P>

    <P><B>&iquest;Quiere utilizar algunas propiedades por defecto para todos los servicios?</B></P>

    <P>Para cada servicio usted puede determinar una direcci&oacute;n de correo y un subject de
    forma separada. Por conveniencia tamien puede establecer unas propiedades por defecto
    globales. Responda "si" para establecer esta opci&oacute;n por defecto:</P>

    <P><B>&iquest;Le gustar&iacute;a utilizar una direcci&oacute;n de destinatario por defecto?</B></P>

    <P>Si usted responde "si", esta direcci&oacute;n de correo ser&aacute; utilizada para enviarle los
    informes. Puede ser sobreescrita por servicios espec&iacute;ficos.</P>

    <P><B>&iquest;Le gustar&iacute;a utilizar una l&iacute;nea de asunto por defecto para el correo generado?</B></P>

    <P>Si responde "si", podr&aacute; dar una entrada que servir&aacute; de base para los asuntos de los
    correos electr&oacute;nicos. Por defecto tiene esta apariencia para informes en el log de Apache:
    [LogReport] www / apache report".</P>

    <P><B>&iquest;Qu&eacute; servicios se est&aacute;n ejecutando?</B></P>

    <P>Todas las siguientes preguntas son para preguntarle qu&eacute; servicios quiere que lire le
    reporte. Las preguntas son todas similares, y no las discutiremos una a una. Pero para cada
    servicio las preguntas tienen el siguiente aspecto:</P>

    <P><B>&iquest;Quiere usted recoger los ficheros de log del servicio ***** en este host
    para que sean procesados?</B></P>

    <P>Los programas que lire soporta est&aacute;n agrupados con el nombre de super servicios. La
    primera pregunta para cada superservicio es siempre si usted quiere recoger los ficheros log
    de alg&uacute;n programa sobre el que quiera que lire le reporte. Si responde "no", se saltar&aacute; las
    siguientes preguntas sobre este superservicio. Los superservicios que lire soporta en estos
    momentos se proporcionan en la Introducci&oacute;n de este art&iacute;culo. Existe uno que no ha sido
    mencionado: apachemodgzip. &Eacute;ste maneja los ficheros de log de Apache cuando se ejecuta en
    modo comprimido.</P>

    <P>La configuraci&oacute;n del programa le preguntar&aacute; ahora sobre qu&eacute; servicios son ejecutados
    uno a uno. Para correo electr&oacute;nico, por ejemplo, estos servicios pueden ser exim, postfix,
    qmail y sendmail. Para cada programa, lr_config le pregunta d&oacute;nde puede lire encontrar los
    ficheros de log. &Eacute;stos pueden estar comprimidos, porque lire le preguntar&aacute; si desea especificar
    con qu&eacute; programa deber&iacute;a leer los ficheros log: pueden ser utilizados <I>zcat</I> o
    <I>gunzip -c</I>.</P>

    <P><B>&iquest;Se rotan semanalmente sus ficheros de log de *****?</B></P>

    <P>Si responde "si" las tareas temporizadas para lire ser&aacute;n configuradas para ejecutarse
    s&oacute;lamente una vez a la semana. La otra opci&oacute;n es la diaria.</P>

    <P>Si todas estas preguntas son respondidas, escribe todas las caracter&iacute;sticas en los
    ficheros de configuraci&oacute;n (*/defaults.local). Estos ficheros son utilizados por el cronjob
    de lire. Desgraciadamente, este cronjob no se activa autom&aacute;ticamente. Debe hacerlo usted
    mismo, tecleando:</P>
    <PRE class="programlisting">
     ~&gt; { echo '0 10 * * * /usr/local/logreport/bin/lr_cron daily';
     echo '0 10 * * 0 /usr/local/logreport/bin/lr_cron weekly'; } | crontab -
    </PRE>

    <P>Una vez activado de esta manera, los informes ser&aacute;n enviados semanalmente y/o diariamente.
    Usted puede ajustar a su gusto la configuraci&oacute;n editando los ficheros de configuraci&oacute;n
    mencionados anteriormente.</P>

    <A NAME="lfindex3">&nbsp;</A>
<H2>Lire como herramienta stand-alone</H2>

    Lire tambi&eacute;n puede utilizarse como una herramienta stand-alone y tiene la ventaja de que
    usted puede elegir otros formatos de salida y la posibilidad de incluir im&aacute;genes. La
    herramienta stand-alone <I>lr_log2report</I> es ejecutada por un segundo programa lire
    llamado<I>lr_run</I>:
<PRE class="programlisting">
~&gt; lr_run lr_log2report /tmp/err www apache combined &lt;
   /var/log/apache/access.combined.log &gt; apache.txt
</PRE>

    <P>El programa <I>lr_log2report</I> toma al menos tres argumentos. El primero es un fichero
    al que se redireccionan los errores. En este caso <I>/tmp/err</I>. El segundo argumento es
    el <I>super servicio</I> del fichero log. Actualmente hay tres superservicios: www, dns y
    correo electr&oacute;nico. El tercer argumento requerido es el <I>servicio</I>, que es el tipo de
    fichero log. En este caso es un fichero combinado de Apache, por lo que el servicio es
    Apache. Existe un argumento adicional que es un flag que dice que el fichero log de apache
    utiliza el formato "combinado". Como con la mayor&iacute;a de programas lire, usted puede obtener
    m&aacute;s informaci&oacute;n con <I>man</I>:</P>
<PRE class="programlisting">
~&gt; man lr_log2report
</PRE>

    <P>Para cambiar el formato de salida usted puede utilizar la opci&oacute;n "-i &lt;format&gt;".
    Los formatos v&aacute;lidos actualmente son txt (por defecto), logml (<A href=
    "http://www.cs.rpi.edu/~puninj/LOGML/">LogML website</A>), DocBook
    XML (<A href="http://sourceforge.net/projects/docbook">DocBook Open
    Repository</A>), HTML y PDF. Los dos &uacute;ltimos necesitan tener instalado <A href=
    "http://sourceforge.net/projects/docbook">DocBook stylesheets</A>
    y <A href="http://openjade.sourceforge.net/">Jade</A>. Todo los formatos excepto el texto
    plano tambi&eacute;n requieren un procesador XSLT como el
    <A href="http://xmlsoft.org/XSLT/">xsltproc</A> de Gnome. Por ejemplo, para generar un PDF:</P>
<PRE class="programlisting">
~&gt; lr_run lr_log2report -o pdf /tmp/err www apache combined
   &lt; /var/log/apache/access.combined.log &gt; apache.pdf
</PRE>

    <A NAME="lfindex4">&nbsp;</A>
<H2>Conclusi&oacute;n</H2>


    <P>Este art&iacute;culo introduce brevemente el proyecto lire, y les ha mostrado c&oacute;mo instalar y
    configurar el software. Los siguientes art&iacute;culos de esta seria describir&aacute;n m&aacute;s ampliamente
    el software y c&oacute;mo utilizarlo. Por ahora pueden encontrar m&aacute;s informaci&oacute;n sobre el tema en
    nuestra p&aacute;gina web:<A href="http://www.logreport.org/">http://www.logreport.org/</A>.</P>

    <P>Si desea contactar con nosotros, puede encontrarnos f&aacute;cilmente en IRC. Los desarrolladores
    pueden ser encontrados a menudo en el canal #logreport en  <A href="http://www.openprojects.org">OpenProjects.org IRC
    network</A>. Preguntas, comentarios y peticionese de asistencia ser&aacute;n bienvenidos.</P>
  


<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=213&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Logreport, Egon Willighagen, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://www.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article213.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:egonw@logreport.org"><FONT COLOR="#FFFFFF">Logreport, Egon Willighagen</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:bblanco@crvasca.com"><FONT COLOR="#FFFFFF">Bego&ntilde;a Blanco</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-10-04, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
