<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>lf214, System Administration: Psionic Portsentry 1.1, el defensor de los puertos</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://www.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://www.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Georges-Tarbouriech.jpg" alt=
    "[Photo of the Author]" height="124" width="115">
<BR>por  <A href="mailto:georges.t@linuxfocus.org">Georges     Tarbouriech</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Georges es un usuario viejo de Unix. Piensa que la seguridad
    inform&aacute;tica
    es uno de los desaf&iacute;os m&aacute;s importantes de &eacute;ste siglo.<BR></P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Por qu&eacute; usar portsentry ?</A></LI>
  <LI><A HREF="#lfindex1">C&oacute;mo instalar portsentry ?</A></LI>
  <LI><A HREF="#lfindex2">C&oacute;mo funciona portsentry ?</A></LI>
  <LI><A HREF="#lfindex3">Qu&eacute; pasa entonces ?</A></LI>
  <LI><A HREF="#lfindex4">Se puede vivir sin portsentry ?</A></LI>
  <LI><A HREF="#lfindex5">Referencias</A></LI>
  <LI><A HREF="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=214&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Psionic Portsentry 1.1, el defensor de los puertos</H2>
 <IMG src="../../common/images/article214/illustration214.gif"
    hspace="10" width="127" height="95" alt="[illustration]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>
    Psionic portsentry es parte de las herramientas del proyecto Abacus (al lado
    de portsentry, tienen logcheck y hostsentry).
    Es un IDS (Sistema de detecci&oacute;n de intrusi&oacute;n) dedicado a la
    detecci&oacute;n de barridos de puertos y a la defensa activa.
    Funciona con muchos sabores de Unix incluso Mac OS X. La
    caracter&iacute;stica principal de un IDS es de informar al administrador
    sistema sobre intentos de intrusi&oacute;n. Portsentry va m&aacute;s lejos,
    puesto que es capaz de reaccionar a un ataque. La &uacute;ltima
    versi&oacute;n (1.1) de esta herramienta muy buena se encuentra a
    <A href=
    "http://www.psionic.com">http://www.psionic.com</A>, y a prop&oacute;sito,
    la versi&oacute;n 1.0, ahora hace parte de unas de las mayores distribuciones
    Linux (Debian, RedHat...).</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="lfindex0">&nbsp;</A>
<H2>Por qu&eacute; usar portsentry ?</H2>


    <P>En los pasados diez a&ntilde;os, redes inform&aacute;ticas han crecido
    con una velocidad increible. El objetivo era de permitir la
    comunicaci&oacute;n entre maquinas usando SO diferentes. As&iacute; los
    sistemas de red propietarios fueron poco a poco remplazados por TCP/IP.
    Internet hizo el resto ! Hoy, la mayor&iacute;a de las redes funciona bajo
    TCP/IP y TCP/IP depiende de puertos.
    Para ponerlo en corto, puertos estan atados a programas (clientes o
    servidores). El servidor escucha hasta que un cliente le contacta para
    establecer una comunicaci&oacute;n. Los servicios (los programas arriba
    mencionados) se ven destinados a un puerto espec&iacute;fico. En los
    sistemas Unix, &eacute;sta asignaci&oacute;n se encuentra en el fichero
    /etc/services. Es decir que cada uno puede saber cual puerto esta dedicado a
    cual servicio. Si cada uno sabe, los "crackers" saben a&uacute;n mejor ! Si
    consideramos un puerto como si fuera una puerta, cuando un puerto esta
    abierto (escuchando), se puede comparar con una puerta con el cerrojo
    descorrido. Y c&oacute;mo entran en una casa ? Normalmente por la puerta
    (bueno, si prefieran la ventana, le toca a vosotros !). Es lo que hacen los
    "sombreros negros" para entrar en un ordenador...
    <br>
    La primera cosa que pueden hacer para reducir el riesgo es de cerrar lo
    m&aacute;s puertos possible, es decir parar los servicios. Lo menos lo
    mejor. Pero no pueden cerrar todos los puertos en una m&aacute;quina en una
    red : ya no podr&iacute;a comunicar m&aacute;s, lo que ser&iacute;a una
    l&aacute;stima !
    <br>
    C&oacute;mo limitar los servicios activos o c&oacute;mo cerrar los puertos
    es m&aacute;s all&aacute; del subjeto de este art&iacute;culo.
    Encontrar&aacute;n mucha literatura en el asunto, por ejemplo visitando el
    <A href=
    "http://www.linuxdoc.org">Linux Documentation Project</A> o buscando en
    LinuxFocus (por ejemplo, <a
    href="../September2000/article166.shtml">Bastille-Linux</a> o <a
    href="../January2001/article180.shtml">Herramientas de seguridad</a>). Igual
    por lo que concierne las maneras de proteger una m&aacute;quina o una red.
    Bajo Linux, pueden considerar <A href=
    "http://www.bastille-linux.org">Bastille-Linux</A> como de primera
    necesidad.
    <br>
    Y aqu&iacute; llega portsentry. Portsentry puede vigilar puertos y puede
    bloquearlos si le piden hacerlo. Provee diferentes modos operativos, unos
    siendo espec&iacute;ficos a unos SO. De hecho, unos SO significa Linux.
    <br>
    Portsentry puede aprovechar los filtrajes de paquetes tales como ipfwadm,
    ipchains o iptables seg&uacute;n el kernel Linux que tienen. Tambi&eacute;n es
    verdad para otros sabores de Unix usando diferentes herramientas (volveremos
    en el asunto ese m&aacute;s tarde). Aqu&iacute; estamos : la
    caracter&iacute;stica m&aacute;s importante de portsentry, es probablemente
    "auto-bloqueo".
    <br>
    C&oacute;mo lo hace ? Ya vamos !
    </P>

    <A NAME="lfindex1">&nbsp;</A>
<H2>C&oacute;mo instalar portsentry ?</H2>

    <p>
    Portsentry llega en un arca muy pequ&ntilde;o. Depu&eacute;s de extractar el arca,
    tienen el c&oacute;digo fuente y varios ficheros de configuraci&oacute;n y
    README. Claro, todo eso se recomenda leer. Puesto que hablamos de seguridad,
    no olviden bajar los ficheros PGP (firma y clave).
    <br>
    Instalar portsentry es evidente : make (su sistema) y make install. Pero,
    antes la instalaci&oacute;n, tendr&iacute;an que prepararla. Es decir,
    tendr&iacute;an que leer la documentaci&oacute;n, modificar el fichero
    portsentry.conf para que corresponda a lo que necesitan y controlar el
    Makefile y el fichero portsentry_config.h file.
    <br>
    Para que portsentry sea lo m&aacute;s eficaz possible, necesitan por lo
    menos, TCPWrappers. Por lo menos, porque ser&iacute;a mucho mejor usarlo
    unido con una herramienta de filtraje de paquete. Claro, si usan Linux, ya
    tienen todo lo que se necesita. Qu&eacute; para otros Unices ?
    <br>
    Puesto que hemos probado portsentry en diferentes plataformas, podemos
    hablar de lo que hace falta.
    <br>
    Bajo MAC OS X, es igual que para Linux : ya lo tienen todo. Tienen TCPWrappers
    y ipfw (versi&oacute;n BSD). As&iacute; basta con teclar "make osx".
    <br>
    Bajo Solaris 2.6 (SPARC), no tienen TCPWrappers. Pueden obtenerlo desde <a href=
"ftp://ftp.porcupine.org/pub/security">ftp://ftp.porcupine.org/pub/security</a>.
Tambi&eacute;n pueden probar IPFilter disponible desde <a href=
"ftp://coombs.anu.edu.au/pub/net/ip-filter/ip-fil3.4.9.tar.gz">ftp://coombs.anu.edu.au/pub/net/ip-filter/ip-fil3.4.9.tar.gz</a>
(pero solo si tienen el compilador Solaris !!!).
<br>
Bajo Irix 6.5, tampoco tienen TCPWrappers. Lo encontrar&aacute;n en forma de
"package" a
<a href=
"http://freeware.sgi.com/index-by-alpha.html">http://freeware.sgi.com/index-by-alpha.html</a>
Para filtrar los paquetes tienen ipfilterd, haciendo parte de la
distribuci&oacute;n Irix pero no instalado por defecto.
<br>
Ultimo, a menos de encontrar un vsnprintf() funcional, no podr&aacute;n instalar
portsentry bajo NeXTSTEP... y no encontre ni uno !
<br>
No obstante, de nuevo, tendr&iacute;an que configurar portsentry antes de
instalarlo. Bueno, es como les da la gana, pero ser&iacute;a mejor entender su
filosof&iacute;a antes de todo... solo es cuesti&oacute;n de opini&oacute;n !
</p>
<A NAME="lfindex2">&nbsp;</A>
<H2>C&oacute;mo funciona portsentry ?</H2>

<p>
Muy bien, gracias !
<br>
En serio, portsentry depiende de los ficheros de configuraci&oacute;n. El
m&aacute;s importante es el fichero portsentry.conf. Aqu&iacute; es donde van a
decir a portsentry como reaccionar en frente de la adversidad.
<br>
Antes de trabajar en este fichero, tienen que conocer los diferentes modos
operativos y lo que hacen.
<br>
Portsentry puede usar seis modos diferentes, seg&uacute;n la opci&oacute;n
elegida al arrancar.
<br>
- La primera es "-tcp" y es el modo b&aacute;sico. Con esta opci&oacute;n,
portsentry va a atar los puertos TCP encontrados en el fichero de config en la
parte "port configuration". Puede atar hasta el limite de 64 puertos.
<br>
- La segunda es "-udp" y hace lo mismo que la anterior para los puertos UDP.
<br>
- La tercera es "-stcp", la "s" significando "stealth" (furtivo). Esta
opci&oacute;n y las siguientes son disponibles solamente bajo Linux.
Con la opci&oacute;n "-stcp", portsentry usa un socket para vigilar los paquetes
llegando, es decir los puertos no se atan a nada.
<br>
- La cuarta es "-sudp" y hace lo mismo que la anterior para los puertos UDP.
<br>
- La quinta y la sexta son "-atcp" y "-audp". Son las opciones m&aacute;s
eficaces ("a" significa "advanced" [avanzada]). Usando estas opciones,
portsentry hace una lista de los puertos TCP y UDP escuchando, si seleccionan
ambos, y bloquea el host tratando de conectar con estos puertos, a menos que el
dicho host sea presente en el fichero portsentry.ignore.
<br>
Eso es mucho m&aacute;s bien explicado en los ficheros README llegando con
portsentry. Entonces, no vamos a reinventar la rueda, tratando de escribir de
nuevo la documentaci&oacute;n. Estos ficheros README se necesitan leer (como de
costumbre, hay que ser un poco fascista !).
</p>
<strong>C&oacute;mo reacciona portsentry ?</strong>
<p>
Evidentemente, portsentry puede crear logs. Si son de la categor&iacute;a de
sysadmin quienes no lean los logs (que verg&uuml;enza !), pueden usar logcheck al
lado de portsentry. As&iacute;, portsentry manda un correo para informarles de
una tentativa de intrusi&oacute;n.
<br>
Puede escribir el "target host" en el fichero /etc/hosts.deny, para beneficiar
de TCPWrappers.
<br>
El host local puede cambiar la ruta del tr&aacute;fico de la red hacia un host muerte.
<br>
Ultimo, el host local puede "echar" los paquetes via la herramienta local de
filtraje de paquete.
<br>
Ahora que conocen un poco m&aacute;s la filosof&iacute;a de portsentry, pueden
empezar a escribir el fichero portsentry.conf.
<br>
- La primera secci&oacute;n del fichero de config concierne los puertos.
Aqu&iacute; se pueden elegir los puertos para atar. Recuerden, si usan los modos
avanzados para Linux, esto ne se tomara en cuenta. Cuidado con los puertos que
quieren atar (no aten el puerto 6000 por ejemplo, si usan X).
<br>
- La secci&oacute;n siguiente concierne las opciones de detecci&oacute;n
avanzada. El defecto es de vigilar cada puerto bajo 1024, sea por TCP, sea por
UDP. Tambien pueden excluir los puertos que quieren ignorar. Eso es muy
importante para evitar alarmas falsas y logging enormes, particularmente si
tienen maquinas Windos en su red. Por ejemplo, cuidado con el puerto 111 si usan
portmap y si los hosts no se encuentran en el fichero portsentry.ignore. Claro,
ser&iacute;a loco, puesto que portmap significa servidores RPC tales como NFS, pero ahora saben. Es decir,
NFS no esta muy seguro en maquinas Unix entonces, ni hablar de maquinas Windos.
<br>
Aqu&iacute; llega la parte habitual fuera del asunto : cuando escribo "Windos",
no es un error de m&aacute;quina, solo es para insistir en el hecho que Windows
es un entorno por encima del DOS (D por desgraciado ?)... y hace un car&aacute;cter
menos que teclar (que holgaz&aacute;n !). Perd&oacute;n por la digresi&oacute;n.
<br>
- La secci&oacute;n de los ficheros de configuraci&oacute;n concierne los
ficheros usados por portsentry para objetivo hist&oacute;rico o para definir los
hosts que quieren ignorar. Si hacen una instalaci&oacute;n por defecto, no
cambien eso.
<br>
- La secci&oacute;n de config diversa permite activar o no los DNS lookups.
<br>
- La secci&oacute;n de opciones de repuesta es el coraz&oacute;n de la
configuraci&oacute;n. Aqu&iacute; van a definir c&oacute;mo portsentry
reacciona.
<br>
Primero, tienen las opciones para ignorar. Pueden elegir de bloquear los
barridos, no bloquearlos o arrancar un comando externo.
<br>
Despu&eacute;s, en la secci&oacute;n para "echar" las rutas, dicen a portsentry
c&oacute;mo "echar" la ruta o c&oacute;mo beneficiar de la herramienta de
filtraje de paquete instalada en la m&aacute;quina. Hay muchos ejemplos para
muchas plaformas. Elijan la que corresponde a lo que necesitan (solo una !).
<br>
- La secci&oacute;n TCPWrappers indica si quieren escribir en el fichero
/etc/hosts.deny.
<br>
- La secci&oacute;n comando externo permite definir un comando para arrancar
cuando un host se conecta.
<br>
- La secci&oacute;n del valor de iniciaci&oacute;n de barrido permite definir el
tiempo de reacci&oacute;n. El valor por defecto de "0" es el m&aacute;s
inmediato puesto que manda una alarma a la primera tentativa de conexi&oacute;n.
<br>
- La &uacute;ltima secci&oacute;n es para visualizar una bandera en caso de
intento de intrusi&oacute;n. No funciona con los modos "stealth".
<br>
Cuando han acabado con esta parte, casi han terminado. De nuevo, para evitar
alarmas falsas y enorme "logging", averiguen el fichero portsentry.ignore.
Pueden a&ntilde;adir aqu&iacute; la direcci&oacute;n de la red local con los
bits del netmask, o la direcci&oacute;n IP de algunas maquinas.
<br>
Ya esta ! Ahora pueden teclar "make sistema" y "make install". El script de
instalaci&oacute;n lo hace todo puesto que da derechos restrictivos al
directorio y a los ficheros. Ahora, basta con arrancar portsentry con las
opciones que han elegido. Lean los logs para ver lo que ha pasado. Si todo ha
salido bien, portsentry ha arrancado y ha mejorado la seguridad del host.
</p>
<A NAME="lfindex3">&nbsp;</A>
<H2>Qu&eacute; pasa entonces ?</H2>

<p>
Usando herramientas tales como nmap, pueden simular un barrido de los
puertos del host ahora m&aacute;s seguro. (M&aacute;s sobre nmap
<a
href="../July2001/article170.shtml">all&iacute;</a>). Aqu&iacute; esta lo que
pueden obtener :
<p><img src="../../common/images/article180/nmapg.jpg" alt="portsentry funciona
 en el host barrido"></p>
Es decir que la m&aacute;quina esa no da mucha informaci&oacute;n al pirata que
han vuelto !
<br>
Normalmente, esta tentativa hubiera dado por lo menos, la versi&oacute;n del SO
y los puertos abiertos en el host barrido. Este tipo de informaci&oacute;n es
muy &uacute;til para un pirata puesto que sabe mejor a donde y como atacar.
Con portsentry funcionando con un valor de 0 para la iniciaci&oacute;n y en modo
avanzado, el bloqueo es inmediato. Con un valor de 1 en modo normal, el
ataquante hubiera obtenido una lista de los puertos abiertos y probablemente el
tipo del SO de la m&aacute;quina. Pero, despu&eacute;s, tratando de conectar a un
puerto conocido por ser abierto, ser&iacute;a un fracaso. Portsentry ha
bloqueado el puerto despu&eacute;s de la primera tentativa. Sencillo pero eficaz !
<br>
Es decir, si usan solamente TCPWrappers, la direcci&oacute;n IP ha sido escrita
en el fichero /etc/hosts.deny. Si han decidido de echar la ruta redirigiendola
hacia un host muerte, portsentry a&uacute;n es eficaz pero no protege de los
ataques UDP.
<br>
Si usan una herramienta de filtraje de paquete, el host atacado echa los
paquetes llegando del ataquante por la herramienta esa.
<br>
Claro, es la mejor manera de beneficiar de toda la potencia de portsentry.
<br>
Otra vez, el modo avanzado bajo Linux es ideal. Esto no significa que portsentry
no es tan bueno bajo otros SO, s&oacute;lo tiene menos resultados... bueno, no
realmente !
<br>
Para entender mejor, lean los logs siguiendo diferentes tentativas de
intrusi&oacute;n bajo diferentes SO y usando portsentry en modos diferentes. Eso
lo dice todo !
<br>
Seg&uacute;n los modos usados, los logs pueden proveer unas alarmas falsas. Para
mejorar la cualidad de la informaci&oacute;n, tendran que trabajar en el fichero
de config. Despu&eacute;s de unas pruebas, obtendran normalmente lo que quieren
exactamente.
</p>
<A NAME="lfindex4">&nbsp;</A>
<H2>Se puede vivir sin portsentry ?</H2>

<p>
Absolutamente NO ! Hay muchos IDS, libres o no. Muchos de ellos son muy buenos.
Podemos mencionar el muy conocido snort disponible desde
<a href=
"http://www.snort.org">http://www.snort.org</a>.
<br>
Normalmente, estos IDS son pasivos. Es decir, se usan para informar de una
intrusi&oacute;n. Fueron escritos por eso. Por ejemplo, snort es muy
sofisticado, puesto que depiende de scripts de reglas, as&iacute; permitiendo de
escribir sus propios scripts. El sitio de snort provee un base de datos de
reglas. Y, a prop&oacute;sito, si no tienen miedo a los logs enormes, pueden
usar ambos portsentry y snort. No es tan est&uacute;pido !
<br>
Sin embargo, la fuerza de portsentry viene de que es un IDS activo. Su manera de
reaccionar es increible. Combinado con una herramienta de filtraje de paquete,
portsentry vuelve la herramienta obligatoria. Podr&iacute;amos pedir la pregunta
: es portsentry el complemente de filtraje de paquete o es filtraje de paquete
el complemente de portsentry ?
<br>
Claro, hay mucho m&aacute;s que decir sobre portsentry. Por ejemblo, hay que
tener mucho cuidado con la detecci&oacute;n de barrido UDP en modo avanzado.
Lean la documentaci&oacute;n (de nuevo !) para entender los problemas relativos
a UDP. Solaris tambien puede causar problemas puesto que usa puertos muy altos
alrededor de 32700 (sea por TCP o UDP). Pero, ese art&iacute;culo s&oacute;lo toca el asunto por encima y en
ning&uacute;n caso es una revista completa de este gran software.
<br>
La seguridad inform&aacute;tica es una responsabilidad y no solamente para los
administradores de sistemas. El increible desarrollo de Internet hace las cosas
a&uacute;n peores. Es decir, el peligro de intrusi&oacute;n es cada d&iacute;a
m&aacute;s grande. La comunidad del software libre provee muchas herramientas
muy buenas : portsentry es una de ellas. No las dejen por detr&aacute;s ! Pero,
recuerden, estas herramientas s&oacute;lo reducen el riesgo y en ning&uacute;n
caso hacen un sistema 100% seguro. Esto es otra raz&oacute;n para buscar en el
&aacute;rea de las herramientas de seguridad.
<br>
Ultimo, la gente de Psionic trabaja en un producto comercial y dice "no seran
decepcionados". Entonces, esperemos y vemos !
<br>
Antes de su llegada, bajen portsentry 1.1, tampoco seran decepcionados. La gente
de Psionic hace un gran trabajo. A prop&oacute;sito, hostsentry tambi&eacute;n vale la
pena de ser probado... y usado.
<br>
Que &eacute;poca m&aacute;s estupenda vivimos !
</p>
<A NAME="lfindex5">&nbsp;</A>
<H2>Referencias</H2>

<p>
Los sitios web siguientes son referencias absolutas cuando se trata de
seguridad. A&uacute;n m&aacute;s, pueden mandarles hacia otros sitios, estos
&uacute;ltimos mandandoles hacia todav&iacute;a m&aacute;s sitios... Saben, las
mu&ntilde;ecas Rusas ? El &uacute;nico problema si quieren leerlo todo es que no
viviran bastante tiempo !!!
<br>
<a href=
"http://www.linuxsecurity.com">http://www.linuxsecurity.com</a>
<br>
<a href="http://www.sans.org">http://www.sans.org</a>
<br>
<a href="http://www.infosyssec.org">http://www.infosyssec.org</a>
<br>
<a href=
"http://www.securityfocus.com">http://www.securityfocus.com</a> is
<br>
<a href=
"http://www.cs.purdue.edu/coast/hotlist/">http://www.cs.purdue.edu/coast/hotlist/</a>
</p>
<!-- vim: set sw=2 ts=2 et: -->
  



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=214&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges     Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://www.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article214.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges     Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges    Tarbouriech</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-09-10, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
