<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>lf215, System Administration: E-mail sobre UUCP: La soluci&oacute;n profesional para usuarios de modems</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://www.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://www.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Guido-S.gif" alt=
    "[Photo of the Author]" height="164" width="173">
<BR>por  <A href="mailto:guido@linuxfocus.org">Guido     Socher</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Guido utiliza UUCP desde hace varios a&ntilde;os y cree que &eacute;sta es la mejor opci&oacute;n
    para conectar el sistema de correo de su ordenador a Internet.
    </P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Su propio sistema de correo</A></LI>
  <LI><A HREF="#lfindex2">&iquest;C&oacute;mo funciona?</A></LI>
  <LI><A HREF="#lfindex3">Instalaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex4">Probando la cuenta paso a paso</A></LI>
  <LI><A HREF="#lfindex5">Configurando  su sistema UUCP </A></LI>
  <LI><A HREF="#lfindex6">Configurando sendmail para enviar correos v&iacute;a UUCP</A></LI>
  <LI><A HREF="#lfindex7">Todo autom&aacute;tico</A></LI>
  <LI><A HREF="#lfindex8">Cosas a hacer</A></LI>
  <LI><A HREF="#lfindex9">Encontrando un ISP</A></LI>
  <LI><A HREF="#lfindex10">Referencias</A></LI>
  <LI><A HREF="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=215&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>E-mail sobre UUCP: La soluci&oacute;n profesional para usuarios de modems</H2>
 <img src="../../common/images/article215/illustration215.jpg" width="170" height="133" alt="[uucp]" hspace="30">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>UUCP es uno de los protocolos m&aacute;s antiguos de Internet. Ahora casi siempre
    se reemplaza por protocolos m&aacute;s modernos, pero sigue siendo una de las mejores
    soluciones para enviar y recibir correos electr&oacute;nicos  por la l&iacute;nea
    telef&oacute;nica. Desgraciadamente, la mayor&iacute;a de los que se conectan a
    Internet desde su casa mediante un enlace telef&oacute;nico no es consciente del gran
    potencial de UUCP   y no demandan este servicio. Como consecuencia son
    muy pocos los ISP (<i>Internet Service Providers</i>, Proveedores de Servicios de
Internet) que proveen este servicio hoy en d&iacute;a.     </P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>


    <P>UUCP es uno de los protocolos  m&aacute;s viejos  y
    originalmente se utilizaba para copiar todo tipo de archivos entre sistemas Unix. De aqu&iacute; su
nombre:     "Unix to Unix Copy". Estas primeras m&aacute;quinas no estaban conectadas permanentemente
   mediante una  red. En vez de esto se utilizaban conexiones por m&oacute;dem para intercambiar datos
    a intervalos de tiempo regulares.
<br>
<br>
    Para copiar el archivo misnotas.txt a un sistema remoto llamado "marte" se podr&iacute;a
    usar el comando:
<pre>
uucp misnotas.txt marte!~/misnotas.txt
</pre>
    Esto de momento s&oacute;lo copia los datos a un "directorio de spool"
    <cite>(N.T. los directorios de spool son directorios
    especiales donde se almacenan los archivos de forma protegida, de forma que no se
    puedan usar directamente por los usuarios. Se suelen localizar en /var/spool)</cite>, y
    m&aacute;s tarde cuando se realiza la conexi&oacute;n los ficheros se copian f&iacute;sicamente.
<br>
<br>
    Actualmente esta forma de utilizar UUCP pr&aacute;cticamente no se utiliza. Hay ahora
    disponibles protocolos m&aacute;s modernos como TCP/IP o scp para copiar ficheros entre
     sistemas de computadores.
<br><br>
    UUCP puede hacer mucho m&aacute;s que esto. Permite ejecutar un n&uacute;mero limitado de comandos
    de forma remota. Para lanzar el comando "rnews" en el sistema remoto "marte"
    teclear&iacute;amos
<pre>
cat algundato.txt | uux - marte!rnews
</pre>
    De nuevo, el comando rnews no se ejecutar&iacute;a inmediatamente en el sitio remoto, sino s&oacute;lo
    despu&eacute;s de que se estableciera la conexi&oacute;n con "marte". El comando se "aparcar&iacute;a"
    en el directorio de spool local.
<br><br>

&iquest;Qu&eacute; tiene todo esto que ver con el correo electr&oacute;nico?
<br>

    Normalmente el correo electr&oacute;nico es una aplicaci&oacute;n donde no hay ning&uacute;n problema
    si el env&iacute;o de los datos se retrasa un poco. Habitualmente usted abre su programa
    de correo, escribe p.ej. algunos mensajes de respuesta a sus amigos y los "env&iacute;a" desconectado. De todas formas no quiere tener
    todas las ventanas de respuesta de su programa de correo abiertas al mismo
    tiempo hasta que se conecte a su ISP. Quiere "enviar" el correo y cerrar estas
    ventanas. Si se realmente se env&iacute;a de forma inmediata no es importante aqu&iacute;;
    no importa que se env&iacute;e m&aacute;s tarde.

<br>
<br>
    Precisamente este el tipo de aplicaci&oacute;n que se puede implementar
    de forma fiable y sencilla con UUCP.

    <A NAME="lfindex1">&nbsp;</A>
<H2>Su propio sistema de correo</H2>


     UUCP es flexible. Puede configurarlo de forma que tenga su propio servidor
     de correo para toda una red de ordenadores. Su m&aacute;quina Linux puede ser
     el servidor central de correo para todo tipo de ordenadores y sistemas operativos
     en su LAN (<i>Local Area Network</i>, red de &aacute;rea local).

<br>
<center>
<img src="../../common/images/article215/uucp.gif" alt="[A private
mail system connected via dialup]" width=256 height=256>
</center>
<br>
<br>
    Configurar as&iacute; un servidor de correo puede ser  conveniente
    para una familia y tener un costo muy eficiente
    para una peque&ntilde;a
    empresa. Puede proveer cuentas de correo a cualquier n&uacute;mero de usuarios necesitando
    tan s&oacute;lo una conexi&oacute;n v&iacute;a m&oacute;dem a su ISP. Una empresa posiblemente establecer&aacute;
    esa conexi&oacute;n peri&oacute;dicamente (p.ej. cada hora) y los usuarios
    se conectar&iacute;an p.ej. en el caso de necesitarlo por otras razones.
<br>
<br>
    Concluyendo: el correo el&eacute;ctronico con UUCP no es algo viejo y polvoriento.
    Es una aplicaci&oacute;n &uacute;til, rentable y elegante de UUCP.

    <A NAME="lfindex2">&nbsp;</A>
<H2>&iquest;C&oacute;mo funciona?</H2>


    Usando UUCP obtendr&aacute; de su ISP su propio Dominio MX (<i>MX=Mail Exchanger</i>,
    es la parte del nombre de dominio en su direcci&oacute;n de correo). Por
    ejemplo, si la p&aacute;gina principal de su ISP es www.mi-isp.com entonces podr&iacute;a
    dar a Joe Miller el dominio miller.mi-isp.com. Todos los correos para este dominio se
    enviar&aacute;n al servidor de correo de Joe Miller con UUCP. Joe puede entonces configurar
    cierto n&uacute;mero de usuarios: joe@miller.mi-isp.com, diana@miller.mi-isp.com,
    frank@miller.mi-isp.com ...seg&uacute;n quiera Joe. Como con Linux tiene
    un servidor de correo libre que adem&aacute;s puede trabajar con diferentes protocolos
    como pop, imap, nfs o directamente un buz&oacute;n de correo sobre el sistema de ficheros ...
etc no existen     restricciones sobre el tipo de sistemas operativos o clientes de correo que los
usuarios     utilicen para acceder a su correo.
 <br>
<br>
    UUCP como tal es un protocolo aut&oacute;nomo y usted puede correrlo
    directamente en el nivel hardware (por ejemplo, la l&iacute;nea de m&oacute;dem sin ning&uacute;n
    protocolo ppp) no obstante puede correrlo tambi&eacute;n sobre TCP/IP y esto le
    ofrece nuevas posibilidades:
<br><br>
    Puede tener un ISP dedicado en cualquier parte del mundo con una buena
    red principal (por ejemplo, en &Aacute;msterdam) y usted
    se conecta a Internet mediante cualquier ISP usando conexiones locales baratas.
    Como UUCP corre por encima de TCP/IP la localizaci&oacute;n f&iacute;sica de su ISP E-mail/UUCP
    no tiene mayor importancia. Es accesible desde cualquier lugar en el mundo a trav&eacute;s
    de Internet.

    <A NAME="lfindex3">&nbsp;</A>
<H2>Instalaci&oacute;n</H2>


    La mayor&iacute;a de las distribuciones de Linux tienen un paquete llamado uucp,
    que suele contener Tailer UUCP. Si no est&aacute; disponible en ninguno de sus
    CDs lo puede obtener en:<br>
<a href="http://www.airs.com/ian/">www.airs.com/ian</a>
<br>
<br>
    Aparte del paquete UUCP necesita tambi&eacute;n un sistema de correo que
    pueda manejar UUCP. En este art&iacute;culo describir&eacute; Sendmail pero casi todos
    los otros sistemas tambi&eacute;n soportan UUCP. Un sistema de correo que pueda
    manejar UUCP tendr&aacute; un comando llamado rmail en el paquete rpm o deb.
<br><br>
    El correo se env&iacute;a a su sistema mediante un comando de ejecuci&oacute;n remota,
    similar al ejemplo uux/rnews anterior. rmail es el comando que recibe el correo
    por la "tuber&iacute;a" (<i>pipe</i>) UUCP y lo mete en su sistema de correo.

<br>
<br>
Su ISP necesitar&aacute; la siguiente informaci&oacute;n para configurar la cuenta:
<ul>
<li>El nombre del dominio MX que usted querr&iacute;a tener, como miller.mi-isp.com
<li>Un nombre de acceso para la conexi&oacute;n UUCP
<li>Una contrase&ntilde;a para la conexi&oacute;n UUCP
<li>El nombre de su sistema UUCP. Una cadena corta como p.ej. el nombre de su m&aacute;quina.
<li>Un contacto para cuestiones administrativas y correo general desde su ISP, generalmente
postmaster
<li>&iquest;UUCP sobre IP? Conteste s&iacute; aqu&iacute; y no elija un ISP que no lo provea. Lo que
quiere es correo electr&oacute;nico sobre UUCP y UUCP sobre IP.
</ul>

<br>
Los datos que usted necesita de su ISP:
<ul>
<li>El nombre de dominio del servidor donde se puede conectar v&iacute;a UUCP. Ser&aacute; algo
del tipo uucp.mi-isp.com
<li>El nombre de su sistema UUCP.
</ul>

    <A NAME="lfindex4">&nbsp;</A>
<H2>Probando la cuenta paso a paso</H2>


    UUCP sobre TCP/IP usa el puerto TCP 540, lo que le permite probar de forma
    sencilla su cuenta antes de ir a la configuraci&oacute;n de su sistema UUCP. De esta
    forma puede estar seguro de que su ISP no comete errores y de que usted
    tiene bien los identificadores y las contrase&ntilde;as. Ejecute el comando:
<pre>
telnet uucp.mi-isp.com 540
</pre>
Obtendr&aacute; algo as&iacute;:
<pre>
Trying 1.2.3.42...
Connected to uucp.mi-isp.com
Escape character is '^]'.
login:
</pre>
Introduzca nombre de acceso y contrase&ntilde;a:
<pre>
Trying 1.2.3.42...
Connected to uucp.mi-isp.com
Escape character is '^]'.
login: linux
Password: tux.1234
Shere=mfic
</pre>

Despu&eacute;s de un acceso satisfactorio el otro lado responde con "Shere" que
significa "System Here" <cite>(Aqu&iacute; el Sistema...)</cite> seguido del nombre del sistema remoto
(verif&iacute;quelo con los datos de su ISP).<br>

Para cerrar la conexi&oacute;n use crtl-] y entonces teclee "q" en el prompt del telnet: <pre>
^]
telnet> q
Connection closed.
</pre>
Ahora sabe que su cuenta est&aacute; configurada correctamente.

    <A NAME="lfindex5">&nbsp;</A>
<H2>Configurando  su sistema UUCP </H2>

Para recibir (y enviar) correo v&iacute;a UUCP necesita configurar apropiadamente
los archivos de configuraci&oacute;n de UUCP. Estos archivos habitualmente est&aacute;n  en /etc/uucp. Necesitar&aacute;
crear/editar los siguientes ficheros:
<ul>
<li>call -- este fichero contiene los nombres de acceso y las contrase&ntilde;as
<li>sys -- este fichero define c&oacute;mo acceder a un sistema dado. Config&uacute;relo para usar TCP/IP
<li>port -- esencialmente define el uso del puerto 540 para las conexiones tcp.
<li>config -- fichero global de configuraci&oacute;n
</ul>
Todos los ficheros tienen que tener como propietario uucp y como grupo uucp. El fichero call no debe
ser de lectura para todo el mundo (chmod 640 call). Los ficheros de log se suelen encontrar en
/var/log/uucp/ y /var/spool/uucp/ debe contener un directorio con el nombre del sistema remoto.
Aseg&uacute;rese de que ambos son de escritura para el usuario uucp.
 <br> <br>
<b>call</b>
<pre>
# fichero call
# El formato es simplemente nombre-del-sistema-remoto nombre-de-acceso contrase&ntilde;a
mfic linux tux.1234
</pre>

<br>
<b>port</b>
<pre>
# fichero port
# No necesita modificar nada aqu&iacute;
type tcp
port tcp
service 540
</pre>

<br>
<b>sys</b>
<pre>
# fichero sys
# provee informaci&oacute;n sobre el sistema remoto
# nombre del sistema de su ISP:
system mfic
# el servidor de su ISP:
address uucp.mi-isp.com
# no cambie las siguientes 3 l&iacute;neas, vea la documentaci&oacute;n de Tailer UUCP
# para m&aacute;s detalles
time Any 2
port tcp
chat-timeout 60
# commandos autorizados:
commands rmail
# tomar el nombre de acceso y la contrase&ntilde;a del archivo call:
call-login *
call-password *
# no cambie la siguiente l&iacute;nea:
chat ogin: \L assword: \P
#
</pre>

<br>
<b>config</b>
<pre>
# El fichero config define las rutas
# de otros ficheros y directorios as&iacute; como el
# nombre de su sistema.
# El nombre de su sistema:
nodename oblelix
# n&uacute;mero m&aacute;ximo de peticiones de otros sistemas a ejecutar en paralelo:
max-uuxqts 2
# El directorio de spool de UUCP
spool /var/spool/uucp
# Normalmente los dem&aacute;s campos se dejan como vienen
# por defecto:
# pubdir /var/spool/uucppublic
# logfile /var/log/uucp/Log
# statfile /var/log/uucp/Stats
# debugfile /var/log/uucp/Debug
# callfile /etc/uucp/call
# ....
</pre>

<p>
Tras guardar los ficheros de configuraci&oacute;n ejecute el comando "uuchk". Seguramente est&eacute; en
sbin: /usr/sbin/uuchk<br><br>

La salida es un resumen de su configuraci&oacute;n incluyendo algunos valores por defecto que usted no ha
configurado. El nombre de host de su servidor ISP, uucp.mi-isp.com en nuestro ejemplo, aparece como
"phone number" <cite>(n&uacute;mero telef&oacute;nico)</cite>:
<pre>
Phone number uucp.mi-isp.com
</pre>

Esto es algo extra&ntilde;o, pero es correcto para UUCP sobre TCP/IP.
Compruebe sobre todo que todos los directorios, ficheros de log, ficheros de depuraci&oacute;n etc apuntan
al lugar correcto y pertenecen al usuario uuucp. </p>

<p>Ahora usted deber&iacute;a ser capaz de recibir correo v&iacute;a UUCP pero su agente de correo local
(MTA=mail transport agent <cite>agente de transporte de correo</cite>) todav&iacute;a necesita conocer que
est&aacute; autorizado para manejar correo para el dominio registrado con su ISP. En nuestro caso este
dominio es miller.mi-isp.com. La configuraci&oacute;n de este dominio depende de nuestro MTA. En sendmail
necesita escribir miller.mi-isp.com en una &uacute;nica l&iacute;nea en el fichero /etc/sendmail.cw:

<pre>
# sendmail.cw define los dominios para los que manejamos correo
miller.mi-isp.com
</pre>

Ahora estamos preparados para probar a recibir correos v&iacute;a UUCP. El env&iacute;o de correos no
funcionar&aacute; a&uacute;n, porque sendmail no est&aacute; todav&iacute;a completamente configurado <br>
Ejecute
<pre>
/usr/sbin/uucico -x 11 -S mfic
</pre>
mfic es el nombre del sistema UUCP de mi-isp.com.
<br>
<br>
Abra una segunda ventana de terminal y observe el resultado con
"tail -f /var/log/uucp/Debug". <br>
El "-x 11" especifica el nivel de depuraci&oacute;n m&aacute;s alto y s&oacute;lo debe usarse durante las pruebas. Ver&aacute;
todos los detalles del protocolo UUCP. Compruebe que no existe ning&uacute;n error. Si obtiene al final
algo como <br> <i>uucico mfic - (2001-06-22 20:20:57.73 1020) Call complete (31 seconds 42835
bytes 1381 bps)</i>
<br>
entonces todo funciona bien. &iexcl;Enhorabuena!
</p>

<p>
Ejecute el comando "uulog". Imprimir&aacute; un peque&ntilde;o resumen de los correos recibidos v&iacute;a UUCP/rmail.
</p>

<A NAME="lfindex6">&nbsp;</A>
<H2>Configurando sendmail para enviar correos v&iacute;a UUCP</H2>



Sendmail utiliza un sistema de configuraci&oacute;n basado en el pre-procesador m4. Otros sistemas de
correo como postfix tienen ficheros de configuraci&oacute;n m&aacute;s legibles y se pueden editar directamente.
Yo uso sendmail y por lo tanto voy a describir aqu&iacute; mis experiencias con sendmail. Usted est&aacute;
invitado a a&ntilde;adir informaci&oacute;n sobre distintos MTAs en la p&aacute;gina de talback que se encuentra al final
del art&iacute;culo. He visto que postfix s&oacute;lo requiere que se edite transport/transport.db y hace falta
una definici&oacute;n para uucp en master.cf, aparentemente esto es todo, pero yo no tengo mucha
experiencia con postfix.
<br> <br> El sistema de configuraci&oacute;n m4 podr&iacute;a no estar incluido en el mismo paquete que sendmail.
Verifique los CDs de su distribuci&oacute;n, porque podr&iacute;a necesitar instalar
un paquete llamado algo as&iacute; como "sendmail-cf".
<br> <br> Cree un nuevo fichero sendmail-uucp.mc en el directorio cf de sendmail (posiblemente
/usr/lib/sendmail-cf/cf):

<pre>

#divert(-1)
# `Esta es la configuraci&oacute;n para enviar correo v&iacute;a uucp usando /usr/bin/uux
#
# para generar un  sendmail.cf fuera de este fichero .mc use las fuentes de sendmail
# y ejecute m4 estefichero.mc > sendmail.cf.'
divert(0)
include(`../m4/cf.m4')
VERSIONID(`UUCP, Jan 28 2001, without DNS')
undefine(`BITNET_RELAY')
undefine(`DECNET_RELAY')
undefine(`UUCP_RELAY')
OSTYPE(`linux')
MASQUERADE_AS(miller.my-friendly-isp.com)
MASQUERADE_DOMAIN(localdomain)
MASQUERADE_DOMAIN(localhost)
# ` a&ntilde;ada aqu&iacute; cualesquiera nombres de host locales:'
MASQUERADE_DOMAIN(philosophus)
# ` necesario si usa un dominio interno que no existe: '
FEATURE(`masquerade_envelope')
FEATURE(always_add_domain)
# ` dominios a los que se permite leer del fichero cw: '
FEATURE(use_cw_file)
FEATURE(local_procmail)
# `importante para uucp:'
FEATURE(accept_unresolvable_domains)dnl
# `la entrada /etc/passwd: mail:*:8:12:mail:/var/spool/mail:'
define(`confDEF_USER_ID',``8:12'')
define(`confSAFE_QUEUE',`True')
define(`confDELIVERY_MODE',`background')dnl
# 'cambie mfic por el nombre de sistema UUCP de su ISP:'
define(`SMART_HOST',uucp-uudom:mfic)dnl
define(`confSERVICE_SWITCH_FILE',/etc/service.switch)dnl
define(`confHOSTS_FILE',/etc/hosts)dnl
define(`UUCP_MAILER_MAX',1024000)dnl
MAILER(procmail)dnl
MAILER(local)dnl
MAILER(smtp)dnl
MAILER(uucp)dnl
</pre>

Adapte el fichero a su situaci&oacute;n y comp&iacute;lelo con:
<pre>
m4 sendmail-uucp.mc > sendmail.cf
</pre>
Copie el archivo sendmail.cf a /etc y reinicie sendmail con
<pre>
/etc/rc.d/init.d/sendmail restart
</pre>
La ruta anterior del script init es para redhat/mandrake. Cambia
para Suse, Debian etc...
<br>
<br>
En el archivo /etc/service.switch a&ntilde;ada:
<pre>
hosts   files
aliases files
</pre>

Ahora env&iacute;e un correo a alguien. Puede hacerlo desde su aplicaci&oacute;n de correo favorita o directamente
desde l&iacute;nea de comandos con:
<pre>
echo "hola john, haciendo una prueba..." | Mail john@somewhere.org
</pre>

Este correo no se enviar&aacute; directamente. En vez de ello se quedar&aacute; encolado en el sistema UUCP. Puede
verlo haciendo:
<pre>
uustat -a
</pre>

uustat imprimir&aacute;:
<pre>
mfic.CRJjd4uAAAPs mfic joe 07-24 20:19 Executing rmail john@somewhere.org
(sending 50 bytes)
</pre>

Despu&eacute;s ejecute
<pre>
/usr/sbin/uucico -x 11 -S mfic
</pre>
mfic es de nuevo el nombre del sistema UUCP de mi-isp.com

Ahora puede mirar el fichero de depuraci&oacute;n y observar c&oacute;mo se env&iacute;a el correo.


<A NAME="lfindex7">&nbsp;</A>
<H2>Todo autom&aacute;tico</H2>


Cree el siguiente script /usr/bin/uumail:
<pre>
#!/bin/sh
hostn=uucp.mi-isp.com
# primero comprueba que el servidor de mi ISP est&aacute; accesible.
# Esto necesita un versi&oacute;n reciente de ping donde pueda
# especificar el tiempo de espera:
if ping -w 3 -qn -c 1 $hostn > /dev/null ; then
  /usr/sbin/uucico -S mfic
  #sleep 1
  #uulog -s mfic -5
else
  echo "ERROR: $hostn est&aacute; ca&iacute;do"
  exit 1
fi
</pre>

Haga el script ejecutable con "chmod 755 /usr/bin/uumail"
y ejec&uacute;telo manualmente para ver si funciona.
<br>
<br>
Para intercambiar correos de forma autom&aacute;tica cada vez que se conecte s&oacute;lo tiene que a&ntilde;adir
la l&iacute;nea /usr/bin/uumail a /etc/ppp/ip-up.
<br>
<br>
Ok, eso es todo. Su sistema de correo est&aacute; funcionando.

<A NAME="lfindex8">&nbsp;</A>
<H2>Cosas a hacer</H2>

El sistema de correo est&aacute; completamente configurado. Todos los usuarios (/etc/passwd,
comando adduser) podr&aacute;n enviar y recibir correo de forma autom&aacute;tica. El correo se almacenar&aacute;
en los directorios de spool tradicionales en /var/spool/mail y se pueden leer de forma local. Si
quiere que el usuario pueda leer el correo mediante los protocolos pop3 o imap debe instalar
un paquete que normalmente se llama "imap" y provee los demonios /usr/sbin/imapd y /usr/sbin/ipop3d
<br>
Para iniciarlos basta descomentar las siguientes l&iacute;neas en /etc/inetd.conf:
<pre>
pop-3   stream  tcp     nowait  root    /usr/sbin/tcpd  ipop3d
imap    stream  tcp     nowait  root    /usr/sbin/tcpd  imapd
</pre>
Si tiene xinetd necesitar&aacute; crear un fichero de configuraci&oacute;n apropiado para este servicio (puede
ver el <a href="../November2000/article175.shtml">art&iacute;culo 175</a> de  Linux<font
color="#FF0000">Focus</font> que trata sobre este tema).
Recuerde tambi&eacute;n autorizar el acceso a los usuarios que env&iacute;an correo desde otro host a su red local
en el fichero /etc/hosts.allow:
<pre>
# hosts.allow , fichero de configuraci&oacute;n  de tcp wrapper
# cualquiera puede acceder a imap:
imapd: ALL
# pop3 s&oacute;lo se permite desde 2 hosts:
ipop3d: 10.0.0.1, 10.0.0.2, 127.0.0.1
</pre>

<A NAME="lfindex9">&nbsp;</A>
<H2>Encontrando un ISP</H2>

<P>
Encontrar un Servidor de Acceso a Internet bueno y fiable para UUCP no siempre es f&aacute;cil,
especialmente desde que la mayor&iacute;a de los ISPs est&aacute;n dirigidos a D. NiIdeaWindowsPreinstalado.

<br><br>
Conozco dos ISPs bastante buendos en Alemania que ofrecen correo electr&oacute;nico sobre UUCP:
<ul>
<li><a href="http://www.toppoint.de">www.toppoint.de</a>
<li><a href="http://www.sub.net">www.sub.net</a>
</ul>
Los dos son organizaciones y b&aacute;sicamente hay que unirse a la organizaci&oacute;n para utilizar el servicio.
Las tarifas est&aacute;n entre los 11 y 20 euros por mes
</P>
<P>
En LinuxFocus.org tambi&eacute;n podemos proveer correo sobre UUCP a un n&uacute;mero limitado de amigos
seguidores de Linux, si usted se une a nuestra organizaci&oacute;n y nos ayuda financi&aacute;ndonos y/o
trabajando con nosotros regularmente podr&iacute;a recibir este servicio. Contacte conmigo si est&aacute;
interesado </P> <P>
Una buena forma de encontrar un ISP conveniente en su pa&iacute;s puede ser simplemente busc&aacute;ndolo en
Google o en cualquier otro motor de b&uacute;squeda. Cuanto m&aacute;s peque&ntilde;o sea el ISP m&aacute;s servicios ofrecer&aacute; a
sus clientes, y posiblemente correo electr&oacute;nico sobre UUCP. </P>

<A NAME="lfindex10">&nbsp;</A>
<H2>Referencias</H2>

<ul>
<li>El <a
href="http://www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/html_single/UUCP-HOWTO.html">HOWTO
</a> de UUCP publicado por linuxdoc.org</li> <li>La  <a
href="../../common/src/article215/uucp.html">documentaci&oacute;n</a> de Tayler UUCP (m&aacute;s de
300K de html)</li>
</ul>

  



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=215&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Guido     Socher, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://www.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article215.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:guido@linuxfocus.org"><FONT COLOR="#FFFFFF">Guido     Socher</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:rhernando@mundofree.com"><FONT COLOR="#FFFFFF">Roberto Hernando Velasco    </FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-10-02, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
