<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar: The Social Context of Free Software</TITLE>
<LINK HREF="cathedral-paper-11.html" REL=next>
<LINK HREF="cathedral-paper-9.html" REL=previous>
<LINK HREF="cathedral-paper.html#toc10" REL=contents>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-11.html">Siguiente</A>
<A HREF="cathedral-es-paper-09.html">Anterior</A> <A HREF="cathedral-es-paper-00.html#toc10">Indice</A>&nbsp;
<HR>
<H2>
<A NAME="s10"></A>10. El contexto social del software abierto</H2>
Lo que se dijo era cierto: los mejores desarrollos surgen al abordar soluciones
personales a los problemas cotidianos del autor, y se difunden porque el
problema afecta tambi&eacute;n a un amplio grupo de usuarios. Esto nos
devuelve a la regla 1, que ahora podemos reformular de una forma quiz&aacute;
m&aacute;s &uacute;til:

<P><I>18. Para resolver un problema interesante, comienza por encontrar
uno que lo sea para t&iacute;.</I>

<P>Fue el caso de Carl Harris y el 'popclient' original, y tambi&eacute;n
el m&iacute;o con 'fetchmail'. Pero es algo que se sab&iacute;a de antiguo.
La parte importante, aquella que los casos de Linux y 'fetchmail' ponen
de manifiesto es la etapa siguiente -- la evoluci&oacute;n del software
cuando hay una comunidad amplia y activa de usuarios y colaboradores.

<P>En el libro ``The Mythical Man-Month'' (<I>Nota det traductor: Se mantiene
el t&iacute;tulo en ingl&eacute;s de los libros citados a continuaci&oacute;n
porque se cree que no han sido traducidos y editados en Espa&ntilde;a.
Al no disponer de datos que permitan acceder a la versi&oacute;n castellana
en caso de que exista, se prefiere conservar el t&iacute;tulo original
para facilitar al menos el acceso a la versi&oacute;n inglesa</I>), Fred
Brooks observ&oacute; que el tiempo que alguien dedica a programar no es
un consumible m&aacute;s; a&ntilde;adir m&aacute;s programadores a un proyecto
que se desarrolla con retraso lo retrasa a&uacute;n m&aacute;s. Lo justific&oacute;
diciendo que la complejidad y los costes de comunicaci&oacute;n crec&iacute;an
con el cuadrado del n&uacute;mero de personas implicadas, en tanto el trabajo
realizado lo hac&iacute;a linealmente. Este enunciado pas&oacute; a ser
la "ley de Brook" y suele considerarse un axioma. Pero si la ley de Brooks
fuera la verdad absoluta, Linux ser&iacute;a imposible.

<P>Algunos a&ntilde;os m&aacute;s tarde el cl&aacute;sico de Gerald Weinberg
``The Psychology Of Computer Programming'' proporcion&oacute; lo que puede
verse como una correcci&oacute;n fundamental a Brooks. En su discusi&oacute;n
sobre "la programaci&oacute;n sin ego", Weinberg hizo notar que en aquellos
lugares en que los programadores no desarrollan un sentido de la propiedad
sobre su propio c&oacute;digo, y animan a los dem&aacute;s a buscar errores
y posibles mejoras, el desarrollo progresa a una velocidad dram&aacute;ticamente
superior a la habitual.

<P>La terminolog&iacute;a empleada por Weinberg ha dificultado quiz&aacute;
que su an&aacute;lisis se acepte a la escala que merec&iacute;a -- uno
no puede sino sonre&iacute;r cuando se describe a los hackers de Internet
como desprovistos de ego. Pero creo que sus argumentos suenan mucho m&aacute;s
plausibles hoy que nunca.

<P>La historia de Unix nos deber&iacute;a haber preparado para lo que estamos
aprendiendo con Linux (y que yo he comprobado a menor escala al copiar
deliberadamente sus m&eacute;todos). Es decir, que aunque la programaci&oacute;n
sea una actividad solitaria, los aut&eacute;nticos logros surgen de la
puesta en com&uacute;n de la atenci&oacute;n y la capacidad intelectual
de comunidades enteras. Aquel que dependa tan s&oacute;lo de su cerebro
al desarrollar un sistema va estar siempre en desventaja frente al que
sepa c&oacute;mo crear un ambiente abierto y en evoluci&oacute;n en el
cual la b&uacute;squeda de errores y las mejoras se conf&iacute;en a cientos
de personas.

<P>El mundo Unix tradicional se vi&oacute; imposibilitado de llevar este
enfoque hasta el extremos debido a varias razones. Una fue la limitaci&oacute;n
impuesta por los diversos tipos de licencia de uso, y los secretos e intereses
comerciales. Otra (podemos pensarlo ahora) fue que Internet todav&iacute;a
no estaba lo bastante desarrollada.

<P>Antes de que Internet fuera ampliamente accesible, hab&iacute;a algunas
comunidades geogr&aacute;ficamente compactas en las que el ambiente cultural
alentaba esa programaci&oacute;n sin ego propuesta por Weinberg, donde
un programador pod&iacute;a atraer con facilidad a un mont&oacute;n de
colaboradores y virtuosos del bit. Los laboratorios Bell, el laboratorio
de inteligencia artificial del MIT, la universidad de Berkeley -- se convirtieron
en el hogar de innovaciones que a&uacute;n son legendarias y potentes.

<P>Linux fue el primer proyecto que se esforz&oacute; de manera consciente
y exitosa en usar el mundo <I>entero</I> como su dep&oacute;sito intelectual.
No creo que sea una mera coincidencia que el periodo de gestaci&oacute;n
de Linux viera al tiempo el nacimiento de la World Wide Web, y que Linux
dejara atr&aacute;s su infancia en el mismo periodo 1993-1994 en que despeg&oacute;
la industria de los proveedores de acceso a Internet y se produjo la explosi&oacute;n
del inter&eacute;s generalizado por Internet. Linus fue la primera persona
que aprendi&oacute; a jugar con las nuevas reglas que la disponibilidad
de Internet pon&iacute;a en juego.

<P>Una Internet accesible era condici&oacute;n necesaria para la evoluci&oacute;n
de Linux, pero no creo que fuera suficiente. Otro factor vital fue el desarrollo
de un estilo de liderazgo y unos h&aacute;bitos de cooperaci&oacute;n que
fueran capaces de atraer colaboradores para extraer los m&aacute;ximos
frutos del nuevo medio.

<P>Pero, &iquest;en qu&eacute; consisten?. No pueden basarse en relaciones
de poder -- y aunque as&iacute; fuera, el liderazgo por coacci&oacute;n
no producir&iacute;a los resultados que vemos. Weinberg cita la autobiograf&iacute;a
del anarquista ruso del siglo diecinueve Kropotkin "Memorias de un revolucionario"
de manera adecuada a este tema:

<P>``Al crecer en una familia que dispon&iacute;a de siervos, empec&eacute;
mi vida activa, como todos los hombres de mi tiempo, teniendo una gran
confianza en la necesidad de ejercer el mando, administrar el castigo o
la coacci&oacute;n y dem&aacute;s. Pero cuando, poco despu&eacute;s, hube
de hacerme cargo de empresas importantes y tratar con hombres [libres],
y cuando cada error ten&iacute;a consecuencias graves, comenc&eacute; a
apreciar la diferencia entre actuar bajo el principio del mando y la disciplina
o el del entendimiento com&uacute;n. El primero funciona admirablemente
en un desfile militar, pero carece de valor en la vida real, donde un objetivo
s&oacute;lo puede lograrse a trav&eacute;s del esfuerzo concertado de muchas
voluntades".

<P>El "esfuerzo concertado de muchas voluntades" era precisamente lo que
necesitaba un proyecto como Linux -- y el "principio de mando" resulta
imposible de utilizar en el contexto de un grupo de voluntarios en el para&iacute;so
anarquista que denominamos Internet. Para trabajar y competir con eficacia,
los hackers que quieren desarrollar un proyecto en colaboraci&oacute;n
deben aprender a reclutar y motivar a la gente en base a intereses comunes
al modo vagamente sugerido por Kropotkin con su "principio de comprensi&oacute;n
mutua". Deben aprender a usar la ley de Linus.

<P>Anteriormente me refer&iacute; al "efecto Delphi" como una posible explicaci&oacute;n
de la ley de Linus. Analog&iacute;as m&aacute;s potentes con los sistemas
adaptativos en biolog&iacute;a y econom&iacute;a surgen irresistiblemente
por s&iacute; solas. El mundo Linux se asemeja en muchos aspectos a un
mercado libre o un sistema ecol&oacute;gico, a una colecci&oacute;n de
agentes aut&oacute;nomos que intentan maximizar la utilidad en un proceso
que termina conduciendo a un &oacute;rden derivado de la autocorrecci&oacute;n
espont&aacute;nea mucho m&aacute;s eficiente y elaborado de lo que hubiera
podido lograr cualquier cantidad de planificaci&oacute;n. Es en estos t&eacute;rminos
en los que hay que hablar del "principio de comprensi&oacute;n mutua".

<P>La "funci&oacute;n de utilidad" que los hackers de Linux est&aacute;n
maximizando no es econ&oacute;mica en sentido cl&aacute;sico, sino un intangible
derivado de su grado de satisfacci&oacute;n personal y de la reputaci&oacute;n
adquirida ante los dem&aacute;s hackers. (Podr&iacute;amos hablar de altruismo,
pero ser&iacute;a ignorar que &eacute;ste es en s&iacute; mismo una forma
a trav&eacute;s de la cual el altruista satisface su ego personal). Las
culturas que funcionan voluntariamente mediante este esquema no son infrecuentes;
otra en la que he participado con asiduidad es el colectivo de los entusiastas
de la ciencia ficci&oacute;n, en la cual, al contrario de lo que ocurre
en el mundo hacker, se reconoce explicitamente el culto al ego (el aumento
de tu reputaci&oacute;n dentro del colectivo) como la motivaci&oacute;n
fundamental que justifica la actividad de tipo voluntario.

<P>Linus, al saber colocarse como administrador de un proyecto en que el
desarrollo era principalmente realizado por los dem&aacute;s, y alimentando
el inter&eacute;s en &eacute;l hasta que fu&eacute; capaz de automantenerse,
mostr&oacute; un notable grado de percepci&oacute;n del "principio de comprensi&oacute;n
mutua" de Kropotkin. Esta visi&oacute;n cuasi-econ&oacute;mica del mundo
Linux nos permite ver el modo en que se aplica este conocimiento.

<P>Podemos ver el m&eacute;todo de Linus como una forma de crear un mercado
eficaz movido en torno del culto al ego -- una forma de conectar la individualidad
de los hackers tan firmemente como fuera posible para llevarla a culimnar
objetivos dif&iacute;ciles solo alcanzables mediante una colaboraci&oacute;n
sostenida. Con el proyecto 'fetchmail' he mostrado (aunque a menor escala)
que su m&eacute;todo se puede reproducir con buenos resultados. Quiz&aacute;
yo lo he hecho de una forma un poco m&aacute;s consciente y sistem&aacute;tica
que &eacute;l.

<P>Mucha gente (en particular aquellos que por razones pol&iacute;ticas
no conf&iacute;an en el libre mercado) esperar&iacute;a que la cultura
de un grupo de ego&iacute;stas aut&oacute;nomos resultara fragmentada,
territorial, despilfarradora, secretista y hostil. Pero estas predicciones
son inequ&iacute;vocamente contradichas por (s&oacute;lo por poner un ejemplo)
la asombrosa variedad, calidad y profundidad de la documentaci&oacute;n
de Linux. Nadie en su sano juicio niega que los programadores <I>odian</I>
documentar sus obras; &iquest;como es posible, entonces, que los hackers
en Linux produzcan tanta?. Resulta evidente que el libre mercado de culto
al ego en Linux funciona mejor en este aspecto que la financiaci&oacute;n
masiva para la producci&oacute;n comercial de t&iacute;tulos de referencia
de los fabricantes de software.

<P>Tanto 'fetchmail' como el n&uacute;cleo Linux demuestran que recompensando
adecuadamente los egos de muchos otros hackers, un desarrollador/coordinador
puede usar Internet para capturar los beneficios derivados de tener muchos
colaboradores sin que el proyecto colapse en un desorden ca&oacute;tico.
Por lo cual propongo lo siguiente, en contra de la ley de Brooks:

<P><I>19: Si el coordinador de un proyecto tiene a su disposici&oacute;n
un medio de comunicaci&oacute;n al menos tan potente como Internet, y sabe
como conducir a la gente sin coaccionarla, muchas cabezas son inevitablemente
mejor que una.</I>

<P>Creo que el futuro del software abierto pertenecer&aacute; cada vez
m&aacute;s a gente que sepa como jugar al modo de Linus, a gente que deje
atr&aacute;s la catedral y abrace el bazar. Esto no quiere decir que la
visi&oacute;n y la brillantez individual ya no importen; al contrario,
creo que los proyectos m&aacute;s trascendentales en el mundo del software
abierto ser&aacute;n los de aquellos que comiencen a partir de la visi&oacute;n
y la brillantez individual y amplifiquen su importancia mediante la construcci&oacute;n
eficaz de grupos con intereses comunes.

<P>Y tal vez no s&oacute;lo el futuro del software <I>abierto</I>. Ning&uacute;n
fabricante comercial de software puede igualar el dep&oacute;sito de inteligencia
que la comunidad Linux puede movilizar sobre un problema dado. &iexcl;Muy
pocos podr&iacute;an permitirse siquiera alquilar a las m&aacute;s de doscientas
personas que colaboraron en el desarrollo de 'fetchmail'!.

<P>Quiz&aacute; al final la cultura del software abierto triunfe no porque
la colaboraci&oacute;n sea moralmente "buena" y la posesi&oacute;n avara
del software "mala" (suponiendo que creas esto &uacute;ltimo, algo que
ni yo ni Linus hacemos), sino simplemente porque el mundo comercial no
puede ganar una carrera de armamentos frente a comunidades de software
abierto capaces de movilizar cantidades de tiempo de personal cualificado
algunos &oacute;rdenes de magnitud superiores a la hora de resolver un
problema.

<P>
<HR><A HREF="cathedral-es-paper-11.html">Siguiente</A> <A HREF="cathedral-es-paper-9.html">Anterior</A>
<A HREF="cathedral-es-paper-00.html#toc10">Indice</A>
</BODY>
</HTML>
