<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar: A Few More Lessons From Fetchmail</TITLE>
<LINK HREF="cathedral-paper-9.html" REL=next>
<LINK HREF="cathedral-paper-7.html" REL=previous>
<LINK HREF="cathedral-paper.html#toc8" REL=contents>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-09.html">Siguiente</A>
<A HREF="cathedral-es-paper-07.html">Anterior</A> <A HREF="cathedral-es-paper-00.html#toc8">Indice</A>&nbsp;
<HR>
<H2>
<A NAME="s8"></A>8. Algunas lecciones m&aacute;s a partir de 'fetchmail'.</H2>
Antes de que volvamos a asuntos generales de dise&ntilde;o de software,
no estar&iacute;a de m&aacute;s valorar un par de lecciones puntuales.

<P>La sintaxis de los ficheros 'rc' incluye una serie de &oacute;rdenes
opcionales que pueden ser consideradas como 'ruido' y son ignoradas por
el int&eacute;rprete. Permiten el empleo de una sintaxis m&aacute;s pr&oacute;xima
al ingl&eacute;s que resulta mucho m&aacute;s legible que la tradicional,
formada por pares &oacute;rden-dato, que es a lo que se reduce si se eliminan.

<P>Empezaron como un experimento a altas horas de la noche cuando ca&iacute;
en la cuenta de que las declaraciones de ficheros en los archivos 'rc'
comenzaban&nbsp; a parecer un peque&ntilde;o lenguaje en tono imperativo.
(Es tambi&eacute;n la raz&oacute;n por la que cambi&eacute; la &oacute;rden
'server' original de 'popclient' a 'poll') (<I>Nota del traductor: No se
han traducido por cuanto las &oacute;rdenes de 'fetchmail' siguen en ingl&eacute;s</I>).

<P>Me pareci&oacute; que aproximar ese minilenguaje imperativo al ingl&eacute;s
lo har&iacute;a de uso m&aacute;s sencillo. Ahora, aunque soy un francotirador
convencido de la correcci&oacute;n de la escuela que predica el "crea un
lenguaje" al modo de Emacs, HTML y muchos de los motores de las bases de
datos, no soy tan entusiasta de las sintaxis que se aproximan al ingl&eacute;s.

<P>Los programadores han tendido tradicionalmente a favorecer sintaxis
de control que eran muy precisas y compactas y carec&iacute;an de redundancias.
Es una herencia cultural de los tiempos en que los recursos de computaci&oacute;n
eran caros, lo que aconsejaba que las etapas de interpretaci&oacute;n de
&oacute;rdenes fueran lo m&aacute;s eficaces y simples que se pudiera lograr.
El ingl&eacute;s, con un 50% aproximadamente de redundancia, parec&iacute;a
un modelo poco apropiado para estos lenguajes.

<P>No es esta la raz&oacute;n de mi modesta oposici&oacute;n a las sintaxis
que tratan de asemejarse al ingl&eacute;s; la cito s&oacute;lo para negarla.
Con los costes de computaci&oacute;n de hoy en d&iacute;a, la simplicidad
no debe ser un fin en s&iacute; mismo. En este momento es m&aacute;s importante
que un lenguaje resulte f&aacute;cil de usar para los humanos que eficaz
para el ordenador.

<P>Sin embargo, hay razones para ser prudente. Una es el coste en t&eacute;rminos
de complejidad de la etapa de interpretaci&oacute;n -- no es deseable llevarlo
a un punto en que sean una causa importante de errores y confusi&oacute;n
del usuario. Otra consiste en que intentar aproximar un lenguaje al ingl&eacute;s
suele requerir que el ingl&eacute;s que se termine utilizando se vea seriamente
deformado, de modo que esa semejanza superficial al lenguaje natural acaba
por resultar tan confusa como lo hubiera sido la sintaxis original. (Es
algo que puede verse en muchos '4GL' y lenguajes comerciales para acceder
a bases de datos).

<P>La sintaxis de control de 'fetchmail' parece evitar estos problemas
debido a que el dominio en que se aplica es extremadamente restringido.
No se parece en nada a un lenguaje de prop&oacute;sito general; como las
cosas que dice no son nada complicadas hay poco lugar para la confusi&oacute;n
al pasar mentalmente de un peque&ntilde;o subconjunto del ingl&eacute;s
al lenguaje de control real. Me parece que puede haber una lecci&oacute;n
general a extraer de eso.

<P><I>16. Si el lenguaje de tu programa no es Turing-completo ni por asomo,
puede venir bien endulzar su sintaxis.</I>

<P>Otra lecci&oacute;n trata sobre el intento de llegar a la seguridad
mediante la oscuridad. Algunos usuarios de 'fetchmail' me pidieron que
cambiara el programa para que las contrase&ntilde;as se guardaran encriptadas
en el fichero 'rc', de modo que los mirones no fueran capaces de leerlas.

<P>No lo hice, por cuanto no a&ntilde;ade protecci&oacute;n alguna. Cualquiera
que consiga los permisos necesarios para leer tu fichero 'rc' podr&aacute;
ejecutar 'fetchmail' en tu lugar -- y si lo que busca es tu contrase&ntilde;a,
ser&aacute; capaz de extraer el decodificador del c&oacute;digo de 'fetchmail'
para lograrla.

<P>Todo lo que se hubiera logrado al codificar las contrase&ntilde;as en
'.fethcmailrc' hubiera sido proporcionar una falsa sensaci&oacute;n de
seguridad a aquellos que no piensan demasiado. La regla general es:

<P><I>17. Un sistema es s&oacute;lo tan seguro como su secreto. Cuidado
con los falsos secretos.</I>

<P>
<HR><A HREF="cathedral-es-paper-09.html">Siguiente</A> <A HREF="cathedral-es-paper-07.html">Anterior</A>
<A HREF="cathedral-es-paper-00.html#toc8">Indice</A>
</BODY>
</HTML>
