<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar: Fetchmail Grows Up</TITLE>
<LINK HREF="cathedral-paper-8.html" REL=next>
<LINK HREF="cathedral-paper-6.html" REL=previous>
<LINK HREF="cathedral-paper.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-08.html">Siguiente</A>
<A HREF="cathedral-es-paper-06.html">Anterior</A> <A HREF="cathedral-es-paper-00.html#toc7">Indice</A>&nbsp;
<HR>
<H2>
<A NAME="s7"></A>7. Fetchmail se hace mayor</H2>
Aqu&iacute; estaba yo con un dise&ntilde;o nuevo e innovador, un c&oacute;digo
que sab&iacute;a que funcionaba bien porque lo usaba todos los d&iacute;as,
y una lista de desarrolladores desbordante. Me fui dando cuenta poco a
poco de que ya no se trataba s&oacute;lo de un proyectito personal que
quiz&aacute; les resultara &uacute;til a unas pocas personas m&aacute;s.
Ten&iacute;a en mis manos un programa que todo 'hacker' con un ordenador
Unix y una conexi&oacute;n de correo del tipo SLIP/PPP necesitaba de verdad.

<P>Con la posibiliad de realizar el reenv&iacute;o a trav&eacute;s de SMTP,
se adelant&oacute; lo suficiente a la competencia como para poder llegar
a ser el progrma dominante de este tipo, uno de esos cl&aacute;sicos que
cumplen su cometido tan bien que las dem&aacute;s alternativas no s&oacute;lo
se descartan sino que casi caen en el olvido.

<P>Creo que no es posible hacer planes para llegar a un resultado as&iacute;.
Te ves conducido a &eacute;l por ideas para el dise&ntilde;o tan potentes
que el resultado posterior parece simplemente inevitable, natural, incluso
premeditado. La unica forma de encontrar este tipo de conceptos es disponer
de un mont&oacute;n de ideas -- o teniendo el juicio y la habilidad ingenieril
para llevar las ideas de los dem&aacute;s m&aacute;s lejos de lo que ellos
cre&iacute;an posible.

<P>Andrew Tanenbaum tuvo la idea original de construir un Unix nativo sencillo
para el 386, con el fin de usarlo en ense&ntilde;anza. Linus Torvalds llev&oacute;
el concepto Minix probablemente mucho m&aacute;s lejos de lo que Andrew
cre&iacute;a que pod&iacute;a llevarse -- y lleg&oacute; a ser algo admirable.
Del mismo modo (aunque a menor escala), cog&iacute; algunas ideas de Carl
Harris y Harry Hochheiser y las desarroll&eacute; considerablemente. Ninguno
de nosotros fue 'original' en el sentido rom&aacute;ntico que mucha gente
asocia a un genio. Sin embargo, la mayor parte de la ciencia, la ingenier&iacute;a
o el desarrollo del software no es realizada por genios, aunque la mitolog&iacute;a
'hacker' mantenga lo contrario.

<P>El resultado fue de todas formas bastante trascendental -- de hecho,
fue el tipo de &eacute;xito que todo 'hacker' ans&iacute;a lograr. Y eso
hac&iacute;a que tuviera que hacer mis est&aacute;ndares a&uacute;n m&aacute;s
exigentes. Para hacer 'fetchmail' tan bueno como ahora sab&iacute;a que
pod&iacute;a llegar a ser, ten&iacute;a que escribir no solo para cubrir
mis necesidades, sino tambi&eacute;n incluir y dar soporte a caracter&iacute;sticas
necesarias para otros pero que quedaban fuera de mi &aacute;mbito. Y hacerlo
al tiempo que manten&iacute;a la sencillez y robustez del programa.

<P>La primera caracter&iacute;stica, y con diferencia la m&aacute;s importante,
que a&ntilde;ad&iacute; a continuaci&oacute;n, fue el soporte para entregas
m&uacute;ltiples -- la posibilidad de recoger el correo de puestos que
hab&iacute;an acumulado todo el correo de un grupo de usuarios y enviar
cada&nbsp; uno de los mensajes a su destinatario particular.

<P>Decid&iacute; a&ntilde;adirlo en parte porque algunos lo estaban pidiendo
con insistencia, pero ante todo porque cre&iacute; que contribuir&iacute;a
a sacar a la luz los errores que pudieran quedar en el modo normal de entrega
simple al obligarme a poner en funcionamiento un sistema de entrega completamente
general. Y as&iacute; ocurrio. Conseguir implementar un int&eacute;rprete
de &oacute;rdenes acorde a la norma RFC822 me llev&oacute; una considerable
cantidad de tiempo, no porque hubiera alg&uacute;n trozo especialmente
problem&aacute;tico, sino por un aut&eacute;ntico mont&oacute;n de detalles
confusos e interdependientes.

<P>Pero la decisi&oacute;n de soportar entregas m&uacute;ltiples result&oacute;
al final excelente. Me top&eacute; con lo siguiente:

<P><I>14. Toda herramienta debe resultar &uacute;til en la forma prevista,
pero una&nbsp; *gran herramienta* te lleva a usarla para realizar cosas
jam&aacute;s pensadas.</I>

<P>Este uso imprevisto para la capacidad de realizar entregas m&uacute;ltiples
consiste en gestionar listas de correo manteni&eacute;ndolas y realizando
la conversi&oacute;n de los alias en el lado <I>cliente</I> de una conexi&oacute;n
SLIP/PPP. Esto permite que cualquiera que est&eacute; empleando una m&aacute;quina
personal conectada a Internet a trav&eacute;s de una cuenta en un proveedor
de las m&aacute;s corrientes pueda gestionar una lista de correo sin tener
que acceder de manera continua a las listas de alias del proveedor de acceso
a Internet.

<P>Otro cambio importante que mis colaboradores ped&iacute;an era el soporte
para la codificaci&oacute;n de mensajes MIME 8-bits. REsult&oacute; bastante
f&aacute;cil debido a que hab&iacute;a tenido bastante cuidado en que el
programa no interfiriera con su utilizaci&oacute;n. No es que me anticipara
a esta petici&oacute;n, sino porque trataba de seguir otra regla importante:

<P><I>15. Cuando escribas programas que act&uacute;en como pasarelas de
datos ('gateway software'), ten cuidado de modificarlos lo menos posible
-- y *nunca* elimines informaci&oacute;n a menos que su destinatario te
fuerce a hacerlo.</I>

<P>Si no hubiera seguido esta regla, dar soporte a mensajes en c&oacute;digo
MIME 8-bits hubiera resultado dif&iacute;cil y propenso a errores. En cambio,
lo &uacute;nico que hizo falta fue leer la norma RFC 1652 y a&ntilde;adir
un poco m&aacute;s de l&oacute;gica a la generaci&oacute;n de cabeceras.
Result&oacute; bastante trivial.

<P>Algunos usuarios europeos insistieron en que a&ntilde;adiera una opci&oacute;n
para limitar el n&uacute;mero de mensajes recogidos en cada sesi&oacute;n
(de modo que pudieran controlar los costes ocasionados por sus car&iacute;simas
l&iacute;neas telef&oacute;nicas). Me resist&iacute; durante mucho tiempo,
y a&uacute;n no estoy demasiado contento con el resultado. Pero si se escribe
para todo el mundo, tienes la obligaci&oacute;n de escuchar a tus clientes
-- nada cambia a este respecto aunque no te est&eacute;n pagando con dinero.

<P>
<HR><A HREF="cathedral-es-paper-08.html">Siguiente</A> <A HREF="cathedral-es-paper-06.html">Anterior</A>
<A HREF="cathedral-es-paper-00.html#toc7">Indice</A>
</BODY>
</HTML>
