<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar: When Is A Rose Not A Rose?</TITLE>
<LINK HREF="cathedral-paper-6.html" REL=next>
<LINK HREF="cathedral-paper-4.html" REL=previous>
<LINK HREF="cathedral-paper.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-06.html">Siguiente</A>
<A HREF="cathedral-es-paper-04.html">Anterior</A> <A HREF="cathedral-es-paper-00.html#toc5">Indice</A>&nbsp;
<HR>
<H2>
<A NAME="s5"></A>5. &iquest;Cuando una rosa deja de serlo?</H2>
Tras estudiar el comportamiento de Linus y desarrollar una teor&iacute;a
sobre los motivos de su &eacute;xito, decid&iacute; conscientemente comprobar
su validez sobre mi nuevo (desde luego mucho menos complejo y ambicioso)
proyecto.

<P>Pero lo primero que hice fue reorganizar y simplificar 'popclient' en
buena medida. La implementaci&oacute;n de Carl Harris era muy brillante,
pero mostraba cierta complejidad innecesaria bastante generalizada entre
muchos programadores en C. Trataba el c&oacute;digo como la parte m&aacute;s
importante y las estructuras de datos como un mero apoyo. Como resultado,
el c&oacute;digo era magn&iacute;fico pero las estructuras de datos se
hab&iacute;an dise&ntilde;ado con descuido y resultaban bastante espantosas
(al menos para los severos criterios impuestos por el antiguo 'hacker'
en Lisp que les est&aacute; narrando esto).

<P>Por si no bastara, ten&iacute;a otro prop&oacute;sito en mente para
reescribirlo adem&aacute;s de mejorar el c&oacute;digo y el dise&ntilde;o
de las estructuras de datos. Consist&iacute;a en conducirlo a algo que
yo entendiera por completo. No es divertido ser el responsable de la depuraci&oacute;n
de un programa que no comprendes.

<P>Por tanto, m&aacute;s o menos durante el primer mes, me limit&eacute;
a aceptar las consecuencias derivadas del dise&ntilde;o original de Carl
Harris. El primer cambio importante que hice fue a&ntilde;adir soporte
para 'IMAP'. Para ello reorganic&eacute; los m&oacute;dulos relacionados
con la gesti&oacute;n de protocolos (para POP2, POP3 e IMAP) convirti&eacute;ndolos
en un controlador gen&eacute;rico y tres tablas para los m&eacute;todos
de gesti&oacute;n. Esto, y los cambios anteriores, ilustran un principio
general que conviene tener en mente, especialmente en lenguajes que, como
C, no conducen de forma natural al concepto de estructuras de datos din&aacute;micas:

<P><I>9. Estructuras de datos inteligentes asociadas a un c&oacute;digo
torpe funcionan mucho mejor que la alternativa opuesta.</I>

<P>Otra vez Fred Brooks, en el Cap&iacute;tulo 11: "Ens&eacute;&ntilde;ame
tu c&oacute;digo y mant&eacute;n ocultas tus estructuras de datos, y me
seguir&aacute;s enga&ntilde;ando. Mu&eacute;strame tus estructuras de datos
y normalmente no necesitar&eacute; que me ense&ntilde;es tu c&oacute;digo:
resultar&aacute; evidente."

<P>En realidad, &eacute;l dec&iacute;a "organigramas" y "tablas". Pero
pas&aacute;ndolo por el filtro de treinta a&ntilde;os de terminolog&iacute;a
y evoluci&oacute;n cultural, viene a ser lo mismo.

<P>En este momento (a principios de Septiembre de 1996, unos seis meses
despu&eacute;s de haber empezado) empec&eacute; a pesar en la conveniencia
de un cambio de nombre -- al fin y al cabo, ya no era s&oacute;lo un cliente
POP. Pero dudaba, pues todav&iacute;a no hab&iacute;a nada realmente nuevo
en el dise&ntilde;o. Mi versi&oacute;n de 'popclien' a&uacute;n ten&iacute;a
que desarrollar su propia personalidad.

<P>La situaci&oacute;n cambi&oacute; radicalmente cuando 'fetchmail' aprendi&oacute;
a enviar el correo recogido a una puerta SMTP. Pronto veremos eso. Pero,
en primer lugar, ocup&eacute;monos de lo siguiente: dije antes que decid&iacute;
usar este proyecto para poner a prueba mi teor&iacute;a sobre qu&eacute;
hab&iacute;a hecho bien Linus Torvalds. Puedes estarte preguntando &iquest;c&oacute;mo
lo llev&eacute; a cabo?. De las siguientes maneras:
<OL>
<LI>
Lanc&eacute; versiones pronto y con frecuencia (casi nunca menos de una
versi&oacute;n cada diez d&iacute;as y, en periodos de desarrollo intenso,
una diaria).</LI>

<LI>
Hice crecer mi lista de probadores de las versiones beta a&ntilde;adiendo
a ella a todo aquel que se puso en contacto conmigo interes&aacute;ndose
por 'fetchmail'.</LI>

<LI>
Envi&eacute; anuncios seductores a la lista de personas incluidas en la
prueba de las betas siempre que lanc&eacute; una nueva versi&oacute;n,
animando a la gente a que participara.</LI>

<LI>
Y escuch&eacute; lo que ellos tuvieron que decir, manteni&eacute;ndoles
al corriente de las decisiones tomadas sobre el dise&ntilde;o y agradeciendo
su colaboraci&oacute;n siempre que enviaban correcciones o informes sobre
el funcionamieno del programa.</LI>
</OL>
La recompensa obtenida a cambio de acciones tan sencillas fue inmediata.
Desde que el proyect&oacute; comenz&oacute;, dispuse de informes sobre
errores de una calidad tal que la mayor&iacute;a de los desarrolladores
matar&iacute;an a alguien por conseguirla, a menudo con correcciones propuestas
para solucionarlos. Logr&eacute; cr&iacute;ticas razonadas, consegu&iacute;
correo anim&aacute;ndome a proseguir, me llegaron un mont&oacute;n de sugerencias
sobre cosas a a&ntilde;adir. Lo que nos lleva a proponer que:

<P><I>10. Si tratas a la gente que te ayuda a depurar un programa como
si fueran tu recurso m&aacute;s valioso, responder&aacute;n convirti&eacute;ndose
en eso precisamente.</I>

<P>Una forma interesante de medir el &eacute;xito de 'fetchmail' consiste
simplemente en mirar el tama&ntilde;o de la lista de personas que participaron
en las pruebas en la fase beta del desarrollo, de los que apoyaron 'fetchmail'.
Cuando escribo esto, tiene 249 miembros y sigue creciendo al ritmo de dos
o tres por semana.

<P>De hecho, al revisar esto a principios de Mayo de 1997, la lista est&aacute;
perdiendo miembros por una raz&oacute;n interesante. Algunos me han pedido
que los retire de ella por cuanto 'fetchmail' les funciona tan bien &iexcl;que
no necesitan seguir ya su evoluci&oacute;n!. Quiz&aacute; esta sea la forma
natural en que evoluciona un proyecto maduro en el estilo bazar.

<P>
<HR><A HREF="cathedral-es-paper-06.html">Siguiente</A> <A HREF="cathedral-es-paper-04.html">Anterior</A>
<A HREF="cathedral-es-paper-00.html#toc5">Indice</A>
</BODY>
</HTML>
