<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar: The Cathedral and the Bazaar</TITLE>
<LINK HREF="cathedral-paper-2.html" REL=next>
<LINK HREF="cathedral-paper.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-02.html">Siguiente</A>
Anterior <A HREF="cathedral-es-paper-00.html#toc1">Indice</A>&nbsp;
<HR>
<H2>
<A NAME="s1"></A>1. La catedral y el bazar</H2>
Linux es subversivo. &iquest;Qui&eacute;n hubiera pensado, tan solo cinco
a&ntilde;os atr&aacute;s, que un sistema operativo de gran calidad pudiera
concretarse como por ensalmo a partir del trabajo aficionado y a tiempo
parcial de varios miles de programadores esparcidos por todo el planeta
y conectados tan solo por las t&eacute;nues hebras de Internet?.

<P>Desde luego, yo no. En el momento en que Linux surgi&oacute; en la pantalla
de mi radar a principio de 1993, hab&iacute;a estado ya involucrado en
el desarrollo de Unix y de software abierto durante diez a&ntilde;os. Era
uno de los que primero contribuy&oacute; al desarrollo de GNU a mediados
de los ochenta. Hab&iacute;a lanzado en la red una cantidad respetable
de software abierto, desarrollando o co-desarrollando varios programas
(nethack, los modos VC y GUD de Emacs, xlife y algunos m&aacute;s) que
a&uacute;n se emplean ampliamente hoy en d&iacute;a. Cre&iacute;a saber
como se hac&iacute;a.

<P>Linux puso patas arriba mucho de lo que yo cre&iacute;a que sab&iacute;a.
Hab&iacute;a estado predicando durante a&ntilde;os el evangelio Unix consistente
en herramientas peque&ntilde;as, r&aacute;pido desarrollo de prototipos
y programaci&oacute;n evolutiva. Pero tambi&eacute;n cre&iacute;a que exist&iacute;a
una cierta complejidad cr&iacute;tica por encima de la cual era preciso
recurrir a un enfoque m&aacute;s centralizado y planificado desde el principio.
Cre&iacute;a que el software m&aacute;s importante (los sistemas operativos
o las herramientas realmente grandes&nbsp;&nbsp; tales como Emacs) necesitaban
ser construidas al modo de las catedrales, ser cuidadosamente ensamblados
por magos o peque&ntilde;as bandas de hechiceros trabajando en un espl&eacute;ndido
aislamiento, sin que hubiera lugar al lanzamiento de versiones de prueba
antes de que hubiera llegado el momento.

<P>El estilo de desarrollo de Linus Torvalds - lanzar versiones de prueba
enseguida y a menudo, delegar cuanto sea posible, estar abierto hasta el
punto de resultar promiscuo - result&oacute; una verdadera sorpresa. Nada
que ver con la silenciosa y reverente construcci&oacute;n de una catedral&nbsp;
-- la comunidad Linux, por contra, parec&iacute;a semejarse a un gran bazar
bullicioso con diferentes agendas y enfoques (adecuadamente reflejado por
los dep&oacute;sitos de software Linux, que admit&iacute;an contribuciones
de <I>cualquiera</I>) del cual solo parec&iacute;a posible que emergiera
un sistema coherente y estable mediante una sucesi&oacute;n de milagros.

<P>El hecho de que este estilo bazar parec&iacute;a funcionar, y bien,
me produjo una aut&eacute;ntica conmoci&oacute;n. Mientras lo iba aprendiendo
trabaj&eacute;, adem&aacute;s de en proyectos individuales, para intentar
comprender porqu&eacute; el mundo Linux no solo no se desmoronaba en medio
de una colosal confusi&oacute;n sino que parec&iacute;a ir de logro en
logro a una velocidad dif&iacute;cil de imaginar para los constructores
de catedrales.

<P>A mediados de 1996 cre&iacute; que lo comenazaba a entender. La casualidad
me proporcin&oacute; una forma perfecta de poner a prueba my teor&iacute;a,
mediante un proyecto de software abierto que pod&iacute;a intentar conducir
de forma deliberada seg&uacute;n el estilo bazar. Lo hice as&iacute;&nbsp;
-- y result&oacute; un &eacute;xito incuestionable.

<P>En el resto de este art&iacute;culo, contar&eacute; la historia de ese
proyecto, y lo emplear&eacute; para proponer algunas reglas sobre desarrollo
eficaz de software abierto. No todas son cosas que aprend&iacute; en el
mundo Linux, pero veremos que este les aporta un brillo especial. Si estoy
en lo cierto, le permitir&aacute;n entender exactamente qu&eacute; es lo
que hace de la comunidad Linux una fuente tal de buen software -- y le
ayudar&aacute;n a Vd. a ser m&aacute;s productivo.

<P>
<HR><A HREF="cathedral-es-paper-02.html">Siguiente</A> Anterior <A HREF="cathedral-es-paper-00.html#toc1">Indice</A>
</BODY>
</HTML>
