<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>The Cathedral and the Bazaar</TITLE>
<LINK HREF="cathedral-paper-1.html" REL=next>
</HEAD>
<BODY>
<A HREF="cathedral-es-paper-01.html">Siguiente</A>&nbsp;
Anterior&nbsp; Indice&nbsp;
<HR>
<H1>
La catedral y el bazar</H1>

<H2>
por Eric S. Raymond</H2>
$Fecha: 1998/01/29 05:47:17 $

<P>
<HR><I>Analizo un proyecto de software de dominio p&uacute;blico desarrollado
con &eacute;xito, fetchmail, que se realiz&oacute; como una prueba deliberada
de algunas teor&iacute;as&nbsp; sorprendentes sobre ingenier&iacute;a de
software sugeridas por la historia de Linux. Presento estas teor&iacute;as
en t&eacute;rminos de dos estilos de desarrollo completamente distintos,
el modelo ``cathedral'', aplicable a la mayor parte de los desarrollos
realizados en el mundo del software comercial, frente al modelo ``bazar'',
m&aacute;s propio del mundo Linux. Muestro que estos modelos se derivan
de puntos de partida opuestos sobre la naturaleza del proceso de depuraci&oacute;n
del software. Prosigo manteniendo a partir de la experiencia Linux la hip&oacute;tesis
de que ``Dado un n&uacute;mero suficiente de ojos, todos los errores son
irrelevantes'', sugiriendo analog&iacute;as productivas con otros sistemas
auto-correctores integrados por agentes aut&oacute;nomos, y concluyo realizando
alguna exploraci&oacute;n de las consecuencias de este punto de vista sobre
el futuro del software.</I>
<BR>
<HR>
<H4>
Nota del traductor al castellano:</H4>
El t&eacute;rmino "Free Software" se ha traducido como "software abierto".
Se ha preferido esta denominaci&oacute;n a la de "software de dominio p&uacute;blico"
(que corresponder&iacute;a estrictamente al t&eacute;rmino "public domain
software") para enfatizar lo que se cree es una caracter&iacute;stica necesaria
de este tipo de software: disponer del c&oacute;digo fuente del programa.
El t&eacute;rmino "hacker" resulta de dif&iacute;cil traducci&oacute;n.
En ocasiones se ha traducido como "programador aficionado", si bien ha
sido m&aacute;s frecuente que se haya dejado sin traducir. Seg&uacute;n
el libro "L&eacute;eme.ya", ISBN 84-605-7033-9, pg. 734, la definici&oacute;n
de "hacker" vendr&iacute;a a ser la siguiente:
<BR>"Hacker: Citando literalmente el libro 'Linux. Edici&oacute;n especial',
pg. 30: '... la definici&oacute;n popular de hacker tiene una connotaci&oacute;n
negativa en la sociedad actual... la actividad de los hackers tiene que
ver b&aacute;sicamente con el aprendizaje de todo lo que hay que conocer
de un sistema, la posibilidad de sumergirse en &eacute;ste al grado de
abstraerse, y la capacidad de repararlo cuando se cae. En general a los
hackers les interesa conocer el funcionamiento de los sistemas que encuentran
interesantes. ...algunos hackers transponen esa l&iacute;nea y se convierten
en lo que la comunidad hacker ha denominado cracker. A los hackers de la
computaci&oacute;n les molesta bastante que los comparen con estos v&aacute;ndalos
y delincuentes que los medios de difusi&oacute;n popular&nbsp; llaman equivocadamente
hackers en vez de crackers...' . Pues eso, no se confunda. A pesar de todo,
un colega bastante enterado mantiene que esa ser&iacute;a la definici&oacute;n
de "wizard" (brujo o mago) y no la de "hacker", siempre con alguna connotaci&oacute;n
en el l&iacute;mite de la legalidad. Lo dejo a su elecci&oacute;n.'
<H2>

<HR></H2>

<H2>
<A NAME="toc1"></A>1. <A HREF="cathedral-es-paper-01.html">La catedral
y el bazar</A></H2>

<H2>
<A NAME="toc2"></A>2. <A HREF="cathedral-es-paper-02.html">El correo debe
pasar</A></H2>

<H2>
<A NAME="toc3"></A>3. <A HREF="cathedral-es-paper-03.html">La importancia
de tener usuarios</A></H2>

<H2>
<A NAME="toc4"></A>4. <A HREF="cathedral-es-paper-04.html">L&aacute;nzalo
pronto, l&aacute;nzalo a menudo</A></H2>

<H2>
<A NAME="toc5"></A>5. <A HREF="cathedral-es-paper-05.html">&iquest;Cuando
una rosa deja de serlo?</A></H2>

<H2>
<A NAME="toc6"></A>6. <A HREF="cathedral-es-paper-06.html">Popclient se
convierte en Fetchmail</A></H2>

<H2>
<A NAME="toc7"></A>7. <A HREF="cathedral-es-paper-07.html">Fetchmail se
hace mayor</A></H2>

<H2>
<A NAME="toc8"></A>8. <A HREF="cathedral-es-paper-08.html">Algunas lecciones
m&aacute;s a partir de Fetchmail</A></H2>

<H2>
<A NAME="toc9"></A>9. <A HREF="cathedral-es-paper-09.html">Condiciones
previas necesarias para el modelo bazar</A></H2>

<H2>
<A NAME="toc10"></A>10. <A HREF="cathedral-es-paper-10.html">El contexto
social del software abierto</A></H2>

<H2>
<A NAME="toc11"></A>11. <A HREF="cathedral-es-paper-11.html">Agradecimientos</A></H2>

<H2>
<A NAME="toc12"></A>12. <A HREF="cathedral-es-paper-12.html">Lecturas adicionales</A></H2>

<H2>
<A NAME="toc13"></A>13. <A HREF="cathedral-es-paper-13.html">Historial
de versiones y cambios</A></H2>

<HR><A HREF="cathedral-es-paper-01.html">Siguiente</A> Anterior Indice
</BODY>
</HTML>
