<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>El Registro de la Propiedad Intelectual: Conceptos y definiciones </TITLE>
 <LINK HREF="Propiedad-Intelectual-Como-3.html" REL=next>
 <LINK HREF="Propiedad-Intelectual-Como-1.html" REL=previous>
 <LINK HREF="Propiedad-Intelectual-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Propiedad-Intelectual-Como-3.html">Página siguiente</A>
<A HREF="Propiedad-Intelectual-Como-1.html">Página anterior</A>
<A HREF="Propiedad-Intelectual-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="conceptos"></A> <A NAME="s2">2. Conceptos y definiciones </A></H2>

<P>
<P>
<H2><A NAME="ss2.1">2.1 Definiciones</A>
</H2>

<P>
<P>La propiedad intelectual de una obra literaria, art&iacute;stica o cient&iacute;fica
corresponde al autor por el s&oacute;lo hecho de crearla. Se considera autor a la
persona natural que crea alguna obra art&iacute;stica, cient&iacute;fica o literaria. Se
presumir&aacute; autor, salvo prueba de lo contrario, a quien aparezca como tal en la
obra, mediante su nombre, firma o signo que lo identifique. Cuando la obra
se divulgue en forma an&oacute;nima o bajo seud&oacute;nimo o signo, el ejercicio de los
derechos de propiedad intelectual corresponder&aacute; a la persona natural o
jur&iacute;dica que la saque a la luz con el consentimiento del autor, mientras
&eacute;ste no revele su identidad. La divulgaci&oacute;n de una obra es toda expresi&oacute;n
de la misma que, con el consentimiento del autor, la haga accesible por
primera vez al p&uacute;blico en cualquier forma.
<P>El objeto de la propiedad intelectual son las creaciones originales literarias,
art&iacute;sticas o cient&iacute;ficas expresadas por cualquier medio o soporte, tangible o
intangible, actualmente conocido o que se invente en el futuro.
<P>
<H2><A NAME="ss2.2">2.2 Derechos y Deberes</A>
</H2>

<P>
<P>La propiedad intelectual est&aacute; integrada por derechos de car&aacute;cter personal y
patrimoniales, que atribuyen al autor la plena disposici&oacute;n y el derecho
exclusivo de los derechos de explotaci&oacute;n de su obra en cualquier forma y, en
especial, los derechos de reproducci&oacute;n, distribuci&oacute;n, comunicaci&oacute;n p&uacute;blica y
transformaci&oacute;n, que no podr&aacute;n ser realizadas sin su autorizaci&oacute;n, salvo en los
casos previstos en la Ley.
<P>El derecho a la propiedad intelectual tiene unos l&iacute;mites. Las obras ya
divulgadas podr&aacute;n reproducirse sin autorizaci&oacute;n del autor en los siguientes
casos:
<P>
<UL>
<LI> Como consecuencia o para constancia en un procedimiento
judicial o administrativo.</LI>
<LI> Para uso privado del copista y siempre que la copia no sea
objeto de utilizaci&oacute;n colectiva ni lucrativa.</LI>
<LI> Para uso privado de invidentes.</LI>
</UL>
<P>Es l&iacute;cita la inclusi&oacute;n en una obra propia de fragmentos de obras ajenas de
naturaleza escrita, sonora o audiovisual, as&iacute; como la de obras aisladas de
car&aacute;cter pl&aacute;stico, fotogr&aacute;fico, figurativo o an&aacute;logo, siempre que se trate
de obras ya divulgadas y su inclusi&oacute;n se realice a t&iacute;tulo de cita o
an&aacute;lisis, comentario o juicio cr&iacute;tico. Tal utilizaci&oacute;n s&oacute;lo podr&aacute;
realizarse con fines docentes o de investigaci&oacute;n e indicando la fuente y el
nombre del autor de la obra utilizada.
<P>S&oacute;lo con el exclusivo fin de informar sobre la actualidad, se podr&aacute;n
reproducir, distribuir y comunicar las conferencias, alocuciones, informes
ante los Tribunales y otras obras del mismo car&aacute;cter que se hayan
pronunciado en p&uacute;blico.
<P>Los titulares de los derechos de autor no podr&aacute;n oponerse a las
reproducciones de las obras, cuando aquellas se realicen sin finalidad
lucrativa por los museos, bibliotecas, fonotecas, filmotecas, etc.
<P>Los derechos de explotaci&oacute;n de la obra durar&aacute;n toda la vida del autor y
setenta a&ntilde;os despu&eacute;s de su muerte o declaraci&oacute;n de fallecimiento.
<P>La extinci&oacute;n de los derechos de explotaci&oacute;n de las obras determinar&aacute; su
paso al dominio p&uacute;blico. Las obras de dominio p&uacute;blico podr&aacute;n ser utilizadas
por cualquiera, siempre que se respete la autor&iacute;a y la integridad de la
obra.
<P>
<H2><A NAME="ss2.3">2.3 Caracter&iacute;sticas</A>
</H2>

<P>
<P>El derecho de la propiedad intelectual tiene las siguientes
caracter&iacute;sticas:
<P>
<UL>
<LI> Los derechos de explotaci&oacute;n de la obra se transmiten, «mortis causa»,
por cualquiera de los medios admitidos en derecho.
</LI>
<LI> Tambi&eacute;n pueden transmitirse por actos «inter vivos».  La <I>Ley de
Propiedad Intelectual</I> legitima al titular de los derechos por ella reconocidos
para instar el cese de la actividad il&iacute;cita del infractor y exigir la
indemnizaci&oacute;n de los perjuicios materiales y morales causados.
</LI>
<LI> Podr&aacute;n ser objeto de inscripci&oacute;n en el Registro los derechos de
propiedad intelectual relativos a las obras y dem&aacute;s producciones protegidas por
la Ley de Propiedad Intelectual.
</LI>
<LI> El titular o cesionario en exclusiva de un derecho de explotaci&oacute;n sobre
una obra o producci&oacute;n protegidas por la Ley podr&aacute; anteponer a su nombre el
s&iacute;mbolo, &copy; con precisi&oacute;n del lugar y a&ntilde;o de la divulgaci&oacute;n de aquellas.</LI>
</UL>
<P>
<P>
<HR>
<A HREF="Propiedad-Intelectual-Como-3.html">Página siguiente</A>
<A HREF="Propiedad-Intelectual-Como-1.html">Página anterior</A>
<A HREF="Propiedad-Intelectual-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
