<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.1">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Webdesign">
 <TITLE>Webdesign : Evaluaci&oacute;n de Libros: HTML &amp; XHTML, O'Reilly</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><img src="../../common/images/Miguel-S.jpg" alt="[Photo of the Author]" width="129" height="168">
<BR>por  <a href="mailto:Miguel.Sepulveda@disney.com">Miguel A Sepulveda</a>
<BR><BR>
<I>Sobre el autor:</I><BR>
<p>
Miguel Angel fue fundador de LinuxFocus (actualmente se
encuentra &quot;retirado&quot;). Este suertudo indiv&iacute;duo
actualmente trabaja para la coorporaci&oacute;n Disney.
</p>
<P><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">El Libro</A></LI>
  <LI><A HREF="#lfindex1">Sinopsis del libro</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=187&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Evaluaci&oacute;n de Libros: HTML &amp; XHTML, O'Reilly</H2>
 <img src="../../common/images/illustration187.gif" alt="[Illustration]" hspace="10" width="145" height="190"><P><i>Resumen</i>:
<P>
<table bgcolor="#cbcbcb"><tr><td>T&iacute;tulo:</td><td>HTML &amp; XHTML</td></tr><tr><td>Autores:</td><td> Chuck Musciano &amp; Bill Kennedy </td></tr><tr><td> Editorial: </td><td>O'Reilly</td></tr></table><br>
Unos meses atras, cuando decid&iacute; actualizarme a HTML 4.0,
a las nuevas e incitantes caracter&iacute;sticas de las Hojas
en Estilo Cascada (Cascading Style Sheets, CSS) y a XHTML, el primer
paso que me propuse fu&eacute; el de encontrar un buen libro de referencia en
la materia. Puesto que ya ten&iacute;a un conocimiento previo de
HTML 3.0, yo quer&iacute;a algo que no fuera tan redundante, pero que
al mismo tiempo cubriera exhaustivamente todos los temas.

</P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>El Libro</H2>


<p>Es dif&iacute;cil encontrar buenos libros de temas tan populares
como estos, por que hay muchos libros malos.  Trat&eacute; de evitar
las "biblias" de mas de mil p&aacute;ginas, la mayor&iacute;a de ellas
desperdiciadas en ilustraciones y tablas de muy poca utilidad.</p>

<p>Como de costumbre O'Reilly no decepciona con su libro "HTML &amp;
XHTML" de Chuck Musciano y Bill Kenney.  Es un libro de f&aacute;cil lectura,
portable y compacto.   Para los que no necesitamos una gu&iacute;a
completa de referencia, este libro es de gran utilidad.  Viene
acompa&ntilde;ado por una tarjeta de referencia de tres paginas en
tama&ntilde;o. La tarjeta de referencia esta dise&ntilde;ada para que sea
f&aacute;cil de consultar la sintaxis y las opciones de los diversos tags
HTML & XHTML.</p>

<p>Los autores usaron los primeros siete cap&iacute;tulos para guiar
al lector a trav&eacute;s de los origenes del web y el HTML. Describen
todos los tags en una manera muy efectiva y sin perder de vista
lo que es realmente &uacute;til para el lector que busca escribir documentos
HTML.  Una y otra vez, Musciano y Kennedy enfatizan un punto que
muy comunmente el usuario novel olvida: que HTML es un lenguaje de marcas
desarrollado para dar formato a un <i>contenido</i> y no a <i>formas</i>.
 Yo personalmente he visto las dificultades que tiene la gente que
esta acostumbrada a la publicaci&oacute;n de sobremesa al tratar
de hacer de HTML un lenguaje de composici&oacute;n tipogr&aacute;fica
sin exito alguno, puesto que HTML no se dise&ntilde;o con eso en
mente. Musciano y sus colaboradores explican muy bien los origenes del
HTML y hacen que el lector entienda sus limitaciones. Tambien enfatizan
al contenido sobre la forma, de tal suerte que queda a cargo del
navegador el formato y la presentaci&oacute;n del documento apropiada.</p>


<p>El migrar del HTML versi&oacute;n 3.0 o anteriores a la
versi&oacute;n 4.01 es algo que requiere de ciertos trucos, especialmente
por que las grandes compa&ntilde;&iacute;as desarrolladoras de
navegadores en la actualidad han decidido implementar algo nuevo u
omitir partes del est&aacute;ndar. Existen tambien muchas extensiones
HTML de terceras partes que agregan complejidad a la mezcla.  En este
libro no es muy problem&aacute;tico el entender cu&aacute;l es la
diferencia de las versiones anteriores de HTML y la nueva 4.01.
 El lector encontrar&aacute; tambien buenas referencias de las
 extensiones mas usadas en los dos navegadores predominantes en la
 actualidad: Netscape e Internet Explorer.</p>


<p>Como se mencion&oacute; antes, HTML no fu&eacute; dise&ntilde;ado
con el formato del estilo de un documento en mente.  Fue desarrollado
principalmente por cient&iacute;ficos para facilitar el intercambio
de ideas a trav&eacute;s de una red local.  En cualquier caso, en la
actualidad las aplicaciones del HTML han excedido con creces las
espectativas de sus dise&ntilde;adores originales.  Por esta raz&oacute;n
el W3C (el organismo encargado del est&aacute;ndar HTML) agreg&oacute; a
HTML 4.0 las Hojas en Estilo Cascadas.  El c&aacute;pitulo 8 del libro
nos da una imprimaci&oacute;n muy facil de entender en el uso de estas
nuevas caracteristicas orientadas a la declaraci&oacute;n del estilo
para el formato del texto.  Se espera que las Hojas en Estilo Cascada
ayuden a una aproximaci&oacute;n de HTML a los lenguajes de composici&oacute;n
tipogr&aacute;fica.</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>Sinopsis del libro</H2>


<br>
T&iacute;tulo: HTML &amp; XHTML The Definitive Guide <br>
 (4a. Edici&oacute;n) <br>
<br>
Autores: Chuck Musciano &amp; Bill Kennedy <br>
<br>
Prefacio<br>
Cap&iacute;tulo 1: HTML, HTML y el WWW<br>
Cap&iacute;tulo 2: inicio r&aacute;pido<br>
Cap&iacute;tulo 3: Anatom&iacute;a de un documento HTML<br>
Cap&iacute;tulo 4: Texto b&aacute;sico<br>
Cap&iacute;tulo 5: Reglas, Imagenes y Multimedia<br>
Cap&iacute;tulo 6: Enlaces y Webs<br>
Cap&iacute;tulo 7: Formato de listas<br>
Cap&iacute;tulo 8: Hojas de Estilo Cascada<br>
Cap&iacute;tulo 9: Formas<br>
Cap&iacute;tulo 10: Tablas<br>
Cap&iacute;tulo 11: Marcos<br>
Cap&iacute;tulo 12: Contenido Ejecutable<br>
Cap&iacute;tulo 13: Documentos Dinamicos>br>
Cap&iacute;tulo 14: Dise&ntilde;o de extensiones de Netscape<br>
Cap&iacute;tulo 15: XML<br>
Cap&iacute;tulo 16: XHTML<br>
Cap&iacute;tulo 17: Trucos, Tips y Hacks<br> <!-- What do you say hack in spanish? -->
Ap&eacute;ndice A: Gram&aacute;tica del HTML<br>
Ap&eacute;ndice B: Referencia r&aacute;pida de etiquetas HTML/XHTML<br>
Ap&eacute;ndice C: Referencia r&aacute;pida de las propiedades de las Hojas en Estilo Cascada<br>
Ap&eacute;ndice D: Definici&oacute;n del Tipo de Documento (DTD) HTML 4.01<br>
Ap&eacute;ndice E: Definici&oacute;n del Tipo de Documento (DTD) XHTML 4.01<br>
Ap&eacute;ndice F: Entidades de Caracter<br>
Ap&eacute;ndice G: Nombres de Colores y sus Valores<!-- vim: set sw=2 ts=2 et: -->



<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=187&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Miguel A Sepulveda, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article187.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:Miguel.Sepulveda@disney.com"><FONT COLOR="#FFFFFF">Miguel A Sepulveda</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:estoy@ver.megared.net.mx"><FONT COLOR="#FFFFFF">Eduardo Morales Ch&aacute;vez</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-01-11, generated by lfparser version 2.1</font></p>
</BODY>
</HTML>
