<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>lf157, System Administration: Slackware 7.0 parte II: la Gu&iacute;a de la Configuraci&oacute;n </TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Home" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Map" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Index" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Search" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="News" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Archives" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Links" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="About LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-en.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-en.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Jeffry-D.jpg" WIDTH=200 HEIGHT=288 ALT="[Jeffry Degrande]">
<BR>by  <A HREF="mailto:suzuki@village.uunet.be">Jeffry Degrande</A>
<BR><BR>
<I>About the author:</I><BR>
<P>(no disponible) </P>
<BR><i>Content</i>:
<UL>
  <LI><A HREF="#lfindex0">Configurando Linux </A></LI>
  <LI><A HREF="#lfindex1">Configuraci&oacute;n de X </A></LI>
  <LI><A HREF="#lfindex2">Compilaci&oacute;n del kernel + el lilo </A></LI>
  <LI><A HREF="#lfindex3">Usuarios de Adding/removing </A></LI>
  <LI><A HREF="#lfindex4">Preparando una conexi&oacute;n de PPP/Internet </A></LI>
  <LI><A HREF="#lfindex5">Seguridad b&aacute;sica </A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=157&lang=en">Talkback form for this article</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Slackware 7.0 parte II: la Gu&iacute;a de la Configuraci&oacute;n </H2>
 <IMG SRC="../../common/images/illustration154.jpg" WIDTH=359 HEIGHT=120>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Abstract</i>:
<P>
<P>
&Eacute;sta es la segunda parte de esta serie. Despu&eacute;s de la instalaci&oacute;n en la parte I, el autor describe ahora un par de tareas de la configuraci&oacute;n b&aacute;sica de su distribuci&oacute;n favorita. &Eacute;l habla sobre la configuraci&oacute;n del gestor de ventanas X, administraci&oacute;n de usuarios, compilando el kernel, usando LILO, y algunos aspectos b&aacute;sicos de la seguridad del sistema.
</P><P>Es un art&iacute;culo para usuarios no-experimentados de Linux que desean aprender m&aacute;s sobre su sistema.
</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->

<P>&nbsp;</P>
<A NAME="lfindex0">&nbsp;</A>
<H2>Configurando Linux </H2>

<P>Al igual que en la primera parte, intento explicar c&oacute;mo conseguir un par de cosas hechas en Slackware 7.0. Porque &eacute;sta es ahora mi distribuci&oacute;n favorita, es la que yo mismo uso. </P>
<P>Yo (tratar&eacute;) explicar&eacute; lo siguiente: </P>

<UL>
<LI>Configuraci&oacute;n del gestor de ventanas X
<LI>compilaci&oacute;n del kernel + LILO
<LI>agregar/eliminar usuarios
<LI>conect&aacute;ndose a Internet
<LI>agregar una seguridad b&aacute;sica al sistema
</UL>

<P>Es toda la informaci&oacute;n que usted puede encontrar en muchos otros lugares, pero yo intentar&eacute; explicarlo usando las herramientas que proporciona la distribuci&oacute;n Slackware. </P>
<A NAME="lfindex1">&nbsp;</A>
<H2>Configuraci&oacute;n de X </H2>

<P>Yo asumo que usted ha instalado los paquetes para el sistema de ventanas X. Nosotros tambi&eacute;n asumimos, por ejemplo, que su rat&oacute;n est&aacute; trabajando ahora. Los problemas menores siempre pueden ocurrir y yo no puedo describirlos todos, porque yo no s&eacute; cuales son y simplemente hay demasiadas maneras (sin embargo, si&eacute;ntase libre de mandarme por correo aquellas que estime necesarias). Sigamos :) Para configurar X(gestor de ventanas), usted puede escoger entre dos programas en Slackware, <I>XF86Setup</I> o <I>XF86Config</I>. La diferencia principal es, que uno corre en la consola(modo texto) y el otro lo hace de manera gr&aacute;fica. La opci&oacute;n depende de usted :) </P>
<P>Nosotros usaremos <I>XF86Setup</I> (el gr&aacute;fico, y el m&aacute;s conveniente). Primero nosotros configuramos el rat&oacute;n. Normalmente, eliges simplemente el protocolo correcto y seleccionas como el dispositivo a <I>/dev/mouse</I>. Si usted no tiene 3 botones en su roedor, yo le aconsejo que use la opci&oacute;n "Emulate3buttons." (Esto se hace pulsando simult&aacute;neamente ambos botones, como si el bot&oacute;n del medio no existiese). </P>
<P>En la pr&oacute;xima pantalla usted escoge su esquema de teclado. Yo escojo "belga" y por supuesto especifico el tipo que tengo. Naturalmente esto es diferente para muchos de nosotros. Pulso el bot&oacute;n "Aplicar" y nosotros seguimos... </P>
<P>Ahora nosotros configuramos nuestra tarjeta de v&iacute;deo. Pulse el bot&oacute;n en "Card List" y busque su tarjeta. Pulse el bot&oacute;n "Detailed Setup" y verifica si todo est&aacute; bien. La mayor&iacute;a de las veces, es sufuciente con ponerlo todo en "Probed . Si todo est&aacute; configurado, nosotros vamos a la pr&oacute;xima pantalla que trata de su monitor. </P>
<P>Aqu&iacute; usted tiene que definir la m&aacute;xima resoluci&oacute;n que su pantalla puede manejar. Si duda, consulte el manual de la pantalla. En la pr&oacute;xima pantalla usted debe configurar la resoluci&oacute;n y la cantidad de colores que su tarjeta de v&iacute;deo puede manejar (Depende de la cantidad de memoria RAM de video que usted tenga). </P>
<P>En la &uacute;ltima pantalla, usted puede alterar algunas configuraciones est&aacute;ndar. Ellas son principalmente muy explicativas. Pulse el bot&oacute;n "Done" para volver a la consola. </P>
<P>Ahora, el gran momento. Tipee "startx" y esperemos que su ambiente gr&aacute;fico parta muy bien. </P>
<P>Usted puede cambiar a otro gestor de ventanas, revisando el archivo <I>.xinitrc</I> en su directorio <I>home</I>. (para usar KDE, por ejemplo, usted agrega "startkde".) Esto es diferente para cada gestor de ventanas, pero usted encontrar&aacute; en la documentaci&oacute;n todo lo que usted necesita.</P>
<P>Aviso: M&aacute;s informaci&oacute;n sobre configurar el gestor de ventanas X est&aacute; en los XFree86-HOWTO(Xfree86-Como) . </P>
<A NAME="lfindex2">&nbsp;</A>
<H2>Compilaci&oacute;n del kernel + el lilo </H2>

<P>Primero, aseg&uacute;rese usted de tener instaladas las fuentes del kernel. Las fuentes de la versi&oacute;n 2.2.13 pueden encontrarse en el cd. Usted puede instalarlas con <I>" installpkg packagex.tgz</I>" (tambi&eacute;n aseg&uacute;rese usted de instalar los archivos que incluye; ellos est&aacute;n en el mismo directorio). Las fuentes estar&aacute;n en <I>/usr/src/linux-2.2.13</I>. Usted tambi&eacute;n tiene <I>/usr/src/linux</I>; &eacute;ste es s&oacute;lo un eslace a linux-2.2.13, pero es bueno tenerlo (si usted perdiera el eslace por alguna raz&oacute;n, usted puede hacerlo con </P>

<PRE>ln -s /usr/src/linux-2.2.13 /usr/src/linux </PRE>

<P>Para configurar el kernel, usted va a <I>/usr/src/linux</I>. Ahora usted tiene tres opciones. Usted puede usar la interface X (<I>make xconfig</I>), usted puede hacerlo en la <I>consola (make menuconfig</I>), o usted puede hacerlo de la manera dura y s&oacute;lo tipee "<I>make config</I>." Usted tiene que hacer una de estas tres: "<I>make xconfig", " make menuconfig" o " make config."</I> </P>
<P>De ahora en adelante, la configuraci&oacute;n depende de usted. Mi sistema no est&aacute; igual que el suyo, es decir, quiz&aacute; usted tiene dispositivos SCSI, y yo no : - (.) Es imposible para m&iacute; decirle, lo que usted necesita o no necesita. Y existe siempre, por supuesto, la funci&oacute;n de ayuda que lo informa en todo. Estoy seguro que usted conoce bastante bien su sistema, para que &eacute;ste no pueda ser un problema real :).</P>
<P>Cuando usted lo haya hecho, cierre todo muy bien y en el prompt tipee lo siguiente: </P>
<PRE>
make dep
make clean           &lt; - yo no encuentro esto tan necesario para m&iacute;,
                           pero los libros dicen que usted tiene que hacerlo;
                           por supuesto, usted puede hacerlo como le guste
make bzlilo          &lt; - por supuesto aqu&iacute; hay otras opciones,
                           pero me gusta siempre hacer esto;le da un kernel
                           comprimido que es instalado enseguida por lilo.
make modules         &lt; - Si usted ha configurado alg&uacute;n material como
                           modules
make modules_install &lt; - si usted quiere realmente usar los m&oacute;dulos :) </PRE>
<P>Si &eacute;ste es su primera vez, entonces es mejor hacer cada paso como &eacute;l propio y verificar los mensajes del error. Si usted est&aacute; m&aacute;s seguro, entonces usted puede hacer lo siguiente:</P>
<PRE>  make dep bzlilo modules modules install </PRE>
<P>todo de una vez y va por una taza de caf&eacute; ;) </P>
<P>Configurar y compilar su propio kernel realmente no es m&aacute;s que eso. </P>
<P>Si usted usa bzlilo, se generan dos nuevos archivos: el <I>vmlinuz</I> y <I>System.map</I>. Si estos archivos ya existen, entonces las copias antiguas se renombrar&aacute;n a <I>vmlinuz.old</I> y <I>System.old</I>. Usted puede usarlos como un respaldo, como ser: </P>
<PRE>(en /etc/lilo.conf)
  image = /boot/vmlinuz.old
  root=/dev/hda5
  label = stable</PRE>
<P>Aviso: cualquiera configuraci&oacute;n como &eacute;sta, entra en <I>/etc/lilo.conf</I> primero y es la que determinar&aacute; el orden de la inicializaci&oacute;n (no ponga &eacute;sta en primer lugar...) </P>
<P>Un problema que he visto ocurrir un par de veces, es que <I>bzlilo</I> pone el <I>vmlinuz</I> y el <I>System.map</I> en / mientras <I>lilo.conf </I>apunta a <I>/boot/vmlinuz</I> (usted puede verlo en el config: la imagen =...) ahora hay dos posibilidades; o usted mueve <I>/vmlinuz </I>a <I>/boot/vmlinuz,</I> o solo resta que usted cambie <I>lilo.conf</I>. De cualquier modo, usted tendr&aacute; que ejecutar lilo despu&eacute;s de &eacute;l (tipee lilo). </P>
<P>Luego usted reinicie la m&aacute;quina y ahora usted estar&aacute; usando su nuevo kernel. (Usted puede verificar esto con <I>uname -a</I>) </P>
<P>Aviso: M&aacute;s informaci&oacute;n en el Kernel-HOWTO. </P>
<A NAME="lfindex3">&nbsp;</A>
<H2>Usuarios de Adding/removing </H2>

<P>Porque Linux es un sistema multiusuario, y porque constantemente trabajamos como superusuario, se aconseja a todos incluso a m&iacute; (un <I>usuario normal</I> tiene menos oportunidad para hecharlo abajo porque, simplemente &eacute;l no tiene el derecho para hecharlo abajo), nosotros agregaremos usuarios normales a nuestro sistema. Para hacerlo, Slackware ha proporcionado un peque&ntilde;o script muy bueno :</P>
<PRE># adduser

Login name for new user (8 car&aacute;cteres o menos) []: &lt; - Aqu&iacute; tipea un nuevo
                       nombre de ingreso
User Id for blaat [defaults to next available]:    &lt; - S&oacute;lo tipea INTRO
Initial group for blaat [users]:                   &lt; - El grupo del nuevo
                       usuario
Additional groups for blaat (separated with commas, no spaces) []:  &lt; - Los grupos adicionales
                       en que el usuario es  miembro de
blatt's home directory [/home/blaat]:              &lt; - El directorio <I>home</I>
                       (normalmente /home/username)
blaat's shell [/bin/bash]:                         &lt; - Su shell
blatt's account expiry date (YYYY-MM-DD) []:       &lt; - Cuando expira la cuenta (si usted no ingresa nada,
la cuenta no expira nunca)
</PRE>
<P>Entonces usted consigue alguna informaci&oacute;n resumida, donde puede escoger seguir (INTRO) o abandonar (CTRL-C). </P>
<PRE>Changing the user information for blaat
Enter the new value, or press return for the default
  Full Name []:                             &lt; - Su nombre
  Room number []:                           &lt; - Nro. de la oficina
  Work Phone []:                            &lt; - n&uacute;mero de tel&eacute;fono
  Home Phone []:                            &lt; - S&iacute;, haga tuu,tuu ;)
</PRE>

<P>Para terminar, usted tiene que darle una contrase&ntilde;a al nuevo usuario para que &eacute;l pueda ingresar. </P>
<PRE>
Changing password for blaat
Enter the new password (minimum of 5, maximum of 127 characters)
(ingrese la nueva contrase&ntilde;a :m&iacute;nimo 5 y m&aacute;ximo 127 caracteres)
Please use a combination of upper and lower case letters and numbers.
(Por favor use una combinaci&oacute;n de n&uacute;meros, letras may&uacute;sculas y min&uacute;sculas)
New password: &lt; - (Contrase&ntilde;a nueva)
Re-enter new password: &lt; - (Repita la contrase&ntilde;a)
Password changed. &lt; - (La contrase&ntilde;a ha cambiado)
Done... &lt; - (Hecho)
buffy login: blaat
Password:
Linux 2.2.14.
No mail.
I have seen the future and it is just like the present, only longer. -- --Kehlog Albran
(Yo he visto el futuro que es como el presente, s&oacute;lo que m&aacute;s largo-- Kehlog Albran)
buffy:~$ whoami &lt; - &iquest;D&oacute;nde estoy?
blaat
</PRE>

<P>Heyhey, tenemos un nuevo usuario ahora. </P>
<P>Usted puede quitar a los usuarios con "<I>userdel</I>" . El usuario ha sido removido del sistema!
<PRE>buffy:/var/log # userdel blaat
userdel: user blaat is currently logged in</PRE>
(Blaat se ha ido... digamos que le ayudamos un poco ;)
<PRE>buffy:/var/log# userdel blaat
buffy:/var/log#</PRE>
&iexcl;Y mire, la cuenta se ha ido! </P>

<A NAME="lfindex4">&nbsp;</A>
<H2>Preparando una conexi&oacute;n de PPP/Internet </H2>

<P>Esta secci&oacute;n es para aqu&eacute;llos que todav&iacute;a navegan con un m&oacute;dem tradicional. Cable y ISDN es algo yo no he tenido la oportunidad de configurar (~! &iexcl;@ $#la compa&ntilde;&iacute;a del cable! @ #$% ^ la compa&ntilde;&iacute;a del tel&eacute;fono!) <BR>
Tambi&eacute;n, yo asumo que usted est&aacute; usando un m&oacute;dem que es compatible con Linux. (CONSEJO PR&Aacute;CTICO: www.altavista.com "+type of modem +linux"). </P>
<P>Al configurar su slackware con conexi&oacute;n ppp tiene otro script. </P>
<PRE>  # pppsetup </PRE>
<P>En la primera pantalla usted tiene que ingresar el n&uacute;mero del tel&eacute;fono de su ISP(PSI), precedido por <I>atdt </I>o <I>atpt</I> (el ejemplo es anterior). </P>
<P>Luego se le pregunta &iquest;a qu&eacute; puerto se conecta su m&oacute;dem? (el nombre se lista al lado del de ms-dos). </P>
<P>Entonces se le pide la velocidad de su m&oacute;dem. Nosotros nos desplazamos un poco, pero al final nosotros escogeremos el valor m&aacute;s realista;). </P>
<P>Ahora, usted configurar&aacute; el <I>call back</I>(cobro revertido) si es que lo usa. Ponga esto en NO porque -que yo sepa - ning&uacute;n proveedor (belga) hace esto. (sin embargo, yo lo permitir&iacute;a, si es que lo quisieran;). </P>
<P>Si usted quiere poner otro <I>initstring</I>, entonces usted puede hacerlo en la pr&oacute;xima pantalla. Despu&eacute;s de eso, ingrese el nombre del dominio de su proveedor (es decir, uunet.be para el uunet, planetinternet.be para el planeta...) </P>
<P>Luego las direcciones IP de su proveedor del servidor de DNS. Esto lo puede encontrar usted en alguna parte, de alg&uacute;n modo (quiz&aacute;s en la configuraci&oacute;n de windblows?) </P>
<P>Luego usted escoge el tipo de autenticaci&oacute;n (pruebe con PAP, la mayor&iacute;a de los PSI lo apoyan a el, y usted realmente no quiere usar el script a menos que usted realmente lo necesite). </P>
<P>Ahora ponga el username(nombre del usuario)... </P>
<P>... y la contrase&ntilde;a(password). </P>
<P>Ahora usted tiene una apreciaci&oacute;n global de lo que ha pasado y qu&eacute; archivos han cambiado. </P>
<P>Usted puede empezar la conexi&oacute;n con </P>
<PRE>   #ppp-go </PRE>
<P>Descon&eacute;ctese con </P>
<PRE>   #ppp-off </PRE>
<A NAME="lfindex5">&nbsp;</A>
<H2>Seguridad b&aacute;sica </H2>

<P>Adem&aacute;s de haber preparado su sistema para que trabaje, tambi&eacute;n es importante tener alguna seguridad b&aacute;sica. Realmente no puedo tocar completamente este problema porque es demasiado amplio. Dir&iacute;jase al COMO de Seguridad(HOWTO-Security) (debe leerlo!) </P>
<P>Pero yo voy a decirle c&oacute;mo asegurarse de que nadie puede entrar del exterior. </P>
<P>Todos los servicios se realizan desde un tipo de "Superservidor", llamado <I>inetd</I>. Con el siguiente comando usted puede verificar qu&eacute; servicios est&aacute;n corriendo en su sistema: </P>
<P># <PRE>netstat -tua | grep LISTEN</PRE> </P>
<P>El <I>inetd</I> guarda sus configuraciones en <I>/etc/inetd.conf</I>. Abra este archivo con su editor favorito y usted ver&aacute; l&iacute;neas como estas </P>
<P># <PRE>telnet stream tcp nowait root /usr/sbin/tcpd in.telnetd</PRE></P>
<P>El #hash # del principio de la l&iacute;nea indica si un servicio est&aacute; activado o desactivado(abierto o cerrado). Si el hash(signo gato) est&aacute; all&iacute;, entonces el servicio est&aacute; deshabilitado. Si no est&aacute; all&iacute;, el servicio est&aacute; corriendo.</P>
<P>En la l&iacute;nea anterior (el demonio de telnet)tambi&eacute;n est&aacute; cerrado. Si estuviese </P>
<PRE>telnet stream tcp nowait root /usr/sbin/tcpd in.telnetd</PRE>
<P>Entonces los telnet estar&iacute;an corriendo. Pruebe </P>
<PRE>  #telnet localhost 23 </PRE>
<P>y ve lo que pasa. </P>
<P>As&iacute; que ponga un # en cada l&iacute;nea (si usted efectivamente necesita del servicio , entonces d&eacute;jelo abierto por supuesto!). </P>
<P>Empiece otra vez el inetd con esto: </P>
<PRE>  #killall -HUP inetd</PRE>
<P>Tipee de nuevo </P>
<PRE>  #netstat -tua |grep LISTEN </PRE>
<P>para verificar si se ejecutan los cambios realmente. </P>
<P>Dos archivos que usted tambi&eacute;n debe cambiar son <I>/etc/hosts.allow </I>y<I> /etc/hosts.deny</I>. </P>
<P>Cada vez que se realiza una conexi&oacute;n, se verifica el hosts.allow . Si la conexi&oacute;n se lista all&iacute;, entonces se verifica hosts.deny . Si no est&aacute; all&iacute;, la conexi&oacute;n se acepta. Por supuesto que esto no es eficaz. </P>
<P>&iquest;Ser&iacute;a mejor as&iacute;: est&aacute; en hosts.allow? &iquest;S&iacute;? Ok, ac&eacute;ptelo. &iquest;No? Lo siento, pero nosotros no lo aceptamos porque est&aacute; en el listado de hosts.deny. </P>

<P>Usted puede preparar esto, a&ntilde;adiendo esta l&iacute;nea a <I>/etc/hosts.allow</I>:
</P>
<DIR>
<PRE>ALL : 127.0.0.1 </PRE>&lt;- 127.0.0.1 es el dispositivo bucle, no vayas a bloquearte t&uacute; mismo!)
</P>
</DIR>

<P>en <I>/etc/hosts.deny</I> nosotros ponemos </P>
<PRE>  ALL : ALL </PRE>
<P>Nota: el formato del archivo tiene una sintaxis como esta: </P>
<PRE>&lt;service type&gt; : &lt;address&gt; </PRE>
ALL : ALL significa "todas las conexiones desde fuera del computador"
<P>Ahora las conexiones no son aceptadas f&aacute;cilmente.</P>
<P>&iexcl;Por supuesto, recuerda que esto es muy b&aacute;sico! T&uacute; necesitas hacer mucho m&aacute;s para realmente afianzar tu sistema. Como yo dije al comienzo de este cap&iacute;tulo, le aconsejo que lea el COMO de Seguridad(HOWTO-Security). </P>




<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Talkback form for this article</h2>
Every article has its own talkback page. On this page you can submit a comment or look at comments from other readers:
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=157&lang=en"><b>&nbsp;talkback page&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Webpages maintained by the LinuxFocus Editor team</A>
<BR><FONT COLOR="#FFFFFF">&copy; Jeffry Degrande, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=en&article=article157.html" target="_TOP">Click here to report a fault or send a comment to LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>nl</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:suzuki@village.uunet.be"><FONT COLOR="#FFFFFF">Jeffry Degrande</FONT></a></font></td>
</tr>
<tr><td><font size=2>nl</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>en</font></td>
    <td><font size=2><a href="mailto:floris.lambrechts@linuxfocus.org"><FONT COLOR="#FFFFFF">Floris Lambrechts</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:iv_nr@hotmail.com"><FONT COLOR="#FFFFFF">Iv&aacute;n Rojas</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-02-06, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
