<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.1">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>System Administration :  Herramientas de seguridad</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="[Photo of the Author]" HEIGHT=124 WIDTH=115>
<BR>por  <A HREF="mailto:georges.t@linuxfocus.org">Georges Tarbouriech</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Georges es un usuario viejo de Unix (comercial y libre). Las herramientas de
seguridad libres le interesan mucho y aprecia de verdad sus grandes cualidades.
</P>
<P><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Herramientas genericas</A></LI>
  <LI><A HREF="#lfindex1">Firewall</A></LI>
  <LI><A HREF="#lfindex2">Escanneres de puertos</A></LI>
  <LI><A HREF="#lfindex3">Sistemas de detecci&oacute;n</A></LI>
  <LI><A HREF="#lfindex4">Encriptaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex5">Scripting</A></LI>
  <LI><A HREF="#lfindex6">&iquest;Entonces qu&eacute;?</A></LI>
  <LI><A HREF="#lfindex7">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=180&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2> Herramientas de seguridad</H2>
 <IMG SRC="../../common/images/illustration180.gif" HSPACE=10><P><i>Resumen</i>:
<P>
<p>
Seguridad siempre fue de lo m&aacute;s importante para los administradores
de sistemas. Sin embargo, con la "explosi&oacute;n" del Internet, el riesgo de
intrusi&oacute;n se ha vuelto a&uacute;n m&aacute;s alto.
Seg&uacute;n la estad&iacute;stica, si el n&uacute;mero de usuarios conectados
crece, el n&uacute;mero de piratas sigue el mismo incremento. Por consecuencia,
el desarrollo de software de seguridad ha crecido exponencialmente. Otra vez,
gracias a la comunidad del software libre, puesto que nos han proporcionado las
mejores herramientas nunca vistas y con mucha documentaci&oacute;n.
<br>
Encontrar&aacute;n muchos enlaces interesantes en la parte referencias al final
del art&iacute;culo. Claro que lo que vamos a mencionar aqu&iacute; no puede ser
exhaustivo. Las herramientas elegidas son las usadas diariamente o las que han
sido probadas.
<br>
Este art&iacute;culo se dedica tanto a los usuarios personales como a los
administradores de sistemas, puesto que unas herramientas conciernen la
protecci&oacute;n de maquinas y otras sirven para mejorar la seguridad de redes.
<br>
La mayor&iacute;a de &eacute;stas herramientas funcionan en muchos sabores de Unix (si
no todos), ya sean comerciales o libres. Por &uacute;ltimo, &eacute;ste
art&iacute;culo no es un "C&oacute;mo mejorar la seguridad de su red o de su
m&aacute;quina" sino una presentaci&oacute;n de diferentes herramientas que
pueden (tienen que) utilizar para mejorar la seguridad de dicha red o
m&aacute;quina.
</p></P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Herramientas genericas</H2>

<p>
Podr&iacute;amos llamar &eacute;sta parte "herramientas para whitehats (los
administradores) para proteger redhat contra los blackhats (los piratas)"
:-) Muchas distribuciones de Linux (no solo RedHat!) llegan con muchas buenas
herramientas de seguridad. Pueden usarlas para mejorar la seguridad de su
ordenador.
Entre ellas, podemos mencionar TCPWrappers, PAM (Pluggable Authentication Modules),
shadow utilities... Puesto que forman parte de las distribuciones encontrar&aacute;n
mucha documentaci&oacute;n: HOWTO, man pages, ...; de modo que no vamos a pasar
mucho tiempo con ellas.
<br>
Empezemos con los <strong>shadow utils</strong>. Brevemente, permiten la
encrypci&oacute;n de passwords. El fichero /etc/shadow remplaza el
fichero /etc/passwd.
<br>
Algo m&aacute;s elaborado es <strong>PAM</strong>. Como lo dice su nombre, es
otro modo de autentificaci&oacute;n. PAM permite de limitar el acceso de los
usuarios a los servicios. Muchas restricciones pueden ser definidas a partir de
ficheros de configuraci&oacute;n, facilitando as&iacute; la administraci&oacute;n.
Normalmente, estos ficheros se encuentran en el directorio /etc/pam.d.
<br>
Respecto a los <strong>TCPWrappers</strong>, basta con decir que permiten reducir el
acceso a los servicios de unas m&aacute;quinas. Pueden ser autorizados o rechazados desde
dos ficheros: /etc/hosts.allow y /etc/hosts.deny. Los TCPWrappers pueden ser configurados
de dos maneras: sea moviendo los "daemons" o modificando el fichero /etc/inetd.conf.
Si TCPWrappers no forman parte de su sabor de Unix, pueden encontrarlos en
<a href="ftp://ftp.porcupine.org/pub/security">ftp://ftp.porcupine.org/pub/security</a>
</p>

<p>
Y ahora, van a entender por qu&eacute; no hemos hablado mucho de esas herramientas:
Hay una herramienta es cap&aacute;z de manejar todo eso y al mismo tiempo
ense&ntilde;ar al usuario. <strong>Bastille-Linux</strong> basta y sobra.
Si s&oacute;lo instalan una herramienta, &iexcl;tiene que ser &eacute;sta! No forma parte (a&uacute;n?)
de las distribuciones pero pueden descargarlo desde
<a href="http://bastille-linux.sourceforge.net">http://bastille-linux.sourceforge.net</a>
<br>
De hecho, &iexcl;&iexcl;&iexcl;tampoco diremos nada de Bastille-Linux!!! Es in&uacute;til puesto que
hay un excelente art&iacute;culo sobre &eacute;l de mi compadre Fr&eacute;d&eacute;ric en el n&uacute;mero
de Septiembre de Linux<font color="#FF0000">Focus</font>: lo dice todo. Si todav&iacute;a no lo han leido, pueden echar
un vistazo <a href="../September2000/article166.shtml">aqu&iacute;</a>.
<br>
&iexcl;Podemos a&ntilde;adir que Bastille-Linux es una herramienta sin la que no se puede
vivir!
</p>

<p>
Otra herramienta para mejorar la seguridad se llama <strong>xinetd</strong>. Se
puede descargar desde <a href="http://www.xinetd.org/">http://www.xinetd.org</a>.
Y, perd&oacute;n, pero &iexcl;&iexcl;&iexcl;tampoco vamos a hablar de &eacute;ste!!! Otra vez, Fr&eacute;d&eacute;ric ha
hecho todo el trabajo en el n&uacute;mero de Noviembre de Linux<font color="#FF0000">Focus</font>.
Pueden leerlo <a href="../November2000/article175.shtml">aqu&iacute;</a>.
<br>
Esto era la secci&oacute;n FredFocus (no te preocupes del dinero Fred, puedo esperar).
</p>

<p>
Ahora, vamos a ver algunas herramientas espec&iacute;ficas.
</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>Firewall</H2>

<p>
Los Unix libres llegan con herramientas que permiten transformar su m&aacute;quina
en un firewall. El kernel 2.2 provee <strong>ipchains</strong>. El anterior (2.0)
usaba <strong>ipfwadm</strong>. Para que ipchains o ipfwadm funcionan, el kernel
tiene que ser compilado con  opciones particulares. Existe mucha documentaci&oacute;n
sobre el asunto (HOWTOs por ejemplo), y no vamos a decir mucho m&aacute;s.
<br>
Brevemente, un firewall es una herramienta para filtrar paquetes. Lo m&aacute;s
importante concierne su configuraci&oacute;n. Es decir, un firewall mal configurado
se puede volver muy peligroso. Sin embargo, firewalls son herramientas muy importantes
y hay muchos. Por ejemplo, Bastille-Linux provee un firewall basado tambi&eacute;n en
ipchains.
</p>

<p>
Si visitan <a href="http://www.linuxapps.com">http://www.linuxapps.com</a> y
escriben "firewall" en el campo de b&uacute;squeda, obtendr&aacute;n por lo menos 40
respuestas. Muchos son GUI para la administraci&oacute;n de ipchains o ipfwadm.
Otros son herramientas muy gordas con toneladas de opciones, tal como T.REX por
ejemplo, disponible desde
<a href="http://www.opensourcefirewall.com">http://www.opensourcefirewall.com</a>.
Otra vez, no se dejen enga&ntilde;ar: un firewall es una necesidad en una red, pero la
seguridad de &eacute;sta red no puede SOLAMENTE depender de &eacute;l. Un pirata puede
romperlo en &iexcl;alrededor de 15 minutos! Pueden darse por enterados.
</p>

<A NAME="lfindex2">&nbsp;</A>
<H2>Escanneres de puertos</H2>

<p>
Aqu&iacute; entramos en el coraz&oacute;n del problema. La idea es: utilizar
las herramientas de los piratas para controlar las vulnerabilidades de la red (o
de la m&aacute;quina). En &eacute;ste &aacute;rea podemos beneficiar de dos herramientas
muy buenas pero hay muchas otras.
</p>

<p>
La primera se llama <strong>nmap</strong>. Pueden descargarla desde
<a href="http://www.insecure.org">http://www.insecure.org</a>. A&uacute;n m&aacute;s,
encontrar&aacute;n all&iacute; mucha informaci&oacute;n, enlaces, etc. Con nmap,
pueden controlar los puertos abiertos en una m&aacute;quina de la red. Claro, pueden
hacer eso con comandos tales como lsof o netstat pero solamente en su propia
m&aacute;quina. Y, tambi&eacute;n pueden controlar su propia m&aacute;quina con nmap.
nmap puede dar mucha informaci&oacute;n: por ejemplo, puede decir cual es el SO
funcionando, cuales son los puertos abiertos y peligrosos... Por fin, nmap es muy
f&aacute;cil de utilizar. Se puede arrancar desde un shell o desde un interfaz
gr&aacute;fico llamado nmapfe. Este GUI se basa en la librer&iacute;a gtk. La versi&oacute;n
actual de nmap es 2.53. Funciona bajo muchos sabores de Unix y se encuentra en
c&oacute;digo fuente, rpm, con GUI o sin &eacute;l. &iexcl;nmap es otra herramienta sin la
que los administradores no pueden vivir!
<br>
Muchas gracias Sr. Fyodor y felicitaciones por &eacute;ste gran trabajo.
</p>

<p>
La segunda se llama <strong>nessus</strong>. Se puede descargar desde
<a href="http://www.nessus.org">http://www.nessus.org</a>, con enlaces mandando hacia
ftp en differentes pa&iacute;ses.  Nessus funciona seg&uacute;n la arquitectura
cliente/servidor y el c&oacute;digo fuente Posix se puede usar en muchos sabores de
Unix. Tambi&eacute;n existe un cliente para Win32 (para que lo sepan). Nessus depende
de nmap (&iexcl;vean c&oacute;mo no pueden hacer nada sin &eacute;l!) y de la librer&iacute;a gtk por su GUI.
La versi&oacute;n actual es 1.06 y con ella pueden controlar una red completa
con un par&aacute;metro, es decir las se&ntilde;as de la red. Por ejemplo, teclar
192.168.1.0/24 en el campo "target" controlar&aacute; las 255 m&aacute;quinas de
&eacute;sta red. Nessus es un poco m&aacute;s complejo que nmap, pero es f&aacute;cil de usar
y tiene muchas opciones. Por ejemplo, puede crear informes, puede hacer "diffs"
entre informes... Otra caracter&iacute;stica es muy interesante: nessus propone
soluciones a los problemas encontrados durante un "portscan". Si se trata de
m&aacute;quinas Unix, las sugerencias son buenas a menudo. Ser&aacute;n un poco
menos adecuados para otros SO. De todo modos, no es eso lo importante. Aqu&iacute;
est&aacute; el ejemplo de una m&aacute;quina muy vulnerable:
<br>
<A HREF="../../common/images/article180/nessus.jpg"><IMG SRC="../../common/images/article180/nessusth.jpg" ALT="nessus.jpg" HEIGHT=150 WIDTH=200 ALIGN=TEXTTOP></A>
<br>
Nessus tiene otra gran particularidad: trabaja con plugins, as&iacute;
permitiendo una puesta al d&iacute;a cada vez que un nuevo agujero de seguridad
se encontr&oacute; en alg&uacute;n sitio. &iexcl;Otra herramienta necesitada por los
administradores!
<br>
Muy buen trabajo Mr. Deraison y "Merci beaucoup".
</p>

<p>
Las dos herramientas han sido probadas desde una m&aacute;quina Linux en una red
con varios SO: Linux&nbsp;RH&nbsp;6.2, Irix&nbsp;6.5.7, Solaris&nbsp;2.6, NeXTStep&nbsp;3.3,
QNX&nbsp;RT, BeOS&nbsp;5.0, Amiga&nbsp;OS&nbsp;3.5, No&nbsp;Terminado&nbsp;4.0. Los
resultados son impresionantes para la mayor&iacute;a de las plataformas. Claro, el
Amiga&nbsp;OS no se identifica muy bien (&iexcl;puesto que se ve como una impresora o un
router!) pero &iquest;qui&eacute;n tiene todav&iacute;a &eacute;ste SO en una red (aparte de m&iacute;)?
</p>

<p>
En cualquier caso, &eacute;stas herramientas parecen inevitables con las redes de hoy. Y
para acabar con &eacute;sta parte, tenemos que mencionar otras herramientas tales como SARA
<a href="http://www-arc.com/sara/">http://www-arc.com/sara/</a>, o su "padre" SATAN
<a href="http://www.porcupine.org/satan/">http://www.porcupine.org/satan/</a>,
o SAINT <a href="http://www.wwdsi.com">http://www.wwdsi.com</a>. No son
solamente "portscanners" y pueden ser muy &uacute;tiles para mejorar la seguridad de
las redes.
</p>

<A NAME="lfindex3">&nbsp;</A>
<H2>Sistemas de detecci&oacute;n</H2>


<p>
Algunas herramientas pueden detectar "portscans" o intrusiones. Un administrador
"standard" (es decir, &iexcl;paranoico!) NO puede trabajar sin &eacute;sta categor&iacute;a de
herramientas.
</p

<p>
La primera serie de herramientas viene del <strong>Proyecto Abacus</strong>, y
pueden obtenerlas desde <a href="http://www.psionic.com">http://www.psionic.com</a>.
Tres herramientas est&aacute;n disponibles: logcheck, portsentry y hostsentry. Logcheck
est&aacute; en versi&oacute;n 1.1.1, portsentry es 1.0 y hostsentry es la versi&oacute;n
0.0.2 alpha. <strong>Portsentry</strong> es una herramienta de detecci&oacute;n de
"portscan". Como dice su nombre, cuando un puerto es "scanned" desde alguna parte,
portsentry bloquea el host en seguida, ya sea "cerrando" la ruta con el firewall
(o una direcci&oacute;n IP no utilizada), ya sea escribiendo la direcci&oacute;n IP del atacante
en el fichero /etc/hosts.deny si tienen TCPWrapper en su m&aacute;quina. &iexcl;El resultado
es eficaz de verdad! Portsentry se basa en un fichero de configuraci&oacute;n principal
y en unos ficheros espec&iacute;ficos. Estos &uacute;ltimos se usan para ignorar unos
"hosts" (es decir para no bloquearlos) o para bloquear unos puertos de unos "hosts".
Desde el fichero de configuraci&oacute;n, pueden definir la manera de trabajar
de portsentry. Tienen que elegir los puertos que quieren atar a portsentry,
puertos TCP o UDP (o ambos). &iexcl;Cuidado con atar el puerto 6000 si usan X11!
Seg&uacute;n el sistema Unix que usan, pueden tener dos modos de operaci&oacute;n
para vigilar los puertos. El modo avanzado s&oacute;lo funciona en Linux (por el momento).
Despu&eacute;s tienen que decidir de la opci&oacute;n de bloqueo: no bloquean los "scans",
los bloquean, o ejecutan un comando externo. Siguen eligiendo la manera de "echar" la
ruta, sea redirigiendo el atacante hacia una direcci&oacute;n IP no utilizida en la red, sea
hacia un filtro de paquetes (firewall). La etapa siguiente concierne TCPWrappers. Es
decir, deciden (o no) escribir un texto DENY en el fichero /etc/hosts.deny. Por fin,
pueden definir un comando externo para ejecutar y pueden elegir un
valor por el scan (por defecto es 0; 1 o 2 permiten reducir alarmas falsas).
&iexcl;Es todo lo que tienen que hacer! Suponemos que ya saben todo sobre logging,
puesto que, claro, todas las alarmas se escriban en los logs. Significa que
pueden modificar el fichero syslog.conf si quieren que las alarmas sean
dirigidas hacia otro lugar que /var/log/messages o /var/log/syslog o /var/adm/messages...
Ahora pueden arrancar portsentry en tarea de fondo con la opci&oacute;n
preferida. Las opciones disponibles depienden del sistema: podr&aacute;n usar
-tcp, -udp en la mayor&iacute;a de los Unixes y -atcp, -audp bajo Linux ("a" por
avanzado).
<br>
Echen un vistazo al resultado si escannen una m&aacute;quina en la cual
portsentry funciona.
<br>
<IMG SRC="../../common/images/article180/nmapg.jpg">
<br>
Si eres un sysadmin que mira los logs una vez a la semana (mejor ser&iacute;a
probar otro empleo) el proyecto Abacus te propone otra herramienta llamada
<strong>logcheck</strong>.  Se arranca desde una tarea cron y manda un correo
al administrador si encuentra algo extra&ntilde;o en los logs.
<br>
La &uacute;ltima herramienta de la serie se llama <strong>hostsentry</strong>
y parece muy interesante pero no la he probado. Si quieren una herramienta buena,
sencilla y eficaz, &iexcl;usen portsentry!
<br>
Gracias Sr. Rowland: &iexcl;un gran trabajo! A prop&oacute;sito, me gusta mucho su
humor.
</p>

<p>
Otra herramienta sin la cual sysadmins no pueden trabajar se llama <strong>snort</strong>.
snort es un IDS (sistema de detecci&oacute;n de intrusi&oacute;n) y m&aacute;s
concretamente, un IDS ligero (no una f&aacute;brica!). Pueden obtener snort versi&oacute;n
1.6.3 desde <a href="http://www.snort.org">http://www.snort.org</a>. Funciona en cualquier
plataforma cap&aacute;z de usar libpcap. Este &uacute;ltimo se requiere para utilizar
snort. A prop&oacute;sito, tambi&eacute;n tienen una versi&oacute;n de snort para Win32.
Snort es cap&aacute;z de analizar el tr&aacute;fico IP y provee un logging muy fuerte.
Se basa en scripts de reglas, es decir que pueden vigilar lo que quieran.
A&uacute;n m&aacute;s, el site de snort provee un base de datos de reglas.
Aqu&iacute; llega la decisi&oacute;n importante con snort: d&oacute;nde poner los
sensores, o si prefieren, qu&eacute; clase de tr&aacute;fico quieren vigilar. Llegando,
saliendo, dentro del firewall, fuera del firewall... Podr&iacute;amos sugerir
&iexcl;&iexcl;&iexcl;en todas partes!!! En serio, es como quieran, pero otra vez, seg&uacute;n los sysadmins
"standard", lo m&aacute;s lo mejor...
Ahora que han decidido d&oacute;nde quer&iacute;an escuchar, tienen que elegir las
reglas que aplicar. Snort llega con muchas reglas basicas: backdoor, ddos, finger, ftp...
Estas reglas se definen en los ficheros snort-lib. Otra vez, pueden obtener
nuevas reglas y reglas puestas al d&iacute;a desde el site de snort.
Desde aqu&iacute; basta con arrancar snort en tarea de fondo (por ejemplo), con
las opciones elegidas. En &eacute;ste caso, para ejecutar snort como un daemon, la
opci&oacute;n ser&iacute;a -D. Tambi&eacute;n pueden definir a donde va el logging
puesto que se puede redirigir, incluso hacia otra m&aacute;quina.
Es imposible mencionar todas las caracter&iacute;sticas de snort en &eacute;ste
art&iacute;culo. La documentaci&oacute;n les ense&ntilde;ara mucho.
De todo modos, snort es otra herramienta que NO se puede trabajar sin ella. Es una
gran, gran herramienta.
<br>
Muchas gracias Sr. Roesch.
</p>

<p>
Otras herramientas libres existen: podemos mencionar <strong>AIDE</strong> a
<a href="http://www.cs.tut.fi/~rammer/aide.html">http://www.cs.tut.fi/~rammer/aide.html</a>
por ejemplo.
</p>

<A NAME="lfindex4">&nbsp;</A>
<H2>Encriptaci&oacute;n</H2>

<p>
Muchas herramientas forman parte del proceso de encriptaci&oacute;n,
funcionando en varias &aacute;reas. No podremos hablar de todas. Sin embargo,
por lo menos, tenemos que decir unas palabras sobre <strong>SSH</strong>,
particularmente la versi&oacute;n libre <strong>OpenSSH</strong>. Pueden
obtenerla desde <a href="http://www.openssh.com">http://www.openssh.com</a>. La versi&oacute;n
actual es 2.3.0. Este producto fue desarrollado primero para funcionar bajo
OpenBSD. Hoy, funciona bajo muchos sabores de Unix.
OpenSSH reemplaza telnet y los "remote commands" tales como rsh, rlogin.
Incluye scp que remplaza ftp y rcp. OpenSSH permite la encriptaci&oacute;n de
los datos circulando por la red. Telnet, rsh, etc. transfieren los datos en plano
&iexcl;y eso vale para los passwords!
Es decir, no tendr&iacute;an que usar m&aacute;s dichas herramientas esas, sino
OpenSSH en vez de ellas. &iexcl;Eso tendr&iacute;a que ser una obligaci&oacute;n!
(A veces, tenemos que ser un poco fascistas:-)
</p>

<p>
El problema con estas herramientas viene de las leyes sobre encriptaci&oacute;n
de los diferentes los paises. Las cosas est&aacute;n cambiando, pero en muchos pa&iacute;ses
no se pueden usar libremente &eacute;stas herramientas. Por ejemplo, hace un rato, se
consideraba como esp&iacute;a a aquel que usaba SSH en un pa&iacute;s tal como
Francia (&iexcl;&iexcl;&iexcl;pa&iacute;s de los Derechos Humanos, dec&iacute;an!!!). Por suerte,
no es verdad hoy. Sin embargo, recomendamos leer un documento importante sobre
la situac&oacute;n en los diferentes paises. Lo encontrar&aacute;n en
<a href="http://www2.epic.org/reports/crypto2000/countries.html">http://www2.epic.org/reports/crypto2000/countries.html</a>.
<br>
No obstante, la encriptaci&oacute;n es una cosa importante para la seguridad y
muchas herramientas tienen que ser tomadas en cuenta. Podemos mencionar
<strong>OpenSSL</strong> (Secure Sockets Layer)
<a href="http://www.openssl.org">http://www.openssl.org</a>, o <strong>Strong
Crypto</strong>, un VPN (red privada virtual) de fuente abierta para Linux en
<a href="http://www.strongcrypto.com">http://www.strongcrypto.com</a>.
VPN es otra soluci&oacute;n que merecer&iacute;a un art&iacute;culo entero (como
muchas de las herramientas mencionadas m&aacute;s arriba!), y por eso no
hablaremos m&aacute;s en el asunto.
<br>
Claro, no podemos olvidar de mencionar OpenPGP (Pretty Good Privacy) disponible en
<a href="http://www.ietf.org/html.charters/openpgp-charter.html">http://www.ietf.org/html.charters/openpgp-charter.html</a>
o GNUpg desde <a href="http://www.gnupg.org">http://www.gnupg.org</a>.
</p>

<A NAME="lfindex5">&nbsp;</A>
<H2>Scripting</H2>

<p>
Aqu&iacute;, no podemos hablar de herramientas. El scripting es una de las
aptitudes m&aacute;s importantes para un sysadmin. Scripts Shell, Perl... hacen
parte del trabajo diario para la gente que administra redes.
Los scripts sirven para automatizar tareas pero tambi&eacute;n para vigilar la
seguridad. Cada sysadmin tiene sus necesidades, entonces siempre trata de
cumplir con ellas de la manera que le conviene. No es siempre tan f&aacute;cil.
Algo puede ayudar: &iexcl;suscribanse a la revista Sysadmin!
Esta revista esta hecha por sysadmins para sysadmins y proporciona muchos programas o
scripts... Incluso, pueden obtener un CDRom conteniendo todos los n&uacute;meros
anteriores, y claro con los programas o scripts.
Eso no es publicidad... es una manera de encontrar m&aacute;s soluciones para
mejorar la seguridad.
Echen un vistazo a <a href="http://www.samag.com">http://www.samag.com</a>.
<br>
Si eres un sysadmin, tendr&iacute;as que probarlo. Bueno, s&oacute;lo es una sugerencia.
</p>

<A NAME="lfindex6">&nbsp;</A>
<H2>&iquest;Entonces qu&eacute;?</H2>

<p>
Hay mucho que a&ntilde;adir sobre seguridad, pero como hemos dicho antes, &eacute;ste
art&iacute;culo no es un "C&oacute;mo mejorar la seguridad de su red". No
bastar&iacute;a con un libro en el asunto. La seguridad no solo depende de
herramientas, sino tambi&eacute;n es un comportamiento. Por ejemplo, con unos de estos
comportamientos me vuelvo loco (claro, &iexcl;ya lo estaba!). &iquest;Cuando entendr&aacute;
la gente que los ficheros de M$ Office son peores que bombas? No solo
tienen tama&ntilde;os enormes, sino que est&aacute;n potencialmente llenos de macroviruses.
Por favor usuarios Wintel, NO MANDEN documentos Word o Excel junto a sus
correos. A&uacute;n m&aacute;s, si reciben algunos NO LOS ABRAN: s&oacute;lo es una
sugerencia, &iexcl;pero han sido avisados! Son tan peligrosos (tendr&iacute;a que decir
m&aacute;s!) como los ejecutables que reciben (o descargan). Y, a prop&oacute;sito,
ficheros texto o HTML son mucho m&aacute;s peque&ntilde;os que los documentos de
Office, y NO son peligrosos.
Claro, ya s&eacute; que el mundo Wintel trabaja de &eacute;sta manera: cuando bajan una
demo, siempre es un ejecutable! Podemos suponer que se puede tener confianza
en &eacute;stas empresas gordas... pero &iquest;saben lo que ha podido pasar con el arca que
descargan? Claro que es una manera paranoica de pensar, pero &iquest;es esto tan loco?
&iquest;Por qu&eacute; piensan que muchos arcas tienen un checksum para averiguar autenticidad?
</p>

<p>
Lo que sigue puede "enfadar" mucha gente, pero es un hecho: JAVA es peligroso.
Los applets no son seguros, los scripts Java no son seguros. Sin embargo,
&iexcl;ser&iacute;a interesante saber cuantos sites web no usan Java! A&uacute;n peor,
Java es una fuente de problemas cuando visitan &eacute;stos sites: &iquest;cuantos entre
ellos van a helar el navegador? &iquest;Es este el objetivo de un site web?
Y no hablemos de ActiveX, del ej&eacute;rcito de Redmond!
<br>
Sugerencia: usen Rebol en su lugar
(<a href="http://www.rebol.com">http://www.rebol.com</a>)
</p>

<p>
Puesto que hablamos del asunto: por favor, nuevos "profesionales" de Internet,
&iexcl;paren de crear sites web dedicados al mundo Wintel y IE5! Ya s&eacute; que estas cosas son
muy generalizadas, no obstante mucha gente se conecta al Internet con muchos SO
y navegadores diferentes. Trabajando como lo hacen, impiden que estos usuarios
visitan sus sites web. El objetivo de Internet es compartir. Usar cosas
propietarias es absurdo. En mi humilde opini&oacute;n, cuando se crea un site
web, la primera cosa que hacer es probarlo con varios SO y diferentes
navegadores... pero solo es mi opini&oacute;n. Una informaci&oacute;n: si se
conectan sobre tal site con una m&aacute;quina Unix y por ejemplo Netscape, &iexcl;no
pueden visualizar ni la p&aacute;gina de indice!
<br>
Perd&oacute;n por la digresi&oacute;n.
</p>

<p>
Otro punto importante es de recordar que la seguridad no alcanzar&aacute; el 100%.
Estamos muy lejos de eso. Pueden mejorarla, pero eso es todo. Por ejemplo,
pueden usar todas las herramientas mencionadas aqu&iacute; y dejar una puerta de
atr&aacute;s muy abierta! No se dejen burlar: los piratas no van a tratar primero de
romper una clave de 128bit, sino que van a buscar un peque&ntilde;o agujero en alguna
parte. As&iacute; cuidado con programas SUID o SGID, con derechos de acceso, con
servicios in&uacute;tiles, con accounts cancelados, etc.
<br>
Si bien los sabores de Unix tienen muchas semejanzas, son muy diferentes por lo que
concierne seguridad. &iexcl;Unos parecen coladores! Tambi&eacute;n tienen que saberlo. No
hablemos de otros SO o asimilados. Por ejemplo, tener una conexi&oacute;n a
Internet con el cable usando una m&aacute;quina Winalgo standard es estupendo:
es decir que pueden tener el icono de la m&aacute;quina del pirata en la
vecindad de red... y pronto M$ proveer&aacute; la foto del pirata! (Es broma...)
<br>
El camino hacia la seguridad de redes y ordenadores es muy largo. Si le
interesa &eacute;se asunto, aprender&aacute;n cada d&iacute;a. Por suerte, tenemos
muchas fuentes de informaci&oacute;n. Aqu&iacute; tienen algunas.
</p>

<A NAME="lfindex7">&nbsp;</A>
<H2>Referencias</H2>

<p>
<a href="http://www.linuxsecurity.com">http://www.linuxsecurity.com</a> es la
primera mina de oro. &iexcl;All&iacute; encontrar&aacute;n casi todo!
<br>
<a href="http://www.sans.org">http://www.sans.org</a> es un lugar d&oacute;nde encontrar
ayuda e informaci&oacute;n sobre seguridad. Un site que tendr&iacute;an que
consultar regularmente.
<br>
<a href="http://www.infosyssec.org">http://www.infosyssec.org</a> es otro lugar
para obtener toneladas de informaci&oacute;n sobre la seguridad.
<br>
<a href="http://www.securityfocus.com">http://www.securityfocus.com</a> es la casa
de Bugtraq, y proporciona mucha informaci&oacute;n sobre seguridad.
<br>
<a href="http://www.cs.purdue.edu/coast/hotlist/">http://www.cs.purdue.edu/coast/hotlist/</a>
&iexcl;Este es EL site que hay que visitar!
<br>
Arriba de &eacute;sta p&aacute;gina encontrar&aacute;n un boton llamado "Enlaces": p&iacute;nchenlo
para obtener las se&ntilde;as de muchos distribuidores. Consultar sus sites es
una obligaci&oacute;n para saber todo sobre los parches de seguridad. &iexcl;Eso vale
para cada editor de Unix! Muchos de ellos proponen parches de seguridad o
simplemente recomendados regularmente.
<br>
Algunos art&iacute;culos anteriores de Linux<font color="#FF0000">Focus</font> merecen una lectura (aparte de
los ya mencionados):
<br>
<A href="../July1998/article60.html">A&ntilde;adir seguridad a las
distribuciones Linux</a>
<br>
<A href="../July1998/article61.html">TCPD y Firewalls usando IPFWADM</a>
<br>
<A href="../January2000/article133.html">VXE, una herramienta de seguridad para Linux</a>
</p>

<p>
Se puede encontrar mucha m&aacute;s documentaci&oacute;n y no podemos dar todos
los enlaces disponibles. Tampoco podemos mencionar todas las herramientas de
seguridad como ya lo hemos dicho. En cada site mencionado aqu&iacute;,
encontrar&aacute;n m&aacute;s enlaces hacia a&uacute;n m&aacute;s
enlaces, y as&iacute; sucesivamente... como las mu&ntilde;ecas Rusas.
<br>
El hecho que unas herramientas o unos sites no figuren en este art&iacute;culo
no significa que no tengann inter&eacute;s. S&oacute;lo significa que las herramientas no han
sido probadas. Por supuesto, tienen que hacer una selecci&oacute;n arbitraria
entre la centena disponible.
<br>
El objetivo de &eacute;ste art&iacute;culo es de proporcionar a los lectores con lugares de
donde empezar. Esperamos que podr&aacute; ayudarlos.
</p>
&iquest;No vivimos una &eacute;poca estupenda?



<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=180&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article180.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>es</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-01-05, generated by lfparser version 2.1</font></p>
</BODY>
</HTML>
