<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.1">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Graphics">
 <TITLE>Graphics : Las utilidades de selecci&oacute;n de Gimp y la correcci&oacute;n de color</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Yves-Ceccone.jpg" ALT="[Photo de l&aacute;uteur]" HEIGHT=147 WIDTH=132>
<BR>por  <A HREF="http://perso.easynet.fr/~yeccoe/linux_infographie.htm">Yves Ceccone</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>De formaci&oacute;n en Fotograf&iacute;a, reconvertido en la infograf&iacute;a,<BR>
no ha soltado su rat&oacute;n desde entonces.<BR></P>
<P><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Las herramientas</A></LI>
  <LI><A HREF="#lfindex1">Algunas reglas comunes a las diferentes herramientas y tipos de selecci&oacute;n</A></LI>
  <LI><A HREF="#lfindex2">Unos peque&ntilde;os ejercicios</A></LI>
  <LI><A HREF="#lfindex3">Trazado a la pluma</A></LI>
  <LI><A HREF="#lfindex4">Selecci&oacute;n flotante y lazo / Arena caliente</A></LI>
  <LI><A HREF="#lfindex5">Herramientas mascara y lazo /Zambullida</A></LI>
  <LI><A HREF="#lfindex6">M&aacute;scara de bordes flotantes / ojos</A></LI>
  <LI><A HREF="#lfindex7">Trastear ...</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=119&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Las utilidades de selecci&oacute;n de Gimp y la correcci&oacute;n de color</H2>
 <IMG SRC="../../common/images/illustration99.gif" ALT="[Illustration]" HSPACE=10 HEIGHT=100 WIDTH=100><P><i>Resumen</i>:
<P>
<P>
   El <B>Gimp</B> es un programa de tratamiento de imagen muy poderoso y, entre las diversas utilidades (herramientas) que posee, existen las que nos permiten realizar selecciones.
   Una selecci&oacute;n es un medio de aislar una zona precisa de una imagen, para aplicarla un tratamiento que puede hacer cambiar completamente el aspecto final de la imagen,
   que nos permitir&aacute; quitar una parte de la imagen y reemplazarla por otra, duplicarla, cambiar sus colores, su contraste, su luminosidad, aplicarle un efecto, un filtro ...
   Las posibilidades son tan numerosas que, a veces, es dif&iacute;cil saber parar. Y, en cuanto se trata de la correcci&oacute;n de color, y que queremos obtener un resultado realista y natural (est&aacute; claro que estas nociones depender&aacute;n de cada uno), es importante dosificar la suavidad con la que trabajamos : un retoque acertado debe resultar invisible.
   Este art&iacute;culo describe las utilidades de selecci&oacute;n, las diferentes formas de seleccionar y, en paralelo, una presentaci&oacute; (no exhaustiva), de las utilidades de retoque del color.


</P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<!-- TRADUCTEURS ATTENTION: CET ARTICLE NE CONTIENTS PAS LES CHEMINS
     CORRECTS POUR LES IMAGES. DANS LA VERSION DEFINITIVE, VOUS DEVREZ
     REMPLACER " " par "../../common/images/" POUR QUE LES
     IMAGES S&Aacute;FFICHENT CORRECTEMENT SUR LE SITE DE LINUXFOCUS -->


<DIV align="center"><A NAME="lfindex0">&nbsp;</A>
<H2>Las herramientas</H2>
</DIV>
<DIV align="center"><IMG src="../../common/images/article119/palette.gif" width="400" height="305"></DIV><BR><BR>

<B>E</B>sta paleta de herramientas es la que corresponde a la versi&oacute;n estable 1.0.4, pero, siempre resulta interesante instalar las versiones m&aacute;s recientes, por ejemplo la versi&oacute;n  1.1.9 , que no presenta ning&uacute;n problema de instalaci&oacute;n (bajo Red Hat 6.0), y que posee 6 &uacute;tiles adicionales, nuevas posibilidades para las herramientas de pluma, un sistema de navegaci&oacute;n para cuando hacemos zoom ...<BR><BR>
<B>Las herramientas de selecci&oacute;n de zona rectangular y de zona el&iacute;ptica y circular.</B><BR>
Estas dos herramientas son bastante simples en su utilizaci&oacute;n; se pueden cambiar algunas opciones haciendo doble click sobre el icono de la herramienta en la barra (por ejemplo, si queremos utilizar &aacute;ngulos redondeados). Para crear una selecci&oacute;n circular perfecta, tan s&oacute;lo hacer falta mantener la tecla &quot;shift&quot;
pulsada mientras que trazamos con la herramienta para seleccionar elipses.<BR><BR>

<B>El lazo</B>, sirve para seleccionar una zona a la mano alzada. Opciones: antialiasing y suavizar.<BR><BR>

<B>La herramienta de selecci&oacute;n flotante</B>, para seleccionar una regi&oacute;n cont&iacute;nua. Esta herramienta no es precisa salvo para el caso en el que las zonas no sean uniformes, aunque puede ser pr&aacute;tico para reducir una selecci&oacute;n gracias a la ayuda de las teclas "shift" y "ctrl".<BR><BR>

<B>La pluma</B>, utiliza las curvas de Bezier para definir una selecci&oacute;n.
Esta herramienta necesita un apredizaje, nos permite determinar de una forma muy precisa el contorno de un objeto gracias a un trazo, y convertir ese trazo en una selecci&oacute;n. Se puede memorizar un trazo anterior, y convertirlo de esta forma en una selecci&oacute;n ya trazada.<BR><BR>

<B>Tijeras inteligentes</B>, a partir de una selecci&oacute;n a mano alzada, esta herramienta &quot;adivina&quot;
la zona que queremos seleccionar; se trata de una herramienta dif&iacute;cil de controlar, pero que ha sido modificada en la versi&oacute;n 1.1.9 : ahora es como magn&eacute;tico, se pega a la forma del objeto que rodeamos... <BR><BR>

<B>La selecci&oacute;n &quot;por color&quot;</B>: esta herramienta permite crear selecciones por color y, por tanto, nos permite a&ntilde;adir o reemplazar los colores de la selecci&oacute;n.<BR><BR>

<B>Y, por &uacute;ltimo, una herramienta fabulosa : el modo m&aacute;scara</B>, que ha aparecido en la versi&oacute;n 1.1.8 (que, adem&aacute;s est&aacute; internacionalizada).
Esta herramienta permite, a partir de una selecci&oacute; grande, en cuanto pasamos al modo m&aacute;scara, visualizar la zona seleccionada separada del resto y, con el pincel, el l&aacute;piz (o el aer&oacute;grafo), en funci&oacute;n del color que apliquemos, negro o blanco, a&ntilde;adimos o quitamos a la selecci&oacute;n, lo que permite de realizar el trabajo de un modo m&aacute;s f&aacute;cil y eficiente. Caso pr&aacute;ctico, una cereza en un pastel: podemos utilizar sonbre el contorno de una misma selecci&oacute;n el l&aacute;piz y el pincel (regulado con suavidad), lo que nos permitir&aacute; seleccionar un objeto con su sombra, por ejemplo ...<BR>

<BR><HR size="2" noshade>

<A NAME="lfindex1">&nbsp;</A>
<H2>Algunas reglas comunes a las diferentes herramientas y tipos de selecci&oacute;n</H2>


<UL><LI>Podemos invertir una selecci&oacute;n con la combinaci&oacute;n ctrl + i, o con el menu selecci&oacute;n -&gt; invertir.</LI>
<LI>Podemos hacer que una selecci&oacute;n se vuelva invisible, quedando activa. Esto es muy pr&aacute;ctico, ya que no nos distraeremos por los puntos de la selecci&oacute;n y nos centramos en el retoque. Se realiza con la combinaci&oacute;n  &quot;ctrl+T&quot;</LI>
<LI>Podemos sustraer una selecci&oacute;n menteniendo la tecla ctrl pulsada y trazando la selecci&oacute;n a sustraer con la herramienta de nuestra elecci&oacute;n.</LI>
<LI>Se puede a&ntilde;adir a una selecci&oacute;n manteniendo pulsada la tecla &quot;shift&quot; y seleccionando con cualquiera de las herramientas disponibles. (esta posibilidad funciona con la herramienta de selecci&oacute;n flotante)</LI>
<LI>Podemos deseleccionar todo con &quot;ctrl + shift + A&quot;.</LI>
<LI>Podemos desplazar una selecci&oacute;n manteniendo la tecla &quot;alt&quot; pulsada, en caso contrario, cortamos la foto.</LI>
<LI>Podemos modificar una selecci&oacute;n, agrandarla, reducirla, suavizarla, afinarla ...</LI>
<LI>Podemos salvaguardar una selecci&oacute;n en la paleta &quot;channels&quot;; esto es indispensable para poder volver en cualquier momento y corregir algo sin tener que deshacer todo el trabajo de nuestra selecci&oacute;n...
y, adem&aacute;s, esto permite crear zonas de selecci&oacute;n muy f&aacute;cilmente por adici&oacute;n o sustracci&oacute;n.</LI>
<LI>Gimp permite modificar los atajos de teclado. Los atajos citados en este documento son los instalados por defecto ...</LI>
</UL><BR>
<HR size="2" noshade>

<A NAME="lfindex2">&nbsp;</A>
<H2>Unos peque&ntilde;os ejercicios</H2>

Antes de trabajar con imagenes con estas herramientas de selecci&oacute;n, creamos una imagen, de cualquier tama&ntilde;o, para realizar unos ejercicios de base:<BR><BR>

Rellenamos la imagen (herramienta de rellenado, despu&eacute;s de hacer doble click sobre "color anterior" para elegir) de un color cualquiera y trazamos, con la herramienta de selecci&oacute;n rectangular (el primer icono arriba a la izquierda) una selecci&oacute;n arriba a la izquierda de la imagen. <BR>Con la herramienta de desplazamiento <IMG src="../../common/images/article119/deplac.jpg" width="16" height="16" align="bottom">
desplazamos la selecci&oacute;n y vemos que el fondo ha se "cortado" y, por tanto, hemos cortado tambi&eacute;n la imagen.<BR>
Hacemos ahora "ctrl+z" para anular esto que acabamos de cortar, y desplazamos la selecci&oacute;n, pero esta vez manteniendo la tecla "alt" pulsada, sin cortar esta vez: tan s&oacute;lo hemos desplazado la selecci&oacute;n.<BR>
Todav&iacute;a con un rect&aacute;ngulo seleccionado, si trazamos otro rect&aacute;ngulo, el primero de los dos desaparece.
<BR>
Si trazamos un segundo rect&aacute;ngulo apuyando sobre la tecla "shift" (en las versiones m&aacute;s recientes aparece un "+" al lado del cursor) obtendremos o bien dos rect&aacute;ngulos o bien una forma resultado de la suma de los dos (siempre que las selecciones se toquen).<BR> De la misma forma, podemos a&ntilde;adir un c&iacute;rculo, una elipse, o cualquier otra forma con la herramienta lazo ... <BR><BR>



<IMG src="../../common/images/article119/ex1.gif" width="145" height="145" hspace="10"><IMG src="../../common/images/article119/ex2.gif" width="145" height="145" hspace="10"><IMG src="../../common/images/article119/ex3.gif" width="145" height="145" hspace="10"><BR><BR>
Para las sustracci&oacute;n de una selecci&oacute;n a otra, las mismas herramientas se usan con la teclaavec "ctrl".
<BR><BR><HR><BR>
Rellenemos ahora con otro color una selecci&oacute;n un poco compleja que habremos obtenido con estas manipulaciones.<BR>
Con la herramienta de selecci&oacute;n flotante<IMG src="../../common/images/article119/bag.jpg" width="22" height="20" align="bottom">,
(tenemos ahora dos colores), hacemos click sobre uno de los dos colores y, autom&aacute;ticamente
toda la zoma de este color est&aacute ahora seleccionada. Si hacemos "ctrl+i", la selecci&oacute;n
se invierte. Podemos hacer entonces "ctrl+k" (suprimir) para verificar que despu&eacute; de una
inversi&oacute;n existe una clara diferencia ...<BR><BR>
<IMG src="../../common/images/article119/ex12.gif" width="145" height="145" hspace="10"><IMG src="../../common/images/article119/ex22.gif" width="145" height="145" hspace="10"><IMG src="../../common/images/article119/ex32.gif" width="145" height="145" hspace="10"><BR><BR>
Es el momento de hacer ensayos de selecci&oacute;n por color : en el menu clic derecho seleccionamos
select -> by color, y tan s&oacute;lo nos hace falta hacer click en la imagen sobre el color que queremos seleccionar.
<BR><HR size="2" noshade>

<A NAME="lfindex3">&nbsp;</A>
<H2>Trazado a la pluma</H2>


<IMG src="../../common/images/article119/lamp.jpg" width="542" height="400" hspace="10"><BR><BR>
La herramienta pluma es el &uacute;til base en los programas de debujo, tales como killustrator, sketch ...
(illustrator, freehand) pero aqu&iacute; es un instrumento de soporte a la selecci&oacute;n, no
una herramienta de trabajo,
y esto puede ser un poco derrotador para el que lo utilice por primera vez, sobre todo si se trata de
trazar curbas precisas, y, a veces, conviene m&aacute;s, en un primer momento, ignorar esta herramienta, y
usarla m&aacite;s adelante (sobre todo con la versi&oacute;n 1.0.4). La versi&oacute;n 1.1.8, posee medios de trabajo
con las l&iacute;neas de forma m&aacute;s eficiente.<BR><BR>

La peque&ntilde;a dificultad de este trazado es la parte ligeramente curba al medio de la imagen;
estas tres etapas explican el principio de una curba con la utilidad pluma que utiliza las curbas de Bezier, sin
problemas para los amantes de las mates que juegan con las tangentes ...
para el resto (entre los que me encuentro), hay que conocer el principio y, con un poco de pr&aacute;ctica se
terminan los problemas ...<BR><BR>
<IMG src="../../common/images/article119/plum1.jpg" width="224" height="224" hspace="10"><IMG src="../../common/images/article119/plum2.jpg" width="224" height="224" hspace="10"><IMG src="../../common/images/article119/plum3.jpg" width="224" height="224" hspace="10">

<BR><BR>
Para llegar a la vista 1 (en el punto A), tan s&oacute;lo hay que hacer click de punto en punto hasta que llegamos a
la vista 2. Hace falta, despu&eacute;s de haber situado el punto B, sin soltar el rat&oacute;n, desplazarse hacia la
izquierda para as&iacute; crear una curba y sus tangente, hasta que la curba se case con la forma del objeto, para
continuar el trazo haciendo click cobre el peque&ntilde;o cuadrado (manteniendo el "shift" siempre pulsado) y vemos que
tan s&oacute;lo la tangente a la izquierda se mueve; la desplazamos verticalmente, en direcci&oacute;n al pr&oacute;ximo
punto ... Cuando cerramos el bucle, con tan s&oacute;lo hacer click en el interior de lo que hemos trazado, se transforma
en selecci&oacute;n.
<BR><BR>
<IMG src="../../common/images/article119/lamp2.jpg" width="542" height="400" hspace="10"><BR><BR>
Una vez realizada la selecci&oacute;n, podemos modificar los colores, simplemente haciendo click en el
men&uacute; "color balance", cambiando el cursor cyan/rojo ligeramente hacia el cyan para quitar el color
dominante c&aacute;lido de la madera. Es posible en este mismo men&uacte; elegir la gama de tonos a modificar:
 claro, medio, oscuro ...<BR><BR>
Un peque&ntilde;o principio para trabajar con colores; tenemos :<BR>
<B>1</B>-- rojo---cyan<BR>
<B>2</B>-- verde---magenta<BR>
<B>3</B>-- azul---amarillo<BR>
A la izquierda los colores primarios y, a la derecha, los secundarios.<BR>
+ verde equivale a  - de magenta<BR>
- azul = + de amarillo ...<BR>
Podemos obtener el rojo deslizando el cursor 1 hacia el rojo (- de cyan)<BR>
Pero podemos obtener el rojo tambien deslizando los cursores 2 y 3 hacia el amarillo, y el magenta
con el mismo valor. Si queremos obtener un color anaranjado, pondremos m&aacute;s amarillo que magenta y
para obtener un rojo m&aacute;s fr&iacute;o, un poco m&aacute;s de magenta que de amarillo ...<BR>
Del mismo modo podemos tener amarillo a partir del rojo y del verde.<BR>
Para realizar los test, elegiremos un fondo uniforme de color gris...


<BR><HR size="2" noshade>
<A NAME="lfindex4">&nbsp;</A>
<H2>Selecci&oacute;n flotante y lazo / Arena caliente</H2>

<IMG src="../../common/images/article119/sable1.jpg" width="541" height="426" hspace="10">

<BR><BR>
He aqu&iacute; lo que obtenemos con la herramienta de selecci&oacute;n flotante, en un s&oacute;lo click sobre la
arena, con la idea de cambiar su color, sin cambiar el de las conchas (por ahora). Hace falta, por supuesto, tantear
y modificar los par&aacute;metros de la herramienta para cada diferente caso (doble click en la im&aacute;gen de la
barra de herramientas).<BR><BR>
Este toque de "varita m&aacute;gica" nos ha quitado mucho trabajo de encima, y podemos terminar la selecci&oacute;n con el
lazo usando la tecla "ctrl" para quitar las zonas que no se ven en la selecci&oacute;n :
 <BR><BR>
<IMG src="../../common/images/article119/coc1.jpg" width="213" height="141" hspace="10">

<IMG src="../../common/images/article119/coc2.jpg" width="213" height="141" hspace="10">

<IMG src="../../common/images/article119/coc3.jpg" width="213" height="141" hspace="10">
  <BR><BR>
Tras un trabajo de selecci&oacute;n como este, deber&iacute;amos guardar esta selecci&oacute;n en un canal, haciendo
(sobre la selecci&oacute;n activa) click derecho -> selecci&oacute;n -> grabar en un canal.<BR>
Tenemos ahora un canal de m&aacute;s en los canales (layer -> calcos & canales), y, para activar esta selecci&oacute;n,
tan s&oacute;lo nos tenemos que poner sobre este canal, y hacemos click derecho -> canal hacia selecci&oacute;n.
<BR><BR>
Atenci&oacute;n a la hora de hacer modificaciones sobre la im&aacute;gen despu&eacute;s de esta manipulaci&oacute;n;
hay que volver a realizar el paso anterior cada vez que realicemos el paso..<BR><BR>
Para guardar una im&aacute;gen con un canal de m&aacute;s (o varios calcos) tenemos que utilizar el formato netivo de
Gimp (xcf) so pena de perder todo nuestro trabajo.
<BR><BR>
Una vez que hemos seleccionado toda la arena, podemos utilizar otro instrumento adem&aacute;s de los balances de
color para modificar el color dominante que hace que la arena tenga poco calor :
<BR>
<B>Los niveles</B> (imagen -> colores -> niveles)<BR><BR>
<IMG src="../../common/images/article119/niv.jpg" width="355" height="401" hspace="10"><BR><BR>
El men&uacute; de la ventana de niveles nos permite elegir o bien un "valor" que corrige la densidad y el contraste
global, o bien un color para que trabajemos s&oacute;lo sobre &eacute;l.<BR>
Esta cuadro de di&aacute;logo permite ajustes m&aacute;s finos que el de "color balance". <BR>
Los dos cursores extremos de los niveles de entrada modifican el contraste de la imagen; el cursos central, los niveles
medios; y los cursores de los niveles de salida modifican tambi&eacute;n el contraste, pero de otra manera ...

<BR><BR>Existe tambi&eacute;n el cuadro de di&aacute;ologo "<B>curva</B>"
que possee las mismas posibilidades que los niveles, y permite m&aacute;s correcci&oacute;n sobre una tonalidad
particular ...<BR>
PAra corregir la dominante fr&iacute;a de la arena, tenemos que hacer algunas modificaciones en el azul y en el rojo.
Elegimos la casilla de previsualizaci&oacute;n para ver los resultados de la correcci&oacute;n.
<BR>
<BR>
Para elegir una concha a la cual queremos cambiar de color, disponemos de la selecci&oacute;n que hemos realizado
antes de la arena (la hemos guardado en un canal). Podemos activar esta selecci&oacute;n e invertirla, con lo que
tendremos una selecci&oacute;n de todas las conchas. Hay que utilizar el lazo con la tecla "ctrl" para suprimir de la
selecci&oacute;n lo que no nos interese.<BR>

<BR>
Existe tambi&eacute;n la herramienta "<B>saturacion tinta</B>" (imagen -> color -> saturacion tinta) para modificar
los colores. Podemos elegir entre el maestro o uno de los colores.<BR>
El cursor de la parte de arriba nos sirve para "reemplazar" el color seleccionado (en este caso utilizamos el
c&iacute;rculo crom&aacute;tico, que va de  -180 &agrave; +180).<BR>
El segundo cursor concierne a la luminosidad.<BR>
El tercero a la saturaci&oacute;n. Moviendo el cursor completamente a la izquierda desaturamos completamente,
y pasamos a blanco y negro (equivale al comando imagen -> color -> desaturar). <BR>
Una vez que hemos seleccionado la concha, hacemos "ctrl+T", y la seleccion se vuelve invisible,
con lo que es m&aacute;s f&aacute;cil trabajar :
<BR><BR>
 <IMG src="../../common/images/article119/cocs.jpg" width="200" height="170" hspace="10">Ejemplo de utilizaci&oacute;n del  cursor "tinta"<BR><BR><BR>

<IMG src="../../common/images/article119/cocrou1.jpg" width="199" height="194" hspace="10">
<IMG src="../../common/images/article119/cocrou2.jpg" width="199" height="194" hspace="10">
<IMG src="../../common/images/article119/cocrou3.jpg" width="199" height="194" hspace="10">
<BR><BR>
Aqu&iacute; la primera imagen es la original. Sobre la segunda, he utilizado el comando saturaci&oacute;n (+) con el rojo,
el amarillo y el magente y, en la &uacute;ltima, saturaci&oacute (-) con los mismos colores.<BR><BR>
Ya tenemos la imagen del principio corregida, con el color de la arena m&aacute;s c&aacute;lido y con algunas
modificaciones de los colores de las conchas :
<BR><BR>
<IMG src="../../common/images/article119/coqcorr.jpg" width="499" height="332" hspace="10"><IMG src="../../common/images/article119/coqupetit.jpg" width="200" height="132">

<BR><HR size="2" noshade>

<A NAME="lfindex5">&nbsp;</A>
<H2>Herramientas mascara y lazo /Zambullida</H2>


<IMG src="../../common/images/article119/plonge.jpg" width="494" height="329" hspace="10">
<BR><BR>
Esta im&aacute;gen tiene un color general dominado por el azul/cyan, y es posible mejorarlo modificando 2 zonas:
 el primer plano globalmente, y despu&eacute;s en pez solo, que forma parte tambi&eacute;n del primer plano.<BR><BR>
Para utilizar la herramienta m&aacute;scara, utilizo la versi&oacute;n 1.1.9 (versi&oacute;n en desarrollo [hay un
problema, por cierto, al guardar ficheros jpeg]) de Gimp,
que, os recuerdo, es muy f&aacute;cil de instalar (en una Red Hat 6.0). La herramienta m&aacute;scara existe tambi&eacute;n
en la versi&oacute;n 1.1.8 ...<BR><BR>
Con el lazo, debemos rodear el pez, incluso sin hacerlo detalladamente, y luego hacer click
sobre el peque&ntilde;o cuadrado rojo a la izquierda de la ventana.<BR>
La imagen est&aacute; ahora cubierta por un velo rojo, salvo en la zona que rodea al pez, que hab&iacute;a sido
seleccionada.<BR><BR>
<IMG src="../../common/images/article119/poissomask.jpg" width="349" height="264" hspace="10"><BR><BR>
Para afinar la selecci&oacute;n, y que la m&aacute;scara roja rodee perfectamente el pez,
tenemos que utilizar el pincel (ya que nos permite un trazado m&aacute;s fino).<BR><BR>
 <IMG src="../../common/images/article119/nb.jpg" width="59" height="51" hspace="10">
En cuanto tengamos el selector de color como aqu&iacute; (negro en primer plano y blanco en el segundo),
a&ntilde;adimos rojo. Para quitar el rojo basta con pulsar una vez la tecla "x" y el blanco pasar&aacute; a primer plano,
por lo que lo tendremos f&aacute;cil si hemos mordido el pez con rojo o si nos hemos equivocado con la m&aacute;scara ...<BR>
Esta claro que deberemos elegir el tama&ntilde;o de pincel adecuado para controlar el trazado y,
tras algunos intentos, elegir la dureza de la herramienta en funci&oacute;n del grado de nitidez del
objeto a seleccionar.<BR>
Haciendo doble click sobre el peque&ntilde;o cuadrado rojo podremos midificar el color y la opacidad
de la m&aacute;scara, para facilitar la selecci&oacute;n en funci&oacute;n del objeto, del fondo ...
<BR>
Una vez finalizada las m&aacute;scara, volvemos al modo normal haciendo click sobre el peque&ntilde;o
cuadrado que simboliza la selecci&oacute;n, al lado del cuadrado rojo.
<BR>
Guardamos la selecci&oacute;n en un canal.<BR>
Pasamos a la selecci&oacute;n del primer plano utilizando el mismo m&eacute;todo.<BR><BR>
<IMG src="../../common/images/article119/1erplanmask.jpg" width="288" height="256" hspace="10"><BR><BR>
Guardamos tambi&eacute;n esta selecci&oacute;n.<BR><BR>
Para trabajar sobre el primer plano sin tocar el pez :<BR>
En la pesta&ntilde;a de los canales de la paleta "calcos y canales" nos ponemos sobre la m&aacute;scara de la
selecci&oacute;n del primer plano (reconocemos f&aacute;cilmente su forma), despu&eacute;s hacemos click sobre
el icono de debajo de la paleta que representa un c&iacute;rculo en puntitos, y sobre la im&aacute;gen
aparece la selecci&oacute;n del primer plano.<BR>

Nos ponemos ahora sobre las m&aacute;scara del pez, haciendo click sobre el icono del c&iacute;rculo
con puntos, manteniendo la tecla "ctrl" pulsada, para sustraer el pez del primer plano.<BR>
Tan s&oacute;lo queda ahora la correcci&oacute;n de los colores : <BR>

Volvemos a la pesta&ntilde;a de calco y seleccionamos el calco. Despu&eacute;s utilizamos los niveles para a&ntilde;adir
rojo y amarillo al conjunto de este primer plano y, luego, con "saturaci&oacute;n de color" aumentamos la
saturaci&oacute;n del rojo y del amarillo
<BR><BR>
Hacemos lo mismo sobre el pez, pero hacia tonos m&aacute;s fuertes, y jugando tambi&eacute;n con el contraste y
la luminosidad :
<BR><BR>
<IMG src="../../common/images/article119/plongcorr.jpg" width="491" height="326" hspace="10"><IMG src="../../common/images/article119/plongpetit.jpg" width="214" height="139">
<BR><HR size="2" noshade>


<A NAME="lfindex6">&nbsp;</A>
<H2>M&aacute;scara de bordes flotantes / ojos</H2>


<IMG src="../../common/images/article119/yeux.jpg" width="501" height="188" hspace="10">
<BR><BR>
Para cambiar el color de los ojos de esta foto, necesitamos utilizar una selecci&oacute;n de bordes
flotantes ya que no hay l\&iacute;mites claramente definidos en los diferentes elementos de un ojo.<BR>

Para tener una selecci&oacute;n flotante, tenemos la soluci&oacute;n de suavizar (select -> feather) o bien
utilizar directamente la herramienta con la opci&oacute;n de suavizar los border de la selecci&oacute;n, pero
es dif&iacute:cil de controlar lo que hacemos, sobre todo antes de la versi&oacute;n 1.1.8. <BR>

Existe la soluci&oacute;n de la herramienta m&aacute;scara :
<BR><BR>
<IMG src="../../common/images/article119/yeux1.jpg" width="235" height="268" hspace="10" vspace="10"><BR>
Hacemos una primera selecci&oacute;n, con el lazo rodeando el conjunto circular, y, siempre con el lazo
y con la tecla "ctrl" pulsada, quitamos la parte central negra de la selecci&oacute;n.
<BR><BR>
<IMG src="../../common/images/article119/yeux2.jpg" width="235" height="268" hspace="10" vspace="10">
<BR>
Al pasar al modo m&aacute;scara, podemos juzgar exactamente c&oacute;mo es nuestra selecci&oacute;n y,
para terminar el trabajo, pordemos utilizar el pincel con una forma suave (o bien el aer&oacute;grafo), siempre
con el selector de color sobre blanco y negro, y con la tecla "x" para bascular de uno a otro. Es
importante suprimir de la selecci&oacute;n todas las zonas negras o muy oscuras, y de situar bien el l&iacute;mite
flotante para que el retoque sea cre&iacute;ble. Con este sistema de m&aacute;scara, es muy f&aacute;cil realizar
intentos, siempre con un peque&ntilde;o "ctrl + z" para volver atr&aacute;s despu&eacute;s de un test de color.

<BR>
<BR><IMG src="../../common/images/article119/yeux3.jpg" width="235" height="268" hspace="10" vspace="10">
<BR>
Aqu&iacute; he utilizado los niveles (entrada) : cursor del medio (verde) sobre la izquierda, y el de
la izquierda ligeramente sobre la derecha. Luego, con el comando saturaci&oacute;n (+), el verde y el amarillo.

<BR><HR size="2" noshade>

<A NAME="lfindex7">&nbsp;</A>
<H2>Trastear ...</H2>

<IMG src="../../common/images/article119/yeuxf.jpg" width="542" height="280" hspace="10">
<BR><BR>
Voil&agrave;, espero que este art&iacute;culo os ayude a apreciar las cualidades de esta super utilidad que es
Gimp, y os haya dado ganas de trastear con los colores de vuestras fotosj...
<BR><BR>
<B>Algunos enlaces :</B><BR><BR>
En el sitio de <A href="http://www.gimp.org">Gimp</A> se puede encontrar el manual de Gimp : "GUM", en pdf o en html<BR>
Tambi&eacute;n existe una versi&oacute;n impresa de "GUM" (a pedir en tu librer&iacute;a habitual)<BR>
Otro libro
"The artist's Guide to Gimp" en la editorial francesa <A href="http://www.mcd2-diff.fr">MCD2</A><BR>
<A href="http://linuxartist.org/">LinuxArtist.org</A> : Recursos para los artistas que utilizan Linux :
Enlaces a tutoriales, aplicaciones, noticias, galerias ...

















<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=119&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Yves Ceccone, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article119.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="http://perso.easynet.fr/~yeccoe/linux_infographie.htm"><FONT COLOR="#FFFFFF">Yves Ceccone</FONT></a></font></td>
</tr>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="http://www-syntim.inria.fr/fractales/Staff/Rodriguez/"><FONT COLOR="#FFFFFF">Jos&eacute; Rodr&iacute;guez Ruibal</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-01-05, generated by lfparser version 2.1</font></p>
</BODY>
</HTML>
