<HTML>
<HEAD>
<TITLE>Gu&iacute;a de usuario de Linuxdoc-SGML: Redacci&oacute;n de Documentos con Linuxdoc-SGML</TITLE>
</HEAD>
<BODY>
<A HREF="Linuxdoc-Como-2.html">Anterior</A>
<A HREF="Linuxdoc-Como-4.html">Siguiente</A>
<A HREF="Linuxdoc-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Redacci&oacute;n de Documentos con Linuxdoc-SGML</A></H2>


<P>Para la mayor&iacute;a, redactar documentaci&oacute;n empleando la Definici&oacute;n de Tipo de
Documento es muy simple, y similar en ciertas cosas al LaTeX. No obstante,
hay algunas advertencias a tener en cuenta. En esta secci&oacute;n, expondr&eacute; en
una introducci&oacute;n la redacci&oacute;n de documentaci&oacute;n con SGML. </P>
<P>Ver el archivo <CODE>Linuxdoc-Ejemplo.sgml</CODE> para tener un ejemplo (y tutorial) de
documento SGML que pueda usarse como modelo a seguir a la hora de redactar
tus propios documentos. S&oacute;lo discutir&eacute; algunas de las prestaciones del
SGML aqu&iacute;, pero el fuente no es muy le gible como ejemplo. Mejor imprimir
el fuente (as&iacute; como la salida ya formateada) de <CODE>Linuxdoc-Ejemplo.sgml</CODE> 
para as&iacute;
tener una referencia real a la que acudir. </P>

<H2><A NAME="ss3.1">3.1 Conceptos B&aacute;sicos</A></H2>


<P>Examinando los fuentes del documento ejemplo, te percatar&aacute;s de que hay una
serie de ``etiquetas'' enmarcadas con par&eacute;ntesis en &aacute;ngulo
<SL>N. del
T.<BR> V&aacute;lgame la traducci&oacute;n ;-) creo que es m&aacute;s intuible y corto que poner
``s&iacute;mbolos de mayor/menor q ue''</SL>
 (<CODE>&lt;</CODE> y
<CODE>&gt;</CODE>). Una etiqueta especifica simplemente el comienzo y final de
un elemento, siendo un elemento algo como una secci&oacute;n, p&aacute;rrafo, una frase
con texto en tipograf&iacute;a cursiva (<I>it&aacute;lica</I>), un ``item'' de un listado
, y dem&aacute;s. El uso de una etiqueta es similar a los comandos de LaTeX como
<CODE>\item</CODE> o <CODE>\section{...}</CODE>. </P>
<P>Por poner un ejemplo sencillo, para producir <B>este texto en
negrita</B>, escrib&iacute;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Por poner un ejemplo sencillo, para producir &lt;bf&gt;este texto en negrita&lt;/bf&gt;, ...
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>en el fuente. <CODE>&lt;bf></CODE> da comienzo a la regi&oacute;n de texto en
negrita, y <CODE>&lt;/bf></CODE> la finaliza. Como alternativa, se puede
emplear la forma abreviada</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Por poner un ejemplo sencillo, para producir &lt;bf/este texto en negrita/, ...
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>que encierra el texto en negrita entre barras. (Si el texto contenido
entre las barras contiene barras tambi&eacute;n, deber&aacute;s usar el m&eacute;todo
``largo'', como es el caso de los nombres de archivo en Unix). </P>
<P>Hay otros aspectos que tener en cuenta respecto a caracteres especiales
(esa es la raz&oacute;n por la que ver&aacute;s todas esas absurdas expresiones con
simbolos de ``&amp;'' si observas los fuentes; las describir&eacute; pronto). </P>
<P>En algunos casos, la etiqueta de fin para un elemento en particular es
opcional. Por ejemplo, para comenzar una secci&oacute;n, empleas la etiqueta de
<CODE>&lt;sect></CODE>; de todos modos, la etiqueta de finalizaci&oacute;n de la
secci&oacute;n (que podr&iacute;a aparecer al final del cuerpo de la secci&oacute;n
propiamente, ¡no justo tras el t&iacute;tulo de la secci&oacute;n!) es opcional e
impl&iacute;cito cuando se da comienzo a otra secci&oacute;n de la misma
``profundidad''.  En general, no debemos preocuparnos de esos detalles;
basta con seguir el modelo empleado en el tutorial (<CODE>Linuxdoc-Ejemplo.sgml</CODE>).</P>


<H2><A NAME="ss3.2">3.2 Caracteres Especiales</A></H2>


<P>Para obtener una lista detallada de caracteres especiales, echar un
vistazo a alguno de los ficheros de reemplazamiento. Normalmente el LaTeX
se quejar&aacute; de la mayor&iacute;a de caracteres especiales, por lo que paginando
<CODE>$LINUXDOCLIB/rep/latex/general </CODE> ser&iacute;a un buen sitio donde
comenzar. <CODE>$LINUXDOCLIB</CODE> est&aacute; definido al comienzo de los
scripts de conversi&oacute;n. </P>
<P>Obviamente, los par&eacute;ntesis en &aacute;ngulo son por s&iacute; mismos caracteres
especiales en los fuentes SGML. Hay otros a los que prestar atenci&oacute;n. Por
ejemplo, digamos que quisieras teclear una expresi&oacute;n que contenga
par&eacute;ntesis en &aacute;ngulo, como esta: <CODE>&lt;foo></CODE>. Para obtener el
par&eacute;ntesis en &aacute;ngulo izquierdo (o de apertura)tendr&aacute;s que emplear el
elemento <CODE>&amp;lt;</CODE> que es una macro que se expandir&aacute; al car&aacute;cter
de par&eacute;ntesis en &aacute;ngulo actual. Por tanto, en el fuente tecle&eacute;: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
... que contenga parentesis en angulo, como esta: &lt;tt&gt;&lt;foo&gt;&lt;/tt&gt;.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Generalmente, lo que comience con un s&iacute;mbolo de ``&amp;''
<SL>N. del
T.<BR> A partir de aqu&iacute; me referir&eacute; a el por su denominaci&oacute;n anglosajona,
``ampersand''</SL>
 es una macro especial. Por ejemplo, existe
<CODE>&amp;percnt;</CODE> para obtener un %, <CODE>&amp;verbar;</CODE> para
|, y as&iacute;. Para todos los caracteres especiales existen estas
entidades precedidas por ``ampersands'' para representarlos. </P>
<P>Normalmente, no necesitamos emplear la macro con ampersand para obtener un
car&aacute;cter especial, no obstante, en algunos casos es necesario. Los m&aacute;s
utilizados son: </P>
<P>
<UL>
<LI>Usar <CODE>&amp;amp;</CODE> con el ``ampersand'' (&amp;), </LI>
<LI>Usar <CODE>&amp;lt;</CODE> para el s&iacute;mbolo <I>menor que</I> (&lt;),</LI>
<LI>Usar <CODE>&amp;gt;</CODE> para el s&iacute;mbolo <I>mayor que</I> (&gt;),
</LI>
<LI>Usar <CODE>&amp;etago;</CODE> para el el s&iacute;mbolo <I>menor que</I>
con una barra inversa (<CODE>&lt;/</CODE>) 
</LI>
<LI>Usar <CODE>&amp;dollar;</CODE> con el s&iacute;mbolo de d&oacute;lar ($),</LI>
<LI>Usar <CODE>&amp;num;</CODE> con la almohadilla (#),</LI>
<LI>Usar <CODE>&amp;percnt;</CODE> con el s&iacute;mbolo de tanto por ciento (%),</LI>
<LI>Usar <CODE>&amp;tilde;</CODE> con una tilde (~),
</LI>
<LI>Usar <CODE>``</CODE> y <CODE>''</CODE> con las comillas, o emplear
<CODE>&amp;dquot</CODE> con &quot;. 
</LI>
</UL>
</P>


<H2><A NAME="ss3.3">3.3 Entornos Code y Verbatim</A></H2>


<P>Mientras trat&aacute;bamos el asunto de los caracteres especiales, deb&iacute; mencionar
tambi&eacute;n el ``entorno'' <EM>verbatim</EM> empleado para incluir texto literal
en la salida (preservando los espacios, sangr&iacute;as, y dem&aacute;s). El elemento
<CODE>verb</CODE> se emplea para esto; tiene el siguiente aspecto: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;verb&gt;
Un poco de texto literal a incluir como ejemplo en la salida.
&lt;/verb&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El entorno <CODE>verb</CODE> no te permite emplear <EM>todo</EM> en su interior
literalmente. Espec&iacute;ficamente, deber&aacute;s hacer lo siguiente en el interior
de los entornos <CODE>verb</CODE>. </P>
<P>
<UL>
<LI>Usar <CODE>&amp;ero;</CODE> para obtener un ampersand, </LI>
<LI>Usar <CODE>&amp;etago;</CODE> para obtener <CODE>&lt;/</CODE>,
</LI>
<LI>No usar <CODE>\end{verbatim}</CODE> dentro de un entorno
<CODE>verb</CODE> ya que es as&iacute; como lo emplea LaTeX para finalizar el entorno
<CODE>verbatim</CODE> (En el futuro, podr&iacute;a ser posible ocultar el formateador
de texto subyacente enteramente, pero el analizador no soporta esta
caracter&iacute;stica todav&iacute;a.) 
</LI>
</UL>
</P>
<P>El entorno <CODE>code</CODE> es mayormente como el entorno <CODE>verb</CODE>, a
excepci&oacute;n de las l&iacute;neas horizontales que son a&ntilde;adidas al texto que
enmarca, como aqu&iacute;: </P>
<P>
<HR>
<PRE>
He aqui un entorno code de muestra.
</PRE>
<HR>
</P>
<P>Deber&aacute;s usar el entorno <CODE>tscreen</CODE> antes de cualquier entorno <CODE>verb</CODE>,
como aqu&iacute;: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;tscreen&gt;&lt;verb&gt;
He aqui un poco de texto de ejemplo
&lt;/verb&gt;&lt;/tscreen&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><CODE>tscreen</CODE> es un entorno que &uacute;nicamente sangra el texto y selecciona
como fuente tipogr&aacute;fica por defecto <CODE>tt</CODE>. Esto hace que los ejemplos
tengan mejor aspecto, tanto en las versiones LaTeX como ASCII.  Se puede
usar <CODE>tscreen</CODE> sin <CODE>verb</CODE> de todos modos, pero si se incluye alg&uacute;n
car&aacute;cter especial en el ejemplo, ser&aacute; necesario emplear ambos.
<CODE>tscreen</CODE> no procesa los caracteres especiales. Ver <CODE>ejemplo.sgml</CODE>
para los ejemplos. </P>
<P>El entorno <CODE>quote</CODE> es similar a <CODE>tscreen</CODE>, con la excepci&oacute;n de que
no se selecciona como fuente tipogr&aacute;fica por defecto <CODE>tt</CODE>. Por tanto,
puedes emplear <CODE>quote</CODE> para menciones que no requieren interacci&oacute;n de
la computadora, como en: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;quote&gt;
He aqui una muestra de texto a sangrar, como en una cita.
&lt;/quote&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>que generar&aacute;:</P>
<P>
<BLOCKQUOTE>
He aqui una muestra de texto a sangrar, como en una cita.
</BLOCKQUOTE>
</P>


<H2><A NAME="ss3.4">3.4 Estructura Global del Documento.</A></H2>


<P>Antes de meternos en profundidad con los detalles, describir&eacute; la
estructura global de un documento definido por el DTD <CODE>linuxdoc</CODE>. 
Echar un vistazo a <CODE>Linuxdoc-Ejemplo.sgml</CODE> para ver un buen ejemplo de c&oacute;mo
definir un documento. </P>

<H3>El Pre&aacute;mbulo</H3>


<P>En el ``pre&aacute;mbulo'' del documento, se definen aspectos como la informaci&oacute;n
del t&iacute;tulo, y el estilo del documento. Para un documento de tipo
Howto
<SL>N. del T.<BR> COMO</SL>
 tendr&iacute;a este aspecto:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;!doctype linuxdoc system&gt;

&lt;article&gt;

&lt;title&gt;Linux Foo-HOWTO

&lt;author&gt;Norbert Ebersol, &lt;tt/norb@baz.com/

&lt;date&gt;v1.0, 9 March 1994

&lt;abstract&gt;
Este documento describe como usar las herramientas foo para frobnicar
librerias menganitas, empleando el relincador xyzzy... 
&lt;/abstract&gt;

&lt;toc&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Los elementos deber&aacute;n ir m&aacute;s o menos en ese orden. La primera l&iacute;nea
comunica al analizador SGML que emplee el DTD Linuxdoc-SGML. La etiqueta
<CODE>&lt;article></CODE> fuerza al documento a seguir el estilo ``article''.
El DTD QWERTZ original define ``report'' 
<SL>N. del T.<BR>Informe</SL>
 y ``book''
<SL>N. del T.<BR> Libro.</SL>

tambi&eacute;n; no he retocado &eacute;stos para su uso con Linuxdoc-SGML.</P>
<P>Las etiquetas <CODE>title</CODE>, <CODE>author</CODE>, y <CODE>date</CODE>
<SL>N. del T.<BR>T&iacute;tulo, Autor y Fecha, respectivamente.</SL>
 deber&iacute;an resultar
obvias.  La etiqueta <CODE>date</CODE> incluye el n&uacute;mero de versi&oacute;n y la
&uacute;ltima fecha de modificaci&oacute;n del documento.</P>
<P>La etiqueta <CODE>abstract</CODE> define el texto que ser&aacute; impreso en el
encabezamiento del documento, <EM>antes</EM> de la tabla de contenidos. Si no
se va a incluir una tabla de contenidos (la etiqueta <CODE>toc</CODE>),
probablemente no sea necesario un elemento <CODE>abstract</CODE>. Sugiero que
todos los Linux HOWTOs sigan este mismo formato para el pre&aacute;mb ulo, para
que el t&iacute;tulo, resumen, y tabla de contenidos est&eacute;n todos ah&iacute; y tengan una
apariencia similar. </P>

<H3>P&aacute;rrafos y Secciones</H3>


<P>Tras el pre&aacute;mbulo, estamos listos para sumergirnos en el documento.
Disponemos de los siguientes comandos de seccionamiento: </P>
<P>
<UL>
<LI><CODE>sect</CODE>:  Para secciones de nivel principal (como 1, 2, y as&iacute; en
adelante)
</LI>
<LI><CODE>sect1</CODE>: Para secciones secundarias (como 1.1, 2.1, y dem&aacute;s)</LI>
<LI><CODE>sect2</CODE>: Para secciones de tercer nivel</LI>
<LI><CODE>sect3</CODE>: Para secciones de cuarto nivel</LI>
<LI><CODE>sect4</CODE>: Para secciones de quinto nivel</LI>
</UL>
</P>
<P>&Eacute;stas son a <EM>grosso modo</EM> equivalentes a sus respectivas en LaTeX
<CODE>section</CODE>, <CODE>subsection</CODE>, y dem&aacute;s.</P>
<P>Tras la etiqueta <CODE>sect</CODE> (o <CODE>sect1</CODE>, <CODE>sect2</CODE>, etc.) vendr&aacute; el
nombre de la secci&oacute;n. Por ejemplo, al comienzo de este documento, tras el
pre&aacute;mbulo, viene la etiqueta: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;sect&gt;Introduccion
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Y al comienzo de esta secci&oacute;n (P&aacute;rrafos y Secciones), est&aacute; la etiqueta:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;sect2&gt;Parrafos y Secciones.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Tras la etiqueta de secci&oacute;n, se comienza el cuerpo de la secci&oacute;n. En
cualquier caso, se debe empezar el cuerpo con una etiqueta
<CODE>&lt;p></CODE>, como sigue: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;sect&gt;Introduccion
&lt;p&gt;

Esta es una guia de usuario del sistema de procesado de documentacion
linuxdoc-sgml ... 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto es as&iacute; para comunicar al analizador que se ha terminado con el t&iacute;tulo
de la secci&oacute;n, y que est&aacute;s listo para comenzar con el cuerpo. A partir de
ah&iacute;, los p&aacute;rrafos siguientes se comienzan con una l&iacute;nea en blanco (tal y
como se har&iacute;a en TeX). Por ejemplo,</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
He aqui el final del primer parrafo.

Y aqui comenzamos este nuevo. 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>No hay raz&oacute;n para usar etiquetas <CODE>&lt;p></CODE> al comienzo de cada
p&aacute;rrafo; &uacute;nicamente al comienzo del primer p&aacute;rrafo tras un comando de
seccionamiento. </P>

<H3>Finalizando el documento</H3>


<P>Al final del documento, se debe emplear la etiqueta:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;/article&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para comunicar al analizador que hemos finalizado con el elemento
<CODE>article</CODE> (que engloba al documento completo en conjunto) </P>


<H2><A NAME="cross-ref"></A> <A NAME="ss3.5">3.5 Referencias Cruzadas</A></H2>


<P>Ahora iremos con otras prestaciones del sistema.  Las referencias cruzadas
son f&aacute;ciles. Por ejemplo, si queremos definir una referencia cruzada a
cierta secci&oacute;n, necesitar&aacute;s etiquetar esa secci&oacute;n con un nombre, como
sigue: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;sect1&gt;Introduccion&lt;label id=&quot;sec-intro&quot;&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ahora ya se podr&aacute; referir a esa secci&oacute;n en cualquier lugar del texto
empleando la expresi&oacute;n: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Ver seccion &lt;ref id=&quot;sec-intro&quot; name=&quot;Introduccion&quot;&gt; para una introduccion.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto sustituir&aacute; la etiqueta <CODE>ref</CODE> con el n&uacute;mero de secci&oacute;n etiquetado
como <CODE>sec-intro</CODE>. El argumento <CODE>name</CODE> para <CODE>ref</CODE> es necesario
para transformaciones a groff y HTML. La definici&oacute;n de macro de groff que
emplea Linuxdoc-SGML no soporta referencias cruzadas, y algunas veces es
preferible referirse a ella por su nombre en lugar de por su n&uacute;mero.</P>
<P>Por ejemplo, esta secci&oacute;n es la 
<A HREF="#cross-ref">Cross-references</A>. </P>
<P>Existe tambi&eacute;n un elemento <CODE>url</CODE> para los ``Universal Resource
Locators'', o URLs, empleados en los World Wide Web. Este elemento deber&aacute;
ser empleado para referirse a otros documentos, ficheros disponibles para
FTP, y dem&aacute;s. Por ejemplo,</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Puedes obtener los documentos HOWTO en
&lt;tt&gt;&lt;htmlurl url=&quot;http://sunsite.unc.edu/mdw/HOWTO/&quot; 
name=&quot;The Linux HOWTO INDEX&quot;&gt;&lt;/tt&gt;.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El argumento <CODE>url</CODE> especifica el URL actual en s&iacute; mismo. Un enlace al
URL en cuesti&oacute;n ser&aacute; a&ntilde;adido actualmente al documento HTML. </P>
<P>El argumento opcional <CODE>name</CODE> especifica el texto que ser&aacute; anclado al
URL (para la conversi&oacute;n HTML) o que dar&aacute; nombre como descripci&oacute;n del URL
(para LaTeX y groff). Si no se incluye ning&uacute;n par&aacute;metro <CODE>name</CODE>, se
emplear&aacute; el propio del URL. </P>
<P>Por ejemplo, puede obtener el paquete Linuxdoc-SGML de </P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/text/linuxdoc-sgml-1.5.tar.gz">ftp://sunsite.unc.edu/pub/Linux/utils/text/linuxdoc-sgml-1.5.tar.gz</A></CODE>. </P>
<P>Una variante muy &uacute;til de este <CODE>htmlurl</CODE>, que suprime la creaci&oacute;n de la
parte correspondiente al URL excepto en HTML. Lo cual es muy &uacute;til para
cosas como las direcciones e-mail personales; se puede escribir: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;tt&gt;&lt;htmlurl url=&quot;mailto:esr@snark.thyrsus.com&quot;
name=&quot;esr@snark.thyrsus.com&quot;&gt;&lt;/tt&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y obtener ``<CODE>esr@snark.thyrsus.com</CODE>'' en la salida a texto mejor que el
repetitivo ``<CODE>esr@snark.thyrsus.com
&lt;mailto:esr@snark.thyrsus.com&gt;</CODE>'' manteniendo la validez en los
documentos URL y HTML.</P>


<H2><A NAME="ss3.6">3.6 Fuentes (Tipogr&aacute;ficas)</A></H2>


<P>En esencia, las mismas fuentes soportadas por LaTeX lo son por
Linuxdoc-SGML.  N&oacute;tese de todos modos, que en la conversi&oacute;n a texto ASCII
(v&iacute;a groff) se prescinde de la informaci&oacute;n relativa a fuentes. Por tanto,
podr&aacute;n emplearse las fuentes todo lo que se quiera, con el beneficio
correspondiente en la conversi&oacute;n a LaTeX. Pero no basarse en las fuentes
para hacer comprender algo concreto en la versi&oacute;n ASCII. </P>
<P>Particularmente, la etiqueta <CODE>tt</CODE> descrita anteriormente puede ser
empleada para obtener una fuente de tipo ``m&aacute;quina de escribir'' de
anchura constante, que deber&aacute; emplearse en todas las direcciones e-mail,
nombres de m&aacute;quina, de fichero, etc. </P>
<P>Por ejemplo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
He aqui una muestra de &lt;tt&gt;texto tipo maquina de escribir &lt;/tt&gt; para
ser incluida en el documento. 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El equivalente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
He aqui una muestra de &lt;tt/texto tipo maquina de escribir/ para ser
incluido en el documento. 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Recu&eacute;rdese que s&oacute;lo se puede hacer uso de este m&eacute;todo abreviado si el
texto englobado no contiene barras. </P>
<P>Se pueden conseguir otras fuentes; <CODE>bf</CODE> para obtener <B>negrita</B> y
<CODE>em</CODE> para obtener <EM>cursiva</EM>. Bastantes m&aacute;s tipos de fuentes son
soportados tambi&eacute;n, pero no las recomiendo, porque al convertir esos
documentos a otros formatos como el HTML podr &iacute;an no ser soportados. La
negrita, tipo m&aacute;quina de escribir, y cursiva
<SL>N. del T.<BR><B>Boldface</B>, <CODE>typewriter</CODE> e <EM>italics</EM> en Ingl&eacute;s.</SL>

deber&iacute;an ser todas las necesarias.</P>


<H2><A NAME="ss3.7">3.7 Listados</A></H2>


<P>Existen varios tipos de listados soportados. Son:</P>
<P>
<UL>
<LI><CODE>itemize</CODE> para listados marcados con puntos como este</LI>
<LI><CODE>enum</CODE> para listados numerados</LI>
<LI><CODE>descrip</CODE> para obtener listados ``descriptivos''</LI>
</UL>
</P>
<P>Cada elemento o &iacute;tem de un listado <CODE>itemize</CODE> o <CODE>enum</CODE> deber&aacute; ser
marcado con una etiqueta <CODE>item</CODE>. Los &iacute;tems en <CODE>descrip</CODE> son marcados
con <CODE>tag</CODE>. </P>
<P>Por ejemplo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;itemize&gt;
&lt;item&gt;He aqui un item.
&lt;item&gt;He aqui un segundo item.
&lt;/itemize&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Que tendr&aacute; este aspecto:</P>
<P>
<UL>
<LI>He aqui un item</LI>
<LI>He aqui un segundo item</LI>
</UL>
</P>
<P>O, para un <CODE>enum</CODE>,</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;enum&gt;
&lt;item&gt;He aqui el primer item.
&lt;item&gt;He aqui el segundo item.
&lt;/enum&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ya se coge la idea. Los listados pueden contener niveles tambi&eacute;n; ver el
documento de ejemplo para m&aacute;s detalles. </P>
<P>Un listado <CODE>descrip</CODE> es ligeramente diferente, y tambi&eacute;n ligeramente
m&aacute;s feo, pero podr&iacute;as querer emplearlo en ciertas ocasiones: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;descrip&gt;
&lt;tag/Gnats./ bugs raros que vuelan por el ventilador de tu disipador.
&lt;tag/Gnus./ bugs raros que corren por tu CPU.
&lt;/descrip&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>que acaban teniendo este aspecto:</P>
<P>
<DL>
<DT><B>Gnats.</B><DD><P>bugs raros que vuelan por el ventilador de tu disipador.</P>
<DT><B>Gnus.</B><DD><P>bugs raros que corren por tu CPU.</P>
</DL>
</P>


<H2><A NAME="ss3.8">3.8 M&aacute;s Informaci&oacute;n.</A></H2>


<P>
<UL>
<LI>The QWERTZ User's Guide est&aacute; disponible en: <CODE>
<A HREF="ftp://ftp.cs.cornell.edu/pub/mdw/SGML">ftp://ftp.cs.cornell.edu/pub/mdw/SGML</A></CODE>.

QWERTZ (y por tanto, Linuxdoc-SGML) tiene bastantes prestaciones como
f&oacute;rmulas matem&aacute;ticas, tablas, figuras, y dem&aacute;s. No recomiendo emplear la
mayor&iacute;a de estas prestaciones en los HOWTOs sobre LiNUX debido a que no
saldr&iacute;an bien en las versiones de texto ASCII.

Si deseases escribir
documentaci&oacute;n gen&eacute;rica en SGML, sugiero emplear el DTD QWERTZ original, en
lugar del ``retocado'' Linuxdoc-SGML, que he modificado para el uso en
particular con los HOWTOs de LiNUX y documentaci&oacute;n similar. 
</LI>
<LI>Las herramientas originales QWERTZ de Tom Gordon pueden obtenerse
en:<BR> <CODE>
<A HREF="ftp://ftp.gmd.de/GMD/sgml">ftp://ftp.gmd.de/GMD/sgml</A></CODE>. 
</LI>
<LI>M&aacute;s informaci&oacute;n acerca de SGML puede encontrarse en las siguientes
p&aacute;ginas WWW: 

<OL>
<LI><CODE>
<A HREF="http://www.w3.org/hypertext/WWW/MarkUp/SGML/">SGML en la web</A></CODE> 
</LI>
<LI><CODE>
<A HREF="http://www.sil.org/sgml/sgml.html">P&aacute;gina Web del SGML</A></CODE></LI>
</OL>

       </LI>
<LI>El analizador de James Clark's <CODE>sgmls</CODE>, su sucesor, <CODE>nsgmls</CODE> y
otras herramientas pueden encontrarse en:  <CODE>
<A HREF="ftp://ftp.jclark.com">ftp://ftp.jclark.com</A> </CODE> y en
<CODE>
<A HREF="http://www.jclark.com">James Clark's WWW Page</A></CODE>. 
</LI>
<LI>Puedes unirte a la lista de correo de Linuxdoc-SGML enviando correo
a:

<CODE>
<A HREF="mailto:majordomo@via.ecp.fr">majordomo@via.ecp.fr</A></CODE> con <CODE>subscribe linuxdoc-sgml</CODE> en el
cuerpo del mensaje. La direcci&oacute;n de correo es:  <CODE>
<A HREF="mailto:linuxdoc-sgml@via.ecp.fr">linuxdoc-sgml@via.ecp.fr</A></CODE>. 
</LI>
<LI>Se puede obtener m&aacute;s informaci&oacute;n sobre <CODE>LyX</CODE> en:

<CODE>
<A HREF="http://wsiserv.informatik.uni-tuebingen.de/~ettrich/">LyX WWW Page</A></CODE>.  <CODE>LyX</CODE> es un procesador de texto de alto
nivel, interface al LaTeX, quasi-WYSIWYG
<SL>N.del T.<BR> WYSIWYG :
``What You See Is What You Get'', algo as&iacute; como ``lo que ves es lo que vas
a obtener''</SL>
, que genera muchos estilos y dise&ntilde;os casi
autom&aacute;ticamente. Acelera el aprendizaje del LaTeX y hace que dise&ntilde;os
complicados sean f&aacute;ciles e intuitivos. 
</LI>
</UL>
</P>


<HR>
<A HREF="Linuxdoc-Como-2.html">Anterior</A>
<A HREF="Linuxdoc-Como-4.html">Siguiente</A>
<A HREF="Linuxdoc-Como.html#toc3">Indice</A>
</BODY>
</HTML>
