<HTML>
<HEAD>
<TITLE>Gu&iacute;a de usuario de Linuxdoc-SGML: Instalaci&oacute;n.</TITLE>
</HEAD>
<BODY>
<A HREF="Linuxdoc-Como-1.html">Anterior</A>
<A HREF="Linuxdoc-Como-3.html">Siguiente</A>
<A HREF="Linuxdoc-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Instalaci&oacute;n.</A></H2>


<P>Hacerse con <CODE>linuxdoc-sgml-1.5.tar.gz</CODE> de alguno de los siguientes
servidores ftp:  </P>
<P>
<UL>
<LI><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/text/linuxdoc-sgml-1.5.tar.gz">ftp://sunsite.unc.edu/pub/Linux/utils/text/linuxdoc-sgml-1.5.tar.gz</A></CODE>
</LI>
<LI><CODE>
<A HREF="ftp://tsx-11.mit.edu/pub/linux/docs/linuxdoc-sgml-1.5.tar.gz">ftp://tsx-11.mit.edu/pub/linux/docs/linuxdoc-sgml-1.5.tar.gz</A></CODE>
</LI>
<LI><CODE>
<A HREF="ftp://ftp.cc.gatech.edu/pub/people/gregh/linuxdoc-sgml/linuxdoc-sgml-1.5.tar.gz">ftp://ftp.cc.gatech.edu/pub/people/gregh/linuxdoc-sgml/linuxdoc-sgml-1.5.tar.gz</A></CODE>
</LI>
</UL>
</P>
<P>Parches actualizados para la versi&oacute;n 1.5 pueden encontrarse en:</P>
<P><CODE>
<A HREF="ftp://ftp.cc.gatech.edu/pub/people/gregh/linuxdoc-sgml">ftp://ftp.cc.gatech.edu/pub/people/gregh/linuxdoc-sgml</A></CODE>. </P>
<P>Puede obtener informaci&oacute;n actualizada en:</P>
<P><CODE>
<A HREF="http://www.informatik.tu-muenchen.de/~schwarz/linuxdoc-sgml/">Linuxdoc-SGML WWW Page</A></CODE>. </P>
<P>El archivo <CODE>linuxdoc-sgml-1.5.tar.gz</CODE> contiene todo lo necesario para
escribir documentos SGML y convertirlos a groff, LaTeX, HTML, GNU info,
LyX, y RTF. Adem&aacute;s de este paquete, se necesitar&aacute;n las siguientes
herramientas -- no son requeridas por el sistema SGML en s&iacute;, pero sugiero
hacerse con ellas para poder as&iacute; formatear tus documentos y verificar que
todo aparece como debe antes de distribuirlas. </P>
<P>
<OL>
<LI><CODE>groff</CODE>. <EM>Necesitas</EM> la versi&oacute;n 1.08 &oacute; 1.09. Aparentemente,
parte del tratamiento de los m&aacute;rgenes en <CODE>groff</CODE> se encuentra en estado
de perfeccionamiento de versi&oacute;n en versi&oacute;n; ambos funcionar&aacute;n, pero se
obtendr&aacute;n resultados ligeramente dist intos. (Particularmente, en la 1.09
el margen izquierdo no es sangrado dos caracteres como lo era en la 1.08.<BR>
 Es soportable en la 1.09, pero en la 1.08, tiene un aspecto terrible) 
Las versiones precedentes a la 1.08 <EM>no funcionar&aacute;n</EM>. Puedes obtener
esto de <CODE>
<A HREF="ftp://prep.ai.mit.edu/pub/gnu">ftp://prep.ai.mit.edu/pub/gnu</A></CODE>.

Hay una versi&oacute;n binaria para LiNUX en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/text">ftp://sunsite.unc.edu/pub/Linux/utils/text</A></CODE> Tambi&eacute;n. 
Necesitar&aacute;s <CODE>groff</CODE> para producir texto ASCII simple a partir tus
documentos SGML.  (TeX/LaTeX se emplear&aacute;n para obtener bonitas copias
impresas en PostScript y dvi).
</LI>
<LI>TeX y LaTeX. Estos est&aacute;n disponibles m&aacute;s o menos, en todos lados; no
deber&iacute;a de haber problema en conseguirlo e instalarlo. (Hay una
distribuci&oacute;n de binarios en <CODE>sunsite.unc.edu</CODE>). Por supuesto, s&oacute;lo lo
necesitaremos si pretendemos formatear nues tros documentos SGML con
LaTeX/TeX, por lo que esto es opcional. 
</LI>
<LI>Si quieres visualizar el HTML generado, recomiendo conseguir el NCSA
Mosaic 2.6 o posterior, disponible en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/Network/info-systems">ftp://sunsite.unc.edu/pub/Linux/system/Network/info-systems</A></CODE>. 
</LI>
<LI><CODE>gawk</CODE> y las herramientas GNU info, para formatear y visualizar
los ficheros info. Est&aacute;n disponibles tambi&eacute;n en

<CODE>
<A HREF="ftp://prep.ai.mit.edu/pub/gnu">ftp://prep.ai.mit.edu/pub/gnu</A></CODE>, o en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/text">ftp://sunsite.unc.edu/pub/Linux/utils/text</A></CODE> (para <CODE>gawk</CODE>) y

<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/Manual-pagers">ftp://sunsite.unc.edu/pub/Linux/system/Manual-pagers</A></CODE> (para
las herramientas GNU info.)  </LI>
<LI>LyX (un interface quasi-WYSIWYG para el
LaTeX, con esquemas SGML), est&aacute; disponible en <CODE>
<A HREF="ftp://ftp.via.ecp.fr">ftp://ftp.via.ecp.fr</A></CODE>. 
</LI>
</OL>
</P>

<H2><A NAME="ss2.1">2.1 Instalaci&oacute;n del software</A></H2>


<P>Los pasos necesarios para la instalaci&oacute;n y configuraci&oacute;n de
<CODE>linuxdoc-sgml</CODE> son los siguientes: </P>
<P>
<OL>
<LI>Primero, desempaquetar el archivo tar <CODE>linuxdoc-sgml-1.5.tar.gz</CODE>
donde sea. Esto crear&aacute; el directorio <CODE>linuxdoc-sgml-1.5</CODE>, donde
residir&aacute;n todos los archivos SGML. No importa donde descomprimas este
archivo; simplemente, no muevas nada del dir ectorio
<CODE>linuxdoc-sgml-1.5</CODE>. 
</LI>
<LI>Leer el fichero <CODE>INSTALL</CODE>. Contiene instrucciones detalladas de
instalaci&oacute;n. 

Si todo va bien, estar&aacute;s listo para empezar a utilizar el sistema.</LI>
</OL>
</P>


<H2><A NAME="ss2.2">2.2 Formateando documentos</A></H2>


<P>Digamos que tienes el documento SGML <CODE>pepito.sgml</CODE>
que queremos formatear. He aqu&iacute; una revisi&oacute;n
gen&eacute;rica de c&oacute;mo formatear el documento a lo s distintos formatos.  Para
ver una lista completa de opciones, consultar las p&aacute;ginas <CODE>man</CODE></P>

<H3>Obteniendo texto plano como salida.</H3>


<P>Si se quiere obtener texto plano como resultado, emplear el comando: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgml2txt foo.sgml
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>N&oacute;tese que he limitado la conversi&oacute;n de groff para la salida de texto
simple.  Es decir, he quitado los encabezamientos de p&aacute;gina, cambiado los
m&aacute;rgenes, y dem&aacute;s. Con un poco de trabajo, puedes producir PostScript y
DVI de la salida de groff, pero sugiero que se emplee LaTeX para ello. </P>
<P>Puedes producir fuentes groff para p&aacute;ginas man, que pueden ser formateadas
con <CODE>groff -man</CODE>. Para hacer esto:  
<BLOCKQUOTE><CODE>
<PRE>
 % sgml2txt -man
foo.sgml 
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Produciendo LaTeX, DVI o PostScript </H3>


<P>Para producir documentos LaTeX a partir del fuente SGML, ejecutar: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgml2latex foo.sgml
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si quieres producir salida PostScript (v&iacute;a <CODE>dvips</CODE>) emplea la opci&oacute;n
<CODE>-p</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgml2latex -p foo.sgml
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>O puedes producir un fichero DVI usando el par&aacute;metro <CODE>-d</CODE>, como aqu&iacute;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgml2latex -d foo.sgml
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Produciendo salida HTML</H3>


<P>Si quieres obtener HTML como salida, haz lo siguiente: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgml2html -img foo.sgml
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto producir&aacute; tanto <CODE>foo.html</CODE>, como <CODE>foo-1.html</CODE>,
<CODE>foo-2.html</CODE>, y dem&aacute;s ---un archivo por cada secci&oacute;n del documento. 
Ejecuta tu navegador WWW en <CODE>foo.html</CODE>, que es el archivo cabecera. 
Asegurarse de que todos los ficheros HTML correspondientes al documento
est&aacute;n en un directorio, ya que se referencian unos a otros con URLs
locales.  Los iconos referenciados en la salida HTML est&aacute;n localizados en
<CODE>$LINUXDOCLIB/icons</CODE>. Estos deber&aacute;n ser copiados tambi&eacute;n a
la localizaci&oacute;n final de los documentos HTML. <CODE>$LINUXDOCLIB</CODE>
est&aacute; definida al comienzo de los scripts de con versi&oacute;n SGML. </P>
<P>Si empleas <CODE>sgml2html</CODE> sin el par&aacute;metro <CODE>-img</CODE>, los documentos HTML
tendr&aacute;n las etiquetas ``previous'', ``next'', y ``table of contents'' para
la navegaci&oacute;n. Puedes saltarte esa configuraci&oacute;n por defecto creando un
archivo en <CODE>$LINUXDOCLIB /rep/html/&lt;nombre_archivo&gt;</CODE>,
sustituyendo con tus palabras, las apropiadas para los distintos
lenguajes. El archivo posee el siguiente formato: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
PrevPage:    nuevovalor
NextPage:    nuevovalor
TOC:         nuevovalor
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ver el ejemplo <CODE>deutsch</CODE>.</P>

<H3>Creando salida GNU Info </H3>


<P>Si quieres formatear tu archivo para el visualizador GNU info, lo &uacute;nico
que has de ejecutar es: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgml2info foo.sgml
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Creando salida LyX</H3>


<P>Para obtener salida LyX, emplear el comando:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgml2lyx foo.sgml
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Creando salida RTF</H3>


<P>Si quieres obtener salida RTF, usa el comando:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgml2rtf foo.sgml
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto producir&aacute; como salida <CODE>foo.rtf</CODE>, as&iacute; como <CODE>foo-1.rtf</CODE>,
<CODE>foo-2.rtf</CODE>, y as&iacute;; un fichero por cada secci&oacute;n del documento. </P>

<H3>Comprobando la sintaxis del SGML</H3>


<P>Si lo &uacute;nico que quieres es comprobar si habr&iacute;a errores en la conversi&oacute;n
del SGML emplea el script <CODE>sgmlcheck</CODE>. Por ejemplo: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgmlcheck foo.sgml
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss2.3">2.3 Tabla de C&oacute;digos ISO 8859-1 </A></H2>


<P>La tabla de caracteres ISO 8859-1 puede ser usada con caracteres
internacionales en transformaciones a texto ASCII plano, LaTeX y
HTML
<SL> nota para los textos en Castellano: 

Esta es la tabla que se ha de emplear si se emplean tildes, e&ntilde;es, etc;
basta con escribirlos como tales en los fuentes, y emplear el par&aacute;metro
'-l' en los scripts de conversi&oacute;n que se empleen (sgml2latex, sgml2text o
sgml2html)</SL>
 Para hacer u so de esta propiedad, pasar al script
el par&aacute;metro <CODE>-l</CODE>, por ejemplo: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% sgml2txt -l foo.sgml 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Puedes emplear los caracteres ISO 8859-1 en los fuentes, ser&aacute;n
transformados en los c&oacute;digos de escape apropiados de cada tipo de formato. </P>


<HR>
<A HREF="Linuxdoc-Como-1.html">Anterior</A>
<A HREF="Linuxdoc-Como-3.html">Siguiente</A>
<A HREF="Linuxdoc-Como.html#toc2">Indice</A>
</BODY>
</HTML>
