<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="description" CONTENT="How not to design junk Web pages.">
   <META NAME="keywords" CONTENT="HTML style, good design, bad design">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.08 [en] (X11; I; Linux 2.0.31 i586) [Netscape]">
   <TITLE>HTML Hell Page</TITLE>
<LINK rev=made href=mailto:esr@snark.thyrsus.com>
</HEAD>
<BODY>
&nbsp;
<TABLE CELLPADDING=0 WIDTH="100%" >
<TR>
<TD WIDTH="30%">Volver a la <A HREF="http://www.ccil.org/~esr">P&aacute;gina
de Eric</A></TD>

<TD ALIGN=CENTER WIDTH="30%">Ir al <A HREF="http://www.ccil.org/~esr/sitemap.html">Mapa
del servidor</A></TD>

<TD ALIGN=RIGHT WIDTH="30%">$Fecha: 1998/01/26 02:27:33 $&nbsp;</TD>
</TR>
</TABLE>

<HR>
<CENTER>
<H1>
<FONT COLOR="#FF0000">Bienvenido a la p&aacute;gina del Infierno HTML</FONT></H1></CENTER>

<CENTER><I>"El infierno es es lugar en que habitan otros dise&ntilde;adores
de p&aacute;ginas Web." -- Jean-Paul Sartre, puesto al d&iacute;a</I></CENTER>

<H1>
Sabes que est&aacute;s en el <FONT COLOR="#FF0000">Infierno del dise&ntilde;o</FONT>
cuando ves...</H1>

<DL>
<DT>
<B>texto parpadeante</B></DT>

<DD>
El texto parpadeante hace casi imposible que se preste atenci&oacute;n
a nada m&aacute;s en una p&aacute;gina. Induce en un 87% de los que se
mueven por Internet un bloqueo mental irremediable, muy similar al de un
conejo cegado por los faros de una furgoneta que se precipita sobre &eacute;l.
Esto no es bueno. Si abusas de este recurso, mereces que te fusilen. <I>Pista:</I>
si&nbsp; <B>usas </B>texto parpadeante, ya est&aacute;s abusando de &eacute;l.</DD>

<DT>
<B>animaciones gratuitas</B></DT>

<DD>
Con las animaciones consigues a&ntilde;adir el insulto del aumento en el
tiempo de recepci&oacute;n a las maravillosas ofensas del texto parpadeante.
A aquellos que abusan de este recurso habr&iacute;a que incrustarles libros
desplegables en cada orificio de su cuerpo hasta que caigan en la cuenta
de que un bucle con dos o tres gr&aacute;ficos por segundo es a&uacute;n
menos placentero.</DD>

<DT>
<B>textos deslizantes</B></DT>

<DD>
&iquest;Crees, por tanto, que el texto parpadeante y las animaciones injustificadas
son las peores formas de abuso que esos dise&ntilde;adores que se creen
tan brillantes pueden perpetrar sobre tu retina?. Nada de eso. Para estos
tiempos en los que demasiado no es bastante, el Gran Sat&aacute;n de Redmon
nos ha obsequiado con &lt;MARQUEE>, que pone la creaci&oacute;n de textos
deslizantes animados a tiro de par&eacute;ntesis en angulo (&lt;). Este
primo bastardo del texto parpadeante puede provocar v&eacute;rtigo y mareos
en los individuos susceptibles, reduci&eacute;ndolos a un estado que puede
describirse con exactitud como esa babeante idiotez propia de un lobotomizado
que es prerequisito esencial para la adquisici&oacute;n de productos Microsoft.
&iquest;Coincidencia?. Creemos que no.</DD>

<DT>
<B>fondos extravagantes</B></DT>

<DD>
La pr&oacute;xima vez que topemos con una p&aacute;gina compuesta por alguien
que crea que emplear llamas saltarinas o un gran mosaico rotatorio de siete
niveles de rosa fuerte como fondo resulta inteligente, juramos que pasaremos
a trav&eacute;s de la pantalla del monitor para cortarle la garganta. Si
existe algo peor que el texto parpadeante para provocar fatiga ocular y
dolor de cabeza, aqu&iacute; lo tienes.</DD>

<DT>
<B>combinaciones ilegibles de texto y fondo</B></DT>

<DD>
El mundo est&aacute; lleno de payasos que creen que sus p&aacute;ginas
de texto tienen mejor aspecto si las maquillan con colores de payaso, con
alardes de colores incompatibles (al t&iacute;pico idiota que usa fondos
extravagantes, tambi&eacute;n le encanta esto). Las palabras m&aacute;gicas
que tales incompetentes deben aprender son "contraste de luminancia". Tu
sentido del color es algo que s&oacute;lo te concierne a t&iacute; y a
los Dioses del Buen Gusto, pero si no te atienes a algo parecido a textos
claros sobre fondo oscuro o viceversa, espantar&aacute;s a aquellos navegantes
de la red a los que les gusta poder leer <I>sin</I> realizar un esfuerzo
perceptible.</DD>

<DT>
<B>encabezamientos decorados</B></DT>

<DD>
Los encabezamientos decorados son dif&iacute;ciles de soportar. A menos,
por supuesto, que creas que cada navegante que topa con tu p&aacute;gina
anda buscando una oportunidad de tener que esperar lo suficiente como para
ver crecer esos bosquejos mientras se cargan las decoraciones en formato
GIF que se limitan a visualizar un encabezamiento que podr&iacute;as haber
metido en un tipo con gusto, bonito, y <I>r&aacute;pido</I>.</DD>

<DT>
<B>instrucciones "cambie el tama&ntilde;o de su navegante a ..."</B></DT>

<DD>
S&iacute;. Como si quisi&eacute;ramos que nuestros navegantes ocupen un
trozo tan grande de nuestra zona de trabajo. Pero lo que resulta m&aacute;s
molesto es que la mayor parte de las veces estos sujetos calculan mal.
As&iacute;, si su navegante emplea un desplazamiento de 8 pixels, el nuestro
emplea 20, y olvidan activar las bandas de desplazamiento de modo que se
equivocan por m&aacute;s de 30 pixels y los gr&aacute;ficos que se visualizan
son una completa basura.</DD>
</DL>

<H1>
Sabes que est&aacute;s en el <FONT COLOR="#FF0000">Infierno del contenido</FONT>
cuando ves...</H1>

<DL>
<DT>
<B>contadores de acceso</B></DT>

<DD>
"Eres el visitante n&uacute;mero 2.317 de esta p&aacute;gina." S&iacute;,
como que nos importa mucho. No cuesta ning&uacute;n esfuerzo localizar
mediante Yahoo y Alta Vista todas aquellas p&aacute;ginas con referencias
a (por decir algo) "polinizaci&oacute;n" o "literatura cuneiforme" .&nbsp;
En este maravilloso mundo, los contadores de acceso no son sino una forma
particularmente subnormal de exhibir el ego, algo que impresiona tan s&oacute;lo
a aquellos con mentalidad de lemming. Pueden decirte cuanta gente fue abducida
para acabar aterrizando en una p&aacute;gina de recepci&oacute;n pretendidamente
impactante, pero no te dar&aacute;n ni una sola pista sobre cuantos de
ellos murmuraron "&iexcl;imb&eacute;ciles! " y se fueron de all&iacute;
m&aacute;s r&aacute;pido de lo que tu puedas decir "hacer click". Para
a&ntilde;adir una herida adicional a semejante insulto, los contadores
de acceso consumen espaci&oacute; de cach&eacute;, con lo que a&ntilde;aden
m&aacute;s carga a los sufridos hilos de Internet.</DD>

<DT>
<B>enlaces perdidos</B></DT>

<DD>
Los enlaces al vac&iacute;o son una pena. La gente que tiene montones de
enlaces fantasma en sus p&aacute;ginas da pena. Bueno, todos vemos como
algun enlace se nos evapora de vez en cuando --&nbsp; &iquest;pero no has
notado que los enlaces a ninguna parte aparecen generalmente en masa, como
las cucarachas?. La raz&oacute;n consiste en que la gente que tiene buenas
p&aacute;ginas web la usa, y modifica y corrige los enlaces perdidos con
rapidez, de modo que dificilmente tiene m&aacute;s de uno en un momento
dado. Una p&aacute;gina con un mont&oacute;n de enlaces perdidos est&aacute;
gritando "Mi autor es un perezoso, alguien con la misma actitud que un
terratiente encargado de un palacio lleno de cucarachas".</DD>

<DT>
<B>p&aacute;ginas eternamente en construcci&oacute;n</B></DT>

<DD>
Los que se mueven por Internet aprenden r&aacute;pidamente que por cada
diez signos de esos que indican "en construcci&oacute;n" que desaparecen,
quiz&aacute; haya dos que probablemente no nos dejen antes de la muerte
t&eacute;rmica del Universo. Resulta est&uacute;pido. El HTML no es como
construir cohetes y montar el prototipo de una p&aacute;gina no resulta
trabajoso. Todo aquel que no pueda encontrar tiempo para eliminar los dichosos
signos de "en construcci&oacute;n" de sus p&aacute;ginas deber&iacute;a
dejarlo estar y buscar un pasatiempo m&aacute;s ajustado a sus habilidades,
tal como (por ejemplo) babear, o mirar una pared.</DD>
</DL>

<H1>
Sabes que est&aacute;s en el <FONT COLOR="#FF0000">Infierno del estilo</FONT>
cuando ves...</H1>

<DL>
<DT>
<B>meras exhibiciones de vanidad</B></DT>

<DD>
Si tuvieramos una moneda por cada una de las p&aacute;ginas que hemos visto
que son una variaci&oacute;n que induce al bostezo del tipo "&iexcl;Hola!,
este soy yo y esta es una foto bastante maja de mi perro/gato/novio/novia",
podr&iacute;amos retirarnos ma&ntilde;ana mismo a Aruba con un ramillete
de supermodelos. <I>Pista</I>: si no tienes nada que decir, c&aacute;llate.
Y mantente lejos de la red; la vida es demasiado corta para que aburras
a los dem&aacute;s.</DD>

<DT>
<B>ansiedad y pretenciosidad</B></DT>

<DD>
Pens&aacute;bamos darle lo suyo a los fondos en negro, hasta que ca&iacute;mos
en la cuenta de que el negro no es el problema. Lo son las tres poblaciones
superpuestas de desgraciados que integran el 99% de los fondos negros que
se encuentran en la red. A saber (a) artistas aficionados buscando impactar,
(b) adolescentes angustiados, y (c) esos tertulianos a la moda que creen
realmente que suscribirse a <I>Wired</I> los pone a la &uacute;ltima. <I>Pista:</I>
la ansiedad y la pretenciosidad <B>aburren</B>. La gente que escupe mala
poes&iacute;a, se cree importante por escribir cosas raras, o comercia
con borrosas im&aacute;genes de pretendido arte ultramoderno deber&iacute;a
cortarse las venas, unirse a una comuna, o hacer cualquier otra cosa que
permita mantener alejadas de la red sus birrias llenas de autoindulgencia.</DD>

<DT>
<B>verborrea corporativa</B></DT>

<DD>
Todos lo hemos visto -- esas p&aacute;ginas corporativas que empiezan cargando
un infernal logotipo monstruoso. Y despu&eacute;s de haber estado esperando
un mill&oacute;n de a&ntilde;os hasta que se completara, el resto de la
p&aacute;gina consiste en una tonelada de tonter&iacute;as sobre lo maravillosa
que es la compa&ntilde;&iacute;a, alguna est&uacute;pida promoci&oacute;n
que es simplemente un cebo para que te suscribas a su lista de correo y
<I>ning&uacute;n
contenido</I>. Pista para los androides del marketing:
<I>no</I> es eficaz,
a menos que lo que pretendas sea hacer que tu compa&ntilde;&iacute;a se
incluya entre las dem&aacute;s subnormales que se apuntan a lo del "yo
tambi&eacute;n", en la creencia de que tener una direcci&oacute;n en la
red va a bastar para que parezca que tienen algo lejanamente similar a
una idea.&iexcl;No!.</DD>

<DT>
<B>anuncios infernales</B></DT>

<DD>
&iquest;No te encantan esos anuncios a principio de la p&aacute;gina que
cambian con cada nuevo acceso?. Si te est&aacute;s moviendo entre una p&aacute;gina
inicial y una subordinada dedicada a un tema particular, &iexcl;tienes
el dudoso placer de esperar a que se cargue un nuevo anuncio gr&aacute;fico
en cada ocasi&oacute;n!</DD>

<DT>
<B>sin direcci&oacute;n de e-mail a la que contestar</B></DT>

<DD>
Esa gente quieren que les mires y les escuches, pero no quieren o&iacute;rte
a t&iacute;. &iquest;No te parece interesante que la mitad de las p&aacute;ginas
Web de las compa&ntilde;&iacute;as incluidas en el indice 500 de Fortune,
los grandes nombres como McDonald's, no te digan su direcci&oacute;n de
correo?. Es una muestra de lo mucho que esas maravillas sin entra&ntilde;as
valoran <I>realmente</I> a sus clientes. Otro consejo para los androides
del marketing: este tipo de cosas hace que tu compa&ntilde;&iacute;a parezca
exactamente tan arrogante, est&uacute;pida, e indiferente hacia sus clientes
como lo es de verdad. Piensa en una direcci&oacute;n de e-mail para recoger
opiniones como una especie de molestia inevitable.</DD>
</DL>

<H1>
Y sabes que est&aacute;s en el <FONT COLOR="#FF0000">Infierno de las extensiones
</FONT>cuando
ves...</H1>

<DL>
<DT>
<B>c&oacute;digo HTML incorrecto</B></DT>

<DD>
El mundo tiene que sufrir un mont&oacute;n de c&oacute;digo HTML err&oacute;neo
porque da la casualidad de que pasa a trav&eacute;s del transtornado int&eacute;rprete
que se encuentra en el interior de ese descomunal navegante que tanto gusta
a todo el mundo. El dise&ntilde;ador consigue adem&aacute;s un premio a
la perversidad si puede hacer que se comporte de forma radicalmente diferente
en distintos navegantes o en distintas versiones de los mismos.</DD>

<DT>
<B>extensiones inestables</B></DT>

<DD>
Sencillamente nos encanta ver como nuestro navegante se queda congelado
mientras carga una p&aacute;gina, se cuelga un ratiro, y finalmente se
volatiliza ignominiosamente. Cuando pasa esto, puedes jugarte la pasta
a que est&aacute; empleando una extensi&oacute;n enorme que nadie se preocup&oacute;
jam&aacute;s de depurar adecuadamente (hay un n&uacute;mero semi-infinito
de estas cosas). La mayor ofensa se encuentra sin duda en los...</DD>

<DT>
<B>marcos</B></DT>

<DD>
Los marcos ("frames") son para idiotas. Simplemente no funcionan en la
mayr&iacute;a de los navegantes, y cuelgan a muchos de los que se supone
en teor&iacute;a que deben trabajar con ellos. Se comen un espacio en pantalla
precioso con sus tonter&iacute;as. Y, si se emplean con suficiente ingenio,
hacen casi imposible figurarse donde has estado y como volver al lugar
del que saliste para llegar all&iacute;.</DD>
</DL>

<H1>
Como mejorar tu p&aacute;gina web</H1>
"De acuerdo", est&aacute;s pensando, me has dado buenos consejos sobre
como dejar de fastidiar. &iquest;Tienes algo m&aacute;s positivo que decir?.
&iquest;Algo as&iacute; como cosas que recomiendas que se hagan o de qu&eacute;
forma puedo <I>mejorar</I> mi p&aacute;gina?.
<P>&nbsp;Para t&iacute;, amigo, tengo tres palabras. Contenidos, <I>contenidos</I>
y <B>contenidos</B>. Dale a la audiencia algo por lo que interesarse. Demasiadas
p&aacute;ginas web son algo as&iacute; como cuentos contados por un idiota,
plenos de &eacute;nfasis y ruido pero sin significado alguno. &iquest;Quieres
resultar interesante?. Olv&iacute;date de los gr&aacute;ficos y el impacto
visual . En primer lugar y por encima de todo, <I>di algo interesante</I>.
<H1>
&iquest;Sugerencias?</H1>
&iquest;Tienes tu queja particular sobre el uso nefasto del HTML? <A HREF="mailto:esr@thyrsus.com">&iexcl;Env&iacute;anosla!</A>
<H1>
Agradecimientos</H1>
..a Pete Glasscock por inspirar esta p&aacute;gina, aunque despu&eacute;s
desapareciera de la Web.
<P>...a Patrick Campbell-Preston &lt;patrick@chaos.org.uk> por la mayor
parte de la secci&oacute;n "El infierno de las extensiones".
<P>...a Rob Novak &lt;rnovak@ibm.net> por "anuncios infernales".
<P>Otros han realizado contribuciones y pedido expresamente que <B>no</B>
se les citara.
<H1>
Traducciones</H1>
Puedes encontrar una <A HREF="http://www.kki.net.pl/tarhim/index.htm">traducci&oacute;n
al polaco</A> de esta p&aacute;gina.
<BR>&nbsp;
<BR>&nbsp;
<H1>
M&aacute;s buenos consejos</H1>
Hay una buena gu&iacute;a sobre dise&ntilde;o de p&aacute;ginas web realizada
por <A HREF="http://www.spies.com/~ceej/Words/rant.web.html">C. J. Silverio</A>.
Ejemplos horrendos sobre el mal uso de la t&eacute;cnica pueden encontrarse
en&nbsp; <A HREF="http://www.webpagesthatsuck.com">P&aacute;ginas Web que
apestan</A>. la columna de Jakob Nielsen&nbsp; <A HREF="http://www.sun.com/960416/columns/alertbox/index.html">Los
diez errores principales en el dise&ntilde;o de p&aacute;ginas Web</A>
es muy recomendable. Ver tambi&eacute;n <A HREF="http://www.mcs.net/~jorn/html/terrorist.html">Los
diez mandamientos del dise&ntilde;o Web</A>.
<P>
<HR>
<TABLE CELLPADDING=0 WIDTH="100%" >
<TR>
<TD WIDTH="30%">Ir a&nbsp; <A HREF="http://www.ccil.org/~esr">La p&aacute;gina
de Eric</A></TD>

<TD ALIGN=CENTER WIDTH="30%">Ir al <A HREF="http://www.ccil.org/~esr/sitemap.html">Mapa
del servidor</A></TD>

<TD ALIGN=RIGHT WIDTH="30%">$Fecha: 1998/01/26 02:27:33 $&nbsp;</TD>
</TR>
</TABLE>

<ADDRESS>
Eric S. Raymond &lt;<A HREF="mailto:esr@thyrsus.com">esr@snark.thyrsus.com</A>></ADDRESS>

</BODY>
</HTML>
