<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>LDAP-Linux-Como: Instalaci&oacute;n del servidor LDAP</TITLE>
 <LINK HREF="LDAP-Linux-Como-3.html" REL=next>
 <LINK HREF="LDAP-Linux-Como-1.html" REL=previous>
 <LINK HREF="LDAP-Linux-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="LDAP-Linux-Como-3.html">Página siguiente</A>
<A HREF="LDAP-Linux-Como-1.html">Página anterior</A>
<A HREF="LDAP-Linux-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2. Instalaci&oacute;n del servidor LDAP</A></H2>

<P>Cuatro pasos son necesarios para instalar el servidor: obtener el
paquete, descomprimir y desempaquetar el servidor, configurar los
ficheros <CODE>Makefile</CODE> del programa y compilar el servidor.
<P>
<H2><A NAME="ss2.1">2.1 Obtenci&oacute;n del paquete</A>
</H2>

<P>Existen dos servidores LDAP que se distribuyen libremente: el servidor
LDAP de la Universidad de Michigan y el servidor
<EM>OpenLDAP</EM>. Tambi&eacute;n est&aacute; el <EM>Netscape Directory Server</EM>, que es
libre s&oacute;lo bajo ciertas condiciones (por ejemplo, las instituciones
educativas lo pueden obtener gratis). El servidor <EM>OpenLDAP</EM> est&aacute;
basado en la &uacute;ltima versi&oacute;n del servidor de la Universidad de
Michigan, y hay disponibles listas de correo y documentaci&oacute;n adicional
para &eacute;l. Este documento da por supuesto que est&aacute; Usted utilizando el
servidor <EM>OpenLDAP</EM>.
<P>
<P>La versi&oacute;n comprimida en formato <CODE>.gz</CODE> est&aacute; disponible en la siguiente
direcci&oacute;n: 
<P>
<A HREF="http://www.openldap.org">http://www.openldap.org</A><P>Si desea obtener la &uacute;ltima versi&oacute;n del servidor de la Universidad de
Michigan, dir&iacute;jase a esta direcci&oacute;n:
<P>
<A HREF="ftp://terminator.rs.itd.umich.edu/ldap">ftp://terminator.rs.itd.umich.edu/ldap</A><P>Para escribir este documento nos hemos basado en la &uacute;ltima versi&oacute;n
estable de <EM>OpenLDAP</EM>, utilizando OpenLDAP 1.2.8 sobre un servidor
Slackware Linux con n&uacute;cleo 2.2.6. En la sede Web de <EM>OpenLDAP</EM>
encontrar&aacute; las &uacute;ltimas versiones estables y de desarrollo del servidor
OpenLDAP. En el momento de actualizar este documento, la &uacute;ltima
versi&oacute;n era <CODE>/openldap-stable-20000129.tgz</CODE>. La &uacute;ltima versi&oacute;n
de desarrollo era <CODE>openldap-1.2.9.tgz</CODE> (eran las &uacute;ltimas
versiones en el momento de traducir, <B>N. del T.</B>)
<P>
<H2><A NAME="ss2.2">2.2 Desempaquetado del servidor</A>
</H2>

<P>Ahora que ya dispone del archivo <CODE>.tar.gz</CODE> en su m&aacute;quina local, puede
desempaquetarlo. 
<P>En primer lugar, copie el paquete en un directorio de su conveniencia,
por ejemplo <CODE>/usr/local</CODE>.
<P>Luego utilice la siguiente orden:
<P>
<BLOCKQUOTE><CODE>
<PRE>
tar xvzf openldap-stable.tgz 
</PRE>
</CODE></BLOCKQUOTE>
<P>Tambi&eacute;n puede usar la siguiente orden:
<P>
<BLOCKQUOTE><CODE>
<PRE>
gunzip openldap-stable.tgz | tar xvf - 
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss2.3">2.3 Configuraci&oacute;n del programa</A>
</H2>

<P>Hay varias opciones que tal vez desee personalizar, de manera que el
programa se construya de la forma m&aacute;s adaptada a sus sistema.
<P>
<P>Para configurar el programa s&oacute;lo necesita dos pasos:
<UL>
<LI>Edite el fichero <CODE>ldapconfig.h.edit</CODE>, situado en el
subdirectorio <CODE>include/</CODE> que cuelga del directorio en el que ha
desempaquetado el programa.</LI>
<LI>Ejecute el gui&oacute;n <CODE>./configure</CODE>. Si le gustan las emociones
fuertes, puede editar igualmente el fichero <CODE>Make-common</CODE> en lugar
de ejecutar el gui&oacute;n de configuraci&oacute;n  :^) </LI>
</UL>
<P>
<P>En el fichero <CODE>include/ldapconfig.h.edit</CODE> puede configurar
opciones como el emplazamiento de los demonios <EM>slapd</EM> y
<EM>slurpd</EM>. El fichero propiamente dicho contiene muchos comentarios
y sus opciones por defecto tambi&eacute;n reflejan las opciones que los
administradores eligen con m&aacute;s frecuencia, de manera que si tiene
prisa puede saltarse este paso y ejecutar directamente:
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
vi include/ldapconfig.h.edit 
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>El c&oacute;digo fuente de <EM>OpenLDAP</EM> se distribuye con un gui&oacute;n de
configuraci&oacute;n para ajustar opciones como por ejemplo el directorio de
instalaci&oacute;n y las ««banderas»» del compilador y del enlazador. Escriba
la orden siguiente en el directorio donde haya desempaquetado el
programa: 
<BLOCKQUOTE><CODE>
<PRE>
./configure --help 
</PRE>
</CODE></BLOCKQUOTE>
<P>Ello mostrar&aacute; por pantalla todas las opciones que puede personalizar
con el gui&oacute;n <CODE>configure</CODE> antes de compilar el programa. Algunas
opciones &uacute;tiles para establecer los directorios de instalaci&oacute;n son
<CODE>--prefix=pref</CODE>, <CODE>--exec-prefix=eprefix</CODE> y
<CODE>--bindir=dir</CODE>. Normalmente, si ejecuta <CODE>./configure</CODE>
sin opciones, &eacute;l mismo autodetectar&aacute; las opciones adecuadas y se
preparar&aacute; para construir el paquete en la localizaci&oacute;n com&uacute;n
predeterminada. As&iacute; pues, teclee:
<P>
<BLOCKQUOTE><CODE>
<PRE>
./configure 
</PRE>
</CODE></BLOCKQUOTE>

Y observe el resultado por pantalla para verificar que no se produce
ning&uacute;n error. 
<P>
<H2><A NAME="ss2.4">2.4 Compilaci&oacute;n del servidor</A>
</H2>

<P>Despu&eacute;s de configurar el programa puede empezar a compilarlo. Primero
construya las dependencias mediante la orden:
<P>
<BLOCKQUOTE><CODE>
<PRE>
make depend 
</PRE>
</CODE></BLOCKQUOTE>

Despu&eacute;s compile el servidor mediante la orden:
<BLOCKQUOTE><CODE>
<PRE>
make 
</PRE>
</CODE></BLOCKQUOTE>
<P>Si todo va bien, el servidor se compilar&aacute; tal y como se haya
configurado. En caso contrario, vuelva al paso anterior para revisar
las opciones de configuraci&oacute;n. Revise las sugerencias espec&iacute;ficas para
su plataforma, que se hallan en la ruta <CODE>doc/install/hints</CODE> que
cuelga del directorio en el que desempaquet&oacute; el software.
<P>
<P>Instale luego los ejecutables y las p&aacute;ginas de manual. Es posible que
precise de permisos de superusuario para poder llevarlo a cabo
(depende del lugar en donde instale los ficheros):
<P>
<BLOCKQUOTE><CODE>
<PRE>
su 
make install 
</PRE>
</CODE></BLOCKQUOTE>
<P>Es todo. Ya dispone del ejecutable del servidor y de los ejecutables
de otras varias utilidades. Para saber c&oacute;mo configurar el
funcionamiento de su servidor LDAP, v&eacute;ase la secci&oacute;n 
<A HREF="LDAP-Linux-Como-3.html#3">siguiente</A>.
<P>
<P>Si antes de aprender c&oacute;mo se configura su servidor LDAP desea
verificar los ejecutables reci&eacute;n compilados, las &uacute;ltimas versiones del
servidor <EM>OpenLDAP</EM> vienen con un gui&oacute;n de verificaci&oacute;n. Cuando se
actualiz&oacute; este documento el gui&oacute;n de verificaci&oacute;n no era estable al
100% para todos los diagn&oacute;sticos que llevaba a cabo. De todas maneras
pru&eacute;belo y ejec&uacute;telo, si alg&uacute;n aspecto del gui&oacute;n no funciona bien,
siempre puede pararlo pulsando <CODE>Ctrl+C</CODE>. En nuestro caso, antes
de que el gui&oacute;n o script se detuviera, pudimos observar algunos
mensajes que mostraban que los diagn&oacute;sticos m&aacute;s comunes se hab&iacute;an
llevado a cabo con &eacute;xito. Para ejecutar el gui&oacute;n de verificaci&oacute;n,
c&aacute;mbiese al subdirectorio <CODE>test/</CODE> que cuelga de la ruta en la
que desempaquet&oacute; el software, y luego teclee:  
<P>
<BLOCKQUOTE><CODE>
<PRE>
make
</PRE>
</CODE></BLOCKQUOTE>
<P>
<HR>
<A HREF="LDAP-Linux-Como-3.html">Página siguiente</A>
<A HREF="LDAP-Linux-Como-1.html">Página anterior</A>
<A HREF="LDAP-Linux-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
