<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux WWW-COMO: Configuraci&oacute;n el software del cliente de WWW</TITLE>
 <LINK HREF="WWW-Como-3.html" REL=next>
 <LINK HREF="WWW-Como-1.html" REL=previous>
 <LINK HREF="WWW-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="WWW-Como-3.html">Página siguiente</A>
<A HREF="WWW-Como-1.html">Página anterior</A>
<A HREF="WWW-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2. Configuraci&oacute;n el software del cliente de WWW</A></H2>

<P>El cap&iacute;tulo siguiente est&aacute; dedicado a los usuarios de web. Algunos atajos
y trucos establecidos en versiones actuales de visualizadores de web
comunes. Por favor, no tenga reparos en contactar conmigo si su
visualizador favorito de web no se menciona aqu&iacute;. (Como &eacute;sta es realmente
una versi&oacute;n muy reciente del WWW-COMO, probablemente la mayor&iacute;a de ellos
no est&aacute;n listados...)
<P>Personalmente, yo prefiero el visualizador W3 de Emacs y Lynx ya que
poseen algunas ventajas de velocidad y no hay necesidad de cargar
completamente los gr&aacute;ficos a trav&eacute;s de mi l&iacute;nea telef&oacute;nica de baja
velocidad ;)
<P>
<H2><A NAME="ss2.1">2.1 Descripci&oacute;n general</A>
</H2>

<P>Lynx es el visualizador de Web m&aacute;s peque&ntilde;o que conozco y uso - pero posee
muchas caracter&iacute;sticas especiales, por tanto no se salte este cap&iacute;tulo.
<P>Emacs - bueno, no hay nada que decir sobre el visualizador W3 de Emacs, es
justamente Emacs, como el lector de noticias de Emacs, el lector de correo
de Emacs, etc. pp.
<P>El Netscape Navigator es el &uacute;nico visualizador mencionado aqu&iacute; que es
capaz de esas cosas nuevas y divertidas tales como <EM>JavaScript</EM> y esas
agradables caracter&iacute;sticas de la etiqueta &lt;APPLET&gt; necesarias para
ejecutar <EM>Java</EM>. Por favor, comun&iacute;queme si existe cualquier otro
visualizador de web que pueda hacer una u otra cosa. Realmente me gustar&iacute;a
saberlo.
<P>Hay rumores sobre que Microsoft va a trasladar Internet Explorer a varias
plataformas Unix (quiz&aacute; incluyendo Linux). Si Ud. tiene noticias m&aacute;s
fiables, por favor m&aacute;ndeme un correo electr&oacute;nico.
<P>
<P>
<P>
<P>
<H2><A NAME="ss2.2">2.2 Lynx</A>
</H2>

<P>El m&aacute;s peque&ntilde;o (?, hm, cerca de 650 K de ejecutable) y quiz&aacute; el
visualizador de Web m&aacute;s r&aacute;pido disponible. No come mucho ancho de banda ni
recursos del sistema ya que s&oacute;lo trata con visualizaciones de texto como
cualquier consola, terminal o terminal gr&aacute;fica xterm. Ud. no necesita
ning&uacute;n <EM>sistema de ventanas gr&aacute;ficas X Window</EM> ni megabytes
adicionales del sistema de memoria para ejecutar este peque&ntilde;o
visualizador.
<P>Adem&aacute;s, tambi&eacute;n est&aacute; disponible el c&oacute;digo fuente.
<P>
<H3>D&oacute;nde conseguirlo</H3>

<P>La &uacute;ltima versi&oacute;n es la 2.5 y puede ser obtenida desde
<CODE>
<A HREF="http://www.wfbr.edu/dir/lynx">http://www.wfbr.edu/dir/lynx</A></CODE> o desde casi cualquier servidor
de ftp af&iacute;n a Linux como
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/Network/info-systems/www">ftp://sunsite.unc.edu/pub/Linux/system/Network/info-systems/www/</A></CODE>
o desde cualquier servidor r&eacute;plica.
<P>O eche un vistazo a las <EM>p&aacute;ginas mejoradas de Lynx</EM>
<CODE>
<A HREF="http://www.nyu.edu/pages/wsn/subir/lynx.html">http://www.nyu.edu/pages/wsn/subir/lynx.html</A></CODE>
para informaci&oacute;n sobre el uso de Lynx.
<P>
<P>
<H3>C&oacute;mo instalarlo</H3>

<P>S&oacute;lo obtenga el archivo, desempaqu&eacute;telo, <EM>lea</EM> el fichero <CODE>README</CODE>
y <EM>siga</EM> los pasos descritos en el fichero <CODE>INSTALL</CODE>.
<P>Si no desea una distribuci&oacute;n de fuentes, deber&iacute;a obtener una distribuci&oacute;n
binaria para Linux sobre sistemas basados en Intel disponible en sunsite.
<P>Lynx compila y se ejecuta en mi sistema sin ning&uacute;n problema tanto en Linux
1.2.13 como en 2.0.x.
<P>
<P>
<H3>Caracter&iacute;sticas especiales</H3>

<P>Bueno, existen. Para una descripci&oacute;n completa, lea los manuales y ficheros
doc que vienen con Linux.
<P>Para hacerse una idea, teclee 
<BLOCKQUOTE><CODE>
lynx --help
</CODE></BLOCKQUOTE>
.
<P>En mi humilde opini&oacute;n, la caracter&iacute;stica m&aacute;s especial de Lynx frente a
todos los otros visualizadores de web es la capacidad para la petici&oacute;n en
modo de procesamiento por lotes. Uno puede escribir una macro del
int&eacute;rprete de comandos que recupere un documento, a trav&eacute;s de las urls
<EM>http</EM>, <EM>ftp</EM>, <EM>gopher</EM>, <EM>WAIS</EM>, <EM>NNTP</EM> o <EM>file://</EM>,
y salvarlo al disco. Adem&aacute;s, se pueden rellenar documentos HTML con datos
en el modo de proceso por lotes simplemente redirigiendo la entrada
est&aacute;ndar y usando la opci&oacute;n <EM>-post_data</EM>.
<P>
<P>
<P>
<H2><A NAME="ss2.3">2.3 Emacs-W3</A>
</H2>

<P>Existe una cosa lamentable sobre el visualizador W3 de Emacs ;) Si Ud.
tiene GNU Emacs o XEmacs ejecut&aacute;ndose, probablemente tambi&eacute;n tenga el
visualizador W3 ejecut&aacute;ndose.
No hay mucho trabajo en este COMO.
Si Ud. cree que deber&iacute;a haber m&aacute;s informaci&oacute;n sobre esto, por favor
h&aacute;gamelo saber.
<P>El modo W3 de Emacs es casi un sistema de visualizaci&oacute;n de web
completamente caracterizado, escrito en el sistema Lisp de Emacs.
Principalmente trata con texto, pero tambi&eacute;n puede mostrar gr&aacute;ficos
(al menos) si ejecuta Emacs bajo el sistema de ventanas gr&aacute;ficas X Window.
<P>El paquete de GNU emacs m&aacute;s reciente est&aacute; disponible en
<CODE>
<A HREF="ftp://prep.mit.ai.edu">ftp://prep.mit.ai.edu</A></CODE>,
el m&aacute;s reciente de XEmacs podr&iacute;a ser obtenido desde
<CODE>
<A HREF="ftp://ftp.xemacs.org">ftp://ftp.xemacs.org</A></CODE>.
<P>
<P>
<P>
<P>
<H2><A NAME="ss2.4">2.4 Netscape Navigator Gold 3.0 </A>
</H2>

<P>S&iacute;, Ud. lo consigui&oacute;. El Rey de los visualizadores de WWW. Algo casi como
lo que es Emacs en el mundo de los editores de texto. Netscape Navigator
puede hacerlo casi todo (excepto hacer caf&eacute;... pero quiz&aacute; <EM>java</EM> lo
haga...). Pero por otra parte, el m&aacute;s hambriento de memoria y devorador de
recursos de los <EM>visualizadores de web</EM>, lectores de
<EM>noticias</EM>, lectores de <EM>correo</EM> <CODE>(pop3)</CODE>, y editores
de correo y noticias que yo haya visto nunca.
<P>Mi &uacute;ltima versi&oacute;n del Netscape Navigator Gold (versi&oacute;n de exportaci&oacute;n) es
de 28-Aug-1996 y (c) 1995, 1996 Netscape Communications Corp.
<P>(Como yo vivo en Europa, s&oacute;lo puedo obtener la versi&oacute;n de exportaci&oacute;n...)
<P>
<H3>D&oacute;nde conseguirlo</H3>

<P>El primer lugar para conseguir el Netscape Navigator para Linux como
distribuci&oacute;n binaria es en
<CODE>
<A HREF="ftp://ftp.netscape.com">ftp://ftp.netscape.com</A></CODE>.
El segundo (ya que estos servidores est&aacute;n muy cargados) deber&iacute;a ser
un servidor r&eacute;plica af&iacute;n a netscape. Ud. tambi&eacute;n podr&iacute;a consultar
archie acerca de este asunto. Quiz&aacute;s tenga suerte y lo encuentre en un
cd rom (esto salvar&iacute;a algo de ancho de banda ya que el archivo es
bastante grande, &nbsp;2.5 MB).
<P>
<P>
<H3>Desempaquetando e Instalando</H3>

<P>Desempaquete el archivo y <EM>lea</EM> el fichero <CODE>README</CODE>
No hay nada extra&ntilde;o en esto, ya sabe.
<P>
<P>
<H3>Los applets de Java con el navigator</H3>

<P>Existen algunos rumores que dicen que hay problemas al ejecutar los
applets de java con el Netscape Navigator Gold 3.0 incluso si java est&aacute;
activado en el di&aacute;logo de opciones.
El archivo que conozco contiene un fichero <EM>java_30</EM> que debe ser
renombrado como <EM>java_30.zip</EM>. Despu&eacute;s de esto, cualquier applet de
java deber&iacute;a funcionar bien dentro del entorno del netscape.
<P>Si contin&uacute;a teniendo problemas al usar los applets de java as&iacute; como si
el Netscape Navigator se bloquea o simplemente se interrumpe despu&eacute;s de
cargar un applet de java, eche un vistazo a su <EM>versi&oacute;n de libc</EM>.
Haga un 
<BLOCKQUOTE><CODE>
ldconfig -v | less
</CODE></BLOCKQUOTE>
 (quiz&aacute;s, deba ser Ud.
super-usuario para hacerlo...) y busque un rengl&oacute;n
<BLOCKQUOTE><CODE>
libc.so.5 =&gt; libc.so.5.xx.yy
</CODE></BLOCKQUOTE>
 d&oacute;nde su versi&oacute;n de
libc es 5.xx.yy. Si su libc no es 5.2.18, &eacute;ste debe de ser el
problema. Hay muchos informes para sistemas Linux 1.2.13, que deber&iacute;an ser
actualizados a libc 5.2.18 generalmente cuando se necesite ejecutar
Netscape Navigator. Adicionalmente, deber&iacute;a ser una buena idea degradar su
libcc de 5.3.xx a 5.2.18 si Ud. ejecuta Netscape Navigator y un n&uacute;cleo
Linux 2.0.x.
(De hecho, las series de libc 5.3.xx son para prop&oacute;sitos de prueba beta,
as&iacute; que Ud. deber&iacute;a saber lo que est&aacute; haciendo.) Algunas de las series
5.3.xx interrumpen el Netscape Navigator y el c&oacute;digo de clases de Java.
<P>Para m&aacute;s informaci&oacute;n sobre <EM>Java en Linux</EM> o <EM>programaci&oacute;n en Java</EM>,
por favor lea el JAVA-COMO o visite
<CODE>
<A HREF="http://www.sun.com">http://www.sun.com</A></CODE>.
<P>
<P>
<P>
<P>
<HR>
<A HREF="WWW-Como-3.html">Página siguiente</A>
<A HREF="WWW-Como-1.html">Página anterior</A>
<A HREF="WWW-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
