<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux WWW-COMO: Manteniendo un servidor WWW o algunas P&aacute;ginas Web</TITLE>
 <LINK HREF="WWW-Como-5.html" REL=next>
 <LINK HREF="WWW-Como-3.html" REL=previous>
 <LINK HREF="WWW-Como.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="WWW-Como-5.html">Página siguiente</A>
<A HREF="WWW-Como-3.html">Página anterior</A>
<A HREF="WWW-Como.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4. Manteniendo un servidor WWW o algunas P&aacute;ginas Web</A></H2>

<P>Si Ud. tiene que mantener un servidor web o si mantiene al menos una
p&aacute;gina web, tiene que pensar en su oferta a la red y tiene que dedicar
algunos pensamientos en la aproximaci&oacute;n al lector / usuario de sus
p&aacute;ginas web.
<P>
<P>
<P>
<P>
<H2><A NAME="ss4.1">4.1 La corriente dominante: HTML t&eacute;cnico</A>
</H2>

<P>Bien, no voy a decirle c&oacute;mo se codifica HTML ni como tiene Ud. que dise&ntilde;ar
sus p&aacute;ginas. S&oacute;lo le dar&eacute; algunos puntos d&oacute;nde Ud. puede encontrar
informaci&oacute;n m&aacute;s avanzada.
<P>Deber&iacute;a echar un vistazo a
<CODE>
<A HREF="http://www.w3.org/">http://www.w3.org/</A></CODE>
para la especificaci&oacute;n m&aacute;s reciente del lenguage HTML.
<P>Eche un vistazo a la lista al final de este art&iacute;culo, encontrar&aacute; m&aacute;s
consejos, d&oacute;nde leerlos.
<P>
<P>
<P>
<P>
<H2><A NAME="ss4.2">4.2 Algunos conceptos sobre el ancho de banda</A>
</H2>

<P>Muchos usuarios se conectan a Internet v&iacute;a l&iacute;neas de modem de baja
velocidad. Un rango de velocidad de 14.400 bps a 28.800 bps es una obra de
arte para "sitios privados". En Europa, est&aacute;n creciendo sistemas RDSI,
pero una velocidad de 64.000 bps no es muy r&aacute;pida en comparaci&oacute;n con
(hag&aacute;moslo simple - una ethernet de 10.000.000 bps). Y una ethernet de
10 Mbps no es realmente una conexi&oacute;n de LAN de alta velocidad hoy en d&iacute;a.
<P>As&iacute; como Ud. se da cuenta que muchos usuarios no poseen este acceso r&aacute;pido
a la red, deber&iacute;a tener en cuenta el aumentar la relaci&oacute;n entre
informaci&oacute;n y bytes. Optim&iacute;celo a 1:1 (si puede). <EM>Deber&iacute;a</EM> usar
gr&aacute;ficos en sus p&aacute;ginas web siguiendo la tendencia multimedia, pero
recuerde siempre los objetivos de su p&aacute;gina y de los gr&aacute;ficos que va a
introducir.
Si la mayor&iacute;a de sus usuarios se conectan a trav&eacute;s de una l&iacute;nea de modem
peque&ntilde;a y los gr&aacute;ficos s&oacute;lo sirven para razones est&eacute;ticas o para hacer
efectos llamativos, har&iacute;a mejor quit&aacute;ndolos de sus p&aacute;ginas, o (al menos)
rehacerlas al
tama&ntilde;o de fichero m&aacute;s peque&ntilde;o posible y usar la mejor compresi&oacute;n. A sus
usuarios les gustar&aacute;.
<P>Recuerde siempre: ciertamente a nadie le gusta un efecto llamativo que
dura unos 3-5 minutos <EM>despu&eacute;s</EM> del mensaje de texto.
<P>
<P>
<P>
<P>
<H2><A NAME="ss4.3">4.3 Algunos conceptos sobre la carga del servidor</A>
</H2>

<P>En un servidor de web, normalmente existe al menos una tarea de servidor
ejecut&aacute;ndose. Si esta tarea lee una petici&oacute;n de un cliente http, se
duplica a s&iacute; misma (en Linux esto se llama <EM>ramificaci&oacute;n</EM>)
<BLOCKQUOTE>N.
del T.: fork=ramificaci&oacute;n</BLOCKQUOTE>
 y la nueva copia sirve la petici&oacute;n
mientras que la original mantiene la escucha para nuevas peticiones. Una
vez acabada la petici&oacute;n, la copia desaparece. (De hecho, algunos
servidores - como el apache - siempre conservan por defecto cinco copias
del servidor en espera preparadas para peticiones en paralelo al servidor
maestro, por razones de velocidad.)
<P>Algunos visualizadores de web como las series del Netscape Navigator hacen
muchas peticiones en paralelo sobre el mismo servidor, lo que incrementa
la carga del servidor dedicada al mismo usuario. Estos visualizadores, por
ejemplo, cargan la p&aacute;gina HTML y la analiza sint&aacute;cticamente durante la
carga y distribuye nuevas peticiones para otra informaci&oacute;n como gr&aacute;ficos
embebidos, ficheros de applets, ficheros de sonido o cualquier otro dato
adicional codificado con mime. Por el contrario, los visualizadores
'simples' piden y cargan un fichero tras otro, lo que mantiene la relaci&oacute;n
de carga por usuario del servidor lo m&aacute;s baja posible.
<P>Muchos usuarios prefieren visualizadores que usan la t&eacute;cnica de
multipetici&oacute;n como el Netscape Navigator, porque traen una visi&oacute;n general
m&aacute;s completa sobre la p&aacute;gina requerida antes de que lo haga una petici&oacute;n
simple del visualizador.
<P>En mi opini&oacute;n esto es porque muchos dise&ntilde;adores de p&aacute;ginas introducen
la informaci&oacute;n embebida dentro de los gr&aacute;ficos, rechazando los
visualizadores de s&oacute;lo texto.
<P>Entonces, (como mantenedores de servidores) el problema es nuestro, ya que
la mayor&iacute;a de los usuarios lanzan multiples peticiones sobre servidores
externos dentro de la carga de la misma p&aacute;gina. Podemos limitar esto
limitando el software del servidor a no servir m&aacute;s peticiones que "x"
desde el mismo sistema al mismo tiempo. Pero, ¿c&oacute;mo conseguir este "x"? No
es f&aacute;cil calcularlo, y es necesaria mucha experiencia personal en su
servidor para representarlo.
Pero, le dar&eacute; algunos consejos. Tenemos que tener en cuenta el ancho de
banda de nuestra conexi&oacute;n, el tama&ntilde;o de memoria de nuestro servidor,
alguna impresi&oacute;n sobre el rendimiento de la cpu/disco de nuestro servidor
y... bueno, eso es suficiente para la primera ojeada. Deber&iacute;a echar un
vistazo a la memoria que utiliza una sola tarea del servidor. Entonces
piense cuantas de ellas se podr&iacute;a tener en memoria a la vez. Piense
qu&eacute; porcentaje de sus p&aacute;ginas web podr&iacute;an permanecer en la cach&eacute; de disco
de su servidor. Optimice el total de tareas del servidor de web contra el
tama&ntilde;o del cach&eacute; del disco y estar&aacute; realmente cerca de su "x" personal.
Adem&aacute;s, puede presentar otros trabajos que posea el servidor. Por ejemplo,
si su sistema tambi&eacute;n presta servicio por ftp, deber&iacute;a limitar el m&aacute;ximo
n&uacute;mero posible de conexiones para conservar un m&iacute;nimo de espacio para la
tarea del servidor de ftp. Si su servidor de web tambi&eacute;n presta algunos
servicios de base de datos, har&iacute;a mejor apartando algunos ciclos de cpu y
tambi&eacute;n reducir su "x". Juegue algo con estos valores y pru&eacute;belos.
Y (!) lea el siguiente cap&iacute;tulo sobre la escritura de macros CGI, lo que
tambi&eacute;n conlleva rendimiento del servidor y (dependiendo de los CGI)
cantidad de memoria.
<P>
<P>
<P>
<P>
<H2><A NAME="ss4.4">4.4 CGI contra Applet / Macros del lado del cliente</A>
</H2>

<P><EM>(por escribir, lo siento)</EM> descripci&oacute;n general sobre
ventajas/desventajas y consejos sobre qu&eacute; usar y cuando.
<P>
<P>
<P>
<P>
<H2><A NAME="ss4.5">4.5 Ideas de estilo</A>
</H2>

<P>Uh, un tema realmente dif&iacute;cil para ser descrito en una frase corta. No
intento confundir sus ideas ingeniosas de dise&ntilde;o. Tampoco voy a hacer que
se incline por mis estrategias personales de dise&ntilde;o. S&oacute;lo me gustar&iacute;a
a&ntilde;adir uno o dos dict&aacute;menes a las ideas de arriba sobre carga y ancho de
banda del servidor.
<P>Numerosas investigaciones sobre el comportamiento humano en interfaces de
usuario y presentaciones en pantalla han publicado resultados
interesantes. Existen algunos factores simples que uno deber&iacute;a tener en
cuenta al dise&ntilde;ar p&aacute;ginas WWW.
<P>
<UL>
<LI>Mantenga el texto en bloques cortos. Este COMO se ve feo en
pantalla, pero bonito en papel impreso. (Int&eacute;ntelo Ud. mismo). Los seres
humanos a menudo tienen dificultades para leer texto extenso impreso en
pantalla. Pierden el hilo de la frase; sufre su concentraci&oacute;n.</LI>
<LI>No mezcle gr&aacute;ficos y bloques de texto. Esto es agradable a la vista
pero es una caracter&iacute;stica fea a la hora de leer. Puede extender
encabezados, efectos llamativos pero, por favor, no mezcle bloques de
texto con gr&aacute;ficos. Entendidos en comportamiento descubrieron que los
humanos somos atraidos mucho m&aacute;s por gr&aacute;ficos en pantalla que por texto.
La gente encuentra m&aacute;s f&aacute;cil darse cuenta de un gr&aacute;fico en pantalla que en
papel, al contrario que el texto el cual es m&aacute;s f&aacute;cil "ver y decodificar"
sobre el papel que en pantalla.</LI>
</UL>
<P>¿Sab&iacute;a esto? Si desea obtener m&aacute;s informaci&oacute;n sobre esto, busque en las
gu&iacute;as de estilo GUI y en los resultados de investigaciones ergon&oacute;micas
realizados por muchas universidades y compa&ntilde;&iacute;as de software (incluida MS).
<P>
<P>
<P>
<P>
<H2><A NAME="ss4.6">4.6 Editores de HTML bajo Linux</A>
</H2>

<P>Hum, existen algunos. De hecho, se tienen noticias de que son muchos. Pero
como yo ya hice todo lo que pude, no los he probado todos. Pero realmente
espero con ilusi&oacute;n y curiosidad leer los informes que Uds. me env&iacute;en.
<P>
<H3>vi, vim</H3>

<P>vi y vim son perfectamente aptos para escribir codigo HTML... (no me
caliente la cabeza con esto) porque el c&oacute;digo HTML s&oacute;lo utiliza caracteres
de texto ASCII.
No quiero dar pie a otra guerra de editores. Aquellos que conocen el
vi/vim y lo usan diariamente pueden utilizarlo tambi&eacute;n para c&oacute;digo HTML.
Puede hacer que el vi/vim le ayude a desarrollar c&oacute;digo HTML creando
algunas macros para el vi/vim.
Pero como esto no es un VI-COMO, dejar&eacute; este hecho aqu&iacute; solo. S&oacute;lo tenga
en cuenta que es posible usar el vi/vim para editar HTML (al menos para
algunos cambios cortos).
Si Ud. ya sabe como programar el vi/vim, ciertamente tambi&eacute;n sabr&aacute; como
abstraer HTML. Si no lo sabe, bueno, no se preocupe.
<P>
<H3>emacs y XEmacs</H3>

<P><EM>(por escribir, lo siento)</EM>
<P>
<H3>asWedit</H3>

<P><EM>(por escribir, lo siento)</EM>
<P>
<P>
<H3>otras indicaciones</H3>

<P>Ah, existen algunas referencias de un paquete llamado phoenix, basado en
tkWWW, pero no he sido capaz de hacerlo funcionar en mi sistema. Creo que
era un problema con mi versi&oacute;n del tcl/tk pero nunca lo sabr&eacute;. No dediqu&eacute;
mucho tiempo con ellos, as&iacute; que, quiz&aacute;s funcionen ambos en su sistema.
Solamente vaya y pregunte en archie. Quiz&aacute;, pueda mandarme un mensaje si
tiene &eacute;xito.
<P>Si Ud. echa en falta aqu&iacute; su editor de HTML favorito, escr&iacute;bame un
mensaje.  Quiz&aacute;s a&ntilde;ada algunas referencias a p&aacute;ginas web acerca editores
de HTML para Linux. M&aacute;ndeme algunas bonitas URL.
<P>
<P>
<P>
<P>
<H2><A NAME="ss4.7">4.7 Gr&aacute;ficos</A>
</H2>

<P>¿ Conceptos, ideas, consejos ? Bueno, deber&iacute;a leer el grupo de noticias
<EM>comp.graphics</EM>. Y puede visitar
<CODE>
<A HREF="http://www.w3.org/pub/WWW/Graphics/">http://www.w3.org/pub/WWW/Graphics/</A></CODE>.
<P>
<H3>Formato gif</H3>

<P>GIF (Formato de Intercambio de Gr&aacute;ficos)
<BLOCKQUOTE>N. del T.: GIF =
Graphics Interchange Format</BLOCKQUOTE>
 fue introducido en 1987 por
Compuserve, Inc. y revisado en 1989. Usa un algoritmo LZ, el cual es
la causa fundamental de los derechos de autor de E.E.U.U. o de la ley de
patentes. Deber&iacute;an existir algunos problemas legales al usar este formato
gr&aacute;fico en internet (a pesar de que casi todo el mundo lo hace).
<P>Gif es un buen formato para im&aacute;genes peque&ntilde;as con gr&aacute;ficos de estructura
simple tales como gr&aacute;ficos de computador o iconos.
<P>Gif posee algunas ventajas como que es uno de los formatos gr&aacute;ficos
m&aacute;s extendidos (si no el m&aacute;s) en sistemas de conexi&oacute;n directa:
<UL>
<LI>ofrece una buena compresi&oacute;n</LI>
<LI>comprime sin p&eacute;rdida de informaci&oacute;n</LI>
<LI>posee capacidad de entrelazado, esto es, las im&aacute;genes podr&iacute;an ser
vistas a tama&ntilde;o real (con menos resoluci&oacute;n) antes de que fueran tra&iacute;das
completamente.</LI>
<LI>puede contener m&aacute;s de una imagen dentro de un fichero</LI>
<LI>puede contener una animaci&oacute;n peque&ntilde;a en un fichero</LI>
<LI>casi cualquier visualizador gr&aacute;fico de web soporta gif</LI>
<LI>puede contener un color transparente</LI>
<LI>sistema de descompresi&oacute;n r&aacute;pido</LI>
</UL>
<P>Las desventajas son:
<UL>
<LI>s&oacute;lo es posible im&aacute;genes de 256 colores</LI>
<LI>problemas de licencia y derechos de autor (?)</LI>
<LI>no es el tama&ntilde;o de fichero ideal</LI>
</UL>
<P>
<H3>Formato jpeg</H3>

<P>El "Joint Graphic Experts Group" (JPEG), Grupo de Expertos en Gr&aacute;ficos
Unidos", hizo el dise&ntilde;o para el formato gr&aacute;fico jpeg/jpg/jiff. Este
formato est&aacute; basado en una transformaci&oacute;n discreta de coseno (DCT) y en
una compresi&oacute;n en c&oacute;digo Huffmann.
JPEG funciona con una perdida significativa de informaci&oacute;n, lo que puede
hacer que sus im&aacute;genes aparezcan algo menos coloridas o con menos
definici&oacute;n. El factor t&iacute;pico de compresi&oacute;n est&aacute; entre 1:5 y 1:50. (Por
encima de 1:10 cualquiera puede ver aparecer los artefactos a trav&eacute;s del
ciclo de compresi&oacute;n/descompresi&oacute;n.)
<P>JPEG es un buen formato para fotograf&iacute;as, gr&aacute;ficos grandes e im&aacute;genes
realmente complejas.
<P>Las ventajas son:
<UL>
<LI>fuerte compresi&oacute;n, ficheros peque&ntilde;os y por tanto, r&aacute;pidos de
bajarse...</LI>
<LI>cualquier visualizador gr&aacute;fico conoce las jpeg</LI>
</UL>
<P>Las desventajas son:
<UL>
<LI>compresi&oacute;n/descompresi&oacute;n lenta</LI>
<LI>posible p&eacute;rdida de informaci&oacute;n</LI>
</UL>
<P>
<P>
<H3>Formato png</H3>

<P>Portable Network Graphics (PNG), Gr&aacute;ficos de Red Portables, (el nuevo
formato en la red). PNG est&aacute; favorecido por el consorcio W3. Para una
informaci&oacute;n m&aacute;s detalada visite
<CODE>
<A HREF="http://www.w3.org/pub/WWW/TR/WD-png.html">http://www.w3.org/pub/WWW/TR/WD-png.html</A></CODE>
y
<CODE>
<A HREF="http://www.w3.org/pub/WWW/Graphics/PNG/Overview.html">http://www.w3.org/pub/WWW/Graphics/PNG/Overview.html</A></CODE>.
Encontrar&aacute; aqu&iacute; una especificaci&oacute;n t&eacute;cnica, alguna informaci&oacute;n para
programadores, etc. PNG es un formato ideal que sustituye al GIF. La
p&aacute;gina principal del PNG est&aacute; en
<CODE>
<A HREF="http://quest.jpl.nasa.gov/PNG/">http://quest.jpl.nasa.gov/PNG/</A></CODE>.
Para los usuarios, PNG podr&aacute; tener
algunas ventajas y algunas desventajas. Aqu&iacute; est&aacute;n:
<P>En cuanto a las ventajas:
<UL>
<LI>puede reemplazar a los GIF con licencia (PNG no tiene problemas de
licencia)</LI>
<LI>capacidad de sistemas de paleta de 256 colores as&iacute; como de escala
de grises y de color verdadero
<BLOCKQUOTE>N. del T.: true color =
color verdadero</BLOCKQUOTE>
, incluyendo un elemento transparente</LI>
<LI>modo de entrelazado complejo donde no s&oacute;lo l&iacute;neas diferentes son
secuenciadas sino que un sistema serializado de dos dimensiones obtiene
la imagen, de lo que resulta que el usuario se da cuenta m&aacute;s pronto del
contenido de la imagen.</LI>
<LI>es posible un algoritmo de descompresi&oacute;n r&aacute;pido</LI>
<LI>descripci&oacute;n disponible p&uacute;blicamente (licencia gratis)</LI>
<LI>c&oacute;digo de ejemplo disponible p&uacute;blicamente (licencia gratis)</LI>
<LI>dise&ntilde;o extensible</LI>
</UL>
<P>En cuanto a las desventajas:
<UL>
<LI>no est&aacute; muy extendido (Netscape no lo soporta por el momento, pero
algunos plugins lo hacen)</LI>
<LI>im&aacute;genes de una compresi&oacute;n no tan buena</LI>
<LI>no est&aacute; lista una especificaci&oacute;n final, en estado de borrador de
trabajo.</LI>
</UL>
<P>PNG es soportado actualmente en Linux por los siguientes programas:
<EM>ImageMagick</EM> (Versi&oacute;n >=3.7), <EM>GhostScript 4.0</EM>, <EM>Gimp</EM>,
<EM>PovRay 3.0</EM>, el paquete <EM>netpbm</EM>. Para <EM>xv</EM> 3.10a existe un
parche no oficial.
<P>
<P>
<H3>Conversores</H3>

<P><EM>(por escribir, lo siento)</EM>
netpbm, xv, ghostscript, gimp, ImageMagick, CorelDraw sobre Wine :-)))
<P>
<P>
<H2><A NAME="ss4.8">4.8 Cosas especiales</A>
</H2>

<P>Ahora existen muchas cosas especiales m&aacute;s all&aacute; del alcance de HTML e
Image. Hay Applets escritas en p&aacute;ginas de Java y JavaScript y muchas cosas
m&aacute;s.
<P>
<H3>Java</H3>

<P>No hay nada que a&ntilde;adir sobre Java en general, s&oacute;lo lea la secci&oacute;n de Java
en el cap&iacute;tulo de Netscape Navigator de este COMO y la descripci&oacute;n general
sobre Java Applet contra las macros CGI en este COMO. Adem&aacute;s, tambi&eacute;n
puede leer el COMO JAVA de Linux, realmente bueno y compacto.
Para programar en Java, por favor refi&eacute;rase a libros verdaderamente
buenos en este tema.
<P>
<P>
<H3>ActiveX</H3>

<P>ActiveX es todav&iacute;a, en el momento de escribir esto, un hijo de Microsoft.
Microsoft proclam&oacute; que lo difundir&iacute;a al dominio p&uacute;blico o al menos en el
consorcio ActiveX.
<P>ActiveX no tiene nada que ver con el sistema X Window ni con XFree.
<P>Deriva del sistema OLE de Microsoft e IBM. Despu&eacute;s de difundir las
especificaciones, habr&iacute;a una adaptaci&oacute;n a Unix. Pero, tenemos que esperar
hasta entonces. Nada para Linux, por el momento.
<P>
<P>
<P>
<P>
<HR>
<A HREF="WWW-Como-5.html">Página siguiente</A>
<A HREF="WWW-Como-3.html">Página anterior</A>
<A HREF="WWW-Como.html#toc4">Índice general</A>
</BODY>
</HTML>
