<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux WWW-COMO: Introducci&oacute;n</TITLE>
 <LINK HREF="WWW-Como-2.html" REL=next>

 <LINK HREF="WWW-Como.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="WWW-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="WWW-Como.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>

<P>Mucha gente est&aacute; introduci&eacute;ndose en Linux porque buscan una plataforma con
<EM>capacidad para Internet</EM> realmente buena. Otros usan Linux por la
diversi&oacute;n de instalar un SO gratis en sus sistemas. Por supuesto, algunos
de ellos quieren entrar en contacto con internet. Adem&aacute;s, existen institutos,
universidades y otras organizaciones, la mayor&iacute;a sin &aacute;nimo de lucro, que
quieren o necesitan instalar servidores de internet con peque&ntilde;os gastos.
Aqu&iacute; es donde entra el WWW COMO. Este documento intenta explicar como
instalar clientes y servidores para (a mi parecer) la parte conectada
m&aacute;s grande de la red - <EM>La World Wide Web</EM>.
<P>
<H2><A NAME="ss1.1">1.1 Derechos de autor</A>
</H2>

<P>Este documento es Copyright (c) 1996 de Peter Dreuw. Por favor, c&oacute;pielo
y distrib&uacute;yalo mucho, pero no modifique el texto u omita mi nombre.
<P>Si vende este COMO en un CD, en un libro o en otro medio de comunicaci&oacute;n,
me gustar&iacute;a mucho tener una copia como referencia.
<P>Las marcas registradas son propiedad de sus respectivos due&ntilde;os.
<P>
<H2><A NAME="ss1.2">1.2 Rectificaci&oacute;n</A>
</H2>

<P>Este documento est&aacute; pensado como una introducci&oacute;n en las t&eacute;cnicas de WWW
usadas o utilizables en Linux. ¡ No soy ning&uacute;n experto ni en WWW ni en
seguridad ! NO ME HAGO RESPONSABLE DE NINGUN DA&Ntilde;O INCURRIDO DEBIDO A
ACCIONES TOMADAS EN BASE A LA INFORMACION INCLUIDA EN ESTE DOCUMENTO.
<P>
<P>
<H2><A NAME="ss1.3">1.3 Informaci&oacute;n sobre resultados</A>
</H2>

<P>Cualquier informaci&oacute;n ser&aacute; realmente bienvenida. S&oacute;lo env&iacute;eme un correo a
<CODE>
<A HREF="mailto:pdreuw@wing.gun.de">pdreuw@wing.gun.de</A></CODE>.
<P>
<H2><A NAME="ss1.4">1.4 Nuevas versiones de este Documento</A>
</H2>

<P>Puede obtener nuevas versiones de este documento v&iacute;a FTP an&oacute;nimo
de <EM>sunsite.unc.edu</EM> en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/">ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/</A></CODE> y de casi
cualquier servidor r&eacute;plica de ftp af&iacute;n a Linux.
<P>Adem&aacute;s, Ud. puede baj&aacute;rselo v&iacute;a
<CODE>
<A HREF="http://ourworld.compuserve.com/homepages/dreuw/lxwwwh2.tgz">http://ourworld.compuserve.com/homepages/dreuw/lxwwwh2.tgz</A></CODE>
como un archivo tar comprimido con gzip conteniendo versiones sgml, text,
latex y ps. La versi&oacute;n html est&aacute; disponible directamente bajo
<CODE>
<A HREF="http://ourworld.compuserve.com/homepages/dreuw/lxwwwh2.htm">http://ourworld.compuserve.com/homepages/dreuw/lxwwwh2.htm</A></CODE>
<P>
<P>
<HR>
<A HREF="WWW-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="WWW-Como.html#toc1">Índice general</A>
</BODY>
</HTML>
