<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04C-Caldera [en] (X11; I; Linux 2.0.33 i586) [Netscape]">
   <TITLE>Short Articles</TITLE>
</HEAD>
<BODY>

<CENTER>Art&iacute;culos cortos...</CENTER>
Esta p&aacute;gina contiene art&iacute;culos cortos que he escrito en un
momento u otro. Como autor, no quiero gastar tiempo tratando de que alguien
los publique. Ese ser&iacute;a el trabajo que deber&iacute;an realizar
las agencias de publicaci&oacute;n, si no estuvieran en n&oacute;mina de
los monopolios del copyright.

<P>Por lo tanto, la publicaci&oacute;n o distribuci&oacute;n de mis art&iacute;culos
es libre bajo los t&eacute;rminos de la versi&oacute;n 2 o posterior de
la Licencia General de uso P&uacute;blico de GNU&nbsp; (GPL).

<P>Debe tenerse en cuenta que estos art&iacute;culos no son en forma alguna
traducciones de los que he escrito en franc&eacute;s a menudo sobre temas
completamente distintos.

<P>
<HR>
<H2>
Indice de materias</H2>
(bueno, de acuerdo, en esta ocasi&oacute;n s&oacute;lo hay un art&iacute;culo)
<DL>
<DT>
<A HREF="#about_esr">Sobre los art&iacute;culos de Eric S. Raymond's</A>
(escrito el 23-mayo-1998).</DT>

<DD>
Notas sobre "La catedral y el bazar" y otros escritos de Eric S. Raymond...</DD>
</DL>

<HR>

<P><A NAME="about_esr"></A>
<H5>
Lo que sigue son unas peque&ntilde;as anotaciones sobre defectos que se
han deslizado en los, por lo dem&aacute;s excelentes y justamente bien
conocidos, art&iacute;culos de <A HREF="http://www.ccil.org/~esr">Eric
S. Raymond</A> . Se las envi&eacute; a &eacute;l en primer lugar, pero
decidi&oacute;, y estaba en su pleno derecho, no tenerlas en cuenta. Dado
que creo que esto hace que sus art&iacute;culos difundan unos cuantos conceptos
notablemente incorrectos como par&aacute;sitos de las importantes ideas
que en ellos se exponen, me creo obligado a publicarlas aqu&iacute;; quiz&aacute;
logre al menos de esta forma que ESR incluya los enlaces correspondientes
a ellas en su p&aacute;gina (escrito entre el 23 y 25 de mayo de 1998).</H5>

<H2>
Sobre los art&iacute;culos de Eric S. Raymond</H2>
Eric S. Raymond, un respetado "hacker" (en el sentido <A HREF="http://sagan.earthspace.net/~esr/faqs/hacker-howto.html">correcto</A>&nbsp;
del t&eacute;rmino), se ha hecho famoso como "predicador del software abierto",
desde que escribi&oacute; su influyente art&iacute;culo "<A HREF="http://sagan.earthspace.net/~esr/writings/cathedral-bazaar/">La
catedral y el bazar</A>", que cuenta ya con algunas secuelas (por el momento
s&oacute;lo "<A HREF="http://sagan.earthspace.net/~esr/writings/homesteading/">Colonizando
la Noosfera</A>").

<P>Le&iacute; "<A HREF="http://sagan.earthspace.net/~esr/writings/cathedral-bazaar/">La
catedral y el bazar</A>", poco despu&eacute;s de que se publicara, antes
de que se hiciera tan famoso como lo es en este momento, y se modificara
por razones de mercado al sustituir la expresi&oacute;n "software libre"
por "software abierto".&nbsp; <I>Es</I> un gran art&iacute;culo, no pretendo
negarlo; de hecho, no puedo sino estar fervientemente de acuerdo con la
mayor parte de lo que en &eacute;l se dice, pues contiene por cierto hallazgos
importantes sobre la din&aacute;mica del desarrollo del software. Hallazgos
que son, como creo que <A HREF="http://www.illuminata.com/public/all/catalog/cathedral.htm">Jonathan
Eunice</A> hace notar si bien de forma poco apropiada, casi totalmente
(aunque no por completo) independientes de toda consideraci&oacute;n sobre
si el software es libre o apropiable. I como teorizador sobre el software
libre, mis observaciones tratar&aacute;n sobre la no tan escasa diferencia
entre ese "casi totalmente" y aquel "no por completo".

<P>Mi primera observaci&oacute;n (poco importante) se refiere a la siguiente
sugerencia que aparece al final del art&iacute;culo de la catedral:
<BLOCKQUOTE>Quiz&aacute; al final la cultura del software abierto triunfe
no porque la colaboraci&oacute;n sea moralmente
<BR>"buena" y la posesi&oacute;n avara del software "mala" (suponiendo
que creas esto &uacute;ltimo, algo que ni yo ni
<BR>Linus hacemos), sino simplemente porque el mundo comercial no puede
ganar una carrera de
<BR>armamentos frente a comunidades de software abierto capaces de movilizar
cantidades de tiempo de
<BR>personal cualificado algunos &oacute;rdenes de magnitud superiores
a la hora de resolver un problema.</BLOCKQUOTE>
Si bien estoy de acuerdo con la &uacute;ltima parte de la frase, no lo
estoy con la primera. &iquest;Qu&eacute; mejor argumento <I>moral</I> que
el software libre est&eacute; intr&iacute;nsecamente mejor dotado para
producir a largo plazo software fiable y de buena calidad?. Desde luego,
no es un argumento <I>metaf&iacute;sico</I>; pero no hay raz&oacute;n para
basar la moral en dogmas de este tipo; al contrario, la &eacute;tica resulta
m&aacute;s adecuada si las consideraciones a manejar provienen de la vida
real.

<P>En un correo privado, Eric me explic&oacute; que, si bien estaba de
acuerdo con mi observaci&oacute;n, no modificar&iacute;a su art&iacute;culo
pues tem&iacute;a confundir a los lectores con nociones sobre si los aspectos
&eacute;ticos eran consideraciones a-priori o a-posteriori, que est&aacute;n
fuera del contexto del art&iacute;culo y requerir&iacute;an una explicaci&oacute;n
demasiado larga para resultar inteligibles. Bueno, tal consideraci&oacute;n
no es al menos ajena a su conclusi&oacute;n, por lo que, si deseaba ajustarse
de forma tan precisa al contexto, tambi&eacute;n hubiera podido eliminar
directamente la conclusi&oacute;n. Y, cuando menos, una nota al pie con
un enlace a alguna otra p&aacute;gina de otro tipo hubiera podido contribuir
a poner las cosas en claro para todo el mundo. Tambi&eacute;n hubiera podido
buscar una formulaci&oacute;n m&aacute;s precisa o neutral, sin mayor explicaci&oacute;n.
Por miedo a "confundir" a los lectores con una "excesiva" precisi&oacute;n,
Eric contribuye a un aumento de la confusi&oacute;n ya existente sobre
asuntos &eacute;ticos de importancia.

<P>En la secuela al art&iacute;culo de la catedral y el bazar, "<A HREF="http://sagan.earthspace.net/~esr/writings/homesteading/">Colonizando
la Noosfera</A>", otro art&iacute;culo muy interesante, Eric introduce
una confusi&oacute;n m&aacute;s esencial que est&aacute; en el origen de
todas las contradicciones aparentes que el art&iacute;culo intenta despejar,
en concreto, pensar que los programas son de alguna forma apropiables.

<P>Si debiera ubicarme en uno de los modelos de ideolog&iacute;as de hacker
descritos por Eric, probablemente me situar&iacute;a en el tipo integrista
anticomercial. Pero creo que su divisi&oacute;n de los tipos de hacker
es parcial, en parte como consecuencia de un intento consciente de provocar
mediante el humor, y en parte como resultado de la propagaci&oacute;n de
malentendidos habituales. En primer lugar "anti comercial" es simplemente
un concepto incorrecto: los hackers del tipo de la FSF no est&aacute;n
en absoluto en contra de hacer negocio; apoyan ardientemente la idea de
que los servicios de software deben ser remunerados, y que debe haber un
mercado libre para tales servicios; con lo que no est&aacute;n de acuerdo
es con la idea de que el software pueda ser pose&iacute;do y los malos
h&aacute;bitos asociados a las licencias comerciales.
<BR>Finalmente, "integrista" es un t&eacute;rmino obviamente parcial; yo
m&aacute;s bien dir&iacute;a que alguna gente tiene m&aacute;s o menos
tendencia a realizar compromisos si se presenta la oportunidad de apropiarse
ellos mismos de un software dado, y de promover o dificultar tales compromisos
en los otros, dos aspectos por lo dem&aacute;s independientes. El extremismo
y el fanatismo no son atributos exclusivos de los puritanos del software
libre que rechazan cualquier compromiso, sino que pueden encontrarse entre
gente de cualquier opini&oacute;n: no est&aacute;n unidos a una opini&oacute;n
particular, sino al hecho de que las opiniones se mantengan de forma dogm&aacute;tica
o no.

<P>En cuanto al pragmatismo, no es ciertamente un atributo que deba ser
otorgado a nadie en virtud de su disposici&oacute;n a aceptar compromisos.
Aceptar compromisos degradantes a largo plazo se llama "realpolitik", y
ha demostrado ser una estrategia in&uacute;til frente a enemigos descaradamente
inmorales (vease la historia del facismo o el comunismo), mientras que
el rigor se ha manifestado a menudo como&nbsp; una actitud ganadora (por
ejemplo, frente a la segregaci&oacute;n en Sud&aacute;frica). No estoy
sugiriendo en absoluto que no deba realizarse jam&aacute;s compromiso alguno,
sino que deben tenerse en cuenta sus implicaciones a largo plazo como una
parte m&aacute;s de los costes generados al aceptarlo, y no debe caerse
en la ceguera de considerar tan s&oacute;lo sus beneficios a corto plazo.
El art&iacute;culo de la catedral, manteniendo la observaci&oacute;n anterior,
es la mejor demostraci&oacute;n de que el modelo de desarrollo de software
libre del GNU constituye de hecho la aproximaci&oacute;n m&aacute;s pragm&aacute;tica
posible (otra confirmaci&oacute;n de que GNU es el modelo m&aacute;s adecuado
es la constante divisi&oacute;n observable en los proyectos regidos por
licencias del tipo BSD, tales como las variantes de BSD Unix o el proyecto
X).

<P>El punto fundamental en que Eric se equivoca consiste en que, por miedo
a asustar a unos accionistas poco educados, parece avergonzarse de la idea
de que el software no es apropiable y trata desesperadamente de evitarla
hasta el punto de no mencionarla como el axioma central de las teor&iacute;as
sobre software libre de la mayor parte de la gente (en aquellos casos en
que la tienen, por supuesto).

<P>Esta idea surge de forma natural a partir de las mismas fuentes de liberalismo
cl&aacute;sico y antropolog&iacute;a que Eric invoca como inspiraci&oacute;n
de su art&iacute;culo: la propiedad se justifica sobre recursos f&iacute;sicos
escasos como la &uacute;nica forma de controlar de manera fiable uno de
tales recursos sin introducir luchas permanentes entre la gente; pero el
software, al ser un tipo particular de ideas, no tiene similitud alguna
con los recursos: un n&uacute;mero arbitrario de personas puede tener una
idea sin privar a nadie de tenerla a la vez, y es la prohibici&oacute;n
de actuar de acuerdo con una idea dada (con una copia mental particular
de la misma)&nbsp; la que introduce los conflictos y la falta de libertad.

<P>Esta justificaci&oacute;n de que las ideas, la informaci&oacute;n, y
el software no son apropiables apoya&nbsp; la aparici&oacute;n de un mercado
en los servicios comerciales que tratan con ideas, informaci&oacute;n o
software en tanto en cuanto tales servicios implican la utilizaci&oacute;n
de recursos f&iacute;sicos. Tales servicios incluyen la b&uacute;squeda
(no el hallazgo) de nueva informaci&oacute;n, la caza de errores, la mejora
y puesta al d&iacute;a de la informaci&oacute;n existente, el soporte t&eacute;cnico,
los cursos de formaci&oacute;n que ayudan a manipular la informaci&oacute;n
entregada, la entrega de harware f&iacute;sico o de medios de soporte de
tal informaci&oacute;n, la garant&iacute;a de disponibilidad, relevancia,
y/o precisi&oacute;n de la informaci&oacute;n, asegurar frente a los riesgos
relacionados con su uso, etc. No puedo sino incluir una referencia a mi
propia p&aacute;gina WEB (en franc&eacute;s) sobre software libre, y mi
"Manifiesto de la informaci&oacute;n libre" (que se ha traducido parcialmente
al ingl&eacute;s) para aquellos a los que interese una discusi&oacute;n
m&aacute;s profunda de tales temas.

<P>Con tales conceptos en mente se desvanecen todas las dificultades con
que topa Eric en su art&iacute;culo sobre la colonizaci&oacute;n.

<P>En primer lugar, las divergencias entre las actitudes frente al software
libre no son contradicciones, sino meras diferencias; cada cual tiene su
actitud particular, que no necesariamente contradice la de ning&uacute;n
otro; del mismo modo en que cada programador escribe programas (es de suponer)
diferentes a los de cualquier otro sin contradecirlos. Cuando se considera
que el desarrollo y el uso del software libre requiere recursos humanos
escasos en cuanto a tiempo de desarrolladores y usuarios, se puede caer
en la tentaci&oacute;n de considerar cada diferencia como una contradicci&oacute;n
potencial. Sin embargo, esto no hace las diferencias relativas al software
libre m&aacute;s contradictorias entre s&iacute; de lo que lo son las que
aparecen con el software propietario; de hecho, mucho menos: el software
libre no puede sino hacer aparecer las incompatibilidades esenciales entre
programas que intentan captar los mismos recursos (de computaci&oacute;n,
humanos); mientras que el software propietario introduce tambi&eacute;n
oposiciones entre monopolios que intentan excluirse mutuamente con barreras
artificiales consistentes en costes de utilizaci&oacute;n y desarrollo
y la asuencia de las fuentes del programa.

<P>En segundo lugar, Eric ve una contradicci&oacute;n entre la te&oacute;rica
proclama de libertad en las licencias del software libre, que permite que
todo el mundo pueda modificar cualquier cosa, y la pr&aacute;ctica gragaria
por la cual los hackers siguen reglas estrictas de conducta al compartir
el c&oacute;digo. Pero no constituye mayor contradicci&oacute;n que el
hecho de que en aquellos pa&iacute;ses en los que existe libertad de asociaci&oacute;n
los individuos no crean docenas de asociaciones con ellos como &uacute;nicos
miembros. La libertad es un asunto de derechos civiles. &iexcl;El derecho
a hacer algo dentro de unos l&iacute;mites dados no significa que todas
las cosas que puedan realizarse dentro de ellos se lleve a la pr&aacute;ctica!.
Lo cual quiere decir que la gente ya tiene bastantes dificultades al tratar
con las limitaciones naturales del mundo f&iacute;sico y social, y no desea
sufrir la molestia adicional de artificiosas reglas humanas m&aacute;s
all&aacute; de lo que definen los l&iacute;mites mutuos de libertad.

<P>Los tab&uacute;s que Eric se&ntilde;ala pueden por tanto explicarse
en funci&oacute;n de las limitaciones humanas que afectan a las actividades
relacionadas con la programaci&oacute;n, de las que en su mayor parte ya
hemos hablado: mientras los programas no son apropiables y nunca lo ser&aacute;n,
el desarrollo de los programas, al igual que el trabajo relacionado con
el software, como su nombre indica, implica un gasto de recursos, y aquellos
hackers que vean sobrevivir a sus trabajos ser&aacute;n los que optimicen
la utilizaci&oacute;n de recursos escasos.

<P>La programaci&oacute;n implica en primer lugar conocimiento y comprensi&oacute;n
de los fines y medios de los programas, que pueden a su vez subdividirse
en fines externos (observables por usuarios no programadores) e internos
(perceptibles por programadores que mantienen, mejoran o simplemente modifican
el programa). Tal conocimiento y comprensi&oacute;n no son por supuesto
apropiables, y la libertad es el r&eacute;gimen bajo el cual ser&aacute;n
maximizables. Pero adquirir y coordinar el conocimiento requiere el uso
de canales de comunicaci&oacute;n y el acuerdo sobre los protocolos a usar;
y los canales de comunicaci&oacute;n fiables de alta velocidad <I>son</I>
un recurso escaso.

<P>La parte de costes de tecnolog&iacute;a hardware est&aacute; disminuyendo
con rapidez, como pone de manifiesto la aparici&oacute;n de Internet, que
ya ha jugado de hecho un papel importante en la difusi&oacute;n de la informaci&oacute;n
que ha hecho posible la cultura del software libre; este coste hardware
de la comunicaci&oacute;n ha sido siempre una preocupaci&oacute;n crucial
antes o fuera de Internet; e incluso en ella, la parte WWW, a pesar de
sus limitaciones, ha jugado un papel importante en la dram&aacute;tica
reducci&oacute;n del coste tecnol&oacute;gico relacionado con la creaci&oacute;n
de centros de difusi&oacute;n identificables con fiabilidad. Por supuesto,
la predominancia de los costes tecnol&oacute;gicos en la difusi&oacute;n
de informaci&oacute;n &uacute;til fuera de Internet ha ayudado a ocultar
el coste de la apropiaci&oacute;n de dicha informaci&oacute;n m&aacute;s
all&aacute; del ocasionado por su difusi&oacute;n, de modo que los monopolios
de la informaci&oacute;n se establecieron sin que el p&uacute;blico se
preocupara o incluso se diera cuenta de tal hecho, y sin que se considerara
su (temible) impacto sobre el avance tecnol&oacute;gico.

<P>Pero con Internet, el coste de distribuir software se ha aproximado
a cero, y el coste predominante en la difusi&oacute;n es el factor humano.
Ya que los humanos disponen de un tiempo limitado para leer y escribir
informaci&oacute;n; necesitan referencias que los gu&iacute;en en el oc&eacute;ano
de la informaci&oacute;n disponible; necesitan referencias sobre su distribuci&oacute;n,
sobre las que puedan descargar su preocupaci&oacute;n de encontrar informaci&oacute;n
fiable; necesitan centros de contacto para intercambiarla, en los que puedan
confiar para obtener informaci&oacute;n &uacute;til, y tomar en consideraci&oacute;n
las posibles respuestas. Una densa red de tales puntos de contacto, en
la que los programadores puedan intercambiar sus contribuciones, es lo
que se denomina un <I>proyecto</I> de programaci&oacute;n. Un proyecto
tiene una existencia bastante f&iacute;sica, lo que se opone a los meros
<I>objetos</I> de programaci&oacute;n que son ante todo informaci&oacute;n
inmaterial. Un proyecto dado puede lanzar (con mayor o menor regularidad)
objetos, pero no debe identificarse con ellos; tales objetos lanzados pueden
olvidarse, compartirse por millones de unidades, o reutilizarse de manera
divergente por diferentes proyectos aislados en el tiempo y el espacio
del proyecto original que los produjo.

<P>Los objetos de software no son jam&aacute;s asimilables con la propiedad,
independientemente de lo que uno lo intente. Las ideas no pueden poseerese.
La propiedad de algo es natural cuando, y s&oacute;lo entonces, algo tiene
la propiedad intr&iacute;nseca de la mutua exclusi&oacute;n. Que es el
caso de los objetos f&iacute;sicos y los servicios, pero <I>no</I> de las
ideas. Por otra parte, los <I>proyectos</I> de software son tan apropiables
como cualquier bien f&iacute;sico; tienen una identidad en el mundo f&iacute;sico,
independientemente de las partes de la noosfera que ya hayan sido exploradas
o que se pretendan explorar m&aacute;s adelante; consumen recursos f&iacute;sicos
(el trabajo de los hackers).

<P>El aspecto principal no percibido por Eric en su art&iacute;culo sobre
la colonizaci&oacute;n es por tanto que la combinaci&oacute;n de inter&eacute;s
y fama que yace en un proyecto, lo que hace que la gente invierta su tiempo
de programaci&oacute;n, lo que &eacute;l llama su <I>promesa, constituye
el bien escaso que interesa a los que desarrollan software libre.</I>

<P>Como ejemplo de que los proyectos de software libre generan recursos
y valor por s&iacute; mismos, sin necesidad de recurrir al uso artificial
de la apropiaci&oacute;n del software, podemos echar un vistazo a <A HREF="http://www.redhat.com">RedHat
software</A>, que s&oacute;lo escribe software libre (todas las versiones
de redhat, que son software, son libres) y sin embargo vende un n&uacute;mero
de copias suficiente de su Official RedHat CD como para prosperar, ya que
incluyen el inter&eacute;s, el empuje y la fama que constituye la esencia
del proyecto RedHat, identificado en su marca comercial.

<P>De hecho, si en el art&iacute;culo de Eric sustituimos cualquier referencia
a la propiedad de programas por referencias a la propiedad de proyectos
(el mismo Eric usa en ocasiones esta expresi&oacute;n m&aacute;s adecuada),
el resultado es casi totalmente correcto. En consecuencia, no puede decirse
que los programadores colonicen la noosfera, la esfera de los programas,
ya que es falso; los programas son algo inmaterial y no es posible mediante
esfuerzo colonizador alguno u otra actividad cualquiera traspasar una "m&aacute;gica"
frontera y&nbsp; crear una propiedad en la noosfera.&nbsp; En su lugar
los programadores colonizan una "imagen de la noosfera", la esfera de los
proyectos de programaci&oacute;n, que constituyen exploraciones f&iacute;sicas
de la noosfera inmaterial (lo que da a la publicaci&oacute;n de las "p&aacute;ginas
principales" de un proyecto un valor de ocupaci&oacute;n del territorio
m&aacute;s que metaf&oacute;rico).&nbsp; Lo siento por la autoestima de
Eric al haber encontrado otro eslogan de dos palabras de lo m&aacute;s
aparente: "colonizando la noosfera". Pero la correcci&oacute;n de las ideas
es m&aacute;s importante que los esl&oacute;gans de impacto, y estoy seguro
de que es tambi&eacute;n capaz de encontrar un buen eslogan que refleje
las ideas correctas en lugar de las err&oacute;neas.

<P>Tras corregir esta confusi&oacute;n, todo lo dem&aacute;s en el art&iacute;culo
de Eric resulta una consecuencia inmediata de las consideraciones anteriores,
y las dificultades desaparecen. La gente puede poseer y de hecho posee
proyectos que son m&aacute;s o menos prometedores; y la din&aacute;mica
de su posesi&oacute;n es esa cosa fluida que Eric describe con precisi&oacute;n,
pues la teor&iacute;a de la colonizaci&oacute;n se aplica perfectamente
a los proyectos en el campo del software.

<P>Un proyecto no se bifurca de forma arbitraria ya que la divisi&oacute;n
implica una divisi&oacute;n de su capital, de su "promesa", en varias partes,
lo que significa un menor retorno a la inversi&oacute;n en programaci&oacute;n
a menos que existan otras causas (tales como el reagrupamiento de otros
proyectos distintos, o la desaparici&oacute;n de un desacuerdo interno
importante) que hagan que uno de los proyectos resultantes aumente su atractivo
por encima del que ten&iacute;a el proyecto original. Aunque puedan limitarse
los perjuicios ocasionados por una bifurcaci&oacute;n del proyecto a base
de compartir c&oacute;digo entre las partes resultantes, existen costes
proporcionales al grado de divergencia de los proyectos (lo que justifica
la ruptura), por lo cual lo anterior es tan s&oacute;lo un atenuante .

<P>El simple hecho de que los proyectos puedan bifurcarse prueba que no
pertenecen a la noosfera, ya que la bifurcaci&oacute;n resulta un concepto
escasamente aplicable a ideas plat&oacute;nicas inmutables. Los dos (o
m&aacute;s) proyectos resultantes de una bifurcaci&oacute;n parten de los
mismos programas en la misma posici&oacute;n de la noosfera, lo que resulta
incompatible con la posesi&oacute;n de los programas que una vez m&aacute;s
requiere la idea de exclusi&oacute;n mutua; pero que es sin mebargo compatible
con la idea de possi&oacute;n de proyectos que exploran la noosfera, si
bien con recursos diferentes y una historia pasada y/o futura asimismo
distinta.

<P>Respecto a lo que Eric considera el segundo "tab&uacute;" del software
libre, la oposici&oacute;n a realizar modificaciones fuera de la coordinaci&oacute;n
reconocida en un proyecto, puede considerarse un simple corolario del anterior,
pues todo aquel que realiza modificaciones de este tipo act&uacute;a como
lo har&iacute;a dentro de su propia bifurcaci&oacute;n del proyecto, aunque
unos pocos parches no oficiales puedan ser incorporados (eventualmente)
a las fuentes del proyecto oficial.

<P>Podemos por tanto cuestionar&nbsp; que el software libre implique una
econom&iacute;a basada en el regalo. Para empezar, la misma noci&oacute;n
de "regalo" es confusa cuando se aplica al software tal como hace Eric
en su art&iacute;culo, por cuanto el software no es pose&iacute;ble, pero
resulta completamente significativa si la aplicamos a los proyectos y al
tiempo de programaci&oacute;n. Por tanto, podemos ver que de hecho mucho
del software libre que se escribe y distribuye actualmente se realiza durante
el "abundante tiempo libre" de los hackers que de esta forma regalan un
tiempo de programaci&oacute;n precioso sin recibir a cambio una compensaci&oacute;n
monetaria. Es decir que s&iacute;, que puede ser cierto que el el software
libre <I>actual</I> sea principalmente una cultura basada en la donaci&oacute;n.
Pero en ese caso el acaparamiento del software, al desplazar los ingresos
desde los desarrolladores a los monopolizadores, del trabajo leg&iacute;timo
a la rapi&ntilde;a, distorsiona completamente el mundo del software: el
capital se orienta hacia privilegios econ&oacute;micos artificiales y se
emplea en imponer o utilizar leyes injustas, en lugar de invertirse en
actividades &uacute;tiles. Como resultado, los programadores capaces que
se dedican al software libre no obtienen un reconocimiento de tipo econ&oacute;mico,
y el desarrollo de la mayor parte del software libre (o abierto) debe realizarse
de forma gratuita, lo que explica porqu&eacute; los hackers que se mueven
en el mundo del software libre se ven forzados, <I>qui&eacute;ranlo o no</I>,
a la donaci&oacute;n de sus obras: la raz&oacute;n no es otra que los mecanismos
de apropiaci&oacute;n los excluyen casi totalmente de la econom&iacute;a
predominante en el mundo del software. La gente que participa en el desarrollo
de software libre puede en cierta medida involucrarse en una "cultura del
regalo", algo que no se opone a una cultura de la competici&oacute;n; pero
las reglas del juego han sido cambiadas y la competici&oacute;n se desarrolla
entre recursos disponibles pero escasos, no entre recursos que son o bien
inalcanzables o abundantes. En caso de que la ley se corrigiera y dejara
de apoyar la apropiaci&oacute;n del software al reconocer la artificialidad
de la "posesi&oacute;n" en la noosfera, creo que el desarrollo del software
as&iacute; liberado llevar&iacute;a a un floreciente mercado libre de los
servicios relacionados con el software que tendr&iacute;a poco que ver,
para bien o para mal, con una econom&iacute;a del regalo.

<P>El fen&oacute;meno con el que cabe comparar de forma adecuada el desarrollo
del software libre es la investigaci&oacute;n cient&iacute;fica te&oacute;rica.
De hecho, ambos proceden del mismo fen&oacute;meno general: la creaci&oacute;n
sistem&aacute;tica de nueva informaci&oacute;n. Y comparten un mismo origen
hist&oacute;rico, ya que el mundo del software libre naci&oacute; en universidades
conectadas a trav&eacute;s de Internet y fue creado por estudiantes y profesores
en ciencias de la computaci&oacute;n, matem&aacute;ticas, f&iacute;sica,
qu&iacute;mica, y dem&aacute;s.&nbsp; En tales campos, la gente explora
un espacio compuesto por objetos de informaci&oacute;n puros, que no pueden
ser poseidos, aunque se pelee por la fama y por atraer el inter&eacute;s
de otras personas a un campo de trabajo particular, de forma que los problemas
que nos afectan puedan ser resueltos o puedan captarse fondos adicionales.
Todo lo que digamos sobre la cultura del software libre es aplicable asimismo
a la ciencia te&oacute;rica y viceversa.

<P>La comparaci&oacute;n resulta perfecta en lo que concierne a la evaluaci&oacute;n
por iguales: &eacute;sta es la &uacute;nica forma aceptada de juzgar la
calidad tanto en ciencia como en el software. De hecho, llegar&iacute;a
hasta extender la afirmaci&oacute;n anterior a cualquier intercambio de
informaci&oacute;n: es el juicio entre iguales el que asegura la mejor
calidad de cualquier informaci&oacute;n, ya sea cient&iacute;fica, t&eacute;cnica,
financiera, o relacionada con cualquier aspecto de la vida, incluyendo
los asuntos m&aacute;s comunes del d&iacute;a a d&iacute;a. Es &eacute;ste
mecanismo el que establece los precios en un mercado libre, en funci&oacute;n
de la informaci&oacute;n disponible. Y es por esto por lo cual la libertad
de informaci&oacute;n resulta esencial para mantener el equilibrio en una
econom&iacute;a de mercado, y por lo que la revisi&oacute;n entre iguales
deber&iacute;a extenderse a todos los campos del conocimiento, para lo
que ser&iacute;a necesaria la abolici&oacute;n de los privilegios actuales
relacionados con la informaci&oacute;n, ya sean secretos, patentes,&nbsp;
acuerdos de no difusi&oacute;n, o derechos de propiedad intelectual y de
copia. Sin embargo, en aras de la brevedad, me centrar&eacute; tan s&oacute;lo
en este art&iacute;culo en el tema del software.

<P>La noci&oacute;n de que el reconocimiento de la autor&iacute;a debe
ser respetado, de que se conserve la pista de c&oacute;mo se cre&oacute;
la informaci&oacute;n, que constituye el tercer "tab&uacute;" del software
libre percibido por Eric, est&aacute; tambi&eacute;n presente en Ciencia.
En primer lugar, tal seguimiento resulta sumamente &uacute;til cuando se
investiga en campos que analizan procesos hist&oacute;ricos, o se exploran
temas relacionados entre s&iacute;. Y, de manera m&aacute;s prosaica, es
necesario para asegurar un reconocimiento adecuado a los autores, de modo
que sean ellos los que logren la fama o la verg&uuml;enza asociada a su
trabajo, y se dediquen inversiones adicionales a proyectos que lo merezcan
(que los proyectos que tienen reconocida una "promesa" dada se beneficien
de recursos adicionales proporcionales a su m&eacute;rito). Aquellos que
borran tales huellas, que no les costar&iacute;a nada mantener, causan
a otros las molestias derivadas de la privaci&oacute;n de una informaci&oacute;n
&uacute;til, o les obligan a gastar recursos valiosos en su reconstrucci&oacute;n,
a la vez que minan el proceso de la evaluaci&oacute;n entre iguales. Tal
actitud puede por tanto asimilarse al vandalismo gratuito o al robo cuando
se realiza por inter&eacute;s; y es por lo que la costumbre lo desaprueba
con firmeza y por lo que quiz&aacute; deber&iacute;a ser incluso punible
por ley.

<P>No tengo m&aacute;s objeciones importantes al resto de los art&iacute;culos
de Eric S. Raymond. Terminar&eacute; diciendo que todas las confusiones
y parcialidades que aparecen en sus art&iacute;culos son t&iacute;picos
de su elecci&oacute;n de la "pol&iacute;tica real" como principio de actuaci&oacute;n
en su activismo en pro del software libre. Un ejemplo de esta elecci&oacute;n
es haber cambiado con efectos retroactivos en sus art&iacute;culos y conferencias
el t&eacute;rmino "software libre" por "software abierto". No discrepo
de la noci&oacute;n de ser eficaz promoviendo el software libre. Pero me
opongo a acciones que pueden resultar atajos v&aacute;lidos a corto plazo
y causar perjuicios a la larga, ya que en estos casos, en la b&uacute;squeda
de un &eacute;xito puntual, se opta por apoyar fen&oacute;menos esencialmente
err&oacute;neos en lugar de combatirlos.

<P>Las leyes actuales han creado la noci&oacute;n artificial de "propiedad
intelectual", y han hecho uso de ella como &uacute;nico modo de defender
la necesaria validaci&oacute;n de la informaci&oacute;n en un sistema de
revisi&oacute;n por iguales. Estas leyes han corrompido completamente las
instituciones econ&oacute;micas, ya que muchas corporaciones dependen de
un modo crucial del monopolio de la informaci&oacute;n, tambi&eacute;n
en el origen de grandes fortunas, m&aacute;s que de ser pagadas a cambio
de la prestaci&oacute;n de servicios reales. No deben realizarse compromisos
con estas leyes, y debe lucharse contra su justificaci&oacute;n, habitualmente
err&oacute;nea. Este es el principio fundamental de la filosof&iacute;a
del software libre. Lo menos que Eric podr&iacute;a hacer es evitar tales
justificaciones, en lugar de apoyarlas. Es dif&iacute;cil luchar contra
prejuicios que sirven para justificar enormes intereses financieros, por
supuesto. Hace falta ser muy estricto precisamente porque la tearea es
muy dura.
<BR>&nbsp;

<P>
<HR>
<ADDRESS>
Far&eacute; -- Fran&ccedil;ois-Ren&eacute; Rideau</ADDRESS>

</BODY>
</HTML>
