<HTML>
<HEAD>
<TITLE>Servidor De Ra&iacute;ces NFS Mini-COMO: Prefacio</TITLE>
</HEAD>
<BODY>
<A HREF="Servidor-Raices-NFS-Como-1.html">Anterior</A>
<A HREF="Servidor-Raices-NFS-Como-3.html">Siguiente</A>
<A HREF="Servidor-Raices-NFS-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Prefacio</A></H2>


<P>Este Mini-Como ha sido escrito para ayudar a las personas que desean
preparar los directorios de un servidor para ser montados como directorio
ra&iacute;z mediante por clientes NFS. </P>
<P>Por favor, tenga en cuenta que existen muchas maneras de lograr esto,
dependiendo de las necesidades y de sus intenciones.  Si cada cliente es
individual, y cada uno de ellos tiene su propio usuario y administrador,
ser&aacute; necesario que una parte significativa de los directorios de cada
cliente no sea compartida con otro cliente.  Por otro lado, si el cliente
es accesible a muchos usuarios y est&aacute;n todos administrados por la misma
persona (como en un aula de clases), se buscar&aacute; que la mayor cantidad
posible de archivos est&eacute;n compartidos a los efectos de hacer la
administraci&oacute;n m&aacute;s manejable.  Este Como se enfoca en esta segunda
opci&oacute;n.</P>

<H2><A NAME="sec21"></A> <A NAME="ss2.1">2.1 Nota </A></H2>


<P>Cuando se construye el que ser&aacute; el directorio ra&iacute;z del cliente, y se trata
de ocupar un espacio m&iacute;nimo, se debe atender principalmente a qu&eacute; archivos
pueden ser compartidos o montados desde el servidor.  En este Como
recomiendo la configuraci&oacute;n de un cliente basado en mi experiencia.  Pero
antes de empezar tenga en cuenta que:</P>
<P>
<UL>
<LI>Este Mini-COMO no explica la importaci&oacute;n del directorio ra&iacute;z por
NFS. Refi&eacute;rase al <I>Linux-Con-Ra&iacute;z-NFS Mini-COMO</I> si necesita mayor
informaci&oacute;n sobre esto.
</LI>
<LI>Yo baso la mayor&iacute;a de las configuraciones de mis clientes en
montajes y enlaces simb&oacute;licos.  Muchos de los enlaces simb&oacute;licos pueden
ser reemplazados por enlaces r&iacute;gidos (<I>hardlinks</I>).  Uno puede elegir
de acuerdo a sus preferencias personales.  Utilizar enlaces r&iacute;gidos sobre
lo montado en vez de enlaces simb&oacute;licos tiene sus ventajas, pero puede
causar confusi&oacute;n.  Un archivo no es borrado definitivamente hasta que
todos los enlaces r&iacute;gidos sean eliminados.  Por esto, en previsi&oacute;n del
caso en que alg&uacute;n archivo sea puesto al d&iacute;a y el enlace r&iacute;gido todav&iacute;a se
refiera a la versi&oacute;n vieja, es necesario tener especial cuidado en
recordar cada enlace que utilice.
</LI>
<LI>Cuando se monta la informaci&oacute;n desde el servidor, pueden seguirse
dos m&eacute;todos.  El primero (y m&aacute;s com&uacute;n), es montar la totalidad del
directorio ra&iacute;z del servidor bajo un directorio local, y cambiar
simplemente la trayectoria de b&uacute;squeda o enlazar los directorios
relevantes all&iacute;.  Personalmente no me gusta montar la partici&oacute;n ra&iacute;z del
servidor en los clientes.  Por ello, este Como sugiere un m&eacute;todo para
montar los directorios relevantes del servidor en los lugares apropiados
del sistema.
</LI>
<LI>Este Como est&aacute; basado en mi experiencia en la preparaci&oacute;n de
directorios para clientes basados en la distribuci&oacute;n Slackware 3.1.
Algunas cosas pueden resultar diferentes (especialmente en los archivos
<CODE>rc.*</CODE>), para usuarios de otras distribuciones, sin embargo los m&eacute;todos
y conceptos no var&iacute;an.   </LI>
</UL>
</P>


<HR>
<A HREF="Servidor-Raices-NFS-Como-1.html">Anterior</A>
<A HREF="Servidor-Raices-NFS-Como-3.html">Siguiente</A>
<A HREF="Servidor-Raices-NFS-Como.html#toc2">Indice</A>
</BODY>
</HTML>
