<HTML>
<HEAD>
<TITLE>Gu&iacute;a de usuario de Linuxdoc-SGML: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Linuxdoc-Como-2.html">Siguiente</A>
<A HREF="Linuxdoc-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>Esta es una gu&iacute;a de usuario para el sistema de procesado de documentaci&oacute;n
<CODE>linuxdoc-SGML</CODE>, concebido para producir informaci&oacute;n relativa a LiNUX. 
Consiste en una Definici&oacute;n de Tipo de Documento SGML (DTD), junto con un
juego de ``archivos de reemplazo'' que convierten el SGML a fuentes
inteligibles por <CODE>groff</CODE>, LaTeX, HTML, GNU info, LyX, y RTF. </P>

<P><CODE>linuxdoc-sgml</CODE> Est&aacute; fuertemente basado en el paquete QWERTZ DTD de
Thomas Gordon <CODE>
<A HREF="mailto:thomas.gordon@gmd.de">thomas.gordon@gmd.de</A></CODE>. Lo &uacute;nico que he hecho han sido
revisiones a sus definiciones de tipo de documento, y los archivos
sustitutorios para su empleo espec&iacute;fico con d ocumentaci&oacute;n relativa a
LiNUX. </P>

<P><CODE>linuxdoc-sgml</CODE> no pretende ser un sistema gen&eacute;rico de procesado de
documentaci&oacute;n.  A pesar de que puede emplearse para documentos de varias
clases, lo he limitado para el uso de los escritores de LiNUX para
producir HOWTOs, FAQs, y (posteriormente) para los manuales del Linux
Documentation Project (LDP). No pretende ser un sistema de pr ocesado de
documentaci&oacute;n gen&eacute;rico; He manipulado sus posibilidades con este
prop&oacute;sito.</P>
<P>Si se percibe una falta de generalidad en el sistema, se debe a esta
raz&oacute;n. No hay nada que limite <CODE>linuxdoc-SGML</CODE> a la producci&oacute;n de
documentaci&oacute;n sobre LiNUX, pero todo lo producido con este sistem a tendr&aacute;
un aspecto caracter&iacute;stico. Si se desea que la apariencia sea distinta,
sugiero que se emplee un sistema m&aacute;s generalizado como el QWERTZ DTD, en
combinaci&oacute;n con las herramientas Linuxdoc-SGML. </P>

<P>Uno de los objetivos de este sistema es hacer f&aacute;cil la producci&oacute;n de
documentos en distintos formatos. Hasta ahora, la mayor&iacute;a de la
documentaci&oacute;n LiNUX hab&iacute;a sido producida a trav&eacute;s de edici&oacute;n manual. Un
sistema como <CODE>groff</CODE> puede ocuparse del formate o para una versi&oacute;n
ASCII, pero sigue sin poder proporcionar HTML (para su uso en World Wide
Web), LaTeX (para documentos impresos con calidad), o GNU <CODE>info</CODE>. Por
este motivo, si faltan prestaciones en este sistema de las que se quisiese
disfrutar, <EM>h&aacute;zmelo saber, por favor!</EM> La idea es que no hagan falta
demasiadas triqui&ntilde;uelas para producir documentos agradables en m&uacute;ltiples
formatos.</P>
<P>El autor debe de tener que hacer lo m&iacute;nimo posible.</P>

<H2><A NAME="ss1.1">1.1 Acerca de este documento.</A></H2>


<P>Este documento fue escrito usando el DTD <CODE>linuxdoc-sgml</CODE>. Contiene m&aacute;s
o menos todo lo que se necesita saber para escribir documentos SGML con
este DTD (definici&oacute;n de tipo de documento). V&eacute;ase <CODE>Linuxdoc-Ejemplo.sgml</CODE> 
para
ver un ejemplo de documento que se puede tener como modelo a la hora de
escribir los propios. </P>


<H2><A NAME="ss1.2">1.2 ¿Por qu&eacute; SGML?</A></H2>


<P>Eleg&iacute; SGML para este sistema porque est&aacute; concebido espec&iacute;ficamente para su
posterior transformaci&oacute;n a otros formatos. SGML, abreviatura de
<EM>Standard Generalized Markup Language</EM>, permite especificar la
<EM>estructura</EM> del documento---esto es, qu&eacute; tipo de cosas dan forma al
documento. La estructura del documento se especifica con un DTD.
<CODE>linuxdoc-sgml</CODE> es un DTD que especifica la estructura para los HOWTOs
y otros documentos de LiNUX. QWERTZ es otro DTD; el SGML est&aacute;ndar
proporciona DTDs para libros , art&iacute;culos, y otras clases de documentaci&oacute;n
gen&eacute;rica. </P>
<P>El DTD especifica los nombres de los ``elementos'' que forman parte de un
documento. Un elemento es simplemente una parte de la estructura---como
una secci&oacute;n, subsecci&oacute;n, un p&aacute;rrafo, o simplemente algo menor como
<EM>texto remarcado</EM>. A diferencia del LaT eX, no obstante, estos
elementos no son en modo alguno intr&iacute;nsecos al SGML en s&iacute; mismo. La
definici&oacute;n de documento linuxdoc-sgml viene a definir elementos muy
similares a su equivalentes en LaTeX ---tiene secciones, subsecciones,
``entornos'' de texto y d em&aacute;s---. No obstante, empleando SGML se pueden
definir cualquier tipo de estructuras de documento que se quieran. En
cierto modo, es similar al TeX de bajo nivel, mientras que el DTD
<CODE>linuxdoc-sgml</CODE> se parece m&aacute;s al LaTeX. </P>
<P>No dejarse confundir por esta analog&iacute;a. SGML <EM>no</EM> es un sistema de
formateo de documentaci&oacute;n. No existe un ``formateador SGML'' en s&iacute; mismo.
El fuente SGML es <EM>s&oacute;lo</EM> convertido a otros formatos para su procesado.
Adem&aacute;s, el SGML por s&iacute; mismo lo &uacute;nic o que hace es especificar la
estructura del documento. No existen dispositivos o ``macros'' intr&iacute;nsecos
al SGML en s&iacute; mismo. Todos estos aspectos son definidos en el DTD. No se
puede hacer uso del SGML sin el DTD ---el DTD define lo que hace el SGML---</P>


<H2><A NAME="ss1.3">1.3 C&oacute;mo funciona.</A></H2>


<P>He aqu&iacute; c&oacute;mo procesar un documento con SGML y c&oacute;mo funciona el DTD
<CODE>linuxdoc-sgml</CODE>. Primero, se necesita una definici&oacute;n de tipo de
documento (DTD). Yo estoy empleando el DTD QWERTZ, que fue realizado en
sus principios por un grupo de personas que neces itaban un DTD estilo
LaTeX. He modificado el DTD QWERTZ obteniendo el DTD <CODE>linuxdoc-sgml</CODE>
para nuestros prop&oacute;sitos.  El DTD &uacute;nicamente configura la estructura del
documento. Una peque&ntilde;a porci&oacute;n del mismo tiene este aspecto: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;!element article - -
        (titlepag, header?, 
         toc?, lof?, lot?, p*, sect*, 
         (appendix, sect+)?, biblio?) +(footnote)&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esta parte configura la estructura global para un ``article'', que viene a
ser un ``estilo de documento'' en LaTeX. El art&iacute;culo consiste en una
p&aacute;gina de portada (<CODE>titlepag</CODE>), un encabezamiento opcional,
(<CODE>header</CODE>); una tabla de contenidos opcional tambi&eacute;n, (<CODE>toc</CODE>),
listado de figuras y de tablas opcionales (<CODE>lof</CODE> y <CODE>lot</CODE>), cualquier
n&uacute;mero de p&aacute;rrafos (<CODE>p</CODE>), y secciones principales (<CODE>sect</CODE>) ap&eacute;ndices
opcionales (<CODE>appendix</CODE>), bibliograf&iacute;a (<CODE>biblio</CODE>) y notas al pie
(<CODE>footnote</CODE> ). </P>
<P>Como puede observarse, el DTD no menciona nada acerca de c&oacute;mo deber&iacute;a de
formatearse el documento, o sobre el aspecto que deber&iacute;a tener.
Simplemente define qu&eacute; partes conforman el documento. En alguna parte del
DTD, son definidas las estructuras de <CODE>titlepag</CODE>, <CODE>header</CODE>, 
<CODE>sect</CODE>, as&iacute; como otros elementos. </P>
<P>No se precisa saber nada acerca de la sintaxis del DTD para escribir
documentaci&oacute;n. Simplemente lo presento para que as&iacute; se sepa su aspecto, y
lo que hace. Se <EM>necesita</EM> estar familiarizado con la <EM>estructura</EM>
que defina el DTD. De no ser as&iacute;, podr&iacute; a violarse la estructura a la hora
de tratar de escribir un documento, y quedarse muy confundido con los
mensajes de error resultantes. Describiremos en detalle la estructura de
los documentos <CODE>linuxdoc-sgml</CODE> m&aacute;s tarde. </P>
<P>El siguiente paso es escribir el documento empleando la estructura
definida por el DTD. Nuevamente, el DTD <CODE>linuxdoc-sgml</CODE> hace que la
apariencia de los documentos sea muy similar al LaTeX ---muy simple de
seguir---. En la jerga SGML, un documento esc rito empleando un DTD
espec&iacute;fico, se conoce como una instancia de ese documento. </P>
<P>A fin de traducir el fuente SGML a otro formato (como LaTeX o groff) para
su procesado, el fuente SGML (el documento que escribiste) es
<EM>analizado</EM> junto con el DTD por (lo adivinaste) el <EM>analizador</EM>
SGML. </P>
<P>Estoy empleando el analizador <CODE>sgmls</CODE> de James Clark,
<CODE>
<A HREF="mailto:jjc@jclark.com">jjc@jclark.com</A></CODE>, 
quien precisamente resulta ser el creador de
<CODE>groff</CODE>. Estamos en buenas manos.  El analizador (<CODE>sgmls</CODE>)
&uacute;nicamente toma tu documento y verifica que sigue la estructura definida
anteriormente en el DTD. Tambi&eacute;n devuelve un formato m&aacute;s espl&iacute;cito de tu
documento, con todos las ``macros'' y dem&aacute;s elementos expandidos, lo cual
es inteligible para <CODE>sgmlasp</CODE>, la siguiente fase del proceso. </P>
<P><CODE>sgmlsasp</CODE> es el responsable de la conversi&oacute;n de la salida de
<CODE>sgmls</CODE> a otro formato (como LaTeX). Lleva a cabo esta tarea usando
<EM>archivos sustitutivos</EM>, que describen c&oacute;mo convertir elementos del
SGML original al fuente correspondiente en el formato ``destino'' (como
LaTeX o <CODE>groff</CODE>). </P>
<P>Por ejemplo, parte del archivo de reemplazamiento para LaTeX tendr&iacute;a este
aspecto: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;itemize&gt;       +       &quot;\\begin{itemize}      +
&lt;/itemize&gt;      +       &quot;\\end{itemize}        +
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El cual dice que siempre que se comience un elemento <CODE>itemize</CODE> en el
fuente SGML, deber&aacute; ser reemplazado por</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
\begin{itemize}
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>en el fuente LaTeX. (Como dije, los elementos del <CODE>linuxdoc-sgml</CODE> DTD
son muy similares a sus equivalentes en LaTeX). </P>
<P>Asi que para convertir el SGML a otro formato, todo lo que se ha de hacer
es escribir un archivo de reemplazamiento nuevo para ese formato que
proporcione las analog&iacute;as apropiadas para los elementos SGML en el nuevo
formato. En la pr&aacute;ctica, no es tan simp le ---por ejemplo, si se est&aacute;
intentando convertir a un formato que no est&aacute; estructurado enteramente
como tu DTD, van a haber problemas---. En cualquier caso, es m&aacute;s f&aacute;cil de
hacer que escribir analizadores individuales y traductores para varios
tipos de formatos de salida; SGML proporciona un sistema gen&eacute;rico de
conversi&oacute;n de fuentes a varios formatos. </P>
<P>Una vez <CODE>sgmlsasp</CODE> ha concluido su trabajo, se obtiene el fuente LaTeX
que corresponde al documento SGML original, el cual puede ser formateado
empleando LaTeX como se har&iacute;a normalmente. Posteriormente dar&eacute; en este
documento ejemplos y mostrar&eacute; los com andos empleados para llevar a cabo
la traducci&oacute;n y formateo. Todo puede ser llevado a cabo desde la l&iacute;nea de
comandos. </P>
<P>Pero primero, debo describir c&oacute;mo instalar y configurar el software.</P>


<HR>
Anterior
<A HREF="Linuxdoc-Como-2.html">Siguiente</A>
<A HREF="Linuxdoc-Como.html#toc1">Indice</A>
</BODY>
</HTML>
