<HTML>
<HEAD>
<TITLE>Gu&iacute;a de usuario de Linuxdoc-SGML: Anexo a la Traducci&oacute;n al Castellano.</TITLE>
</HEAD>
<BODY>
<A HREF="Linuxdoc-Como-3.html">Anterior</A>
<A HREF="Linuxdoc-Como-5.html">Siguiente</A>
<A HREF="Linuxdoc-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Anexo a la Traducci&oacute;n al Castellano.</A></H2>



<H2><A NAME="ss4.1">4.1 Aspectos Importantes del SGML-LaTeX en Castellano</A></H2>



<H3>Tildes, E&ntilde;es, Etc.</H3>


<P>Para que aparezcan las tildes, e&ntilde;es y dem&aacute;s caracteres tipogr&aacute;ficos
t&iacute;picos del castellano que <EM>no</EM> sean ``caracteres especiales'' basta
como escribirlos como tales en el fuente (para ello, deber&aacute;s cargar el
mapa de teclado espa&ntilde;ol, <CODE>es.map</CODE>, cosa q ue se suele configurar con el
programa de instalaci&oacute;n de LiNUX), que el editor los soporte (para <CODE>vi</CODE>
no hacen falta m&aacute;s configuraciones) y pasarle el par&aacute;metro `-l' al script
de conversi&oacute;n utilizado; (actualmente, s&oacute;lo soportan esta opci&oacute;n
<CODE>sgml2la tex</CODE>, <CODE>sgml2html</CODE>, y <CODE>sgml2txt</CODE>). </P>

<H3>Tama&ntilde;o del Papel.</H3>


<P>Este no es un aspecto crucial, pero no est&aacute; de m&aacute;s saberlo. Para que los
documentos a LaTeX se formateen en un tama&ntilde;o de papel A4, t&iacute;pico en
nuestro pa&iacute;s, basta con que al script de conversi&oacute;n se le pase el
par&aacute;metro `-a'. Tambi&eacute;n se puede especificar est o a <CODE>dvips</CODE> con la
opci&oacute;n `-a4'. </P>

<H3>Los t&iacute;tulos de las Tablas de Contenidos, Bibliograf&iacute;a, etc.</H3>


<P>Este era un aspecto bastante molesto del LaTeX, el que se generasen
autom&aacute;ticamente los t&iacute;tulos de las macros <CODE>toc</CODE>, <CODE>lof</CODE>, <CODE>lot</CODE>,
<CODE>biblio</CODE>, etc... con los t&iacute;tulos en ingl&eacute;s; esto est&aacute; solucionado
empleando el paquete <EM>babel</EM> que suele veni r incluido con LaTeX, y que
en lo que a nosotros ata&ntilde;e, da soporte a castellano, catal&aacute;n y gallego. </P>
<P>Para hacer uso del mismo basta con ejecutar <CODE>texconfig</CODE>, y configurar
las ``<EM>hyphenation tables</EM>'', generalmente editando desde el shell de
configuraci&oacute;n de <CODE>texconfig</CODE> el archivo <CODE>languaje.dat</CODE>, en el que se
ha de descomentar el patr&oacute;n perten eciente al espa&ntilde;ol; al salir de
<CODE>texconfig</CODE> tendr&eacute;is el LaTeX configurado para funcionar en castellano.
Personalmente, dejo solamente el patr&oacute;n perteneciente al espa&ntilde;ol, y no
tengo problemas, no s&eacute; si dar&aacute; problemas dejando varios. </P>
<P>Despu&eacute;s es necesario editar el fichero <CODE>&amp;LINUXDOCLIB/rep/latex/mapping</CODE> y a&ntilde;adir en las definiciones de
cada DTD (article, etc), ``spanish'', de modo que quedar&iacute;a as&iacute;: </P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
&lt;qwertz&gt;        +
&lt;/qwertz&gt;       +

&lt;article&gt;       + &quot;\\documentstyle\[linuxdoc-sgml,isolatin,spanish,qwertz,[OPTS]\]{article}\n&quot;                                   ^  ^  ^  
                        &quot;\\input{epsf.tex}\n&quot;   +

&lt;/article&gt;      +       &quot;\\end{document}&quot;       +

[...]
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>


<HR>
<A HREF="Linuxdoc-Como-3.html">Anterior</A>
<A HREF="Linuxdoc-Como-5.html">Siguiente</A>
<A HREF="Linuxdoc-Como.html#toc4">Indice</A>
</BODY>
</HTML>
