<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="SystemAdministration">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf289, SystemAdministration: El filtrado de paquetes con Linux</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Vincent Renardias
 =LF=CAT___: SystemAdministration
 =LF=TITLE_: El filtrado de paquetes con Linux
 =LF=NUMBER: 289
 =LF=ANAME_: article289.html
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/VincentRenardias.jpg" alt="Vincent Renardias" width="100" height="115">
<BR>por  Vincent Renardias <br> <small>&lt;vincent(at)renardias.com&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<p> Usuario de GNU/Linux desde 1993, Vincenct Renardias
    comenz&oacute; a involucrarse en su desarrollo en 1996: desarrollador de Debian,
    autor de la traducci&oacute;n francesa de The Gimp y el entorno GNOME,
    creador del grupo de usuarios de Linux en Marsella (PLUG), ... Actualmente
    director de I+D de la compa&ntilde;ia EFB2, sigue contribuyendo al sistema GNU/Linux.</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Roberto Hernando (<a href="http://www.rhernando.ya.st"><font size="1">homepage</font></a>)
<br>
<!--
 =LF=TRANSTO=es: Roberto Hernando
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#289lfindex0">&iquest;Pasarela, Proxy-Arp o Puente Ethernet?</A></LI>
  <LI><A HREF="#289lfindex1">Reglas b&aacute;sicas de filtrado</A></LI>
  <LI><A HREF="#289lfindex2">Netfilter</A></LI>
  <LI><A HREF="#289lfindex3">Ejemplo de configuraci&oacute;n</A></LI>
  <LI><A HREF="#289lfindex4">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=289">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>El filtrado de paquetes con Linux</H2>
<img src="../../common/images/article289/illustration289.jpg" alt="[Illustration]" hspace="10"  width="283" height="193">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->
<p>Este art&iacute;culo ha sido publicado en un n&uacute;mero especial sobre la seguridad de Linux
    Magazine France. El editor, los autores y los traductores han aceptado amablemente que todos
    los art&iacute;culos de ese n&uacute;mero especial sean publicados en LinuxFocus. En consecuencia,
    LinuxFocus os "ofrecer&aacute;" esos art&iacute;culos a medida que se vayan traduciendo al ingl&eacute;s.
    Este resumen se reproducir&aacute; en todos los art&iacute;culos que tengan el mismo origen.

    </p><p><br>

        Uno de los mejores medios para evitar los intentos de intrusi&oacute;n sigue
        siendo filtrar todas las entradas a la red que no se utilicen. Esta tarea
        habitualmente la desempe&ntilde;a una m&aacute;quina que hace las veces de
        "firewall" (cortafuegos).
        <br>En este art&iacute;culo, detallaremos los principios b&aacute;sicos
        para la implementaci&oacute;n y configuraci&oacute;n de dicho sistema.</p>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


    <A NAME="289lfindex0">&nbsp;</A>
<H2>&iquest;Pasarela, Proxy-Arp o Puente Ethernet?</H2>


    <p>El mecanismo de filtrado puede considerarse como una malla que retiene
	 ciertos paquetes no deseados. Lo m&aacute;s importante es
    encontrar el tama&ntilde;o adecuado del mallado, as&iacute; como el lugar donde ponerla.<br>
    <br>
    </p>

    <center>
      <b>Localizaci&oacute;n del cortafuegos en la red</b><br>
       <img src="../../common/images/article289/packet-filter.png"
      alt="Localizaci&oacute;n del cortafuegos" height="271" width="565">
    </center>

    <p>Para poder filtrar apropiadamente los paquetes, el mecanismo
    de filtrado debe intercalarse f&iacute;sicamente entre la red a proteger
    y el "resto del mundo". En la pr&aacute;ctica, esto se hace con
    una m&aacute;quina que tenga dos interfaces de red (normalmente Ethernet),
    una conectada a la red interna y la otra al router (encaminador) que
    permite el acceso al exterior. De esta forma, las comunicaciones
    pasar&aacute;n obligatoriamente por el cortafuegos que las bloquear&aacute; o no
    seg&uacute;n su contenido.<br>
    La m&aacute;quina con el mecanismo de filtrado se puede configurar de 3
    formas diferentes:<br>
<br>

    - gateway (pasarela) "simple": es la configuraci&oacute;n m&aacute;s habitual. La
    m&aacute;quina se utiliza como una pasarela entre dos redes o subredes.
    Las computadoras en la red local se deben configuradar para usar
    el cortafuegos, en vez del router, como su ruta por defecto.<br>
<br>

    - pasarela "Proxy-ARP": la configuraci&oacute;n anterior implica la divisi&oacute;n de la
    red en dos subredes, con lo que se pierde la mitad de las direcciones IP
    disponibles, desperdici&aacute;ndose un bit. Como ejemplo, en una subred con 16
    direcciones (con una subm&aacute;scara de 28 bits), s&oacute;lo 14 estar&aacute;n disponibles, ya
    que dos direcciones son para la red y el broadcast. A&ntilde;adiendo 1 bit
    a la m&aacute;scara de subred, bajamos de 14 a 6 direcciones disponibles (8 IPs menos
    las direcciones de red y broadcast). Cuando no se puede perder
    la mitad de las IPs disponibles se utiliza esta t&eacute;cnica, que est&aacute;
    explicada un poco despu&eacute;s en este art&iacute;culo. Adem&aacute;s, esta t&eacute;cnica no
    requiere ning&uacute;n cambio en la configuraci&oacute;n de red de las m&aacute;quinas
    existentes, ni del router, ni de las computadoras protegidas.<br>
<br>

    - puente Ethernet (<i>Ethernet bridge</i>): instalando una pasarela
    Ethernet (no una pasarela IP) se consigue un mecanismo de filtrado
    invisible desde otras m&aacute;quinas. Esta configuraci&oacute;n se puede llevar a cabo
    sin asignar direcciones IP a las interfaces Ethernet. La m&aacute;quina se convierte
    en indetectable mediante ping, traceroute, etc. Tengamos en cuenta
    que una implementaci&oacute;n de filtrado por paquetes
	requiere un n&uacute;cleo 2.2.x, ya que esta caracter&iacute;stica todav&iacute;a no est&aacute;
    implementada en los n&uacute;cleos 2.4.x</p>

    <A NAME="289lfindex1">&nbsp;</A>
<H2>Reglas b&aacute;sicas de filtrado</H2>


    <p>Ahora que sabemos d&oacute;nde instalar nuestro filtro, debemos definir
    que tendr&aacute; que bloquear o qu&eacute; aceptar.<br>
    Existen dos formas de configurar el filtro:<br>
<br>

    - La buena: no se permite pasar a ning&uacute;n paquete, a no ser que lo autorice
    expl&iacute;citamente alguna regla.<br>

    - La mala: (desgraciadamente, usada a menudo) los paquetes expl&iacute;citamente
    prohibidos se paran, todos los dem&aacute;s se aceptan.<br>
<br>

    Es sencillo explicarlo: en el primer caso, olvidar una regla lleva a que
    un servicio no funcione apropiadamente o no funcione en absoluto.<br>
    En el segundo caso, olvidar una regla crea una vulnerabilidad
    potencial que puede ser dif&iacute;cil de encontrar... si la encontramos.</p>


    <A NAME="289lfindex2">&nbsp;</A>
<H2>Netfilter</H2>


    <p>La aplicaci&oacute;n de filtrado m&aacute;s utilizada con Linux 2.4 es
    Netfilter; reemplaza con creces a &iacute;pchains', utilizada con los n&uacute;cleos
    Linux 2.2. Netfilter tiene dos partes: un componente del
    n&uacute;cleo que debe compilarse en el n&uacute;cleo y el comando
    <tt>&iacute;ptables'</tt> que ya deber&iacute;a estar disponible en su sistema.</p>

    <A NAME="289lfindex3">&nbsp;</A>
<H2>Ejemplo de configuraci&oacute;n</H2>


    <p>Un ejemplo comentado es mejor que un gran discurso, describiremos
    c&oacute;mo instalar y configurar un mecanismo de filtrado. Primero, la
    m&aacute;quina se configurar&aacute; como una pasarela mediante Proxy-ARP para limitar
    el n&uacute;mero de direcciones IP y seguidamente configuraremos el
    sistema de filtrado.</p>

    <p>El autor prefiere la distribuci&oacute;n Debian para este tipo de instalaci&oacute;n,
    pero cualquier otra distribuci&oacute;n servir&aacute;.</p>

    <p>Primero, compruebe que su n&uacute;cleo soporta Netfilter. Si esto es as&iacute;,
    deber&aacute; aparecer lo siguiente en los mensajes de arranque:</p>

    <p><tt>ip_conntrack (4095 buckets, 32760 max)</tt><br>
    <tt>ip_tables: (c)2000 Netfilter core team</tt></p>

    <p>En otro caso, tendr&aacute; que recompilar el n&uacute;cleo despu&eacute;s de haber
    activado el componente Netfilter. Las correspondientes opciones
    se encuentran en el submen&uacute; <tt>"Network Packet Filtering (Filtrado
    de Paquetes de Red)"</tt>
    del men&uacute; <tt>"Networking Options (Opciones de Red)"</tt>. Elija las opciones que
    necesite de la secci&oacute;n <tt>"Netfilter  Configuration (Configuraci&oacute;n de
    Netfilter)"</tt>. Si duda, puede elegir todas. Adem&aacute;s es mejor
    incluir Netfilter en el n&uacute;cleo y no usar m&oacute;dulos. Si por una raz&oacute;n
    u otra los m&oacute;dulos de Netfilter desaparecen o no se cargan el filtrado
    podr&iacute;a no funcionar y mejor no hablamos de los peligros que esto
    conllevar&iacute;a.</p>

    <p>Tambi&eacute;n deber&iacute;a instalar el paquete &iacute;proute2' (esto &uacute;ltimo no es
    obligatorio pero nuestro ejemplo lo utilizar&aacute;, ya que nos permite
    simplificar el script de configuraci&oacute;n). Con Debian, es suficiente con
    escribir el comando &aacute;pt-get install iproute'.<br>
    Con otras distribuciones, obtenga el paquete correspondiente de la
    forma habitual o bien puede instalarlo a partir del c&oacute;digo fuente que
    puede obtener en la siguiente direcci&oacute;n:<br>
    <tt><a href=
    "ftp://ftp.inr.ac.ru/ip-routing/">ftp://ftp.inr.ac.ru/ip-routing/</a></tt></p>

    <p>Ahora hay que configurar las dos tarjetas Ethernet. Tengamos
    en cuenta que el n&uacute;cleo de Linux cuando autodetecta el hardware detiene
    la b&uacute;squeda de tarjetas de red tan pronto como encuentra una. Por
    tanto, s&oacute;lo se detectar&aacute; la primera.<br>
    Una sencilla soluci&oacute;n a este problema es a&ntilde;adir la siguiente l&iacute;nea
    al fichero <tt>lilo.conf</tt>:
    <tt>append="ether=0,0,eth1"</tt></p>

    <p>Despu&eacute;s tendremos que configurar las interfaces Ethernet. El m&eacute;todo
    que elegiremos nos permitir&aacute; utilizar la misma direcci&oacute;n IP para ambas
    tarjetas, con lo que ahorraremos una direcci&oacute;n.<br>

     Asumamos que tenemos la subred <tt>10.1.2.96/28</tt>, que incluye
     las direcciones de la 10.1.2.96 a la 10.1.2.111. El router tendr&aacute; la
     direcci&oacute;n 10.1.2.97 y nuestra m&aacute;quina de filtrado la 10.1.2.98. La
     interfaz <tt>eth0</tt> se conectar&aacute; al router a trav&eacute;s de un
     cable cruzado RJ45 si ambas tarjetas se conectan directamente
     sin utilizar un hub o un switch; la interfaz <tt>eth1</tt> se conectar&aacute;
     al hub/switch y desde aqu&iacute; a las m&aacute;quinas de la red local.</p>

    <p>As&iacute; pues, ambas interfaces se configurar&aacute;n con los siguientes
    par&aacute;metros:</p>

<pre>
address  : 10.1.2.98
netmask  : 255.255.255.240
network  : 10.1.2.96
broadcast: 10.1.2.111
gateway  : 10.1.2.97
</pre>

    <p>A continuaci&oacute;n utilizaremos el siguiente script que deberemos ejecutar
    tras la configuraci&oacute;n inicial de las tarjetas de red.<br>
    </p>
<pre class="code">
net.vars: Variables de configuraci&oacute;n

PREFIX=10.1.2
DMZ_ADDR=$PREFIX.96/28
# Definiciones de la Interfaz
BAD_IFACE=eth0
DMZ_IFACE=eth1
ROUTER=$PREFIX.97


net-config.sh: script de configuraci&oacute;n de red

#!/bin/sh
# Descomentar la siguiente l&iacute;nea para visualizar los comandos tras su ejecuci&oacute;n
# set -x
# Se leen las variables definidas en el fichero anterior
source /etc/init.d/net.vars
# Se borran las rutas actuales de la red local
ip route del $PREFIX.96/28 dev $BAD_IFACE
ip route del $PREFIX.96/28 dev $DMZ_IFACE
# Se define que la red local es accesible a trav&eacute;s de eth1
# y el router a trav&eacute;s de eth0.
ip route add $ROUTER dev $BAD_IFACE
ip route add $PREFIX.96/28 dev $DMZ_IFACE
# Se activa Proxy-ARP para las dos interfaces
echo 1 &gt; /proc/sys/net/ipv4/conf/eth0/proxy_arp
echo 1 &gt; /proc/sys/net/ipv4/conf/eth1/proxy_arp
# Activamos "IP forwarding" para permitir a los paquetes que llegan a una tarjeta
# enrutarse hacia la otra
echo 1 &gt; /proc/sys/net/ipv4/ip_forward

</pre>

    <p>Volvamos al mecanismo Proxy-ARP requerido para nuestra
    configuraci&oacute;n.<br>
    Cuando un m&aacute;quina habla con otra en la misma red, necesita conocer
    la direcci&oacute;n Ethernet (o direcci&oacute;n MAC o direcci&oacute;n hardware) correspondiente
    a su direcci&oacute;n IP. Entonces la m&aacute;quina origen difunde (<i>"hace un broadcast"</i>)
    la pregunta "&iquest;cu&aacute;l es la direcci&oacute;n MAC de la interfaz cuya direcci&oacute;n IP es
    1.2.3.4?", y la m&aacute;quina destino debe responder.</p>

    <p>Aqu&iacute; tenemos un ejemplo de dicha "charla" vista usando tcpdump:<br>
    - la petici&oacute;n: la m&aacute;quina 172.16.6.72 pregunta la direcci&oacute;n MAC
    correspondiente a la direcci&oacute;n IP 172.16.6.10.<br>
    <tt>19:46:15.702516 arp who-has 172.16.6.10 tell
    172.16.6.72</tt><br>
    - la respuesta: la m&aacute;quina 172.16.6.10 da su n&uacute;mero de tarjeta.<br>
    <tt>19:46:15.702747 arp reply 172.16.6.10 is-at
    0:a0:4b:7:43:71</tt></p>

    <p>Esto nos conduce al final de esta peque&ntilde;a explicaci&oacute;n: las
    peticiones ARP se hacen mediante difusi&oacute;n, por lo que est&aacute;n limitadas
    a una &uacute;nica red f&iacute;sica. As&iacute; pues la petici&oacute;n de una m&aacute;quina protegida
    para encontrar la direcci&oacute;n MAC del router deber&iacute;a ser bloqueada
    por la m&aacute;quina de filtrado. Activando la caracter&iacute;stica Proxy-ARP
    solventaremos este problema pidiendo expl&iacute;citamente que las peticiones
    y respuestas ARP que lleguen por una tarjeta se propaguen hacia la otra, y viceversa.
    </p>

    <p>En este punto, deber&iacute;a tener una red trabajando con una
    m&aacute;quina controlando todo el tr&aacute;fico entre la red local y el exterior.
    </p>

    <p>Ahora, debemos configurar el filtrado mediante Netfilter.
    <br>
    Netfilter permite actuar directamente en el flujo de paquetes.
    En la configuraci&oacute;n b&aacute;sica los paquetes son controlados por
    tres cadenas de reglas:<br>
    - INPUT: para los paquetes que llegan a trav&eacute;s de una interfaz,<br>
    - FORWARD: para todos los paquetes transmitidos desde una interfaz
    hacia la otra,<br>
    - OUTPUT: para los paquetes que salen de una interfaz.
    </p>

    <p>El comando &iacute;ptables' permite a&ntilde;adir, cambiar o borrar reglas
    en cada una de estas cadenas para modificar el entorno de filtrado.<br>
    M&aacute;s a&uacute;n, cada cadena tiene una pol&iacute;tica por defecto, esto es, sabe
    qu&eacute; hacer cuando ninguna regla en la cadena afecta a un paquete.<br>
<br>
    Las cuatro opciones m&aacute;s comunes son:<br>
    - ACCEPT: el paquete puede pasar,<br>
    - REJECT: el paquete es rechazado y se env&iacute;a el paquete de
    error asociado (ICMP Port Unreachable, TCP RESET, seg&uacute;n el caso),<br>
    - LOG: escribe una notificaci&oacute;n de paquete en syslog,<br>
    - DROP: el paquete es ignorado y no se env&iacute;a ninguna respuesta.<br>
    <br>
    </p>

    <center>
      <b>Flujo de paquetes en las cadenas est&aacute;ndar</b>
    </center>
    <br>

    <center>
      <img src="../../common/images/article289/packet-filter2.png"
      alt="Flujo de paquetes" height="311" width="723">
    </center>

    <p>Aqu&iacute; est&aacute;n las principales opciones de iptables que nos permiten
	manipular cadenas enteras. Las explicaremos con detalle m&aacute;s tarde:</p>


    <p>-N: crea una nueva cadena.<br>
    -X: borra una cadena vac&iacute;a.<br>
    -P: cambia la pol&iacute;tica por defecto de una cadena.<br>
    -L: lista las reglas en una cadena.<br>
    -F: elimina todas las reglas en una cadena.<br>
    -Z: pone a cero los contadores de bytes y paquetes
	que han pasado por la cadena.</p>

    <p>Para modificar una cadena se dispone de los siguientes comandos:<br>
    -A: a&ntilde;ade una regla al final de una cadena.<br>
    -I: inserta una nueva regla en una posici&oacute;n dada en una cadena.<br>
    -R: reemplaza una cadena dada en una cadena<br>
    -D: borra una regla en una cadena, bien usando su n&uacute;mero
	o bien describiendo la regla.</p>

    <p>Veamos un peque&ntilde;o ejemplo pr&aacute;ctico: bloquearemos las respuestas
	PING (es decir el tipo &eacute;cho-reply' de los paquetes ICMP) que lleguen
	desde una m&aacute;quina dada.<br>
	Primero, veamos que podemos hacer PING a la m&aacute;quina dada:</p>
<pre class="code">
# ping -c 1 172.16.6.74
PING 172.16.6.74 (172.16.6.74): 56 data bytes
64 bytes from 172.16.6.74: icmp_seq=0 ttl=255 time=0.6 ms

--- 172.16.6.74 ping statistics ---

1 packets transmitted, 1 packets received, 0% packet loss
round-trip min/avg/max = 0.6/0.6/0.6 ms
</pre>
	Ahora, a&ntilde;adimos una regla en la cadena INPUT que interceptar&aacute;
	los paquetes que vengan  de la m&aacute;quina 172.16.6.74 ('-s 172.16.6.74')
	del tipo ICMP-Reply ('-p icmp --icmp-type
echo-reply'). Estos paquetes se ignorar&aacute;n ('-j DROP').
<pre class="code">
# iptables -A INPUT -s 172.16.6.74 -p icmp --icmp-type echo-reply -j DROP
</pre>

    <p>Hagamos de nuevo ping a la m&aacute;quina:</p>
<pre class="code">
# ping -c 3 172.16.6.74
PING 172.16.6.74 (172.16.6.74): 56 data bytes

--- 172.16.6.74 ping statistics ---

3 packets transmitted, 0 packets received, 100% packet loss
</pre>

    <p>Como se esperaba, la respuesta no pasa. Podemos comprobar
	que se han bloqueado las tres respuestas (3 paquetes, para un total de 252 bytes):</p>
<pre class="code">
# iptables -L INPUT -v
Chain INPUT (policy ACCEPT 604K packets, 482M bytes)
 pkts bytes target     prot opt in    out     source       destination
  3   252   DROP       icmp --  any   any     172.16.6.74    anywhere
</pre>

    <p>Para volver a la situaci&oacute;n inicial, s&oacute;lo tenemos que borrar
	la primerar regla de la cadena INPUT:</p>

    <p><tt># iptables -D INPUT 1</tt></p>

    <p>Y el PING deber&iacute;a funcionar de nuevo:</p>
<pre class="code">
# ping -c 1 172.16.6.74
PING 172.16.6.74 (172.16.6.74): 56 data bytes
64 bytes from 172.16.6.74: icmp_seq=0 ttl=255 time=0.6 ms

--- 172.16.6.74 ping statistics ---

1 packets transmitted, 1 packets received, 0% packet loss
round-trip min/avg/max = 0.6/0.6/0.6 ms
#
</pre>

    <p>&iexcl;Funciona!</p>

    <p>Puede a&ntilde;adir otras cadenas a las 3 predefinidas (que nunca
	podr&aacute; eliminar) y hacer que cierto tr&aacute;fico vaya por ellas.
	Esto puede ser &uacute;til, por ejemplo, para impedir reglas
	duplicadas en varias cadenas.</p>

    <p>Pasemos a configurar las reglas necesarias para un cortafuegos
	m&iacute;nimo. Permitir&aacute; ssh, DNS, http y smtp y nada m&aacute;s.<br>
	Para simplificar, los comandos de configuraci&oacute;n se han escrito
	en un script. El script comienza borrando la configuraci&oacute;n actual
	antes de establecer una nueva. Este peque&ntilde;o truco permite ejecutar
	el script cuando la configuraci&oacute;n est&aacute; activa sin el riesgo de
	duplicar reglas.<br>
    <br>
    </p>
<pre class="code">
<b>rc.firewall</b>

#!/bin/sh

# Borrando las reglas
iptables -F
iptables -F INPUT
iptables -F OUTPUT
iptables -F FORWARD


# La cadena se construye seg&uacute;n la direcci&oacute;n.
# bad = eth0 (exterior)
# dmz = eth1 (interior)
iptables -X bad-dmz
iptables -N bad-dmz
iptables -X dmz-bad
iptables -N dmz-bad
iptables -X icmp-acc
iptables -N icmp-acc
iptables -X log-and-drop
iptables -N log-and-drop

# Cadena espec&iacute;fica utilizada para registrar los paquetes antes de bloquearlos
iptables -A log-and-drop -j LOG --log-prefix "drop "
iptables -A log-and-drop -j DROP

# Los paquetes con el indicador TCP activados se eliminan
# y lo mismo para los que no tienen ning&uacute;n indicador (a menudo usado por Nmap)
iptables -A FORWARD -p tcp --tcp-flags ALL ALL -j log-and-drop
iptables -A FORWARD -p tcp --tcp-flags ALL NONE -j log-and-drop

# Los paquetes de clases de direcciones reservadas se eliminan
# y lo mismo para multicast
iptables -A FORWARD -i eth+ -s 224.0.0.0/4 -j log-and-drop
iptables -A FORWARD -i eth+ -s 192.168.0.0/16 -j log-and-drop
iptables -A FORWARD -i eth+ -s 172.16.0.0/12 -j log-and-drop
iptables -A FORWARD -i eth+ -s 10.0.0.0/8 -j log-and-drop

# Los paquetes 	que pertenezcan a una conexi&oacute;n ya establecida se aceptan
iptables -A FORWARD -m state --state INVALID -j log-and-drop
iptables -A FORWARD -m state --state RELATED,ESTABLISHED -j ACCEPT
# La cadena se transmite seg&uacute;n el correspondiente paquete de origen
iptables -A FORWARD -s $DMZ_ADDR -i $DMZ_IFACE -o $BAD_IFACE -j dmz-bad
iptables -A FORWARD -o $DMZ_IFACE -j bad-dmz
# El resto se ignora
iptables -A FORWARD -j log-and-drop

# ICMPs aceptados
iptables -A icmp-acc -p icmp --icmp-type destination-unreachable -j ACCEPT
iptables -A icmp-acc -p icmp --icmp-type source-quench -j ACCEPT
iptables -A icmp-acc -p icmp --icmp-type time-exceeded -j ACCEPT
iptables -A icmp-acc -p icmp --icmp-type echo-request -j ACCEPT
iptables -A icmp-acc -p icmp --icmp-type echo-reply -j ACCEPT
iptables -A icmp-acc -j log-and-drop

# Cadena exterior -&gt; interior
# se aceptan correo, DNS, http(s) y SSH
iptables -A bad-dmz -p tcp --dport smtp -j ACCEPT
iptables -A bad-dmz -p udp --dport domain -j ACCEPT
iptables -A bad-dmz -p tcp --dport domain -j ACCEPT
iptables -A bad-dmz -p tcp --dport www -j ACCEPT
iptables -A bad-dmz -p tcp --dport https -j ACCEPT
iptables -A bad-dmz -p tcp --dport ssh -j ACCEPT
iptables -A bad-dmz -p icmp -j icmp-acc
iptables -A bad-dmz -j log-and-drop

# Cadena interior -&gt; exterior
# se aceptan correo, DNS, http(s) y telnet
iptables -A dmz-bad -p tcp --dport smtp -j ACCEPT
iptables -A dmz-bad -p tcp --sport smtp -j ACCEPT
iptables -A dmz-bad -p udp --dport domain -j ACCEPT
iptables -A dmz-bad -p tcp --dport domain -j ACCEPT
iptables -A dmz-bad -p tcp --dport www -j ACCEPT
iptables -A dmz-bad -p tcp --dport https -j ACCEPT
iptables -A dmz-bad -p tcp --dport telnet -j ACCEPT
iptables -A dmz-bad -p icmp -j icmp-acc
iptables -A dmz-bad -j log-and-drop

# Cadenas para la propia m&aacute;quina
iptables -N bad-if
iptables -N dmz-if
iptables -A INPUT -i $BAD_IFACE -j bad-if
iptables -A INPUT -i $DMZ_IFACE -j dmz-if

# Interfaz externa
# s&oacute;lo se acepta SSH en esta m&aacute;quina
iptables -A bad-if -p icmp -j icmp-acc
iptables -A bad-if -p tcp --dport ssh -j ACCEPT
iptables -A bad-if -p tcp --sport ssh -j ACCEPT
ipchains -A bad-if -j log-and-drop

# Interfaz interna
iptables -A dmz-if -p icmp -j icmp-acc
iptables -A dmz-if -j ACCEPT

</pre>

    <p>Unas pocas palabras sobre la calidad de servicio. Linux
	puede modificar el campo ToS ("Tipo de Servicio") y cambiar
	su valor para dar al paquete una prioridad distinta. Por ejemplo,
	el siguiente comando cambia los paquetes SSH salientes para mejorar
	la respuesta de las conexiones.</p>

    <p><tt>iptables -A OUTPUT -t mangle -p tcp --dport ssh -j TOS
    --set-tos Minimize-Delay</tt></p>

    <p>De la misma forma, para las conexines FTP puede usar la opci&oacute;n
    <tt>'--set-tos Maximize-Throughput'</tt> para mejorar la tasa
	de transferencia en detrimento de la interactividad de la sesi&oacute;n.
	</p>

    <p>Ya est&aacute;. Ahora conoce lo b&aacute;sico para configurar un sistema
	eficiente de filtrado de paquetes. Sin embargo, tenga en cuenta
	que un cortafuegos no es la panacea en lo que a seguridad se
	refiere. S&oacute;lo es una preocupaci&oacute;n m&aacute;s. Configurar un cortafuegos
	no le exime de utilizar contrase&ntilde;as fuertes, actualizar el sistema
	con los &uacute;ltimos parches de seguridad, utilizar un sistema de detecci&oacute;n
	de intrusos, etc.<br>
    <br>
    </p>

    <A NAME="289lfindex4">&nbsp;</A>
<H2>Referencias</H2>


    <ul>
      <li>Proxy-ARP Mini-HOWTO: <a href=
      "http://www.linuxdoc.org/HOWTO/mini/Proxy-ARP-Subnet/index.html">
      http://www.linuxdoc.org/HOWTO/mini/Proxy-ARP-Subnet/index.html</a></li>

      <li>Netfilter: <a href=
      "http://netfilter.samba.org/">http://netfilter.samba.org/</a></li>
    </ul>
  


<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=289"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Vincent Renardias, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">fr --&gt; -- : Vincent Renardias <small>&lt;vincent(at)renardias.com&gt;</small></font></td></tr>
  <tr><td><font size="2">fr --&gt; en: Georges Tarbouriech &lt;gt(at)linuxfocus.org&gt;</font></td></tr>
  <tr><td><font size="2">en --&gt; es: Roberto Hernando (<a href="http://www.rhernando.ya.st"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2003-05-14, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
