<HTML>
<HEAD>
<TITLE>fuente_ISO-COMO: Adaptando terminfo</TITLE>
</HEAD>
<BODY>
<A HREF="Fuente-ISO-Como-2.html">Anterior</A>
<A HREF="Fuente-ISO-Como-4.html">Siguiente</A>
<A HREF="Fuente-ISO-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Adaptando <CODE>terminfo</CODE></A></H2>


<P>La definici&oacute;n para la terminal de Linux que trae <CODE>ncurses</CODE> est&aacute; pensada para
usar los c&oacute;digos de la <CODE>cp437</CODE>. Esto provocar&aacute; que al cambiar de fuente
veamos letras en vez de los s&iacute;mbolos gr&aacute;ficos. Afortunadamente esto no es
dif&iacute;cil de solucionar cambiando la definici&oacute;n de terminal en
<CODE>/usr/lib/terminfo/l/linux</CODE>.</P>
<P><B>NOTA</B>: si tu distribuci&oacute;n de Linux es antigua, es posible que la
definici&oacute;n de terminal est&eacute; en <CODE>/usr/lib/terminfo/c/console</CODE>. Teclea</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ echo $TERM
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>para saber cu&aacute;l te corresponde.</P>
<P>Primeramente deberemos extraer el fichero binario en forma de texto
editable:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# infocmp &gt; linux.original.tic
# cp linux.original.tic linux.tic
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><B>NOTA</B>: si tu distribuci&oacute;n de Linux es antigua, es posible que el
equivalente a <CODE>infocmp</CODE> se llame <CODE>untic</CODE>.</P>
<P><B>NOTA2</B>: aseg&uacute;rate de estar en la consola normal (modo texto). Si
est&aacute;s en un xterm, ser&aacute; &eacute;sta la informaci&oacute;n que se vuelque al fichero.</P>
<P>Guarda el fichero <CODE>linux.original.tic</CODE> por si es necesario volver a
restaurar la definici&oacute;n original, y edita los cambios sobre <CODE>linux.tic</CODE>.
&Eacute;stos son los siguientes:</P>
<P>
<UL>
<LI>Busca las siguientes entradas y b&oacute;rralas:
<UL>
<LI><CODE>smacs</CODE></LI>
<LI><CODE>rmacs</CODE></LI>
<LI><CODE>acsc</CODE></LI>
</UL>

<B>IMPORTANTE</B>: Las entradas est&aacute;n delimitadas por comas y puede haber
varias en una misma l&iacute;nea. Ten cuidado en borrar <B>s&oacute;lo</B> las entradas que
se mencionan arriba.</LI>
<LI>A&ntilde;ade las siguientes l&iacute;neas:

<BLOCKQUOTE><CODE>
<PRE>
        smacs=\E(K,
        acsc=l\206m\203k\214j\211u\215t\207v\213w\216q\212x\205,
        rmacs=\E)K,
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Graba los cambios y sal del editor.</LI>
</UL>
</P>
<P>Ya puedes proceder a compilar:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# tic linux.tic
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Tras lo cual ya deber&iacute;a estar listo el sistema.</P>

<H2><A NAME="ss3.1">3.1 Probando si funciona</A></H2>


<P>Seguramente tendr&aacute;s el Midnight Commander. Ejec&uacute;talo para ver si los cambios
han tenido efecto.</P>
<P><I>¡Pero si sale hecho un cristo!</I></P>
<P>Calma, calma. Pulsa <CODE>F9</CODE> y entra en el men&uacute; <I>Options</I>. Selecciona
<I>Display bits</I> y elige la opci&oacute;n <I>Full 8 bits</I>. Aseg&uacute;rate de pasar por
el <I>Ok</I> o darle con el rat&oacute;n. ¿Mejor ahora? Vuelve a entrar en el men&uacute; y
graba los cambios con <I>Save setup</I>.</P>
<P>En caso de que est&eacute;s leyendo esto con <CODE>lynx</CODE>, debes saber que en las fuentes
de este navegador viene una p&aacute;gina que te ser&aacute; muy &uacute;til para ver los
cambios que has realizado. Dicha p&aacute;gina se llama <CODE>iso8859-1.html</CODE>, y si est&aacute;s
leyendo esto conectado puedes verla en
<CODE>
<A HREF="http://www.uni-passau.de/~ramsch/iso8859-1.html">http://www.uni-passau.de/~ramsch/iso8859-1.html</A></CODE></P>


<H2><A NAME="ss3.2">3.2 Nota sobre <CODE>slang</CODE></A></H2>


<P>Las versiones de <CODE>slang</CODE> anteriores a la <CODE>0.99-32</CODE> no determinan cu&aacute;les 
son los caracteres gr&aacute;ficos leyendo <CODE>terminfo</CODE>, sino que usan unos 
predeterminados (si la terminal es linux). Si tu versi&oacute;n de esta librer&iacute;a es 
anterior, puedes actualizarte cogiendo la &uacute;ltima versi&oacute;n de
<CODE>
<A HREF="ftp://space.mit.edu/pub/davis/slang">ftp://space.mit.edu/pub/davis/slang</A></CODE>.</P>
<P>Algunos programas que usan <CODE>slang</CODE> son <CODE>slrn</CODE>, <CODE>jed</CODE> y <CODE>lynx</CODE> 
(si se compila con esta opci&oacute;n).</P>


<H2><A NAME="ss3.3">3.3 Nota sobre <CODE>reset</CODE></A></H2>


<P>Algo que no s&eacute; c&oacute;mo evitar es que al ejecutar <CODE>reset</CODE> los carateres
vuelvan a ser ``remapeados'' como si la fuente fuese la <CODE>cp437</CODE>. El
&uacute;nico apa&ntilde;o que se me ocurre es incluir esta l&iacute;nea en <CODE>/etc/profile</CODE>
o en el <CODE>.profile</CODE> del usuario:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
alias reset='reset ; echo -ne &quot;\033(K&quot;'
</PRE>
</CODE></BLOCKQUOTE>
</P>


<HR>
<A HREF="Fuente-ISO-Como-2.html">Anterior</A>
<A HREF="Fuente-ISO-Como-4.html">Siguiente</A>
<A HREF="Fuente-ISO-Como.html#toc3">Indice</A>
</BODY>
</HTML>
