<HTML>
<HEAD>
<TITLE>Kernel-Como: C&oacute;mo configurar el n&uacute;cleo. </TITLE>
</HEAD>
<BODY>
<A HREF="Kernel-Como-2.html">Anterior</A>
<A HREF="Kernel-Como-4.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. C&oacute;mo configurar el n&uacute;cleo. </A></H2>



<H2><A NAME="ss3.1">3.1 Obtenci&oacute;n de los fuentes. </A></H2>


<P>Se pueden obtener las fuentes por FTP an&oacute;nimo de <CODE>
<A HREF="ftp://ftp.funet.fi/pub/OS/Linux/PEOPLE/Linus/">ftp://ftp.funet.fi/pub/OS/Linux/PEOPLE/Linus/</A></CODE>, en un
``<I>mirror</I>''
<SL>En Espa&ntilde;a contamos con el veloz y magn&iacute;fico
<CODE>
<A HREF="ftp://sunsite.rediris.es">ftp://sunsite.rediris.es</A></CODE></SL>
 o en otros servidores. 
T&iacute;picamente tienen el nombre <CODE>linux-x.y.z.tar.gz</CODE>, donde
<CODE>x.y.z</CODE> es el n&uacute;mero de versi&oacute;n. Las versiones se encuentran en
directorios <CODE>v1.1</CODE>, <CODE>v1.2</CODE> y <CODE>v1.3</CODE>
<SL>Y
<CODE>2.0</CODE> y <CODE>2.1</CODE></SL>
. El n&uacute;mero mayor es el de la &uacute;ltima
versi&oacute;n, en este caso versi&oacute;n de desarrollo. Le sugerimos que utilice un
servidor ``<I>mirror</I>'' de <CODE>ftp.funet.fi</CODE>, por ejemplo: </P>
<P>
<UL>
<LI>EE.UU.:
<CODE>
<A HREF="ftp://tsx-11.mit.edu/pub/linux/sources/system">ftp://tsx-11.mit.edu/pub/linux/sources/system</A></CODE>
</LI>
<LI>EE.UU.:
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/kernel">ftp://sunsite.unc.edu/pub/Linux/kernel</A></CODE>
</LI>
<LI>Inglaterra:
<CODE>
<A HREF="ftp://sunsite.doc.ic.ac.uk/pub/unix/Linux/sunsite.unc-mirror/kernel/">ftp://sunsite.doc.ic.ac.uk/pub/unix/Linux/sunsite.unc-mirror/kernel/</A></CODE>
</LI>
<LI>Austria: 
<CODE>
<A HREF="ftp://fvkma.tu-graz.ac.at/pub/linux/linus">ftp://fvkma.tu-graz.ac.at/pub/linux/linus</A></CODE>
</LI>
<LI>Alemania:
<CODE>
<A HREF="ftp://ftp.Germany.EU.net/pub/os/Linux/Local.EUnet/Kernel/Linus">ftp://ftp.Germany.EU.net/pub/os/Linux/Local.EUnet/Kernel/Linus</A></CODE>
</LI>
<LI>Alemania:
<CODE>
<A HREF="ftp://ftp.dfv.rwth-aachen.de/pub/linux/kernel">ftp://ftp.dfv.rwth-aachen.de/pub/linux/kernel</A></CODE>
</LI>
<LI>Francia: 
<CODE>
<A HREF="ftp://ftp.ibp.fr/pub/linux/sources/system/patches">ftp://ftp.ibp.fr/pub/linux/sources/system/patches</A></CODE>
</LI>
<LI>Australia: 
<CODE>
<A HREF="ftp://kirk.bond.edu.au/pub/OS/Linux/kernel">tp://kirk.bond.edu.au/pub/OS/Linux/kernel</A></CODE>
</LI>
<LI>Espa&ntilde;a:
<CODE>
<A HREF="ftp://sunsite.rediris.es/pub/linux/kernel/sources">ftp://sunsite.rediris.es/pub/linux/kernel/sources</A></CODE>
</LI>
</UL>
</P>
<P>Si no tiene acceso <CODE>FTP</CODE>, encontrar&aacute; una lista de <I>BBS</I> con lo mismo
en el grupo <CODE>comp.os.linux.announce</CODE> de USENET News.</P>


<H2><A NAME="ss3.2">3.2 Descompresi&oacute;n de los fuentes </A></H2>


<P>Entre en la cuenta <CODE>root</CODE> y vaya al directorio <CODE>/usr/src</CODE>. 
Si instal&oacute; las fuentes cuando instal&oacute; Linux, habr&aacute; aqu&iacute; un directorio
<CODE>linux</CODE>, con las fuentes antiguas. Si quiere preservar esas fuentes
(y tiene espacio de sobra), renombre (con <CODE>mv</CODE>) ese directorio a
<CODE>linux-x.y.z</CODE> (la versi&oacute;n actual <CODE>x.y.z</CODE> la puede obtener con el
comando <CODE>uname -r</CODE>).  Es importante que antes de descomprimir las
nuevas fuentes no haya ning&uacute;n directorio <CODE>/usr/src/linux</CODE>. </P>
<P>Ahora, en <CODE>/usr/src</CODE>, descomprima las fuentes con</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
tar xvfzp linux-x.y.z.tar.gz 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(si s&oacute;lo tiene un fichero <CODE>.tar</CODE>, sin <CODE>.gz</CODE>, elimine la <CODE>z</CODE> del
comando <CODE>tar</CODE>). Los contenidos del fichero se expandir&aacute;n en
<CODE>/usr/src/linux</CODE>. Vaya ahora a ese directorio y lea el fichero
<CODE>README</CODE>. Encontrar&aacute; una secci&oacute;n ``<I>INSTALLING the kernel</I>''. Siga
las instrucciones que all&iacute; se digan (aunque en las siguientes l&iacute;neas le
diremos c&oacute;mo tiene que hacer casi todo esto).</P>


<H2><A NAME="ss3.3">3.3 Configuraci&oacute;n del n&uacute;cleo </A></H2>


<P>Nota: Este texto es parcialmente una repetici&oacute;n de lo que hay en el
fichero <CODE>README</CODE> de las fuentes. </P>


<P>El comando </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
make config 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>invocado en el directorio <CODE>/usr/src/linux</CODE> inicia un programa
<I>shell-script</I> de configuraci&oacute;n que le preguntar&aacute; bastantes cosas.
Requiere que est&eacute; instalado <CODE>bash</CODE>, con lo que debe existir
<CODE>/bin/bash</CODE>, <CODE>/bin/sh</CODE> o la variable <CODE>$BASH</CODE>. </P>

<H3>Anexo de la revisi&oacute;n 2.1.</H3>


<P>Si los fuentes que posee son superiores al <CODE>2.0.x</CODE>, existen dos
m&eacute;todos bastante m&aacute;s agradables e interactivos de llevar a cabo la
configuraci&oacute;n; invocando desde modo texto, en el mismo directorio
mencionado anteriormente</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
make menuconfig
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Iniciar&aacute; un colorido programa (escrito con <CODE>lxdialog</CODE>) muy agradable y
bastante m&aacute;s funcional que el <CODE>make config</CODE> a secas, para llevar a cabo
la configuraci&oacute;n del kernel. </P>
<P>Observar&aacute; que su uso es bastante intuitivo; las opciones con un <CODE>&lt;
&gt;</CODE> indican la posibilidad de modularizar; si en ella presionamos <CODE>M</CODE>
la seleccionaremos como m&oacute;dulo. Si presionamos <CODE>ESPACIO</CODE> aparecer&aacute; un
<CODE>*</CODE> indicando que ser&aacute; incluido en el kernel. Finalmente, si
presionamos <CODE>N</CODE> lo deseleccionaremos. </P>
<P>Las opciones marcadas con <CODE>[ ]</CODE> no son modularizables.</P>
<P>Si Vd. es un <I>fan</I> de las X, entonces puede arrancar desde un
<CODE>xterm</CODE> el <CODE>script</CODE> equivalente, ejecutando</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
make xconfig
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Aparecer&aacute; ante sus ojos un maravilloso y gr&aacute;fico programa de selecci&oacute;n y
configuraci&oacute;n del kernel bajo <I>X Window</I> <CODE>;-)</CODE>. </P>
<P>Aqu&iacute; seguro que sabr&aacute; manejarse a golpe de rat&oacute;n sin problema alguno; las
opciones modularizables tendr&aacute;n tres casillas posibles a rellenar: <CODE>y</CODE>
indica que se incluir&aacute; en la parte monol&iacute;tica del kernel; <CODE>m</CODE> que lo
har&aacute; como m&oacute;dulo, y <CODE>n</CODE> que no ser&aacute; seleccionado. </P>


<H2><A NAME="ss3.4">3.4 Continuaci&oacute;n</A></H2>


<P>Ahora 
<SL>Lo que sigue est&aacute; dirigido a los usuarios
(<I>¿masoquistas?</I> del <CODE>make config</CODE>, si emplea <CODE>make menuconfig</CODE> o
<CODE>make xconfig</CODE> encontrar&aacute; mucho m&aacute;s intuitiva la configuraci&oacute;n, si bien
debe leer a continuaci&oacute;n qu&eacute; significan las opciones.</SL>
se trata
de contestar las preguntas, normalmente con s&iacute; (`<CODE>y</CODE>')  o no
(`<CODE>n</CODE>'). Los manejadores de dispositivos incorporan, adem&aacute;s, la
opci&oacute;n de m&oacute;dulo (`<CODE>m</CODE>'), opci&oacute;n interesante puesto que no
incorpora el manejador al n&uacute;cleo en tiempo de compilaci&oacute;n, sino que se
hace durante la ejecuci&oacute;n del mismo, cuando sea necesario (por ejemplo,
cargar el m&oacute;dulo <I>PPP</I> solo cuando vayamos a usar el m&oacute;dem).</P>
<P>Algunas otras opciones obvias o poco importantes no son descritas aqu&iacute;.
Vea la secci&oacute;n 
<A HREF="#otras">otras</A> para descripciones de otras muchas.</P>
<P>Adem&aacute;s, cuando configure el n&uacute;cleo 2.0.x, podr&aacute; poner la opci&oacute;n `<CODE>?</CODE>',
lo que le dar&aacute; una breve descripci&oacute;n de la misma. </P>

<H3>Emulaci&oacute;n de coprocesador (<CODE>Kernel math emulation</CODE>) </H3>


<P>Si no tiene coprocesador matem&aacute;tico (o un 486), debe contestar `<CODE>y</CODE>' a
esto.  Si tiene coprocesador y contesta `<CODE>y</CODE>' la emulaci&oacute;n ser&aacute;
instalada pero no usada; funcionar&aacute;, pero le ocupar&aacute; memoria
innecesariamente. Adem&aacute;s, he o&iacute;do que la emulaci&oacute;n es lenta, lo que se
traducir&aacute; en unas pesadas <I>X-Window</I>. </P>

<H3>Soporte de discos IDE y MFM/RLL normales (<CODE>Normal (MFM/RLL) diskand IDE disk/cdrom support</CODE>)</H3>


<P>Normalmente necesitar&aacute; este soporte, pues es el de los discos habituales
en los PCs. Este manejador no gestiona discos <I>SCSI</I>, para eso est&aacute; la
opci&oacute;n espec&iacute;fica que luego veremos. </P>
<P>Ahora se le preguntar&aacute; si quiere usar ``<CODE>old disk-only</CODE>'' y manejadores
``<CODE>new IDE</CODE>''. Tiene que elegir uno de ellos. La diferencia principal
es que el nuevo (<CODE>new IDE</CODE>) maneja controladoras secundarias y CD-ROMs
<I>IDE/ATAPI</I>, hasta cuatro dispositivos, pero ocupa 4 KB m&aacute;s que el
antiguo. Se supone que los nuevos manejadores mejoran tambi&eacute;n velocidad y
fiabilidad, en especial si dispone de dispositivos <I>EIDE</I>. </P>

<H3>Soporte de redes (<CODE>Networking support</CODE>) </H3>


<P>En principio, contestar&iacute;a afirmativamente si la m&aacute;quina estuviera en una
red local o conectada a la Internet con <CODE>SLIP/PPP</CODE>. Sin embargo,
muchos programas, como ocurre con el sistema X Window, requieren el
soporte de red, as&iacute; que lo mejor es contestar `<CODE>y</CODE>' siempre. Despu&eacute;s se
le preguntar&aacute; si quiere soporte <CODE>TCP/IP</CODE>: conteste afirmativamente
aun no estando seguro.</P>

<H3>Limitar memoria a 16 Mb (<CODE>Limit memory to low 16MB</CODE>)</H3>


<P>Hay controladores de DMA en 386 con problemas para direccionar m&aacute;s de 16
MB de RAM. Contestar `<CODE>y</CODE>' en el caso (raro) de que tenga uno de &eacute;stos. </P>

<H3>Comunicaci&oacute;n entre procesos <I>System V</I> (<CODE>System V IPC</CODE>) </H3>


<P>Una de las mejores definiciones del IPC est&aacute; en el glosario del libro del
Perl. Curiosamente, los programadores de Perl suelen usar IPC para
comunicar sus procesos, as&iacute; como muchas otras aplicaciones (como
<CODE>DOOM</CODE>, sobre todo), por lo que no es buena idea contestar `<CODE>n</CODE>' si
no se est&aacute; seguro de lo que hace.</P>

<H3>Tipo de CPU (386, 486, Pentium, PPro) (<CODE>Processor type (386,486, Pentium, PPro</CODE>) )</H3>


<P>Nota: En anteriores n&uacute;cleos, la opci&oacute;n era "Usar el par&aacute;metro <CODE>-m486</CODE>
en el compilador" (<CODE>Use -m486 flag for 486-specific optimizations</CODE>) </P>
<P>Tradicionalmente, esto era una optimizaci&oacute;n compatible con todos los
chips, aunque m&aacute;s r&aacute;pido en la CPU elegida (y en todo caso, ocupaba algo
m&aacute;s). Actualmente, esto puede no ser cierto, con lo que deber&aacute; elegir
siempre la CPU que tenga (aunque la versi&oacute;n de 386 funcionar&aacute; en todas las
m&aacute;quinas). </P>

<H3>Soporte SCSI (<CODE>SCSI support</CODE>) </H3>


<P>Si tiene dispositivos SCSI, conteste `<CODE>y</CODE>'. Se le preguntar&aacute;n entonces
m&aacute;s cosas: soporte de CD-ROM, discos y qu&eacute; clase de adaptador utiliza. Vea
el documento <I>SCSI-HOWTO</I> para m&aacute;s detalle.</P>

<H3>Soportes de tarjetas de red (<CODE>Network device support</CODE>)</H3>


<P>Si tiene tarjeta de red, o quiere usar <CODE>PPP</CODE>, <CODE>SLIP</CODE> o <CODE>PLIP</CODE>
(puerto paralelo usado para conectarse a Internet), conteste
afirmativamente. El script le preguntar&aacute; ahora qu&eacute; tarjeta tiene y qu&eacute;
protocolo usar. </P>

<H3>Sistemas de ficheros (<CODE>Filesystems</CODE>) </H3>


<P>El programa le preguntar&aacute; si quiere soporte para los siguientes
sistemas de ficheros:</P>
<P><CODE>Standard (minix)</CODE> - Las nuevas distribuciones no crean sistemas Minix,
y mucha gente no las usa para nada, pero puede convenir elegirla. Algunos
``<I>discos de rescate</I>'' usan el sistema Minix como formato de sus
disquetes, ya que da menos problemas.</P>
<P><CODE>Extended fs</CODE> - Fue la primera versi&oacute;n del sistema extendido, pero ya
no se usa. No necesita seleccionarla.</P>
<P><CODE>Second extended</CODE> - Este es el sistema m&aacute;s usado. Seguramente lo usar&aacute;
Vd. tambi&eacute;n. Seleccione `<CODE>y</CODE>'.
<SL>Ojo con seleccionarlo como
m&oacute;dulo;  aunque se puede, el sistema de ficheros en el que est&eacute; su
partici&oacute;n <CODE>/</CODE> debe estar incluido el el kernel
<I>no-modularmente</I>, ya que de lo contrario no podr&aacute; arrancar.</SL>
</P>
<P><CODE>xiafs filesystem</CODE> - Hace mucho pudo ser usado, pero ahora mismo no
conocemos a nadie que lo utilice.</P>
<P><CODE>msdos</CODE> - Selecci&oacute;nelo si quiere acceder desde Linux a sus particiones
de MS-DOS o quiere montar disquetes de ese sistema.</P>
<P><CODE>umsdos</CODE> - Este sistema permite a&ntilde;adir a un sistema MS-DOS las
caracter&iacute;sticas t&iacute;picas de Unix como nombres largos o enlaces. Sirve para
quienes quieran instalar Linux en la partici&oacute;n DOS, pero nada m&aacute;s. </P>
<P><CODE>/proc</CODE> - Uno de los grandes inventos desde la leche condensada. 
(una idea robada descaradamente a <I>Bell Labs</I>, si no me equivoco) No se
trata de algo que se guarde en el disco, sino de una interfaz por medio de
ficheros con la tabla de procesos del n&uacute;cleo, usada por programas como
`<CODE>ps</CODE>'. Pruebe a teclear `<CODE>cat /proc/meminfo</CODE>' o `<CODE>cat
/proc/devices</CODE>'. Algunos shells (<CODE>rc</CODE>, concretamente) hacen uso de
<CODE>/proc/self/fd</CODE> (en lugar de <CODE>/dev/fd</CODE>) para E/S. Debe
contestar afirmativamente a la pregunta: muchas utilidades de Linux lo
necesitan. </P>
<P><CODE>NFS</CODE> - Si su m&aacute;quina est&aacute; en red y quiere acceder a sistemas de
ficheros remotos con NFS, conteste `<CODE>y</CODE>' a esta pregunta.</P>
<P><CODE>ISO9660</CODE> - T&iacute;pico en los CD-ROMs. Si tiene un CD-ROM,
seleccione esta opci&oacute;n.</P>
<P><CODE>OS/2 HPFS</CODE> - En el momento de escribir esto, el soporte HPFS es de
s&oacute;lo lectura.
<SL>Y por lo que se ``oye'', as&iacute; se quedar&aacute;...</SL>
</P>
<P><CODE>System V and Coherent</CODE> - para particiones de sistemas Coherent y
System V (otras variantes de Unix para PC).</P>
<P><B>Adiciones desde la edici&oacute;n del</B> <I>Howto</I> <B>original (Rev. 2.1)</B>:</P>
<P><CODE>quota support</CODE> - Selecci&oacute;nelo si quiere administrar el espacio que
consumen en disco los usuarios del sistema; necesitar&aacute; adem&aacute;s las
utilidades <CODE>quotas-1.55</CODE>, disponibles en: </P>
<P><CODE>
<A HREF="ftp://ftp.funet.fi/pub/Linux/kernel/src/subsystems/quota/all.tar.gz">ftp://ftp.funet.fi/pub/Linux/kernel/src/subsystems/quota/all.tar.gz</A></CODE></P>
<P>Tenga en cuenta que este tipo de control restrictivo s&oacute;lo funcionar&aacute; sobre 
sistemas de ficheros <CODE>ext2</CODE>.</P>
<P><CODE>mandatory lock support</CODE>: Cambia el algoritmo para proporcionar un
sistema de bloqueos m&aacute;s seguro, a fin de evitar la corrupci&oacute;n de ficheros
por parte de las aplicaciones en los accesos a disco simult&aacute;neo. Esto
puede interesar probable y &uacute;nicamente cuando se usen grandes bases de
datos o dedique su sistema Linux a servidor de ficheros. Tenga en cuenta
que deber&aacute; tener servidores (<CODE>samba</CODE>, <CODE>mars-nwe</CODE>, etc...) que
soporten esta nueva caracter&iacute;stica.</P>
<P><CODE>vfat</CODE>. En conjunci&oacute;n con el sistema de fichero <CODE>fat</CODE> o <CODE>msdos</CODE>
nos permitir&aacute; acceso a las particiones de w95, con soporte de nombres
``largos'' y dem&aacute;s. En el momento de escribir esto, se desconoce si
soportar&aacute; la ``nueva'' <I>fat32</I> del reci&eacute;n aparecido w95-<I>OSR2</I>. </P>
<P><CODE>SMB filesystem support</CODE>: En conjunci&oacute;n con el paquete
<CODE>samba</CODE>
<SL> Cuyo COMO est&aacute; disponible en castellano, mire en la
secci&oacute;n 
<A HREF="Kernel-Como-14.html#Grupos">Grupos</A> para m&aacute;s informaci&oacute;n.</SL>
 nos permitir&aacute;
montar vol&uacute;menes compartidos por clientes de red <I>NetBios</I>. </P>
<P><CODE>SMB w95 bug workaround</CODE> - <CODE>:-)</CODE> qu&eacute; decir... corrije un bug que
experimentan los vol&uacute;menes exportados por servidores w95. </P>
<P><CODE>Amiga FFS support</CODE> - Soporte para el sistema de ficheros <I>Fast File
System</I> de <I>Amiga</I>. </P>
<P><CODE>UFS filesystem support</CODE> - Soporte para el <I>Unix FileSystem</I>,
empleado por algunos *nixes BSD, como <I>SunOS, FreeBSD, NetBSD,
NeXTstep</I>.  Permite montar dichas particiones o disquetes en modo de
s&oacute;lo lectura. </P>
<P>Esta opci&oacute;n contiene otras dos opciones adicionales relacionadas con las
tablas de partici&oacute;n de los discos seg&uacute;n provengan de uno u otro *nix.
Escoja el men&uacute; en l&iacute;nea <CODE>help</CODE> para mayor informaci&oacute;n. </P>
<P><CODE>NCP filesystem support</CODE> - Permite montar vol&uacute;menes <I>NetWare</I>. 
Necesitar&aacute; programas cliente para llevarlo a cabo, no obstante. </P>
<P><CODE>root filesystem on NFS</CODE> - necesario para estaciones de trabajo sin
disco duro, que arranquen por red y monten todo su sistema de ficheros por
<I>NFS</I>.</P>
<P><CODE>BOOTP support</CODE> - Si su caso es el anterior, y arranca por red, este
protocolo le permitir&aacute; obtener su <CODE>IP</CODE> din&aacute;micamente, usando el
protocolo <CODE>BOOTP</CODE>. (Siempre que su tarjeta de red incorpore una
<I>ROM</I> que lo permita). </P>
<P><CODE>RARP support</CODE> - Idem de lo anterior, en este caso usando el protocolo 
<I>RARP</I>.</P>
<P><CODE>Sys V and Coherent filesystem support</CODE> permitir&aacute; montar particiones de
otros *nixes System V, como <I>SCO Unix</I>, <I>Xenix</I> y <I>Coherent</I>. Lea
la ayuda asociada. </P>
<P>Actualmente, hay un m&oacute;dulo <I>no oficial</I> que permite acceso a sistemas
de ficheros <I>NTFS</I>, usados por wNT, su autor es Martin von L&ouml;wis,
<CODE>
<A HREF="mailto:loewis@informatik.hu-berlin.de">loewis@informatik.hu-berlin.de</A></CODE>. Su nivel de soporte es
ciertamente rudimentario todav&iacute;a, pero siempre es bueno saberlo... </P>
<P>m&aacute;s informaci&oacute;n en <CODE>
<A HREF="http://www.informatik.hu-berlin.de:80/~loewis/ntfs">http://www.informatik.hu-berlin.de:80/~loewis/ntfs</A></CODE></P>


<H3>¡Pero no s&eacute; qu&eacute; sistemas de ficheros necesito!</H3>


<P>De acuerdo, teclee `<CODE>mount</CODE>'. La salida ser&aacute; como esta:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 blah# mount
 /dev/hda1 on / type ext2 (defaults)
 /dev/hda3 on /usr type ext2 (defaults)
 none on /proc type proc (defaults)
 /dev/fd0 on /mnt type msdos (defaults)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Observe cada l&iacute;nea; la palabra que sigue a `<CODE>type</CODE>' es el tipo de
sistema usado. En este ejemplo, los sistemas ra&iacute;z (<CODE>/</CODE>) y
<CODE>/usr</CODE> usan el sistema ``<I>second extended</I>'', adem&aacute;s usamos
sistema ``<I>proc</I>'' y hay montado un disquete MS-DOS. </P>
<P>Para saber qu&eacute; sistemas de ficheros usa en el n&uacute;cleo actual puede teclear
`<CODE>cat /proc/filesystems</CODE>' siempre y cuando tenga al menos soporte
<CODE>proc</CODE>. </P>
<P>Otros sistemas de ficheros m&aacute;s raramente usados ocupan tambi&eacute;n mucho. 
Quiz&aacute;s le interese meterlos como m&oacute;dulos (vea la correspondiente secci&oacute;n,
y vea tambi&eacute;n la secci&oacute;n 
<A HREF="Kernel-Como-7.html#lentos">lentos</A> para saber por qu&eacute; no se
recomiendan n&uacute;cleos que ocupen mucho).</P>

<H3>Manejadores de tipo car&aacute;cter (<CODE>Character devices</CODE>)</H3>


<P>Aqu&iacute; se activan los manejadores para impresoras (por puerto paralelo),
ratones de bus, ratones <I>PS/2</I> (usado tambi&eacute;n en muchos
<I>trackballs</I> de los port&aacute;tiles), algunos manejadores de cintas y otros.
Conteste seg&uacute;n su hardware.</P>
<P>Nota: ``<I>Selection</I>'' es un programa que le permite usar el rat&oacute;n para
cortar y pegar texto entre consolas virtuales, fuera de las X-Window.
Actualmente no es una opci&oacute;n de configuraci&oacute;n, sino un est&aacute;ndar. </P>
<P>Nota 2: `Selection' est&aacute; bastante obsoleto. Es mucho mejor el programa
``<CODE>gpm</CODE>''
<SL><I>General Purpose Mouse support</I>, <I>Soporte
Gen&eacute;rico para Ratones</I></SL>
 puesto que hace cosas como manejar
diversos protocolos de ratones, etc.</P>

<H3>Tarjeta de sonido (<CODE>Sound card</CODE>) </H3>


<P>Si siente gran necesidad de o&iacute;r el ladrido del `<CODE>biff</CODE>', conteste
`<CODE>y</CODE>' y despu&eacute;s otro programa de configuraci&oacute;n le preguntar&aacute; acerca de
la tarjeta de sonido que tiene. Una observaci&oacute;n: cuando le pregunte si
quiere instalar la versi&oacute;n completa del manejador, conteste `<CODE>n</CODE>' y
ahorrar&aacute; memoria, aunque tendr&aacute; que elegir qu&eacute; caracter&iacute;sticas desea
incluir. Le recomiendo aqu&iacute; que lea el
<I>Sonido-Como</I>
<SL>Disponible en castellano, obviamente</SL>

donde encontrar&aacute; mucha m&aacute;s informaci&oacute;n. </P>

<H3><A NAME="otras"></A> Otras opciones de configuraci&oacute;n </H3>


<P>No todas las opciones se han listado ya que cambian mucho y otras son
completamente evidentes (por ejemplo, el soporte <CODE>3Com 3C509</CODE>). Hay una
lista m&aacute;s extensa en el siguiente <I>URL</I> de Axel Boldt, <CODE>
<A HREF="mailto:axel@uni-paderborn.de">axel@uni-paderborn.de</A></CODE>: </P>
<P><CODE>
<A HREF="http://math-www.uni-paderborn.de/~axel/config_help.html">http://math-www.uni-paderborn.de/~axel/config_help.html</A></CODE></P>
<P>o por <I>FTP</I> an&oacute;nimo en:</P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/kernel/config/krnl_cnfg_hlp.x.yz.tgz">ftp://sunsite.unc.edu/pub/Linux/kernel/config/krnl_cnfg_hlp.x.yz.tgz</A></CODE></P>
<P>donde <CODE>x.yz</CODE> se refiere a la versi&oacute;n del n&uacute;cleo.  En las &uacute;ltimas
versiones (<CODE>2.0.x</CODE>) se incluyen estos documentos entre los ficheros de
las fuentes del n&uacute;cleo (directorio <CODE>Documentation/</CODE>...).</P>

<H3><CODE>Kernel hacking</CODE> </H3>


<P>Traducci&oacute;n del fichero <CODE>README</CODE> de Linus:</P>
<P>La configuraci&oacute;n ``<CODE>kernel hacking</CODE>'' suele dar lugar a un n&uacute;cleo m&aacute;s
grande y/o lento, y puede hacerlo menos estable al configurar algunas
rutinas especiales para encontrar errores del n&uacute;cleo (<CODE>kmalloc()</CODE>).
Para un n&uacute;cleo de ``<I>producci&oacute;n</I>'' deber&aacute; contestar `<CODE>n</CODE>' a la
pregunta. </P>


<H2><A NAME="ss3.5">3.5 ¿Y ahora qu&eacute;? (El fichero <CODE>Makefile</CODE>). </A></H2>


<P>Tras hacer <CODE>make config</CODE>, un mensaje le dir&aacute; que ya est&aacute; preparado
el n&uacute;cleo y que ``revise el fichero <CODE>Makefile</CODE> para opciones
adicionales'', etc.</P>
<P>Por tanto, veamos el <CODE>Makefile</CODE>. Probablemente no tendr&aacute; que
cambiar nada, pero debe mirarse. Sus opciones podr&aacute;n cambiarse con el
comando `<CODE>rdev</CODE>' una vez que el n&uacute;cleo est&eacute; compilado.</P>


<HR>
<A HREF="Kernel-Como-2.html">Anterior</A>
<A HREF="Kernel-Como-4.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc3">Indice</A>
</BODY>
</HTML>
