<HTML>
<HEAD>
<TITLE>Kernel-Como: Consejos y trucos </TITLE>
</HEAD>
<BODY>
<A HREF="Kernel-Como-10.html">Anterior</A>
<A HREF="Kernel-Como-12.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc11">Indice</A>
<HR>
<H2><A NAME="trucos"></A> <A NAME="s11">11. Consejos y trucos </A></H2>



<H2><A NAME="ss11.1">11.1 Redirecci&oacute;n de la salida de compilaci&oacute;n o parcheado. </A></H2>


<P>Si le interesa tener ``<I>logs</I>'' de lo que hagan los comandos
`<CODE>make</CODE>' o `<CODE>patch</CODE>', puede hacerlo redirigiendo su salida a un
fichero. Primero, debe saber qu&eacute; shell est&aacute; utilizando (con el comando
`<CODE>grep root /etc/passwd</CODE>' puede saberlo, buscando en el resultado
algo as&iacute; como `<CODE>/bin/csh</CODE>' o `<CODE>/bin/sh</CODE>'). Una vez
localizado, si utiliza <CODE>sh</CODE> o <CODE>bash</CODE>, puede redirigir la salida de
un comando como `<CODE>make</CODE>' con: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
(comando) 2&gt;&1 | tee (fich)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La l&iacute;nea anterior pondr&aacute; la salida de `<CODE>(comando)</CODE>' en el fichero
`<CODE>(fich)</CODE>'.</P>
<P>Si se trata de <CODE>csh</CODE> o <CODE>tcsh</CODE>, teclee,</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 (comando) |& tee (fich)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para <CODE>rc</CODE> (shell que raramente usar&aacute;) se teclear&iacute;a,</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 (comando) &gt;[2=1] | tee (fich)
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss11.2">11.2 Instalaci&oacute;n condicional del n&uacute;cleo </A></H2>


<P>Hay m&aacute;s m&eacute;todos para probar un nuevo n&uacute;cleo que no sea usar un disquete. A
diferencia de otros Unix, <CODE>LILO</CODE> puede arrancar cualquier fichero con
el n&uacute;cleo que se encuentre en el disco
<SL>As&iacute; como montar
particiones de disco distintas seg&uacute;n se le indique, con lo cual podemos
tener varias instalaciones distintas y poder arrancar con una y otra,
incluso compartiendo alguna de ellas.</SL>
 (siempre y cuando &eacute;ste
est&eacute; por debajo de los 1024 cilindros, lea la documentaci&oacute;n de <CODE>LILO</CODE>
para m&aacute;s detalle).  Puede tener al final de <CODE>/etc/lilo.conf</CODE> una
l&iacute;nea parecida a &eacute;sta:</P>
<P>
<PRE>
 image = /usr/src/linux/arch/i386/zImage
 label = nuevo_nucleo
</PRE>
</P>
<P>lo que le permitir&aacute; seleccionar en el arranque (habiendo ejecutado antes
lilo para reconfigurar) el <I>nuevo_nucleo</I> en lugar del habitual que
ser&aacute; probablemente <CODE>/vmlinuz</CODE>. Para poder hacer esta selecci&oacute;n hay
que mantener pulsada la tecla SHIFT al arrancar, para que aparezca el
<I>prompt</I> de <CODE>LILO</CODE> que le permita teclear la etiqueta
(nuevo_nucleo u otra)  del n&uacute;cleo elegido.</P>
<P>Si desea tener varios fuentes de n&uacute;cleos distintos en el disco (¡cuidado!,
le puede suponer muchos <I>megas</I>), lo normal es tener cada versi&oacute;n
<CODE>x.y.z</CODE> en el directorio <CODE>/usr/src/linux-x.y.z</CODE> y
``seleccionar'' o activar cada n&uacute;cleo sin m&aacute;s que redefinir el enlace
simb&oacute;lico <CODE>/usr/src/linux</CODE> apuntando al directorio que desee (por
ejemplo, yo hice `<CODE>ln -sf /usr/src/linux-1.2.3 /usr/src/linux</CODE>' en
su momento).  Aseg&uacute;rese que <CODE>/usr/src/linux</CODE> no es ya un
directorio, sino como mucho antiguos enlaces simb&oacute;licos. De otro modo, el
resultado del anterior comando no ser&aacute; el esperado. </P>


<H2><A NAME="ss11.3">11.3 Actualizaciones del n&uacute;cleo </A></H2>


<P>Russell Nelson, <CODE>
<A HREF="mailto:nelson@crynwr.com">nelson@crynwr.com</A></CODE> lleva una lista que resume los cambios en
las nuevas versiones del n&uacute;cleo. Son breves pero interesantes antes de
decidirse por instalar una nueva versi&oacute;n. Se puede encontrar por FTP
an&oacute;nimo en <CODE>
<A HREF="ftp://ftp.emlist.com/pub/kchanges">ftp://ftp.emlist.com/pub/kchanges</A></CODE> o a trav&eacute;s del URL: </P>
<P><CODE>
<A HREF="http://www.crynwr.com/kchanges">http://www.crynwr.com/kchanges</A></CODE></P>


<HR>
<A HREF="Kernel-Como-10.html">Anterior</A>
<A HREF="Kernel-Como-12.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc11">Indice</A>
</BODY>
</HTML>
