<HTML>
<HEAD>
<TITLE>Kernel-Como: Introducci&oacute;n </TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Kernel-Como-2.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n </A></H2>


<P>Esta es la versi&oacute;n 0.75 del documento ``<I>Kernel-HOWTO</I>'' original. La
de la traducci&oacute;n es la 2.1 ¿Debe Vd. leer este documento? Bien, veamos si
tiene alguno de los siguientes s&iacute;ntomas:</P>
<P>
<UL>
<LI> ``¡Jo! El <CODE>dosemu-0.99.9</CODE> requiere el n&uacute;cleo <CODE>1.8.193</CODE> y yo
estoy a&uacute;n con el <CODE>1.2.3</CODE>''
</LI>
<LI> Hay un manejador (<I>driver</I>) que s&oacute;lo est&aacute; en los n&uacute;cleos m&aacute;s
recientes y Vd. lo necesita.
</LI>
<LI> Vd. realmente no tiene ni idea de c&oacute;mo se compila el n&uacute;cleo.
</LI>
<LI> Vd. lo ha intentado pero no le ha funcionado.
</LI>
</UL>
</P>

<H2><A NAME="ss1.1">1.1 ¡Lea esto primero! </A></H2>


<P>Algunos de los ejemplos aqu&iacute; puestos suponen que se tiene el <CODE>tar</CODE>
de <I>GNU</I>, as&iacute; como <CODE>find</CODE> y <CODE>xargs</CODE>. Son casi est&aacute;ndares,
pero por si acaso... Tambi&eacute;n se asume que conoce la organizaci&oacute;n del
sistema de ficheros; si no lo conoce, copie la salida del comando
<CODE>mount</CODE> en condiciones normales (o el fichero <CODE>/etc/fstab</CODE>
si puede acceder a &eacute;l). Esta informaci&oacute;n es importante, y no cambiar&aacute; a
menos que reparticione el disco, a&ntilde;ada uno nuevo, reinstale el sistema o
similar. </P>
<P>La &uacute;ltima versi&oacute;n de <I>producci&oacute;n</I> del n&uacute;cleo que se conoce ahora mismo
es la <CODE>2.0.10</CODE>
<SL><CODE>2.0.27</CODE> es la &uacute;ltima versi&oacute;n estable al d&iacute;a
de hoy, 22 de Diciembre de 1996.</SL>
, de manera que nuestros
ejemplos ir&aacute;n para esa versi&oacute;n. </P>
<P>Se intenta que tampoco dependa mucho de esto, pero si Vd. usa una versi&oacute;n
distinta habr&aacute; siempre algunas diferencias, ya que el n&uacute;cleo est&aacute; en
continuo desarrollo. Esto no debe crear problemas, si acaso un ligero
despiste al principio. </P>
<P>Hay dos versiones de las fuentes del n&uacute;cleo de Linux: las de
<I>producci&oacute;n</I> y las de <I>desarrollo</I>. Las versiones de <I>producci&oacute;n</I>
empezaron a numerarse en la <CODE>1.0.x</CODE> y siempre se nombran con n&uacute;mero
par.  As&iacute;, se pas&oacute; de las <CODE>1.0.x</CODE> a las <CODE>1.2.x</CODE> y de &eacute;sta a la
<CODE>2.0.x</CODE> (por no ir a la <CODE>1.4.x</CODE> <CODE>;)</CODE> ). </P>
<P>Estas versiones se consideran <I>estables</I> y <I>libres de errores</I>
(hasta el momento). Las versiones de <I>desarrollo</I> se numeran en impar
(<CODE>1.1.x, 1.3.x, 2.1.x</CODE>...) y son de prueba, con lo que posiblemente
tengan muchos fallos.</P>


<H2><A NAME="ss1.2">1.2 Sobre el estilo</A></H2>


<P><CODE>El texto con el aspecto de esta frase</CODE> se corresponder&aacute; con las
cosas que deban aparecer en la pantalla, un fichero o algo que pueda ser
tecleado como opciones de comandos (si est&aacute; utilizando la versi&oacute;n ASCII de
este documento, no ver&aacute; diferencia alguna). Los comandos son
entrecomillados (con ` ') lo que causa un problema con la puntuaci&oacute;n:  al
acabar frases con un comando, el estilo americano pone el punto dentro de
las comillas, lo que confundir&aacute; a alg&uacute;n lector creyendo que hay que
teclear tambi&eacute;n el punto (algo de sentido com&uacute;n, aunque en realidad
pretenden que el ``<I>sentido com&uacute;n</I>'' sea solo el estilo americano de
puntuaci&oacute;n). Esto se soluciona no poniendo tal punto, aunque no sea
correcto ortogr&aacute;ficamente. Por ejemplo, pondremos `<CODE>make config</CODE>' y
no `<CODE>make config</CODE>.'</P>


<HR>
Anterior
<A HREF="Kernel-Como-2.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc1">Indice</A>
</BODY>
</HTML>
