<HTML>
<HEAD>
<TITLE>Kernel-Como: Preguntas y respuestas importantes </TITLE>
</HEAD>
<BODY>
<A HREF="Kernel-Como-1.html">Anterior</A>
<A HREF="Kernel-Como-3.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Preguntas y respuestas importantes </A></H2>



<H2><A NAME="ss2.1">2.1 Pero, ¿qu&eacute; hace el n&uacute;cleo? </A></H2>


<P>El n&uacute;cleo de <I>Unix</I> act&uacute;a como intermediario entre sus programas y el
ordenador. En primer lugar, gestiona la memoria de todos los programas o
procesos, y se asegura de que se reparten los ciclos del procesador. 
Adem&aacute;s, proporciona una interfaz portable para que los programas
<CODE>hablen</CODE> f&aacute;cilmente con su hardware. </P>
<P>Realmente, el n&uacute;cleo hace m&aacute;s cosas, pero las anteriores son las m&aacute;s
importantes.</P>


<H2><A NAME="ss2.2">2.2 ¿Por qu&eacute; puedo necesitar actualizar el n&uacute;cleo? </A></H2>


<P>Los n&uacute;cleos nuevos normalmente ofrecen la posibilidad de entenderse con
m&aacute;s accesorios hardware (o sea, incluyen m&aacute;s manejadores), se ejecutan m&aacute;s
r&aacute;pidamente, son m&aacute;s estables o corrigen errores de otras versiones. Mucha
gente se actualiza el n&uacute;cleo para poder usar nuevos manejadores que
necesitan o librarse de ``<I>bugs</I>'' de la versi&oacute;n que usaban. </P>


<H2><A NAME="ss2.3">2.3 ¿Qu&eacute; hardware nuevo soportan los nuevos n&uacute;cleos? </A></H2>


<P>V&eacute;anse el documento <I>Hardware-HOWTO</I>, el fichero <CODE>config.in</CODE> de
las fuentes o simplemente ver&aacute; lo que hay cuando haga <CODE>`make
config'</CODE>.  Esto le mostrar&aacute; lo soportado por la distribuci&oacute;n est&aacute;ndar,
pero no todo, pues algunos son m&oacute;dulos cargables en ejecuci&oacute;n (como
manejadores de PCMCIA) y se mantienen y distribuyen por v&iacute;as distintas. </P>

<H3>Anexo de la revisi&oacute;n. </H3>


<P>Actualmente, muy pocos m&oacute;dulos (los <I>no-oficiales</I>) no est&aacute;n incluidos
en los fuentes <I>oficiales</I> del kernel. Pr&aacute;cticamente, todos los
controladores son <I>modularizables</I>. </P>
<P>He aqu&iacute; un extracto de lo que aparece en
<CODE>/usr/src/linux/Documentation/modules.txt</CODE>, algo que se <B>debe</B>
leer:
<SL>Hoy mismo se liberar&aacute; una traducci&oacute;n.  </SL>
: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        La mayoria de los sistemas de ficheros: 
                
        minix, xiafs, msdos, umsdos, sysv, isofs, hpfs, smbfs, nfs.

         Soporte SCSI de medio nivel (requeridos por controladores SCSI de
         alto y bajo nivel)             
        
        La mayoria de los controladores SCSI de bajo nivel: (i.e. aha1542, in2000)
        Todos los controladores SCSI de alto nivel: disk, tape, cdrom, generic.

        La mayoria de los controladores ethernet: (demasiados para enumerarlos todos, ver:
                     /usr/src/linux/Documentation/networking/net-modules.txt)

        La mayoria de los controladores de CDROM (propietarios):
                aztcd:     Aztech,Orchid,Okano,Wearnes
                cm206:     Philips/LMS CM206
                gscd:      Goldstar GCDR-420
                mcd, mcdx: Mitsumi LU005, FX001
                optcd:     Optics Storage Dolphin 8000AT
                sjcd:      Sanyo CDR-H94A
                sbpcd:     Matsushita/Panasonic CR52x, CR56x, CD200,
                           Longshine LCS-7260, TEAC CD-55A
                sonycd535: Sony CDU-531/535, CDU-510/515

        Y un monton de modulos, como:
                lp: impresora p. paralelo
                binfmt_elf: cargador elf 
                binfmt_java: cargador java 
                isp16: interfaz cdrom 
                serial: interfaz serial (tty) 
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss2.4">2.4 ¿Qu&eacute; versi&oacute;n de <CODE>gcc</CODE> y <CODE>libc</CODE> necesito? </A></H2>


<P>Linus recomienda una en el fichero <CODE>README</CODE> de las fuentes del n&uacute;cleo.
Si no la tiene, probablemente tenga que actualizarse las librer&iacute;as
<CODE>libc</CODE>, algo que tampoco es dif&iacute;cil. </P>


<H2><A NAME="ss2.5">2.5 ¿Qu&eacute; es un m&oacute;dulo cargable? </A></H2>


<P>Hay partes del c&oacute;digo del n&uacute;cleo que no se enlazan directamente en el
n&uacute;cleo. Se compilan por separado y luego se incorporan al n&uacute;cleo que ya
est&aacute; corriendo. Es la forma preferida de usar algunos manejadores como los
de dispositivos <CODE>PCMCIA</CODE> o de cintas <CODE>QIC-80/40</CODE>
<SL> Hoy
en d&iacute;a la tendencia es modulizar todos los controladores posibles, salvo
aquellos estrictamente necesarios para arrancar (<CODE>ext2</CODE>, <CODE>ide</CODE>, o
<CODE>SCSI</CODE>, seg&uacute;n el caso), aunque siempre se puede hacer una imagen
<CODE>initrd</CODE> y se sigue pudiendo arrancar con <CODE>LILO</CODE>. <CODE>kerneld</CODE> se
encargar&aacute; de cargarlos y descargarlos por nosotros cuando el sistema los
necesite o no.  </SL>
. </P>


<H2><A NAME="ss2.6">2.6 ¿Cu&aacute;nto espacio en disco necesito? </A></H2>


<P>Depende de su configuraci&oacute;n. La versi&oacute;n <CODE>2.0.10</CODE> del n&uacute;cleo ocupa,
comprimida, 6 <I>megabytes</I>, pero al descomprimir ocupar&aacute; unos 24 MB. 
Pero aqu&iacute; no acaba la cosa: para compilar se necesita espacio para
ficheros temporales, dependiendo de la configuraci&oacute;n que se elija. Por
ejemplo, en un 386, con manejador de red de <I>3Com</I> y cinco sistemas de
ficheros supone 30 MB. Si a esto a&ntilde;adimos las fuentes comprimidas, ser&aacute;n
36 MB. En otro sistema con menos cosas puede ocupar menos. Adem&aacute;s, un
n&uacute;cleo nuevo tendr&aacute; por lo general muchos m&aacute;s ficheros que el antiguo, con
lo que debe asegurarse de que hay espacio de disco suficiente (adem&aacute;s, con
los precios que tienen ahora los discos, me puedo permitir el recomendarle
que se compre un disco nuevo para el Linux). </P>


<H2><A NAME="ss2.7">2.7 ¿Cu&aacute;nto se tarda en compilar? </A></H2>


<P>Para mucha gente, se tarda ``<I>much&iacute;simo</I>''. La velocidad del sistema y
la cantidad de memoria son determinantes. En un <I>486DX4/100</I> con 16
MB, se tarda unos 20 minutos en compilar el n&uacute;cleo v1.2 con cinco sistemas
de ficheros, soporte de red y manejadores de tarjetas de sonido. En un
<I>386DX/40</I> con 8 MB de RAM se tarda una hora y media. Por lo
general se recomienda prepararse un caf&eacute; o ver la televisi&oacute;n (o lo que se
le ocurra
<SL>O ponerse a hacer cualquier cosa; para eso estamos en
multitarea <CODE>:-)</CODE> </SL>
)  mientras se compila el n&uacute;cleo. Otra
posibilidad es compilarlo en un PC m&aacute;s r&aacute;pido que el suyo, de alg&uacute;n amigo. </P>


<HR>
<A HREF="Kernel-Como-1.html">Anterior</A>
<A HREF="Kernel-Como-3.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc2">Indice</A>
</BODY>
</HTML>
