<HTML>
<HEAD>
<TITLE>Kernel-Como: Otras opciones de configuraci&oacute;n. </TITLE>
</HEAD>
<BODY>
<A HREF="Kernel-Como-9.html">Anterior</A>
<A HREF="Kernel-Como-11.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc10">Indice</A>
<HR>
<H2><A NAME="s10">10. Otras opciones de configuraci&oacute;n. </A></H2>


<P>Esta secci&oacute;n contiene informaci&oacute;n sobre otras opciones de configuraci&oacute;n
que se ofrecen durante `<CODE>make config</CODE>'.</P>

<H2><A NAME="ss10.1">10.1 Opciones generales </A></H2>


<P><CODE>Normal floppy disk support</CODE> (soporte de floppy normal): es
exactamente eso. Lea el fichero <CODE>drivers/block/README.fd</CODE>, es
importante para usuarios de <I>IBM Thinkpad</I>.</P>
<P><CODE>XT harddisk support</CODE> (soporte de disco duro de XT): interesante si
quiere usar una controladora XT de 8 bits. </P>
<P><CODE>PCI bios support</CODE>(soporte de Bios PCI): si tiene PCI, puede
interesarle. Vaya con cuidado: algunas placas PCI antiguas pueden colgar
al sistema con esta opci&oacute;n. M&aacute;s informaci&oacute;n al respecto se encontrar&aacute; en
el documento <I>PCI-HOWTO</I>.</P>
<P><CODE>Kernel support for ELF binaries</CODE> (soporte para binarios <I>ELF</I>): 
<I>ELF</I> es un intento de uniformizar arquitecturas y sistemas operativos. 
Linux tambi&eacute;n pretende conseguirlo
<SL>De hecho, es el est&aacute;ndar
actual para todo el software en Linux. Podr&aacute; seguir ejecutando sus
(posiblemente obsoletos) antiguos binarios <CODE>a.out</CODE>, dotando al kernel,
--modularmente, por ejemplo-- de soporte para los mismos.</SL>
. </P>
<P><CODE>Set version information on all symbols for modules</CODE> (mantener
informaci&oacute;n de versi&oacute;n en los s&iacute;mbolos de los m&oacute;dulos): en el pasado, los
m&oacute;dulos se recompilaban con cada nuevo n&uacute;cleo. Si responde
afirmativamente, podr&aacute; usar m&oacute;dulos de otra versi&oacute;n. Para m&aacute;s detalle,
consulte el fichero <CODE>README.modules</CODE>.</P>
<P><CODE>Enable loadable module support</CODE> Responda que s&iacute; a esto si pretende
hacer uso de los m&oacute;dulos cargables en tiempo de ejecuci&oacute;n.</P>
<P><CODE>Kernel daemon support (e.g. autoload for modules)</CODE>Esto es
absolutamente necesario si pretende hacer uso de <CODE>kerneld</CODE>. En breve se
dispondr&aacute; de una versi&oacute;n en castellano del <I>Kerneld Mini-HOWTO</I>. Ver
secci&oacute;n 
<A HREF="Kernel-Como-14.html#Grupos">Grupos</A>.  </P>

<H2><A NAME="ss10.2">10.2 Opciones de red</A></H2>


<P>Se describen en el documento <I>NET-2-HOWTO</I> (o <I>NET-algo-HOWTO</I>).</P>


<HR>
<A HREF="Kernel-Como-9.html">Anterior</A>
<A HREF="Kernel-Como-11.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc10">Indice</A>
</BODY>
</HTML>
