<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML lang="es">

<HEAD>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<TITLE>LinuxFocus Julio 1998: Posicionamiento B&aacute;sico de la C&aacute;mara </TITLE>
</HEAD>



<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">



<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../">
<AREA shape="rect" coords="423, 9, 457, 30" alt="Map" href="../map.html">
<AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="../indice.html">
<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/">
</MAP>



<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15"   alt="News" href="../News/">
<AREA shape="rect" coords="189, 0, 284, 15"  alt="Archives" href="../Archives/">
<AREA shape="rect" coords="319, 0,  395, 15" alt="Links" href="../Links">
<AREA shape="rect" coords="436, 0,  523, 15" alt="About LF" href="../aboutus.html">
</MAP>



<CENTER>
<IMG src="../../common/images/../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top Bar]" ismap usemap="#top" ><BR>
<IMG src="../../common/images/../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom Bar]" ismap usemap="#bottom">
</CENTER>


<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE  align="left" width="30%" border="0" cellspacing="0" cellpadding="5">

<TR>
 <TD>
   <IMG src="../../common/images/Carlos-C.gif" width="123" height="118" alt="[Photo of the Author]"><BR>
   <FONT color="#336633" size="+2">Carlos Calzada</FONT><BR>

   <FONT  color="#336633">Sobre   el Autor</FONT>:  Soy estudiante  de
   inform&aacute;tica  (de   momento)  y desde  que   ten&iacute;a  un
   Spectrum  me   han gustado    los gr&aacute;ficos   por  ordenador,
   tambi&eacute;n soy muy aficionado a Linux y a todo  lo que no tiene
   que ver con Micro$oft. Los bons&aacute;is y los acuarios son dos de
   mis aficiones no relacionadas con los ordenadores.
   

<p>
<A HREF="mailto:ccgrau@disca.upv.es">Escribe al autor</A>
</p>


<!--   INDEX      -->

<FONT color="#336633">&Iacute;ndice de contenidos</FONT>: <BR>
<a href="#section1">Introducci&oacute;n</a><BR>
<a href="#section2">Posicionamiento b&aacute;sico de la c&aacute;mara</a><BR>
<A href="#section3">Motion blur</A><BR>
<A href="#section4">Depth of field</A><BR>




 </TD>
</TR>

</TABLE>




<TABLE>

<TR>
<TD>


<!--   BODY OF THE ARTICLE    -->
<H2>Posicionamiento B&aacute;sico de la C&aacute;mara</H2>
<IMG src="../../common/images/illustration39.gif" alt="[Ilustration]" width="100" height="100" hspace="10" >

<P align="top">
<FONT color="#336633" size="2">Resumen</FONT>: 
<FONT size="2" face="Helvetica,Arial,Roman">

En  este segundo art&iacute;culo sobre  RenderMan  nos meteremos en la
configuraci&oacute;n y posicionamiento  de la  c&aacute;mara y veremos
los   efectos  que es  capaz   de   crear.   Veremos  que, aunque   el
posicionamiento no es tan intuitivo como  en Pov-Ray, tiene la ventaja
de que es muy f&aacute;cil  programar trayectorias. Esto lo veremos en
el siguiente art&iacute;culo.
</FONT>
</P>
<HR size="0" noshadow>

<A name="section1"></A>
<H3>Introducci&oacute;n</H3>
<P>
En esta segunda entrega veremos con detalle el modelo de c&aacute;mara
de RenderMan.    La c&aacute;mara es  uno  de los elementos m&aacute;s
importantes de un renderizador y con  ella se pueden crear los efectos
m&aacute;s interesantes como  el <i>Motion Blur</i> (¿qu&eacute; es lo
que   se ve cuando  fotografiamos  algo  que  va  muy  deprisa?)  y el
<i>Depth of Field</i> (enfoque y desenfoque). Aunque se podr&iacute;an
haber  modelado muchos m&aacute;s efectos como  por ejemplo el <i>Lens
Flare</i> (el brillo de las luces cuando las fotografiamos), muchos de
ellos  se consiguen, no modificando    el modelo de la   c&aacute;mara
(haci&eacute;ndolo  m&aacute;s complejo), sino   que se   modelan como
propiedades de  los  objetos    gracias   al avanzado    sistema    de
<i>shaders</i> (shaders entendido como   texturas de los  objetos) que
posee,  con el cual  podemos  crear nuestros propios  "sombreadores" y
crear efectos bastante impresionantes.  El modo  en que se programan y
compilan estos sombreadores lo veremos en otro art&iacute;culo, aunque
este tema es bastante amplio (muy, muy amplio y adem&aacute;s no tengo
ni idea y lo  tendr&eacute; que mirar bien).  Como explic&aacute;bamos
en  el art&iacute;culo  anterior,  para renderizar las im&aacute;genes
debemos poner:</p>
<pre>
rendrib fichero.rib
</pre>
salida a  fichero 
<pre>
rendrib -d fichero.rib
</pre>
salida por pantalla.
<P>

<A name="section2"></A>
<H3>Posicionamiento b&aacute;sico de la c&aacute;mara</H3>

<p>
El  sistema de   coordenadas  de la c&aacute;mara   es "left-handed" y
coincide con la superficie del monitor.  El  origen se sit&uacute;a en
el centro de  la pantalla con el  eje <tt>x</tt> hacia la  derecha, el
<tt>y</tt> hacia arriba y el  <tt>z</tt> hacia "dentro".  Por defecto,
el "sistema  de  coordenadas actual"  coincide   con  el  "sistema  de
coordenadas de la c&aacute;mara" tal y como se ve en la primera figura
(el   eje <tt>x</tt> es  rojo,  el  <tt>y</tt> verde  y  el <tt>z</tt>
azul).  La primera imagen  es  una vista  "a&eacute;rea"  de como va a
quedar  la escena  y la  segunda es la   escena propiamente dicha (las
luces no  est&aacute;n en  el mismo sitio  en  las dos im&aacute;genes
para   que se vean  bien).    Aunque la  escena  no  sea especialmente
compleja (la verdad es que  es  bastante horrible) nos  servir&aacute;
para  comprender los  ficheros  RIB de ejemplo   sin que nos  estorben
complicados modelos geom&eacute;tricos.</p>

<CENTER>
	<A HREF="../../common/src/camara_default1.rib"><img src="../../common/images/camara_default1.jpg" height="240" width="320"></A>
	<A HREF="../../common/src/camara_default2.rib"><img src="../../common/images/camara_default2.jpg" height="240" width="320"></A>
</CENTER>


A continuaci&oacute;n   probaremos a  posicionar la c&aacute;mara.  Lo
m&aacute;s l&oacute;gico, sobre todo si  se ha usado Pov-Ray, es mover
la c&aacute;mara.   Para ver la escena  desde un poco m&aacute;s lejos
trasladar&iacute;amos  la   c&aacute;mara  a la        posici&oacute;n
<TT><0,0,-20></TT>,   con  este  movimiento   mover&iacute;amos     la
c&aacute;mara  hacia atr&aacute;s,  vamos a hacer  esto con RenderMan,
para  ello pondremos  un   <TT>Translate   0 0   -20</TT>   antes  del
<TT>WorldBegin</TT>:

<P>
<CENTER>
	<A HREF="../../common/src/camara_mov1a.rib"><img src="../../common/images/camara_mov1a.jpg" height="240" width="320"></A>
	<A HREF="../../common/src/camara_mov2a.rib"><img src="../../common/images/camara_mov2a.jpg" height="240" width="320"></A>
</CENTER>

<p>
¡La c&aacute;mara se  ha  movido hacia  delante!  En  realidad  lo que
hemos movido  no es   la c&aacute;mara,  hemos  movido el  sistema  de
coordenadas actual     hacia   detr&aacute;s, lo  que    hace   que la
c&aacute;mara  "avance". Por tanto, para  poner la c&aacute;mara donde
quer&iacute;amos  hemos  de hacer  lo contrario, mover   el sistema de
coordenadas actual hacia delante (con <tt>Translate 0 0 20</tt>):</p>
<CENTER>
	<A HREF="../../common/src/camara_mov1b.rib"><img src="../../common/images/camara_mov1b.jpg" height="240" width="320"></A>
	<A HREF="../../common/src/camara_mov2b.rib"><img src="../../common/images/camara_mov2b.jpg" height="240" width="320"></A>
</CENTER>
<p>
Ahora si que   est&aacute; la c&aacute;mara  donde quer&iacute;amos. A
partir de ahora, toda la geometr&iacute;a que  incluyamos en la escena
estar&aacute; referida a esta   nueva posici&oacute;n del  sistema  de
coordenadas actual.  En el siguiente ejemplo  dejaremos el monigote en
el   origen de   coordenadas  y   moveremos  la   c&aacute;mara a   su
alrededor:</p>


<P>
<CENTER>
	<A HREF="../../common/src/camara_rot1a.rib"><img src="../../common/images/camara_rot1a.jpg" height="240" width="320"></A>
	<A HREF="../../common/src/camara_rot2a.rib"><img src="../../common/images/camara_rot2a.jpg" height="240" width="320"></A>
</CENTER>
<p>
Podemos ver en el fichero RIB las  transformaciones que hemos aplicado
a la c&aacute;mara para posicionarla:</p>


<div style="border:solid; border-width:1">
<pre>
Display "camara_default2.tif" "file" "rgb"
Projection "perspective" "fov" 45
Format 320 240 1

LightSource "ambientlight" 1 "intensity" 
            0.3 "lightcolor" [1 1 1]
LightSource "distantlight" 2 "intensity" 
            1.0 "from" [10 10 -10] "to" [0 0 0]

Translate 0 0 20
Rotate 45 1 0 0
Rotate 135 0 1 0

WorldBegin
	Color 1 1 1
        # Background blanco
	Sphere 10000 -10000 10000 360 

	# Objeto de la escena
	TransformBegin
		Color 1 0 0
		Sphere 3 -3 3 360
	TransformEnd
	TransformBegin
		Rotate -90 1 0 0
		Translate 0 0 2
		Cone 3 3 360
		Disk 0 3 360
	TransformEnd
	TransformBegin
		Rotate -90 0 1 0
		Cylinder 1 -4 4 360
		Disk 4 1 360
		Disk -4 1 360
	TransformEnd
WorldEnd
</pre>

</div>

<p>
Observamos  una translaci&oacute;n (<tt>Translate  0  0 20</tt>) y dos
rotaciones, una  alrededor   del eje <tt>x</tt>   (<tt>Rotate   45 1 0
0</tt>)  y  otra alrededor  del   eje <tt>y</tt> (<tt>Rotate  135  0 1
0</tt>).  Esto puede desconcertar a los  usuarios de Pov-Ray ya que en
&eacute;ste   las     transformaciones  se  aplican    por   orden  de
aparici&oacute;n,  sin   embargo RenderMan apila  las transformaciones
hasta  que  encuentra  un token    significativo (en nuestro  caso  el
<tt>WorldBegin</tt>) y entonces las  aplica.   De todo esto se  deduce
que las transformaciones hemos de indic&aacute;rselas al rev&eacute;s,
es   decir,   la &uacute;ltima  transformaci&oacute;n ser&iacute;a  la
primera en aplicarse. Por tanto nuestro ejemplo debe leerse como:</p>


<table width="90%">

<tr>
<td>
1. Estado Inicial 
</td>

<td align="right">
<A HREF="../../common/src/camara_paso0.rib"><IMG SRC="../../common/images/camara_paso0.jpg" height=240 width=320></A>
</td>
</tr>


<tr>
<td>
2.  Rotar el sistema de coordenadas alrededor del eje 
<tt>y</tt> 135 grados
</td>

<td align="right">
<A HREF="../../common/src/camara_paso1.rib"><img src="../../common/images/camara_paso1.jpg" height="240" width="320"></a>
</td>
</tr>


<tr>
<td>
3. Rotar el sistema de coordenadas alrededor del eje 
<tt>x</tt> 45 grados
</td>

<td align="right">
<A HREF="../../common/src/camara_paso2.rib"><IMG SRC="../../common/images/camara_paso2.jpg" height=240 width=320></A>
</td>
</tr>



<tr>
<td>
4. Desplazar el sistema de coordenadas 20 unidades a lo largo del eje
<tt>z</tt> 
</td>

<td align="right">
<A HREF="../../common/src/camara_paso3.rib"><IMG SRC="../../common/images/camara_paso2.jpg" height=240 width=320></A>
</td>
</tr>



</table>

<p>
Hay que tener en cuenta que  todas las transformaciones del sistema de
coordenadas actual    (rotaciones y translaciones)  son   relativas al
sistema  de  coordenadas   de  la   c&aacute;mara, por    tanto,   una
rotaci&oacute;n en el     eje    <tt>x</tt> se  refiere  a     que  la
rotaci&oacute;n es respecto del eje <tt>x</tt> de la c&aacute;mara, no
del sistema de coordenadas actual.</p>
<p>
A partir de aqu&iacute; entramos en la parte m&aacute;s interesante ya
que  nos metemos de  lleno con los efectos que  se pueden hacer con la
c&aacute;mara de RenderMan.</p>
<P>

<A name="section3"></A>
<H3>Motion blur (simulaci&oacute;n de objetos m&oacute;viles)</H3>



<p>
El primero que   veremos es el  Motion  Blur, es algo  as&iacute; como
"movimiento   borroso" y   es el     efecto que   se produce    cuando
fotografiamos algo que se mueve deprisa.</p>
<p>
Para que  la c&aacute;mara sea   capaz de simular este  efecto debemos
incluir en el fichero el  token <tt>Shutter 0  1</tt> (por supuesto en
la parte del fichero dedicado  a la c&aacute;mara), con esto definimos
el  tiempo de exposici&oacute;n  de  nuestra c&aacute;mara, en nuestro
caso una unidad de tiempo por lo que el objetivo se "abrir&aacute;" en
el   instante 0 y   se  cerrar&aacute;  en el   1.    Este tiempo   de
exposici&oacute;n lo dejaremos  casi siempre con  <tt>0 1</tt> ya que,
como veremos, solo indica la forma de actuar de RenderMan.</p>

<p>
A partir de aqu&iacute; tenemos que decirle  a RenderMan que es lo que
se mueve, esto se hace con el par <tt>MotionBegin MotionEnd</tt>. Como
podemos ver en la siguiente figura (y  en su fichero RIB), tenemos una
pelota  que se mueve desde la   posici&oacute;n <tt>0 10  5</tt> en el
instante 0 a   la  posici&oacute;n <tt>5  10   0</tt> en  el  instante
1.  <tt>MotionBegin  [0  1]</tt>  indica a   RenderMan que  tiempos se
corresponden con    las  transformaciones (instante  0   la  primera e
instante 1 la segunda) y los valores deben coincidir con los indicados
en la secci&oacute;n <tt>Shutter</tt>.  Como se puede comprobar  en el
ejemplo el efecto es bastante real y en una animaci&oacute;n el efecto
es m&aacute;s impactante.</p>

<CENTER>
	<A HREF="../../common/src/camara_mb1.rib"><img src="../../common/images/camara_mb1.jpg" height="240" width="320"></A>
</CENTER>
<p>
Por  supuesto, las   transformaciones  que podemos  incluir  dentro de
<tt>MotionBegin   MotionEnd</tt>  no se  limitan  a las translaciones,
RenderMan  es capaz de renderizar  trayectorias no lineales con Motion
Blur.En el siguiente ejemplo lo  que tenemos es una rotaci&oacute;n de
los ejes 25 grados alrededor de su eje y.</p>

<CENTER>
	<A HREF="../../common/src/camara_mb2.rib"><img src="../../common/images/camara_mb2.jpg" height="240" width="320"></A>
</CENTER>
<p>
Aunque normalmente  lo que  se mueve son  los  objetos  de la  escena,
RenderMan contempla la posibilidad de que sea  la c&aacute;mara la que
se mueve,  por  lo tanto tambi&eacute;n  el  efecto de  Motion Blur se
puede aplicar   al  movimiento de la  c&aacute;mara.   En este ejemplo
movemos la c&aacute;mara 5 unidades a la izquierda (movemos el sistema
de coordenadas actual 5 unidades a la derecha), y todos los objetos de
la escena est&aacute;n borrosos.   Por supuesto el par <tt>MotionBegin
MotionEnd</tt>  se encuentra  en  la parte  de  la c&aacute;mara en el
fichero RIB:</p>

<CENTER>
	<A HREF="../../common/src/camara_mb3.rib"><img src="../../common/images/camara_mb3.jpg" height="240" width="320"></A>
</CENTER>
<P>

<A name="section4"></A>
<H3>Depth of field (enfoque y desenfoque)</H3>

<p>
Otro  de los aspectos que  nos ofrece RenderMan  es la posibilidad del
Depth of  Field, o lo  que es  lo mismo,  la   capacidad de enfocar  o
desenfocar objetos en  la  escena. La  forma  de indicar  esto es  con
<tt>DepthOfField</tt>. Este  token necesita tres par&aacute;metros: el
primero es <tt>f-stop</tt>, el  segundo <tt>fov</tt> (field of  view o
&aacute;ngulo  de  visi&oacute;n) y  <tt>focus-lenght</tt>   (longitud
focal  o la distancia a la  cual un objeto aparecer&aacute; enfocado).
<tt>f-stop</tt> nos  indica la  distancia    a  la  cual se deja    de
desenfocar m&aacute;s, en nuestro caso, un objeto  que est&eacute; a 2
unidades o  menos  de distancia de  la  c&aacute;mara aparecer&aacute;
igual de desenfocado (o enfocado). El par&aacute;metro <tt>fov</tt> se
suele dejar  con  el valor 1.0  ya  que se  suele  definir antes  (con
<tt>Projection  "perspective" "fov"  45</tt> en nuestro  ejemplo) y lo
que conseguir&iacute;amos seria multiplicar el  valor anterior por  el
nuevo. <tt>focus-lenght</tt> es el par&aacute;metro que nos interesa y
define  la  distancia a la que   deben  estar los   objetos para estar
enfocados.  En el  siguiente  ejemplo tenemos la  c&aacute;mara  en el
origen   y   tres bolas   (una alejada  10    unidades,  otra 20 y  la
&uacute;ltima    30),   veremos como    variando <tt>focus-lenght</tt>
enfocamos las diferentes esferas.</p>

<p>
En el primer ejemplo tenemos  <tt>DepthOfField 2.0 1.0 10</tt>, lo que
quiere  decir     que  los objetos alejados     diez   unidades  de la
c&aacute;mara estar&aacute;n enfocados (la esfera roja):</p>
<P>
<CENTER>
	<A HREF="../../common/src/camara_dof1.rib"><img src="../../common/images/camara_dof1.jpg" height="240" width="320"></A>
</CENTER>
<p>
A continuaci&oacute;n  tenemos <tt>DepthOfField 2.0 1.0 20</tt>. Ahora
lo que est&aacute;  enfocado es la esfera verde  (ya que est&aacute; a
20 unidades de la c&aacute;mara):</p>
<P>
<CENTER>
	<A HREF="../../common/src/camara_dof2.rib"><img src="../../common/images/camara_dof2.jpg" height="240" width="320"></A>
</CENTER>
<p>
Para enfocar la &uacute;ltima  esfera (la azul que est&aacute; alejada
30 unidades) debemos poner <tt>DepthOfField 2.0 1.0 30</tt>:</p>

<CENTER>
	<A HREF="../../common/src/camara_dof3.rib"><img src="../../common/images/camara_dof3.jpg" height="240" width="320"></A>
</CENTER>
<p>
El efecto  que se  consigue  al aplicar  el depth   of field da  mayor
realidad a las im&aacute;genes que  generamos. Por supuesto el  tiempo
del rendering  aumenta  al introducir estos  efectos  (tanto el Motion
Blur como   el Depth of Field)  ya  que se realizan  varias pasadas de
renderizado.</p>


<HR size="1" noshade>

<p align=right><i>Texto original en Castellano</i></P>



</TD>
</TR>
</TABLE>


<!-- ARTICLE FOOT -->
    <BR clear="all">
    <CENTER>
      <TABLE width="95%">
	
	<TR>
	  <TD align="center" bgcolor="#666666">
	    <FONT color="#ffffff">
	      P&aacute;ginas web mantenidas por Miguel &Aacute;ngel Sep&uacute;lveda<BR>
	      &copy; Carlos Calzada 1998<BR>
	      <B>LinuxFocus 1998</B>
	    </FONT>
	  </TD>
	</TR>
	
      </TABLE>
    </CENTER>
    
    
    
  </BODY>
  
</HTML>






