<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<HTML lang="en">

<HEAD>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<TITLE>LinuxFocus July 1998:  StarOffice Editor</TITLE>
</HEAD>



<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">



<!-- MAP for top navegation bar -->
<MAP name="top">
<AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="../">
<AREA shape="rect" coords="423, 9, 457, 30" alt="Map" href="../map.html">
<AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="../indice.html">
<AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="../Search/">
</MAP>



<!-- MAP for bottom navegation bar -->
<MAP name="bottom">
<AREA shape="rect" coords="78, 0, 163, 15"   alt="News" href="../News/">
<AREA shape="rect" coords="189, 0, 284, 15"  alt="Archives" href="../Archives/">
<AREA shape="rect" coords="319, 0,  395, 15" alt="Links" href="../Links">
<AREA shape="rect" coords="436, 0,  523, 15" alt="About LF" href="../aboutus.html">
</MAP>



<CENTER>
<IMG src="../../common/images/../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top Bar]" ismap usemap="#top" ><BR>
<IMG src="../../common/images/../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom Bar]" ismap usemap="#bottom">
</CENTER>


<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE  align="left" width="30%" border="0" cellspacing="0" cellpadding="5">

<TR>
 <TD>
   <IMG src="../../common/images/Ismael-R.gif" width="100" height="133" alt="[Photo of the Author]">
   <BR>
   <FONT color="#336633" size="+2">Ismael Ripoll </FONT><BR>

   <FONT   color="#336633">Sobre   el  Autor</FONT>: Doctorado  por la
   Universidad Polit&eacute;cnica de   Valencia en 1996.   Profesor en
   Sistemas Operativos    en el Departamento DISCA.    &Aacute;reas de
   investigaci&oacute;n  de     inter&eacute;s  incluyen  tareas    en
   tiempo-real y   sistema   operativos.  Usuario  de   Linux    desde
   1994.   Hobbies:    Treking    en   los   Pirineos,     esquiar   y
   electr&oacute;nica casera.
    <BR>


<BR>
<A HREF="mailto:iripoll@disca.upv.es">Escribe al autor</A>
<BR>



<!--   INDEX      -->
<BR>
<FONT color="#336633">&Iacute;ndice de contenidos</FONT>: <BR>
<A href="#section1">Nuevas actualizaciones</A><BR>
<A href="#section2">El procesador de textos</A><BR>
<A href="#section3">Comienza el trabajo </A><BR>
<A href="#section4">Editando texto</A><BR>
<A href="#section5">Edici&oacute;n b&aacute;sica </A><BR>
<A href="#section6">Edici&oacute;n intermedia </A><BR>
<A href="#section7">Edici&oacute;n Avanzada </A><BR>
<A href="#section8">Conclusiones </A><BR>




 </TD>
</TR>

</TABLE>




<TABLE>

<TR>
<TD>


<!--   BODY OF THE ARTICLE    -->
<H2>StarOffice Editor</H2>
<IMG src="../../common/images/illustration31.jpg" alt="[Ilustration]" width="100" height="100" hspace="10" >

<P align="top">
<FONT color="#336633" size="2">Abstract</FONT>: 
<FONT size="2" face="Helvetica,Arial,Roman">
&Eacute;ste   es   el segundo art&iacute;culo   dedicado    a la suite
ofim&aacute;tica StarOffice.  El primer  art&iacute;culo, tras dar una
r&aacute;pida visi&oacute;n global de toda la suite, se centraba en la
creaci&oacute;n  de   presentaciones.    En  esta    segunda   entrega
estudiaremos la herramienta  estrella de todo  paquete de  oficina: el
editor de texto
</FONT>

</P>


<BR clear="all">
<BR>
<HR size="0" noshadow>

<A name="section1"></A>
<H3>Nuevas actualizaciones</H3>
   
<P>Desde  que escrib&iacute;  el anterior art&iacute;culo  s&oacute;lo
han   pasado  dos meses.    Desde   entonces,  StarDivision ha   hecho
p&uacute;blicas  tres   revisiones (service packs)   de StarOffice (<A
href="http://www.stardivision.com">http://www.stardivision.com</A>).
M&aacute;s que parches de  la distribuci&oacute;n, lo que entregan son
una nueva instalaci&oacute;n completa.  La estabilidad del programa se
ha mejorado mucho, y ya  funcionan correctamente todas las  funciones.
Reconoce  perfectamente los   s&iacute;mbolos especiales  del  teclado
castellano  y  catal&aacute;n (acentos y  di&eacute;reis), supongo que
tambi&eacute;n funcionar&aacute; con  otros teclados de otros idiomas.
Junto con la  distribuci&oacute;n viene un  complet&iacute;simo manual
de instalaci&oacute;n (en html  y pdf), donde se  da respuesta a todos
los problemas que pueden surgir.
</P>

<P>En el    anterior  n&uacute;mero  d&iacute;  un   dato  incorrecto.
Coment&eacute; que  el  dise&ntilde;o  de  StarOffice  se hab&iacute;a
hecho pensando en la portabilidad, y que solo el 20% del c&oacute;digo
era dependiente del  sistema operativo.   Lo  cual era  cierto en   la
versi&oacute;n 3.1, pero en la versi&oacute;n  actual (la 4.0) solo el
0.5% es  dependiente de  la  implementaci&oacute;n.  Correcci&oacute;n
apuntada por Michael, de StarDivision.</P>


<A name="section2"></A>
<H3>El procesador de textos</H3>


<P>

    Como     <A    href="../../common/images/figure32-1.gif"><IMG SRC="../../common/images/figure32-1-thumb.gif"
    NAME="Graphic1"      ALIGN="left"    WIDTH="199"      HEIGHT="195"
    hspace="10"></A>ya coment&eacute;  en el n&uacute;mero   anterior,
    los dise&ntilde;adores de  StarOffice no han querido reintentar la
    rueda en lo que se refiere al interfaz de usuario, por lo que han
    adoptado   la mayor parte  del  look-and-feel  del MsWord.  Es tan
    compatible con  Word que puede importar  y exportar  documentos en
    formato Word 6.0/95 y RTF (Rich, Text, Format).</P>

<P>No pretendo  hacer una descripci&oacute;n a  modo de tutorial sobre
este procesador de textos, sino m&aacute;s bien una descripci&oacute;n
de las  capacidades con que  cuenta   este programa.  Hay  cientos  de
libros, y no  estoy exagerando,  en los  que se explica  con desmedido
detalle c&oacute;mo utilizar procesadores de texto.



<P>Este art&iacute;culo lo estoy escribiendo  con el propio editor  de
texto de StarOffice.</P>

<P>Veamos  ahora c&oacute;mo es el entorno de
trabajo.
</P>

<BR clear="all">

<P>La  ventana   de  trabajo  est&aacute;
compuesta por lo siguientes elementos:</P>


    <UL>
      <LI><P><B>Barra  de  men&uacute;s</B>.   Con las mismas entradas
      que el Word, a excepci&oacute;n del men&uacute; de tablas.</P>

      <LI><P><B>Barra de herramientas de  funciones</B>. Aparte de las
      funciones de  salvar, cortar-pegar,  deshacer-hacer e  imprimir,
      tambi&eacute;n aparecen varios botones poder &quot;navegar&quot;
      y para activar  funciones    avanzadas que veremos    m&aacute;s
      adelante.</P>
	
      <LI><P><B>Barra  de    herramientas  de     objetos</B>,   donde
      est&aacute;n  situados todos   los botones  relacionados  con la
      edici&oacute;n  b&aacute;sica del  objeto  que en   cada momento
      est&eacute; seleccionado, si es texto aparecen los botones: tipo
      de    letra,     tama&ntilde;o,       negrita,   it&aacute;lica,
      alineaci&oacute;n, etc.;    si    seleccionamos un   dibujo   se
      reemplazan  por: alineaci&oacute;n, distribuci&oacute;n de texto
      al rededor, bordes, punto de anclaje, etc.</P>

      <LI><P><B>Barra   de herramientas  principal</B>.   Desde la que
      podremos   insertar la mayor parte   de los objetos disponibles:
      tablas,  campos   de control, objetos  OLE,   dibujos, controles
      activos,   etc.    En  est&aacute;   misma  barra    encontramos
      tambi&eacute;n      funciones   de auto-texto,     auto-formato,
      ortogr&aacute;fia y b&uacute;squeda.</P>
	
      <li><p><b>Barra   de  estado</b>.   En   la  parte derecha,  hay
      informaci&oacute;n el estado  del documento actual. Al igual que
      sucede en el    Word,   tambi&eacute;n se puede modificar     la
      informaci&oacute;n que muestra. En la parte izquierda aparece un
      bot&oacute;n r&aacute;pido para  crear documentos y otro que nos
      lleva directamente    al escritorio ra&iacute;z,  despu&eacute;s
      aparecen  como   botones     todos los  documentos      (textos,
      presentaciones,  hojas   de c&aacute;lculo,  p&aacute;ginas web,
      etc.)  que tenemos abiertos. La parte izquierda se asemeja mucho
      a  la barra de tareas  del  Windows 95  con  el bot&oacute;n  de
      &quot;Start&quot;.</p></li>
    </UL>

<P>&Eacute;stas son las barras de herramientas  tal como aparecen tras
la instalaci&oacute;n,   pero podemos  configurarlas a  nuestro  gusto
a&ntilde;adiendo o eliminando botones  a cada barra o incluso  creando
nuevas barras. La  localizaci&oacute;n   espacial  de las  barras   es
totalmente configurable con   s&oacute;lo arrastrarlas  al  lugar  del
escritorio  que deseemos (excepto la  barra de men&uacute;s y la barra
de   control  que han  de   estar en   la   parte superior e  inferior
respectivamente).</P>

<P>Para referirse  a los documento se
utilizan  direcciones   URL, tanto  si   es  un  documento local  como
remoto.</P>


<A name="section3"></A>
<H3>Comienza el trabajo</H3>


<P>Para   empezar     a   escribir primero tenemos      que   crear el
documento.   &Eacute;sto  lo podemos  hacer    al menos  de  4  formas
distintas:</P>

<IMG SRC="../../common/images/figure32-2.gif" NAME="Graphic2" ALIGN="right" 
     WIDTH="285" HEIGHT="206" BORDER=0 hspace="10">

<UL>

	<LI>  Creando un documento en blanco.   Cosa que podemos hacer
	desde tres lugares diferentes:

	<UL>

	  <LI>Barra de men&uacute;s
	  File->New->Document.

          <LI>Barra de Estado
		New->Document.

          <LI>Desde   el  escritorio   de trabajo   (desktop)  con  el
          men&uacute; contextual  (aparece pulsando  el   bot&oacute;n
          derecho del rat&oacute;n).

	</UL>
	<li>  Utilizando plantillas (template).  StarOffice nos ofrece
	una amplia gama  de plantillas.  En  la  ventana de plantillas
	aparecen todas las plantillas disponibles agrupadas por temas,
	no por  tipos   de documento  (presentaci&oacute;n,   hoja  de
	c&aacute;lculo,  etc), por lo  que puede darse  el caso que la
	plantilla que elijamos corresponda con una presentaci&oacute;n
	en lugar de con un documento de texto normal.</li>

    </UL>


    <ul>
      <li>
      <img src="../../common/images/figure32-3.gif" align="right" height="141" width="360" border="0">
	 Con la  ayuda   del  asistente.,  desde  el    men&uacute;  de File.
	 Disponemos de     10  asistentes para  realizar     crear los
	 siguientes   tipos   de documentos:   Cartas,   FAX, Agendas,
	 Memorias,  Presentaciones, P&aacute;ginas  Web,   Tablas, Res&uacute;menes,
	 Formularios  y Consultas.  S&oacute;lo   generan documentos de texto
	 los     asistentes      de   cartas,   Faxes,      agendas  y
	 memorias.</P>

	<p>Se dispone de una ayuda en
	l&iacute;nea a base   de globos de   ayuda.  Tambi&eacute;n podemos  activar
	globos extendidos (Help->Extended_Tips)  para  tener  una
	ayuda realmente completa.</p></li>

      </ul>




<A name="section4"></A>
<H3>Editando texto</H3>



<P>He  dividido   en  tres  partes  las  funcionalidades   que  ofrece
StarOffice.  Dependiendo  del     conocimiento que   tengas  de    los
procesadores de texto y de lo que necesites  de ellos, puedes saltarte
algunas de las siguientes secciones.</P>


<A name="section5"></A>
<H4>Edici&oacute;n b&aacute;sica</H4>

<P>Tiene todas  las funcionalidades b&aacute;sicas para trabajar sobre
el <B>formato  de letra</B>.  En la  barra  de herramientas de objetos
tenemos botones r&aacute;pidos para acceder a los atributos m&aacute;s
utilizados:</P>

<P>
<center>
<img src="../../common/images/figure32-4.gif" align="CENTER" height="25" width="440" border="0">
</center>

<br>
<IMG SRC="../../common/images/figure32-5.gif" NAME="Graphic5" ALIGN="RIGHT"
  width="280" height="153" hspace="10" BORDER=0>

Tipo de letra, tama&ntilde;o, negrita, it&aacute;lica y subrayado.</P>


<P>A estos y a otros atributos se pueden acceder  y modificar desde el
men&uacute;      de  contexto.  Desde    la     barra  de  men&uacute;
(Format->Character) se puede abrir una ventana de di&aacute;logo desde
la que se tiene acceso a todos los atributos.
</P>

<P>En lo relativo al <B>formato del p&aacute;rrafo</B> tampoco se echa
nada en falta. En la barra de objetos, junto a  los botones de negrita
etc.    tenemos botones  para   alinear,  seleccionar enumeraciones  o
itemizes e indentar p&aacute;rrafos.  Tambi&eacute;n podemos modificar
los atributos de los  p&aacute;rrafos desde el men&uacute; de contexto
y la  barra  de  men&uacute;s.   La gesti&oacute;n   de los puntos  de
tabulaci&oacute;n es completamente  id&eacute;ntico a como se  hace en
Word: utilizando la regla horizontal.</P>

<P>

<IMG SRC="../../common/images/figure32-6.gif" NAME="Graphic6" ALIGN="RIGHT"
  hspace="10" width="281" height="151" BORDER=0>  Que levanten la mano
  los que hayan tenido problemas con el MsWord a la hora de configurar
  el <B>formato de p&aacute;gina</B>. Extra&ntilde;amente en MsWord el
  formato de p&aacute;gina est&aacute; distribuido por varias ventanas
  de di&aacute;logo,  a las  que se accede  desde varios  puntos en la
  jerarqu&iacute;a de men&uacute;s.  Por  suerte, en StarOffice  todas
  las caracter&iacute;sticas  de la p&aacute;gina  se pueden modificar
  desde   una         &uacute;nica  ventana     de     di&aacute;logo:
  Format->Page. Algunas de  las operaciones m&aacute;s  habituales las
  podemos encontrar  tambi&eacute;n   en  la barra    de  herramientas
  principal.  Desde   aqu&iacute;  se   define  tipo de  p&aacute;gina
  (Letter,  A3,  A4, etc.), el  tama&ntilde;o  del encabezado y pie de
  p&aacute;gina,  el  estilo  de   los  bordes, el  color  del  fondo,
  as&iacute;  como el n&uacute;mero y estilo  de las columnas (en caso
  de querer distribuir el texto en varias columnas).</P>

<P>Las    opciones  para imprimir   en  papel   son bastante  escasas,
s&oacute;lo  permite imprimir  sobre  impresoras PostScript. De  todas
formas,  si tenemos   bien  configurado  el  sistema   con  el  filtro
correspondiente  (normalmente        ser&aacute;           el    <FONT
FACE="courier">gs</FONT>)    en          el          fichero     <FONT
FACE="courier">/etc/printcap</FONT>, podremos imprimir  sin m&aacute;s
problemas.
</P>



<A name="section6">
<H4>Edici&oacute;n intermedia</H4>
</A>


<img src="../../common/images/figure32-7.gif" align="left" height="183" width="113" border="0" hspace="10">


<P>Una  de las  primeras  caracter&iacute;sticas que incorporaron  los
procesadores de texto fueron los <B>juegos de estilos</B>. Los estilos
son  conjuntos  de atributos --de letra,   de p&aacute;rrafo o ambos--
agrupados bajo un  nombre.   Por  ejemplo podemos definir   el  estilo
&quot;t&iacute;tulo&quot; como letra helv&eacute;tica, 14pt, negrita e
it&aacute;lica. Cada vez que tengamos que crear un nuevo t&iacute;tulo
s&oacute;lo      tendremos         que   asignarle     el       estilo
&quot;t&iacute;tulo&quot;.  Las ventajas son evidentes:
</P>

<ul>
  <li>todos los t&iacute;tulos  del documento tendr&aacute;n el  mismo
  aspecto.</li>

  <li>podemos crear  cada t&iacute;tulo m&aacute;s  r&aacute;pidamente
  (s&oacute;lo    hay  que  aplicar   el    estilo,  y   no 4  estilos
  individuales).</li>

</ul>


<P>StarOffice  ofrece toda  una  serie   de estilos predefinidos   que
podemos utilizar en caso de no querer crear unos propios.</P>

<P>Es  interesante disponer  de muchos estilos  para  poder escoger el
m&aacute;s  conveniente al tipo de  documento que estamos escribiendo,
pero por contra, no es deseable tener que &quot;buscar&quot; el estilo
que hemos  elegido entre la   larga lista de estilos  disponibles.  La
forma en  la que StarOffice presenta  los estilos es muy acertada. Los
estilos  que se  han  aplicado  al  documento aparecen   en una  lista
desplegable de  la  barra de    objetos,  por lo  que  en   principio,
s&oacute;lo  es necesario  buscarlos una  vez en  la  lista  global de
estilos. Por  otra parte,  la lista global   de estilos  (que  podemos
activar    pulsando    el       bot&oacute;n <IMG  SRC="../../common/images/figure32-8.gif"
NAME="Graphic14" ALIGN=MIDDLE width=23 height=23 BORDER=0>)

permite  organizarla   de    varias formas:   autom&aacute;tica    (en
funci&oacute;n  de la  plantilla   en  la que  se  basa  el  documento
StarOffice selecciona  los  estilos m&aacute;s apropiados); todos  los
estilos; estilos aplicados; estilos HTML; creados por el usuario; o en
forma de &aacute;rbol jer&aacute;rquico.</P>

<P>A  la par  que  se puede  seleccionar   el conjunto de estilos  que
queremos  tener disponibles, los  estilos est&aacute;n  tambi&eacute;n
organizados en  funci&oacute;n  del  principal atributo que   definen:
estilo  de p&aacute;rrafos, de car&aacute;cter,  de p&aacute;gina o de
marco.  Si  bien  los  m&aacute;s &uacute;tiles  con   los estilos  de
p&aacute;rrafo.</P>

<P>Disponemos  de un buen  <B>diccionario de sin&oacute;nimos</B>. Por
ahora  s&oacute;lo  est&aacute;    disponible la    versi&oacute;n  en
Ingl&eacute;s y alem&aacute;n.</P>

<P>Las <B>tablas</B> son otra  apreciada caracter&iacute;stica de todo
buen procesador  de textos.   Una  curiosidad que  me ha   llamado  la
atenci&oacute;n   de  MsWord  es      que  no  puede    unir    celdas
verticalmente. Aqu&iacute; no tenemos ese problema.</P>

<P>
<IMG SRC="../../common/images/figure32-9.gif" NAME="Graphic8" ALIGN=RIGHT width= 200 height=188 BORDER=0>
Otra cosa que tambi&eacute;n hab&iacute;a echado en falta en MsWord es
la  poca <B>potencia de c&aacute;lculo</B>  que ofrecen sus tablas, en
otras palabras,  una tabla de  Word est&aacute;  muy lejos  de poderse
utilizar como hoja de c&aacute;lculo  --entre otras, se me ocurre  que
de esta forma se &quot;motiva&quot; a que el usuario  se compre una de
hoja de  c&aacute;lculo--. Las tablas  del editor  de  textos (que  no
tienen  nada  que ver  con las hojas  de  c&aacute;lculo de este mismo
paquete) son  autenticas hojas de c&aacute;lculo,  la barra de objetos
se transforma en un  completo interfaz para introducir f&oacute;rmulas
en las  celdas. Para  construir las  formulas con podemos   ayudar del
rat&oacute;n para marcar conjuntos de celdas.</P>

<P>Los  <B>marcos</B> (frames) permiten  situar texto  y otros objetos
dentro de una p&aacute;gina con absoluta libertad.  Dentro de un marco
podemos insertar los   objetos  que queramos (tabla,   imagen,  texto,
etc.). El marco se comporta como un contenedor  de objetos, si movemos
el marco,  todos los  objetos   que  contenga se  mover&aacute;n   con
&eacute;l.  La distribuci&oacute;n   de los objetos dentro   del marco
sigue las mismas leyes que en una p&aacute;gina normal.</P>

<P>Disponemos de  dos  formas para    distribuir el texto   en  varias
<B>columnas</B>: (1) aplicar la distribuci&oacute;n de columnas a todo
el documento; (2) crear una estructura de columnas  dentro de un marco
flotante.  Con  este   segundo  esquema   nos evitamos   el   incomodo
m&eacute;todo que se tiene que utilizar  en Word para tener documentos
compuestos  de   por  p&aacute;ginas   con distinto   n&uacute;mero de
columnas.</P>


<A name="section7"></A>
<H3>Edici&oacute;n Avanzada</H3>



<P>Una vez se  ha escrito todo un  documento, se puede reorganizar los
p&aacute;rrafos  r&aacute;pidamente manteniendo la tecla  &lt;Ctrl&gt;
pulsada y movi&eacute;ndolo  con las teclas del  cursor (igual que con
&lt;Shift&gt;-&lt;Alt&gt; en MsWord).</P>

<P>
Se pueden crear <B>expresiones matem&aacute;ticas</B> bien ayudado por
un men&uacute; de opciones,   o  escribi&eacute;ndolas de  forma   muy
parecida a como se escribir&iacute;an en LaTeX. Esta expresi&oacute;n:
<p>

<tt>
sum from {i le t le n} { 1 over {x_i + y_i }  b_{ij} } = {prod from {k
%notequal i} x_k - x_k  } over {prod from {k  %notequal j} x_k - x_k }
</tt><p> da como resultado la siguiente formula:

<center>
<IMG SRC="../../common/images/figure32-10.gif" NAME="Object2" width= 261 height=125 alt="[Ecuaci&oacute;n]">
</center>


<P>Una posibilidad un tanto  curiosa  es la de insertar   <B>texto</B>
<B>animado</B>.    Este  texto   se   desplaza horizontalmente  con un
movimiento uniforme, apareciendo por  la  derecha, y cuando ha  pasado
todo el texto se vuelve a repetir desde el principio. Con este tipo de
objetos el documento se convierte en algo vivo divertido.</P>

<P>Podemos insertar una  gran  variedad de  <B>controles</B> (botones,
casillas para marcar, campos de texto, etc) similares a los utilizados
en los formularios HTML.  Una vez insertados se comportan como objetos
activos sobre  los  que se  puede actuar.   Podemos  asociar una macro
(escrita  en StarBasic o en  JavaScript)  con alguna acci&oacute;n del
objeto. Es  algo as&iacute; como   crear formularios o una especie  de
programaci&oacute;n visual.</P>

<P><img src="../../common/images/figure32-11.gif" align="RIGHT" height="239" width="367" hspace="10">  A   partir de una tabla  con  datos
num&eacute;ricos, podemos  generar una     <B>gr&aacute;fico</B> <B>de
barras</B>.  No entrar&eacute; a describir    todas las opciones   que
StarOffice pone a nuestra  disposici&oacute;n para crear y  modelar el
gr&aacute;fico de barras,  pues quiero que acabar este art&iacute;culo
antes  de   que aparezca   la  siguiente  versi&oacute;n.  S&oacute;lo
comentar que los gr&aacute;ficos de barras son  objetos OLE y al igual
que  sucede   en Windows, todos   los   men&uacute;s del  programa  se
convierten en los men&uacute;s de la aplicaci&oacute;n empotrada.
</P>

<P>Aparte  del  gr&aacute;fico   de  barras, que  es  un   objeto OLE,
tambi&eacute;n  podemos  insertar    otros  objetos:  una    hoja   de
c&aacute;lculo, una presentaci&oacute;n o una imagen.</P>


<P>S&oacute;lo  los muy experimentados en   Word se atreven a utilizar
con soltura los <B>estilos</B>.  En StarOffice la situaci&oacute;n  es
completamente     distinta,  el  concepto     de  estilo   est&aacute;
perfectamente  integrado  con  el de  edici&oacute;n.   Para  crear un
estilo tan s&oacute;lo hay que marcar el  objeto que queremos utilizar
como modelo ( por ejemplo un p&aacute;rrafo)  y pulsar el bot&oacute;n
de creaci&oacute;n de estilo (localizado en la ventana de estilos <img src="../../common/images/figure32-12.gif" align="BOTTOM" height="23" width="24" border="0">), le  damos el  nombre que queramos  y ya  tenemos el estilo
creado.  A  partir de este  momento este nuevo estilo aparecer&aacute;
en la  ventana de estilos.  Es evidente  que con este m&eacute;todo de
trabajo   es   innecesario   el   bot&oacute;n   de    &quot;<B>copiar
estilo</B>&quot; de Word, si lo  pensamos con detenimiento llegamos  a
la conclusi&oacute;n que el bot&oacute;n  de copiar estilo que aparece
en  Word es  un parche  al  sistema  de estilos.  Modificar un  estilo
existente es igualmente sencillo, se selecciona el objeto que contiene
el conjunto de atributos deseados y pulsamos  sobre el bot&oacute;n de
actualizar estilo  (recuerda que si  lo quieres modificar es un estilo
de p&aacute;rrafo,  tendremos que tener seleccionado el s&iacute;mbolo
de final  de p&aacute;rrafo,<img src="../../common/images/figure32-13.gif" align="MIDDLE" height="22" width="17" border="0">, que  es el que contiene los
atributos del p&aacute;rrafo).</P>


<P>El  <B>navegador</B>   (<img src="../../common/images/figure32-14.gif" height="22" width="24" border="0">) es una  ventana   en la  que  aparecen
listados  todos los objetos que contiene  el  documento, agrupados por
clases:  Cabeceras,  tablas,  marcos, figuras,  objetos  OLE,  marcas,
secciones,  referencias bibliogr&aacute;ficas, enlaces, &iacute;ndices
y notas. Desde esta ventana  podemos &quot;navegar&quot; por el texto,
llevando el cursor a cualquiera de estos objetos.</P>

<P>La     combinaci&oacute;n del     <B>explorador</B>           (<img src="../../common/images/figure32-15.gif" align="MIDDLE" height="22" width="23" border="0">) y  el &quot;<B>beamer</B>&quot; (<img src="../../common/images/figure32-16.gif" align="MIDDLE" height="23" width="24" border="0">) nos
permite explorar     todos los   archivos del   disco,    incluida  la
galer&iacute;a   de  gr&aacute;ficos   que  incorpora  StarOffice,   e
insertarlos en nuestro documento con s&oacute;lo arrastrarlos desde la
ventana  del  &quot;beamer&quot;.    A las  carpetas que  inicialmente
aparecen en el explotador,  se le pueden a&ntilde;adir  (utilizando el
men&uacute; contextual) todos las carpetas  que contengan ficheros que
vayamos a necesitar.   Si  hemos olvidado el  nombre  del fichero,  el
explorador    tambi&eacute;n     incorpora     una    utilidad      de
b&uacute;squeda.</P>

<P>
<img src="../../common/images/figure32-17.gif" align="RIGHT" height="175" width="206" border="0">
Ya no tienes que preocuparte por trabajar con documentos grandes. Cada
cap&iacute;tulo se escribe en un  documento  independiente y luego  se
juntan todos los documentos en un <B>documento</B> <B>maestro</B>.  El
documento  maestro es   un tipo  especial   de documento  compuesto de
enlaces     a    los documentos      que    contienen los    distintos
cap&iacute;tulos.  Es en el   documento maestro  donde se  definen los
atributos  de  la p&aacute;gina  (encabezados, pies  de p&aacute;gina,
ancho y alto   de p&aacute;gina, etc.),   perdi&eacute;ndose cualquier
atributo   de       p&aacute;gina   que    tuvieran    los  documentos
independientes. Sobre el documento maestro se crean los &iacute;ndices
y tablas de  contenidos.  Como   ya es  costumbre en StarOffice,    se
dispone de una ventan con todas las herramientas necesarias para poder
&quot;navegar&quot; f&aacute;cilmente  por  todos  los  documentos que
componen      el  documento maestro. En   todo     momento tenemos una
visi&oacute;n completa del documento final.
</P>

<P>La forma  de trabajo es la siguiente:  se crea un documento maestro
nuevo, se  arrastra  cada uno   de  los documentos que  contienen  los
cap&iacute;tulos        desde    el     &quot;<B>beamer</B>&quot;   al
&quot;<B>navegador</B>&quot; luego se  insertan los &iacute;ndices, se
ajustan las  cabeceras  y n&uacute;meros  de p&aacute;gina  al gusto y
listo para  imprimir. Si en  el &uacute;ltimo momento queremos cambiar
alguna cosa s&oacute;lo  hay  que hacer  doble  click en el  navegador
sobre el documento  que queramos modificar  y  lo editamos  sobre otra
ventana distinta. Para poder unir  correctamente todos los  documentos
(por  ejemplo si queremos   a&ntilde;adir una p&aacute;gina  en blanco
entre  dos   cap&iacute;tulos)   podemos a&ntilde;adir    texto  en el
documento maestro.</P>




<A name="section8"></A>
<H3>Conclusiones</H3>



<P>Con el service  pack 3 se ha alcanzado  un nivel de  prestaciones y
robustez que  est&aacute; a la altura del  usuario de Linux m&aacute;s
exigente (usuarios que consider&aacute;n el bot&oacute;n de reset como
algo in&uacute;til).</P>

<P>En lo relativo a los   requisitos  hardware necesarios para   poder
ejecutar StarOffice,  no es un  programa especialmente peque&ntilde;o,
como podemos ver:</P>

<div>
<font size=-1>
<pre>
ps -m | grep soffice
PID TTY ...  TRS   DRS  SIZE  SWAP   RSS  SHRD   LIB  DT  COMMAND
...
302   1 ... 3248 32812 50064 14004 36060 18096     0 4460 soffice.bin 
</pre>
</font>
</div>
<P>el   &quot;programita&quot;  est&aacute;  consumiendo  50Mb.     Se
est&aacute; ejecutando sobre una m&aacute;quina con 64Mb.</P>

<P>En cuanto  a la  velocidad de  ejecuci&oacute;n, suponiendo que  se
dispone  de   suficiente memoria,  es  muy  r&aacute;pida.   Tanto las
operaciones   de  edici&oacute;n b&aacute;sica,  como  las operaciones
m&aacute;s complejas (trabajar con tablas, objetos, OLE, o moverse por
documentos grandes) se  pueden   realizar sin ning&uacute;n  tipo   de
retardo apreciable.  Donde s&iacute; que  obtiene un buen  rendimiento
es en velocidad de impresi&oacute;n, puede imprimir en cuesti&oacute;n
de segundos documentos de m&aacute;s de 100 p&aacute;ginas.</P>


<P>Quedan por presentar muchas otras funcionalidades del procesador de
textos de StarOffice, pero   creo el lector  se  puede hacer  una idea
bastante exacta de qu&eacute; es lo que puede esperar de esta suite.
</P>


<P>El  procesador de textos   de  StarOffice cubre  perfectamente  las
necesidades de edici&oacute;n de cualquier  usuario, e incluso  ofrece
algunas caracter&iacute;sticas DTP  (DeskTop Publishing). Gracias a la
capacidad  de importar y  exportar archivos  en varios formatos  (RTF,
HTML, Word6.0/95) se puede  realizar una migraci&oacute;n a esta suite
sin tener que perder documentos antiguos.  En las cuestiones relativas
al  manejo  del programa,  aspecto  del interfaz y funcionalidades que
implemanta  es comparable  a lo  que ofrece  el conocido MsWord97; por
otra parte (y por suerte) en lo relativo a  robustez y fiabilidad sale
gandando StarOffice.
</P>



<H3>Enlaces de interes:</H3>
<lu>
<li><a href="../May1998/article40.html">Primer número de la serie.</a>
<li>
StarDivision                                                        <a
href="http://www.stardivision.com">http://www.stardivision.com</a></li>
<li>
Caldera:                                                            <a
href="http://www.caldera.com">http://www.caldera.com</a></li>
</lu>

<font size=-3>
<p align=right>Las marcas son propiedad de sus respectivos propietarios</p></font>
<HR size="1" noshade>

<p align=right><i>Texto original en Castellano</i></P>



</TD>
</TR>
</TABLE>


<!-- ARTICLE FOOT -->
    <BR clear="all">
    <CENTER>
      <TABLE width="95%">
	
	<TR>
	  <TD align="center" bgcolor="#666666">
	    <FONT color="#ffffff">
	      P&aacute;ginas web mantenidas por Miguel &Aacute;ngel Sep&uacute;lveda<BR>
	      &copy; Ismael Ripoll  1998<BR>
	      <B>LinuxFocus 1998</B>
	    </FONT>
	  </TD>
	</TR>
	
      </TABLE>
    </CENTER>
    
    

</BODY>

</HTML>






