<HTML>
<HEAD>
<TITLE>Gu&iacute;a para los traductores de LinuxFocus</TITLE>
<HEAD>
  
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336699" vlink="#336633">
    
<!-- macro insert navigationbar -->
<MAP name="top">
  <AREA shape="rect" coords="367, 9, 418, 30" alt="Home" href="index.html">
  <AREA shape="rect" coords="423, 9, 457, 30" alt="Map" href="map.html">
  <AREA shape="rect" coords="463, 9, 508, 30" alt="Index" href="indice.html">
  <AREA shape="rect" coords="514, 9, 558, 30" alt="Search" href="Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78, 0, 163, 15"   alt="News" href="News/">
  <AREA shape="rect" coords="189, 0, 284, 15"  alt="Archives" href="Archives/">
  <AREA shape="rect" coords="319, 0,  395, 15" alt="Links" href="Links/">
  <AREA shape="rect" coords="436, 0,  523, 15" alt="About LF" href="aboutus.html">
</MAP>
<CENTER>
<IMG src="../common/images/Topbar-es.gif" width="600" height="40" border="0"  ismap usemap="#top"><BR>
<IMG src="../common/images/Bottombar-es.gif" width="600" height="21" border="0"  ismap usemap="#bottom"><BR>
</CENTER>



<p>
<font size="+1">
Para facilitar la tarea de traducci&oacute;n de los art&iacute;culos
publicados en  Linux<font   color=red>Focus</font>, hemos elaborado esta
lista con algunas gu&iacute;as b&aacute;sicas para hacer la traducci&oacute;n.
</font>
</p>

<p><font size="+1">
En general, se deben seguir algunos de los mismos criterios recomendados para
los autores, con algu&ntilde;os a&ntilde;adidos. Abajo vamos a tratar de resumir todos
los consejos que debe tener en cuenta un traductor.
</font></p>
<p width="80%">
<FONT color="#666666" size="5">Guías para los Traductores</FONT>
<ul>
<li>La traduccion, al igual que el original, debe estar en HTML (salvo que se
indique expresamente lo contrario). Conviene tambi&eacute;n usar un editor lo
m&aacute;s simple posible, para que el resultado sea f&aacute;cil de procesar
posteriormente (aunque hasta ahora no hemos encontrado problemas importantes).

<li>La traducci&oacute;n debe ajustarse tambien al metaformato de Linux<font color=#ff0000>Focus</font>. Para
ello, lo m&aacute;s pr&aacute;ctico es traducir sobre el mismo art&iacute;culo
original (ya en metaformato). En general, el metaformato del idioma original
podr&aacute; descargarse de la revista, pero no dudes en
<A HREF="mailto:javier.pb@linuxfocus.org">contactar con el editor</A>
si tienes algun problema.

<li>S&oacute;lo se deben traducir los contenidos del art&iacute;culo, correspondientes a
los campos indicados mas abajo. En particular, las definiciones de los
<i>tags</i> y los enlaces a im&aacute;genes, deben dejarse como est&aacute;n.<br>
<FONT SIZE="-1">En caso de que los enlaces a las im&aacute;genes se modifiquen para
poder verlas mientras se realiza la traducci&oacute;n, es conveniente colocarlas
todas en un mismo subdirectorio</FONT>

<li>Los campos del metaformato que deben ser traducidos son: AboutTheAuthor,
Abstract y ArticleBody, pero nuevamente, s&oacute;lo el contenido. El t&iacute;tulo del
art&iacute;culo tambien debe traducirse, manteni&eacute;ndolo con un nivel 1 de cabecera
(&lt;h1&gt;...&lt;/h1&gt;)

<li>Se debe a&ntilde;adir una entrada al campo
TranslationInfo (sin modificar el texto existente), en la forma<BR>
<tt>en to es &lt;A HREF="mailto:traductor@email"&gt;Nombre del Traductor&lt;/A&gt;</tt></BR>
<FONT SIZE="-1">Si el original no esta en ingl&eacute;s, la entrada ser&iacute;a
fr to es, etc.</FONT>

<li>En cuanto a la calidad de la traducci&oacute;n, la m&aacute;xima a seguir
es que sea comprensible. Intenta evitar traducciones literales, y cambia cuantos
elementos creas necesario (verbos, sustantivos, ...) para hacer el texto comprensible.
Se pretende que las traducciones de los art&iacute;culos sean &uacute;tiles y
no acad&eacute;micas. Pero intentando siempre escribir lo m&aacute;s correctamente
posible. En particular, la <a href="http://www.insflug.org/colaboracion/estilo">Gu&iacute;a
de Estilo</A> del <A HREF="http://www.inslfug.org/">INSFLUG</A>, y su
<A HREF="http://www.insflug.org/colaboracion/recursos/glosario/">glosario</A>
pueden resultar de bastante ayuda.

<li>Se debe respetar al m&aacute;ximo el trabajo del autor, en cuanto a colores,
&eacute;nfasis, secciones, etc. Tan s&oacute;lo en aquellos casos en que el 
traductor crea que se puede mejorar la comprensi&oacute;n resaltando algun
elemento (por ejemplo, subrayado o negrita) se deben hacer cambios, consultando
siempre al editor, e informando al autor si los cambios son importantes.

<li>Y sobre todo, se pide acelerar al m&aacute;ximo el proceso de
traducci&oacute;n. Si en alg&uacute;n momento tienes que detener la traducci&oacute;n
por cualquier motivo, contacta con el editor, y env&iacute;ale el trabajo que
tengas hecho. A veces sucede que otro colaborador s&iacute; dispone del tiempo
necesario y el art&iacute;culo se puede traducir con mayor rapidez. 
</ul> 

<hr size=2 noshade>
<center>
<TABLE width="95%">
<TR><TD bgcolor="#666666" align=center>
<FONT face="Helvetica,Arial" color="#FFFFFF">
<b>Páginas web mantenidas por el equipo editorial de LinuxFocus</a></b><br>
<a href="../common/lfteam.html"><font color="#ffffff">Contactar con el equipo de LinuxFocus</a></font><BR>
</TD></TR>
</TABLE>
</center>
</BODY>
</HTML>
