<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE> C&oacute;mo pasar de DOS/Windows a Linux: ¿Qu&eacute; pasa con Windows?</TITLE>
 <LINK HREF="Dos-Win-Linux-Como-8.html" REL=next>
 <LINK HREF="Dos-Win-Linux-Como-6.html" REL=previous>
 <LINK HREF="Dos-Win-Linux-Como.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="Dos-Win-Linux-Como-8.html">Página siguiente</A>
<A HREF="Dos-Win-Linux-Como-6.html">Página anterior</A>
<A HREF="Dos-Win-Linux-Como.html#toc7">Índice general</A>
<HR>
<H2><A NAME="s7">7. ¿Qu&eacute; pasa con Windows?</A></H2>

<P>
<P>El «equivalente» a Windows es el sistema gr&aacute;fico X Window, o X11, para
abreviar. Al contrario que Windows o el Mac, X11 no fue dise&ntilde;ado para
facilitar el uso o para lograr una mejor apariencia, sino para
proporcionar utilidades gr&aacute;ficas a las estaciones de trabajo UNIX. Estas
son las principales diferencias:
<P>
<UL>
<LI>Mientras que la apariencia y comportamiento de Windows es similar
en todo el mundo, en X11 esto no es as&iacute;: es mucho m&aacute;s configurable. La
apariencia general de X11 est&aacute; encomendada a un programa clave llamado
«gestor de ventanas» (window manager), del cual hay una amplia oferta
entre la que escoger: <CODE>fvwm</CODE>, basico pero agradable y eficiente con
el consumo de memoria, <CODE>fvwm2-95</CODE>, <CODE>Afterstep</CODE>, <CODE>WindowMaker</CODE>,
<CODE>Enlightenment</CODE>, y muchos m&aacute;s. El gestor de ventanas es normalmente
llamado por un fichero denominado <CODE>.xinitrc</CODE>;
</LI>
<LI>Su gestor de ventanas puede ser configurado de manera que las
ventanas act&uacute;en como en Windows: si usted hace click en ella, viene al
primer plano. Otra posibilidad es que venga al primer plano si el puntero
del rat&oacute;n est&aacute; sobre ella («focus»). Tambi&eacute;n, el lugar de emplazamiento de
las ventanas en la pantalla puede ser autom&aacute;tico o interactivo: si un
marco extra&ntilde;o aparece en lugar de su programa, haga click con el bot&oacute;n
izquierdo del rat&oacute;n donde quiera que aparezca;
</LI>
<LI>La mayor parte de las acciones pueden configurarse editando uno o
m&aacute;s ficheros de configuraci&oacute;n. Lea la documentaci&oacute;n de su gestor de
ventanas; el archivo de configuraci&oacute;n puede ser <CODE>.fvwmrc</CODE>,
<CODE>.fvwm2rc95</CODE>, <CODE>.steprc</CODE>, etc. Un fichero ejemplo de configuraci&oacute;n
suele encontrarse en
<CODE>/etc/X11/nombre-de-gestor-de-ventanas/system.nombre-gestor-ventanas</CODE>;
</LI>
<LI>Las aplicaciones X11 se escriben empleando unas bibliotecas
especiales (<I>widget sets</I>); como hay muchas disponibles, las aplicaciones
tienen aspectos distintos. Las m&aacute;s b&aacute;sicas son aquellas que usan los
controles (widgets) Athena (con aspecto 2D; <CODE>xdvi</CODE>, <CODE>xman</CODE>,
<CODE>xcalc</CODE>); otras usan Motif (<CODE>netscape</CODE>), otras a&uacute;n usan Tcl/Tk,
Xforms, Qt, Gtk, y otra m&aacute;s. Casi todas esas bibliotecas dan el mismo
aspecto y comportamiento que Windows;
</LI>
<LI>La manera de comportarse, desafortunadamente, puede no ser
coherente. Por ejemplo, si selecciona una l&iacute;nea de texto utilizando el
rat&oacute;n y pulsa &lt;RETROCEDER&gt;, esperar&aacute; que la l&iacute;nea desaparezca,
¿verdad? Esto no sucede con aplicaciones basadas en Athena, pero sucede
con aplicaciones basadas en otros controles;
</LI>
<LI>El c&oacute;mo funcionen las barras de desplazamiento y el cambio de
tama&ntilde;o depender&aacute; del gestor de ventanas y el juego de widgets. Pista: si
se encuentra con que las barras de desplazamiento no se comportan como
usted esperaba, utilice el bot&oacute;n central o los dos botones juntos para
moverla;
</LI>
<LI>Las aplicaciones no tienen un icono por defecto, pero pueden tener
muchos. La mayor parte de los gestores de ventanas proporcionan un menu
al que se tiene acceso haciendo click en el escritorio («ventana ra&iacute;z»);
no har&aacute; falta decir que el men&uacute; puede ser configurado. Para cambiar la
apariencia de la ventana ra&iacute;z, utilice <CODE>xsetroot</CODE> o <CODE>xloadimage</CODE>;
</LI>
<LI>El portapapeles s&oacute;lo puede contener texto, y se comporta de manera
extra&ntilde;a. Cada vez que selecciona texto, se copia autom&aacute;ticamente al
portapapeles: vaya a cualquier sitio y pulse en bot&oacute;n central del rat&oacute;n
para pegarlo. Hay una aplicaci&oacute;n, <CODE>xclipboard</CODE>, que proporciona varios
portapapeles;
</LI>
<LI>Arrastrar y soltar es una opci&oacute;n, y est&aacute; disponible solamente si
usted utiliza aplicaciones X11 que la permitan.
</LI>
</UL>
<P>Para ahorrar memoria, uno deber&iacute;a utilizar aplicaciones que usaran las
mismas bibliotecas, pero esto es dif&iacute;cil de hacer en la pr&aacute;ctica.
<P>Hay proyectos que pretenden hacer que X11 tenga una apariencia y
comportamiento tan coherente como Windows. Gnome,
<CODE>
<A HREF="http://www.gnome.org">http://www.gnome.org</A></CODE>
y KDE, <CODE>
<A HREF="www.kde.org">www.kde.org</A></CODE> son un
ejemplo. Pru&eacute;belos: no echar&aacute; de menos su escritorio Windows nunca m&aacute;s.
<P>
<HR>
<A HREF="Dos-Win-Linux-Como-8.html">Página siguiente</A>
<A HREF="Dos-Win-Linux-Como-6.html">Página anterior</A>
<A HREF="Dos-Win-Linux-Como.html#toc7">Índice general</A>
</BODY>
</HTML>
