<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE> C&oacute;mo pasar de DOS/Windows a Linux: Fin, por ahora</TITLE>
 <LINK HREF="Dos-Win-Linux-Como-14.html" REL=next>
 <LINK HREF="Dos-Win-Linux-Como-12.html" REL=previous>
 <LINK HREF="Dos-Win-Linux-Como.html#toc13" REL=contents>
</HEAD>
<BODY>
<A HREF="Dos-Win-Linux-Como-14.html">Página siguiente</A>
<A HREF="Dos-Win-Linux-Como-12.html">Página anterior</A>
<A HREF="Dos-Win-Linux-Como.html#toc13">Índice general</A>
<HR>
<H2><A NAME="s13">13. Fin, por ahora</A></H2>

<P>¡Felicidades! Se ha iniciado un poco en el UNIX y est&aacute; preparado para
comenzar a trabajar. Recuerde que su conocimiento del sistema es a&uacute;n
limitado, y que se espera que practique m&aacute;s con Linux para usarlo
c&oacute;modamente. Pero si todo lo que quer&iacute;a hacer era conseguir un pu&ntilde;ado de
aplicaciones y empezar a trabajar con ellas, apuesto a que lo que se
incluy&oacute; aqu&iacute; fue suficiente. 
<P>Estoy seguro de que habr&aacute; disfrutado de usar Linux y seguir&aacute; aprendiendo
m&aacute;s acerca de &eacute;l (todo el mundo lo hace). ¡Apuesto lo que sea,
tambi&eacute;n, a que nunca volver&aacute; a DOSWin! Espero haberme hecho entender y
haber realizado un buen servicio a mis 3 o 4 lectores.
<P>
<H2><A NAME="ss13.1">13.1 Copyright</A>
</H2>

<P>A menos que se establezca lo contrario, los documentos COMO de Linux
tienen copyright de sus respectivos autores. Los documentos COMO de Linux
pueden ser reproducidos y distribuidos de manera completa o en parte, en
cualquier medio f&iacute;sico o electr&oacute;nico, siempre y cuando este aviso de
copyright se mantenga en todas las copias. Se permite y se anima a la
redistribuci&oacute;n comercial; sin embargo, al autor le gustar&iacute;a ser notificado
de cualquier distribuci&oacute;n. 
<P>Todas las traducciones, trabajos derivados o agregados que incorporen
cualquier documento COMO de Linux deben ser mantenidos bajo este aviso de
Copyright. Esto es, no puede producir un trabajo derivado de un documento
COMO e imponer restricciones adicionales a su distribuci&oacute;n. Se pueden
conceder excepciones a estas reglas bajo ciertas condiciones;  por favor,
contacte con el coordinador de los COMO de Linux en la direcci&oacute;n dada m&aacute;s
abajo. 
<P>En resumen, deseamos promocionar la dispersi&oacute;n de esta informaci&oacute;n a
trav&eacute;s de cuantos canales sea posible. Sin embargo, deseamos retener el
copyright de los documentos COMO, y nos gustar&iacute;a tener noticias de
cualquier plan de redistribuir los COMOs. 
<P>Si tiene dudas, contacte con Tim Bynum, el coordinador de Linux HOWTO,
en <CODE>
<A HREF="linux-howto@sunsite.unc.edu">linux-howto@sunsite.unc.edu</A></CODE> v&iacute;a e-mail.
<P>
<P>
<H2><A NAME="ss13.2">13.2 Agradecimientos</A>
</H2>

<P>
<P>"C&Oacute;MO pasar de DOS a Linux" fue escrito por Guido Gonzato, <CODE>
<A HREF="BORREMEguido@ibogeo.df.unibo.it">BORREMEguido@ibogeo.df.unibo.it</A></CODE> (Borre el «BORREME»).  Muchas
gracias a Matt Welsh, el autor de <I>Linux: Instalaci&oacute;n y Primeros Pasos</I>, a
Ian Jackson, el autor del <I>Linux frequently asked questions with answers</I>,
a Giuseppe Zanetti, el autor de <I>Linux</I>, a todos los amigos que me enviaron
sugerencias, y especialmente a Linus Torvalds y GNU que nos trajeron Linux. 
<P>Este documento se distribuye «tal cual». He puesto un gran esfuerzo en
escribirlo tan correctamente como he podido. Pese a ello, la informaci&oacute;n
contenida en el mismo debe ser utilizada bajo su propia responsabilidad. 
En ning&uacute;n caso el autor ser&aacute; responsable de cualquier da&ntilde;o resultante del
uso de este documento. 
<P>Los comentarios son bienvenidos. Para cualquier duda, sugerencia, cr&iacute;tica,
etc., si&eacute;ntase libre de contactar conmigo. 
<P>Disfrute de Linux y de la vida,
<P>Guido   <CODE>=8-)</CODE>                                    
<P>
<P>
<H2><A NAME="ss13.3">13.3 Traducci&oacute;n</A>
</H2>

<P>
<P>«C&Oacute;MO pasar de DOS/Win a LINUX» fue traducido por David Mar&iacute;n Carre&ntilde;o,
<CODE>
<A HREF="mailto:davefx@bigfoot.com">davefx@bigfoot.com</A></CODE>,
como un peque&ntilde;o grano de arena m&aacute;s dentro del Proyecto INSFLUG. Para m&aacute;s
informaci&oacute;n, vea la secci&oacute;n 
<A HREF="Dos-Win-Linux-Como-14.html#Grupos">Grupos</A>
.
<P>He intentado una traducci&oacute;n fidedigna del documento original de Guido,
aunque en algunos lugares haya actualizado informaci&oacute;n o cambiado algunas
expresiones por otras m&aacute;s adecuadas a la jerga en nuestro idioma. 
<P>Si desea plantear alguna duda, sugerencia o cr&iacute;tica, pues tampoco dude en
contactar conmigo. 
<P>
<BLOCKQUOTE><CODE>
<PRE>
     |   |   |  _|   David Mar&iacute;n Carre&ntilde;o (aka DaveFX)
      \  |  /  /
       |/____\|      Estudiante de Ingenier&iacute;a en Inform&aacute;tica.
      /_|_/\_|_\     Traductor de documentos L&iacute;nux.
      \| (__) |/     Madrid. Espa&ntilde;a.
      / \____/ \
     (____  ____)    ICQ#: 34866516
     _____||_____    E-mail: &lt;davefx@bigfoot.com>
    /  _      _  \   WEb SiTe: http://www.bigfoot.com/~davefx
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>
<HR>
<A HREF="Dos-Win-Linux-Como-14.html">Página siguiente</A>
<A HREF="Dos-Win-Linux-Como-12.html">Página anterior</A>
<A HREF="Dos-Win-Linux-Como.html#toc13">Índice general</A>
</BODY>
</HTML>
