<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Una primera aproximaci&oacute;n empresarial al software libre.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-7.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-5.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-7.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-5.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc6">Índice general</A>
<HR>
<H2><A NAME="aproximacion"></A> <A NAME="s6">6. Una primera aproximaci&oacute;n empresarial al software libre.</A></H2>

<P>
<H2><A NAME="ss6.1">6.1 Resumen del cap&iacute;tulo.</A>
  </H2>

<P>
<UL>
<LI> Producto versus servicio.</LI>
<LI> Regalar software como estrategia de mercado.</LI>
<LI> Haciendo negocios con el software libre.</LI>
<LI> El papel del programador.</LI>
<LI> Por qu&eacute; algunas empresas apoyan al software libre.</LI>
</UL>
<P>La empresa, a la hora de acercarse al mundo del software libre se
plantea un enfoque radicalmente distinto al que la comunidad tiene de dicho
software. Cuando los condicionamientos econ&oacute;micos son el principal motor de
actuaci&oacute;n, es l&oacute;gico pensar que conceptos como altruismo, colaboraci&oacute;n,
af&aacute;n de compartir informaci&oacute;n, etc., se convierten en medios para conseguir
beneficio econ&oacute;mico, dejando de constituir un fin en si mismos.
<P>Vamos a introducir una serie de conceptos, relacionados con la
estrategia de la empresa que vive del software libre. Observaremos que en
muchas ocasiones, el software en si no es sino una excusa para el verdadero
negocio.
<P>
<H2><A NAME="ss6.2">6.2 La empresa que vende software.</A>
</H2>

<P>En primer lugar: el concepto de la venta de software de por si, deja
de tener sentido, dando paso a otras alternativas. El software deja de ser
un producto, sino que se convierte en un medio para vender otros productos.
Hablamos de los servicios de valor a&ntilde;adido en torno al software. Este concepto
-servicio versus producto- es una constante en todos los modelos empresariales
que utilizan software libre.
<P>Es una pr&aacute;ctica muy com&uacute;n pues, sin llegar al uso del software libre
el hecho de regalar el software, como estrategia de captaci&oacute;n de clientes, de
creaci&oacute;n de usuarios cautivos, y sobre todo, de crear necesidades alrededor
del software que se regala, como pueda ser documentaci&oacute;n, cursos, mantenimiento,
etc.
<P>Desde este planteamiento, se nos ofrecen dos alternativas: la empresa
que produce software libre, y la que utiliza el software libre para dar salida
a otros productos. Cada uno de estos modelos tiene diferente metodolog&iacute;a de 
trabajo, pero ambos viven del negocio que se genera alrededor de dicho software.
Veremos en un apartado posterior cu&aacute;l es el papel del programador en dicha
empresa y su metodolog&iacute;a de trabajo.
<P>Porque cuando los defensores de los derechos del programador, y del
software propietario dicen "¿y de qu&eacute; vamos a vivir los programadores?" 
estamos olvidando un detalle esencial: hoy en d&iacute;a, casi todos los programadores
trabajan al amparo de una empresa, y dada la competencia actual, el precio del
software tiene que ser rid&iacute;culamente bajo, o en muchos casos, nulo. El 
programador vive del sueldo de su empresa, y &eacute;sta vive casi siempre de
productos y servicios desarrollados en torno al software, no del software en
si. Incluso los grandes del software, como Microsoft, Corel, etc., obtienen
la mayor parte de sus ingresos por medios colaterales, como son los cursos , 
la venta de documentaci&oacute;n, la publicidad de sus portales de Internet, o bien
de acuerdos con fabricantes de hardware. La pirater&iacute;a del software es incluso
tolerada -cuando no potenciada- en aras de conseguir mercados cautivos o 
nuevos usuarios.
<P>En &eacute;ste entorno, s&oacute;lo el software "a medida" puede ser considerado
como un producto por si mismo, y -en opini&oacute;n del autor- el &uacute;nico por el que
se debe cobrar un precio mayor que el meramente simb&oacute;lico.
<P>Por todo ello no es de extra&ntilde;ar el apoyo de muchas empresas al
software libre: puesto que el beneficio que se va a sacar del software es
casi nulo, es preferible destinar esfuerzos a otros menesteres m&aacute;s beneficiosos.
Este apoyo puede realizarse de m&uacute;ltiples maneras, bien colaborando con alg&uacute;n
proyecto, directamente o mediante financiaci&oacute;n, bien creando servicios de
valor a&ntilde;adido entorno a un proyecto de software libre. Otras veces el m&eacute;todo
consiste en la utilizaci&oacute;n pura y dura del software libre.
<P>A continuaci&oacute;n mostraremos los detalles de funcionamiento y gesti&oacute;n de
una empresa que utiliza -o produce- software libre.
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-7.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-5.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc6">Índice general</A>
</BODY>
</HTML>
