<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Copyright. Licencia de uso.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-3.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-1.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-3.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-1.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc2">Índice general</A>
<HR>
<H2><A NAME="copyright"></A> <A NAME="s2">2. Copyright. Licencia de uso.</A></H2>

<P>
<P>
<H2><A NAME="ss2.1">2.1 Nota del autor.</A>
</H2>

<P>Cuando me plante&eacute; el escribir este ensayo, la
primera idea fue el ponerlo bajo licencia GPL. Desgraciadamente
mientras desarrollaba los diversos apartados me hice plenamente 
consciente del problema que existe en la actualidad con el tema de
la "documentaci&oacute;n libre", as&iacute; como de las discusiones que existen
en estos momentos en Internet acerca de un modelo de licencia
abierta para la documentaci&oacute;n. En el texto del ensayo, describo
esta problem&aacute;tica y las soluciones propuestas.
<P>Del mismo modo el primer borrador inclu&iacute;a una cl&aacute;usula
para evitar la distribuci&oacute;n impresa. La idea original era poder editar
el ensayo en alguna editorial. Como m&aacute;s de uno me ha hecho ver, este 
modelo no es -al menos por ahora- realista, y constituye una violaci&oacute;n
al esp&iacute;ritu del software libre, por lo que he decidido adoptar una licencia
m&aacute;s acorde con dicho modelo.
<P>La Open Resources Magazine License que a continuaci&oacute;n incluyo
puede ser obtenida de 
<CODE>
<A HREF="http://www.openresources.com/magazine/license/index.html">http://www.openresources.com/magazine/license/index.html</A></CODE>.
<P><EM>Este documento es Copyright (C) 1999 de <B>Juan Antonio Mart&iacute;nez Casta&ntilde;o.</B>
Se distribuye bajo los siguientes t&eacute;rminos:</EM>
<P>
<H2><A NAME="ss2.2">2.2 Open Resources Magazine License.</A>
</H2>

<P>
<P>This document may be freely read, stored, reproduced, disseminated, translated 
or quoted by any means and on any medium provided the following conditions 
are met:
<P>
<OL>
<LI> Every reader or user of this document acknowledges that is aware that no 
guarantee is given regarding its contents, on any account, and specifically 
concerning veracity, accuracy and fitness for any purpose.
</LI>
<LI> No modification is made other than cosmetic, change of representation 
format, translation, correction of obvious syntactic errors, or as permitted 
by the clauses below.
</LI>
<LI> Comments and other additions may be inserted, provided they clearly 
appear as such; translations or fragments must clearly refer to an original 
complete version, pr eferably one that is easily accessed whenever possible.
</LI>
<LI> Translations, comments and other additions or modifications must be 
dated and their author(s) must be identifiable (possibly via an alias).
</LI>
<LI> This licence is preserved and applies to the whole document with 
modifications and additions (except for brief quotes), independently of 
the representation format.
</LI>
<LI> Any reference to the "official version", "original version" or "how to 
obtain original versions" of the document is preserved verbatim. Any copyright 
notice in the document is preserved verbatim. Also, the title and author(s) 
of the original document should be clearly mentioned as such.
</LI>
<LI> In the case of translations, verbatim sentences mentioned in (6.) are 
preserved in the language of the original document accompanied by verbatim 
translations to the language of the traslated document. All translations 
state clearly that the author is not responsible for the translated work. 
This license is included, at least in the language in which it is referenced 
in the original version.
</LI>
<LI> Whatever the mode of storage, reproduction or dissemination, anyone 
able to access a digitized version of this document must be able to make a 
digitized copy in a format directly usable, and if possible editable, 
according to accepted, and publicly documented, public standards.
</LI>
<LI> Redistributing this document to a third party requires simultaneous 
redistribution of this licence, without modification, and in particular 
without any further condition or restriction, expressed or implied, related 
or not to this redistribution. In particular, in case of inclusion in a 
database or collection, the owner or the manager of the database or the 
collection renounces any right related to this inclusion and concerning the 
possible uses of the document after extraction from the database or the 
collection, whether al one or in relation with other documents.
</LI>
</OL>

Any incompatibility of the above clauses with legal, contractual or 
judiciary decisions or constraints implies a corresponding limitation 
of reading, usage, or redistribution rights for this document, 
verbatim or modified.
<P>
<H2><A NAME="ss2.3">2.3 Open Resources Magazine License ( Traducci&oacute;n ).</A>
</H2>

<P>
<P>Traducido por Juan Antonio Mart&iacute;nez 
<CODE>
<A HREF="mailto:jantonio@dit.upm.es">&lt;jantonio@dit.upm.es></A></CODE>
24-Marzo-1999
<P>Acorde con los t&eacute;rminos de la licencia, el autor de la traducci&oacute;n hace 
constar que &eacute;sta tiene s&oacute;lo valor orientativo, y en ning&uacute;n caso legal, 
declinando el autor de la traducci&oacute;n toda responsabilidad derivada de su uso.
<P>El autor de la licencia original no se hace responsable de los actos derivados 
de una posible traducci&oacute;n o interpretaci&oacute;n incorrecta, siendo la licencia
original la &uacute;nica referencia v&aacute;lida a efectos legales o de copyright.
<P>( Comienzo de la traducci&oacute;n )
<P>Este documento puede ser libremente le&iacute;do, almacenado, reproducido,
distribuido, traducido o mencionado, de cualquier manera y mediante cualquier
m&eacute;todo, siempre que se cumplan las siguientes cl&aacute;usulas:
<P>
<OL>
<LI> El usuario o lector de este documento conoce y comprende la advertencia
de que no se proporciona garant&iacute;a alguna sobre su contenido en ninguno de
sus puntos, acerca de su veracidad, precisi&oacute;n, y completitud referida a
cualquier uso que se haga de este documento.
</LI>
<LI> No se autoriza ninguna otra modificaci&oacute;n al documento que no sea de
aspecto, cambio de formato de representaci&oacute;n, traducci&oacute;n, correcci&oacute;n de 
errores sint&aacute;cticos evidentes, o aquellas permitidas por las siguientes 
cl&aacute;usulas:
</LI>
<LI> Se permite la inclusi&oacute;n de comentarios, o a&ntilde;adidos, bien entendido que
deben estar claramente marcados y definidos como tales. Las traducciones
y fragmentos del texto deben ir acompa&ntilde;adas de una referencia a una
versi&oacute;n original completa, preferiblemente una cuyo acceso en cualquier
momento sea sencillo.
</LI>
<LI> Las traducciones, comentarios, y otras adicciones o modificaciones, deben
ir acompa&ntilde;adas de una indicaci&oacute;n de la fecha y de una identificaci&oacute;n del
autor. Se permite el uso de seud&oacute;nimos.
</LI>
<LI> Esta licencia es de aplicaci&oacute;n al documento completo, incluyendo 
modificaciones y a&ntilde;adidos ( salvo notas breves ), con independencia del
formato de representaci&oacute;n.
</LI>
<LI> Cualquier referencia a la "versi&oacute;n oficial", "versi&oacute;n original", o "c&oacute;mo
obtener la versi&oacute;n original" de este documento deben conservarse literalmente.
Cualquier nota de Copyright debe mantenerse literal. Adem&aacute;s, el t&iacute;tulo y
autor o autores del documento original, deben ser citados y marcados 
claramente como tales.
</LI>
<LI> En el caso de traducciones, los p&aacute;rrafos literales mencionados en (6.)
deben ser conservados en el lenguaje del documento original, acompa&ntilde;ados 
de una traducci&oacute;n literal del documento al lenguaje de la traducci&oacute;n. Todas
las traducciones deben marcar claramente que el autor no es responsable del
trabajo traducido. Esta licencia debe ser incluida al menos en el lenguaje
en que se cre&oacute; en el documento original.
</LI>
<LI> Con independencia del m&eacute;todo de almacenamiento, recuperaci&oacute;n o 
redistribuci&oacute;n, cualquiera que sea capaz de acceder a una versi&oacute;n 
digital de este documento, debe a su vez poder ser capaz de realizar una
copia digital en un formato directamente utilizable, y si es posible 
editable, de acuerdo a est&aacute;ndares p&uacute;blicos aceptados y documentados.
</LI>
<LI> La redistribuci&oacute;n de este documento a terceras partes, requiere que
se redistribuya conjuntamente con esta licencia, sin modificaci&oacute;n, y en
particular sin ninguna otra condici&oacute;n o restricci&oacute;n, expresada o impl&iacute;cita,
relacionada o no con esta redistribuci&oacute;n. En particular, para el caso de
su inclusi&oacute;n en una base de datos o recopilaci&oacute;n, el propietario o el
gestor de la base de datos o recopilaci&oacute;n, renuncia a cualquier derecho 
relacionado con esta inclusi&oacute;n y concerniente a posibles usos del documento
una vez extra&iacute;do de la base de datos o recopilaci&oacute;n, bien de manera individual
o en relaci&oacute;n con otros documentos.
</LI>
</OL>
<P>Cualquier incompatibilidad de las cl&aacute;usulas anteriores con leyes,
contratos, o sentencias judiciales, implica la correspondiente limitaci&oacute;n de
los derechos de lectura, uso o redistribuci&oacute;n de este documento, tanto en
su versi&oacute;n original como en versiones modificadas.
<P>( Fin de la traducci&oacute;n )
<P>
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-3.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-1.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc2">Índice general</A>
</BODY>
</HTML>
