<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: La empresa basada en software libre.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-8.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-6.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-8.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-6.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc7">Índice general</A>
<HR>
<H2><A NAME="empresa"></A> <A NAME="s7">7. La empresa basada en software libre.</A></H2>

<P>
<H2><A NAME="ss7.1">7.1 Resumen del cap&iacute;tulo.</A>
      </H2>

<P>
<UL>
<LI> Estrategias de desarrollo.
<UL>
<LI> Esponsorizaci&oacute;n.</LI>
<LI> Apadrinamiento.</LI>
<LI> Captura de cerebros.</LI>
<LI> Servicios de valor a&ntilde;adido.</LI>
<LI> Que debe ser libre y que debe ser "de pago".</LI>
</UL>
</LI>
<LI> Modelo de desarrollo.
<UL>
<LI> La pir&aacute;mide de desarrollo.</LI>
<LI> Estrategias de desarrollo.</LI>
<LI> Marketing y "venta" del software libre.</LI>
</UL>
</LI>
<LI> Estructura y organizaci&oacute;n.
<UL>
<LI> Gesti&oacute;n de recursos humanos.</LI>
<LI> Gesti&oacute;n de recursos materiales.</LI>
<LI> Gesti&oacute;n de servidores de informaci&oacute;n.</LI>
</UL>
</LI>
</UL>
<P>Una vez sentadas las bases, vamos a pasar a describir el funcionamiento
de una empresa orientada al software libre. Aunque, como hemos visto esto puede
referirse tanto a que produce software libre como a que basa su actividad en
acciones desarrolladas alrededor del software libre, vamos a centrarnos sobre
todo en el primer caso, pues la mayor parte de lo que se exponga ser&aacute; de 
aplicaci&oacute;n a los dos modelos.
<P>
<H2><A NAME="ss7.2">7.2 Modelo de desarrollo.</A>
</H2>

<P>Cuando una empresa se dispone a trabajar en torno al software libre,
debe ser consciente de las consecuencias, tanto a nivel organizativo, como de
metodolog&iacute;a de trabajo, que debe asumir y hacer suyas. La primera , y principal
es la de adaptar el modelo de trabajo de sus programadores al modelo de
software libre.
<P>
<H3>Estrategias de desarrollo.</H3>

<P>
<P>Pues el software libre ofrece un modelo de desarrollo contrapuesto al
del software tradicional: los conceptos de planificaci&oacute;n de trabajos, 
reparto de tareas, integraci&oacute;n, paso a producci&oacute;n, etc., difieren grandemente
del modelo de una empresa cerrada, debido a multitud de factores:
<UL>
<LI> Puesto que el desarrollo es p&uacute;blico, las tareas de depuraci&oacute;n y
publicaci&oacute;n de versiones se deben efectuar en paralelo con las
tareas de desarrollo.</LI>
<LI> Se deben habilitar canales de comunicaci&oacute;n con los 
desarrolladores, establecer una pol&iacute;tica de distribuci&oacute;n de versiones, 
y un sistema de feed-back desde Internet a la empresa.</LI>
<LI> Hay que estar abierto a la posibilidad de que en funci&oacute;n de las
demandas de Internet, el desarrollo original pueda sufrir cambios 
dr&aacute;sticos.</LI>
</UL>
<P>Todas las fases de desarrollo del software libre est&aacute;n descritas y
documentadas en el art&iacute;culo "la catedral y el bazar" de Eric S. Raymond, por
lo que no nos vamos a detener en exceso aqu&iacute;. Simplemente haremos algunas
anotaciones:
<P>
<DL>
<DT><B>El "bazar" es un sue&ntilde;o imposible...</B><DD><P>Si bien el modelo bazar funciona aceptablemente bien en entornos no
empresariales, una empresa no puede dejar al azar el desarrollo y evoluci&oacute;n
de su software. Deber&aacute; permitir flexibilidad, nuevas prestaciones, incluso
reestructuraci&oacute;n completa del desarrollo, pero siempre debe hacer que el
proyecto est&eacute; dirigido a sus intereses. Por ello el modelo bazar "puro" no 
es aceptable, sino que el grupo de desarrolladores de la empresa debe asumir
las funciones de un "supervisor de proyecto".
<P>
<DT><B>"Cambio programador por analista de sistemas".</B><DD><P>Vamos a hacer un alto en este punto. Aunque casi todas los art&iacute;culos
existentes hablan sobre la libertad y aleatoriedad de los desarrollos de 
software libre, lo cierto es que siempre hay detr&aacute;s una mente que es capaz de
coordinar y dirigir el proyecto a buen puerto. En muchas ocasiones no es sino
el autor del programa original quien asume la labor de "director espiritual".
En otros casos, es un consorcio, o una "junta directiva" quien decide la
evoluci&oacute;n del software. Es dif&iacute;cil que un director de proyecto "autom&aacute;tico",
tipo CVS pueda "atraer" suficientes adeptos como para poder hablar de un
modelo bazar puro y duro. Por contra, la figura del coordinador, acaba siendo
fundamental, y en un modelo empresarial es condici&oacute;n imprescindible para que
el proyecto llegue a buen puerto.
<P>Desde este punto de vista, el papel de los programadores en la empresa
pasa a ser el de coordinadores, cre&aacute;ndose de hecho una "junta directiva" que
se organiza el trabajo. Dicho trabajo ya no es el habitual de un grupo cerrado
de desarrollo software, sino un trabajo orientado al nuevo modelo. As&iacute; tenemos
las siguientes tareas:
<UL>
<LI> Integraci&oacute;n.</LI>
<LI> Comunicaci&oacute;n.</LI>
<LI> Control de versiones.</LI>
<LI> Documentaci&oacute;n.</LI>
<LI> Servicios de valor a&ntilde;adido.</LI>
<LI> Relaciones publicas y marketing.</LI>
<LI> Sistemas de informaci&oacute;n.</LI>
</UL>
<P>Como se puede ver, las tareas de programaci&oacute;n y depuraci&oacute;n son delegadas
a la actividad en la red, dej&aacute;ndose para el grupo de desarrollo los temas 
relacionados con la coordinaci&oacute;n y distribuci&oacute;n. En un apartado posterior
describimos el perfil y los roles del grupo de desarrolladores de la empresa.
<P>
<DT><B>Canales de distribuci&oacute;n.</B><DD><P>Es evidente para el lector que esta organizaci&oacute;n depende fuertemente
de los canales de comunicaci&oacute;n de la empresa con los dem&aacute;s participantes de la
cadena. Una empresa cuya conexi&oacute;n a Internet sea pobre, o que no sepa aprovechar
los recursos de la red, mas vale que se dedique a otra cosa....
<P>Porque el software libre vive por, para y de Internet. Es preciso 
garantizar que los usuarios y colaboradores est&aacute;n informados, que el servidor
web y ftp funcionan. El responsable de comunicaci&oacute;n deber&aacute; dedicarse casi por
entero a garantizar que todo lo relacionado con el software llegue hasta el
&uacute;ltimo servidor de correo existente. Es intolerable el menor fallo en la
cadena de comunicaci&oacute;n, pues la vida misma del proyecto depende de ella.
<P>Del mismo modo, el responsable de marketing har&aacute; lo imposible por que el
proyecto sea conocido: sabe manejar los portales y los canales de anuncio de 
noticias, mantendr&aacute; permanentemente actualizada la p&aacute;gina web... como veremos
posteriormente, dicha p&aacute;gina puede convertirse en una de las principales 
fuentes de ingresos de la empresa.
<P>
<DT><B>Estrategias de captaci&oacute;n de voluntarios.</B><DD><P>Para que un proyecto de software libre llegue a buen puerto, hace
falta otro componente fundamental: los usuarios y voluntarios para el 
desarrollo. Es necesario que la empresa llegue a tener un plantel de 
colaboradores suficiente para poder llevar a buen puerto el proyecto.
Existen diversas estrategias de captaci&oacute;n de voluntarios, pero
se pueden resumir en breves frases:
<UL>
<LI> El producto ofertado debe ser &uacute;til, y cubrir las necesidades de
los usuarios. Esto que parece obvio, es frecuentemente olvidado, y
dada la fuerte "selecci&oacute;n natural" que se lleva a cabo en Internet, 
a menos que sea algo necesario, r&aacute;pidamente estar&aacute; condenado al olvido.</LI>
<LI> Se debe partir de algo suficientemente atractivo como para que 
aquellas personas interesadas tengan algo a lo que acogerse. No vale
de nada un mensaje de "busco interesados en realizar XXXX", sino que
hay que decir "He hecho XXXX, y me gustar&iacute;a que alguien lo probara".
Muy pocos proyectos de software libre nacen "de la nada", sino que
siempre hay alguien que realiza el desarrollo inicial.</LI>
<LI> Hay que utilizar sin compasi&oacute;n t&eacute;cnicas de habilidades sociales,
relaciones p&uacute;blicas , etc., con tal de mantener el inter&eacute;s del 
colaborador. Es necesario crear una identificaci&oacute;n del voluntario con
el proyecto, o de lo contrario se acabara como una "beta 0.9" mas
de las que tanto abundan en la red. En el cap&iacute;tulo dedicado al
"dilema del preso" y posteriores, se analiza el concepto de "masa
cr&iacute;tica" en el desarrollo del software libre.</LI>
</UL>
<P>
<DT><B>Minimizaci&oacute;n de I+D: Un "Outsourcing" de facto.</B><DD><P>La primera consecuencia de todo este proceso es que el papel del
equipo de software de la empresa pasa a ser de coordinadores de proyecto. La
figura del desarrollador se relega a Internet, y engloba las fases de 
desarrollo, ampliaciones y  depuraci&oacute;n. Podemos hablar de un Outsourcing
del desarrollo software, en el sentido pleno de la palabra.
<P>
<DT><B>Internet como servicio t&eacute;cnico.</B><DD><P>Otra consecuencia del modelo de desarrollo del software libre es que el concepto
de asistencia al cliente y servicio t&eacute;cnico queda tambi&eacute;n desplazada a la red.
Una empresa inteligente har&aacute; uso de los recursos de la red para aprovechar y
dirigir dicho empe&ntilde;o hacia su empresa: creara listas de correo, tendr&aacute; un
programador dedicado a moderar dichas listas, pondr&aacute; las FAQ, HOWTOS, e
instrucciones en su web, y har&aacute; lo posible por que dicha informaci&oacute;n sea
distribuida de la forma mas eficiente posible. El ideal debe ser: "ninguna
duda resuelta sin que aparezca el URL de la empresa". El hacer que el portal
de Internet de la empresa sea referencia obligada para un proyecto de 
software libre es una fuente ingente de ingresos, tanto de publicidad directa
en el portal, como de venta de servicios de valor a&ntilde;adido por parte de la
empresa. El objetivo es conseguir una identificaci&oacute;n entre el producto y la
empresa, aunque dicho producto sea 100% software libre. Veremos en un apartado
posterior diversas t&eacute;cnicas para conseguir este objetivo.
<P>
</DL>
<P>
<H3>La pir&aacute;mide de desarrollo.</H3>

<P>
<P>En este modelo, y tal como vamos describiendo, se perfilan claramente
una serie de escalas de actuaci&oacute;n, con tareas y objetivos concretos. A
continuaci&oacute;n se describe el perfil de alguna de las partes.
<P>
<DL>
<DT><B>La empresa.</B><DD><P>Al margen de los proyectos realizados en torno a fundaciones,
universidades, o grupos que podr&iacute;amos calificar de no-empresariales, la empresa
de software libre asume el papel del responsable m&aacute;ximo del proyecto. Dicha
responsabilidad no es tanto de "paternidad" o de "l&iacute;der del proyecto" sino como
"padrino". En efecto, la empresa provee de estabilidad al proyecto, proporciona
canales fiables de venta y distribuci&oacute;n, mantiene la disponibilidad de ftp,
web y correo en torno al producto.... Como vimos en el primer cap&iacute;tulo, si
el desarrollo es correcto, el nombre del producto queda irremisiblemente
ligado al nombre de la empresa. En muchas ocasiones, los desarrolladores son
programadores contratados por la empresa, en otras la empresa subvenciona el
desarrollo, proporciona cobertura legal, etc.
<P>
<DT><B>El coordinador.</B><DD><P>El coordinador tiene un papel especial: podemos decir que ejerce de "Dios". Es
dif&iacute;cil que un voluntario trabaje para una empresa, pero es muy sencillo hacer
que trabaje para su l&iacute;der. En el mas puro estilo de la sociolog&iacute;a de las sectas
sobre el coordinador recaen toda responsabilidad de mantener el proyecto vivo, 
de animar a los voluntarios, de proporcionar nuevas y nuevas versiones y 
prestaciones a una clientela &aacute;vida de noticias frescas sobre su software 
favorito.
<P>La personalidad del coordinador es pues especial: en una fase inicial
deben ser buenos programadores, pero una vez el proyecto alcance masa cr&iacute;tica,
su papel pasa a ser el de relaciones p&uacute;blicas y de analista de sistemas. La
mayor parte de los l&iacute;deres de proyecto son buenos oradores, saben atraer la
atenci&oacute;n del p&uacute;blico, responden personalmente al correo electr&oacute;nico... 
posiblemente les quede poco tiempo real para desarrollar, pero tambi&eacute;n un buen
l&iacute;der sabe proveerse de colaboradores -a menudo compa&ntilde;eros de trabajo de la
empresa- que asumen las tareas pesadas. Es tan importante este papel, que 
muchas veces buenos proyectos caen en el olvido por falta de un l&iacute;der; o lo
que es peor para la empresa: el proyecto es "robado" por otra empresa con
mejores recursos. Como veremos posteriormente, el apadrinamiento de proyectos
y el contacto de la empresa con el l&iacute;der es fundamental, por lo que en general
la mayor parte de los l&iacute;deres de proyecto acaban trabajando para una empresa
que vive de dicho proyecto: Redhat, Sendmail, PostGreSQL, etc...
<P>
<DT><B>Los colaboradores.</B><DD><P>En organizaciones no empresariales de software libre, frecuentemente el
papel del l&iacute;der est&aacute; diluido en el "comit&eacute; organizador". Incluso en estos casos
el liderazgo est&aacute; repartido en &aacute;reas de trabajo, aunque la "atracci&oacute;n" de un
proyecto sin l&iacute;der es menor. Salvo honrosas excepciones -Debian, por ejemplo-
es dif&iacute;cil, y no est&aacute; exento de problemas un desarrollo "democr&aacute;tico".
<P>El papel de los colaboradores es por tanto el de responsables de &aacute;rea.
Aqu&iacute; s&iacute; se exige un fuerte nivel t&eacute;cnico y capacidad de abstracci&oacute;n. Son los
colaboradores los que van a realizar el trabajo de integraci&oacute;n, los que van a
recopilar la informaci&oacute;n que les llegue de Internet... en uni&oacute;n con el 
coordinador -y atendiendo a la comunidad Internet- deciden la pol&iacute;tica a seguir.
<P>Esta organizaci&oacute;n recuerda grandemente al modelo bazar. No es del todo
cierto, pues el modelo bazar exige una planificaci&oacute;n previa, y frecuentemente
estos grupos trabajan sobre la marcha. Podemos hablar de este grupo como el
destinatario final de la opini&oacute;n de Internet... y de la empresa o fundaci&oacute;n
que tengan detr&aacute;s.
<P>Al ser un grupo relativamente peque&ntilde;o, la comunicaci&oacute;n y toma de 
decisiones responde frecuentemente a un modelo "comit&eacute;". Usualmente trabajan
todos en la misma empresa, aunque en ocasiones, la facilidad de comunicaci&oacute;n
que la red ofrece proporciona un modelo de "comit&eacute; distribuido" al grupo de
colaboradores.
<P>
<DT><B>Los voluntarios.</B><DD><P>El voluntariado constituye la fuerza de choque de un proyecto de
desarrollo software. El flujo de comunicaci&oacute;n entre el grupo de colaboradores
y los voluntarios est&aacute; profusamente documentado en otros ensayos, por lo que 
no nos vamos a detener aqu&iacute; en detallarlo. &Uacute;nicamente hacer hincapi&eacute; en 
algunos detalles.
<P>
<UL>
<LI> El primero es la necesidad de que el voluntario este 
permanentemente informado del desarrollo del proyecto. Es misi&oacute;n del 
responsable de comunicaci&oacute;n dicha tarea. Es necesario que el voluntario
no se quede descolgado y que pueda sentirse copart&iacute;cipe del desarrollo.</LI>
<LI> El segundo es la necesidad que tiene de realimentaci&oacute;n. Por 
experiencia personal, conozco como un proyecto se echa a perder por no
atender las opiniones, quejas y sugerencias de los usuarios. Cierto 
que en &uacute;ltima instancia los intereses de la empresa en el proyecto
van a tomar la parte principal en el proceso de toma de decisiones, pero
tambi&eacute;n es cierto que muchas veces la opini&oacute;n de la mayor&iacute;a de los
usuarios suele en su conjunto ser m&aacute;s objetiva que la visi&oacute;n que la
empresa tenga del proyecto. No se debe olvidar nunca que estamos 
trabajando con software libre, y que en el momento que dicho software
no responda a las expectativas del usuario, el proyecto quedar&aacute; 
abandonado.</LI>
<LI> En este ensayo establecemos una diferencia entre voluntario y 
usuario. El voluntario participa en el desarrollo. El usuario utiliza 
el desarrollo. No conviene perder de vista esta diferencia.</LI>
</UL>
<P>
<DT><B>Los usuarios.</B><DD><P>Porque el inter&eacute;s comercial del producto de software libre de por si,
reside en la comunidad de usuarios y clientes potenciales del producto.
Est&aacute; claro que el voluntario se basta a si mismo, o utiliza los recursos
de la red, para hacer que el software responda a sus necesidades. Por
contra, el usuario suele utilizar los paquetes binarios, casi nunca
compila el c&oacute;digo fuente, y frecuentemente no utiliza sino el manual
del usuario ( y no siempre ). Frecuentemente es el usuario quien hace
los comentarios mas oportunos acerca de la apariencia, el modo de 
funcionamiento, las funcionalidades a a&ntilde;adir... y los errores evidentes
del software. Mientras el voluntario busca eficiencia, el usuario busca
funcionalidad.
Un buen responsable de marketing, conseguir&aacute; que el usuario se
convierta en cliente: comprando documentaci&oacute;n, recibiendo cursos, e
incluso mediante soluciones pre-instaladas. 
<P>Esta estrategia tiene adem&aacute;s una ventaja oculta: si se consigue
"enganchar" al usuario como cliente, este queda integrado en la cadena
de producci&oacute;n, convirti&eacute;ndose de hecho en el departamento de control
de calidad del producto. 
<P>
<DT><B>La competencia.</B><DD><P>Finalmente nos queda una &uacute;ltima parte en la cadena del
desarrollo software: la competencia.
<P>No debemos olvidar un hecho importante en el mundo del software: 
los conceptos de nichos ecol&oacute;gicos y de evoluci&oacute;n , de tanta aplicaci&oacute;n
en biolog&iacute;a, siguen siendo v&aacute;lidos al ser aplicados al software. En
un mundo tan altamente competitivo, podemos decir que cada necesidad
software tiende a tener un &uacute;nico producto que la cumbre. En los casos en
que esto no es as&iacute;, y hay varios productos compitiendo, se produce el
fen&oacute;meno de "evolucionar para permanecer en el nicho", esto es, una
carrera desenfrenada por a&ntilde;adir prestaciones y funcionalidades para no
perder cuota de mercado. Tenemos ejemplos de dicha evoluci&oacute;n en el 
entorno del software libre: las "guerras de los escritorios" en Linux
o la b&uacute;squeda de un entorno ofim&aacute;tico libre...
<P>La empresa pues, ante la competencia, deber&aacute; buscar, o 
bien desbancar a sus competidores, o bien desplazarse hacia un nuevo
nicho, donde no haya competencia. Una tercera alternativa es la 
b&uacute;squeda de "pactos" de interoperatividad, pero normalmente no es una
elecci&oacute;n atractiva desde el punto de vista econ&oacute;mico, pues implica
un reparto de beneficios, y a la larga una p&eacute;rdida de competitividad 
de la empresa menos "&aacute;gil".
</DL>
<H3>Marketing y "venta" del software abierto.</H3>

<P>
<P>Hemos llegado al n&uacute;cleo del problema: ya tenemos una empresa organizada
en torno al software libre, y con un producto. Ahora toca venderlo y ganar
dinero.
Pues, ¿c&oacute;mo se puede vender un producto que es "gratis"?. 
<UL>
<LI>Una primera aproximaci&oacute;n consiste en ahorrarle al usuario 
trabajo, a cambio de un m&iacute;nimo coste. El concepto de "distribuci&oacute;n de 
paquetes" sigue este modelo. Un ejemplo concreto es el de las 
distribuciones binarias de Linux: si bien el usuario tiene en todo 
momento opci&oacute;n a crearse su propia distribuci&oacute;n, el coste en horas, 
o en gasto de grabaci&oacute;n del CD-Rom, le hacen que este dispuesto a 
pagar una cantidad simb&oacute;lica por tener el trabajo ya hecho.</LI>
<LI> La segunda alternativa es la venta de funcionalidades a&ntilde;adida:
la licencia GNU permite enlazar aplicaciones libres con aplicaciones
comerciales, siempre que la segunda no utilice otros recursos de la
primera que no correspondan al API. Por ello es frecuente la venta
de plug-ins, as&iacute; como de productos que desarrollan aplicaciones
espec&iacute;ficas alrededor de un software libre ( manejadores gr&aacute;ficos,
gestores de administraci&oacute;n, front-ends, etc. ).</LI>
<LI> Una tercera v&iacute;a es la venta de documentaci&oacute;n. Uno de los grandes
problemas del software libre es la ausencia de una documentaci&oacute;n
fiable y -por la propia naturaleza del software libre- actualizada. Actualmente,
el modelo de "documentaci&oacute;n aparte" es adoptado por muchas empresas
que trabajan con software libre.</LI>
<LI> Por &uacute;ltimo, nos queda -por lo menos- otra opci&oacute;n: la de dar 
cursillos y entrenamiento a los usuarios. Hace poco salt&oacute; la noticia 
de que RedHat ofrec&iacute;a unos cursos en los que se daba un diploma que 
acreditaba como "RedHat certiffied manager".... el paralelismo con 
otras empresas comerciales es evidente.</LI>
<LI> Como efecto marginal, pero no desde&ntilde;able, es preciso destacar el 
papel que los responsables del proyecto tienen: conferencias, charlas
exposiciones, etc., son tambi&eacute;n fuentes de ingreso para la empresa.</LI>
</UL>
<P>
<DL>
<DT><B>Publicidad y distribuci&oacute;n.</B><DD><P>Para que todos estos m&eacute;todos lleguen a ser rentables hace falta algo
com&uacute;n a todas las empresas, tanto libres como cerradas: el producto tiene que
ser conocido, y la gente debe ser convencida de que su posesi&oacute;n es una 
necesidad vital. El responsable de marketing es el encargado de esta misi&oacute;n.
Existen diversas estrategias:
<P>
<UL>
<LI> El uso -y en ocasiones abuso- de Internet debe se una constante. 
Un aprovechamiento inteligente de la red har&aacute; que el software sea 
conocido por los clientes potenciales en cuesti&oacute;n de horas.</LI>
<LI> No tenemos por que estar limitados a nuestro servidor. El 
convencer a los voluntarios de que mantengan r&eacute;plicas (mirrors) de 
nuestro servidor, har&aacute; que las posibilidades de que nuestro software sea
conocido crezcan exponencialmente.</LI>
<LI> Del mismo modo es necesario conseguir que los portales de 
Internet reflejen nuestro producto. Es m&aacute;s, debemos conseguir que 
nuestro web se convierta en un portal.</LI>
<LI> Este ultimo punto hace que aparezca una nueva fuente de ingresos:
los ingresos por publicidad de otras empresas. Actualmente la mayor
parte de los ingresos de Netscape se deben a la publicidad de su
portal.</LI>
<LI> Hay que saber vender. Hoy en d&iacute;a, el software libre est&aacute; "de 
moda", y como veremos en otro cap&iacute;tulo, el uso de dicho software es
"pol&iacute;ticamente correcto". Una adecuada venta del hecho de que la 
empresa distribuya software libre, abre la puerta a instituciones, 
organismos p&uacute;blicos, universidades, etc., donde los condicionantes de la
decisi&oacute;n de adquisici&oacute;n del software no son econ&oacute;micos sino pol&iacute;ticos.</LI>
<LI> Por &uacute;ltimo, hay que ser capaz de dar a los posibles clientes 
tareas de consultor&iacute;a. El cliente no quiere un producto, sino una 
soluci&oacute;n a su problema, y si no se produce abuso, normalmente no pondr&aacute;
impedimento al pago de una determinada cantidad por lo que a todas 
luces es una m&iacute;nima adaptaci&oacute;n -a veces ni siquiera llega a tal- de un 
producto de software libre.</LI>
</UL>
</DL>
<P>
<H2><A NAME="ss7.3">7.3 Estrategias de comienzo.</A>
</H2>

<P>
<P>Todo lo dicho hasta ahora parte de la base de que la empresa tiene
un producto de software disponible. Como es obvio, esto no siempre ocurre,
sino que en ocasiones hay que proceder , o bien a un trabajo inicial de
desarrollo, o a la liberalizaci&oacute;n de un software anterior, o incluso 
a la "captura" de un proyecto. Veamos en detalle estas t&eacute;cnicas.
<P>
<DL>
<DT><B>Esponsorizaci&oacute;n o apadrinamiento.</B><DD><P>El primer m&eacute;todo es el m&aacute;s sencillo -y en cierto modo el menos
arriesgado-. Consiste en que la empresa invierte dinero en una fundaci&oacute;n, o
asociaci&oacute;n, o incluso en un proyecto de investigaci&oacute;n de una universidad, con
el fin de financiar econ&oacute;micamente un determinado proyecto. 
<P>Claramente, una empresa que utilice esta estrategia no suele estar
interesada en el proyecto en si, sino en derivar parte de su carga de trabajo
a otros intereses m&aacute;s rentables. Podemos hablar de optimizaci&oacute;n de recursos
de la empresa, mediante t&eacute;cnicas de "Outsourcing" camuflado.
<P>En otro caso la inversi&oacute;n econ&oacute;mica responde a otras necesidades o
intereses. Un efecto curioso que se da en algunas empresas de software libre, 
( caso de RedHat, o Netscape ) es que son consideradas como valores de bolsa,
sujetos a cotizaci&oacute;n en el mercado. Antes de la Crisis de Netscape, la mayor
fuente de ingresos que pose&iacute;a dicha empresa se deb&iacute;a a sus operaciones en
bolsa. En el caso de Redhat, las inversiones y subvenciones realizadas por
grandes compa&ntilde;&iacute;as de hardware y software, hacen que su valor en bolsa se
dispare, llegando a tener una cartera de beneficios m&aacute;s que apreciable.
<P>
<DT><B>Captura de cerebros.</B><DD><P>Un segundo m&eacute;todo consiste en que la empresa contrate a los 
coordinadores de un proyecto de software libre, asumiendo dicha empresa los
fines y objetivos de dicho proyecto... en su propio beneficio. Los nuevos
empleados disfrutan de casi total libertad para seguir el desarrollo, con la
garant&iacute;a de que van a cobrar por su trabajo. Muchos de los nombres famosos
en el mundo Linux trabajan al amparo de empresas como RedHat o Netscape.
<P>
<DT><B>Liberalizaci&oacute;n de software.</B><DD><P>En ocasiones, la competencia hace que deje de ser rentable el
mantenimiento y actualizaci&oacute;n de un producto. La liberalizaci&oacute;n del c&oacute;digo
fuente, proporciona una segunda oportunidad al producto, y una nueva fuente
de desarrollo.
<P>Hay que hacer constar que esta pol&iacute;tica de liberalizaci&oacute;n, rara vez
se hace a trav&eacute;s de una licencia tipo GPL: es norma casi general que el
fabricante desee proteger lo m&aacute;s posible su inversi&oacute;n inicial, y por ello
se aplican cl&aacute;usulas de restricci&oacute;n de la distribuci&oacute;n. Las restricciones
m&aacute;s usuales son:
<UL>
<LI> Restricci&oacute;n a la distribuci&oacute;n: se suele prohibir el uso comercial
del c&oacute;digo fuente liberado.</LI>
<LI> Restricci&oacute;n al formato: los parches y a&ntilde;adidos deben ir aparte
de la distribuci&oacute;n oficial.</LI>
<LI> Cl&aacute;usula de terminaci&oacute;n: la empresa puede restringir sin previo
aviso el uso del software liberado, tanto en fuentes como en 
ejecutables.</LI>
</UL>
<P>La comunidad Internet est&aacute; generalmente en contra de estas restricciones
especialmente de la &uacute;ltima, que ha sido adoptada por empresas como
IBM y Apple. Claramente no son sino un intento de utilizar la
fuerza de producci&oacute;n de Internet en beneficio exclusivo de la empresa.
<P>
<DT><B>Captura de proyectos.</B><DD><P>Nos queda a&uacute;n otro modelo de introducci&oacute;n empresarial en el modelo
de software libre. Tenemos un ejemplo cl&aacute;sico en el desarrollo del
paquete PostGreSQL ( un gestor de bases de datos relacional cuyo
copyright ha sido recientemente adquirido por InSight Distributions ).
<P>En este caso, la empresa asume poco a poco la coordinaci&oacute;n de un 
proyecto, hasta el punto en que los responsables originales del 
trabajo "ceden" las labores de mantenimiento del programa. Esto
permite a una empresa integrar sus productos de pago en torno a
un programa, que a pesar de ser libre, es mantenido y dirigido
por la empresa. Aunque el car&aacute;cter abierto de dicho software no
se pueda perder, dadas las caracter&iacute;sticas de la licencia, su
orientaci&oacute;n futura depender&aacute; en gran medida de los intereses de
su nuevo patrocinador.
<P>
<DT><B>Qu&eacute; debe ser abierto y qu&eacute; debe ser "de pago".</B><DD><P>Con independencia de la estrategia adoptada, la empresa tiene que
ser consciente de que un producto de software libre no basta de por
si para la productividad. Es m&aacute;s, como hemos visto existen campos
del desarrollo software donde el modelo de software libre no puede
ser viable, debido a que no cumple la condici&oacute;n de masa cr&iacute;tica
requerida para dicho modelo ( ver siguiente cap&iacute;tulo ). Estamos 
hablando de soluciones "a medida", o de programas muy especializados.
la empresa utilizar&aacute; los resultados del desarrollo de S.L. para
proporcionar una base de lanzamiento de dichos productos.
<P>Los contratos de outsourcing son pues un modelo id&oacute;neo de
explotaci&oacute;n del software libre. Al cliente no le importa tanto la
condici&oacute;n de "libertad" del c&oacute;digo, cuanto que le proporcione 
soluci&oacute;n a su problema. Es aqu&iacute; donde la empresa adquiere sus
beneficios directamente del software, y donde el resultado del
esfuerzo invertido en el software libre es directamente aprovechado
por la empresa, con independencia de otras soluciones marginales.
</DL>
<P>
<H2><A NAME="ss7.4">7.4 Estructura y organizaci&oacute;n.</A>
</H2>

<P>Todo lo dicho hasta ahora se refiere a procedimientos de trabajo en
la empresa. Analicemos un poco la organizaci&oacute;n y gesti&oacute;n. Existe mucha 
literatura acerca de c&oacute;mo hacer una empresa "orientada a Internet", y no 
vamos a profundizar en ello, remitiendo al lector a la bibliograf&iacute;a 
rese&ntilde;ada en el ap&eacute;ndice. Haremos en cambio hincapi&eacute; en la gesti&oacute;n y 
control de los recursos.
<P>
<DL>
<DT><B>Gesti&oacute;n de recursos materiales.</B><DD><P>Lo primero que caracteriza a una empresa de software libre es la
escasez de recursos, tanto materiales como humanos. Esto es explicable si
consideramos que dicha empresa delega en la red tareas b&aacute;sicas como los
procesos de producci&oacute;n y distribuci&oacute;n. La empresa de software libre posee
generalmente un inmovilizado ( recursos materiales ) m&iacute;nimo, y por contra
dispone de una fuerte capitalizaci&oacute;n, bien mediante inversiones, 
financiaci&oacute;n externa, etc. La mayor parte de las empresas actuales son
objeto de especulaci&oacute;n en bolsa, y algunas de ellas -caso de RedHat- son
consideradas hoy en d&iacute;a como "opciones de riesgo" por los inversores
burs&aacute;tiles.
<P>Las &aacute;reas de actuaci&oacute;n y de inversi&oacute;n en recursos materiales de
esta empresa se derivan hacia los campos de obtenci&oacute;n de beneficios: se
prioriza pues el departamento de Marketing, y el de atenci&oacute;n al cliente.
Se potencia el uso de la red, la publicidad v&iacute;a Internet, y los mecanismos
automatizados de respuesta al usuario.
<P>Otra &aacute;rea de inversi&oacute;n constituye el desarrollo de servicios de
valor a&ntilde;adido: documentaci&oacute;n, soluciones al cliente, productos auxiliares,
etc.
<P>El perfil pues es el de una empresa de servicios en su acepci&oacute;n
m&aacute;s extrema: el de una empresa que vive de, por y para Internet.
<P>
<DT><B>Gesti&oacute;n de recursos humanos.</B><DD><P>Visto el perfil personal y laboral de los responsables de un 
proyecto de software libre, es necesario concluir que la pol&iacute;tica de trabajo
de nuestra empresa, debe diferir bastante de la de una empresa habitual. Se
deber&aacute;n poder aplicar t&eacute;cnicas de teletrabajo, permitir una muy grande 
libertad horaria, etc. Recordemos que en el software libre, aparte de la
motivaci&oacute;n econ&oacute;mica existe una muy fuerte motivaci&oacute;n personal, y a ella
tampoco son ajenos los responsables del proyecto. Al coordinador de recursos
humanos le corresponde encauzar las energ&iacute;as, y conducir la nave a buen puerto.
<P>De hecho muchos proyectos de software libre se han venido abajo por
una falta de organizaci&oacute;n y coordinaci&oacute;n en la c&uacute;pula. En el mundo empresarial
esto s&oacute;lo es tolerable por la competencia... para apropiarse del proyecto.
<P>
<DT><B>Se impone un control.</B><DD><P>Por ello el responsable de recursos humanos deber&aacute; ser capaz de:
<UL>
<LI> Mantener el ritmo de trabajo y los plazos.</LI>
<LI> Monitorizar el uso de la red, para evitar abusos.</LI>
<LI> No olvidar las actividades relacionadas con el marketing que
afecten a los desarrolladores: ferias, conferencias, cursos, etc.</LI>
<LI> Decidir que tareas debe asumir el grupo de desarrolladores, y que
tareas se deben delegar en la red.</LI>
</UL>
<P>El departamento de marketing y atenci&oacute;n al cliente, deber&aacute; estar
a su vez familiarizado con el "Estado del arte" del desarrollo, atender
a las consultas de clientes y colaboradores.
<P>
<DT><B>Gesti&oacute;n inteligente de servidores de informaci&oacute;n.</B><DD><P>Como hemos visto, todas las tareas de trabajo y control, giran en
torno a un componente principal: la red. Gracias a la red, la empresa consigue
voluntarios, clientes, publicidad.... en suma, dinero. 
<P>Podemos observar que gran parte de las p&aacute;ginas web de proyectos de 
software libre abundan en publicidad. Es una publicidad inteligente, 
personalizada en funci&oacute;n del visitante, que no sobrecarga el sistema, 
compatible con todo tipo de navegadores y entornos... la idea es conseguir
ingresos, sin perder visitantes, ( esto, que parece obvio es olvidado por
empresas "serias" ).
<P>El servidor de informaci&oacute;n deber&aacute; disponer de listas de correo
autom&aacute;ticas, adecuadas, y a ser posible moderadas por un responsable. Se
deber&aacute; cuidar el mail-spamming, la correcci&oacute;n en el estilo. De ser posible,
s&oacute;lo una voz hablar&aacute; de la empresa a trav&eacute;s del correo. Las listas de correo
deber&aacute;n estar accesibles por Web y FTP.
<P>Del mismo modo, toda la documentaci&oacute;n libre deber&aacute; ser accesible de
manera sencilla y directa. Las t&eacute;cnicas de "registro" previo deber&iacute;an 
utilizarse s&oacute;lo para los "clientes", y nunca para el acceso general. Se deber&aacute;
dar cuenta en el menor plazo posible de toda novedad existente. Es vital que
los servidores de informaci&oacute;n tengan un buen enlace con la red, y que se
ejecuten en entornos seguros y fiables, y -por supuesto- basados en software
libre.
<P>Una cosa a evitar es el uso negativo de las estad&iacute;sticas: aunque quedan
muy "bonitos", deber&iacute;a huirse de contadores, y sobre todo de cualquier cosa que
pueda ahuyentar a un posible voluntario o cliente. Mensajes del estilo
"Bienvenido Mr. Pepito. Es la quinta vez que se conecta a nuestro web"
producen reacci&oacute;n de rechazo en el cliente".
<P>Es de agradecer que se establezca una metodolog&iacute;a de trabajo: habr&aacute;
que definir unas normas de estilo, un sistema tipo CVS para la gesti&oacute;n del
software, etc... son normas b&aacute;sicas de coordinaci&oacute;n de proyectos, que adquieren
importancia fundamental cuando se va a coordinar un sistema de esta envergadura.
</DL>
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-8.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-6.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc7">Índice general</A>
</BODY>
</HTML>
