<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Introducci&oacute;n </TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-5.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-3.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-5.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-3.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc4">Índice general</A>
<HR>
<H2><A NAME="introduccion"></A> <A NAME="s4">4. Introducci&oacute;n </A></H2>

<P>
<H2><A NAME="ss4.1">4.1 Resumen del cap&iacute;tulo.</A>
  </H2>

<P>
<UL>
<LI> Presentaci&oacute;n. Objetivos.</LI>
<LI> La sociedad la informaci&oacute;n.
<UL>
<LI> Sociedad de la informaci&oacute;n y sociedad informada.</LI>
<LI> El fen&oacute;meno Internet.</LI>
<LI> Reinventar la rueda.</LI>
</UL>
</LI>
<LI> El fen&oacute;meno del software libre.
<UL>
<LI> Or&iacute;genes y evoluci&oacute;n del software libre.</LI>
<LI> La realidad actual.</LI>
</UL>
</LI>
<LI> El coste del software.
<UL>
<LI> ¿Pagar por la herramienta de trabajo?.</LI>
<LI> Realidad de la pirater&iacute;a inform&aacute;tica.</LI>
<LI> Minimizar los costes de instalaci&oacute;n.</LI>
</UL>
</LI>
</UL>
<P>
<H2><A NAME="ss4.2">4.2 Presentaci&oacute;n. Objetivos.</A>
  </H2>

<P>
<P>Este ensayo trata sobre el fen&oacute;meno del software libre y sus 
consecuencias econ&oacute;micas. A la hora de plantear el tema he querido 
expl&iacute;citamente huir de todo planteamiento idealista, voluntarista o de 
juicios morales sobre la bondad del software libre; existe ya demasiada 
literatura sobre el tema, y todos estamos al d&iacute;a de las caracter&iacute;sticas, 
bondades e inconvenientes del software libre. Pido disculpas anticipadas 
a todo aquel que sienta herida la idea sobre la "bondad" del software libre, y de la 
idea del "compartir desinteresado", pero no se puede cerrar los ojos a lo 
que en estos momentos es una realidad
<P>Utilizo el t&eacute;rmino "software libre" en el sentido ingl&eacute;s del concepto
"Open Source Software", en lugar del entendido en Espa&ntilde;a como "Software 
gratuito".  En todo momento, a menos que se explicite lo contrario, 
entenderemos como tal a aquel software, generalmente sujeto a derechos de 
copyright y licencia de uso sobre el que el usuario tiene acceso al c&oacute;digo 
fuente, permiti&eacute;ndose cierta libertad de uso. Del mismo modo, a menos que se 
especifique, la licencia de uso corresponder&aacute; a la definida en la "GNU Public 
License versi&oacute;n 2". Es posible que en alg&uacute;n momento en el texto aparezca el 
traducci&oacute;n literal "software abierto". Pido por ello disculpas anticipadas al 
lector, que espero tenga la amabilidad de notificar el error, para as&iacute; 
corregirlo convenientemente.
<P>Todo escrito tiene un objetivo, y &eacute;ste no pod&iacute;a ser menos. La idea
que quiero transmitir es esta: El Software Libre es un negocio rentable, 
y subyace en un modelo de econom&iacute;a basado en la colaboraci&oacute;n ego&iacute;sta. Intentar&eacute;
demostrar que dicho modelo econ&oacute;mico no es exclusivo del software sino que es
una conclusi&oacute;n l&oacute;gica de la sociedad de consumo actual, basada en la tendencia
de desplazar la econom&iacute;a de los pa&iacute;ses industrializados desde el sector 
producci&oacute;n al sector servicios.
<P>El modelo de empresa basada en estos conceptos difiere grandemente de
la empresa tradicional, tanto en los objetivos como en los medios disponibles,
aunque comparten algo b&aacute;sico: ganar dinero. Veremos como el modelo del
Software Libre cumple esto, y adem&aacute;s aporta algo de lo que los otros modelos
carecen: optimiza la relaci&oacute;n coste/prestaciones en toda la cadena de 
producci&oacute;n, desde el voluntario/colaborador hasta el usuario final del producto.
<P>
<H2><A NAME="ss4.3">4.3 La sociedad de la informaci&oacute;n.</A>
</H2>

<P>
<P>La sociedad de los pa&iacute;ses industrializados se tiene una serie de 
caracter&iacute;sticas que la hacen destacar sobre otras sociedades: una renta per
c&aacute;pita superior a la media, un desplazamiento de su actividad productiva 
hacia el sector servicios, una serie de valores econ&oacute;micos y culturales
"occidental". Una vez ca&iacute;do el sistema productivo "comunista", la sociedad
de mercado con sus ventajas e inconvenientes se ha hecho con la hegemon&iacute;a
de las sociedades industrializadas. Y con ella un fen&oacute;meno que en los &uacute;ltimos
a&ntilde;os se ha hecho patente: vivimos en la sociedad de la informaci&oacute;n. Tanto es
as&iacute; que nuestro modelo econ&oacute;mico se basa en muchas ocasiones para su desarrollo
en la posesi&oacute;n y manejo de informaci&oacute;n mas o menos valiosa o privilegiada. 
Una frase de periodistas es "Quien tiene la informaci&oacute;n, tiene el poder".
<P>
<DL>
<DT><B>Sociedad de la informaci&oacute;n y sociedad informada.</B><DD><P>Pero la realidad es otra: El poder no est&aacute; en quien tiene la informaci&oacute;n, sino
en quien sabe manejarla. En un mundo con superabundancia de fuentes de 
informaci&oacute;n ( tanto es as&iacute; que m&aacute;s de un ensayista ha escrito que la sociedad
de la informaci&oacute;n implica el fin de la historia seg&uacute;n se describe desde la
dial&eacute;ctica marxista ) es un problema real el manejo y proceso de tanta 
informaci&oacute;n. Frecuentemente se produce un fen&oacute;meno de <EM>overbooking</EM> de 
informaci&oacute;n, o bien aparece la problem&aacute;tica de "separar la se&ntilde;al del ruido", 
es decir, del discernimiento entre informaci&oacute;n relevante o desechable. No en
vano un nuevo concepto ha aparecido dentro del mundo de las tecnolog&iacute;as de la
informaci&oacute;n: el <EM>Data Mining</EM>. Hasta hace unos a&ntilde;os era impensable 
que tal necesidad de control de la informaci&oacute;n fuera no ya necesaria, sino 
hasta imprescindible para la supervivencia de una empresa.
<P>
<DT><B>El fen&oacute;meno Internet.</B><DD><P>En este contexto de sociedad de la informaci&oacute;n, aparece el fen&oacute;meno
Internet. A nivel sociol&oacute;gico podemos decir que Internet ha convertido el
fen&oacute;meno de la informaci&oacute;n y el acceso a &eacute;sta en un mecanismo al que todo
el mundo puede acceder, sin mas que unos m&iacute;nimos recursos. Se dice que
Internet ha "democratizado" el acceso a la informaci&oacute;n. Sin entrar a
valorar el valor de la informaci&oacute;n disponible, podemos hacer una primera
clasificaci&oacute;n en funci&oacute;n de los contenidos:
<UL>
<LI> Informaci&oacute;n destinada a favorecer el consumo: hablamos de publicidad.</LI>
<LI> Informaci&oacute;n destinada al ocio y tiempo libre: juegos, viajes, turismo, 
etc.</LI>
<LI> Informaci&oacute;n cultural.</LI>
<LI> Informaci&oacute;n socio-laboral. </LI>
<LI> Informaci&oacute;n cient&iacute;fica y t&eacute;cnica.</LI>
<LI> Meta-Informaci&oacute;n: Material sobre como buscar mas informaci&oacute;n ( portales ).</LI>
</UL>
<DT><B>Reinventar la rueda.</B><DD><P>Ante este hecho, cuando un usuario necesita informaci&oacute;n tiene dos
opciones: o intentar localizarla, o bien generarla por s&iacute; mismo. En cualquiera
de los dos casos esto tiene un coste, que para una empresa se traduce en
un coste econ&oacute;mico. En el segundo caso, deber&aacute; dedicar una serie de tiempo y
dinero en hacer que sus trabajadores elaboren dicha informaci&oacute;n. En el caso
primero, dichos trabajadores deber&aacute;n emplear el tiempo en localizar la 
informaci&oacute;n, y sobre todo en procesarla para que sea de utilidad a la empresa.
Sea cual sea el proceso elegido, ello implica muchas veces el que la informaci&oacute;n
tenga que ser varias veces asimilada y procesada. La consecuencia global es que
en el mundo empresarial "la rueda se reinventa" constantemente.
<P>En cualquiera de los dos casos una vez que la empresa tiene lo que
necesita, se plantea la necesidad de dar una salida a dicha informaci&oacute;n. En
funci&oacute;n del modelo elegido obtenemos dos modalidades de empresa: Cerrada
( el resultado de su trabajo es de uso exclusivo de la empresa ) o Abierta
( se comparte -de forma mas o menos aprovechable- el resultado del trabajo
de la empresa ). Cuando una empresa trabaja con el modelo abierto, decimos
que adopta un modelo empresarial tipo "Software Libre".
<P>Uno se puede plantear como un modelo basado en compartir la informaci&oacute;n
-que ha costado dinero obtener y procesar- puede ser beneficioso econ&oacute;micamente.
La respuesta reside en varios conceptos que analizaremos en los siguientes
cap&iacute;tulos. Baste resumir algunos de ellos:
<UL>
<LI> Una empresa abierta no vende informaci&oacute;n: vende servicios.</LI>
<LI> Los costes de elaboraci&oacute;n son infinitamente menores que los de
distribuci&oacute;n y marketing.</LI>
<LI> Existen multitud de fuentes alternativas de beneficios, aparte
de los derivados de la venta de la informaci&oacute;n, que en el caso de una
empresa abierta son -en el caso ideal- nulos.</LI>
</UL>
</DL>
<H2><A NAME="ss4.4">4.4 El fen&oacute;meno del Software Libre.</A>
</H2>

<P>El software libre es tan antiguo -o mas- que Internet. De hecho 
podemos decir que Internet no existir&iacute;a sin el software libre. Desde que en
los a&ntilde;os 60 los Bell Laboratories cedieron el c&oacute;digo fuente de su reci&eacute;n
inventado Sistema Operativo UNIX, hasta la &uacute;ltima versi&oacute;n del n&uacute;cleo Linux,
la historia del software se basa en el intercambio de informaci&oacute;n. 
<P>Una serie de caracter&iacute;sticas hacen en la industria del software la 
necesidad de una comunicaci&oacute;n fluida y de un intercambio de informaci&oacute;n:
<UL>
<LI> La necesidad de formatos de intercambio de datos entre distintas
aplicaciones.</LI>
<LI> Los protocolos de comunicaciones entre sistemas, que exigen 
por un lado la existencia de un API, o modelo de programaci&oacute;n 
est&aacute;ndar, y por otro lado una "implementaci&oacute;n tipo" o modelo de 
referencia a quien seguir.</LI>
<LI> Es un hecho que en Internet, los formatos propietarios son 
rechazados casi sistem&aacute;ticamente en los entornos comerciales, debido 
a que ning&uacute;n comerciante que se precie, y que tenga un m&iacute;nimo deseo 
de pervivir, va a adoptar formatos que no sean manejables por todos 
sus clientes potenciales.</LI>
</UL>
<P>No obstante, no todo es color de rosa: intereses comerciales hacen
que muchos fabricantes quieran imponer sus propios est&aacute;ndares, o a&ntilde;adan
extensiones incompatibles a los ya existentes. Un fuerte rechazo a este
modo de hacer empresa se observa en el software actual, debido -entre otras
causas- a:
<P>
<UL>
<LI> El mundo del software abierto es capaz en poco tiempo de 
adaptar el c&oacute;digo libre para soportar extensiones no est&aacute;ndar a los 
protocolos. Todo ello se traduce para la empresa que desarrolla dichos 
protocolos en una carrera por inventar nuevas extensiones, hasta que 
se llega a la total inutilidad de los esfuerzos realizados en forzar 
un est&aacute;ndar.</LI>
<LI> El desarrollo de extensiones propietarias tiene adem&aacute;s un riesgo
tecnol&oacute;gico: la carencia de un modelo de referencia da lugar a la
posibilidad de cometer errores, dif&iacute;ciles de detectar y corregir -dada
la naturaleza "propietaria" del c&oacute;digo-, as&iacute; como la suspicacia del
usuario ante "puertas ocultas" o fallos de seguridad. Los errores
de codificaci&oacute;n de implementaciones propietarias han sido la constante
en muchos paquetes software de todos conocidos.</LI>
<LI> El empresario que posee un mercado cautivo sobre los usuarios de 
dicho software muchas veces tiende a ignorar a los usuarios. Del mismo
modo, muchos usuarios admiten los errores como algo consustancial al
mundo del software. Esta realimentaci&oacute;n negativa, a la larga redunda 
en una p&eacute;rdida de eficiencia y de productividad del usuario, y a una 
falta de motivaci&oacute;n para la mejora de la calidad en la empresa de 
software. Finalmente, se acaba produciendo una "desconexi&oacute;n" entre el 
cliente y su proveedor: el producto deja de responder a las 
expectativas del usuario, este deja de "realimentar" a su proveedor y 
se acaba adoptando otro software similar que realmente responde a las 
expectativas. Mientras tanto, el proveedor y el usuario sufren p&eacute;rdidas
econ&oacute;micas por el uso de un producto y una metodolog&iacute;a que no son 
capaces de satisfacer a todos los elementos que intervienen en la cadena.</LI>
<LI> El mercado del software es un aut&eacute;ntico campo de batalla: podemos
hablar de "nichos ecol&oacute;gicos", donde s&oacute;lo cabe un competidor. No 
existe tiempo para desarrollar mas que nuevas prestaciones para un
producto. Es mucho m&aacute;s efectivo, duradero y rentable, capturar 
clientes con un buen producto que con un API propietario. Adem&aacute;s, esta
ultima t&aacute;ctica desv&iacute;a masa productiva a actividades no directamente
remuneradoras, sino "de protecci&oacute;n", que a la larga, y seg&uacute;n hemos visto
anteriormente, se revelan ineficaces. S&oacute;lo es efectiva esta estrategia 
en l&iacute;neas de desarrollo a muy corto plazo, en las que no tiene sentido 
para la competencia desarrollar contramedidas.</LI>
<LI> Recientes hechos y actuaciones judiciales ponen en tela de 
juicio el software propietario, en el sentido de que en algunos casos 
se deriva en situaciones de indefensi&oacute;n para el usuario final: bases 
de datos de usuarios, archivos ocultos, informaci&oacute;n confidencial acaba 
llegando al creador del producto, sin que el usuario pueda hacer nada 
para evitarlo.</LI>
</UL>
<P>Ser&iacute;a de necios cerrar los ojos a la realidad y afirmar que las empresas
no consiguen imponer sus est&aacute;ndares. Lo cierto es que en gran parte de los
casos los est&aacute;ndares siguen a las empresas que los lanzan. Lo que se pretende
decir con esto es que s&oacute;lo cuando es asumible el coste de la innovaci&oacute;n puede
plantearse la creaci&oacute;n de protocolos o interfaces propietarios. El mercado tiene
gran inercia y necesita apoyarse en unas bases conocidas, por lo que ninguna
empresa media puede permitirse el lujo de forzar clientela en un mercado
competitivo. La adopci&oacute;n de est&aacute;ndares conocidos -y aceptados- permite a los
usuarios arriesgarse a probar el nuevo producto, y la existencia de modelos
de implementaci&oacute;n p&uacute;blicos permite a la empresa un desarrollo sin necesidad de
partir "de cero". Incluso con gigantes de la industria software se ha dado
lugar a problemas muy serios -incluso judiciales- por algo tan simple como
la compatibilidad hacia atr&aacute;s entre dos versiones del mismo paquete ofim&aacute;tico.
<P>
<DL>
<DT><B>Or&iacute;genes del Software Libre.</B><DD><P>En el anterior p&aacute;rrafo, se plantea pues, la necesidad de partir de
un est&aacute;ndar aceptado por todos -facilidad para el usuario- y de un modelo de
implementaci&oacute;n -facilidad para la empresa-. Esta caracter&iacute;stica es esencial en
el software libre: un sistema de producci&oacute;n que favorece a todas las partes
implicadas. Veremos en cap&iacute;tulos posteriores los modelos matem&aacute;ticos subyacentes
a esta metodolog&iacute;a. Entretanto, haremos una aproximaci&oacute;n evolutiva a dicho
modelo.
<P>No podemos olvidar que el boom de la inform&aacute;tica y de las tecnolog&iacute;as
de la informaci&oacute;n es relativamente reciente: hace tres d&eacute;cadas el mundo del
software estaba reducido al &aacute;mbito acad&eacute;mico -y a veces militar- de unos pocos
pa&iacute;ses privilegiados. El proyecto Arpanet fue en su origen un desarrollo de la
universidad de Berkeley encargado por el Departamento de Defensa. Las leyes
federales obligan a que, pasado un tiempo, todo proyecto financiado con fondos
p&uacute;blicos, sea del dominio p&uacute;blico.
<P>En otros casos no fue la ley, sino los convenios entre empresas y
organismos p&uacute;blicos los que potenciaron la distribuci&oacute;n de software libre:
si ATT no hubiera cedido el c&oacute;digo fuente de su sistema operativo UNIX, 
posiblemente Internet -si existiera- ser&iacute;a totalmente distinta de lo que 
conocemos hoy en d&iacute;a. 
<P>Por &uacute;ltimo hay que destacar el software llevado a cabo mediante 
colaboraciones o convenios entre empresas. El sistema X-Window es mantenido
y desarrollado por un consorcio de empresas que se comprometen a seguir
unos est&aacute;ndares y normas de desarrollo comunes, obteniendo a cambio una 
garant&iacute;a de interoperabilidad y de acceso a recursos comunes, especialmente
el c&oacute;digo fuente. ( Se ha producido recientemente un intento de "privatizar"
este club, estableciendo una "cuota de socio", intento que felizmente por
motivos nuevamente econ&oacute;micos -como no pod&iacute;a ser de otra manera- ha sido
abortado ).
<P>Estos intercambios de informaci&oacute;n han tra&iacute;do consigo las primeras 
preocupaciones de &iacute;ndole mercantil: la protecci&oacute;n de los derechos de autor.
Estaba claro que un sistema de producci&oacute;n basado en compartir informaci&oacute;n
deb&iacute;a establecer una serie de garant&iacute;as sobre la paternidad y los derechos de
uso de dicho software.
<P>Las primeras pruebas en este sentido se limitaban a garantizar que todo
trabajo basado en c&oacute;digo abierto deb&iacute;a llevar consigo los cr&eacute;ditos del
copyright del autor. No se establec&iacute;an protocolos de protecci&oacute;n de la
integridad del trabajo, o de garantizar la publicidad de todo trabajo derivado.
Igualmente, tampoco se impon&iacute;an restricciones de &iacute;ndole comercial, o de 
distribuci&oacute;n.
<P>Est&aacute; claro que esta situaci&oacute;n no pod&iacute;a llegar muy lejos. De hecho
hist&oacute;ricamente se ha podido comprobar que la ausencia de reglamentaci&oacute;n sobre
la propiedad del c&oacute;digo abierto ha redundado en un "cierre progresivo" de
dicho software, creaci&oacute;n de extensiones particulares, o incluso la negaci&oacute;n
de derechos de copyright cuando el c&oacute;digo original era relegado a ser una
m&iacute;nima parte del nuevo desarrollo. Nadie puede olvidar que el API de Microsoft
Windows fue un convenio de colaboraci&oacute;n con Apple para el desarrollo del
porting de una aplicaci&oacute;n ofim&aacute;tica al entonces naciente entorno PC. El actual
declive de los sistemas UNIX ( salvo la honrosa excepci&oacute;n de Solaris ) no 
puede ser sino el resultado de un exceso de actitudes de "abuso del cliente"
tanto en relaci&oacute;n precio/prestaciones como en falta de interoperatividad.
Incluso hoy en d&iacute;a, los intentos de unificaci&oacute;n ( UNIX System V, Common Desktop
Environment, etc. ) est&aacute;n condenados al fracaso debido a la negativa de las
partes a una colaboraci&oacute;n efectiva.
<P>Por consiguiente, la primera generaci&oacute;n de software abierto muri&oacute;
de ego&iacute;smo... dando paso a los sistemas propietarios, que si bien eran 
productos de desarrollo cerrados, constitu&iacute;an un refugio para el usuario en
cuanto a garant&iacute;a de estabilidad y continuidad. Esta situaci&oacute;n pronto degener&oacute;
en una situaci&oacute;n de monopolio "de facto", y de abuso sobre el cliente.
<P>Por supuesto, ten&iacute;a que llegar la reacci&oacute;n: ante un producto que el
usuario necesita para su productividad, y cuando dicho producto tiene que
ser adquirido en condiciones abusivas para el vendedor, la reacci&oacute;n es obvia:
hoy en d&iacute;a la pirater&iacute;a inform&aacute;tica mueve el mas del 60% del mercado mundial
de software. Como acertadamente postula Richard Stallman: "Cuando el modelo
de producci&oacute;n obliga a que mas de la mitad de los consumidores act&uacute;e en la
ilegalidad, es que algo falla en el sistema". De esta idea surge la segunda
oleada del software libre, que tiene sus or&iacute;genes en la Free Software
Foundation. 
<P>Lo que se plantea ahora es un nuevo punto de vista en el software
abierto: ya no se intercambia informaci&oacute;n porque s&iacute;, sino que se establece
un modelo empresarial, con derechos y deberes para ambas partes.
<P>
<UL>
<LI> La primera premisa es la garant&iacute;a de la propiedad: al contrario 
de lo que muchos pregonan, este modelo de software libre no renuncia
a la propiedad de la informaci&oacute;n, sino que la garantiza hasta extremos
que alguno considera abusivos. No s&oacute;lo el trabajo original es propiedad
del autor, sino que la licencia de distribuci&oacute;n obliga a que todo
trabajo derivado del original retenga el copyright de este.</LI>
<LI> La segunda premisa es mas sutil: garantiza la continuidad de el
car&aacute;cter abierto de la informaci&oacute;n. Esto que a primera vista parece
loable esconde dos motivos ocultos y llenos de repercusiones econ&oacute;micas
( que desarrollaremos en otros apartados). La primera es una garant&iacute;a
de que nadie podr&aacute; apropiarse del trabajo con fines particulares. La
segunda, y m&aacute;s sutil, garantiza la distribuci&oacute;n del trabajo hasta unos
extremos que har&iacute;an el para&iacute;so de cualquier director de marketing de
una empresa comercial.</LI>
</UL>

En torno a este modelo de desarrollo, y a esta filosof&iacute;a ha nacido lo
que hoy constituyen la estrella de los sistemas abiertos: por un lado el
n&uacute;cleo del sistema operativo Linux, y por otro, el conjunto de utilidades GNU
de la Free Software Foundation.
<P>
<DT><B>La realidad actual.</B><DD><P>Pudiera creerse que esto es todo, y que este modelo acabar&aacute; siendo
el futuro del software abierto. Es opini&oacute;n del autor que esto no es ni mucho
menos cierto:
<P>
<UL>
<LI> La licencia de uso GNU impone restricciones muy serias al 
desarrollo comercial; restricciones que muchas empresas no est&aacute;n 
dispuestas a asumir. Por ello est&aacute;n surgiendo diversas soluciones 
mixtas.</LI>
<LI> La irrupci&oacute;n de las empresas "comerciales" en el mercado del 
software libre est&aacute; provocando una desviaci&oacute;n de los objetivos de 
desarrollo desde el software en si hacia los servicios de valor 
a&ntilde;adido que se crean en torno al software libre. Sin perder su 
calidad de "apertura" ( fuertemente protegida por su licencia ), 
se desplaza el valor del software no por lo que es, sino por sus 
connotaciones y por las consecuencias de su uso.</LI>
</UL>
<P>Veremos en los pr&oacute;ximos apartados como se aplican estas tendencias.
<P>
</DL>
<H2><A NAME="ss4.5">4.5 El coste del software.</A>
</H2>

<P>
<P>Uno de los apartados que sin duda han contribuido al &eacute;xito del software
libre es su bajo coste, tanto para el cliente como para la empresa:
<P>Es un hecho que la legislaci&oacute;n europea pone ciertas trabas a la 
productividad, especialmente en el cap&iacute;tulo de inversiones: la legislaci&oacute;n 
USA permite al usuario final ( empresa o particular ) incluir como gasto 
necesario para producir rendimientos de trabajo, el resultante de las
inversiones en adquisici&oacute;n de material: un escritor puede deducir las facturas
de los bol&iacute;grafos que utiliza. En Europa, la &uacute;nica forma de conseguir la
amortizaci&oacute;n de las inversiones materiales es a trav&eacute;s de subvenciones a la
mejora de la empresa, no mediante deducciones. Por ello, el empresario europeo
mira con lupa toda inversi&oacute;n no directamente productiva. Esto, junto con
la desproporcionada relaci&oacute;n en el coste del software a cada lado del 
Atl&aacute;ntico, hace que el ritmo de actualizaci&oacute;n de equipos y de software en 
Europa sea mucho menor que en USA.
<P>
<DL>
<DT><B>¿Qui&eacute;n quiere pagar por la herramienta?</B><DD><P>Porque si el uso de una determinada aplicaci&oacute;n est&aacute; penalizado, el
cliente tiene dos opciones: la primera es buscar soluciones alternativas. El
hecho de que Europa sea un fuerte centro de empuje para el software libre no
tiene s&oacute;lo motivaciones sociales, como muchos autores sostienen cuando hablan
del "sentido de lo social y lo p&uacute;blico" en Europa; sino -y sobre todo- tiene
connotaciones econ&oacute;micas: la independencia tecnol&oacute;gica, la mejora de la
balanza comercial, etc. son argumentos b&aacute;sicos en un entorno de libre mercado.
En un apartado posterior estudiaremos con detalle la pol&iacute;tica europea respecto
al software libre.
<P>
<DT><B>El hecho de la pirater&iacute;a inform&aacute;tica.</B><DD><P>La segunda soluci&oacute;n a la penalizaci&oacute;n de la inversi&oacute;n tecnol&oacute;gica es
la m&aacute;s simple: la copia ilegal. Est&aacute; demostrado que el cliente no copia ( salvo
comportamientos compulsivos ) si el coste del producto original es s&oacute;lo 
ligeramente superior al coste de copia. Como la situaci&oacute;n de abuso de las
empresas no s&oacute;lo se limita al coste del producto, sino al p&eacute;simo servicio post
venta, el cliente acaba concluyendo que la pirater&iacute;a no s&oacute;lo es justa, sino 
necesaria, y un deber para su "salvaci&oacute;n empresarial" ( que me perdonen los
creyentes cat&oacute;licos por este juego de palabras: no es m&iacute;o -N. del A.- )
A esto se junta el hecho de que la gran mayor&iacute;a de las casas comerciales
no hacen realmente una persecuci&oacute;n seria del hecho de la pirater&iacute;a. Todo vale
para crear clientes cautivos, que necesitaran cursos, documentaci&oacute;n, soporte...
y que acabar&aacute;n pagando de una u otra forma.
<P>
<DT><B>Minimizar los costes de instalaci&oacute;n.</B><DD><P>Un &uacute;ltimo aspecto sobre el uso empresarial del software tanto libre como
comercial. Muchas empresas no son conscientes de los costes a largo plazo del
uso de un determinado paquete ofim&aacute;tico o de un sistema operativo. Es f&aacute;cil 
tener una mentalidad a corto plazo, y buscar el minimizar los costes de
instalaci&oacute;n, confiando en la providencia a la hora de evaluar los costes de 
mantenimiento. La empresa que conf&iacute;a en el software libre debe ser consciente de
que dicho software no es tan barato a medio plazo, a menos que este dispuesta a
una inversi&oacute;n adicional en mantenimiento y seguimiento de dicho software ( ver
el apartado "las trampas del software libre" ).
</DL>
<P>
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-5.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-3.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc4">Índice general</A>
</BODY>
</HTML>
