<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: El Software Libre: un producto pol&iacute;ticamente correcto.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-10.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-8.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc9" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-10.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-8.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc9">Índice general</A>
<HR>
<H2><A NAME="politica"></A> <A NAME="s9">9. El Software Libre: un producto pol&iacute;ticamente correcto.</A></H2>

<P>
<H2><A NAME="ss9.1">9.1 Resumen del cap&iacute;tulo.</A>
        </H2>

<P>
<UL>
<LI> ¿Un modelo socialista?.</LI>
<LI> Independencia econ&oacute;mica y empresarial.</LI>
<LI> El software libre en la universidad.</LI>
<LI> El punto de vista del usuario.</LI>
<LI> Frentes econ&oacute;micos: EEUU versus Europa.</LI>
<LI> Por qu&eacute; Europa apoya el software libre.         </LI>
</UL>
<P>Analicemos a continuaci&oacute;n una serie de aspectos pol&iacute;ticos y sociales
que han surgido alrededor del software libre. Con independencia de las
motivaciones, modelos matem&aacute;ticos, y -por qu&eacute; no decirlo- la ayuda que recibe
debido a la falta de calidad del software comercial, es un hecho que el
software libre est&aacute; "de moda". No s&oacute;lo eso, sino que es tomado ya en serio
por pol&iacute;ticos, gobiernos, y por aquellos estamentos que tradicionalmente 
han detentado el poder.  La fuerza arrolladora de este movimiento no ser&iacute;a tal
sin el apoyo de estos estamentos.
<P>Conforme al esp&iacute;ritu de este ensayo, creo que en este movimiento hay
tambi&eacute;n una serie de intereses, muchas veces econ&oacute;micos, que hacen que, por
ejemplo, la comisi&oacute;n europea se plantee temas como la utilizaci&oacute;n de formatos
de documentaci&oacute;n abiertos en sus m&eacute;todos de trabajo, o que el ministerio de
defensa franc&eacute;s utilice Linux como sistema operativo...
<P>
<H2><A NAME="ss9.2">9.2 ¿El socialismo del software?.</A>
</H2>

<P>Muchos pensadores dicen que el software libre es un modelo de trabajo
que equipara a todos los miembros de la comunidad en cuanto al acceso a la
informaci&oacute;n. Postulan, no sin raz&oacute;n, que en muchas ocasiones la legislaci&oacute;n
de protecci&oacute;n de patentes y de software impone l&iacute;mites al desarrollo del
conocimiento humano, y mantiene las barreras de poder existentes en la
actualidad. Afirman que el software libre proporciona un modelo "socialista"
de distribuci&oacute;n y acceso al conocimiento. Es opini&oacute;n del autor que no es
exactamente cierto: como vimos en el primer cap&iacute;tulo el acceso a la
informaci&oacute;n no es garant&iacute;a de conocimiento, ni mucho menos de poder. Es
perfectamente posible, utilizando las t&eacute;cnicas descritas, utilizar el 
modelo de desarrollo del software libre con criterios empresariales, y como
muchas empresas est&aacute;n demostrando hoy en d&iacute;a, no s&oacute;lo obtener beneficios, sino
que en algunos casos, como pueda ser Apache Inc. o Sendmail Inc. constituir lo
que son de hecho monopolios en el software.
<P>Pues el principio de selecci&oacute;n biol&oacute;gica y de ocupaci&oacute;n de nichos se
aplica por igual a todo tipo de software, con independencia de su origen. Al
mercado no le importa si el servidor web es p&uacute;blico o no: mirar&aacute; su relaci&oacute;n
coste-calidad, y escoger&aacute; el mejor. El software libre no es la panacea, sino
que s&oacute;lo lo es si es adem&aacute;s bueno. No obstante cuenta con la inestimable 
ventaja de que desbanca muy r&aacute;pidamente a cualquier otro competidor 
-libre o de pago- de inferior calidad.
<P>
<H2><A NAME="ss9.3">9.3 Independencia tecnol&oacute;gica y balanza comercial.</A>
</H2>

<P>
<P>Lo que s&iacute; es cierto es que a los gobiernos les proporciona
independencia respecto de otros pa&iacute;ses: las tasas y aranceles de importaci&oacute;n
son nulos, y el uso de software libre favorece la balanza comercial. Por
otro lado, a medio plazo , y con unos buenos planes de desarrollo, puede 
tender a hacer disminuir la desventaja tecnol&oacute;gica entre pa&iacute;ses. Desde
este punto de vista no es de extra&ntilde;ar que los pa&iacute;ses tecnol&oacute;gicamente
"fuertes" pongan trabas a la exportaci&oacute;n de tecnolog&iacute;a, y sean los que m&aacute;s
f&eacute;rreo control -ideolog&iacute;as aparte- intentan ejercer sobre Internet. Las 
restricciones de Estados Unidos a la exportaci&oacute;n de tecnolog&iacute;as de
encriptaci&oacute;n de datos son un ejemplo de este movimiento. Modelos 
simulados de partidas del dilema del preso, muestran como los
participantes "d&eacute;biles" tienden a agruparse y a colaborar entre si, 
dejando de lado al "fuerte".
<P>La dependencia tecnol&oacute;gica y los altos costes de la importaci&oacute;n de
software for&aacute;neo se hacen m&aacute;s evidentes en aquellos entornos donde dicha
tecnolog&iacute;a es necesaria para el trabajo. No puede extra&ntilde;ar a nadie que en
un estamento p&uacute;blico, o una ONG, o en cualquier sitio que tenga que
ajustar presupuestos, asuste la sola idea de tener que renovar todo el
parque inform&aacute;tico para actualizarse a la "&uacute;ltima versi&oacute;n de XXXX98R2" que
"corrige errores y se bloquea menos".  ¿C&oacute;mo se puede aceptar que un
software comercial se bloquee, el vendedor quede libre de toda 
responsabilidad , y encima pagar por una nueva versi&oacute;n, que el vendedor
sigue reconociendo que tampoco funciona bien?. 
<P>
<H2><A NAME="ss9.4">9.4 La universidad y los centros de investigaci&oacute;n.</A>
</H2>

<P>
<P>Del mismo modo, en los centros de investigaci&oacute;n es preciso 
investigar: no s&oacute;lo se debe utilizar un programa, sino que se debe 
aprender su tecnolog&iacute;a y dise&ntilde;o, se deben poder estudiar alternativas...
en fin, es preciso que el software sea algo m&aacute;s que una herramienta de
trabajo: debe ser tambi&eacute;n objeto del trabajo.
No puede extra&ntilde;arnos, pues que las universidades y centros de
investigaci&oacute;n no s&oacute;lo hayan sido -y contin&uacute;en siendo- cuna del software
libre, sino que hasta ahora han sido los principales usuarios y clientes 
de dicho software. La irrupci&oacute;n del mundo comercial ha derivado el esfuerzo
hacia el cliente final -que es el que paga-, pero a&uacute;n as&iacute; la universidad
es uno de los impulsores b&aacute;sicos de dicho modelo. Adem&aacute;s es una baza 
de cara a las generaciones futuras: cada a&ntilde;o miles de estudiantes que
han estado conviviendo y utilizando el software libre salen al mercado
de trabajo con todo ese bagaje a sus espaldas, y utilizar&aacute;n y potenciar&aacute;n
dicho software en aquellas empresas donde trabajen.... El modelo se 
realimenta de nuevo. Las casas comerciales luchan contra este efecto mediante
las denominadas "tarifas de estudiante", "licencias campus", etc... pero
aunque puedan introducirse en las facetas "ofim&aacute;ticas" de la inform&aacute;tica, no
pueden meterse en las de desarrollo e investigaci&oacute;n.
<P>
<H2><A NAME="ss9.5">9.5 El punto de vista del usuario.</A>
</H2>

<P>
<P>Por &uacute;ltimo queda el punto de vista del cliente: no hablamos del
voluntario-programador, sino del que paga por la documentaci&oacute;n, el que
recibe cursos, contrata mantenimientos, etc... El software libre le
proporciona ventajas econ&oacute;micas, incluso a igualdad de precio del
software:
<UL>
<LI>La posibilidad de escoger distribuidor.</LI>
<LI>Un servicio t&eacute;cnico mucho m&aacute;s eficiente y r&aacute;pido que el de un
software comercial ( adi&oacute;s al "no se puede" o "reinstale de nuevo" ).</LI>
<LI>La posibilidad de sugerir, o incluso a&ntilde;adir por su cuenta aquellas
funcionalidades que necesite.   </LI>
</UL>

No todo es color de rosa: el cliente deber&aacute; conocer perfectamente
el mundo Internet, y deber&aacute; ser capaz de poder asumir el papel de "control
de calidad" del software. Afortunadamente hoy en d&iacute;a la calidad del software
libre de uso en explotaci&oacute;n es tan grande que el cliente s&oacute;lo se tiene que
preocupar de buscar fallos en raras ocasiones.
A pesar de todo, y sobre todo en empresas de bajo presupuesto en
equipamiento, la utilizaci&oacute;n de software libre es una necesidad ( a menos que
se prefiera lidiar con el software "pirata".... ).
<P>
<H2><A NAME="ss9.6">9.6 La actitud de Europa frente al software libre.</A>
</H2>

<P>
<P>A este entorno hay que a&ntilde;adir el concepto de "cultura de lo social".
La protecci&oacute;n de derechos del individuo, la cultura del bienestar, el
concepto de lo pol&iacute;ticamente correcto, la lucha contra los monopolios 
tanto tecnol&oacute;gicos, como econ&oacute;micos, como culturales, hacen que Europa sea
un caldo de cultivo ideal para una econom&iacute;a del software libre. La dependencia
tecnol&oacute;gica con Estados Unidos, y la ausencia de empresas l&iacute;der en el mundo
del software en Europa, hacen que la Uni&oacute;n europea tenga una postura neutral
-cuando no favorable- a este movimiento. Eso sin contar con los beneficios
econ&oacute;micos que reporta a la balanza comercial con los Estados Unidos....
<P>As&iacute; pues, si para otras culturas o pa&iacute;ses en v&iacute;as de desarrollo, el
consumo de software libre es una necesidad, por motivos puramente econ&oacute;micos;
en el caso de Europa es una v&iacute;a de poder. La Uni&oacute;n Europea dedica un gran
cap&iacute;tulo de gastos al apartado de investigaci&oacute;n y desarrollo tecnol&oacute;gico.
<P>Desde este planteamiento, el uso de software libre es un aliciente 
para la econom&iacute;a europea. Bruselas est&aacute; estudiando y legislando la inform&aacute;tica
con el objetivo de la independencia tecnol&oacute;gica y comercial. Est&aacute;n en estudio
temas como la criptograf&iacute;a, los modelos de documentaci&oacute;n, de comercio
electr&oacute;nico. Existe legislaci&oacute;n europea sobre tratamiento de informaci&oacute;n,
propiedad intelectual.... Y siempre orientada con los principios del estado
de bienestar europeo. Para Europa, el software libre es "pol&iacute;ticamente
correcto"... siempre y cuando produzca beneficios.
<P>El mundo Linux es un ejemplo de producto que se vende como "europeo":
naci&oacute; en Finlandia, con multitud de desarrolladores en Inglaterra, Finlandia,
y sobre todo Alemania, con Espa&ntilde;a trabajando activamente en temas de 
documentaci&oacute;n e internacionalizaci&oacute;n... y abriendo el mercado al mundo
hispanoamericano. Linux se usa en la mayor parte de las universidades y
centros de investigaci&oacute;n europeos, en el ministerio de defensa franc&eacute;s...
El CERN fue la cuna del World Wide Web, del HTML, y del comienzo del acceso
sencillo a los conocimientos de la red.... Es una situaci&oacute;n que no se puede
dejar de tener en cuenta; y por supuesto, de aprovechar comercialmente.
<P>
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-10.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-8.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc9">Índice general</A>
</BODY>
</HTML>
