<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Pr&oacute;logo.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-2.html" REL=next>

 <LINK HREF="La_empresa_ante_el_software_libre.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-2.html">Página siguiente</A>
Página anterior
<A HREF="La_empresa_ante_el_software_libre.html#toc1">Índice general</A>
<HR>
<H2><A NAME="prologo"></A> <A NAME="s1">1. Pr&oacute;logo.</A></H2>

<P>El software libre est&aacute; de moda. Internet est&aacute; de moda. Dos
hechos que no son entendibles el uno sin el otro. Se ha escrito
mucho acerca de estos fen&oacute;menos, de sus repercusiones y de su futuro.
<P>Pero un nuevo elemento acaba de entrar en escena: las empresas
comerciales han visto en el software libre, primero un competidor, y
posteriormente una fuente de negocios. Este efecto nunca hab&iacute;a sucedido,
y mucho menos ha sido estudiado.... ¿o si?
<P>Porque a la hora de plantearme la pregunta b&aacute;sica de qu&eacute; es lo
que impulsa a una empresa cuyo objetivo es la obtenci&oacute;n de ganancias
econ&oacute;micas, a participar en proyectos, aparentemente altruistas, realizados
por voluntarios, sin m&aacute;s herramienta de coordinaci&oacute;n que Internet, he
tenido que consultar multitud de fuentes, de tratados de filosof&iacute;a,
sociolog&iacute;a, econom&iacute;a... buscando modelos matem&aacute;ticos, e incluso textos
sobre el comportamiento animal. No creo haber descubierto nada nuevo, sino
que este ensayo es un intento -espero que feliz- de adaptar teor&iacute;as
aplicadas en otros campos del conocimiento, a las t&eacute;cnicas de desarrollo
del software libre, con el fin de demostrar su viabilidad comercial
<P>Reconozco que la formaci&oacute;n excesivamente t&eacute;cnica ha sido y es un serio
obst&aacute;culo para mostrar al lector un desarrollo coherente. Pido disculpas
por ello, y aceptar&eacute; gustoso las correcciones y anotaciones que los 
lectores me hagan llegar.
<P>Quiero dar gracias a todas las personas que han hecho que un 
aspirante a ingeniero como yo, se apasione con la sociolog&iacute;a. Es triste 
que la orientaci&oacute;n de los estudios de ingenier&iacute;a en las universidades 
espa&ntilde;olas tienda a dejar a un lado lo que deber&iacute;a ser un pilar b&aacute;sico de
la formaci&oacute;n del ingeniero, convirti&eacute;ndolo en poco m&aacute;s que una asignatura
marginal. 
<P>Este ensayo, presupone que el lector est&aacute; familiarizado con el
concepto y definici&oacute;n de software libre y de su modelo de desarrollo. 
As&iacute;, conceptos como "software libre y software propietario", "la catedral y 
el bazar", as&iacute; como las diversas licencias de software libre son conocidas
y comprendidas por el lector. En caso de no ser as&iacute; remito al lector a la
bibliograf&iacute;a incluida en el Ap&eacute;ndice. Recomiendo la lectura del ensayo
<EM>"Apuntes sobre Software Libre"</EM> de Jes&uacute;s Gonz&aacute;lez Barahona, como
lectura obligada para todo aquel que sea nuevo en este tema. 
<P>Una &uacute;ltima recomendaci&oacute;n: algunos p&aacute;rrafos de este ensayo
son duros, pues muestran un punto de vista sobre el software libre, que
muchos considerar&aacute;n falto de &eacute;tica e incluso contrario a su filosof&iacute;a. El
concepto de moral utilitarista es muy pol&iacute;ticamente incorrecto, y su 
exposici&oacute;n dar&aacute; sin duda lugar a pol&eacute;micas. Una lectura sin prejuicios
ayudar&aacute; a comprender nuevos puntos de vista, que no necesariamente son
compartidos por el autor.
<P>Un Saludo
<P>Juan Antonio Mart&iacute;nez Casta&ntilde;o
<P>Madrid, Marzo-Abril de 1999
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-2.html">Página siguiente</A>
Página anterior
<A HREF="La_empresa_ante_el_software_libre.html#toc1">Índice general</A>
</BODY>
</HTML>
