<HTML>
<HEAD>
<TITLE>CDROM-COMO: Respuestas a las Preguntas de Uso m&aacute;s Frecuente (PUFs)</TITLE>
</HEAD>
<BODY>
<A HREF="CDRom-Como-5.html">Anterior</A>
<A HREF="CDRom-Como-7.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Respuestas a las Preguntas de Uso m&aacute;s Frecuente (PUFs)</A></H2>



<H2><A NAME="ss6.1">6.1 ¿C&oacute;mo hacer que cualquier usuario (no root) pueda montar y desmontar los CDs?</A></H2>


<P>Pr&aacute;cticamente todos los comandos <CODE>mount</CODE> soportan la opci&oacute;n
<EM>user</EM>. Introduciendo una l&iacute;nea como la que sigue en el fichero
<CODE>/etc/fstab</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/dev/sbpcd  /mnt/cdrom   iso9660     user,noauto,ro
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>...cualquier usuario podr&aacute; montar y desmontar la unidad, de la siguiente
manera: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
mount /mnt/cdrom
umount /mnt/cdrom
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El disco, por razones de seguridad, ser&aacute; montado con algunas limitaciones
(p.e. los programas no podr&aacute;n ser ejecutados, los archivos de dispositivo
se ignorar&aacute;n...); esto puede resultar demasiado restrictivo en algunos
casos. </P>
<P>Otra opci&oacute;n es conseguir el paquete <CODE>usermount</CODE>, que habilita para
los usuarios normales el montado y desmontado de dispositivos extra&iacute;bles,
tales como discos y CDROM, pero que restringe el acceso a otros (como las
particiones del disco duro). Se puede encontrar en casi todos los bancos
de archivos. </P>
<P>En <CODE>
<A HREF="ftp://ftp.cdrom.com">ftp://ftp.cdrom.com</A></CODE>
se halla el c&oacute;digo fuente <CODE>mount.c</CODE>, que permite el montado y
desmontado de CD-ROM (&uacute;nicamente) por usuarios normales.</P>


<H2><A NAME="ss6.2">6.2 ¿Por qu&eacute; obtengo "device is busy (dispositivo ocupado)" a la hora</A>de desmontar el CD-ROM?</H2>


<P>Un disco no puede ser desmontado mientras haya alg&uacute;n proceso accediendo a
la unidad, lo que incluye el hecho de que nos encontremos en alguno de los
directorios asignados a la misma. Si no puede identificar el proceso que
la esta usando, puede emplear el comando <CODE>fuser</CODE>, tal y como se
muestra a continuaci&oacute;n:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
umount /cdrom
umount: /dev/hdd: device is busy
fuser -v /cdrom
                     USER       PID ACCESS COMMAND
/mnt/cdrom           tranter    133 ..c..  bash
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss6.3">6.3 ¿C&oacute;mo puedo exportar un CD-ROM a otra m&aacute;quina v&iacute;a NFS?</A></H2>


<P>Para ello es preciso a&ntilde;adir una l&iacute;nea al archivo <CODE>/etc/exports</CODE>.
Para m&aacute;s detalles, consulte la p&aacute;gina man <CODE>exports(5)</CODE>. </P>


<H2><A NAME="ss6.4">6.4 ¿Es posible arrancar Linux desde un CD-ROM?</A></H2>


<P>Para instalar Linux, el m&eacute;todo m&aacute;s com&uacute;n es utilizar un disco de arranque.
Algunas distribuciones vienen preparadas para arrancar el n&uacute;cleo de Linux
utilizando un CDROM directamente desde el DOS. </P>
<P>Michael Fulbright (<CODE>
<A HREF="mailto:msf@redhat.com">msf@redhat.com</A></CODE>) explica c&oacute;mo, con un CDROM, la ROM-BIOS y una
unidad ATAPI es posible arrancar directamente desde el CD. La &uacute;ltima
version de <CODE>mkisofs</CODE> tambi&eacute;n soporta la creaci&oacute;n de dichos CDRoms.
Para ello, se ha tenido que a&ntilde;adir una serie parches para soportar el
est&aacute;ndar de discos de arranque <I>El Torito</I>. </P>


<H2><A NAME="ss6.5">6.5 ¿C&oacute;mo puedo leer la informaci&oacute;n digital de un CD-Audio?</A></H2>


<P>Heiko Eissfeldt (<CODE>
<A HREF="mailto:heiko@colossus.escape.de">heiko@colossus..escape.de</A></CODE>) y Olaf Kindel han escrito una
utilidad que lee y graba los datos de audio archivos de formato
<CODE>.wav</CODE>. El paquete se llama <CODE>cdda2wav.tar.gz</CODE> y se
encuentra en <CODE>sunsite.unc.edu</CODE>.</P>
<P>A consecuencia del r&aacute;pido desarrollo que est&aacute;n experimentando las unidades
de CD-ROM, es casi imposible hacer una lista completa de los modelos que
soportan la extracci&oacute;n digital de audio. Lo mejor ser&aacute; que consiga la
&uacute;ltima versi&oacute;n de paquete <CODE>cdda2wav</CODE> y lea la documentaci&oacute;n.</P>
<P>Para m&aacute;s informaci&oacute;n al respecto, visite la p&aacute;gina web <CODE>
<A HREF="http://www.tardis.ed.ac.uk/~psyche/cdda/">http://www.tardis.ed.ac.uk/~psyche/cdda/</A></CODE> y las FAQ de
<CODE>alt.cdrom</CODE> (secci&oacute;n de Referencias).</P>


<H2><A NAME="ss6.6">6.6 ¿Por que el comando <CODE>find</CODE> no funciona correctamente?</A></H2>


<P>Al utilizar discos formateados con el sistema ISO-9660, pero que carecen
de las Extensiones Rock Ridge, hay que a&ntilde;adir la opci&oacute;n <CODE>-noleaf</CODE>
al comando <CODE>find</CODE>.  Consulte la p&aacute;gina del manual <CODE>find(1)</CODE> para
m&aacute;s detalles.</P>
<P>(Hoy en d&iacute;a todos los CDs de Linux emplean las Extensiones Rock Ridge, por
lo que este problema se plantear&aacute; raras veces.) </P>


<H2><A NAME="ss6.7">6.7 ¿Soporta Linux alguna unidad grabadora de CD-ROM?</A></H2>


<P>El paquete X-CD-Roast es una aplicaci&oacute;n gr&aacute;fica dise&ntilde;ada para la
utilizaci&oacute;n de grabadoras de CD-ROM bajo Linux. Se puede encontrar en
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/xcdroast-0.95.tar.gz">ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/xcdroast-0.95.tar.gz</A></CODE></P>
<P>Consulte tambi&eacute;n el CD-Writing HOWTO, que est&aacute; disponible en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/CD-Writing.html">ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO/CD-Writing.html</A></CODE> &oacute;
<CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/CD-Writing.html">http://sunsite.unc.edu/LDP/HOWTO/CD-Writing.html</A></CODE>.</P>


<H2><A NAME="ss6.8">6.8 ¿Por qu&eacute; obtengo "<CODE>mount: Read-only file system</CODE> (sistema de</A>ficheros de solo-lectura)" al montar un CD-ROM?</H2>


<P>El CD-ROM es un medio de almacenamiento de s&oacute;lo-lectura. Con alguno de los
n&uacute;cleos m&aacute;s antiguos se pod&iacute;a montar CDROM para lectura/escritura; los
intentos de escribir datos en el CDROM eran ignorados. Esto ha sido
corregido a partir del n&uacute;cleo 1.1.33, con el que los CDROM han de montarse
como de s&oacute;lo-lectura (con la opci&oacute;n -r del comando <CODE>mount</CODE>). </P>


<H2><A NAME="ss6.9">6.9 ¿Por qu&eacute; se abre la bandeja de la unidad cuando apago el sistema?</A></H2>


<P>A partir de la versi&oacute;n 1.1.38 del n&uacute;cleo, el controlador <CODE>sbpcd</CODE>
realiza autom&aacute;ticamente la extracci&oacute;n del CD al ser desmontado. Al apagar
el sistema, se desmonta el CD, lo que provoca su extracci&oacute;n. Esta
caracter&iacute;stica resulta de utilidad a la hora de cambiar los CDs. Si la
bandeja est&aacute; abierta, cuando monte un CD se cerrar&aacute; autom&aacute;ticamente.</P>
<P>He comprobado que esto ocasiona algunos problemas al utilizar algunos
programas (p.ej. el <CODE>cdplay</CODE> y el <CODE>workbone</CODE>). A partir del n&uacute;cleo
1.1.60 es posible controlar dicha caracter&iacute;stica por medio de software. Un
programa de ejemplo viene inclu&iacute;do con el archivo de documentaci&oacute;n del
<CODE>sbpcd</CODE> (o tambi&eacute;n puede usar el programa <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/eject-1.4.tar.gz">ftp://sunsite.unc.edu/pub/Linux/utils/disk-management/eject-1.4.tar.gz</A></CODE>. </P>


<H2><A NAME="ss6.10">6.10 Tengo un CD "quiquilloso" que no consigo montar</A></H2>


<P>Ese disco ``quisquilloso'' seguramente sea un disco XA (como todos los
PhotoCD y los ``one-offs'' generados con unidades CD-R). La mayor parte de
los controladores del n&uacute;cleo no soportan discos XA, pero seguramente podr&aacute;
encontrar alg&uacute;n parche para a&ntilde;adir dicho soporte en alguno de los
m&uacute;ltiples bancos de archivos. El <CODE>sbpcd</CODE> s&iacute; que soporta discos XA. Si
utiliza dicho controlador, podr&aacute; comprobar si el disco es efectivamente
XA, de la siguiente manera: Edite el fichero sbpcd y active la
visualizaci&oacute;n de la "Tabla de Contenidos" (<I>Table of Contents</I>) (TOC).
Compile, instale y arranque de nuevo el n&uacute;cleo. Ahora, cada vez que monte
un disco, podr&aacute; leer la informaci&oacute;n de la Tabla de Contenidos (bien en la
pantalla o en un fichero log). Si el primer valor que aparece en la
primera linea es un "20", quiere decir que se trata de un disco XA. Dicho
valor sera "00" cuando monte discos normales. Si en la Tabla de Contenidos
hay varias pistas, significa tambi&eacute;n que se trata de un disco XA. </P>
<P>(gracias a Eberhard Moenkeberg por esta informaci&oacute;n)</P>
<P>Otras posibilidades que pueden imposibilitar la lectura de CDs:</P>
<P>
<OL>
<LI>El disco no utiliza el sistema de ficheros ISO-9660 (p.e. algunos
utilizan SunOS o HFS) </LI>
<LI>Se trata de un CD-Audio</LI>
<LI>El CD esta da&ntilde;ado o es defectuoso</LI>
<LI>Lo ha insertado del rev&eacute;s :-)</LI>
</OL>
</P>


<H2><A NAME="ss6.11">6.11 ¿Funcionan bajo Linux las unidades de CD-ROM multi-disco?</A></H2>


<P>Hay much*s usuarios satisfech*s del funcionamiento de las intercambiadoras
de CD-ROM multi-disco SCSI. Es probable que deba activar la opci&oacute;n "Probe
all LUNs on each SCSI device" durante la configuraci&oacute;n del n&uacute;cleo. Al
menos un usuario ha tenido que incrementar el valor SCSI timeout en el
controlador del n&uacute;cleo. Las intercambiadoras Nakamichi MBR-7 de 7 discos y
la Pioneer de 12 discos funcionan correctamente.  Tambi&eacute;n est&aacute;n soportadas
las intercambiadoras multi-disco EIDE/ATAPI. El soporte implementado para
algunas unidades (utilizando la funci&oacute;n CDROM_SELECT_DISC ioctl) con el
n&uacute;cleo 2.0 resulta un tanto rudimentario. En el archivo de documentaci&oacute;n
del controlador del n&uacute;cleo IDE-CD viene inclu&iacute;do el c&oacute;digo fuente de un
programa para seleccionar el plato, o tambi&eacute;n puede utilizar una versi&oacute;n
reciente del programa <CODE>eject</CODE>, descrito anteriormente. </P>


<H2><A NAME="ss6.12">6.12 Obtengo "<CODE>/cdrom: Permission denied</CODE>"</A></H2>


<P>Algunos CDs poseen archivos que se encuentran en directorios cuyo permiso
de lectura est&aacute; restringido al modo <CODE>root</CODE>. Algo as&iacute; ocurr&iacute;a con la
edici&oacute;n de InfoMagic de Marzo de 1995. </P>
<P>El siguiente parche, cortes&iacute;a de Christoph Lameter (<CODE>
<A HREF="mailto:clameter@waterf.org">clameter@waterf.org</A></CODE>) permite
solventar el problema.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
From: clameter@waterf.org (Christoph Lameter)
Newsgroups: comp.os.linux.setup
Subject: InfoMagic Developers Set: Fix for CD-ROM permissions
Date: 12 Apr 1995 20:32:03 -0700
Organization: The Water Fountain - Mining for streams of Living Water
NNTP-Posting-Host: waterf.org
X-Newsreader: TIN [version 1.2 PL2]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><I>En la edici&oacute;n de InfoMagic Developers CD-ROM Set de Marzo de 1995 se
plantean una serie de problemas con la informaci&oacute;n almacenada en
directorios cuyos permisos quedan restringidos al root. </I></P>
<P>
<OL>
<LI>En el Disco1 los valores de propietario/grupo est&aacute;n fijados con los
valores 5101/51 y tienen permiso de escritura (?)
</LI>
<LI>El Disco2 y 3 vienen con permisos <CODE>rwx</CODE> para root y ning&uacute;n
permiso para grupo/usuario. ¡S&oacute;lo como root es posible acceder a ellos! Yo
mantengo una BBS y necesito tenerlos disponibles para otr*s. </LI>
</OL>
</P>
<P><I>Hay varias soluciones. El problema estriba en que, por lo com&uacute;n, estos
arreglos cambian los permisos de todos los directorios del CD. El parche
que viene a continuaci&oacute;n s&oacute;lo cambia los permisos para el directorio root
del CD-ROM. Si quiere hacer correr partes de Linux directamente desde el
CD-ROM, probablemente se vea en un aprieto tanto si todos los directorios
pueden ser accedidos para lectura por todos los usuarios como si son
propiedad del root.</I></P>
<P><I>Con este parche, los permisos del directorio root quedar&aacute;n fijados como
<CODE>r-xr-xr-x</CODE>, y los valores de propietario/grupo ser&aacute;n los indicados a
trav&eacute;s de las opciones uid y gid del comando <CODE>mount</CODE>.</I></P>
<P><I>Para aplicarlo:</I></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 cd /usr/src/linux/fs/isofs
 patch &lt; parche
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><I>...y recompile el n&uacute;cleo (puede que tenga que aplicar el parche a mano,
dependiendo de su versi&oacute;n del n&uacute;cleo). </I></P>
<P><I>Este es el fichero <CODE>parche</CODE>:</I></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
--- inode.c.ORIG        Wed Apr 12 17:24:36 1995
+++ inode.c     Wed Apr 12 17:59:12 1995
@@ -552,7 +552,15 @@
    numeros de la estructura de inodos */
 
        if (!high_sierra)
-         parse_rock_ridge_inode(raw_inode, inode);
+       {  parse_rock_ridge_inode(raw_inode, inode);
+           /*comprobacion de los permisos de acceso de propietario CL al directorio root*/
+          if((inode-&gt;i_sb-&gt;u.isofs_sb.s_firstdatazone) == inode-&gt;i_ino)
+           { /*sustitucion de los permisos de propietario por los introducidos mediante el comando mount*/
+             inode-&gt;i_uid = inode-&gt;i_sb-&gt;u.isofs_sb.s_uid;
+             inode-&gt;i_gid = inode-&gt;i_sb-&gt;u.isofs_sb.s_gid;
+            inode-&gt;i_mode = S_IRUGO | S_IXUGO | S_IFDIR;
+           }
+        }
        
 #ifdef DEBUG
        printk(&quot;Inode: %x extent: %x\n&quot;,inode-&gt;i_ino, inode-&gt;u.isofs_i.i_first_extent);
@@ -805,4 +813,3 @@
 }
 
 #endif
-
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Tenga en cuenta que este parche es algo antiguo y probablemente no
podr&aacute; aplicarse tal cual a versiones m&aacute;s recientes del n&uacute;cleo (a partir de
la 2.0). Consulte tambi&eacute;n la secci&oacute;n referente a los ficheros ocultos. </P>


<H2><A NAME="ss6.13">6.13 ¿C&oacute;mo he de interpretar los mensajes de error del n&uacute;cleo referentes</A>al CD IDE?</H2>


<P>¿Qu&eacute; significa cuando obtengo un mensaje del controlado IDE de la manera
<CODE>hdxx: code: xx key: x asc: xx ascq: x</CODE>? </P>
<P>Se trata de un mensaje de status/error de la unidad IDE. Por defecto el
controlador IDECD env&iacute;a a una salida las informaciones, en vez de gastar
espacio del n&uacute;cleo con mensajes de error. Esto puede cambiarse, para poder
visualizar los mensajes de error directamente, editando el archivo
<CODE>/usr/src/linux/drivers/block/ide-cd.c</CODE>, cambiando el valor de
<CODE>VERBOSE_IDE_CD_ERRORS</CODE> a 1, y recompilando el n&uacute;cleo. </P>


<H2><A NAME="ss6.14">6.14 ¿C&oacute;mo puedo comprobar la velocidad de mi CD-ROM?</A></H2>


<P>He aqu&iacute; un m&eacute;todo. Estas instrucciones miden el tiempo que se tardan en leer 1500K desde el CD:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
time -p dd if=/dev/cdrom of=/dev/null bs=1k count=1500
1500+0 records in
1500+0 records out
real 5.24
user 0.03
sys 5.07
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El rango de transferencia a velocidad sencilla es de 150kb/segundo, osea,
que tardar&aacute; unos 10 segundos. A doble velocidad, tardar&aacute; 5 segundos; a
cu&aacute;druple, 2.5 segundos...etc</P>
<P>El valor m&aacute;s fiable es el de "real", que en nuestro ejemplo indica una
unidad de doble velocidad. Vd puede incrementar la cantidad de datos
transferidos para as&iacute; obtener un valor m&aacute;s exacto (los datos no se
almacenan). Lo mejor ser&iacute;a ejecutar varias veces el comando y, a
continuaci&oacute;n, hallar la media. </P>


<H2><A NAME="ss6.15">6.15 Mi CD-ROM dej&oacute; de funcionar despu&eacute;s de completar la instalaci&oacute;n de</A>Linux</H2>


<P>Lo m&aacute;s seguro es que el disco de arranque utilizado para instalar Linux
haya reconocido su unidad de CD-ROM. Pero una vez terminado el proceso de
instalaci&oacute;n en el disco duro o en floppy y tras reinicializar el
ordenador, el CD-ROM deja de ser reconocido. </P>
<P>Esto suele ser debido a que, con algunas distribuciones de Linux, el
n&uacute;cleo que se instala en el disco duro o floppy no es necesariamente el
mismo del disco de arranque. Vd seleccion&oacute; un disco de arranque adecuado
al hardware de su CD-ROM, mientras que el n&uacute;cleo que acaba de instalar es
un n&uacute;cleo "gen&eacute;rico" sin soporte para CD-ROM. Puede comprobarlo siguiendo
los pasos detallados en la secci&oacute;n 
<A HREF="CDRom-Como-4.html#Problemillas">Problemillas</A> (p.e. empiece
comprobando el archivo <CODE>/proc/devices</CODE>).</P>
<P>La soluci&oacute;n pasa por recompilar el n&uacute;cleo, asegurarse de incluir los
controladores necesarios para su unidad y todo lo dem&aacute;s (p.e. controlador
SCSI, sistema de ficheros ISO-9660). Consulte <CODE>
<A HREF="http://www.insflug.org/howtos/online/kernel/Kernel-Como.html">http://www.insflug.org/howtos/online/kernel/Kernel-Como.html</A></CODE>.</P>
<P>Si ha pasado alguna opci&oacute;n desde la l&iacute;nea de comandos al disco de arranque
(<I>boot disk</I>) (p.e. "<CODE>hdc=cdrom</CODE>"), deber&aacute; a&ntilde;adirla a su fichero de
configuraci&oacute;n de arranque (<CODE>/etc/lilo.conf</CODE>).</P>


<H2><A NAME="ss6.16">6.16 No puedo leer los ficheros ocultos</A></H2>


<P>Algunos CDs tienen archivos que est&aacute;n determinados como ``ocultos''. 
Normalmente, no son visibles. Si monta el CD-ROM con la opci&oacute;n ``unhide'',
deber&iacute;an de hacerse accesibles (esto parece no estar documentado en lugar
alguno). </P>


<H2><A NAME="ss6.17">6.17 ¿D&oacute;nde se encuentra la documentaci&oacute;n de la API del CDROM?</A></H2>


<P>Si pretende escribir su propia aplicaci&oacute;n, p.e. un reproductor de CDs,
necesitar&aacute; entender la API (Interfase para la Programaci&oacute;n de
Aplicaciones) del Linux. </P>
<P>En un principio, los controladores de CD-ROM usaban sus propias funciones
<CODE>ioctl()</CODE> para dar soporte a las caracter&iacute;sticas espec&iacute;ficas de cada
unidad.</P>
<P>Esto se describe en los archivos de cabecera, p.e. en
<CODE>/usr/include/linux/sbpcd.h</CODE>. Puesto que muchos controladores
estaban basados en otros controladores, las interfases, aunque no
id&eacute;nticas, s&iacute; ten&iacute;an mucho que ver. </P>
<P>Recientemente ha surgido una iniciativa encabezada por David van Leeuwen
(<CODE>
<A HREF="mailto:david@tm.tno.nl">david@tm.tno.nl</A></CODE>)
dirigida a la estandarizaci&oacute;n de la API de las unidades de CDROM. Se trata
de asegurar el que todos los controladores presenten el mismo
comportamiento. Esto se detalla en el archivo
<CODE>/usr/src/linux/Documentation/cdrom/cdrom-standard.tex</CODE>.  Muchos
controladores del n&uacute;cleo ya lo soportan. Se espera que para futuras
versiones del n&uacute;cleo (3.0?) todos los controladores de CDROM empleen la
API est&aacute;ndar. </P>
<P>En mi libro, <EM>Linux Multimedia Guide</EM> (Guia Linux Multimedia),
entro en detalle acerca de la programaci&oacute;n de unidades de CDROM,
especialmente de cara a las funciones de audio. Vea la secci&oacute;n
<A HREF="CDRom-Como-7.html#Referencias">Referencias</A>.</P>


<H2><A NAME="ss6.18">6.18 ¿Por qu&eacute; no leo los nombres de fichero largos de este CDROM de Windows?</A></H2>


<P>Si tiene un CDROM con nombres de fichero largos bajo Windows, pero no bajo
Linux, es que ha sido formateado empleando el sistema de ficheros Joliet,
sistema propietario de Microsoft. Siga leyendo. </P>


<H2><A NAME="ss6.19">6.19 Es soportado el sistema de ficheros de Microsoft Joliet?</A></H2>


<P>Microsoft ha creado una extensi&oacute;n del formato ISO-9660 llamada Joliet. A
la hora de escribir este documento, el soporte para Joliet se encuentra
bastante avanzado y los parches se pueden obtener en <CODE>
<A HREF="http://www-plateau.cs.berkeley.edu/people/chaffee/joliet.html">http://www-plateau.cs.berkeley.edu/people/chaffee/joliet.html</A></CODE> 
o <CODE>
<A HREF="ftp://www-plateau.cs.berkeley.edu/pub/multimedia/linux/joliet/">ftp://www-plateau.cs.berkeley.edu/pub/multimedia/linux/joliet/</A></CODE>.</P>


<HR>
<A HREF="CDRom-Como-5.html">Anterior</A>
<A HREF="CDRom-Como-7.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc6">Indice</A>
</BODY>
</HTML>
