<HTML>
<HEAD>
<TITLE>CDROM-COMO: Hardware Soportado</TITLE>
</HEAD>
<BODY>
<A HREF="CDRom-Como-2.html">Anterior</A>
<A HREF="CDRom-Como-4.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Hardware Soportado</A></H2>


<P>A continuaci&oacute;n se listan los controladores (<I>drivers</I>) e interfases que
actualmente son soportados por Linux. Dicha informaci&oacute;n esta basada en el
&uacute;ltimo n&uacute;cleo estable, que a la hora de escribir este documento va por la
versi&oacute;n 2.0.31. Tambi&eacute;n se encuentran disponibles los n&uacute;cleos de
desarrollo 2.1.x, pero su estabilidad no est&aacute; garantizada. </P>
<P>Los datos que siguen a continuaci&oacute;n son v&aacute;lidos &uacute;nicamente para sistemas
Linux funcionando sobre plataformas Intel y compatibles. Aunque en su
mayor parte deber&iacute;a poder extrapolarse a procesadores basados en otras
arquitecturas, no tengo de ello informaci&oacute;n ni experiencia de primera
mano.</P>

<H2><A NAME="ss3.1">3.1 Unidades ATAPI</A></H2>


<P>ATAPI (<I>ATA Packet Interface</I>) es un protocolo dise&ntilde;ado para controlar
y gestionar dispositivos de almacenamiento masivo. Est&aacute; basado en la
interfase ATA (AT Attachment), que es la denominaci&oacute;n oficial seg&uacute;n el
est&aacute;ndar ANSI de las interfases IDE desarrolladas para las unidades de
disco duro. Los CDROM, discos duros y otros sistemas de alta capacidad de
almacenamiento suelen ser ATAPI. Adem&aacute;s de ser hoy en d&iacute;a la interfase de
m&aacute;s amplia difusi&oacute;n, ofrece unas prestaciones similares a la SCSI sin
tener que desembolsar grandes cantidades de dinero en una controladora y
cables especiales. </P>
<P>En el n&uacute;cleo de Linux viene incluido un controlador que deber&iacute;a funcionar
con cualquier unidad de CDROM ATAPI. Otros fabricantes de unidades
compatibles son Aztech, Mitsumi, NEC, Sony, Creative Labs, y Vertos. Si
Vd. ha adquirido recientemente un CDROM, y especialmente si es de 4x o
mayor, seguramente ser&aacute; IDE/ATAPI.</P>


<H2><A NAME="ss3.2">3.2 Unidades SCSI (<I>Small Computer Systems Interface</I>)</A></H2>


<P>Las principales ventajas radican en su elevada velocidad de transferencia,
compatibilidad con gran cantidad de plataformas y soporte para m&uacute;ltiples
unidades. Algunas desventajas del SCSI son la necesidad de una
controladora y cables que resultan relativamente caros...</P>
<P>Cualquier CDROM SCSI con un tama&ntilde;o de bloque (<I>block size</I>) de 512 o 2048
bytes deber&iacute;a funcionar correctamente bajo Linux; esto incluye a la mayor
parte de las unidades del mercado. </P>
<P>Tenga en cuenta que va a necesitar una controladora SCSI que sea
soportada; consulte el <CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/SCSI-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/SCSI-HOWTO.html</A></CODE> para m&aacute;s
informaci&oacute;n.</P>
<P>Algunos CDROM vienen con una controladora propietaria cuya interfase no es
100% SCSI compatible (p.e. sin soporte para m&aacute;s unidades SCSI en el bus).
Es probable que dichas unidades <B>no</B> funcionen bajo Linux. </P>


<H2><A NAME="ss3.3">3.3 Unidades Propietarias</A></H2>


<P>S&iacute; que est&aacute;n soportadas muchas unidades de CDROM basadas en interfases
propietarias; a menudo la interfase suele venir junto con la tarjeta de
sonido. Las tarjetas de interfase sencilla (o <I>single</I>), como las
suministradas con la tarjeta de sonido, tambi&eacute;n est&aacute;n disponibles. El
precio de dichas unidades suele ser m&aacute;s bajo que el de las SCSI. Su
desventaja estriba en la imposibilidad de expansi&oacute;n y falta de
estandarizaci&oacute;n.</P>
<P>Cuidado: hay interfases propietarias que vienen catalogadas err&oacute;neamente
como IDE porque, al igual que los discos duros IDE, emplean una interfase
sencilla basada en el bus PC/AT. Por si fuera poco, algunos fabricantes,
en particular Creative Labs, han lanzado al mercado diferentes tipos de
unidades, ofreciendo con sus tarjetas de sonido interfases ATAPI, SCSI y
propietarias. </P>
<P>A continuaci&oacute;n tenemos una lista de las unidades propietarias que sabemos
que <B>S&iacute;</B> son soportadas bajo Linux. Los controladores correspondientes
est&aacute;n disponibles en las &uacute;ltimas versiones de desarrollo del n&uacute;cleo o bien
como parches: en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/kernel/patches/cdrom/">ftp://sunsite.unc.edu/pub/Linux/kernel/patches/cdrom/</A></CODE>. Revise
asimismo los ficheros README que incluidos en la distribuci&oacute;n del n&uacute;cleo;
habitualmente se encuentran instalados en el directorio
<CODE>/usr/src/linux/Documentation/cdrom</CODE>. </P>
<P>&nbsp <BR></P>
<P>&nbsp <BR></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
                Unidades de CD-ROM Propietarias

Fabricante      Modelo          Controlador     Comentarios
----------      ------          -----------     -----------
Panasonic       CR-521          sbpcd           Nota 1
Panasonic       CR-522          sbpcd           Nota 1
Panasonic       CR-523          sbpcd           Nota 1
Panasonic       CR-562          sbpcd           Nota 1
Panasonic       CR-563          sbpcd           Nota 1
Creative Labs   CD-200          sbpcd
IBM             External ISA    sbpcd           Nota 2
Longshine       LCS-7260        sbpcd
Teac            CD-55A          sbpcd
Sony            CDU-31A         cdu31a
Sony            CDU-33A         cdu31a
Sony            CDU-535         sonycd535       Nota 3
Sony            CDU-531         sonycd535
Aztech          CDA268-01A      aztcd           Nota 4
Orchid          CDS-3110        aztcd
Okano/Wearnes   CDD110          aztcd
Conrad          TXC             aztcd
CyCDROM         CR520ie         aztcd
CyCDROM         CR940ie         aztcd
GoldStar        R420            gscd            Nota 5
Philips/LMS     CM206           cm206           Nota 6
Mitsumi         CRMC LU005S     mcd/mcdx        Notas 7, 8
Mitsumi         FX001           mcd/mcdx        Notas 7, 8
Optics Storage  Dolphin 8000AT  optcd
Lasermate       CR328A          optcd
Sanyo           H94A            sjcd
various         various         isp16           Nota 9
MicroSolutions  Backpack        bpcd
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Comentarios:</P>
<P>
<OL>
<LI>Estas unidades deben estar comercializadas exclusivamente por
Creative Labs, Panasonic, Matsushita, o Kotobuki. 
</LI>
<LI>Se trata de la misma unidad que la  Panasonic CR-562.
</LI>
<LI>Tambi&eacute;n podemos encontrarla con el nombre de Procomm.
</LI>
<LI>Este controlador s&oacute;lo funciona con la unidad CDA268-01A. Los otros
modelos, incluyendo el CDA268-03I y el CDA269-031SE no son propietarios,
por lo que deben usar el controlador del n&uacute;cleo IDECD (ATAPI). 
</LI>
<LI>Se puede encontrar formando parte del Kit Reveal Multimedia. 
</LI>
<LI>Este controlador no soporta la unidad Philips CM205, pero ya existe
para la misma un controlador en versi&oacute;n alfa que se puede obtener v&iacute;a
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/kernel/patches/cdrom/lmscd0.4.tar.gz">ftp://sunsite.unc.edu/pub/Linux/kernel/patches/cdrom/lmscd0.4.tar.gz</A></CODE>
</LI>
<LI>Tambi&eacute;n la podemos encontrar con el nombre de Radio Shack.
</LI>
<LI>Existen dos controladores. "<CODE>mcd</CODE>" es el original. "<CODE>mcdx</CODE>",
el m&aacute;s moderno, soporta m&aacute;s caracter&iacute;sticas (pero puede que sea menos
estable). 
</LI>
<LI>Este controlador funciona con las unidades conectadas a la interfase
de una tarjeta de sonido ISP16, MAD16 o Mozart. </LI>
</OL>
</P>
<P>Si su n&uacute;cleo no soporta alguna de las unidades referidas probablemente
necesite actualizarse a una versi&oacute;n mas reciente. </P>
<P>Si su unidad no coincide con ninguno de los modelos se&ntilde;alados, m&aacute;s aun si
&eacute;sta es de reciente adquisici&oacute;n y de cu&aacute;druple velocidad o m&aacute;s, es muy
probable que emplee la interfase IDE/ATAPI, que ya hemos comentado en el
apartado anterior.<EM> Uno de los errores m&aacute;s frecuentes entre los
usuarios de Linux es creer que cualquier unidad conectada a una tarjeta de
sonido SoundBlaster debe utilizar el controlador SBPCD</EM>. Creative Labs
y otros muchos fabricantes est&aacute;n dejando de producir unidades de
interfases propietarias para seguir el est&aacute;ndar ATAPI/IDE. </P>


<H2><A NAME="ss3.4">3.4 Unidades V&iacute;a Puerto Paralelo</A></H2>


<P>La &uacute;nica unidad de estas caracter&iacute;sticas que est&aacute; soportada actualmente en
el n&uacute;cleo de Linux es la MicroSolutions Backpack. </P>
<P>Hay tambi&eacute;n disponibles controladores para muchas m&aacute;s unidades, en forma
de parches del n&uacute;cleo o como m&oacute;dulos cargables. Mas informaci&oacute;n al
respecto en <CODE>
<A HREF="http://www.torque.net/linux-pp.html">http://www.torque.net/linux-pp.html</A></CODE>. </P>


<H2><A NAME="ss3.5">3.5 Unidades Alternativas</A></H2>


<P>Existe un controlador alternativo para las unidades Panasonic/Matsushita
CR-56x, escrito por Zoltan Vorosbaranyi. Puede encontrarse en <CODE>
<A HREF="ftp://ftp.tarki.hu/pub/linux/pcd/pcd-0.29.tar.gz">ftp://ftp.tarki.hu/pub/linux/pcd/pcd-0.29.tar.gz</A></CODE>. </P>


<HR>
<A HREF="CDRom-Como-2.html">Anterior</A>
<A HREF="CDRom-Como-4.html">Siguiente</A>
<A HREF="CDRom-Como.html#toc3">Indice</A>
</BODY>
</HTML>
