<HTML>
<HEAD>
<TITLE>Unidad JAZ: mini-COMO: Preguntas de Uso Frecuente (PUFs)</TITLE>
</HEAD>
<BODY>
<A HREF="JAZ-Como-5.html">Anterior</A>
<A HREF="JAZ-Como-7.html">Siguiente</A>
<A HREF="JAZ-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Preguntas de Uso Frecuente (PUFs)</A></H2>



<H2><A NAME="ss6.1">6.1 El Jaz bloquea el sistema tras parar el motor</A></H2>


<P>Hay gente que ha informado de problemas con los kernels 1.2 (y primeros 1.3)
cuando la unidad Jaz para el motor: les bloquea el sistema, o simplemente
produce un l&iacute;o de mensajes de error SCSI.</P>
<P>Yo (el autor) no he tenido ning&uacute;n tipo de problemas con los kernels 2.0.x y
las paradas de motor de los Jaz. Si alguno tuviese problemas que intente con el
&uacute;ltimo kernel 2.0.x disponible en</P>
<P><CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/kernel/v2.0/">http://sunsite.unc.edu/pub/Linux/kernel/v2.0/</A></CODE>.
<SL>Nota para lectores espa&ntilde;oles/europeos: Se cuenta con un <I>mirror</I> de 
SunSite nacional, y considerablemente m&aacute;s r&aacute;pido, en
<CODE>
<A HREF="ftp://sunsite.rediris.es">ftp://sunsite.rediris.es</A></CODE></SL>
</P>


<H2><A NAME="ss6.2">6.2 ¿ Se puede arrancar desde una unidad Jaz ?</A></H2>


<P>Esto depende en para qu&eacute; se est&eacute; usando la controladora. Si la controladora
tiene una ROM BIOS con c&oacute;digo que puede arrancar los ID 5 o 6, entonces s&iacute;,
se puede arrancar desde la unidad Jaz.</P>

<H3>Nota del traductor</H3>


<P>Yo personalmente tengo una distribuci&oacute;n Slackware en un disco Jaz
que arranco con un disco LILO (tambi&eacute;n se podr&iacute;a desde una partici&oacute;n DOS con
LOADLIN) con soporte de mi controladora SCSI y funciona sin problemas. Mi
controladora no tiene BIOS.</P>
<P>A lo que el autor original se refiere, es a arrancar directamente (con el LILO
instalado en) un disco Jaz. As&iacute; pues el m&eacute;todo consistir&iacute;a en instalar el
LILO bien en un disquete, bien en el MBR de alg&uacute;n disco arrancable. (Aunque 
s&oacute;lo tenga ms-dos)</P>


<H2><A NAME="ss6.3">6.3 ¿ Por qu&eacute; Iomega usa la partici&oacute;n n&uacute;mero 4 ?</A></H2>


<P>No tengo ni idea. Alguna pista?</P>


<H2><A NAME="ss6.4">6.4 ¿ C&oacute;mo se puede montar un disco al arrancar ?</A></H2>


<P>Todo lo que se necesita hacer es a&ntilde;adir una l&iacute;nea al fichero <CODE>/etc/fstab</CODE>. Por
ejemplo, si siempre se tiene un disco DOS en la unidad cuando se arranca, se
puede poner</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/dev/sda4   /jaz  msdos  defaults  0 0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>en el <CODE>/etc/fstab</CODE>. Dependiendo de la distribuci&oacute;n, los scripts de inicializaci&oacute;n
pueden intentar ejecutar <CODE>fsck</CODE> en las particiones listadas en el <CODE>fstab</CODE>. Hay
que ser cuidadoso ya que esto podr&iacute;a causar problemas si se olvida meter el
disco en la unidad cuando se arranca, o se tiene el disco equivocado.</P>


<H2><A NAME="ss6.5">6.5 ¿ Qu&eacute; ocurre si no hay un disco metido cuando se arranca ?</A></H2>


<P>El kernel intentar&aacute; leer la tabla de particiones, pero la operaci&oacute;n
(eventualmente) acabar&aacute; en un <I>time out</I>.</P>
<P>Cuando se cambie de disco, es una buena idea usar siempre <CODE>fsck</CODE> para
comprobar la estructura de la partici&oacute;n en el nuevo disco.</P>
<P>La BIOS en algunas controladoras SCSI intentar&aacute;n leer la tabla de
particiones en el disco durante el arranque del sistema. Si no se puede
desactivar esta comprobaci&oacute;n, ser&aacute; obligatorio arrancar siempre con un disco
metido en la unidad.</P>


<HR>
<A HREF="JAZ-Como-5.html">Anterior</A>
<A HREF="JAZ-Como-7.html">Siguiente</A>
<A HREF="JAZ-Como.html#toc6">Indice</A>
</BODY>
</HTML>
