<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_0.6">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Hardware">
 <TITLE>Hardware : El Proyecto F-CPU: Intentando el "m&aacute;s dif&iacute;cil todav&iacute;a"</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Manuel-B.jpg" ALT="[Foto del Autor]" HEIGHT=147 WIDTH=122>
<BR>por  <A HREF="mailto:mbenet@gap.upv.es">Manuel Benet Navarro</A>
<BR><BR><I>Sobre el Author:</I><BR><P>

Estudia actualmente Ingenier&iacute;a
Informt&aacute;tica       en       la    Universidad
Polit&eacute;cnica de  Valencia, donde pasa la mayor
parte de su tiempo.

</P>
<P>

Le  encanta Linux (Unix* en  general)  desde hace 5
a&ntilde;os que  empez&oacute;  a  usarlo,  y  todo lo
relacionado con la arquitectura de computadores. Fuera
de los ordenadores, le gManuel Benet Navarrousta oír m&uacute;sica, ir al
cine y esquiar en tabla de surf.

</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>El Proyecto F-CPU: Intentando el "m&aacute;s dif&iacute;cil todav&iacute;a"</H2>
 <IMG SRC="../../common/images/illustration59.gif" ALT="[Ilustracion]" HSPACE=10 HEIGHT=100 WIDTH=100><P><FONT COLOR="#336633">Resumen</FONT>:
<P>

El proyecto F-CPU intenta desarrollar un microprocesador similar a los
actuales (Pentium II, Merced) siguiendo un esquema de desarrollo
similar al de los grandes proyectos de software libre. Aunque en
principio pueda parecer ut&oacute;pico, hay puntos que
podr&iacute;an favorecer que se convirtiese en
realidad.
</P><HR size="2" noshade><BR>
<!-- BODY OF THE ARTICLE -->


	  <P>S&iacute;. Has leído perfectamente. La palabra "cpu"
	  corresponde efectivamente al acr&oacute;nimo tradicional:
	  unidad central de proceso (central processing unit), no a
	  cualquier otro que pudieras haber supuesto al leer el
	  título.  Y la "F", naturalmente, corresponde a "Freedom"
	  (libre). Este es el proyecto que describir&eacute; en este
	  art&iacute;culo.  <BR>Antes de nada, decir que no voy a
	  entrar en consideraciones de dise&ntilde;o que se hayan
	  tomado en dicho proyecto, sino que mostrar&eacute; la
	  organizaci&oacute;n de &eacute;ste y cuales son sus
	  objetivos.</p>

	  <P>El proyecto F-cpu nace alrededor del final del verano de
	  1998 (desconozco la fecha exacta puesto que a&uacute;n
	  estaba de vacaciones ;) de la mano de Brion Vibber y Andrew
	  D. Balsa, como un intento de desarrollar un microprocesador
	  (su nombre es F1, actualmente) que sea una alternativa a los
	  que ya existen en el mercado, extendiendo la idea del
	  software libre (GNU/GPL) al hardware (aunque quiz&aacute; no
	  con la misma licencia, por problemas legales, sino con una
	  similar).  <BR>Evidentemente, esto no implica que el micro
	  sea distribuido gratis, puesto que lleva unos costes de
	  producci&oacute;n que no tiene el software, pero si que
	  conlleva que su implementaci&oacute;n y arquitectura sean
	  libres, a la vez que sigue un modelo de desarrollo similar
	  al de los proyectos de software que hacen uso de la licencia
	  GNU/GPL, es decir, un desarrollo abierto a cualquier persona
	  que quiera contribuir.</p>

	  <P>Probablemente estar&aacute;s esc&eacute;ptico ante el
	  proyecto, porque <I>&iquest;qui&eacute;n va a pagar los
	  costes de producci&oacute;n?&iquest;Qui&eacute;n va a
	  implementar el micro una vez dise&ntilde;ado?</I> <BR>Puesto
	  que el micro no va a ser gratis (se ha estimado un coste de
	  100$), las ventas de éste suplir&aacute;n los costes de
	  producci&oacute;n.  Debido a la corta edad del proyecto,
	  a&uacute;n no se dispone de bastante material como para
	  cuestionarse esto. En cualquier caso, una vez
	  dise&ntilde;ado, convenientemente testeado, y analizado su
	  rendimiento, se pretende que diversas compa&ntilde;ias lo
	  fabriquen. Un hecho que facilitar&aacute; esto ser&aacute;
	  que el F1 se basa en mejoras arquitect&oacute;nicas, no en
	  mejoras de la tecnolog&iacute;a de integraci&oacute;n, por
	  lo que a la hora de crear el micro, tecnolog&iacute;as de
	  0.25 micras (o a&uacute;n menores, posiblemente)
	  estar&aacute;n disponibles a un precio razonable.</p>

	  <table bgcolor="#f8dca8" width="20%" align="right" border="0" cellspacing="5" cellpadding="5" >
	    <tr>
	      <td>  
		<center>
		  <font face="helvetica" size="+2" color="#004080">
		    El micro est&aacute;
		    desarrollado especialmente para Linux.
		    
		  </font>
		</center>
	      </td>
	    </tr>
	  </table>  
	  
	  <P><I>De acuerdo, de acuerdo, parece razonable, pero,
	  &iquest;Qu&eacute; rendimiento tendr&aacute; el F1?</I>
	  <BR>En este punto el proyecto es bastante ambicioso (aunque
	  deben de serlo si realmente quieren que el proyecto se haga
	  realidad). Se estima que el rendimiento final en entero
	  ser&aacute; como m&iacute;nimo igual al del Merced, y en
	  coma flotante superior a &eacute;ste.</p>

 
	  <P><I>Bueno, eso es fant&aacute;stico, pero,
	  &iquest;Qu&eacute; pasa con mi Linux?  Porque yo, sin mi
	  linux, no voy a ninguna parte...</I> <BR>Respecto a este
	  punto, el proyecto es muy claro. El micro est&aacute;
	  desarrollado especialmente para Linux, y, no, <B><FONT
	  SIZE="+2">NO</FONT></B> ser&aacute; compatible con Winbugs
	  (98, NT), ni el Wine funcionar&aacute; sobre
	  &eacute;ste. Respecto a otros sistemas operativos, se deja
	  abierta una puerta a un posible emulador de x86, y no se
	  menciona nada sobre otros sistemas operativos.</p>

	  <P><I>Estoy impaciente por poner un F1 en mi placa base...
	  &iquest; Cu&aacute;ndo podr&eacute; tener un F1?</I>
	  <BR>Esto, evidentemente, está condicionado a la futura
	  evoluci&oacute;n del proyecto, pero suponiendo que todo vaya
	  como deber&iacute;a, se espera el F1 para el 2000, y bueno,
	  el F2...</p>

	  <P>Tras la ronda de preguntas, algunos puntos sobre el el
	  proyecto.  <BR>El proyecto F-cpu ha dado lugar a varios
	  proyectos alternativos que cubren otros aspectos de la
	  arquitectura PC que le ata&ntilde;en tambi&eacute;n
	  directamente al F1, y con los que guarda una estrecha
	  colaboraci&oacute;n.  Estos incluyen aspectos relativos a la
	  placa base (&iquest;Qu&eacute; socket utilizar&aacute; el
	  F1? ... en principio, Socket 7, Slot 1 y Super 7 ...),
	  herramientas que es necesario desarrollar para la
	  evaluaci&oacute;n y simulaci&oacute; del F1. </p>

	  <p></p>
	  <table align="left"  border="0" >
	    <tr> 
	      <td> 
		<IMG SRC="../../common/src/article59/groups.gif"> 
	      </td> 
	    </tr> 
	  </table>

	  <p>Como se puede observar, la web act&uacute;a de
	  coordinador principal entre todos los grupos. No obstante,
	  actualmente el principal punto de comunicaci&oacute;n entre
	  &eacute;stos son las respectivas listas de correo (ver al
	  final del art&iacute;culo para m&aacute;s
	  informaci&oacute;n), pero el uso que se espera es que cada
	  desarrollador actualice mediante CVS la informaci&oacute;n
	  del servidor web.  <BR>El proyecto est&aacute; actualmente
	  a&uacute;n en su fase inicial, donde todav&iacute;a no hay
	  un grupo grande de desarrolladores.  Sin embargo, hay
	  algunas personas (menci&oacute;n especial requieren
	  AlphaRISC, KC5TJA,</p>
	    


	  <p>Andrew D.  Balsa, Jecel Assumpcao Jr, Rafael Reilova,
	  Steve Wilson,...  y algunos m&aacute;s que no recuerdo,
	  aunque est&aacute;n ah&iacute;) que ya est&aacute;n
	  trabajando en herramientas de simulaci&oacute;n, y el
	  n&uacute;mero de personas involucradas en el proyecto,
	  aunque no aumenta espectacularmente (pero s&iacute; que lo
	  hace), no parece disminuir, teniendo en cuenta que
	  <I>a&uacute;n</I> hay mucha gente que desconoce que existe
	  este proyecto.  De cualquier modo, ultimas incorporaciones
	  al proyecto muestran que hay gente con s&oacute;lidos
	  conocimientos de hardware, VHDL y herramientas de
	  simulaci&oacute;n que se est&aacute; interesando por el
	  proyecto F-cpu.
</p>

<BR clear="all">
	  <P>Y para finalizar, dar&eacute; mi impresi&oacute;n
	  personal sobre el proyecto:</p>

	  <UL>
	    <LI>
	      En un principio, sino hay un crecimiento en cuanto al
	      n&uacute;mero de gente con experiencia en el campo del
	      hardware que se interesa por el F1, parece un proyecto
	      inalcanzable, puesto que mucha gente de la lista no
	      dispone de la experiencia suficiente (no es suficiente
	      la teor&iacute;a, hace falta gente con a&ntilde;os de
      <table bgcolor="#f8dca8" width="30%" align="right" border="0" cellspacing="5" cellpadding="5" >
	<tr>
	  <td align="center">  
	      <font face="helvetica" size="+2" color="#004080">


			  ...el proyecto f-cpu parece m&aacute;s ambicioso
			  que cualquiera de estos dos proyectos (Gnome, KDE).



	      </font>
	  </td>
	</tr>
      </table>  

	      pr&aacute;ctica), y el entusiasmo mostrado por algunos
	      no parece ser bastante, aunque resulta gratificante
	      ;). Pero creo que si gente del &aacute;mbito
	      universitario o comercial se involucra, el proyecto
	      podr&iacute;a llevarse a cabo, aunque en un plazo
	      superior al a&ntilde;o 2000 (no me parece realizable una
	      implementaci&oacute; F1 disponible en el 2000, visto el
	      estado del proyecto y la magnitud de
	      &eacute;ste).
	    </LI>

	    <LI>
	      Otro punto a discutir es el del rendimiento. Mientras
	      sobre el papel es f&aacute;cil afirmar que se
	      estar&aacute; por encima del Merced, parece
	      dif&iacute;cil que todos los a&ntilde;os de experiencia
	      de los ingenieros de Intel* sean igualados por las
	      personas del proyecto (aunque esto bien depende de la
	      gente que se involucre en el proyecto, y adem&aacute;s
	      parece que Intel* estaba teniendo problemas con el
	      esquema de desarrollo cl&aacute;sico seguido hasta ahora
	      - su arquitectura IA-64 es totalmente nueva y
	      posiblemente el organigrama de trabajo sea distinto al
	      que se segu&iacute; con los Pentium*-).  Las nuevas
	      t&eacute;cnicas que se est&aacute;n llevando a cabo en
	      el F1 (TTA, Transport Triggered Architecture),
	      determinar&aacute;n el rendimiento final.
	    </LI>

	    <LI>
	      Pienso que un proyecto as&iacute; necesita de mucha
	      m&aacute;s publicidad que la que se le est&aacute; dando
	      en estos momentos. Mucha gente que podr&iacute;an ser


	      potenciales desarrolladores (o colaboradores de
	      cualquier tipo, el proyecto tambi&eacute;n necesita
	      abogados, por ejemplo) no han oído ni mencionar este
	      proyecto (di 'gnome' o 'kde' por decir algo, y
	      ver&aacute;s cuanta gente conoce estos proyectos. Y a mi
	      parecer el proyecto f-cpu parece m&aacute;s ambicioso
	      que cualquiera de estos dos proyectos, sin menospreciar
	      ninguno de los dos - aunque puedo estar equivocado
	      -). Quiz&aacute; este art&iacute;culo sirva de algo en
	      ese sentido. Espero que s&iacute;.
	    </LI>

	    <LI>
	      Y finalmente, un hecho importante es que adem&aacute;s
	      de desarrolladores, se necesita gente realmente
	      involucrada con el proyecto, que pueda negociar con las
	      compa&ntilde;&iacute;as que pudieran implementar el F1,
	      as&iacute; como abogados para cuestiones de patentes,
	      registros... en un proyecto software no necesitas ser
	      una persona f&iacute;sica, simplemente eres un
	      desarrollador al otro lado de la
	      l&iacute;nea. Evidentemente, no se puede negociar con
	      NEC (por poner un ejemplo) por tel&eacute;fono ni
	      E-mail.  Hay que negociar personalmente, y no
	      precisamente con un trabajador de a pie...</LI>
	  </UL>

	  

	  <P>De cualquier modo, y como  alguien me dijo, este proyecto
	  puede ser un buen sitio donde aprender.</p>




<P><B>Para m&aacute;s informaci&oacute;n</B>:
	      <ul>

		<li><A
		HREF="http://f-cpu.dyn.ml.org">http://f-cpu.dyn.ml.org
		Estados Unidos Costa Oeste</A></li>

		<li><A
		HREF="http://f-cpu.tux.org">http://f-cpu.tux.org
		Estados Unidos Costa Este</A></li>

		<li><A
		HREF="http://euro.f-cpu.ml.org">http://euro.f-cpu.ml.org
		Europa</A></li>
	    </ul>

	    <p>All&iacute; encontrar&aacute;s informaci&oacute;n sobre
	    el proyecto, las directrices, doumentaci&oacute;n...  Ten
	    en cuenta sin embargo que es un proyecto nuevo y puede no
	    funcionar todo como deber&iacute;a.</p>

	    
	    <BR><I>Nota:</I> La direcci&oacute;n de correo no parece
	    estar en la p&aacute;gina, pero es
	    <I><a href="mailto:f-cpu@egroups.com">f-cpu@egroups.com</a></I>. Si est&aacute;s interesado,
	    puedes mandar un mail a la lista de correo solicitando
	    informaci&oacute;n para suscribirte, o bien puedes leer
	    la lista en <A
	    HREF="http://www.egroups.com">http://www.egroups.com</A>


  






<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Manuel Benet Navarro <BR>LinuxFocus 1999</FONT></TD>
<!-- OLD FORMAT, NO TRANSLATION INFO -->
</TR></TABLE></CENTER>
<p><font size=1>1999-07-02, generated by lfparser version 0.6</font></p></BODY></HTML>
