<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_0.6">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="System Administration">
 <TITLE>System Administration : Japon&eacute;s en Linux, Parte I</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/weetiong.jpg" ALT="[Photo of the Author]" HEIGHT=147 WIDTH=132>
<BR>por  <A HREF="mailto:t29v1051@ip.media.kyoto-u.ac.jp">Lee Wee Tiong</A>
<BR><BR><I>Sobre el Author:</I><BR><P>
Lee Wee Tiong se encuentra actualmente estudiando en la Universidad de
Kyoto, Jap&oacute;n. Comenz&oacute; a usar Linux hace un a&ntilde;o, y ahora usa un sistema de
doble botado Windows 98 y Redhat 5.1, porque Linux a&uacute;n no soporta su
esc&aacute;ner ultra-barato de puerto paralelo. Est&aacute; muy arrepentido de su
compra ...

</p><P><FONT COLOR="#336633">Contenidos</FONT>:
<OL>
  <LI><A HREF="#lfindex0">
Introduci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Usando Distribuciones Japonesas</A></LI>
  <LI><A HREF="#lfindex2">
Instalando paquetes japoneses</A></LI>
  <LI><A HREF="#lfindex3"> Conclusi&oacute;n</A></LI>
  <LI><A HREF="#lfindex4">Para m&aacute;s informaci&oacute;n:</A></LI>
</OL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Japon&eacute;s en Linux, Parte I</H2>
 <IMG SRC="../../common/images/illustration60.gif" ALT="[Ilustration]" HSPACE=10 HEIGHT=100 WIDTH=100><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
Este art&iacute;culo realiza una peque&ntilde;a revisi&oacute;n sobre como hacer que tu
sistema Linux sea capaz de manejarse con el japon&eacute;s.</P><HR size="2" noshade><BR>
<!-- BODY OF THE ARTICLE -->


<!--   BODY OF THE ARTICLE    -->
<A NAME="lfindex0">&nbsp;</A>
<H3>
Introduci&oacute;n</H3>

<p>
Este art&iacute;culo est&aacute; dirigido a usuarios que quieren usar japon&eacute;s en
sus sistemas Linux, pero que no est&aacute;n completamente preparados para leer
documentaci&oacute;n escrita en japon&eacute;s. En otras palabras, se asume que eres un
reci&eacute;n llegado al idioma japon&eacute;s. ;-)
</p>

<P>
Existen b&aacute;sicamente dos modos de meter el japon&eacute;s en tu ordenador:
El f&aacute;cil y el dif&iacute;cil. El modo f&aacute;cil es instalar una distribuci&oacute;n de
Linux japonesa. Si lo haces as&iacute;, desde el momento en que
acabes la instalaci&oacute;n de Linux, tambi&eacute;n habr&aacute;s terminado de instalar
los paquetes de software necesarios para trabajar con el japon&eacute;s.
Alternativamente, puedes hacerlo por el camino dif&iacute;cil:
cazar a trav&eacute;s de la red los paquetes para japon&eacute;s, descargarlos,
compilarlos si es necesario, y finalmente instalarlos sobre el sistema
Linux que tienes funcionando. De hecho, este camino no es tan duro como
parece, pero depende mucho de tu configuraci&oacute;n. M&aacute;s sobre esto despu&eacute;s.
</p>

<p>
Me referir&eacute; a bastantes recursos en l&iacute;nea a trav&eacute;s del web, y algunos de
ellos est&aacute;n, desafortunadamente, disponibles s&oacute;lo en japon&eacute;s. Pero incluso
si no entiendes japon&eacute;s, supongo que preferir&aacute;s ver los caracteres japoneses
correctamente visualizados en tu navegador a limitarte a ver un completo
galimat&iacute;as. Por tanto, finalizar&eacute; esta secci&oacute;n con un r&aacute;pido
<b>no-brainer</b> sobre como hacer que tu navegador, espec&iacute;ficamente el
Netscape Communicator 4.x, visualize japon&eacute;s correctamente.

<ol>
<li> Arranca el Netscape Communicator/Navigator. 
<li> <b>click View -> Encoding</b>. Deber&iacute;a presentarse ante t&iacute; una lista
con todos los posibles <b>language encoding methods</b>.
<li> Elije japon&eacute;s (autodetecci&oacute;n). Esto deber&iacute;a funcionar para la mayor
parte de las p&aacute;ginas web en japon&eacute;s. En las ocasiones en que parece fracasar,
intenta con <tt>japon&eacute;s (Shift_JIS)</tt> o <tt>japon&eacute;s (EUC-JP)</tt>.
</ol>
<p>

<P>
Como informaci&oacute;n, uso el Netscape Communicator 4.05 que viene con
Redhat 5.1, y puedo asegurar que visualiza japon&eacute;s correctamente.
</P>
 
<A NAME="lfindex1">&nbsp;</A>
<H3>Usando Distribuciones Japonesas</H3>


<p>
Esta es, en mi opini&oacute;n, la forma m&aacute;s f&aacute;cil de usar el japon&eacute;s bajo Linux.
Si estas planeando instalar Linux y a la vez quieres que tenga soporte para el
idioma japon&eacute;s, ¡no mires m&aacute;s! Debajo se incluye una tabla con las
distribuciones de Linux en japon&eacute;s de las que tengo noticia, junto con enlaces
hacia sus respectivas p&aacute;ginas web, y algunos comentarios.
</p>

<P><TABLE BORDER=2>

<TR>
<TH>Nombre</TH>
<TH>Idioma</TH>
<TH>Comentarios</TH>
</TR>

<TR>
<TD><A HREF="http://www.linet.gr.jp/~kojima/Plamo/">Plamo
Linux</A></TD>
<TD>Japon&eacute;s</TD>
<TD>Basada en Slackware.  Trae un programa de instalaci&oacute;n en japon&eacute;s, Mule,
TeX y otras aplicaciones adaptadas al japones. La &uacute;ltima versi&oacute;n es la 1.4.
Se puede descargar <A HREF="http://www.linet.gr.jp/~kojima/Plamo/download.html">aqu&iacute;</A>.
Posee una lista de correo para proporcionar soporte.</TD>
</TR>

<TR>
<TD><A HREF="http://vine.flatout.org/">Vine Linux</A></TD>
<TD>Japon&eacute;s</TD>
<TD>Basada en RedHat 5.x. Viene con un programa de instalaci&oacute;n en japon&eacute;s,
aplicaciones del PJE, y herramientas para Vine desarrolladas
independientemente. La &uacute;ltima versi&oacute;n es la 1.0 beta1. Se puede descargar de
<A HREF="http://vine.flatout.org/getvine.html">aqu&iacute;</A>.  Tambi&eacute;n existe
una lista de correo para los usuarios.</TD>
</TR>

<TR>
<TD><A HREF="http://www.pht.co.jp/">TurboLinux (Japon&eacute;s)</A></TD>
<TD>Japon&eacute;s</TD>
<TD>Lee sobre &eacute;l en Ingl&eacute;s en <A HREF="http://www.pht.com/products/index.html">http://www.pht.com/products/index.html</A>.</TD>
</TR>

<TR>
<TD><A HREF="http://www.mlb.co.jp/linux/">Linux MLD III</A></TD>
<TD>Japon&eacute;s</TD>
<TD>No es necesario crear nuevas particiones para Linux.</TD>
</TR>

<TR>
<TD><A HREF="http://linux.jpg.co.jp/">Power Linux</A></TD>
<TD>Japon&eacute;s</TD>
<TD>Existen versiones para Macintosh y para Intel.</TD>
</TR>

</TABLE>
</P>

<P>
La columna del idioma se refiere al idioma en que se encuentra la p&aacute;gina web.
No hay que desanimarse tan s&oacute;lo porque todas ellas est&eacute;n en japon&eacute;s.
Algunas de las distribuciones, concretamente Plamo Linux y Vine Linux, ofrecen
descargas gratuitas a trav&eacute;s de FTP an&oacute;nimo.
</P>

<P>
He probado a instalar Plamo Linux 1.3 y TurboLinux 3.0-J beta5 y estoy contento
de poder decir que satisfacen la mayor parte de mis necesidades.
</P>

<A NAME="lfindex2">&nbsp;</A>
<H3>
Instalando paquetes japoneses</H3>


<P>
Ya tienes instalada una distribuci&oacute;n Linux en tu sistema, y no quieres
instalar otra completamente nueva s&oacute;lo por usar japon&eacute;s.
Bueno, me parece bien. Simplemente necesitas coge los paquetes
de software en japon&eacute;s e instalarlos sobre tu sistema Linux. Suena f&aacute;cil,
¿verdad? ¡Pues no lo es! En primer lugar, ¿d&oacute;nde puedes agarrar todos
esos paquetes de software en japon&eacute;s? ¿Y como saber cual de ellos escoger?
Afortunadamente para t&iacute;, algunos grupos de voluntarios han empaquetado
amablemente varios grupos de paquetes en japon&eacute;s listos para usar. Basta con
visitar sus <b>homepages</b> y descargar los paquetes adecuados para nuestro
sistema.
</P>

<P><TABLE BORDER=2>

<TR>
<TH>Nombre</TH>
<TH>Idioma</TH>
<TH>Comentarios</TH>
</TR>

<TR>
<TD><A HREF="http://www.pje.linux.or.jp/">Projecto Extensiones japonesas (PJE)</A></TD>
<TD>Japon&eacute;s</TD>
<TD>La &uacute;ltima versi&oacute;n es la 0.1.5 y deber&iacute;a funcionar sin problemas en
RedHat 4.2 y Slackware 3.5. Los usuarios de RedHat 5.x no pueden usar esta
versi&oacute;n. Puedes intentar la 0.3alpha en su lugar, pero es, como su propio
nombre indica, de calidad alpha. Descargas,
<A HREF="ftp://ftp.jaist.ac.jp/pub/os/linux/PJE/">aqu&iacute;</A>. Y no olvides
leer el PJE-HOWTO, que est&aacute; disponible tanto en ingl&eacute;s como en japon&eacute;s.
My consejo es: lee el HOWTO antes incluso de intentar descargar ninguna
otra cosa.</TD>
</TR>

<TR>
<TD><A HREF="http://jrpm.linux.or.jp/">Proyecto Japon&eacute;s-RPM (JRPM)</A></TD>
<TD>Japon&eacute;s</TD>
<TD>Este grupo de voluntarios empaqueta software en japon&eacute;s usando el programa
RPM desarrollado por Redhat. Actualmente hay paquetes tanto para Redhat 4.2 como
para Redhat 5.x. Puedes descargarlos de
<A HREF="http://jrpm.linux.or.jp/list.html">aqu&iacute;</A>. <b>i386 column</b>
se encuentra dividida en dos partes: la superior es para Redhat 4.2 y la
inferior para Redhat 5.x.</TD> 
</TR>

<TR>
<TD><A HREF="http://www.debian.or.jp/index.html.en">Proyecto Debian-JP</A></TD>
<TD>Ingl&eacute;s/Japon&eacute;s</TD>
<TD>Si usas Debian GNU/Linux, 
entonces est&aacute;s de suerte. Es muy f&aacute;cil <em>japonesizar</em> tu sistema
usando los paquetes que te proporciona este grupo de voluntarios.</TD>
</TR>

</TABLE>

<P>
En el momento de escribir esto, hay pocos paquetes en japon&eacute;s para sistemas
basados en glibc. Sistemas basados en libc como Slackware 3.5, S.u.S.E. 5.3
y OpenLinux 1.3 no deber&iacute;an encontrar ning&uacute;n problema importante instalado
y usando japon&eacute;s.
Dado que el PJE proporciona un PJE-HOWTO bien escrito, no profundizar&eacute; en
los detalles de instalaci&oacute;n. Los usuarios de sistemas linux basados en libc
<p>would do fine using</p> PJE 0.1.5.
Para los usuarios de linux basados en glibc (p.e. RedHat 5.x), podemos dar
algunas pistas:

<ul>
<li>intenta usar PJE-0.3alpha.
<li>descarga los RPM preparados por el JRPM.
<li>compila desde las fuentes.
<li>la glibc en algunos sistemas, como Rehat 5.2, no pueda manejar el
<b>locale (lugar/escenario)</b> japon&eacute;s correctamente, por lo que tendr&aacute;s que instalar
<tt>libwcsmbs</tt> y <tt>wcsmbs-locale</tt> con anterioridad.
</ul>  

<A NAME="lfindex3">&nbsp;</A>
<H3> Conclusi&oacute;n</H3>


<p>
Este art&iacute;culo intenta dar una idea general sobre como instalar extensiones
para japon&eacute;s en nuestro sistema Linux. Proporciona cierta informaci&oacute;n sobre
las distribuciones japonesas disponibles y sobre como instalar paquetes en
japon&eacute;s en sistemas basados en libc, con algunas indicaciones sobre c&oacute;mo
conseguir que sistemas basados en glibc puedan correr tambi&eacute;n aplicaciones
japonesas. A&uacute;n as&iacute;, hay bastantes cosas que esta art&iacute;culo no trata, como
puede ser el m&eacute;todo para leer y escribir usando
una cierta aplicaci&oacute;n, suministrar
las direccions a Netscape en japon&eacute;s, la conversi&oacute;n entre kana y kanji, y
varios m&aacute;s. Pero no hay que preocuparse, puesto que los paquetes japoneses
suelen venir con documentaci&oacute;n detallada, que se aconseja explotar al m&aacute;ximo.
<p>

<P>
Este es la primera entrega de una serie de art&iacute;culos sobre
"Japon&eacute;s en Linux" que estoy escribiendo. Realmente no tengo claro que
deber&iacute;a ver la luz en la parte II. ¿Tal vez un tutorial sobre como instalar
sobre sistemas basados en glibc? Realimentaci&oacute;n sobre este y futuros art&iacute;culos
es bienvenido.
</P>

<A NAME="lfindex4">&nbsp;</A>
<H3>Para m&aacute;s informaci&oacute;n:</H3>


<UL>
<LI>Grupo japon&eacute;s de usuarios de Linux en <A
HREF="http://www.linux.or.jp/">http://www.linux.or.jp/</A> (Disponible versi&oacute;n
en ingl&eacute;s).</LI>
<LI>Grupo de usuarios de Linux de Tokyo en <A
HREF="http://tlug.linux.or.jp/">http://tlug.linux.or.jp/</A> (Ingl&eacute;s).</LI>
<LI>La p&aacute;gina de Plamo Linux 1.3 en <A
HREF="http://www.gihyo.co.jp/SD/plamo/index.html">http://www.gihyo.co.jp/SD/plamo/index.html</A> 
(Japon&eacute;s).</LI>
<LI>Netscape japonesidazo bajo Linux en <A
HREF="http://kichijoji.mech.tuat.ac.jp/~rob/NetscapeV.html">http://kichijoji.mech.tuat.ac.jp/~rob/NetscapeV.html</A> 
(Ingl&eacute;s).</LI>
<LI>USENET: fj.os.linux y japan.comp.linux (principalmente se postea en
japon&eacute;s, pero hacerlo en ingl&eacute;s no causa problemas).</LI>
<LI>Ken Lunde, <I>Understanding Japanese Information Processing</I>,
O'Reilly & Associates, 1993.</LI>
</UL>

<P>Estas referencias suponen un suplemente a los recursos que han sido mencionados aqu&iacute;
y all&aacute; a lo largo del art&iacute;culo.</P>





<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Lee Wee Tiong <BR>LinuxFocus 1999</FONT></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Translation information:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:t29v1051@ip.media.kyoto-u.ac.jp"><FONT COLOR="#FFFFFF">Lee Wee Tiong</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>1999-07-03, generated by lfparser version 0.6</font></p></BODY></HTML>
