<HTML>
<HEAD>
<TITLE>FIPS El primer Fragmentador Interactivo de ParticioneS de disco : Usar FIPS</TITLE>
</HEAD>
<BODY>
<A HREF="FIPS-Como-7.html">Anterior</A>
<A HREF="FIPS-Como-9.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc8">Indice</A>
<HR>
<H2><A NAME="s8">8. Usar FIPS</A></H2>


<P>Si ya ha preparado un floppy de arranque como se describi&oacute; en la secci&oacute;n 6, arranque con el ahora mismo.</P>
<P>Importante. Aseg&uacute;rese que no tiene un disco con un programa como <CODE>Smartdrive</CODE> ejecut&aacute;ndose. Ha habido casos en que los cambios que FIPS hizo se escribieron al disco s&oacute;lo en parte, lo que result&oacute; en la posterior corrupci&oacute;n del disco. Creo que esto puede ser causado por el uso de Smartdrive, en cuya configuraci&oacute;n est&aacute;ndar se retrasa la escritura al disco por unos segundos. Si se rearranca demasiado r&aacute;pido, se pueden perder algunos de los cambios. Ejecute FIPS tecleando <EM>fips</EM> desde DOS, a continuaci&oacute;n <EM>&lt;ENTER&gt;</EM>. Se puede detener la ejecuci&oacute;n del programa en cualquier momento presionando simult&aacute;neamente <EM>&lt;CTRL-C&gt;.</EM></P>
<P>FIPS intentar&aacute;, en primer lugar, detectar bajo que sistema operativa se est&aacute; ejecutando. Si es Windows o Desqview, se quejar&aacute; e indicar&aacute; que se arranque desde un disquete. No obstante, se puede continuar pero bajo su responsabilidad (ver secci&oacute;n 9). A continuaci&oacute;n, FIPS detectar&aacute; los discos duros y si tuviese m&aacute;s de uno pedir&aacute; sobre cual actuar. En versiones anteriores, FIPS fallaba al detectar el n&uacute;mero correcto de discos duros con algunas BIOS (especialmente en Pentium). Espero haber corregido esto. Si fallase al detectar el n&uacute;mero de discos, por favor h&aacute;gamelo saber. Mientras tanto puede usar el la opci&oacute;n <EM>-n</EM> para seleccionar manualmente el disco (ver a continuaci&oacute;n). FIPS lee el sector ra&iacute;z del disco y muestra la tabla de partici&oacute;n.</P>
<P>Ejemplo: </P>
<P>|     Start               |      End        | Start </P>
<P>|Number of|</P>
<P>Part.|bootable  |Head Cyl. Sector|System|Head Cyl. Sector  | Sector  |  Sector  |  MB</P>
<P>-----+----------------+------------------------+--------+--------------------------+-----------+---------------+-------</P>
<P>1    |   yes    | 0   148       1|   83h | 15  295     63  |  149184|    149184 | 72</P>
<P>2    |     no   |   1   0       1|   06h | 15  139     63         63|    141057 |  68</P>
<P>3    |     no   |     140       1|   06h | 15  147     63  |  141120|      8064 |   3</P>
<P>4    |     no   |   0   0       0|   00h |  0    0      0  |       0|         0 |   0</P>


<P>Si no sabe que significa esto no importa demasiado. Sencillamente use el n&uacute;mero de Megabytes para identificar las particiones. Se comprueba si hay errores en el sector ra&iacute;z. Si hay m&aacute;s de una partici&oacute;n el disco, ser&aacute; preguntado cual ser&aacute; dividida. El sector de arranque de la partici&oacute;n es le&iacute;do y se indica alguna informaci&oacute;n.</P>
<P>Ejemplo:
<UL>
<LI>Bytes per sector: 512 </LI>
<LI>Sectors per cluster: 8 </LI>
<LI>Reserved sectors: 1 </LI>
<LI>Number of FATs: 2 </LI>
<LI>Number of rootdirectory entries: 512 </LI>
<LI>Number of sectors (short): 0 </LI>
<LI>Media descriptor byte: f8h </LI>
<LI>Sectors per FAT: 145 </LI>
<LI>Sectors per track: 63 Drive heads: 16 </LI>
<LI>Hidden sectors: 63 </LI>
<LI>Number of sectors (long): 141057 </LI>
<LI>Physical drive number: 80h </LI>
<LI>Signature: 29h</LI>
</UL>
</P>
<P>FIPS comprueba si la informaci&oacute;n es coherente con la tabla de partici&oacute;n e intenta detectar otros errores. A continuaci&oacute;n verifica que las dos copias de la FAT son id&eacute;nticos, si no lo son, FIPS abortar&aacute; con un mensaje de error.</P>
<P>Si todo esta bien, FIPS buscar&aacute; ahora espacio libre al final de la partici&oacute;n. La nueva partici&oacute;n debe tener al menos un cilindro, por lo que si el &uacute;ltimo cilindro no est&aacute; libre, no hay posibilidad de dividir la partici&oacute;n: FIPS abortar&aacute; con un mensaje de error. Probablemente olvido eliminar un mirror o un fichero image. Ahora debe indicar en cual cilindro debe comenzar la nueva partici&oacute;n. Use las flechas del teclado para aumentar o disminuir el n&uacute;mero. Durante el proceso se muestra el tama&ntilde;o de la partici&oacute;n actual y la nueva, por lo que no habr&aacute; problema en seleccionar el cilindro adecuado. Con la tecla arriba/abajo se pude cambiar la cuenta es saltos de 10. Cuando est&eacute; listo, teclee <EM>enter</EM> para continuar.</P>
<P>FIPS comprobar&aacute; nuevamente si el espacio para la nueva partici&oacute;n estar&aacute; vac&iacute;o -este es un paso de seguridad adicional y nunca deber&iacute;a mostrar un error, ya que el espacio libre fue determinado anteriormente. Despu&eacute;s de esto, FIPS calcular&aacute; los cambios en el sector ra&iacute;z, chequear&aacute; los cambios y mostrar&aacute; la nueva tabla de partici&oacute;n. Podr&aacute; elegir ahora entre reescribir la tabla (por lo que regresar&aacute; al punto donde se seleccion&oacute; la partici&oacute;n) o continuar. Si teclea 'c', FIPS calcular&aacute; el sector de arranque, lo comprobar&aacute; y le pedir&aacute; confirmaci&oacute;n para proceder. Si teclea 'y' entonces, FIPS escribir&aacute; los cambios al disco y finalizar&aacute; la ejecuci&oacute;n.</P>
<HR>
<A HREF="FIPS-Como-7.html">Anterior</A>
<A HREF="FIPS-Como-9.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc8">Indice</A>
</BODY>
</HTML>
