<HTML>
<HEAD>
<TITLE>FIPS El primer Fragmentador Interactivo de ParticioneS de disco : Cr&eacute;ditos</TITLE>
</HEAD>
<BODY>
<A HREF="FIPS-Como-11.html">Anterior</A>
<A HREF="FIPS-Como-13.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc12">Indice</A>
<HR>
<H2><A NAME="s12">12. Cr&eacute;ditos</A></H2>


<P>FIPS est&aacute; basado en el procedimiento descrito por Drew Eckhardt en el Linux digest 132. La mayor&iacute;a de lo que s&eacute; acerca de la estructura de los discos duros viene de un excelente libro alem&aacute;n 'Scheibenkleister II' (¿alg&uacute;n voluntario para traducirlo?) de Claus Brod y Anton Stepper. Est&aacute; dirigido a el Atari ST, pero muchos cosas aplican a PCs tambi&eacute;n. La informaci&oacute;n sobre las interrupciones del disco fue recogida del listado de interrupciones de Ralf Brown. Gracias a Hamish Coleman por su informaciones y a Paul Smith por sus sugerencias. Gunnar Hilmarsson sugiri&oacute; el procedimiento de discos apilados y Miguel &Aacute;lvarez me ayud&oacute; a mejorar la clasificaci&oacute;n de la partici&oacute;n. ChetanPatil, Rand Phares y Eric Jung me indicaron fallos en la programaci&oacute;n y la documentaci&oacute;n del programa. Stefan Andreasen aport&oacute; datos importantes sobre OS/ 2. Keith Crews sugiri&oacute; adendas a la documentaci&oacute;n relativa al disco de arranque y las caracter&iacute;sticas de DOS 6.x. Dave McCaldon escribi&oacute; el c&oacute;digo para detectar el OS. Scott Ellentuch y Billy Patton aportaron informaci&oacute;n acerca de OnTrack Disco Manager. Una informaci&oacute;n muy valiosa sobre discos EIDE y traducci&oacute;n de direcci&oacute;n se encuentra en el Linux-EIDE-Mini-HOWTO de Patrick LoPresti. Gracias a todos los que me han enviado sugerencias. FIPS no ser&iacute;a lo mismo sin los innumerables emails recibidos. Arno Schaeferschaefer 
<A HREF="mailto:schaefer@rbg.informatik.th-darmstadt.de">schaefer@rbg.informatik.th-darmstadt.de</A></P>
<P>FIPS es gratuito; se puede redistribuir y/o modificar bajo los t&eacute;rminos expuestos en la Licencia P&uacute;blica General de la G N U (GNU) publicados por la Free Software Foundation; ya sea la versi&oacute;n 2 o cualquier otra posterior. FIPS se distribuye con la esperanza de que sea &uacute;til, pero SIN NINGUNA GARANT&Iacute;A; sin ni si quiera garant&iacute;a impl&iacute;cita de su COMERCIALIZACI&Oacute;N o CONVENIENCIA PARA UN USO PARTICULAR. En la  Licencia P&uacute;blica General de la GNU hay m&aacute;s detalles que deber&iacute;a haber recibido junto con FIPS. Si no es as&iacute;, escribir a </P>
<P>Free Software Foundation </P>
<P>675 Mass Ave, Cambridge </P>
<P>MA 02139, USA </P>
<P>Se pueden dirigir comentarios y problemas a: 
<A HREF="mailto:schaefer@rbg.informatik.th-darmstadt.de">schaefer@rbg.informatik.th-darmstadt.de</A></P>
<HR>
<A HREF="FIPS-Como-11.html">Anterior</A>
<A HREF="FIPS-Como-13.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc12">Indice</A>
</BODY>
</HTML>
