<HTML>
<HEAD>
<TITLE>FIPS El primer Fragmentador Interactivo de ParticioneS de disco : ¿Qu&eacute; hace FIPS?</TITLE>
</HEAD>
<BODY>
<A HREF="FIPS-Como-2.html">Anterior</A>
<A HREF="FIPS-Como-4.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. ¿Qu&eacute; hace FIPS?</A></H2>


<P>FIPS reduce el tama&ntilde;o de la partici&oacute;n cambiando unos valores de la tabla de partici&oacute;n (partition table) del sector de arranque (boot sector). No modifica el formato de la partici&oacute;n, especialmente del tama&ntilde;o del cluster y de la FAT (Tabla de Asignaci&oacute;n de Ficheros). Por lo tanto la partici&oacute;n reducida tendr&aacute; una FAT que est&aacute; en parte sin usar, pero esto no es problema para DOS. Con el espacio libre que se gana de esta forma FIPS crea una nueva partici&oacute;n primaria DOS. Si quiere emplear esta nueva partici&oacute;n para una sistema operativo diferente (por ejemplo Linux), use el programa <CODE>fdisk</CODE> para hacer los cambios oportunos (consultar los manuales del sistema operativo). Si quiere usar la nueva partici&oacute;n bajo DOS/Windows, puede usarla como tal (despu&eacute;s de formatear), pero tenga en cuenta lo siguiente: seg&uacute;n las referencias oficiales, DOS s&oacute;lo puede tener un &uacute;nica partici&oacute;n primaria. Todas las versiones de DOS ( al menos desde la versi&oacute;n 5.0) trabajan bien con m&uacute;ltiples particiones primarias, pero esto es una caracter&iacute;stica indocumentada. Si se quieren seguir las reglas oficiales, se puede borrar la nueva partici&oacute;n con fdisk y crear una partici&oacute;n extendida en su lugar. Hay razones para tener varias particiones primarias, entre ellas la posibilidad de arrancar desde distintas particiones cambiando la partici&oacute;n activa con fdisk.</P>
<P>Los problemas que se encuentran con configuraciones de varias particiones primarias son:</P>
<P>- si accidentalmente se borra una partici&oacute;n primaria del disco, no se podr&aacute; reconstruir f&aacute;cilmente, ya que fdisk no lo har&aacute;. Hay otros programas fdisk por ah&iacute; que lo har&aacute;n, y si todo eso falla pueden arrancar desde un disquete de arranque Linux para ejecutar el fdisk de Linux, pero es siempre un l&iacute;o. </P>
<P>- Hay algunos paquetes de software que emplean la tabla de partici&oacute;n y se pueden confundir con varias particiones primarias. Entre ellos esta <CODE>SFS</CODE>, el 'Sistema de Ficheros Seguro' de Peter Gutmann. Creo que Peter ha realizado cambios a su programa para aceptar configuraciones inusuales, pero puede haber otros programas que pueden tener problemas.</P>
<HR>
<A HREF="FIPS-Como-2.html">Anterior</A>
<A HREF="FIPS-Como-4.html">Siguiente</A>
<A HREF="FIPS-Como.html#toc3">Indice</A>
</BODY>
</HTML>
