<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf262, Applications: Mozilla analizado</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Floris Lambrechts
 =LF=CAT___: Applications
 =LF=TITLE_: Mozilla analizado
 =LF=NUMBER: 262
 =LF=ANAME_: article262.html
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Floris_Lambrechts.png" WIDTH=138 HEIGHT=150 ALT="[Floris Lambrechts]">
<BR>por  Floris Lambrechts <br> <small>&lt;floris-(at)-linuxfocus-(dot)-org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<P>Como editor holand&eacute;s de LinuxFocus trabajo semanalmente en la publicaci&oacute;n. Actualmente estoy corrigiendo las traducciones de otra gente al holand&eacute;s. En el mundo no virtual recientemente estaba intentando mejorar mis habilidades malabares, ahora me manejo bien con 3 bolas, pero 4 bolas a la vez todav&iacute;a son demasiado para m&iacute;. </P>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
David Losada <small>&lt;losadaz-(at)-euskalnet-(dot)-net&gt;</small>
<br>
<!--
 =LF=TRANSTO=es: David Losada
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#262lfindex0">Instalaci&oacute;n</A></LI>
  <LI><A HREF="#262lfindex1">Un gran explorador</A></LI>
  <LI><A HREF="#262lfindex2">Las opciones integradas...</A></LI>
  <LI><A HREF="#262lfindex3">Navegaci&oacute;n m&uacute;ltiple con leng&uuml;etas</A></LI>
  <LI><A HREF="#262lfindex4">Marcadores</A></LI>
  <LI><A HREF="#262lfindex5">La barra lateral de herramientas</A></LI>
  <LI><A HREF="#262lfindex6">Privacidad y seguridad</A></LI>
  <LI><A HREF="#262lfindex7">Apariencia</A></LI>
  <LI><A HREF="#262lfindex8">Navegaci&oacute;n inteligente</A></LI>
  <LI><A HREF="#262lfindex9">Selecci&oacute;n de enlaces mediante teclado</A></LI>
  <LI><A HREF="#262lfindex10">... Y otras caracter&iacute;sticas</A></LI>
  <LI><A HREF="#262lfindex11">Lengua materna</A></LI>
  <LI><A HREF="#262lfindex12">&nbsp;</A></LI>
  <LI><A HREF="#262lfindex13">« Gestos » de rat&oacute;n</A></LI>
  <LI><A HREF="#262lfindex14">Contexto Radial</A></LI>
  <LI><A HREF="#262lfindex15">Yaacd(*): Mozilla y las presentaciones</A></LI>
  <LI><A HREF="#262lfindex16">Enlaces</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=262">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Mozilla analizado</H2>
 <IMG SRC="../../common/images/article262/article262-illustration.png" WIDTH=239 HEIGHT=197 ALT="[Illustration]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->
<P>Tras una larga espera, Mozilla se ha convertido en un animal maduro. La familia Mozilla crece: nuevas versiones (1.0.1 y 1.1) han aparecido y para cuando usted lea esto, la 1.2 probablemente haya nacido.
<BR>
Despu&eacute;s de muchas horas de pruebas y configuraciones del navegador de estos j&oacute;venes programadores, comento mis experiencias a continuaci&oacute;n.
</P><P>
Primero prob&eacute; qu&eacute; nos ofrec&iacute;a el navegador est&aacute;ndar, y luego ech&eacute; un vistazo a dos de los muchos add-ons. </P>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


<A NAME="262lfindex0">&nbsp;</A>
<H2>Instalaci&oacute;n</H2>

<P>Lo primero de todo es seleccionar una versi&oacute;n. <CODE>1.0.1</CODE> es actualmente el '<EM>&uacute;nico<SUP>TM</SUP></EM>' Mozilla <CODE>1.0</CODE>, pero con menos errores y algunos fallos de seguridad corregidos. Si prefiere estabilidad y compatibilidad, &eacute;sta es para usted. De otra forma puede escoger la <CODE>1.1</CODE> o posterior – en las que descubrir&aacute; la nueva funcionalidad. Puede seguir el desarrollo en el <A HREF="http://www.mozilla.org/roadmap.html">roadmap</A>. </P>
<P>La instalaci&oacute;n fue muy sencilla: simplemente abra el «Linux x86 Net Installer» en la p&aacute;gina de descarga y ejec&uacute;telo (a veces dispone de varios idiomas). El Net Installer (instalador sobre red), de menos de 100 k le permite seleccionar que componentes de Mozilla le gustar&iacute;a instalar, si selecciona la instalaci&oacute;n personalizada («Custom»), procediendo a instalarse. No puede ser m&aacute;s simple.</P>
<P>Por defecto, se instala en <CODE>/usr/local/mozilla</CODE>, pero puedes seleccionar el destino. Es posible tener diferentes versiones de Mozilla funcionando conjuntamente - mi <CODE>/usr/bin/mozilla</CODE> es simplemente un «script» de «shell» que va al directorio correcto y arranca '<CODE>mozilla &amp;</CODE>'. Es dif&iacute;cil diferenciar las diferentes versiones – las diferencias que descubr&iacute; se detallan m&aacute;s abajo. Puede comprobar la versi&oacute;n que est&aacute; corriendo en el men&uacute; de ayuda (<CODE>Help=&gt;About Mozilla</CODE>). </P>
<P ALIGN="CENTER"><IMG SRC="../../common/images/article262/mozilla-installation-en.png" WIDTH=558 HEIGHT=344 ALT="Nederlanstalige installatie"><BR>
<B>Imagen 1:</B> Un proceso de instalaci&oacute;n simple.</P>
<A NAME="262lfindex1">&nbsp;</A>
<H2>Un gran explorador</H2>

<P>Mozilla es m&aacute;s que un navegador. En general, es una plataforma para desarrolladores y para comunicaci&oacute;n personal (de hecho es independiente del sistema :). Est&aacute; el navegador, El cliente de noticias/correo, el programa de chat, el editor html, el depurador JavaScript, las herramientas XML, el lenguaje XUL de «descripci&oacute;n de interfaz», librer&iacute;as para descargar e instalar aplicaciones y componentes, etc.</P>
<P>No hay que olvidar que en la mayor&iacute;a de los casos no se necesitan programas como Chatzilla (el cliente de chat IRC), el Composer, el programa de correo/noticias o la libreta de direcciones. Si lo &uacute;nico que necesita es el navegador, es mejor instalar s&oacute;lo aquello que se necesite (no olvide seleccionar la opci&oacute;n «instalaci&oacute;n personalizada" o «Custom» en ese caso). <BR>
Como un simple navegador plano, Mozilla tiene una dura competencia, Galeon por ejemplo. &Eacute;ste utiliza el coraz&oacute;n de Mozilla, (el <I>motor de renderizado</I> Gecko), pero adem&aacute;s es m&aacute;s ligero y peque&ntilde;o. E incluso el Konqueror de KDE y el Opera siguen ah&iacute;, ambas buenas alternativas.</P>
<P>Si prefiere usar Mozilla, tendr&aacute; que aceptar que utiliza mucha memoria. A m&iacute; no me ha parecido lento, y el tiempo de carga se ha mejorado desde las versiones anteriores a la <CODE>1.0</CODE>. Pero Mozilla todav&iacute;a necesita una gran cantidad de RAM, al igual que KDE. Triste pero cierto. Para algunos ordenadores viejos habr&iacute;a que considerar un aumento de la memoria RAM. </P>
<BLOCKQUOTE>Nota: Suelo o&iacute;r que el «escritorio de Linux» es realmente «pesado» comparado a «Windows». De acuerdo, KDE no es peque&ntilde;o, &iexcl;pero hay que saber con qu&eacute; se compara! Tiene muchas m&aacute;s posibilidades que por ejemplo Windows98. De hecho se deber&iacute;a comparar con una edici&oacute;n de servidor de WindowsXP (puede... ;-). Y entonces se demuestra la val&iacute;a de Linux. Para sistemas anticuados hay que localizar un escritorio m&aacute;s ligero y peque&ntilde;o y el sistema ser&aacute; igual de r&aacute;pido. O ejecute el escritorio en el potente servidor de red...<BR>
Tambi&eacute;n he o&iacute;do que el nuevo Gnome necesita menos recursos que su predecesor, lo que indica un muy buen desarrollo.</BLOCKQUOTE>
<P>Un problema con navegadores «alternativos» es que algunos sitios en la red son inutilizables. &iexcl;Quiero aclarar que Mozilla no es un navegador «alternativo»! Hay muy pocas p&aacute;ginas que muestren errores, o tal vez ninguna. Y en ese caso se puede culpar con seguridad al dise&ntilde;ador del sitio: Mozilla sigue las reglas casi a la perfecci&oacute;n, un logro muy importante. &iexcl;Felicitaciones a los desarrolladores! (&iexcl;Y abajo los dise&ntilde;adores que desarrollan p&aacute;ginas llenas de errores a prop&oacute;sito!) </P>
<P>Una vez dicho esto, investiguemos si las nuevas capacidades y opciones son &uacute;tiles. </P>
<A NAME="262lfindex2">&nbsp;</A>
<H2>Las opciones integradas...</H2>

<P>El n&uacute;mero de opciones incluidas es bastante impresionante. Te haces a la idea de las posibilidades simplemente navegando un bien estructurado men&uacute; de Preferencias (<CODE>Edit=&gt;Preferences</CODE>) (Edici&oacute;n=&gt;Preferencias). M&aacute;s abajo detallamos la mayor&iacute;a de estas caracter&iacute;sticas. </P>
<A NAME="262lfindex3">&nbsp;</A>
<H3>Navegaci&oacute;n m&uacute;ltiple con leng&uuml;etas</H3>

<P>La navegaci&oacute;n m&uacute;ltiple se conoce de tiempo atr&aacute;s. Es un sistema que te permite abrir m&uacute;ltiples lugares o p&aacute;ginas en la misma ventana. Cada p&aacute;gina tiene su propia leng&uuml;eta, en la que se puede pinchar para activarla. Sobre todo, es muy &uacute;til para evitar tener decenas de Mozilla abiertos a la vez. Yo lo utilizo y me gusta, pero algo me preocupa: &iquest;por qu&eacute; en todas las aplicaciones se tiene que inventar otra <I>interfaz para m&uacute;ltiples documentos</I>? Mozilla tiene el <CODE>MDI</CODE>, Kate el editor KDE, tambi&eacute;n Opera y Galeon... Cada uno con diferentes conceptos y funcionamientos. Y ah&iacute; est&aacute; el propio KDE, que agrupa ventanas de una misma tarea en un solo bot&oacute;n en la Barra de Tareas. Esto conlleva a una situaci&oacute;n muy confusa pero, despu&eacute;s de todo, creo que Mozilla tiene uno se los mejores sistemas. Hay que tener en cuenta que Konqueror de KDE 3.1 <A HREF="http://mozillaquest.com/News02/KDE_Konqueror_Tabs_Coming_Story01.html">tambi&eacute;n soportar&aacute;</A> este sistema. </P>
<P>Aseg&uacute;rese de echarle un vistazo a las opciones de Navegaci&oacute;n M&uacute;ltiple ("tabbed browsing"). Me gusta la opci&oacute;n «Cargar leng&uuml;etas en segundo plano» con la que me aseguro de que al pinchar el bot&oacute;n central sobre un enlace abre una nueva leng&uuml;eta. Tambi&eacute;n puede comprobar que con <KBD>Control+Enter</KBD> en la barra de localizaci&oacute;n se abre una nueva ventana. Lo mejor de las leng&uuml;etas son las combinaciones de acceso r&aacute;pido: <KBD>Control+T</KBD> abre una nueva ventana vac&iacute;a, <KBD>Control+Avance p&aacute;gina</KBD> y <KBD>Control+Retrocede p&aacute;gina</KBD> cambian entre ventanas o leng&uuml;etas, y <KBD>Control+W</KBD> cierra la actual. Finalmente, como a&ntilde;adidura: <KBD>Control+L</KBD> selecciona el texto (URL) en la barra de direcci&oacute;n. </P>
<A NAME="262lfindex4">&nbsp;</A>
<H3>Marcadores</H3>

<P>Lo mejor de los marcadores (que proviene de un uso avanzado del sistema) es la posibilidad de guardar m&uacute;ltiples p&aacute;ginas bajo un &uacute;nico marcador (<CODE>Bookmarks «Favoritos» =&gt;File Bookmark «guardar marcador»</CODE>, y entonces elegir 'File as group' (guardar como grupo)). En la versi&oacute;n 1.1 se puede hacer incluso m&aacute;s r&aacute;pido: simplemente seleccione <CODE>=&gt;Bookmark This Group of Tabs («almacenar este grupo de p&aacute;ginas o leng&uuml;etas»)</CODE>. Muy c&oacute;modo para abrir una serie de sitios de noticias, por ejemplo, o para empezar navegando por la ma&ntilde;ana en las p&aacute;ginas que ten&iacute;as abiertas el d&iacute;a anterior. S&oacute;lo echo de menos una peque&ntilde;a capacidad del Konqueror, en el que no s&oacute;lo se puede a&ntilde;adir favoritos en el men&uacute; principal, sino tambi&eacute;n en los sub-men&uacute;s. Pero no pasa nada, se puede vivir sin ello ;-). </P>
<A NAME="262lfindex5">&nbsp;</A>
<H3>La barra lateral de herramientas</H3>

<P>Con F9 se hace aparecer (o desaparecer) la barra lateral. Pinchando en su borde, puede disminuirse su anchura a unos pocos pixels. Para mi no est&aacute; claro que es lo que hace a la barra de desplazamiento ventajosa sobre un sitio web simple, aunque sospecho que Netscape la utiliza extensivamente en sus navegadores. Dentro de ella se pueden ver opciones como 'search', 'history', 'what's related' y 'bookmarks'. </P>
<P>Afortunadamente cualquiera puede crear sus propias barras de herramientas laterales, como resultado de otras que ya est&aacute;n disponibles. Algunas p&aacute;ginas ofrecen una «barra de opciones Netscape» para mostrar sus noticias. Comprob&eacute; algunas que conten&iacute;an informaci&oacute;n sobre las etiquetas de los formatos de documento HTML, XHTML y SVG (de <A HREF="http://www.zvon.org/Output/bar_list.html">zvon.org</A>, quienes a prop&oacute;sito hacen traducciones de sus p&aacute;ginas a la manera LF). La instalaci&oacute;n de esas barras de herramientas es r&aacute;pida: cliquear, selecionar OK y todo estar&aacute; configurado, aunque no seas root. Personalmente prefiero ver una barra de herramientas que eval&uacute;e la p&aacute;gina actual con <A HREF="http://validator.w3.org/">validator.W3.org</A>. Lo que agradezco, ya que soy un escritor de html un poco perezoso ;-) </P>
<A NAME="262lfindex6">&nbsp;</A>
<H3>Privacidad y seguridad</H3>

<P>Este es un terreno en el que Mozilla realmente brilla. Hay cantidad de caracter&iacute;sticas y posibilidades aparte del control de cookies, prevenci&oacute;n de «pop-ups»... recomiendo la opci&oacute;n con la que s&oacute;lo se aceptan las «cookies» e im&aacute;genes del mismo servidor web que provee la p&aacute;gina que actualmente se lee. De esta forma se evitan algunos anuncios de la red. Y hay m&aacute;s: Ud. puede ver y eliminar «galletas» o «cookies» individualmente, o seleccionar qu&eacute; sitios web tienen permiso para «engalletarte» ;-) (N. del T.: Mozilla puede pedir permiso por cada cookie y recordar sus elecciones.)</P>
<P>Considere si necesita Java, JavaScript y cookies y desconecte todo aquello que no necesita (por defecto Mozilla acepta todas las «galletitas» y JavaScript puede abrir anuncios emergentes &iexcl;descon&eacute;ctelos!). </P>
<P>Mozilla es tambi&eacute;n capaz de recordar contrase&ntilde;as y datos de formularios; es algo que autom&aacute;ticamente deshabilito. (No me f&iacute;o.)</P>
<A NAME="262lfindex7">&nbsp;</A>
<H3>Apariencia</H3>

<P>Se puede configurar que botones ser&aacute;n visibles en la barra de herramientas - 'Home' (Inicio), 'Search' (buscar), 'Print' (imprimir), 'Go' (ir a) y 'Bookmarks' (marcadores) para mi no son necesarios. Esto brinda m&aacute;s espacio en la pantalla para mostrar la direcci&oacute;n URL. Se configura en <CODE>Edit=&gt;Preferences=&gt;Navigator (edici&oacute;n=&gt;preferencias=&gt;navegador)</CODE>. </P>
<P>No me gusta el aspecto normal, el tema «cl&aacute;sico». Se parece al viejo y gris Netscape 4 y hace dif&iacute;cil saber qu&eacute; ventana est&aacute; activa. Comparado con el cl&aacute;sico, otro incluido como el «Moderno» me parece bastante mejor. Hay varios «temas» mas en internet, por lo que cada uno puede encontrar su favorito. Para pantallas peque&ntilde;as recomendar&iacute;a un tema reducido; yo utilizo un colorido y peque&ntilde;o «Orbit 3m». </P>
<P ALIGN="CENTER"><IMG SRC="../../common/images/article262/screenshot-3themes-en.png" WIDTH=419 HEIGHT=134 ALT="3 themes"><BR>
<B>Imagen 2:</B> Tres temas: Cl&aacute;sico, Moderno y la versi&oacute;n reducida de Orbit: «Orbit 3m». </P>
<A NAME="262lfindex8">&nbsp;</A>
<H3>Navegaci&oacute;n inteligente</H3>

<P>Usando navegaci&oacute;n inteligente no siempre tendr&aacute; que escribir la URL. En primer lugar, est&aacute;n las palabras-llave, algo genuino de Netscape.com. Algunas palabras, como 'search', 'quote', 'help' y 'goto' son reconocidas cuando las escribes en la barra de localizaci&oacute;n (como 'search linuxfocus' o 'goto linuxfocus'). Mozilla reconoce las palabras, y abre una p&aacute;gina con los par&aacute;metros de b&uacute;squeda adecuados. Lo &uacute;nico de esto que me gusta es que puedo a&ntilde;adir mis propias palabras (usando JavaScript) para mis sitios preferidos. Mozilla tambi&eacute;n tiene la opci&oacute;n de poder elegir un buscador est&aacute;ndar (por defecto netscape.com, pero google.com tambi&eacute;n es una opci&oacute;n), que tambi&eacute;n se utiliza cuando escribo palabras en la barra de localizaci&oacute;n. Esta &uacute;ltima posibilidad no estaba presente en algunas versiones de Mozilla que prob&eacute;. Despu&eacute;s de todo, nunca me acostumbr&eacute; a utilizar estas «palabras clave», por lo que ahora siempre las desactivo. Puede que sean m&aacute;s &uacute;tiles para la gente que teclea muy despacio :-)<BR>
La otra parte de la navegaci&oacute;n inteligente es el «auto completado de la direcci&oacute;n», algo que la mayor&iacute;a de navegadores actuales ya presentan, por lo que no comentar&eacute; :-).</P>
<A NAME="262lfindex9">&nbsp;</A>
<H3>Selecci&oacute;n de enlaces mediante teclado</H3>

<P>Mozilla <CODE>1.2</CODE>, del cual he podido probar una versi&oacute;n alpha, contiene la nueva caracter&iacute;stica llamada 'Type Ahead Find'. Es una buena forma de navegar sin usar el rat&oacute;n: s&oacute;lo tiene que teclear parte del enlace que quiere activar, y Mozilla lo seleccionar&aacute;. Entonces un <CODE>Enter</CODE> har&aacute; saltar al enlace. Por ejemplo: Usted quiere seguir el primer enlace m&aacute;s abajo (A&ntilde;adidos y...), por lo que escribe A&ntilde;ad+<CODE>Enter</CODE> y Mozilla se ocupar&aacute; del resto. Una vez lo conozca suficientemente, es muy f&aacute;cil navegar textualmente sin tener que cambiar entre el teclado y el rat&oacute;n. Una buena caracter&iacute;stica extra es que puede buscar texto regular comenzando con una barra /. Otras cosas a recordar: <CODE>Escape</CODE> cancela la b&uacute;squeda actual, y con (Shift+)<CODE>F3</CODE> puede buscar hacia delante (o hacia atr&aacute;s).</P>
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1 CELLPADDING=10 WIDTH=124>
<TR><TD VALIGN="MIDDLE">
<P><IMG SRC="../../common/images/article262/typeaheadfind-screenshot.png" WIDTH=498 HEIGHT=156 ALT="Type Ahead Find screenshot"></TD>
</TR>
</TABLE>
</CENTER></P>

<P ALIGN="CENTER"><BR>
<B>Imagen 3: </B>B&uacute;squeda de Enlaces mediante Teclado activa el siguiente enlace despu&eacute;s de haber escrito '<CODE>cast</CODE>' en la p&aacute;gina principal de LinuxFocus.org. </P>
<P><BR>
&nbsp;</P>
<A NAME="262lfindex10">&nbsp;</A>
<H2>... Y otras caracter&iacute;sticas</H2>

<P>Aparte de las opciones normales, se pueden obtener muchos extras del navegador. El c&oacute;digo abierto del Mozilla hace que sea relativamente f&aacute;cil crear extensiones, lo que tiene un gran valor. Hay extensiones (plugins) de vieja escuela (vea el art&iacute;culo <A HREF="../July2002/article248.shtml">Plugins y Mozilla 1.0</A>), hay barras de herramientas que empiezan a parecer aplicaciones, y por lo tanto hay otros add-ons que le a&ntilde;aden funcionalidad. Por falta de espacio no los podemos describir todos, pero hay barreras, navegadores an&oacute;nimos, un calendario, un comprobador ortogr&aacute;fico, el mensajero Jabber, un descargador de sitios completos, ... Siga los enlaces inferiores: MozDev muestra muchos add-ons o a&ntilde;adidos. Las extensiones siguientes fueron comprobadas para su seguridad. </P>
<A NAME="262lfindex11">&nbsp;</A>
<H3>Lengua materna</H3>

<P>Mozilla habla ingl&eacute;s, por supuesto, pero eso no es todo. Instalar otros lenguajes es sencillo: Pinchando a trav&eacute;s de <CODE>Edit=&gt;Preferences=&gt;Appearance=&gt;Languages/Content</CODE> le guiar&aacute; a la p&aacute;gina donde se muestran todas las traducciones. Pinchando para instalarlo, al menos si tiene derechos de «root» y su versi&oacute;n de Mozilla no se atraganta (en una ocasi&oacute;n rechaz&oacute; la instalaci&oacute;n, pero continu&oacute; funcionando tan bien como siempre). En algunos (&iquest;o tal vez todos?) comprobar&aacute; que los atajos de teclado no son convertidos, lo que en parte es conveniente y en parte molesto. Me dijeron que traducir los «atajos» era una fuente de conflictos, y no existe el software para que Mozilla detecte y ayude a resolver dichos conflictos. Tenga en cuenta que no todas las versiones de Mozilla tienen traducciones en su lenguaje preferido, lo que puede comprobar por adelantado <A HREF="http://www.mozilla.org/projects/l10n/mlp_status.html">aqui</A>.</P>
<P>Si usted no es un ingl&eacute;s nativo, no olvide establecer sus idiomas favoritos (<CODE>Navigator=&gt;Languages</CODE>), pues algunas p&aacute;ginas lo utilizan para mostrarle autom&aacute;ticamente una p&aacute;gina traducida de sus p&aacute;ginas (p. e. <A HREF="http://www.debian.org/">debian.org</A>). </P>
<A NAME="262lfindex12">&nbsp;</A>
<H3>&nbsp;</H3>

<A NAME="262lfindex13">&nbsp;</A>
<H3>« Gestos » de rat&oacute;n</H3>

<P>Uno de los proyectos con los que me top&eacute; en la p&aacute;gina MozDev.org se llama Optimoz. Este grupo ha creado dos de los mas &uacute;tiles a&ntilde;adidos: 'Mouse gestures' (gestos de rat&oacute;n) y 'Radial Context'. Gestos de Rat&oacute;n (tambi&eacute;n conocido como MozGest) es un sistema para controlar la computadora con los movimientos del rat&oacute;n, no con botones o men&uacute;s. Dibujando una «forma» en la pantalla con un bot&oacute;n concreto del rat&oacute;n, se realiza una acci&oacute;n. El juego Windows Black&amp;White tambi&eacute;n utiliza gestos del rat&oacute;n, igual que el navegador Opera en su versi&oacute;n Windows. Puede ver la lista de los gestos definidos <A HREF="http://optimoz.mozdev.org/gestures/index.html">aqu&iacute; en Optimoz</A>. Adem&aacute;s, es posible a&ntilde;adir tus propios gestos de rat&oacute;n editando el c&oacute;digo JavaScript. </P>
<P ALIGN="CENTER"><IMG SRC="../../common/images/article262/optimoz_banner.gif" WIDTH=477 HEIGHT=70 ALT="Optimoz mouse gestures banner"><BR>
<B>Imagen 3:</B> El anuncio de Optimoz gestos de rat&oacute;n... </P>
<P>La instalaci&oacute;n es sencilla como siempre, una vez que se tienen los derechos de root. Realmente me divirti&oacute; jugar con gestos de rat&oacute;n, pero nunca me convirti&oacute; en adicto. Muchas veces pinchando en los botones (o usando los atajos de teclado) es igual de r&aacute;pido, y algunas veces un «gesto» fue malinterpretado por el software (por ejemplo cuando me equivocaba), pero la posibilidad de poder crear tus propios gestos promete mucho... </P>
<A NAME="262lfindex14">&nbsp;</A>
<H3>Contexto Radial</H3>

<P>El otro lado de Optimoz es 'RadialContext'. Es una aplicaci&oacute;n de lo que llaman «men&uacute; tarta», una clase de men&uacute; redondo que aparece sobre el cursor. Moviendo el rat&oacute;n en una de las cuatro (u ocho) direcciones puedes hacer una selecci&oacute;n en el men&uacute;. Es un poco dif&iacute;cil de explicar, pero puedes verlo con tus propios ojos si utilizas Mozilla: Navegue a <A HREF="http://optimoz.mozdev.org/piemenus/">esta p&aacute;gina</A> y mire c&oacute;mo funciona. Esto es s&oacute;lo una demostraci&oacute;n: las acciones que realice no tienen efecto hasta que instale RadialContext usted mismo (simple si es root, como siempre). </P>
<P ALIGN="CENTER"><IMG SRC="../../common/images/article262/radialcontext-screenshots.png" WIDTH=564 HEIGHT=166 ALT="RadialContext screenshots"><BR>
<B>Imagen 4:</B> Una mirada en RadialContext: El men&uacute; principal, el men&uacute; de las ventanas y el men&uacute; de imagen con texto de ayuda. </P>
<P>En la imagen se ven los men&uacute;s de tarta normales conteniendo cuatro funciones en las direcciones arriba, abajo, izquierda y derecha. Entre ellos hay cuatro sub-menus a los que se accede moviendo el puntero del rat&oacute;n diagonalmente en la direcci&oacute;n correspondiente sin soltar el bot&oacute;n del rat&oacute;n. Arriba a la derecha, por ejemplo, est&aacute; el men&uacute; de las ventanas (mostrado en la mitad de la imagen). Este sub-men&uacute; tiene funciones para abrir o cerrar una ventana, y para ir a la siguiente o a la anterior. Es muy conveniente para navegar sin tocar el teclado. Los otros sub-men&uacute;s tienen funciones relativas a 'window' (ventana), 'tasks' (tareas) y 'page' (p&aacute;gina). En el men&uacute; «normal», las cuatro funciones principales sirven para recargar la p&aacute;gina, parar la carga, o ir adelante o atr&aacute;s en el historial. Usado sobre una imagen, las cuatro direcciones principales tiene funciones diferentes, como se puede ver en el lado derecho de la imagen. Si no se mueve el cursor por un momento entonces se ve lo que pasa: un peque&ntilde;o texto de ayuda aparece cerca de las opciones de men&uacute;. Usado sobre un enlace, el men&uacute; cambia una vez m&aacute;s, esta vez mostrando funciones para ir al enlace en una nueva ventana o una nueva leng&uuml;eta, copiar el enlace o guardar su destino. <BR>
Una buena visi&oacute;n de conjunto de los contenidos del men&uacute; est&aacute; disponible <A HREF="http://www.gamemakers.de/mozilla/radialcontext/functionality.html">aqu&iacute;</A>.</P>
<P>Por supuesto se puede configurar que bot&oacute;n del rat&oacute;n ocupa RadialContext; hay tambi&eacute;n una tecla disponible para acceder al uso «normal» de ese bot&oacute;n del rat&oacute;n. Una apreciaci&oacute;n: no use RadialContext conjuntamente con MozGest (esto confunde al navegador). Mejoras posibles (en mi opini&oacute;n) podr&iacute;an ser: un men&uacute; que no se mueva una vez ha aparecido, y mostrando un peque&ntilde;o texto de ayuda por defecto (reduciendo las esperas).</P>
<P>Me he dado cuenta que en mi sistema Gestos de Rat&oacute;n est&aacute; siempre desactivado (es f&aacute;cil de hacer en «preferencias», y utilizo mucho el men&uacute; tarta. A menudo no he tenido que esperar que apareciera el men&uacute;; he aprendido algunas acciones y un movimiento equivocado es muy raro. Cuando mis manos est&aacute;n en el teclado utilizo mucho los atajos, pero si no, encuentro casi todo lo necesario en el peque&ntilde;o men&uacute; redondo. Creo que es un sistema innovador y eficiente y comienzo a echarlo de menos en otros navegadores. A&ntilde;adir a esto el echo de que RadialContext es actualizado regularmente y el veredicto es claro: Recomiendo que lo pruebe alguna vez. </P>
<A NAME="262lfindex15">&nbsp;</A>
<H2>Yaacd(*): Mozilla y las presentaciones</H2>

<P>(*) : Y ahora algo completamente diferente.</P>
<P>Las presentaciones se desarrollan de mil formas, y el software utilizado puede variar mucho. Programas populares son, entre otros, OpenOffice, Kpresenter y PDF o lectores PostScript. Ignorando estos dos &uacute;ltimos, muchos programas tienen su propio formato (como el Powerpoint de Microsoft). Como resultado las presentaciones no son visibles en todos los sistemas, lo que supone una gran desventaja cuando se tiene que usar una computadora ajena. </P>
<P>Pero actualmente, HTML encaja realmente bien para hacer una s&oacute;lida presentaci&oacute;n, en combinaci&oacute;n con hojas de estilo. De esta forma se asegura que se podr&aacute; ver en todos los sistemas disponibles, e incluso si se utiliza Mozilla se puede incluso ver a pantalla completa (bajo Linux pantalla completa s&oacute;lo funciona en la versi&oacute;n 1.1 y posteriores). S&oacute;lo pulse <CODE>F11</CODE>... <BR>
Tambi&eacute;n es posible describir su presentaci&oacute;n en un lenguaje XML hecho en casa, y mostrarlo adecuadamente con CSS. Desde luego esto implica un riesgo con navegadores cuyo soporte XML o CSS no es adecuado. Pero ciertamente funciona en Mozilla (lo le comprobado).</P>
<P>&iquest;Est&aacute;n esos peque&ntilde;os botones distrayendo su audiencia en modo pantalla completa? <CODE>View=&gt;Show/Hide=&gt;Navigation Toolbar</CODE> resuelve el problema. &iexcl;Con RadialContext ya no necesita men&uacute;s y botones! Se puede todav&iacute;a teclear una direcci&oacute;n si se abre la barra de localizaci&oacute;n con Control+L <CODE>Control+L</CODE>. <BR>
Bien, ahora aseg&uacute;rese que su p&aacute;gina es m&aacute;s peque&ntilde;a que la pantalla y tambi&eacute;n la barra de «scroll» desaparecer&aacute;... </P>
<A NAME="262lfindex16">&nbsp;</A>
<H2>Enlaces</H2>


<UL>
<LI><A HREF="http://galeon.sourceforge.net/">galeon.sourceforge.net</A> : Galeon, peque&ntilde;o navegador basado en Gecko, el motor del Mozilla. </LI>
<LI><A HREF="http://www.opera.com/">opera.com</A> : Opera, un buen peque&ntilde;o navegador para Linux y otros. </LI>
<LI><A HREF="http://www.mozilla.org/">mozilla.org</A> : Lugar oficial de los desarrolladores de Mozilla. </LI>
<LI><A HREF="http://www.mozilla.org/releases/stable.html">mozilla.org/releases/stable.html</A> : Aqu&iacute; est&aacute;n los programas de instalaci&oacute;n para las versiones estables. Versiones posteriores menos estables se pueden encontrar <A HREF="http://www.mozilla.org/releases/">aqu&iacute;</A>. </LI>
<LI><A HREF="http://www.mozilla.org/start/1.0/">mozilla.org/start/1.0/</A> : La p&aacute;gina por defecto de inicio de Mozilla 1.0 tiene buena informaci&oacute;n. </LI>
<LI><A HREF="http://www.mozillazine.org/">mozillazine.org</A> : Revista online sobre el moz. </LI>
<LI><A HREF="http://www.mozdev.org/">mozdev.org</A> : La p&aacute;gina donde se localizan m&aacute;s de 70 proyectos relacionados con Mozilla. <A HREF="http://www.mozdev.org/projects.html">Aqu&iacute;</A> est&aacute; la impresionante lista. </LI>
<LI><A HREF="http://optimoz.mozdev.org/">optimoz.mozdev.org</A> : Optimoz, creadores de «gestos de rat&oacute;n» y 'RadialContext'. </LI>
<LI><A HREF="http://www.opera.com/support/operashow/">OperaShow</A> : Utilize Opera y hojas de estilo para crear presentaciones.</LI></UL>



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=262"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Floris Lambrechts, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">nl --&gt; -- : Floris Lambrechts <small>&lt;floris-(at)-linuxfocus-(dot)-org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: David Losada &lt;losadaz-(at)-euskalnet-(dot)-net&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-12-09, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
