<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Experiencias Instalando Linux Red Hat 6</TITLE>
<META NAME="Template" CONTENT="C:\ARCHIVOS DE PROGRAMA\MICROSOFT OFFICE\OFFICE\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><FONT SIZE=5><P>Experiencias con Linux Red Hat 6.2</P>
</B></FONT><FONT SIZE=2><P>Breve comentario sobre problemas y an&eacute;cdotas instalando Linux.</P>
<P>Por Antonio Regidor, 9 de enero de 2003</P>
<P>Nivel: novato o <I>newbie</P>
</I></FONT><B><FONT SIZE=4><P>&nbsp;</P>
<P>Sumario&#9;</P>
</B></FONT><P><A HREF="#intro">1. Introducci&oacute;n</A>&#9;</P>
<P><A HREF="#caracteristica">1.1 Caracter&iacute;sticas del Sistema empleado</A></P>
<P><A HREF="#recomienda">1.2 Recomendaciones</A></P>
<P><A HREF="#pasos">2. Pasos</A></P>
<P><A HREF="#aclara">3. Aclaraciones</A>&#9;</P>
<P><A HREF="#problema">4. Problemas</A></P>
<P><A HREF="#anexo">5. Anexo</A></P>
<P><A HREF="#web">5.1 Listado de p&aacute;ginas web de inter&eacute;s</A>&#9;</P>
<P>&nbsp;</P>
<B><P><A NAME="intro">1. Introducci&oacute;n</A></P>
</B><P>Tras muchos a&ntilde;os con Windows decid&iacute; probar Linux y adentrarme en su mundo. No fue ni como despecho a Windows ni como una moda; sencillamente quer&iacute;a aprender m&aacute;s. Busqu&eacute; literatura Linux y la mejor, la m&aacute;s completa, por sorpresa, fue la que hall&eacute; en la Red. Bueno, para un internauta con a&ntilde;os de experiencia esto no es de extra&ntilde;ar... Adem&aacute;s de encontrar los manuales en ingl&eacute;s y castellano, encontr&eacute; verdaderos cursos Linux, con recomendaciones, experiencias y consejos. ¡Genial!</P>
<P>Tras mi breve experiencia con Linux, puedo asegurar que es un sistema totalmente abierto y configurable, pero que, de momento, se escapa a mis posibilidades como compilador y programador novicio del tema. ¿C&oacute;mo a&ntilde;adir una tarjeta de sonido? ¿C&oacute;mo se compila un nuevo kernel? La falta de tiempo es mi principal problema, por lo que deber&eacute; tomarme las cosas con calma. Aceptar&eacute; cualquier tipo de consejos y recomendaciones, por lo que no dud&eacute;is en enviarme vuestros comentarios a <A HREF="mailto:auxiliar@ya.com">auxiliar@ya.com</A></P>
<P>Os relato c&oacute;mo instal&eacute; Linux, con el &uacute;nico prop&oacute;sito de servir de humilde ayuda y gu&iacute;a a todo aquel que quiera probar este nuevo y apasionante SO. Pido perd&oacute;n por adelantado a los Linuxeros m&aacute;s avezados, por si existe alguna incorrecci&oacute;n o incoherencia. En este caso rogar&iacute;a que me avisasen de ello por correo electr&oacute;nico.</P>
<P>&nbsp;</P>
<B><P><A NAME="caracteristica">1.1 Caracter&iacute;sticas </A>del Sistema:</P>
</B><P>He instalado Linux sobre un sistema con Windows 98, aunque en un disco duro aparte. &Eacute;ste es el detalle del sistema.</P>
<P>Pentium III 450</P>
<P>Placa Base Asus</P>
<P>128 Mb de RAM</P>
<P>HD C: de 40 Gb</P>
<P>HD D: de 8 Gb</P>
<P>Windows 98</P>
<P>Lector de CD</P>
<P>Grabadora de CD</P>
<P>M&oacute;dem externo US Robotics</P>
<P>Scanner Agfa Snapscan</P>
<P>Impresora Epson Stylus Color II</P>
<P>Monitor Sony Multiscan 100 SF</P>
<P>&nbsp;</P>
<B><P><A NAME="recomienda">1.2 Recomendaciones</A></P>
</B><P>Tras moverme buscando libros e informaci&oacute;n, tan s&oacute;lo debo comentar un hecho lamentable: la mitad de los libros que se venden son tan s&oacute;lo una burda traducci&oacute;n de los manuales de las distribuciones de Linux. No aportan ninguna experiencia real, ni aconsejan procedimientos ni alternativas, ni p&aacute;ginas web de inter&eacute;s, ni tan siquiera dan un apartado de solucionario de problemas (el conocido <I>troubleshooting</I> anglosaj&oacute;n). Son meras gu&iacute;as informativas, que dejan muchos huecos en su informaci&oacute;n. Como por ejemplo:</P>
<P>Editorial Anaya, Gu&iacute;a Pr&aacute;ctica para usuarios, Red Hat Linux 6.2</P>
<P>Editorial Anaya, Gu&iacute;a Pr&aacute;ctica para usuarios, Red Hat Linux 7.0</P>
<P>Por el momento, Linux no es un sistema al alcance de todos; hay que conocer bastante bien el hardware de tu sistema (de todo en general), el funcionamiento de compiladores, y hay que tener una s&oacute;lida base de software y de conocimientos de funcionamiento del PC. As&iacute; que si no cumpl&iacute;s m&iacute;nimamente estas condiciones, mejor no prob&eacute;is.</P>
<B><P><A NAME="pasos">2. Pasos:</A></P>
</B><P>Indico los pasos m&aacute;s importantes cuando instal&eacute; Linux en mi ordenador. Obvio los que no comportan problemas.</P>
<P>-<U>Comprar un segundo disco duro de 40 Gb</P>
</U><P>Para evitarme problemas, compr&eacute; un segundo disco duro para poder dedicar un HD &iacute;ntegramente a Linux. Es la opci&oacute;n m&aacute;s sencilla, con un gasto de unos 100 euros.</P>
<P>-<U>Formatearlo y particionarlo</U> </P>
<P>Tras formatearlo con utilidades de Seagate y de particionarlo con FDisk, el disco ya estaba listo para recibir el sistema.</P>
<P>-<U>Cambio de discos</P>
</U><P>El reci&eacute;n adquirido disco de 40 Gb se convirti&oacute; en el nuevo disco C, mientras que el antiguo de 8 Gb se transform&oacute; en el disco D: para Linux. Para ello intercambi&eacute; las fajas, revis&eacute; jumpers y proced&iacute; a instalar Windows 98 en el HD de 40 Gb. En realidad para ahorrar tiempo, hice la instalaci&oacute;n b&aacute;sica y luego me limit&eacute; a copiar todo el contenido del disco de 8 Gb al de 40 Gb (tras renombrar la carpeta de Windows). As&iacute; de sencillo. ¡Y funciona!</P>
<P>-<U>Instalar Linux desde diskette</P>
</U><P>Hice un disco de arranque de instalaci&oacute;n con la utilidad Rawrite incluida en el CD de Red Hat 6.2. Con &eacute;ste y con el CD de Linux proced&iacute; a la instalaci&oacute;n. Tambi&eacute;n se puede instalar directamente desde el CD, marcando en la BIOS que arranque desde el CD.</P>
<P>-<U>Elecci&oacute;n del tipo de instalaci&oacute;n</P>
</U><P>En la tercera pantalla de la instalaci&oacute;n de Linux seleccion&eacute; hacer una Instalaci&oacute;n Personalizada (la pen&uacute;ltima opci&oacute;n); as&iacute; puedo configurar LiLo a mi gusto, o no instalarlo, hacer las particiones y controlar m&aacute;s el proceso. Recomiendo esta opci&oacute;n.</P>
<P>-<U>Hacer particiones con Disk Druid</P>
</U><P>En el proceso de instalaci&oacute;n de Linux utilic&eacute; la herramienta nativa Disk Druid, f&aacute;cil e intuitiva. Desde &eacute;l borr&eacute; la partici&oacute;n Win FAT32 (creada anteriormente por FDisk desde DOS) e hice las oportunas particiones para Linux (ver secci&oacute;n 4).</P>
<P>-<U>Instalar paquetes</P>
</U><P>Tras las pantallas de Hora, Root y dem&aacute;s, para no perder tiempo, seleccion&eacute; instalar los paquetes de programas por defecto y alguno m&aacute;s (en mi caso Gnome, Gr&aacute;ficos, WWW tools, Utilidades, Workstation Networked, Workstation Modem, DOS Connectivity,...). Es recomendable perder algo de tiempo y seleccionar la opci&oacute;n <I>Seleccionar paquetes individuales</I>. En las siguientes pantallas puedes hallar un mont&oacute;n de buenas herramientas, siempre si tienes conocimientos, claro...</P>
<P>-<U>Hacer disco de arranque</P>
</U><P>Yo personalmente decid&iacute; no instalar LiLo, tras un primero intento con &eacute;l, nefasto. En su lugar cre&eacute; un disco de arranque, por otro lado, opci&oacute;n siempre recomendable aunque instales LiLo (es un disco de salvaci&oacute;n en caso de fallos de arranque). Como comentar&eacute; m&aacute;s tarde, tampoco me funcion&oacute;.</P>
<P>-<U>Hacer nuevo disco de arranque con LoadLin</P>
</U><P>Tras fallar el disco de arranque creado por Linux, decid&iacute; probar con el programa lanzador LoadLin. Result&oacute; ser un &eacute;xito a la primera, sencillo, r&aacute;pido y elemental. Altamente recomendable para arranques de doble sistema, si no quieres que LiLo te toque el MBR (y otra cosa cuando no funciona correctamente...).</P>
<P>&nbsp;</P>
<B><P><A NAME="aclara">3. Aclaraciones:</A></P>
</B><P>-Para instalar Linux prob&eacute; varias opciones: particion&eacute; el disco destino para Linux (el D) con la utilidad DOS FDisk con 2 particiones. Luego borr&eacute; la primera partici&oacute;n (la que ocupaba la primera parte del HD), para dejar espacio libre para Linux. M&aacute;s pruebas: se crearon dos particiones, una primaria y una extendida; se crearon dos particiones m&aacute;s una unidad l&oacute;gica, etc. En todas estas opciones Linux dio problemas durante la creaci&oacute;n de particiones. Al final la opci&oacute;n que no dio problemas fue la de crear con FDisk desde DOS una sola partici&oacute;n, que m&aacute;s tarde borramos con Disk Druid, durante el proceso de instalaci&oacute;n de Linux. Parece ser que Linux quiere un disco para &eacute;l solito...</P>
<P>- A pesar de contar con espacio suficiente en el disco duro (m&aacute;s del 50%), la utilidad Disk Druid me indicaba que no hab&iacute;a espacio en cuanto ten&iacute;a cuatro particiones (una de WIN98 FAT32, una Swap, una de Boot y otra Root). El problema desaparec&iacute;a en cuanto borraba la partici&oacute;n de Win98 FAT32.</P>
<P>-Tras tener problemas con LiLo y el sector de arranque de C: (MBR, Master Boot Record) tuve que formatear a cero ambos discos (con la utilidad de Seagate) y volver a reinstalar Windows. El comando DOS FDisk/mbr no funcion&oacute;.</P>
<P>&nbsp;</P>
<B><P><A NAME="problema">4. Problemas:</A></P>
</B><P>-Durante la instalaci&oacute;n de Gnome automatizada, LiLo se instal&oacute; por defecto en el disco duro C (el de Win 98), no en el D. Tras la instalaci&oacute;n, Red Hat arranc&oacute; sin problemas, pero al salir y reiniciar con Linux, el MBR se estrope&oacute; (aparec&iacute;a una lista interminable de ceros y unos) y ya no pude arrancar ni WIN 98, ni Linux. Repito que el comando DOS FDisk/mbr no solucion&oacute; el problema.</P>
<P>-En el proceso de instalaci&oacute;n no es posible hacer estas particiones (con FDisk o con Disk Druid), manteniendo una para Win98 FAT32.:</P>
<P>&#9;</P>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=633>
<TR><TD WIDTH="25%" VALIGN="TOP">&nbsp;</TD>
<TD WIDTH="25%" VALIGN="TOP">
<B><P>Partici&oacute;n</B></TD>
<TD WIDTH="25%" VALIGN="TOP">
<B><P>Tama&ntilde;o</B></TD>
<TD WIDTH="25%" VALIGN="TOP">
<B><P>Tipo</B></TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P>hdc5</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>WIN98</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>2000 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>FAT32 </TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">&nbsp;</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Swap</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>128 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Swap </TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P>hdc1</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>/ </TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>2500 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Linux Native </TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P>hdc2</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>/boot</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>16 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Linux Native </TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P>hdc4</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>/usr/home</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>800 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Linux Native </TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P>hdc3</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>/usr/local</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>800 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Linux Native </TD>
</TR>
</TABLE>

<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Autom&aacute;ticamente aparec&iacute;a el mensaje de espacio insuficiente para la memoria Swap. Hay que tener en cuenta que la partici&oacute;n de Windows estaba por encima del cilindro 1024, por lo que no interfer&iacute;a en el sector de boot. Por otro lado, al eliminar la partici&oacute;n Windows, desaparec&iacute;a el problema y permit&iacute;a seguir con la instalaci&oacute;n. La tabla de particiones creada qued&oacute; como sigue:</P>
<B><P>&#9;</P></B>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=633>
<TR><TD WIDTH="25%" VALIGN="TOP">&nbsp;</TD>
<TD WIDTH="25%" VALIGN="TOP">
<B><P>Partici&oacute;n</B></TD>
<TD WIDTH="25%" VALIGN="TOP">
<B><P>Tama&ntilde;o</B></TD>
<TD WIDTH="25%" VALIGN="TOP">
<B><P>Tipo</B></TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">&nbsp;</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Swap</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>128 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">&nbsp;</TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P>hdc1</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>/ </TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>2500 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Linux Native</TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P>hdc2</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>/boot</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>16 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Linux Native</TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P>hdc4</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>/usr/home</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>800 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Linux Native</TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P>hdc3</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>/usr/local</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>800 Mb</TD>
<TD WIDTH="25%" VALIGN="TOP">
<P>Linux Native</TD>
</TR>
</TABLE>

<P>&nbsp;</P>
<P>&nbsp;</P>
<P>- En la instalaci&oacute;n de Linux prefer&iacute; no instalar LiLo y crear un diskette de arranque; a la hora de utilizarlo, el sistema no arranc&oacute;. Tras varias alternativas, opt&eacute; por otras v&iacute;as: la opci&oacute;n de utilizar el lanzador LoadLin fue la m&aacute;s acertada.</P>
<P>&nbsp;</P>
<B><P><A NAME="anexo">5. Anexo</A></P>
</B><P>-Para arrancar el sistema utilic&eacute; LoadLin en lugar de LiLo, un programa que lanza Linux desde la l&iacute;nea de comandos de DOS y que est&aacute; en el CD de instalaci&oacute;n en la carpeta <I>utilities</I>. Para ello dispuse de un diskette en el que grab&eacute; el programa LoadLin, as&iacute; como una imagen de Linux, como por ejemplo el archivo <I>vmlinuz </I>de Red Hat, que tambi&eacute;n est&aacute; en el CD. Para ahorrarme el tener que teclear el comando y sus par&aacute;metros cada vez que deb&iacute;a arrancar Linux, cre&eacute; un peque&ntilde;o archivo *.bat, (que tambi&eacute;n grab&eacute; en el diskette y que denomin&eacute; Linux.bat) que ten&iacute;a el siguiente contenido:</P>
<I><P>rem Sample DOS batch file to boot Linux.</P>
<P>rem Start the LOADLIN process</P>
<P>a:\loadlin.exe vmlinuz root=/dev/hdc5 ro vga=3</P>
</I><P>Nota: en el apartado root=/dev/<U>hdc5</U> deb&eacute;is indicar el dispositivo donde hay&aacute;is instalado vuestros archivos Linux de sistema (hda, hdb, hda2, etc.)</P>
<P>Nota 2: si no dese&aacute;is utilizar un diskette, pod&eacute;is habilitar una carpeta en vuestro disco duro C, y grabar en ella los mismos archivos que grabar&iacute;ais en el diskette (LoadLin.exe, vmlinuz y el archivo *.bat). As&iacute; arrancar&eacute;is desde la l&iacute;nea de comandos DOS, pero desde el disco duro C. No olvid&eacute;is sustituir la letra a: de la l&iacute;nea de comandos, por C: y la ruta donde se hallan los programas (si los ten&eacute;is grabados en C:\loadlin la cosa quedar&iacute;a as&iacute;:</P>
<I><P>rem Sample DOS batch file to boot Linux.</P>
<P>rem Start the LOADLIN process</P>
<P>c:\loadlin\loadlin.exe vmlinuz root=/dev/hdc5 ro vga=3</P>
</I><P>&nbsp;-Si ten&eacute;is cualquier comentario o sugerencia, pod&eacute;is escribirme a <A HREF="mailto:auxiliar@ya.com">auxiliar@ya.com</A> (intentar&eacute; no demorarme en la respuesta). Se aceptan clases y consejos de los usuarios m&aacute;s avanzados sobre compilaci&oacute;n de kernel y dem&aacute;s tareas avanzadas...</P>
<P>&nbsp;</P>
<B><P><A NAME="web">5.1 Listado </A>de P&aacute;ginas web m&aacute;s interesantes</P>
</B><P>-Aqu&iacute; ten&eacute;is algunas de las direcciones Linux m&aacute;s interesantes que he hallado en Internet (no est&aacute;n todas; lo siento por los que se hayan quedado fuera). Espero que os sean de utilidad:</P>
<P><A HREF="http://www.hispalinux.es/">http://www.hispalinux.es/</A></P>
<P>Comunidad hispana de Linux</P>
<P><A HREF="http://lucas.hispalinux.es/">http://lucas.hispalinux.es/</A></P>
<P>P&aacute;gina hispana del proyecto LUCAS de Linux</P>
<P><A HREF="http://www.kernel.org/pub/">http://www.kernel.org/pub/</A></P>
<P>Para descargar los &uacute;ltimos kernels</P>
<P><A HREF="http://www.linex.org/">http://www.linex.org/</A></P>
<P>La Junta de Extremadura y su Linux</P>
<P><A HREF="http://www.linux.org/">http://www.linux.org/</A></P>
<P>Web principal de la movida</P>
<P><A HREF="http://www.linux.ie/">http://www.linux.ie</A></P>
<P><A HREF="http://www.igd.fhg.de/~aschaefe/fips/">http://www.igd.fhg.de/~aschaefe/fips/</A></P>
<P>P&aacute;gina del programa particionador Fips.</P>
<P><A HREF="http://pinsa.escomposlinux.org/sromero/guialinux/guialinux.html">http://pinsa.escomposlinux.org/sromero/guialinux/guialinux.html</A></P>
<P>P&aacute;gina en espa&ntilde;ol sobre Linux de un entusiasta</P>
<P><A HREF="http://www.redhat.com/">http://www.redhat.com/</A></P>
<P>P&aacute;gina web de la distribuci&oacute;n Red Hat</P>
<P><A HREF="http://www.tldp.org/">http://www.tldp.org/</A></P>
<P><A HREF="http://www.linux-es.com/">http://www.linux-es.com/</A></P>
<P>P&aacute;gina es espa&ntilde;ol de Linux</P>
<P><A HREF="http://www.escomposlinux.org/grupos/principiantes.php">http://www.escomposlinux.org/grupos/principiantes.php</A></P>
<P>P&aacute;gina en espa&ntilde;ol de Linux</P>
<P><A HREF="http://www.linux.com/">http://www.linux.com/</A></P>
<P>P&aacute;gina anglosajona de Linux</P>
<P><A HREF="http://www.gnome.org/">http://www.gnome.org</A></P>
<P>P&aacute;gina de los desarrolladores del escritorio Gnome</P>
<P><A HREF="http://www.kde.org/">http://www.kde.org</A></P>
<P>P&aacute;gina de los desarrolladores del escritorio KDE</P>
<P><A HREF="http://www.corel.com/">http://www.corel.com</A></P>
<P>P&aacute;gina web de la distribuci&oacute;n Corel</P>
<P><A HREF="http://www.debian.org/">http://www.debian.org</A></P>
<P>P&aacute;gina web de la distribuci&oacute;n Debian</P>
<P><A HREF="http://Xfree86.org/">http://Xfree86.org</A></P>
<P>P&aacute;gina sobre el entorno de ventanas</P>
<P><A HREF="http://www.linuxfocus.org/">http://www.linuxfocus.org</A></P>
<P>Revista en la Red sobre Linux</P>
<P><A HREF="http://www.imaclinux.net/">http://www.imaclinux.net</A></P>
<P>P&aacute;gina de Linux para Mac</P>
<P>&nbsp;</P>
<P>&nbsp;</P></BODY>
</HTML>
