<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Applications">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Katja Socher
 =LF=CAT___: Applications
 =LF=TITLE_: La hora de Jazz++
 =LF=NUMBER: 261
 =LF=ANAME_: article261.html
 -->
 <TITLE>lf261, Applications: La hora de Jazz++</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/katjasocher.gif" alt=
    "[Photo of the Author]" height="148" width="120">
<BR>por  Katja Socher <br> <small>&lt;katja(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<p>Katja es la editora en alem&aacute;n de LinuxFocus. A ella
    le gustan Tux, el cine, la fotograf&iacute;a y el mar. Puedes
    encontrar su p&aacute;gina <a href=
    "http://www.toppoint.de/~utuxfan/k/">aqu&iacute;</a>.</p>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Gabriela Gonzalez <small>&lt;tradugag(at)yahoo.com&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#261lfindex0">Instalaci&oacute;n</A></LI>
  <LI><A HREF="#261lfindex1">Primeros Pasos</A></LI>
  <LI><A HREF="#261lfindex2">Track Window (La ventana de las pistas)</A></LI>
  <LI><A HREF="#261lfindex3">Piano Window (La ventana del piano)</A></LI>
  <LI><A HREF="#261lfindex4">Harmony Browser (El Buscador de Armon&iacute;as)</A></LI>
  <LI><A HREF="#261lfindex5">Random Rhythm Generator (Generador de Ritmo al Azar)</A></LI>
  <LI><A HREF="#261lfindex6">Random Arpeggio Generator (Generador Arpeggio al Azar)</A></LI>
  <LI><A HREF="#261lfindex7">Editar tu m&uacute;sica</A></LI>
  <LI><A HREF="#261lfindex8">Insertar y Repetir</A></LI>
  <LI><A HREF="#261lfindex9">Transponer</A></LI>
  <LI><A HREF="#261lfindex10">Ajuste de Tempo</A></LI>
  <LI><A HREF="#261lfindex11">Cambiar el tono</A></LI>
  <LI><A HREF="#261lfindex12">Crescendo/Decrescendo</A></LI>
  <LI><A HREF="#261lfindex13">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=261&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>La hora de Jazz++</H2>
 <img src="../../common/images/article261/illustration.jpg"
    width="334" height="227" alt="[Illustration]" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

    Jazz es un secuenciador MIDI con muchas caracter&iacute;sticas
    interesantes que te permiten editar y componer tu propia
    m&uacute;sica!

    </P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="261lfindex0">&nbsp;</A>
<H2>Instalaci&oacute;n</H2>

    Jazz++ se encuentra disponible como paquete pre-compilado o
    como c&oacute;digo fuente. La instalaci&oacute;n desde el
    c&oacute;digo fuente es una aventura en s&iacute; misma ya que
    debes encontrar tu propio modo a partir de una biblioteca
    defectuosa wxwin-1.68E que se requiere para la
    instalaci&oacute;n. <br>
     Las versiones pre-compiladas, sin embargo, son f&aacute;ciles
    de instalar y empezaremos con &eacute;sta:<br>
     Descargar <a href=
    "ftp://ftp.jazzware.com/pub/jazz/stable/linux/jazz-bin-4.1.3.tar.gz">
    ftp://ftp.jazzware.com/
    pub/jazz/stable/linux/jazz-bin-4.1.3.tar.gz</a><br>
     No intentes utilizar la versi&oacute;n rpm de jazzware.com. No
    es lo que parece ser y s&oacute;lo contiene un instructivo para
    instalar un archivo tar. No tendr&aacute;s las ventajas que te
    ofrecen los archivos rpm normales.<br>
     1) Busca un directorio (tu directorio de inicio o /usr/local )
    y descompacta jazz-bin-4.1.3.tar.gz:<br>
     tar zxvf /where/you/have/the/package/jazz-bin-4.1.3.tar.gz<br>
     2) Descarga el jazz-bin-4.1.3_addon.tar.gz que puedes
    encontrar al final del art&iacute;culo y ejecuta tar zxvf
    /where/you/have/the/package/jazz-bin-4.1.3_addon.tar.gz<br>
     3) chmod 755 jazz-bin-4.1.3<br>
     chmod 644 jazz-bin-4.1.3/jazz.cfg<br>
     Si no ejecutas el paso 3 cualquier usuario modificar&aacute;
    el archivo de configuraci&oacute;n. Si sigues el paso 3 todos
    los usuarios obtienen un archivo de configuraci&oacute;n por
    defecto. No hay configuraci&oacute;n por usuario.<br>
     Ahora ejecuta el programa Jazz desde bin/jazz . Para producir
    "sonido" necesitas instalar un sistema de sonido. Alsa es una
    buena opci&oacute;n (<a href="article259.shtml">encuentra el
    art&iacute;culo sobre Alsa en</a>).<br>
     Tambi&eacute;n te explicar&eacute; c&oacute;mo instalarlo
    desde la fuente pero necesitar&aacute;s un poco de experiencia
    para hacerlo. Encuentra la descripci&oacute;n en <a href=
    "../../common/src/article261/install.html">&gt;here&lt;</a><br>


    <A NAME="261lfindex1">&nbsp;</A>
<H2>Primeros Pasos</H2>

    Puedes cargar un archivo midi que ya se encuentra en tu
    computadora (tal vez lo hayas ingresado con un programa de
    edici&oacute;n de notas como, por ejemplo, Rosegarden) o bien
    grabas m&uacute;sica mediante un dispositivo midi externo (jazz
    cuenta con muchas opciones para esto pero como yo,
    desafortunadamente, no tengo ese dispositivo, no pude hacer la
    prueba yo misma) o tambi&eacute;n puedes empezar con una hoja
    nueva. <br>
     Jazz te permite componer tu m&uacute;sica tanto como editar
    tus canciones!! <br>
     Hay dos ventanas principales que necesitar&aacute;s todo el
    tiempo: en primer lugar la ventana de las pistas que te
    permitir&aacute; trabajar con la canci&oacute;n completa o con
    partes de ella, y en segundo lugar, la ventana de piano que
    tambi&eacute;n permite editar notas y eventos propios.
    Observemos primero la ventana de las pistas ya que
    empezar&aacute;s por ella. <br>


    <A NAME="261lfindex2">&nbsp;</A>
<H2>Track Window (La ventana de las pistas)</H2>


    <table border="0" align="right" width="450">
      <tr>
        <td><a href="../../common/images/article261/main.gif"><img
        src="../../common/images/article261/main_th.gif" width=
        "304" height="227" alt="[main window]" align="right"></a>
        <a href="../../common/images/article261/track.gif"><img
        src="../../common/images/article261/track_th.gif" width=
        "123" height="221" alt="[track settings]" align="right">
        </a> </td>
      </tr>
    </table>
    Para empezar debes hacer un click con el bot&oacute;n izquierdo
    del rat&oacute;n en uno de los campos sin nombre que aparecen
    debajo del campo que muestra la Speed. Se abrir&aacute; una
    nueva ventana. All&iacute; encontrar&aacute;s una lista con
    varios instrumentos para elegir. <br>
     Realmente hay un mont&oacute;n de instrumentos y adem&aacute;s
    encontrar&aacute;s interesantes sonidos como, por ejemplo, el
    canto de un p&aacute;jaro, la llamada de un tel&eacute;fono o
    el sonido de la brisa de mar. <br>
     En donde lees "trackname" debes darle un nombre a tu pista, el
    nombre debe darte alguna clave con respecto al instrumento de
    que se trate como tambi&eacute;n quiz&aacute; alguna
    informaci&oacute;n sobre la parte en la que interviene en tu
    pieza, como por ejemplo, mano derecha e izquierda de tu piano,
    melod&iacute;a... <br>
     Tambi&eacute;n configuras el canal midi en esta ventana. Hay
    16 canales y cada uno de tus instrumentos deber&iacute;a tener
    el suyo. Puedes elegir el canal que desees, aunque el canal 10
    se reserva para la bater&iacute;a. Esto significa que aunque
    t&uacute; elijas el canal 10 para el piano escuchar&aacute;s
    alg&uacute;n sonido de bater&iacute;a. Si deseas bater&iacute;a
    selecciona el canal 10, de otro modo, &iexcl;elige cualquiera
    de los otros canales! <br>
     Cuando vuelvas a cerrar la ventana, ver&aacute;s el nombre de
    tu pista en el campo sobre el que hab&iacute;as hecho un click
    anteriormente. A la izquierda, bajo la letra M podr&aacute;s
    ver el canal midi que has elegido. Si haces un click sobre la M
    ver&aacute;s una letra T y cambiar&aacute;n los n&uacute;meros.
    T te informa el n&uacute;mero de pista. <br>
     Bajo Prg ver&aacute;s ahora un n&uacute;mero, &eacute;se es el
    n&uacute;mero del instrumento que has elegido. <br>
     Si haces un click en el peque&ntilde;o campo a la izquierda de
    Prg ver&aacute;s que la letra cambia de P a M a S y nuevamente
    a P. P significa ejecutar (Play). Si la cambias a M detienes el
    sonido de la pista y s&oacute;lo escuchar&aacute;s el sonido de
    las otras. Con S sucede lo contrario. Significa "solo" y
    &uacute;nicamente se estar&aacute; ejecutando esta pista. Esto
    es muy &uacute;til cuando tienes m&uacute;ltiples instrumentos
    y deseas escuchar solamente uno o todos sin aqu&eacute;l. <br>
     En el campo grande tu m&uacute;sica aparecer&aacute; escrita
    con un c&oacute;digo de barras. Para que suceda esto cuando
    usas una hoja nueva observemos el bot&oacute;n m&aacute;s
    importante de la barra de herramientas que se encuentra en la
    track window: El bot&oacute;n para <br>


    <A NAME="261lfindex3">&nbsp;</A>
<H2>Piano Window (La ventana del piano)</H2>

    <a href="../../common/images/article261/piano.gif"><img src=
    "../../common/images/article261/piano_th.gif" width="304"
    height="227" alt="[piano window]" align="right"></a> Para
    acceder a la piano window puedes hacer un click en el
    bot&oacute;n de la barra de herramientas pulsando la tecla
    piano o, si deseas la piano window para una cierta pista
    (instrumento) haces un click con el bot&oacute;n derecho en el
    campo de c&oacute;digo de la barra correspondiente a la pista
    deseada. <br>
     A la izquierda ver&aacute;s la tecla de piano y si haces un
    click sobre ella con tu rat&oacute;n escuchar&aacute;s sonido.
    En caso de que hayas seleccionado bater&iacute;a en el canal 10
    ver&aacute;s una lista con instrumentos de bater&iacute;a y
    podr&aacute;s escuchar su sonido. (Si al pulsar la tecla piano
    no apareciera la lista de instrumentos de bater&iacute;a del
    canal 10 puedes hacer un click en Configuraci&oacute;n
    (Settings--&gt;Events) en el men&uacute; de la piano window
    y tildar "Show drumnames on drumtracks")(Mostrar los nombres de
    los instrumentos de bater&iacute;a en las pistas). <br>
     Para insertar notas (las que, nuevamente, se ver&aacute;n como
    c&oacute;digos de barras) en el campo grande que aparece a la
    derecha, simplemente debes hacer un click en el bot&oacute;n
    insertar (insert button) (de izquierda a derecha es el cuarto
    en la barra de herramientas) y luego hacer un click en el campo
    del lugar en donde quieres que est&eacute;n las notas. Los
    siguientes cuatro botones en la barra de herramientas
    determinan la extensi&oacute;n de las notas que
    insertar&aacute;s. Sin embargo, tambi&eacute;n puedes
    insertarlas en forma manual haciendo un click con el
    bot&oacute;n derecho sobre la nota que deseas editar y luego
    arrastrando el rat&oacute;n con el bot&oacute;n apretado. <br>
     <br>
     Para recibir ayuda con tus composiciones puedes, por ejemplo,
    usar los Generadores al Azar (Random Generators) y <br>


    <A NAME="261lfindex4">&nbsp;</A>
<H2>Harmony Browser (El Buscador de Armon&iacute;as)</H2>

    <a href="../../common/images/article261/harmony.gif"><img src=
    "../../common/images/article261/harmony_th.gif" width="334"
    height="292" alt="[Harmony Browser]" align="right"></a> Vuelve
    a la track window. En el men&uacute; debes hacer un
    click en Misc--&gt;Harmony Browser entonces se abrir&aacute;n el Harmony Browser
    y una nueva ventana. <br>
     Una forma de utilizar este buscador es haciendo un click en
    los acordes disponibles. Establece los que deseas en la
    Secuencia (Sequence) manteniendo apretada la tecla de las
    may&uacute;sculas mientras haces un click en el acorde elegido.
    Si ahora t&uacute; haces un click en el acorde dentro de la
    secuencia, &eacute;ste ingresa en el b&uacute;fer de piano. Al
    ir a la piano window y hacer un click con el bot&oacute;n
    izquierdo sobre ella podr&aacute;s pegar el acorde all&iacute;.
    <br>
     Regresamos al Harmony Browser. Si te diriges al
    men&uacute; de configuraciones Settings--&gt; Midi puedes
    cambiar el tono de las notas en el Harmony Browser
    para obtener acordes con un sonido m&aacute;s bajo o m&aacute;s
    alto. <br>
     Aqu&iacute; tambi&eacute;n puedes configurar el canal midi que
    el Harmony Browser deber&iacute;a buscar para su
    instrumento (esto es importante cuando quieres emplearlo para
    varios instrumentos porque de otro modo todos sonar&aacute;n
    como el que corresponda al establecido para ese canal). <br>
     Otra forma de utilizar el Harmony Browser es
    establecer primero algunas notas en la piano window. Si
    seleccionas estas notas en la track window debes hacer un
    click en Action--&gt;Analyze en el Harmony Browser,
 las notas ser&aacute;n transformadas en
    acordes. Puedes verlas en la secuencia de acordes y luego
    pegarlas en tu canci&oacute;n. <br>
     Para seleccionar notas, haces un click con el bot&oacute;n
    izquierdo de tu rat&oacute;n y arrastras el rat&oacute;n sobre
    ellas. Si deseas seleccionar m&aacute;s de lo que puedes ver en
    la ventana abierta debes mantener apretada la tecla de
    may&uacute;sculas mientras haces tu elecci&oacute;n. Mientras
    te mueves por la pantalla puedes continuar con tu
    selecci&oacute;n. <br>


    <A NAME="261lfindex5">&nbsp;</A>
<H2>Random Rhythm Generator (Generador de Ritmo al Azar)</H2>

    <a href="../../common/images/article261/rhythem.gif"><img src=
    "../../common/images/article261/rhythem_th.gif" width="324"
    height="317" alt="[Random Rhythm]" align="right"></a>
    Selecciona el &aacute;rea de tu pista donde deseas establecer
    un ritmo al azar en la track window. Abre el Generador
    haciendo un click en Misc--&gt;Random Rhythm en el men&uacute;
    de la track window. Antes deber&iacute;as elegir un
    instrumento. Luego puedes establecer las variables restantes
    que figuran en la ventana y generar el ritmo al hacer click en
    Instrument--&gt;Generate. Despu&eacute;s de ello puedes
    continuar con otro instrumento hasta que hayas terminado. <br>
     Esc&uacute;chalo. Personalmente pienso que debes probar varias
    veces. A veces se logra un buen ritmo. Otras veces no. Es
    simplemente azar pero te gustar&aacute; utilizarlo. <br>
     Las variables que especificas son probabilidades. Por ejemplo,
    en el campo de ritmo especificas la probabilidad de que un
    instrumento se toque en ese momento. Un valor alto indica una
    alta probabilidad mientras que un valor bajo indicar&aacute;
    una probabilidad baja. <br>
     En el instructivo se sugiere que cada instrumento se pruebe
    dos veces. As&iacute; eliges probabilidades altas en algunas
    posiciones y bajas para muchas otras. El resultado es bastante
    lindo. <br>
     Tambi&eacute;n puedes definir grupos de instrumentos para
    hacer que distintos tambores toquen un poco m&aacute;s juntos.
    Esto es lo que ves hacia la derecha del cuadro de
    di&aacute;logo del Random Rhythm Generator. Observa que
    debes elegir un colaborador antes que un oyente. <br>


    <A NAME="261lfindex6">&nbsp;</A>
<H2>Random Arpeggio Generator (Generador Arpeggio al Azar)</H2>

    <a href="../../common/images/article261/arpeggio.gif"><img src=
    "../../common/images/article261/arpeggio_th.gif" width="204"
    height="152" alt="[Random Arpeggio]" align="right"></a>
    Tambi&eacute;n encuentro interesante el uso de este generador.
    Un arpeggio puede describirse como un acorde en el que se toca
    una nota por vez. En pocas palabras, en lugar de tocarse todas
    las notas de un acorde juntas, se tocan individualmente, una
    detr&aacute;s de la otra. &iexcl;A veces se obtienen sonidos
    muy lindos! A m&iacute; particularmente me gusta copiar los
    acordes primero a otra pista, as&iacute; tengo una pista con
    los acordes y otra con el arpeggio. &iexcl;Generalmente se
    obtiene un sonido muy bello! <br>
     <br>
     Simplemente juega con esto. Te sorprender&aacute;s de ver
    cu&aacute;ntos sonidos y ritmos lindos puedes crear con
    bastante facilidad. <br>
     <br>
     Y ahora que tienes una pieza musical, tal vez querr&iacute;as
    editar partes de ella:<br>


    <A NAME="261lfindex7">&nbsp;</A>
<H2>Editar tu m&uacute;sica</H2>

    Realmente hay muchas posibilidades con Jazz++ para editar tu
    pieza musical de cualquier modo que desees y no nos es posible
    discutirlas todas aqu&iacute;. Veamos solamente algunas de
    ellas: <br>


    <A NAME="261lfindex8">&nbsp;</A>
<H2>Insertar y Repetir</H2>

    Si deseas insertar notas en alg&uacute;n lugar en medio de tu
    pieza y necesitas m&aacute;s espacio para ello simplemente
    puedes mover las otras notas con cut y paste. Primero debes
    hacer un click y arrastrar el bot&oacute;n izquierdo de tu
    rat&oacute;n para seleccionar las notas que deseas mover, luego
    haces un click en cut del men&uacute;. Cuando ahora haces un
    click en pegar y mueves tu rat&oacute;n sobre la track window
ver&aacute;s una flecha. Si haces un click con el
    bot&oacute;n izquierdo, en ese lugar se pegar&aacute;. <br>
     Si deseas repetir una parte, debes hacer lo mismo y
    simplemente copy en lugar de cut. <br>
     Otra forma de repetir algo es usar replicar. En primer lugar,
    selecciona el &aacute;rea que quieras replicar. Luego replicas
    en Trackwindow Edit--&gt;Replicate. Ahora s&oacute;lo haces
    click en donde quieres que se inicie la copia. Se abrir&aacute;
    un cuadro de di&aacute;logo. Despu&eacute;s de cerrarlo, debes
    hacer un click en donde quieres replicar hasta el final. Si
    tildas "Repeat Copy" ("Repetir Copia") la parte seleccionada se
    repetir&aacute; para completar el rango de destino. Si lo que
    est&aacute; tildado es "Insert Space" ("Insertar Espacio")
    otras partes de la m&uacute;sica se mover&aacute;n hacia la
    derecha para dejar espacio a la m&uacute;sica nueva. <br>
     Tambi&eacute;n puedes insertar una parte de otra
    canci&oacute;n en una nueva con simplemente guardar la parte
    como patr&oacute;n (File--&gt;Save Pattern) para luego
    insertarla m&aacute;s tarde en la nueva canci&oacute;n mediante
    File--&gt;Load Pattern. <br>
     Para borrar algo acude a Edit--&gt;Delete. En el cuadro de
    di&aacute;logo puedes decidir si el borrado debe dejar un
    espacio libre o si la m&uacute;sica que se encuentra a la
    derecha debe moverse para completar el espacio. <br>


    <A NAME="261lfindex9">&nbsp;</A>
<H2>Transponer</H2>

    Para transponer parte de tu m&uacute;sica, primero debes
    seleccionarla, luego eliges Edit--&gt;Transpose en la track window.
    <br>
     Otra forma de transponer es utilizar el Harmony Browser.
    Puedes elegir algunos acordes que desees.
    Luego seleccionas la parte de la pieza musical que quieres
    transponer en la track window y haces un click en
    Action-&gt;Transpose en el Harmony Browser. Las
    notas de tu pieza musical ser&aacute;n transpuestas al tono de
    los acordes. <br>


    <A NAME="261lfindex10">&nbsp;</A>
<H2>Ajuste de Tempo</H2>

    <a href="../../common/images/article261/pianotempo.gif"><img
    src="../../common/images/article261/pianotempo_th.gif" width=
    "245" height="183" alt="[Tempo Adjustment]" align="right"></a>
    Te sorprender&aacute; descubrir cu&aacute;n diferente puede
    sonar la m&uacute;sica seg&uacute;n la velocidad con la que se
    la ejecuta. Para ajustar la velocidad debes ir a la track window.
    All&iacute; te encontrar&aacute;s con el campo de
    velocidad. Si haces un click con el bot&oacute;n derecho del
    rat&oacute;n, la velocidad disminuir&aacute;, mientras que con
    el izquierdo aumentar&aacute;. <br>
     Para cambiar la velocidad de algunas partes de tu
    canci&oacute;n &uacute;nicamente, debes hacer un click en
    Misc--&gt;Edit Tempo en la piano window. Ver&aacute;s que
    bajo las notas se hace visible un nuevo campo. Aqu&iacute;
    puedes establecer con tu rat&oacute;n los cambios de tempo
    deseados. (Por alguna raz&oacute;n, a veces tengo que hacer un
    click en Misc--&gt;Edit Tempo nuevamente despu&eacute;s de
    hacer un click en Aplicar para que funcione correctamente.)
    <br>


    <A NAME="261lfindex11">&nbsp;</A>
<H2>Cambiar el tono</H2>

    Click Misc--&gt;Edit Pitch en la piano window. Funciona en
    forma similar a cambiar el tempo en una parte de tu
    canci&oacute;n: Ver&aacute;s que aparece un nuevo campo debajo
    de las notas y puedes establecer el tono deseado, con el
    rat&oacute;n. <br>


    <A NAME="261lfindex12">&nbsp;</A>
<H2>Crescendo/Decrescendo</H2>

    Para esto utilizas el bot&oacute;n de velocidad Misc--&gt;Edit
    Velocity en la piano window. <br>
     <br>
     <br>
     Si no te gustan los cambios que has hecho, los puedes deshacer
    con un click en el bot&oacute;n deshacer (Misc--&gt;Undo).
    <br>
     <br>
     <br>
     &iexcl;Espero que ahora tengas una idea acerca de c&oacute;mo
    funciona Jazz++ y que est&eacute;s ansioso por utilizarlo ya
    mismo! Hay muchas m&aacute;s caracter&iacute;sticas para
    explorar como el tablero de guitarra, el generador de combinar
    sonidos al azar etc. etc. pero aqu&iacute; ya eres t&uacute;
    quien lo probar&aacute; por su cuenta!<br>
     <br>
     &iexcl;Divi&eacute;rtete y disfr&uacute;talo!<br>
     <br>


    <A NAME="261lfindex13">&nbsp;</A>
<H2>Referencias</H2>

    El programa en s&iacute; tiene buena informaci&oacute;n con
    s&oacute;lo hacer un click en el bot&oacute;n de ayuda (Help).
    Tambi&eacute;n puedes buscar all&iacute;. <br>


    <ul>
      <li><a href="http://www.jazzware.com/">jazzware.com</a></li>

      <li><a href="http://hymnsite.com/how_to/midi.html">HowTo from
      Hymn</a></li>

      <li><a href=
      "../../common/src/article261/jazz-bin-4.1.3_addon.tar.gz">jazz-bin-4.1.3_addon.tar.gz</a></li>

      <li>Jazz++ funciona mejor con sonido alsa. Puedes leer el
      art&iacute;culo 259:<a href="article259.shtml">Midi con
      alsa</a></li>

      <li><a href="../../common/src/article261/index.html">comandos
      adicionales para la instalaci&oacute;n de c&oacute;digo
      fuente</a></li>
    </ul>
    <!-- vim: set sw=2 ts=2 et tw=80: -->
  



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=261&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Katja Socher, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article261.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">es --&gt; -- : Katja Socher <small>&lt;katja(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Gabriela Gonzalez &lt;tradugag(at)yahoo.com&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-09-11, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
