<HTML>
<HEAD>
<TITLE>Linux con Ra&iacute;z-NFS Mini-COMO: Arranque de la estaci&oacute;n de trabajo</TITLE>
</HEAD>
<BODY>
<A HREF="Linux-Con-Raiz-NFS-Como-3.html">Anterior</A>
<A HREF="Linux-Con-Raiz-NFS-Como-5.html">Siguiente</A>
<A HREF="Linux-Con-Raiz-NFS-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Arranque de la estaci&oacute;n de trabajo</A></H2>



<H2><A NAME="ss4.1">4.1 Uso de una ROM de inicio (<I>BOOT ROM</I>)</A></H2>


<P>Como yo no he usado ninguna en mis pruebas, solamente puedo dar algunas
ideas (cortes&iacute;a de Christian Leutloff, <CODE>
<A HREF="mailto:leutloff@sundancer.tng.oche.de">leutloff@sundancer.tng.oche.de</A></CODE>): </P>
<P>
<UL>
<LI>No es posible utilizar ROMs de arranque "normales". 
</LI>
<LI>Existe el paquete <CODE>netboot</CODE> de Gero Kuhlmann, que permite crear
ROMs de inicio para Linux y que contiene la informaci&oacute;n necesaria. 
<CODE>netboot</CODE> est&aacute; disponible en servidores ftp de Linux o como paquete
Debian (<CODE>netboot-0.4</CODE>). 
</LI>
<LI>Lea detenidamente la documentaci&oacute;n que viene con su ROM de arranque. 
</LI>
<LI>Probablemente sea necesario habilitar <CODE>tftpd</CODE> en el servidor,
depender&aacute; de la forma en que su ROM de inicio cargue el n&uacute;cleo.
</LI>
<LI>Cualquier informaci&oacute;n sobre vendedores de ROMs con estas
caracter&iacute;sticas para Linux ser&aacute; bienvenida, ya que nadie tiene acceso a
una m&aacute;quina grabadora (especialmente en Europa donde yo resido). Y yo la
incluir&iacute;a aqu&iacute;.</LI>
</UL>
</P>


<H2><A NAME="ss4.2">4.2 Uso de un disquete de arranque</A></H2>


<P>Si ha exportado el sistema de archivos con el nombre correcto y su
servidor NFS es tambi&eacute;n el servidor RARP (lo cual implica que las m&aacute;quinas
est&aacute;n en la misma subred), puede entonces simplemente arrancar Linux desde
un disquete (necesita tener configurado como dispositivo ra&iacute;z de dicho
n&uacute;cleo <CODE>0:255</CODE>).</P>
<P>Esto asume que el directorio ra&iacute;z en el servidor es
<CODE>/tftpboot/direcci&oacute;n-IP</CODE> (este valor puede ser modificado cuando se
compila el n&uacute;cleo).</P>


<H2><A NAME="ss4.3">4.3 Uso de un gestor de arranque y RARP</A></H2>


<P>Pase al n&uacute;cleo todos los par&aacute;metros cuando arranca y agregue</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 
nfsroot=dir-IP-servidor:/ruta/a/montar 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>donde <CODE>dir-IP-servidor</CODE> es la direcci&oacute;n IP de su servidor NFS, y
<CODE>/ruta/a/montar</CODE> es la trayectoria (<I>path</I>) al directorio ra&iacute;z. </P>
<P>Sugerencias:</P>
<P>
<UL>
<LI>Cuando utilice LILO considere usar la opci&oacute;n "<CODE>lock</CODE>": 
Simplemente escriba una vez los par&aacute;metros correctos y agregue
"<CODE>lock</CODE>". La siguiente vez que arranque deje que LILO haga todo. 
</LI>
<LI>Cuando genere un disco espec&iacute;fico para una estaci&oacute;n de trabajo,
puede utilizar la opci&oacute;n <CODE>append=</CODE> en el fichero de configuraci&oacute;n
<CODE>lilo.conf</CODE></LI>
</UL>
</P>


<H2><A NAME="ss4.4">4.4 Uso de un gestor de arranque sin RARP</A></H2>


<P>Adem&aacute;s de <CODE>nfsroot</CODE> ponga el argumento
<CODE>nfsaddrs=maq-IP:serv-IP:pasa-IP:masc-IP:nombre-maq</CODE> como
par&aacute;metros para el n&uacute;cleo.  El n&uacute;cleo configurar&aacute; <CODE>eth0</CODE> con los
par&aacute;metros que le ha proporcionado:</P>
<P>
<DL>
<DT><B><CODE>maq-IP</CODE></B><DD><P>Direcci&oacute;n IP de la estaci&oacute;n de trabajo</P>
<DT><B><CODE>serv-IP</CODE></B><DD><P>Direcci&oacute;n IP del servidor NFS</P>
<DT><B><CODE>pasa-IP</CODE></B><DD><P>Direcci&oacute;n de la pasarela</P>
<DT><B><CODE>masc-IP</CODE></B><DD><P>M&aacute;scara de red</P>
<DT><B><CODE>nombre-maq</CODE></B><DD><P>Nombre de la m&aacute;quina</P>
</DL>
</P>


<HR>
<A HREF="Linux-Con-Raiz-NFS-Como-3.html">Anterior</A>
<A HREF="Linux-Con-Raiz-NFS-Como-5.html">Siguiente</A>
<A HREF="Linux-Con-Raiz-NFS-Como.html#toc4">Indice</A>
</BODY>
</HTML>
