<HTML>
<HEAD>
<TITLE>HDs grandes: mini-COMO: Geometr&iacute;a de los discos y particiones.</TITLE>
</HEAD>
<BODY>
<A HREF="Discos-Grandes-Como-2.html">Anterior</A>
<A HREF="Discos-Grandes-Como-4.html">Siguiente</A>
<A HREF="Discos-Grandes-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Geometr&iacute;a de los discos y particiones.</A></H2>


<P>Si tiene varios sistemas operativos en sus discos, cada uno puede estar
utilizando una o varias particiones. El m&aacute;s m&iacute;nimo desacuerdo en cuanto a
d&oacute;nde est&aacute;n dichas particiones puede acarrear catastr&oacute;ficas consecuencias. </P>
<P>El MBR contiene una <I>tabla de particiones</I> describiendo donde est&aacute;n
las particiones (primarias). Hay 4 entradas en dicha tabla, para 4
particiones primarias
<SL>N del T: o para 3 primarias y 1
extendida</SL>
, y cada una tiene el siguiente aspecto: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
struct partition {
        char active;    /* 0x80: arrancable, 0: no arrancable */
        char begin[3];  /* CHS para el primer sector */
        char type;
        char end[3];    /* CHS para el ultimo sector */
        int start;      /* numero de sector en 32 bit (contado desde 0) */
        int length;     /* numero de sectores 32 en bit */
};
</PRE>
</CODE></BLOCKQUOTE>

(donde CHS se refiere a Cilindros/Cabezas/Sectores).</P>
<P>Por tanto, la informaci&oacute;n es redundante: la localizaci&oacute;n de la partici&oacute;n
se da tanto por los campos de 24 bits <CODE>begin</CODE> y <CODE>end</CODE>, como por los
campos de 32 bits <CODE>start</CODE> y <CODE>length</CODE>. </P>
<P>Linux s&oacute;lo usa los campos <CODE>start</CODE> y <CODE>length</CODE>, y puede por tanto
manejar particiones no mayores de 2^32 sectores, o lo que es lo mismo,
particiones de m&aacute;s de 2 TeraBytes. Lo cual es doscientas veces el tama&ntilde;o
de los discos disponibles actualmente, por lo que ser&aacute; suficiente para los
pr&oacute;ximos 10 a&ntilde;os o as&iacute;. </P>
<P>Desafortunadamente, la llamada a la INT13 de la BIOS emplea los CHS
codificados en tres bytes, con 10 bits para el n&uacute;mero de cilindro, 8 para
el n&uacute;mero de cabeza, y 6 para el numero de sector de pista. </P>
<P>Los n&uacute;meros posibles de cilindro son 0-1023, de cabeza 0-255, y de sector
de pista 1-63 (s&iacute;, los sectores de una pista se cuentan desde 1, no desde
0).  Con esos 24 bits se puede acceder a 8455716864 bytes (7.875 GB),
doscientas veces m&aacute;s de las capacidades de disco disponibles en 1983.</P>
<P>Todav&iacute;a m&aacute;s desafortunadamente, los interfaces IDE est&aacute;ndar permiten 256
sectores/pista, 65536 cilindros y 16 cabezas. Esto por s&iacute; mismo permite el
acceso a 2^37 = 137438953472 bytes (128 GB), pero combinado con la
restricci&oacute;n de la BIOS a 63 sectores y 1024 cilindros hace que s&oacute;lo queden
528482304 bytes (504 MB) accesibles. </P>
<P>Esto no es suficiente para los discos de hoy en d&iacute;a, por lo que la gente
recurre a todo tipo de triqui&ntilde;uelas, tanto v&iacute;a <I>hardware</I> como
<I>software</I>. </P>

<HR>
<A HREF="Discos-Grandes-Como-2.html">Anterior</A>
<A HREF="Discos-Grandes-Como-4.html">Siguiente</A>
<A HREF="Discos-Grandes-Como.html#toc3">Indice</A>
</BODY>
</HTML>
