<HTML>
<HEAD>
<TITLE>HDs grandes: mini-COMO: Traslaciones y Managers de disco</TITLE>
</HEAD>
<BODY>
<A HREF="Discos-Grandes-Como-3.html">Anterior</A>
<A HREF="Discos-Grandes-Como-5.html">Siguiente</A>
<A HREF="Discos-Grandes-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Traslaciones y Managers de disco</A></H2>


<P>A nadie le importa cu&aacute;l es la geometr&iacute;a `real' de un disco.  De hecho,
incluso el n&uacute;mero de sectores por pista es variable --hay m&aacute;s sectores por
pista conforme nos acercamos al borde exterior del disco-- por lo que no
hay un n&uacute;mero de sectores por pista `verdadero'. </P>
<P>Para el usuario resulta m&aacute;s conveniente considerar un disco como una
simple serie
<SL>N del T: ``<I>array</I>'' en el original.</SL>

lineal de sectores numerados como 0, 1, ..., y dejar a la controladora el
trabajo de encontrar en qu&eacute; lugar del disco reside un sector dado. </P>
<P>Esta numeraci&oacute;n lineal se conoce como <B>LBA</B>. Las direcciones lineales
correspondientes a (c,h,s)
<SL>N del T: c=cilindros h=cabezas
s=sectores; par&aacute;metros l&oacute;gicos.</SL>
para un disco con geometr&iacute;a
(C,H,S)
<SL>N del T: par&aacute;metros f&iacute;sicos</SL>
 corresponden a
c*H*S + h*S + (s-1). Todas las controladoras SCSI ``hablan'' LBA, junto
con algunas IDE. </P>
<P>Si la BIOS convierte los (c,h,s) de 24 bits a LBA y le pasa eso a una
controladora que ``entienda'' LBA, entonces vuelven a ser accesibles 7.875
GB.  No es suficiente para todos los discos, pero no deja de ser
constituir una mejora. </P>
<P>T&eacute;ngase en cuenta que que aqu&iacute; CHS, tal y como los usa la BIOS, no tiene
nada que ver con la `realidad'. </P>
<P>Algo similar funciona cuando la controladora no ``habla'' LBA, pero la
BIOS s&iacute; sabe hacer la traslaci&oacute;n. (En el <I>setup</I> esto se suele indicar
como ``<I>large</I>''.) La BIOS presentar&aacute; una geometr&iacute;a (C',H',S') al
sistema operativo, usando (C,H,S) para hablar con la controladora del
disco. Normalmente <F>S = S', C' = C/N</F> y <F>H' = H*N</F>, donde <I>N</I>
es la menor potencia de dos que asegura que C' &lt;= 1024 (a fin de que se
malgaste la menor capacidad posible al redondear en C' = C/N). 
Nuevamente, esto nos proporciona acceso a 7.875 GB. </P>
<P>Si la BIOS no sabe nada acerca de `LBA' o `Large', podemos recurrir a
ciertas soluciones <I>software</I>. Los <I>Disk Managers</I> o
<I>Gestores de Disco</I> como <I>OnTrack</I> o <I>EZ-Drive</I> reemplazan
las rutinas de gesti&oacute;n de disco por otras suyas.  Esto se lleva a cabo
normalmente haciendo residir el c&oacute;digo del gestor de disco en el MBR y
sectores subsecuentes (OnTrack llama a este c&oacute;digo <I>DDO</I>: <I>Dynamic
Drive Overlay</I>
<SL>N del T: algo as&iacute; como <I>Superposici&oacute;n
Din&aacute;mica de Disco</I>.</SL>
, de modo que sea arrancado antes que
cualquier otro sistema operativo. Esa es la raz&oacute;n por la que se pueden
tener problemas arrancando desde disquete cuando se ha instalado un Gestor
de Disco.
<SL>N. del T. Esto no significa que no pueda hacerse de
modo seguro; los gestores suelen proveer utilidades para hacer disquetes
especiales de arranque</SL>
</P>
<P>El efecto es m&aacute;s o menos el mismo que cuando se hacen traslaciones v&iacute;a
BIOS, pero --especialmente cuando haya distintos sistemas operativos en el
mismo disco-- con la salvedad de que pueden causar bastantes problemas. </P>
<P>Linux soporta <I>OnTrack Disk Manager</I> desde la versi&oacute;n de n&uacute;cleo
1.3.14, y <I>EZ-Drive</I> desde la versi&oacute;n 1.3.29. M&aacute;s detalles a
continuaci&oacute;n. </P>

<HR>
<A HREF="Discos-Grandes-Como-3.html">Anterior</A>
<A HREF="Discos-Grandes-Como-5.html">Siguiente</A>
<A HREF="Discos-Grandes-Como.html#toc4">Indice</A>
</BODY>
</HTML>
