<HTML>
<HEAD>
<TITLE>Linux ifmail-COMO en Castellano: Agradecimientos </TITLE>
</HEAD>
<BODY>
<A HREF="Ifmail-Como-6.html">Anterior</A>
<A HREF="Ifmail-Como-8.html">Siguiente</A>
<A HREF="Ifmail-Como.html#toc7">Indice</A>
<HR>
<H2><A NAME="s7">7. Agradecimientos </A></H2>


<P>Hay mucha gente a la que agradecer desde aqu&iacute;. Principalmente, a los
siguientes: </P>
<P>
<UL>
<LI> A &Aacute;ngel Jim&eacute;nez Jim&eacute;nez, quien, siendo el punto de Fidonet
2:345/207.7, me dedic&oacute; un extenso mensaje acerca de c&oacute;mo hab&iacute;a configurado
su sistema. Actualmente esa direcci&oacute;n pertenece a otra persona, y no s&eacute;
qu&eacute; ha sido de &Aacute;ngel :-(

</LI>
<LI> A 
<A HREF="mailto:rcamus@jet.es">Ram&oacute;n Guti&eacute;rrez Camus</A>, que fue quien me pas&oacute; sus ficheros de configuraci&oacute;n con los que
empec&eacute; a trabajar. 
</LI>
<LI> A 
<A HREF="mailto:ulusa@frodo.com">Urko Lusa</A>, quien
tambi&eacute;n se ha montado un tinglado parecido y me ha dado algunos consejos
(y adem&aacute;s es un experto en mezclar armoniosamente los juegos de caracteres
para que todo el mundo se entienda :-) ). 
</LI>
<LI> A todos aquellos que me han pasado desde la primera versi&oacute;n del
documento, all&aacute; por Abril; sus sugerencias que han contribuido a
ampliarlo. 
</LI>
<LI> Al 
<A HREF="http://www.fi.upm.es">Centro de C&aacute;lculo</A> de
la Facultad de Inform&aacute;tica de la Universidad Polit&eacute;cnica de Madrid, por
poner a nuestra disposici&oacute;n un fichero de configuraci&oacute;n del
<CODE>sendmail</CODE> que m&aacute;s o menos parec&iacute;a f&aacute;cil de entender y modificar. 
</LI>
<LI> A 
<A HREF="mailto:srtxg@linux.chanae.stben.be">Pablo Saratxaga</A>, quien ha hecho las versiones <I>tx</I> de <I>ifmail</I>. 
</LI>
<LI> Y, por supuesto, a Enrique L&oacute;pez, el SysOp de CORBEN BBS (2:341/12)
y mi Boss desde que decid&iacute; hacerme punto. No creo que conozca Sysop mejor,
ni que me aguante m&aacute;s :-) 
</LI>
</UL>
</P>

<HR>
<A HREF="Ifmail-Como-6.html">Anterior</A>
<A HREF="Ifmail-Como-8.html">Siguiente</A>
<A HREF="Ifmail-Como.html#toc7">Indice</A>
</BODY>
</HTML>
