<HTML>
<HEAD>
<TITLE>Linux ifmail-COMO en Castellano: Introducci&oacute;n </TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Ifmail-Como-2.html">Siguiente</A>
<A HREF="Ifmail-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n </A></H2>


<P>Me gusta el riesgo. Eso me anim&oacute; hace tres a&ntilde;os a hacerme punto de
Fidonet por la v&iacute;a dif&iacute;cil (FrontDoor + FastEcho + GoldED). Luego me dio
por los sistemas operativos de <I>l&iacute;nea de comandos</I> (Unix sin
ventanas, ya me entend&eacute;is ;-) ). Me envici&eacute; con el Linux, y claro, lleg&oacute;
la hora de gestionar el correo de Fido desde Linux, y no me iba a quedar
con el m&eacute;todo f&aacute;cil ... </P>
<P>Pero configurar el sistema de correo bajo Unix es como mil veces
m&aacute;s dif&iacute;cil que hacerlo en DOS. Uno tiene que aprender a configurar, no
dos, sino hasta cinco programas que no tienen nada que ver el uno del
otro. Hay que lidiar con la escasa documentaci&oacute;n que cada aplicaci&oacute;n trae,
juntarlo todo armoniosamente y finalmente lograr que funcione. Confieso
que eso me hizo echarme atr&aacute;s en varias ocasiones... hasta que vino la
ayuda del cielo. </P>
<P>Ram&oacute;n Guti&eacute;rrez, antiguo moderador de la (mejor) &aacute;rea de Fidonet,
R34.LINUX, me pas&oacute; todos sus ficheros de su configuraci&oacute;n, que a &eacute;l le
funcionaba a medias. Con ellos me puse y aqu&iacute; estamos. </P>
<P>Tengo que decir que este documento va dirigido a los puntos
interesados en gestionar todo el tema desde Unix. Por lo tanto, asumo que
ya se es punto y se conoce de qu&eacute; va el tema de Fidonet. Hace tiempo que
escrib&iacute; un documento sobre c&oacute;mo hacerse punto bajo MS-DOS, que igual le
interesa a alguien que aun no lo haya hecho ... lo ten&eacute;is en 
<A HREF="http://lml.ls.fi.upm.es/~jjamor/intropnt.txt">http://lml.ls.fi.upm.es/~jjamor/intropnt.txt</A>. </P>
<P>Seguro que alg&uacute;n veterano de ifmail y compa&ntilde;&iacute;a tiene sugerencias que
hacerme. Pues venga, las espero todas en
<A HREF="mailto:jjamor@ls.fi.upm.es">jjamor@ls.fi.upm.es</A>
o en 
<A HREF="mailto:Juan.Jose.Amor@p19.f12.n341.z2.fidonet.org">mi direcci&oacute;n de fido, 2:341/12.19</A>. </P>

<HR>
Anterior
<A HREF="Ifmail-Como-2.html">Siguiente</A>
<A HREF="Ifmail-Como.html#toc1">Indice</A>
</BODY>
</HTML>
