<HTML>
<HEAD>
<TITLE>Linux ifmail-COMO en Castellano: &Aacute;reas p&uacute;blicas (ECHO) </TITLE>
</HEAD>
<BODY>
<A HREF="Ifmail-Como-3.html">Anterior</A>
<A HREF="Ifmail-Como-5.html">Siguiente</A>
<A HREF="Ifmail-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. &Aacute;reas p&uacute;blicas (ECHO) </A></H2>


<P>Prepar&aacute;os, porque viene lo peor :-) No obstante, si hab&eacute;is llegado a
enviar y recibir correctamente los NETs, os considero capaz de afrontar la
siguiente fase. </P>
<P>Empezad por instalaros un sistema de noticias. Yo he instalado el m&aacute;s
moderno, INN. La gente dice que C-News es m&aacute;s sencillo. Si eleg&iacute; INN es
porque viene como paquete est&aacute;ndar de la distribuci&oacute;n RedHat de Linux. </P>
<P>Uno y otro, utilizan ficheros de configuraci&oacute;n parecidos. INN es m&aacute;s
potente pero m&aacute;s lioso cuando hay problemas. Intentaremos ver c&oacute;mo
configurarlo todo para recibir el correo de Fido en las news. Antes, os
recomiendo que os inici&eacute;is en el mundo de los servidores de News. Una
lectura interesante es la gu&iacute;a de administraci&oacute;n de redes, de Olaf Kirch,
que tambi&eacute;n ha traducido 
<A HREF="http://www.infor.es/LuCAS/">el proyecto LuCAS</A>. </P>
<P>Si instal&aacute;is el paquete de la distribuci&oacute;n de RedHat, os meter&aacute; archivos
de configuraci&oacute;n en <CODE>/etc/news</CODE>, ficheros de grupos activos en
<CODE>/var/lib/news</CODE> y os crear&aacute; el directorio <CODE>/var/spool/news</CODE>
con alg&uacute;n contenido. </P>

<H2><A NAME="ss4.1">4.1 Retocar ifmail </A></H2>


<P>En el cap&iacute;tulo anterior nos olvidamos de las &aacute;reas de ECHO, con lo que
ten&iacute;amos el fichero de &aacute;reas vac&iacute;o. Vamos a rellenarlo ahora. </P>
<P>Para ello, a&ntilde;adid l&iacute;neas como esta:</P>
<P>
<PRE>
AVISOS.R34                fido.r34.avisos             fido
</PRE>
</P>
<P>En cada l&iacute;nea, el primer campo es el nombre del &aacute;rea en Fido. El segundo
es el nombre del grupo de news donde vamos a guardar el &aacute;rea. Y el
tercero, es el tipo de <I>distribuci&oacute;n</I> que le vamos a dar (en
general, se le da <CODE>fido</CODE> frente a <CODE>world</CODE> que se le da a los
grupos de USENET). </P>
<P>Si us&aacute;is la versi&oacute;n <CODE>tx</CODE> de <I>ifmail</I>, y escrib&iacute;s con acentos
y e&ntilde;es, os recomiendo esta l&iacute;nea para cada &aacute;rea, en lugar de la anterior: </P>
<P>
<PRE>
AVISOS.R34      fido.r34.avisos         fido    iso-8859-1      CP437
</PRE>
</P>
<P>De esta forma vuestros mensajes de ECHO se exportar&aacute;n con c&oacute;digos del IBM
PC bajo DOS, lo que facilitar&aacute; su lectura a los usuarios de programas de
correo bajo este sistema operativo. Recordad que para los mensajes
recibidos no ten&eacute;is que tener en cuenta esto, ya que como os dije, la
cabecera de FIDO <CODE>CHRS</CODE> es interpretada autom&aacute;ticamente por vuestro
<I>ifmail</I> y pr&aacute;cticamente cualquier otro procesador de correo Fido
bajo Unix. </P>


<H2><A NAME="ss4.2">4.2 Activar las &aacute;reas en el INN </A></H2>


<P>Para que las &aacute;reas sean aceptadas en el INN (o C-News) hay que incluirlas
en el fichero <CODE>/var/lib/news/active</CODE>. Para la anterior, por
ejemplo, la l&iacute;nea a a&ntilde;adir ser&iacute;a: </P>
<P>
<PRE>
fido.r34.avisos 0000000001 0000000001 y
</PRE>
</P>
<P>Adem&aacute;s, si la a&ntilde;adimos al fichero <CODE>/var/lib/news/newsgroups</CODE> como
sigue: </P>
<P>
<PRE>
fido.r34.avisos            Avisos de R34
</PRE>
</P>
<P>tendremos la descripci&oacute;n visible en programas lectores como <CODE>tin</CODE> o
<CODE>xrn</CODE>. </P>


<H2><A NAME="ss4.3">4.3 Otros ficheros de configuraci&oacute;n de INN </A></H2>


<P>En /etc/news habr&aacute; que preparar algunos ficheros:</P>
<P>
<OL>
<LI> <CODE>hosts.nntp</CODE> : Son los nodos que pueden conectarse a
nosotros para entregarnos news. Lo normal es poner aqu&iacute; las l&iacute;neas: 

<HR>
<PRE>
localhost:
dragon.micasa.es:
</PRE>
<HR>

</LI>
<LI> <CODE>expire.ctl</CODE> : Fichero para expiraci&oacute;n autom&aacute;tica de
art&iacute;culos. Permite borrar los art&iacute;culos m&aacute;s antiguos. No me voy a extender
aqu&iacute; en c&oacute;mo se maneja, pues creo que entre el manual expire.ctl(5) y el
propio ejemplo que viene ya es suficiente :-) (y no es imprescindible para
que recib&aacute;is los mensajes). 
</LI>
<LI> <CODE>inn.conf</CODE>: Aqu&iacute; se pone el nombre de vuestro sistema (el de
vuestro punto, por ejemplo) y el de vuestro "servidor" de news. En
principio, el nombre que asign&eacute;is a la entrada <CODE>Organization:</CODE> ser&aacute;
el que se utilice como l&iacute;nea <I>Origin</I> en Fidonet. 
</LI>
<LI> <CODE>nnrp.access</CODE>: Este fichero debe dar autorizaci&oacute;n total de
lectura y escritura de art&iacute;culos, al menos a vuestra m&aacute;quina. L&oacute;gico,
¿no?. Valdr&aacute;n unas l&iacute;neas como: 

<HR>
<PRE>

localhost:Read Post:::*
dragon.micasa.es:Read Post:::*
</PRE>
<HR>

</LI>
<LI> <CODE>newsfeeds</CODE>: Este es el fichero m&aacute;s importante. Es con el
que se decide qu&eacute; grupos se exportan, y a qu&eacute; nodo. Es el que permite, que
pod&aacute;is tener grupos locales, grupos de news en USENET (que se exportar&aacute;n
al servidor de news de vuestro proveedor, mediante SUCK) y &aacute;reas de Fido
(que se exportar&aacute;n a vuestro nodo). Os voy a dejar un fichero de ejemplo
que aglutina estas tres posibilidades. En &eacute;l se supone que el proveedor
tiene un servidor de news llamado <CODE>news.proveedor.es</CODE> y que vuestro
Boss es 2:341/12 de nuevo. 

<HR>
<PRE>

##  $Revision: 1.12 $
##  newsfeeds - determine where Usenet articles get sent
##  Format:
##      site[/exclude,exclude...]\
##              :pattern,pattern...[/distrib,distrib...]\
##              :flag,flag...\
##              :param

# Linea obligatoria

ME:*:::

# for NOV overview database, edit to put correct path to overchan
#OVERVIEW!:*:Tc,WO:/news/bin/overchan
OVERVIEW!:*:Tc,WO:/usr/lib/news/bin/overchan

# Grupos de Fidonet: Ninguno, excepto fido.*

f12.n341/f12.n341\
        :!*,fido.*\
        :Tf,Wfb\
        :

# Grupos de Internet: Todos excepto locales (de micasa) y fido.

news.proveedor.es/news.proveedor.es\
        :*,!fido.*,!micasa.*\
        :Tf,Wfm\
        :
</PRE>
<HR>

</LI>
</OL>
</P>
<P>Bien, con esto creo que podemos poner en marcha el servidor de news.
Seguid las instrucciones (en el INN de RedHat es tan simple como ejecutar
<CODE>/etc/rc.d/init.d/inn start</CODE>. No es necesario rearrancar el
equipo). </P>
<P>Una vez hecho esto, escribid con un lector de News en alg&uacute;n grupo
existente. Si escrib&iacute;s a un grupo de Fido deber&aacute; generarse un fichero
<CODE>f12.n341</CODE> (o con otro nombre, seg&uacute;n sea vuestro Boss) en el
directorio <CODE>/var/spool/news/out.going</CODE>. Dicho fichero contiene
referencias al mensaje que acab&aacute;is de escribir. Si lo hac&eacute;is a un grupo de
USENET, aparecer&aacute; un fichero <CODE>news.proveedor.es</CODE>, y si lo hac&eacute;is a
un grupo local, no aparecer&aacute; ninguno. Todo esto depende del contenido del
fichero <CODE>/etc/newsfeeds</CODE>. </P>
<P>Vigilad los logs en estas operaciones, para identificar y corregir
cualquier problema. </P>
<P>En los directorios de documentaci&oacute;n de ifmail hay un script muy bueno para
empaquetar los mensajes para Fido y prepararlos para su env&iacute;o. Dicho
script se llama <CODE>send-ifmail</CODE> y deb&eacute;is instalarlo en
<CODE>/etc/news</CODE>. </P>


<H2><A NAME="ss4.4">4.4 Intentemos empaquetar y desempaquetar los mensajes </A></H2>


<P>Para probar el empaquetado, hay que ejecutar el programa
<CODE>send-ifmail</CODE> desde el usuario fnet. Os recomiendo que hag&aacute;is que
el usuario de ifmail (fnet) pertenezca tambi&eacute;n al grupo news, y as&iacute; os
ahorrar&eacute;is algunos problemas con los permisos. </P>
<P>La ejecuci&oacute;n <CODE>send-ifmail</CODE> debe producir un fichero de nombre
parecido a <CODE>0155000c.tmp</CODE> en un directorio similar a
<CODE>/var/spool/ifmail/fidonet/0155000c.opk/</CODE>. Si no aparece, es casi
seguro que se debe a problemas con los permisos. </P>
<P>Al ejecutar a continuaci&oacute;n <CODE>ifpack</CODE> se producir&aacute; el fichero
definitivo, comprimido, de nombre <CODE>0155000c.XY0</CODE> siendo XY las
iniciales del d&iacute;a de la semana en Ingl&eacute;s. Este fichero quedar&aacute; en el
directorio <CODE>/var/spool/ifmail/fidonet/</CODE>. </P>
<P>Finalmente, cuando se llame a <CODE>ifcico</CODE> (v&iacute;a <CODE>ifpoll</CODE>) el
paquete comprimido se enviar&aacute; al Boss. </P>
<P>Lo mejor es incluir la llamada a <CODE>send-ifmail</CODE> en una tarea de
<I>cron</I> o bien en el propio script <CODE>ifpoll</CODE> justo antes de la
llamada a <CODE>ifpack</CODE>. </P>
<P>Cuando tengamos un fichero empaquetado de prueba, podemos probar a
ejecutar <CODE>ifunpack</CODE> con el fin de comprobar que los mensajes que
hemos exportado en pruebas se entregan al sistema de News. En este caso
solo puede pasar tres cosas (a la vista de los logs): </P>
<P>
<OL>
<LI> Que salgan errores m&aacute;s o menos graves. Puede deberse a una
configuraci&oacute;n incorrecta. 
</LI>
<LI> Que se entreguen al grupo <I>junk</I> de news. Eso significa que
INN no reconoce los grupos, y se debe a que hay alg&uacute;n problema con la
definici&oacute;n de los grupos activos, o los nombres que figuran en el fichero
de &aacute;reas. Tambi&eacute;n, con un paquete procedente del Boss, puede deberse a
alg&uacute;n mensaje que proceda de un &aacute;rea que no est&aacute; activa en las News,
porque sea nueva o nos hayamos suscrito pero no hayamos actualizado la
configuraci&oacute;n de las News. 
</LI>
<LI> Que aparezca en los logs que han sido rechazados por INN. Esto es
lo normal: INN controla si un mensaje ha pasado por &eacute;l ya y en este caso
es normal que lo rechace, puesto que es un mensaje que t&uacute; mismo escribiste
en el mismo servidor. 
</LI>
</OL>
</P>


<H2><A NAME="ss4.5">4.5 Y probemos a llamar al Boss </A></H2>


<P>Si hab&eacute;is completado los pasos anteriores, empaquetando y desempaquetando
correo de prueba, dirigid mensajes a las &aacute;reas locales de tu BBS y alg&uacute;n
NET. La llamada a <CODE>ifpoll</CODE> deber&aacute;: </P>
<P>
<OL>
<LI> Empaquetar todo el ECHO pendiente y el NETmail.</LI>
<LI> Llamar al Boss</LI>
<LI> Enviar los ficheros</LI>
<LI> Recibir los ficheros del Boss</LI>
<LI> Desempaquetar, entregando los NETs como E-mail y los ECHO al
sistema de News</LI>
</OL>
</P>
<P>Si alg&uacute;n paso falla, revisad los logs. En particular, ifmail a veces es
algo silencioso con problemas de permisos: si no puede acceder a un
paquete con correo pendiente, simplemente pasa de &eacute;l y no lo env&iacute;a, pero
no genera ning&uacute;n error. </P>
<P>Aqu&iacute; ya no s&eacute; qu&eacute; m&aacute;s decir. Si funciona, enhorabuena. Si no va, creo que
los logs deber&iacute;an daros suficiente informaci&oacute;n como para solucionarlo. S&eacute;
que es complicado (¡a m&iacute; me lo v&aacute;is a decir!) y que hay muchos archivos de
log para vigilar, pero poco m&aacute;s podemos hacer que trabajar cada uno por su
cuenta... </P>


<H2><A NAME="ss4.6">4.6 C&oacute;mo a&ntilde;adir &aacute;reas nuevas </A></H2>


<P>Recordar&eacute;is que con FastEcho (bajo DOS) se pod&iacute;a tener creaci&oacute;n autom&aacute;tica
de &aacute;reas cuando llegaba alg&uacute;n mensaje para &aacute;reas no definidas. Aqu&iacute; aun no
lo he conseguido, con lo que el proceso de suscripci&oacute;n al &aacute;rea conllevar&aacute;
algunas operaciones manuales: </P>
<P>
<UL>
<LI> A&ntilde;adir el &aacute;rea al fichero /etc/ifmail/Areas, con la notaci&oacute;n
indicada antes.</LI>
<LI> A&ntilde;adir el grupo de news al fichero /var/lib/news/active como se
ha indicado antes.</LI>
<LI> A&ntilde;adir el grupo de news al fichero /var/lib/news/newsgroups
como se ha indicado antes.</LI>
</UL>
</P>
<P>Si el &aacute;rea es de USENET, en lugar de a&ntilde;adirla al fichero Areas de ifmail,
hay que a&ntilde;adirla, por ejemplo, al de configuraci&oacute;n de SUCK. </P>


<H2><A NAME="ss4.7">4.7 Un lector de noticias para Fido </A></H2>


<P>Ya os dije antes que para leer las &aacute;reas de ECHO val&iacute;a cualquier
lector de noticias. Entonces, ¿para qu&eacute; seguir insistiendo? Bien, quien
lleve tiempo leyendo &aacute;reas de Fido con un lector tipo GoldED sabr&aacute; que
todos estos editores son m&aacute;s c&oacute;modos y adecuados para esta red... </P>
<P>En Unix aun nadie hab&iacute;a hecho un lector especializado para Fido y
suficientemente parecido al GoldED. Dejando a un lado el editor de FEddi
(<CODE>fmbedit</CODE>) que usa base de mensajes propia en lugar de sistema de
noticias USENET est&aacute;ndar, lo &uacute;nico parecido para Fidonet que tenemos como
lector de noticias es el <CODE>tin-1.3-unoff</CODE>. </P>
<P>Yo aun no lo he logrado poner en marcha, pero promete bastante: 
reconoce las cabeceras <CODE>X-Comment-To</CODE> usadas para indicar el
destinatario del mensaje p&uacute;blico (algo que en Fido es usual pero no en
USENET), teniendo adem&aacute;s estilos de <I>quoting</I> similares a los
usados por GoldED en lugar del usado en Usenet. </P>
<P>Aun le faltan cosas para parecerse al GoldED (por ejemplo, los
colorines o el tratamiento de los <I>Flags</I> de los mensajes) pero no
deja de ser recomendable. </P>


<HR>
<A HREF="Ifmail-Como-3.html">Anterior</A>
<A HREF="Ifmail-Como-5.html">Siguiente</A>
<A HREF="Ifmail-Como.html#toc4">Indice</A>
</BODY>
</HTML>
