<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="es">
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <TITLE>LinuxFocus Noviembre 1997 -- Instal&eacute; Linux, Y Ahora que? </TITLE>
 <META name="Author" CONTENT="Miguel Angel Sepulveda">
 <META name="Keywords" CONTENT="linux magazine opengl povray photoshop gimp">
 <META name="Description" CONTENT="Free online magazine on Linux for users and developers">
 <META name="Copyright" CONTENT="&copy; 1998 LinuxFocus">
 <META name="Translator" CONTENT="">
 <META name="Date" CONTENT="1998-02-91T00:00:00Z">


</HEAD>

<BODY bgcolor="#FFFFFF"  text="#000000" link="#ff0033" vlink="#FF3333">

  <MAP name="navegator">
  <AREA shape="rect" coords="0, 0, 65, 28" alt="Hogar" href="../">
  <AREA shape="rect" coords="66, 0, 124, 28" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="125, 0, 193, 28" alt="Busqueda" href="../search.html">
  <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
  <AREA shape="rect" coords="261, 0, 350, 28" alt="Sobre Nosotros" href="../aboutus.html">
  </MAP>



 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0">

 <THEAD>
   <TR align="center">
      <TD colspan="2"><IMG src="../../common/images/border-short.jpg" width="407" height="88"></TD>
   </TR>

   <TR align="center">
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/November1997/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28"></TD>
   </TR>

   <TR align="center">
     <TD colspan="2">     
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5">
		<TR bgcolor="#000000">
		   <TD align="center">
               <A href="../News/index.html"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Noticias</B></FONT></A>
               <A href="../Archives/index.html"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Archivos</B></FONT></A>
               <A href="../Companies/index.html"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Compa&ntilde;ias</B></FONT></A>
               <A href="../Tips/index.html"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Consejos y Trucos &nbsp;</B></FONT></A> 
               </TD>
            </TR>
            
		<TR>
            <!--   Here goes the Title of the article, authors name and abstract -->
		   <TD align="center">
 			<FONT face="Helvetica,Arial" color="#660066"><H1>Instal&eacute; Linux, Y Ahora qu&eacute;?</H1></FONT>
 			<FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:jmlm@ctv.es"><FONT color="#000000">Jose Maria Laveda</FONT></A></H3></FONT>
                  <HR size="2" noshade>
	         </TD>
            </TR>

           </TABLE>

     </TD>
   </TR>

 </THEAD>



 <TBODY>
  
 <TR>
    <TD colspan="2">


      <table cellspacing=0 cellpadding=0 border=0>

	<tr>

	<td width="15%" valign=top align=left>	  

	  <p>

	  <a href="#intro">Introducci&oacute;n</a><br>

	  <a href="#distribucion">Distribuci&oacute;n</a><br>

	  <a href="#ayuda">Ayuda</a><br>  

	  <a href="#entorno">Entorno</a><br> 

	  <a href="#redes">Redes</a><br> 

	</td>


	<td  valign=top align=left>



<BLOCKQUOTE><CITE>Nunca digas &quot;No se hacerlo&quot; <BR>

		  mejor di: &quot;Nunca lo he intentado&quot;<BR>

		  -Proverbio japon&eacute;s-.<BR>

</CITE></BLOCKQUOTE>



     <a name="intro">

     <h4><font color="#af1868">Introducci&oacute;n</font></h4>

     </a>



Este art&iacute;culo solo trata de introducirte en los principales

aspectos con los que te vas a enfrentar a la hora de utilizar

este sistema operativo. No va a ser un tratado t&eacute;cnico de los mismos <!--ellos--> ni 

mucho menos una &quot;biblia&quot; de LINUX. S&oacute;lo se trata de mostrarte algunos

 conceptos b&aacute;sicos, t&eacute;rminos que vas a oir por activa y pasiva a

partir de ahora y que puede que tengas que utilizar t&uacute; mismo para

hacerte entender en alguna ocasi&oacute;n, afirmaciones supuestamente

fundadas, no exentas de mala intenci&oacute;n y, porque no decirlo, que lo

&uacute;nico que hacen es despistar.   



<P>Aprovecho para darte la bienvenida, considerate abrazado ;).



<P>El punto de partida es que has conseguido instalar LINUX por tu

cuenta o gracias a algun amiguete que se ha llegado esta tarde a tu

casa con un CD en el bolsillo, ha acaparado tu maquina y cuando ha

terminado de pasar sobre varias pantallas de colores (generalmente

azules) y sin mediar palabra contigo ha acabado pidi&eacute;ndote que le

dijeras un par de claves para el sistema. Tras todo esto ha arrancado

la m&aacute;quina y has visto aparecer un mensaje algo parecido a:



<p><samp>

Welcome to Linux xx.xx.xx<br>

maquina login: <blink>_</blink><br>

</samp><br>



Tras lo cual te ha dicho que ya lo tienes instalado, te ha ense&ntilde;ado un

par de comandos y c&oacute;mo se apaga el sistema dej&aacute;ndote &quot;s&oacute;lo ante el

peligro&quot;.



<P>Quiz&aacute; lo primero que te llam&oacute; la atenci&oacute;n sobre LINUX fu&eacute; el oir

que era &quot;gratis&quot;. Pues aqu&iacute; empiezan las buenas noticias, es cierto.

Bueno, la verdad es que LINUX est&aacute; amparado por una licencia que

permite copiarlo, distribuirlo y utilizarlo sin coste alguno aunque

tiene otros aspectos mucho m&aacute;s profundos que de momento no nos

interesan. Esta licencia se llama &quot;GNU General Public License&quot; y

abarca a &quot;mogoll&oacute;n&quot; de software con el que te vas a encontrar a partir

de ahora. De echo utilizar&aacute;s el GNU bash, GNU emacs, GNU .... Existen

otras licencias parecidas como son la del MIT (Massachussets Institute

of Technology) y BSD (de la Universidad de Berkley) que permiten

b&aacute;sicamente lo mismo, disfrutar sin coste alguno (aunque como ya

he dicho tienen implicaciones muy serias en cuanto al uso que puedes

hacer del software que est&aacute;s utilizando).



<P>Pero &iexcl;ojo!, aqu&iacute; es donde empiezan tambi&eacute;n los malentendidos.

Oir&aacute;s aquello de &quot;ES QUE UN SISTEMA OPERATIVO SIN SOPORTE...&quot;, a lo

que puedes contestar tranquilamente que hay empresas que dan soporte

a cualquier problema t&eacute;cnico que puede surgir con LINUX adem&aacute;s de

toneladas de formas de obtener ayuda ante cualquier problema.



<P>Tambi&eacute;n oir&aacute;s que est&aacute; bien para estudiantes, en la universidad,

gente sin muchos recursos, &quot;gur&uacute;s&quot;, fan&aacute;ticos de la inform&aacute;tica, y

otras &quot;tribus&quot; afines. T&uacute; piensa en la NASA, empresas privadas,

algunas administraciones, proveedores de internet, laboratorios,

millones de usuarios, editoriales, hospitales, etc... y dime si alguno

de estos ejemplos se ajusta a lo que oyes.



     <a name="distribucion">

     <h4><font color="#af1868">Que distribucion tienes?</font></h4>

     </a>





<P>Una distribuci&oacute;n no es mas que una forma de hacerte llegar LINUX de

forma que puedas instalarlo f&aacute;cilmente. Cada una tiene su propia forma

de &quot;empaquetar&quot; y distribuir el software que acompa&ntilde;a a LINUX junto

con utilidades para la instalaci&oacute;n y configuraci&oacute;n del sistema. La

mayor&iacute;a de ellas est&aacute;n disponibles en Internet y en CD-ROM. Depende de

t&iacute; o de la persona que te aconseje el escoger una (o en nuestro caso

pr&aacute;ctico ya la tienes instalada). Para que te hagas una idea existe

Slackware, Red Hat, Debian, Caldera, ... algunas pertenecientes a

empresas privadas (la distribuci&oacute;n, no LINUX!!) y otras mantenidas

por grupos de gente.



<P> No voy a recomendarte ninguna ni a entrar en cual es mejor o peor,

con el tiempo y en cuanto empieces a moverte por este mundillo oir&aacute;s

suficientes juicios a favor y en contra de unas y de otras para tener

argumentos de valor sobre cual te conviene. Personalmente pienso que

mientras sea para potenciar LINUX toda discusi&oacute;nes buena. Conviene

que no confundas la versi&oacute;n del sistema operativo que estas utilizando

(compuesta por tres d&iacute;gitos separados por un punto) con la de la

distribuci&oacute;n, aunque generalmente se te puede entender perfectamente

si dices Debian 1.2.xx, Red Hat 4.x, Slackware 3.0, etc...



     <a name="ayuda">

     <h4><font color="#af1868">Ayuda!!!</font></h4>

     </a>



<P>Bien, ya te has quedado &quot;atascado&quot; en alg&uacute;n sitio o no sabes como

resolver cierto problema, ha llegado la hora de la verdad y quieres

una soluci&oacute;n ya!!.



<UL>	

<LI>Documentaci&oacute;n, Documentaci&oacute;n y Documentaci&oacute;n. Junto con tu

distribuci&oacute;n se te han instalado varios kilobytes destinados a

sacarte de apuros, algunos ejemplos:

<BR>

	<UL>

	<LI> P&aacute;ginas del manual.<br>Si tecleas <kbd>man</kbd> seguido del concepto

que buscas generalmente obtendr&aacute;s una p&aacute;gina con el manual que

buscabas. Si no es as&iacute; prueba con <kbd>apropos</kbd> o <kbd>whatis</kbd> seguido de tu

duda, aqu&iacute; ver&aacute;s una lista de p&aacute;ginas del manual donde aparece el

concepto que buscas. 



	<LI> Documentaci&oacute;n propia de los programas.<br> Todos traen multitud de ficheros <code>README</code>, <code>INSTALL</code>, y manuales en distintos formatos de fichero de texto. Generalmente est&aacute;n ubicados en directorios como <code>/usr/doc</code> y otros similares, el comando <kbd>find</kbd> te puede ayudar a resolverlo. Algunas distribuciones han optado ya por el HTML para estas tareas (aunque ahora que lo pienso si no has configurado el entorno gr&aacute;fico no podr&aacute;s verlo ;) ).



	<LI> Manuales de las distribuciones.<br>Algunas distribuciones traen un manual de instalaci&oacute;n y configuraci&oacute;n orientado a su distribuci&oacute;n pero que trae otros contenidos que son de aspectos generales.



	<LI> Ficheros <code>HOWTO</code> y <code>FAQ</code>.<br>Probablemente la &uacute;nica respuesta que obtengas ante una duda ser&aacute; &quot;echale un vistazo al ZZZZ-HOWTO&quot;. Son ficheros que explican detalladamente temas de inter&eacute;s general. Ejemplos pueden ser <code>Kernel-HOWTO</code>, <code>PPP-HOWTO</code>, <code>ISP-HOWTO</code> .... 

	</UL>

<LI> Libros que cubren todo lo que siempre quisiste saber sobre UNIX existen de sobra y te pueden servir para tus problemas. Para LINUX tambien existen.



<LI> Existen libros disponibles en 'la red' que puedes obtener al mismo precio que LINUX (o sea, &quot;por el ala&quot;) ya que est&aacute;n amparados por la misma licencia, GPL. El proyecto se llama &quot;Linux Documentation Project&quot; y su p&aacute;gina principal est&aacute; en:

</UL>

<P><CENTER><A HREF="http://sunsite.unc.edu/mdw/linux.html">http://sunsite.unc.edu/mdw/linux.html</A></CENTER>

<UL>

<LI><I>&quot;Linux Gazzette&quot;</I> es un magazine en formato html en el que puedes encontrar art&iacute;culos muy interesantes sobre LINUX y no hablo m&aacute;s porque son la competencia :), bueno, pondr&eacute; la direcci&oacute;n por si quieres echar un vistazo:

</UL>

<P><CENTER><A HREF="http://www.ssc.com/lg">http://www.ssc.com/lg</A></CENTER>

<UL>

<LI><B><I>&quot;Linux Focus&quot;</I></B> .... (sin comentarios).



<LI><I>&quot;Linux Journal&quot;</I> tiene el honor de ser la primera publicaci&oacute;n dedicada exclusivamente a LINUX, es mensual y puedes saber m&aacute;s en:

</UL>

<P><CENTER><A HREF="http://www.ssc.com">http://www.ssc.com</A></CENTER>

<UL>

<LI><I>&quot;Linux World&quot;</I> es &quot;lo mismo&quot; pero en este caso es una publicaci&oacute;n brit&aacute;nica:

</UL>

<P><CENTER><A HREF="http://www.eurodream.co.uk">http://www.eurodream.co.uk</A></CENTER>



<UL>

<LI>Listas de correo (todas en ingl&eacute;s) dedicadas a muchas facetas de LINUX puedes encontrarlas escribiendo un <kbd>help</kbd> a <a href="mailto:majordomo@vger.rutgers.edu">majordomo@vger.rutgers.edu</a>, recibiras una peque&ntilde;a relaci&oacute;n de listas.

<LI>Existen multitud de foros dedicados a LINUX en las &quot;news&quot; cuyos nombres son bastante esclarecedores, simplemente te dir&eacute; que eches un vistazo a la jerarqu&iacute;a <I>comp.os.linux.*</I>

<LI>El IRC es otro de los sitios en los que puedes conocer gente, por ejemplo puedes probar en <FONT COLOR=#006400>  irc.linpeople.org <FONT COLOR=#000000>donde seguro que existen canales para linux (el nombre te lo dir&aacute;). En castellano existe, por ejemplo, un canal muy activo en <FONT COLOR=#006400> irc.arrakis.es. <FONT COLOR=#000000>

<LI><B>Todo en castellano</B>: Aqu&iacute; te muestro enlaces a iniciativas en castellano sobre LINUX, en ellos podr&aacute;s encontrar ayuda en el idima de Quevedo sobre lo que necesites, EL IDIOMA YA NO PUEDE SER PROBLEMA PARA TI. Asismismo en estos lugares se te muestra informaci&oacute;n sobre listas de correo en las que puedes incluirte si quieres conocer gente, aprender, ayudar a gente m&aacute;s perdida que t&uacute; (&iquest;crees que no los hay?).

</UL>

<P><CENTER><A HREF="http://slug.ctv.es">http://slug.ctv.es</A></CENTER>

<P><CENTER><A HREF="http://www.infor.lucas.es/lucas">http://www.infor.lucas.es/lucas</A></CENTER>

<P><CENTER><A HREF="http://www.insflug.nova.es">http://www.insflug.nova.es</A></CENTER>

<UL>

<LI>Si lo tuyo es la red FIDONET existe un &aacute;rea dedicada a LINUX, R34.LINUX que no tiene nada que envidiarle a sus &quot;hermanas mayores&quot;.

</UL>



     <a name="entorno">

     <h4><font color="#af1868">Entorno</font></h4>

     </a>

<P>Otra buena noticia: Con LINUX tambi&eacute;n podr&aacute;s utilizar tu rat&oacute;n en un entorno lleno de ventanas, iconos y botones. Se acab&oacute; aquello de que UNIX &quot;es feo&quot; y que los entornos de usuario agradables WYSIWYG (&iquest;es as&iacute;?) son exclusivos de otros sistemas operativos. No voy a entretenerte con el tema de las licencias otra vez, util&iacute;zalo y si tienes mucha curiosidad en alguna parte tendras un fichero <code>COPYRIGHT</code> en el que tendr&aacute;s los detalles. 

<P>El entorno X Window (XFree en la implementaci&oacute;n que vas a utilizar con LINUX &oacute; &quot;X11&quot; coloquialmente) te permitir&aacute; todas estas cosas, &iquest;te imaginas el Wordperfect corriendo en tu pantalla?, pues ya es realidad, aunque en este caso hay que rascarse un poco el bolsillo. Pero existen toneladas de Kilobytes dedicados a aplicaciones para utilizar en este maravilloso entorno (tanto de dominio p&uacute;blico como no) que puedes disfrutar. 

<P>Si lo tienes ya configurado no hay problema, si no tienes esa suerte no te alarmes aunque veas a veces el mensaje que avisa sobre los peligros de configurar mal el entorno gr&aacute;fico (aunque realmente si que puedes dejar tu monitor para hacer palomitas en &eacute;l si no tienes cuidado, pero eso es cada vez m&aacute;s dif&iacute;cil).

<P>Con la ayuda de la documentaci&oacute;n adecuada y alguna manita que otra podr&aacute;s f&aacute;cilmente configurar el entorno. Las &uacute;ltimas versiones traen relaciones completas de hardware de las que no tienes m&aacute;s que elegir el tuyo. 

<P>Tienes que tener en cuenta que lo que realmente vas a configurar es el Servidor, por lo que empezar&aacute;s a oir que si CLIENTE/SERVIDOR, gestor de ventanas,... Brevemente te dir&eacute; que X Window est&aacute; desarrollado con la filosof&iacute;a de Cliente/Servidor (perd&oacute;n por repetirme) con lo que b&aacute;sicamente tienes un software que se dedica a gestionar el hardware de tu m&aacute;quina y a recibir peticiones (mensajes) por parte de los clientes (vamos... los programas que vas a utilizar) para dibujar pantallas, botones, barras de desplazamiento, men&uacute;s, etc...

<P>En la explicaci&oacute;n anterior me he permitido bastantes

simplificaciones del tema, todo esto se puede complicar todo lo que

quieras si est&aacute;s trabajando en un entorno de red, intentas configurar

los programas (clientes) que vas  a utilizar a base de recursos o

ficheros de configuraci&oacute;n propios o quieres utilizar otro gestor de

ventanas distinto del que tienes por defecto, el l&iacute;mite lo pones t&uacute;.



 <a name="redes">

     <h4><font color="#af1868">Redes & Internet</font></h4>

     </a>

<P>LINUX est&aacute; concebido para que las m&aacute;quinas est&eacute;n comunicadas, las posibilidades del sistema operativo para todo lo relacionado con las redes no caben en este art&iacute;culo, para eso har&iacute;an falta varios n&uacute;meros de esta revista o m&aacute;s.

<P>Normalmente tendr&aacute;s un acceso a Internet a trav&eacute;s de un proveedor (ISP a partir de ahora) que te asigna una direcci&oacute;n IP din&aacute;mica cuando te conectas al mismo. Con un m&oacute;dem &quot;compatible Hayes&quot; y tu LINUX ya lo tienes todo. Utilizando el programa <I>chat</I> para enviarle los comandos AT necesarios y el protocolo <I>PPP</I> tienes la puerta abierta (recuerda que este protocolo tiene dos partes:una en el kernel y otra fuera, lo digo porque no te vuelvas medio paranoico configurando ficheros relacionados con el software y no hayas compilado correctamente el n&uacute;cleo, no ser&iacute;as el primero ;) )..

<P>Aparte de los puntos que te he mencionado en donde encontrar informaci&oacute;n empieza a ser normal que los propios ISP tengan informaci&oacute;n disponible para los usuarios de LINUX (&iexcl;y si no la exiges!).

<P>Para estas lides tienes a tu disposici&oacute;n programas de correo, lectores de news, navegadores (Netscape, Mosaic, Arena, Lynx....), y todos los comandos propios de Un*x: ftp, telnet, ping...

<P>En este caso tambi&eacute;n depende de t&iacute; el buscar el software con el que te encuentres m&aacute;s c&oacute;modo. 

<P> Con esto doy por terminada esta mini-introducci&oacute;n a ese sistema operativo del que tanto has oido hablar y que ya tienes en tu m&aacute;quina. Mi &uacute;nica intenci&oacute;n ha sido el quitar ese miedo inicial que tenemos a todo lo nuevo. LINUX ES F&Aacute;CIL, solo requiere un poco de paciencia y mucha ilusi&oacute;n. Con un poco de esfuerzo podremos tener todo nuestro trabajo resuelto con un software de dominio p&uacute;blico.

 



<I>

<small><P>Nota del Autor: El avispado lector comprender&aacute; que es muy dif&iacute;cil

el intentar condensar todos los recursos sobre informaci&oacute;n para LINUX

en un s&oacute;lo art&iacute;culo por lo que pido disculpas de antemano si no he

mencionado alguna lista, p&aacute;gina, canal, libro... o iniciativa

destinada a tal fin. Las simplificaciones que me he permitido hacer

han sido con un fin totalmente did&aacute;ctico. GRACIAS

POR VUESTRA COMPRENSI&Oacute;N ;) </I></small>


<HR size=2 noshade>
</td>
</table>




    </TD>
 </TR>

 </TBODY>

<TBODY>
  <TR>
    <TD colspan="2">
    <B>Para m&aacute;s informaci&oacute;n</B>:<BR>
    <UL>
      <LI>Lea <A href="article5.html">Some Tips</A>. </LI>
      <LI>Consulte Tips-HOWTO.</LI> 
     <UL><BR><BR>
    <TD>
  </TR>
</TBODY>

 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 Jose Maria Laveda</B></FONT><BR>
    <FONT color="#ffffff">Esta p&aacute;gina est&aacute; mantenida por 
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>



</TABLE>


</BODY>
</HTML>






