<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="es">
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <TITLE>LF vol. 2, Los Secretos del Kernel</TITLE>
 <META name="Author" CONTENT="Miguel Angel Sepulveda">
 <META name="Keywords" CONTENT="linux kernel operating systems hacker">
 <META name="Description" CONTENT="Article on the Linux Kernel">
 <META name="Copyright" CONTENT="&copy; 1998 LinuxFocus">
 <META name="Translator" CONTENT="">
 <META name="Date" CONTENT="1998-02-03T00:00:00Z">


</HEAD>

<BODY bgcolor="#FFFFFF"  text="#000000" link="#ff0033" vlink="#FF3333">

    <MAP name="navegator">  
      <AREA shape="rect" coords="0, 0, 65, 28" alt="Ir al Hogar" href="../">
      <AREA shape="rect" coords="66, 0, 124, 28" alt="Ver &Iacute;ndice" href="../indice.html">
      <AREA shape="rect" coords="125, 0, 193, 28" alt="Buscar" href="../search.html">
      <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
      <AREA shape="rect" coords="261, 0, 350, 28" alt="Acerda de nosotros" href="../aboutus.html">
    </MAP>
    


 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0">

 <THEAD>
   <TR align="center">
      <TD colspan="2"><IMG src="../../common/January1998/border-short.jpg" alt="[LinuxFocus Image]" width="407" height="88"></TD>
   </TR>

   <TR align="center">
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/January1998/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28" alt="[Navegation Bar]"></TD>
   </TR>

   <TR align="center">
     <TD colspan="2">     
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5">
		<TR bgcolor="#000000">
		   <TD align="center">
		  <A href="../News/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Noticias</B></FONT></A>
		  <A href="../Archives/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Archivos</B></FONT></A>
		  <A href="../Companies/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Compa&ntilde;&iacute;as</B></FONT></A>
		  <A href="../Tips/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Consejos&nbsp;</B></FONT></A> 
               </TD>
            </TR>
            
		<TR>
            <!--   Here goes the Title of the article, authors name and abstract -->
		   <TD align="center">
 			<FONT face="Helvetica,Arial" color="#660066"><H1>Los Secretos del Kernel</H1></FONT>
 			<FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:elesende@nextwork.net"><FONT color="#000000">Emiliano Ariel Lesende</FONT></A></H3></FONT>
                  <HR size="2" noshade>
	         </TD>
            </TR>

           </TABLE>

     </TD>
   </TR>

 </THEAD>



 <TBODY>
  
 <TR>
    <TD valign="top" align="center">
           <H4><A href="#presentation">Presentaci&oacute;n</A></H4>
           <H4><A href="#presentation">Linux: El Sistema <br>Operativo de la Internet</A></H4>
           <H4><A href="#main">Caracter&iacute;sticas Principales</A></H4>
           <H4><A href="#compiling">Compilando el Kernel</A></H4>

    </TD>
   
    <TD align="center">
       <TABLE border="0" width="80%" cellspacing="0" cellpadding="0">
	  <TR>
          <TD>
	     <A name="presentation"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033"> Presentaci&oacute;n</FONT></H3>


   <P>Bienvenidos a una nueva serie de art&iacute;culos sobre los secretos del
   kernel. Tal vez, m&aacute;s de uno de Uds. Ha echado un ojo sobre los fuentes
   del kernel. El kernel de Linux pas&oacute; de ser un par de archivos
   compactados de 100k a m&aacute;s de 300 archivos en m&aacute;s de 9 Megabytes
   compactados con m&aacute;s de 2 millones de l&iacute;neas de c&oacute;digo.</P>
   
   <P>Estos art&iacute;culos est&aacute;n preparados para programadores y no para usuarios
   inexpertos. Obviamente que todo el mundo es libre de leer este
   art&iacute;culo y que cualquier duda que les quede respecto al mismo pueden
   consultarme v&iacute;a email.</P>
   
   <P>Todos los d&iacute;as se descubren bugs nuevos y todos los d&iacute;as se escriben
   nuevos patchs. Es casi imposible comprender en su totalidad el c&oacute;digo
   fuente del kernel hoy d&iacute;a. Est&aacute; escrito por muchos
   programadores, que aunque trataron de mantener el mismo estilo de
   programaci&oacute;n &eacute;ste mucha veces difiere.</P>
   
 
	     <A name="internet"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">Linux: El Sistema Operativo de la Internet</FONT></H3>


   <P>Linux es un sistema de libre distribuci&oacute;n  para PCs. Es compatible con
   el est&aacute;ndar POSIX 1003.1 e incluye grandes &aacute;reas de funciones de Unix
   System V y BSD 4.3. Muchas partes substanciales del kernel de Linux
   sobre los cuales concierne esta serie de art&iacute;culos fueron escritas por
   Linus Torvalds, un estudiante de ciencia de la computaci&oacute;n en Finlandia.
   La primera versi&oacute;n del kernel de Linux vi&oacute; la luz en Noviembre de
   1991.</P>



		  <A name="main"></A>
		  <H3><FONT face="Helvetica,Arial" color="#660033">Caracter&iacute;sticas Principales</FONT></H3>
		  
		  Linux satisface   casi  todas  las   demandas de  un
		  sistema operativo Unix actual:

    <UL>
    <LI><B>Multitarea</B>
    
 
    
    <P>Linux soporta multitarea verdadera, todos los procesos corren de
       manera independiente unos de otros. Ninguno de ellos necesita ceder el 
       procesador para la ejecuci&oacute;n de otros procesos.</P>
       
  
    <LI><B>Accesibilidad Multiusuario</B>

   <P>Linux no s&oacute;lo es un sistema operativo multiusuario. Sino que posee
      acceso multiusuario. Linux permite tener terminales conectadas al
      sistema utilizando los mismos recursos.</P>
       


    <LI><B>Ejecutables cargados en demanda</B>
       
   <P>Solo aquellas partes del programa que son necesarias para la ejecuci&oacute;n
       del mismo son cargadas en memoria.</P>
       




    <LI><B>Paginaci&oacute;n</B>
    
       
   <P>Puede ocurrir que la memoria est&eacute; totalmente ocupada. Linux entonces
       busca por p&aacute;ginas de memoria de 4k que puedan ser liberadas. Las
       p&aacute;ginas son almacenadas en disco y la memoria es liberada. Si
       alguna de estas p&aacute;ginas es requerida, Linux la toma del disco y la
       pone en su lugar original. A diferencia de lo que com&uacute;nmente se
       llama swapping (o archivo de intercambio para los usuarios de
       Microsoft Windows) s&oacute;lo algunas paginas se guardan en disco. Los
       viejos sistemas Unix o inclusive los flamantes nuevos Windows 95 o
       NT escriben en disco todas las paginas de un proceso, lo cual es
       mucho menos eficiente.</P>
           
    <LI><B>Cache de disco din&aacute;mico</B>
       
   <P>Los usuarios de MSDOS estar&aacute;n familiarizados con SmartDrive
       (SMARTDRV). Este programa reserva una determinada zona de memoria
       fijo para el cache del disco. Linux trabaja el cache del disco de
       una forma mucho m&aacute;s din&aacute;mica. La memoria de reserva para el disco
       se agranda cuando es necesario o se achica cuando hay escasez de
       memoria disponible.</P>
 
        
    <LI><B>Librer&iacute;as compartidas</B>
    
       
   <P>Las librer&iacute;as son un conjunto de rutinas utilizadas por los programas
       para procesar datos. Hay un numero de librer&iacute;as estandares
       utilizadas por m&aacute;s de un proceso a la vez. En los viejos tiempos
       las librer&iacute;as se inclu&iacute;an en el c&oacute;digo ejecutable del programa.
       As&iacute; es que si uno o m&aacute;s programas utilizaban las misma librer&iacute;a
       esta era cargada m&aacute;s de una vez utilizando espacio en memoria
       innecesario. Aqu&iacute; es donde las librer&iacute;as compartidas entran en
       juego. Los ejecutables solo poseen un vinculo con la librer&iacute;a
       compartida. De esta manera si uno o m&aacute;s programas utilizan las
       misma librer&iacute;a &eacute;sta es cargada s&oacute;lo una vez.</P>
       
    
    <LI><B>Soporte para el est&aacute;ndar POSIX 1003.1 y en parte System V y BSD</B>
    
 
       
   <P>POSIX 1003.1 define una interfaces m&iacute;nima para un sistema operativo
       tipo Unix. Esta interface est&aacute; descripta en declaraci&oacute;n de
       funciones C. Este estardard es actualmente soportado por todos los
       recientes y relativamente sofisticados sistemas operativos.
       Microsoft Windows NT posee soporte para POSIX 1003.1.
       Linux 1.2 soporta POSIX en su totalidad. Algunas interfaces
       adicionales fueron y est&aacute;n siendo desarrolladas para
       compatibilidad con System V y BSD.</P>
       

    <LI><B>Diferentes formatos para archivos ejecutables</B>
       
   <P>¿Quien no desea poder correr cualquier aplicaci&oacute;n en Linux? Ya sea de
       DOS, Windows 95, FreeBSD o OS/2. Por esta raz&oacute;n emuladores de DOS
       y Windows95 est&aacute;n en actual desarrollo. Linux puede ejecutar
       binarios de otras plataformas Unix basadas en Intel que conformen
       con el est&aacute;ndar iBCS2,(intel Binary Compatibility standard).</P>

       
     

    <LI><B>Sistemas de archivos diferentes</B>

   <P>Linux soporta una gran variedad de sistemas de archivos. El m&aacute;s usado
       actualmente es el Second Extended File System (Ext2). Otro sistema
       de archivos implementeado de la File Allocation Table (FAT). Las
       restricciones de acceso a este sistema de archivos est&aacute;n dado para
       todo el disco ya que la FAT no est&aacute; preparada para seguridad o
       acceso multiusuario.</P>
       

    
    <LI><B>Redes</B>
       
   <P>Linux puede ser integrado en un sistema de redes Unix local. En
       principio todos los servicios de red son soportado, Network File
       System (NFS) y Remote Login (rlogin). SLIP y PPP ambos son
       soportados.</P>
   
    
    <LI><B>System V IPC</B>
    
		      
       
   <P>Linux usa esta tecnolog&iacute;a para proveer de colas de mensajes, sem&aacute;foros
       y memoria compartida. Estas son variantes cl&aacute;sicas de la
       comunicaci&oacute;n entre-procesos (inter-process communication).</P>
		    </li>
		  </UL>

	     <A name="compiling"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">Compilando el Kernel</FONT></H3>



   <P>Antes de estudiar el coraz&oacute;n del kernel le vamos a pegar un vistazo al
   c&oacute;digo fuente del mismo.</P>


    <P><B><i>Estructura del &aacute;rbol de los fuentes:</B></I>

   
   
   <P>En un sistema Linux, las fuentes se ubican normalmente bajo el
   directorio /usr/src/linux. En el siguiente texto los directorios est&aacute;n
   dados en forma relativa a este. La portacion a otras arquitecturas
   No-Intel resulto en una modificaci&oacute;n comparado con la versi&oacute;n 1.0 del
   kernel. El c&oacute;digo dependiente de la arquitectura est&aacute; bajo arch/.
   Hasta el presente este contiene arch/i386/ para los procesadores 386,
   486 y Pentium de Intel, arch/mips/ para la arquitectura MIPS y
   arch/sparc/ para el SPARC de Sun Microssystems. Como Linux es
   bastante usado sobre PCs, nosotros nos concentraremos en esta
   arquitectura.</P>
   
   <P>El kernel de Linux no es m&aacute;s que un programa C est&aacute;ndar. Hay solamente
   solo dos grandes diferencias. La funci&oacute;n de entrada para los programas
   escritos en C es normalmente main(int argc,char **argv). En Linux
   &eacute;sta es start_kernel(void). El entorno del programa no existe todav&iacute;a
   (hablamos del momento de <i>boot</i> cuando la maquina arranca y esta por
   correr el kernel de Linux). Esto significa que hay que hacer un par de
   maniobras antes de que la primera funci&oacute;n en C sea llamada. Los
   c&oacute;digos en ensamblador que se encargan de esta labor est&aacute;n contenidos
   en el directorio arch/i386/asm/.</P>
   
   <P>La rutina en ensamblador apropiada carga el kernel en la direcci&oacute;n
   absoluta 0x100000 (1 Mbyte). Entonces instala las rutinas de servicio
   de interrupci&oacute;n, las tablas descriptoras globales y las tablas
   descriptoras de interrupciones, que son utilizadas &uacute;nicamente durante
   el proceso de inicializaci&oacute;n. En este punto el procesador se pasa a
   modo protegido. El directorio init/ contiene todo lo necesario para
   inicializar el kernel. Adem&aacute;s de otras funciones aqu&iacute; est&aacute;
   start_kernel(). Su tarea es la de inicializar el kernel de manera
   correcta, tomando en cuenta los par&aacute;metros de boot que se le fueron
   pasados. El primer proceso es creado sin el uso de las llamadas al
   sistema (todav&iacute;a no tenemos al sistema cargado), es decir, a mano.
   Este proceso es el famoso idle, es el que usa el tiempo del procesador
   cuando ninguna tarea lo requiere.</P>
   
   <P>Los directorios kernel/ y arch/i386/kernel/ contienen, como sus
   nombres sugieren, las partes centrales del kernel. Aqu&iacute; es donde las
   principales llamadas al sistema (system calls) son alojadas. Aqu&iacute;
   tambi&eacute;n se encuentran implementadas otras &aacute;reas como ser el manejo del
   tiempo, el planificador (scheduler), la DMA, el controlador de
   interrupciones y el controlador de señales.</P>
   
   <P>El c&oacute;digo que maneja la memoria est&aacute; almacenado en los directorios mm/
   y arch/i386/mm/. Esta parte del c&oacute;digo es la encargada de asignar y
   liberar memoria a los procesos. Aqu&iacute; tambi&eacute;n se aloja todo el c&oacute;digo
   que se encarga de la Paginaci&oacute;n.</P>
   
   <P>El sistema de archivos virtual (virtual file system) est&aacute; en el
   directorio fs/. Los diferentes sistemas de archivos soportas se
   encuentran en subdirectorios a este. Los dos sistemas de archivos m&aacute;s
   importantes y que estudiaremos en detalle m&aacute;s tarde son Ext2 y Proc.</P>
   
   <p>Todos los sistemas operativos requieren de un driver para su
   correspondiente componente de hardware. Estos est&aacute;n alojados en el
   directorio drivers/.</P>
   
   <p>En el directorio ipc/ se encuentran los fuentes de la implementaci&oacute;n
   del IPC del System V.</P>
   
   <P>La implementaci&oacute;n de varios protocolos de red, adem&aacute;s del c&oacute;digo para
   los sockets y los dominios de Internet est&aacute;n almacenados en net/.</P>
   
   <P>Algunas funciones est&aacute;ndar en C est&aacute;n implementadas en lib/, as&iacute; la
   programaci&oacute;n del kernel puede utilizar los h&aacute;bitos de la programaci&oacute;n
   en C.</P>
   
   <P>Los m&oacute;dulos generados cuando el kernel es compilado est&aacute;n contenidos
   en el directorio modules/. Este directorio est&aacute; normalmente vac&iacute;o
   hasta que el kernel es compilado por primera vez.</P>
   
   <P>Probablemente el m&aacute;s importante directorio que utilizan los
   programadores es include/. Aqu&iacute; se alojan todos los headers que son
   espec&iacute;ficos del kernel. El directorio include/asm-386/ contiene los
   headers que son espec&iacute;ficos del kernel y adem&aacute;s de la plataforma
   Intel.</P>
   

<P><B><I>Compilando</B></I>: 


		    <p>En general, un nuevo kernel es generado en tres simples pasos. Primero
   las opciones de compilaci&oacute;n son configuradas mediante:<BR>


   
   <TT>
   # make config
   </TT><BR>

   <P>Luego las dependencias del c&oacute;digo fuente son recalculadas:</P>
   
   <TT>
   # make depend
   </TT><BR>

   <P>Y por &uacute;ltimo la real compilaci&oacute;n del kernel es realizada con:</P>
   
   <TT>
   # make
   </TT><BR>


   <P>M&aacute;s tarde entraremos en el tema sobre el trasfondo de estos scripts y
   su modificaci&oacute;n para nuevas opciones de configuraci&oacute;n.</P>
   

   <P>Espero que hayan disfrutado de este articulo. Si tienen
   sugerencias/ comentarios/ correcciones env&iacute;enmelas v&iacute;a email a
   <A HREF="mailto:elesende@nextwork.net">elesende@nextwork.net</A>.
    Nos vemos la pr&oacute;xima.</P>

          </TD>
        </TR>
	 </TABLE>

     <HR size=2 noshade>
     <P align="left"><I>Traducido por Gonzalo Garcia Agullo</I></P>

    </TD>

 </TR>

 </TBODY>

<TBODY>
  <TR>
    <TD colspan="2">
    <B>Para m&aacute;s informaci&oacute;n</B>:<BR>
    <UL>
      <LI>Consulta el Kernel-HOWTO.</LI> 
     <UL><BR><BR>
    <TD>
  </TR>
</TBODY>

 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 Emiliano Ariel Lesende</B></FONT><BR>
    <FONT color="#ffffff">P&aacute;ginas web mantenidas por 
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>



</TABLE>


</BODY>
</HTML>






