<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="es">
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <TITLE>LF vol. 2, Qu&eacute; es OpenGL?</TITLE>
 <META name="Author" CONTENT="Miguel Angel Sepulveda">
 <META name="Keywords" CONTENT="opengl glut linux games simulation">
 <META name="Description" CONTENT="Free online magazine on Linux for users and developers">
 <META name="Copyright" CONTENT="&copy; 1998 Miguel Angel Sepulveda">
 <META name="Translator" CONTENT="">
 <META name="Date" CONTENT="1998-02-03T00:00:00Z">


</HEAD>

<BODY bgcolor="#FFFFFF" text="#000000" link="#ff0033" vlink="#FF3333">

  <MAP name="navegator">
  <AREA shape="rect" coords="0, 0, 65, 28" alt="Hogar" href="../">
  <AREA shape="rect" coords="66, 0, 124, 28" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="125, 0, 193, 28" alt="Busqueda" href="../search.html">
  <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
  <AREA shape="rect" coords="261, 0, 350, 28" alt="Sobre Nosotros" href="../aboutus.html">
  </MAP>



 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0">

 <THEAD>
   <TR align="center">
      <TD colspan="2"><IMG src="../../common/January1998/border-short.jpg" alt="[LinuxFocus Image]" width="407" height="88"></TD>
   </TR>

   <TR align="center">
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/January1998/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28" alt="[Navegation Bar]"></TD>
   </TR>

   <TR align="center">
     <TD colspan="2">     
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5">
		<TR bgcolor="#000000">
		   <TD align="center">
               <A href="../News/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Noticias</B></FONT></A>
               <A href="../Archives/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Archivos</B></FONT></A>
               <A href="../Companies/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Compa&ntilde;ias</B></FONT></A>
               <A href="../Tips/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; COnsejos y Trucos &nbsp;</B></FONT></A> 
               </TD>
            </TR>
            
		<TR>
            <!--   Here goes the Title of the article, authors name and abstract -->
		   <TD align="center">
 			<FONT face="Helvetica,Arial" color="#660066"><H1>Qu&eacute; es OpenGL?</H1></FONT>
 			<FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#000000">Miguel Angel Sep&uacute;lveda</FONT></A></H3></FONT>
                  <HR size="2" noshade>
	         </TD>
            </TR>

           </TABLE>

     </TD>
   </TR>

 </THEAD>



 <TBODY>
  
 <TR>
    <TD valign="top" align="center">

           <CENTER><A HREF="http://www.opengl.org"><IMG SRC="../../common/January1998/ogl.gif" ALT="[OpenGL logo]" BORDER=0 ></A></CENTER>

           <A HREF="http://www.sgi.com">Silicon Graphics</A><BR>
	   <A HREF="http://www.sgi.com/Technology/openGL/glspec/glspec.html">OpenGL specs</A> <BR>
	   <A HREF="http://www.opengl.org/Info/FAQ/basicsfaq.html">OpenGL FAQ</A> <BR>
           <A HREF="http://www.3dfx.com">3Dfx Interactive</A>


    </TD>
   
    <TD align="center">
       <TABLE border="0" width="80%" cellspacing="0" cellpadding="0">
	  <TR>
          <TD>

		    <P align="right"><I>Este art&iacute;culo comienza una serie 
                monogr&aacute;fica sobre OpenGL y su implementaci&oacute;n en
                Linux. Est&aacute; enfocada para programadores que desean 
                a&ntilde;adir a sus programas gr&aacute;ficos en 2D y 3D de alta eficiencia.</I></P>




<P>OpenGL es sin lugar a dudas la API que prevalece en la industria para desarrollar aplicaciones gr&aacute;ficas 2D y 3D. Se le puede considerar el sucesor a la formidable IRIS GL-library de Silicon Graphics que hizo tan popular las estaciones de trabajo SGI como plataforma predilecta para desarrollo cient&iacute;fico, de ingenier&iacute;a y de efectos especiales. SGI puso en OpenGL una buena parte de su pericia para hacer una API para el futuro f&aacute;cil de usar, intuitiva, portable y perceptiva a las redes. Al mismo tiempo podemos acreditar a SGI por darse cuenta de la importancia de los est&aacute;ndares abiertos. Varios fabricantes de software y hardware tomaron parte en la especificaci&oacute;n de OpenGL y permanecen detr&aacute;s suyo. Gracias a esto podemos decir que las aplicaciones OpenGL pueden ser f&aacute;cilmente portadas a virtualmente cualquier plataforma del mercado, desde PC windows95 a nuestro glorioso sistema Linux, pasando por estaciones UNIX de alto nivel y mainframes. La <A HREF="http://www.opengl.org/ARB/ARB.html">Architectural Review Board (Junta de Revisi&oacute;n de Arquitecturas)</A> gobierna sobre OpenGL, sus especificaciones, acepta o rechaza cambios y propone tests de conformidad.</P>

<P>En contraste con la antigua IRIS GL-library de SGI, OpenGL es por dise&ntilde;o independiente de plataformas y sistemas operativos. Es perceptiva a la red, de manera que es posible separar nuestra aplicaci&oacute;n OpenGL en un servidor y un cliente que verdaderamente produzca los gr&aacute;ficos. Existe un protocolo para mover por la red los comandos OpenGL entre el servidor y el cliente. Gracias a su independencia del sistema operativo, el servidor y el cliente no tiene porque ejecutarse en el mismo tipo de plataforma, muy a menudo el servidor sera un supercomputador ejecutando una compleja simulaci&oacute;n y el cliente una simple estaci&oacute;n de trabajo mayormente dedicada a la visualizaci&oacute;n gr&aacute;fica. OpenGL permite al desarrollador escribir aplicaciones que se puedan desplegar en varias plataformas f&aacute;cilmente.</P>

<p>Por encima de todo, OpenGL es una biblioteca estilizada de trazado de gr&aacute;ficos de alto rendimiento, hay varias tarjetas gr&aacute;ficas aceleradoras y especializadas en 3D que implementan primitivas OpenGL a nivel hardware. Hasta hace poco, estas avanzadas bibliotecas gr&aacute;ficas solian ser muy caras y solo estaban disponibles para estaciones SGI u otras estaciones de trabajo UNIX. Las cosas est&aacute;n cambiando muy deprisa y gracias a las generosas licencias y el kit de desarrollo de controladores de SGI, vamos a ver m&aacute;s y m&aacute;s hardware OpenGL para usuarios de PCs. &iexcl;Si, los usuarios de Linux van a poder aprovechar esta oportunidad! Una compa&ntilde;&iacute;a denominada <I>3Dfx Interactive</I> provee de una serie de tarjetas gr&aacute;ficas 3D y de soporte para SO Linux a trav&eacute;s de su <i>Glide library</i>. Hay otro art&iacute;culo en esta serie de Phillip Ross (<A HREF="article18.html">Tarjetas Gr&aacute;ficas 3Dfx</A>) que describe con detalle las tarjetas de 3Dfx disponibles para nosotros. Esto muestra un cambio de actitud por parte de algunos fabricantes de hardware que se dan cuenta por fin de que el mercado de Linux est&aacute; aqu&iacute; para quedarse. Los fans de Linux deber&iacute;an apoyar y favorecer este tipo de iniciativas.</P>
   
<P>Para conseguir la independencia del hardware de OpenGL, no se incluyeron comandos para tareas de ventanas, ni para obtener entrada del usuario. Esto suena como un serio contratiempo pero como veremos despu&eacute;s (ve&aacute;se  <A HREF="article16.html">serie de Programaci&oacute;n GLUT</A>), tiene un simple arreglo. De hecho, para mantener el estilo y alto rendimiento de OpenGL, no se provee de comandos para describir modelos complejos, tales como mol&eacute;culas, aeroplanos, casas, p&aacute;jaros, etc. En OpenGL solo encontrar&aacute;s primitivas de objetos geom&eacute;tricos: <i>puntos, l&iacute;neas y pol&iacute;gonos</i>. El desarrollador tiene que construir sus propios modelos bas&aacute;ndose en unas pocas y simples primitivas. Hay bibliotecas relacionadas que proveen de modelos m&aacute;s complejos, y cualquier usuario se puede construir las suyas.</P>

<P>En nuestra serie de art&iacute;culos sobre programaci&oacute;n con OpenGL usaremos la interface C para OpenGL porque es la m&aacute;s popular. Sin embargo el lector deber&iacute;a saber que hay otros bindings disponibles: <TT>FORTRAN, C++, Ada y  Java </TT>. M&aacute;s adelante en nuestras series, despues de que el lector se haya familiarizado con la interface C para OpenGL diremos algo sobre Open-inventor, una extensi&oacute;n a la biblioteca C++ para OpenGL.</P>

<p>Sin entrar en demasiados detalles, describiremos algunas de las caracter&iacute;sticas que OpenGL implementa:</P>

    <UL>
    <LI><b>Primitivas geom&eacute;tricas</B> Permiten construir descripciones matem&aacute;ticas de objetos. Las actuales primitivas son: puntos, l&iacute;neas, pol&iacute;gonos, im&aacute;genes y bitmaps.

    <LI><B>Codificaci&oacute;n del Color</B> en modos RGBA  (Rojo-Verde-Azul-Alfa) o de color indexado. 

    <LI><B>Visualizaci&oacute;n y Modelado</B> que permite disponer objetos en una escena tridimensional, mover nuestra c&aacute;mara por el espacio y seleccionar la posic&iacute;on ventajosa deseada para visualizar la escena de composici&oacute;n.
   
    <LI><B>Mapeado de texturas</B> que ayuda a traer realismo a nuestros modelos por medio del dibujo de superficies realistas en las caras de nuestros modelos poligonales  

    <LI>La <B>iluminaci&oacute;n de materiales</B> es una parte indispensable de cualquier gr&aacute;gico 3D. OpenGL provee de comandos para calcular el color de cualquier punto dadas las propiedades del material y las fuentes de luz en la habitaci&oacute;n.

    <LI>El <B>doble buffering</B> ayuda a eliminar el parpadeo de las animaciones. Cada fotograma consecutivo en una animaci&oacute;n se construye en un buffer separado de memoria y mostrado solo cuando est&aacute; completo.

    <LI>El <B>Anti-alizado</B> reduce los bordes escalonados en las l&iacute;neas dibujadas sobre una pantalla de ordenador. Los bordes escalonados aparecen a menudo cuando las l&iacute;neas se dibujan con baja resoluci&oacute;n. El anti-alizado es una t&eacute;nica com&uacute;n en gr&aacute;ficos de ordenador que modifica el color y la intensidad de los pixels cercanos a la l&iacute;nea para reducir el zig-zag artificial.

    <LI>El <B>sombreado Gouraud</B> es una t&eacute;cnica usada para aplicar sombreados suaves a un objeto 3D y producir una sutil diferencia de color por sus superf&iacute;cies.

    <LI>El <B>Z-buffering</B> mantiene registros de la coordenada Z de un objeto 3D. El Z-buffer se usa para registrar la proximidad de un objeto al observador, y es tambi&eacute;n crucial para el eliminado de superf&iacute;cies ocultas.

    <LI><B>Efectos atmosf&eacute;ricos</B> como la niebla, el humo y las neblinas hacen que las im&aacute;genes producidas por ordenador sean m&aacute;s realistas. Sin efectos atmosf&eacute;ricos las im&aacute;genes aparecen a veces irrealmente n&iacute;tidas y bien definidas. <i>Niebla</i> es un t&eacute;rmino que en realidad describe un algoritmo que simula neblinas, brumas, humo o poluci&oacute;n o simplemente el efecto del aire, a&ntilde;adiendo profundidad a nuestras im&aacute;genes.

    <LI>El <B>Alpha blending</B> usa el valor Alfa (valor de material difuso) del c&oacute;digo RGBA, y permite combinar el color del fragmento que se procesa con el del pixel que ya est&aacute; en el buffer. Imagina por ejemplo dibujar una ventana transparente de color azul claro enfrente de una caja roja. El Alpha blending permite simular la transparencia de la ventana, de manera que la caja vista a trav&eacute;s del cristal aparezca con un tono magenta.        

    <LI>Los <B>planos de plantilla</B> permiten restringir el trazado a ciertas regiones de la pantalla. 

    <LI>Las <B>listas de Display</B> permiten almacenar comandos de dibujo en una lista para un trazado posterior, cuando las listas de display se usan apropiadamente puedan mejorar mucho el rendimiento de nuestras aplicaciones.

    <LI><B>Los Evaluadores Polin&oacute;micos</B> sirven para soportar B-splines racionales no uniformes, esto es para ayudar a dibujar curvas suaves a trav&eacute;s de unos cuantos puntos de referencia, ahorr&aacute;ndose la necesidad de acumular grandes cantidades de puntos intermedios.

    <LI>Caracter&iacute;sticas de <B>Feedback, Selecci&oacute;n y Elecci&oacute;n</B> que ayudan a crear aplicaciones que permiten al usuario seleccionar una regi&oacute;n de la pantalla o elegir un objeto dibujado en la misma. El modo de feedback permite al desarrollador obtener los resultados de los c&aacute;lculos de trazado.
  
    <LI><B>Primitivas de Raster</B> (bitmaps y rect&aacute;ngulos de pixels)

    <LI><B>Operaciones con Pixels</B>

    <LI><B>Transformaciones:</B> rotaci&oacute;n, escalado, perspectivas en 3D

    </UL>

    <P>Como hemos mencionado para hacer OpenGL verdaderamente portable e independiente de la plataforma fue necesario sacrificar todos los comandos que interactuaban con el sistema de ventanas, por ejemplo: abrir una ventana, cerrar una ventana, escalar una ventana, dar forma a una ventana, leer la posici&oacute;n del cursor; y tambi&eacute;n con los dispositivos de entrada como la lectura del teclado etc.. Todas estas acciones son altamente dependientes del sistema operativo. Originalmente, la biblioteca GL ten&iacute;a su propio conjunto de comandos para manejo de ventanas y perif&eacute;ricos pero eran espec&iacute;ficos de IRIX (el SO UNIX de SGI). Se deja al desarrollador de OpenGL conocer su propia plataforma y tomar medidas para manejar ventanas en la plataforma nativa.</p>

    <P>Gracias a Mark J. Kilgard de SGI hay una biblioteca adicional que evita este problema. Mark esciribi&oacute; la GLUT-library, un conjunto de herramientas y utilidades que sustituyen a la antigua biblioteca AUX (no importa lo que fuese, &iexcl;olv&iacute;dala!). La biblioteca GLUT es libremente disponible, como Mesa(OpenGL), se puede encontrar c&oacute;digo fuente para ella as&iacute; como versiones binarias para Linux. La biblioteca GLUT es dependiente de la plataforma, y ofrece un paradigma com&uacute;n para el sistema de ventanas y dispositivos perif&eacute;ricos. As&iacute; pues cuando tu aplicaci&oacute;n OpenGL quiere abrir una ventana para una animaci&oacute;n gr&aacute;fica usa el conjunto de comandos GLUT y &eacute;ste toma el control del sistema de ventanas subyacente. De alg&uacute;n modo GLUT oculta al desarrollador los detalles sucios de los sistemas de ventanas espec&iacute;ficos (X11, g&uuml;indos, Motif, etc.) y le deja concentrarse en la tarea principal, el c&oacute;digo OpenGL. Otra ventaja de usar GLUT es que hace tu c&oacute;digo independiente de la plataforma. Yo personalmente he escrito simulacions de geles y prote&iacute;nas que usan GLUT y OpenGL y he sido capaz de compilar y ejecutar sin ning&uacute;n problema ni una sola l&iacute;nea de c&oacute;digo dependiente en Linux-Intel, Linux-Alpha y Windows 95 (lo siento, confieso que uso windows 95 de vez en cuando ;-)

Recomiendo encarecidamente a cualquier interesado en escribir aplicaciones OpenGL usar GLUT como su manejador de ventanas.</p>

 
<p>El saber bien como usar GLUT es tan importante como conocer OpenGL y por eso en la serie actual sobre OpenGL en Linux<i><font color="#ff0000">Focus</font></i> incluiremos unos art&iacute;culos que explican paso a paso como usar GLUT y manejar dispositios perif&eacute;ricos confortablemente.</p>

 <P>Cerrando esta breve introducci&oacute;n no olvidemos mencionar otro de los
    "Maestros del Universo", Brian Paul, quien esta pacientemente implementando una
    libreria a la OpenGL llamada <i>Mesa</i>. De momento Mesa solo provee soporte
    via software, lo que implica que la CPU realiza todas las operaciones de trazado
    y dibujo que normalmente serian relegada al hardware 3D, no obstante Mesa contiene
    ganchos implementados internamente que permiten la creaci&oacute;n de drivers para
    hardware acelerado. De momento, solo existen drivers para Mondello, S3Virge
    (Win95 solamente), GLINT, y Voodoo 3Dfx chips. Gracias al driver Voodoo (escrito
    por David Bucciarelli) Mesa puede alcanzar la misma eficiencia que las
    de estaciones costosas OpenGL proveen, asi que si estas interesado en graficos
    3D acelerados de alta eficiencia buscate una tarjeta 3Dfx.</P>



<P>Antes de cerrar no puedo evitar contaros una experiencia personal con mi Alpha-PC (21164 550MHz 164MRam Linux 2.0.32). Uso la biblioteca Mesa para un programa de simulaci&oacute;n de Geles que estoy escribiendo. No hay soporte hardware en mi sistema para la biblioteca Mesa porque hasta el momento la biblioteca Glide no ha sido producida &aacute;un para mi sistema Alpha (POR FAVOR DAOS PRISA!!!!). Bueno, cuando hace poco Phil Ross y yo compar&aacute;bamos el rendimiento de su Pentium PC + tarjeta 3Dfx y mi Alpha PC + tarjeta Matrox Millenium estuvimos un poco sorprendidos de ver que mi animaci&oacute;n de gel corr&iacute;a tan suavemente como en su PC. Las demos de OpenGL corren mejor a&uacute;n en mi sistema (por supuesto aquellas que no usaban texturas). En otras palabras, la falta de soporte hardware para las llamadas a OpenGL era sobrepasada por la fuerza bruta de la CPU Alpha. Para daros una idea del trabajo en cada uno de los frames, cada frame conten&iacute;a una estructura de Gel modelada con decenas de millares de esferas y cilindros m&aacute;s todos los c&aacute;lculos de iluminaci&oacute;n sobre &eacute;l. En el PC no pudimos ver un gel con tantos mon&oacute;meros porque la computaci&oacute;n demostr&oacute; ser demasiado para la CPU Intel... el Alpha, sin embargo, sin problemas!. No puedo esperar a ver a mi Alpha PC con una 3Dfx y soporte hardware para Mesa.</P>
  
     </TD></TR></TABLE>
     <HR size=1 noshade>
     <P align="left"><I>Traducido por Victor Jalencas</I></P><BR>

    </TD>

 </TR>

 </TBODY>

<TBODY>
  <TR>
    <TD colspan="2">
    <B>Para m&aacute;s informaci&oacute;n</B>:<BR>
    <UL>
      <LI>Lea <A href="article18.html">Tarjeta Gr&aacute;fica 3Dfx </A>. </LI>
      <LI>Consulte <A href="http://www.opengl.org/">http://www.opengl.org/</A>.</LI> 
      <LI>Lea otros art&iacute;culos por el mismo autor:<A href="article16.html">GLUT Programming: Windows and Animation</A>, <A href="article17.html">Programando OpenGL: Dibujo de Pol&iacute;gonos Simples</A>.</LI> 
     <UL><BR><BR>
    <TD>
  </TR>
</TBODY>

 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 Miguel Angel Sep&uacute;lveda</B></FONT><BR>
    <FONT color="#ffffff">Esta p&aacute;gina est&aacute; mantenida por
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>



</TABLE>


</BODY>
</HTML>






