<HTML>
<HEAD>
<TITLE>Accesibilidad COMO: Agradecimientos</TITLE>
</HEAD>
<BODY>
<A HREF="Accesibilidad-Como-9.html">Anterior</A>
<A HREF="Accesibilidad-Como-11.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc10">Indice</A>
<HR>
<H2><A NAME="s10">10. Agradecimientos</A></H2>


<P>Gran parte de este documento se ha creado a partir de informaci&oacute;n
encontrada en Internet, en buscadores como Yahoo y Alta Vista de Digital. 
La mayor&iacute;a de la informaci&oacute;n referente a paquetes de software ha sido
hallada de la misma forma. Tambi&eacute;n se ha recopilado informaci&oacute;n de los
folletos del Royal National Institute for the Blind. T.V. Raman, autor del
<CODE>Emacspeak</CODE> ha contribuido con comentarios, informaci&oacute;n y textos,
adem&aacute;s de ponerme en contacto con personas que conoce en Internet. </P>
<P>Kenneth Albanowski <CODE>
<A HREF="mailto:kjahds@kjahds.com">kjahds@kjhads.com</A></CODE> ha proporcionado el parche necesario para
el <CODE>Brailloterm</CODE> e informaci&oacute;n sobre &eacute;l. </P>
<P>Roland Dyroff de S.u.S.E. GmbH (creadores y sistribuidores de S.u.S.E
Linux (ing&eacute;s/alem&aacute;n)) ha examinado KPS Stolper GmbH a petici&oacute;n m&iacute;a y ha
conseguido detalles de hardware e informaci&oacute;n sobre el <CODE>Brailloterm</CODE>. </P>
<P>Las mayores y m&aacute;s cuidadosas comprobaciones sobre este documento fueron
realizadas por James Bowden, <CODE>
<A HREF="mailto:jrbowden@bcs.org.uk">jrbowden@bcs.org.uk</A></CODE> y Nikhil Nair <CODE>
<A HREF="mailto:nn201@cus.cam.ac.uk">nn201@cus.cam.ac.uk</A></CODE>, los
autores del <CODE>BRLTTY</CODE> que han sugerido un gran n&uacute;mero de correcciones
as&iacute; como informaci&oacute;n suplementaria sobre algunos temas. </P>
<P>Los participantes en las listas <CODE>blinux</CODE> y <CODE>linux-access</CODE> han
contribuido en este documento proporcion&aacute;ndome informaci&oacute;n.</P>
<P>Mark E. Novak del centro Trace R&amp;D <CODE>
<A HREF="http://trace.wisc.edu/">http://trace.wisc.edu</A> </CODE> me gui&oacute;
hacia numerosos paquetes de software e informaci&oacute;n que yo no conoc&iacute;a.
Adem&aacute;s me di&oacute; ideas sobre la estructura del documento que yo he
incorporado parcialmente y sobre lo que deber&iacute;a haber hecho m&aacute;s. </P>
<P>Tambi&eacute;n han contribuido Nicolas Pitre y Stephane Doyon.</P>
<P>Numerosas personas han contribuido con comentarios en informaci&oacute;n.  Las
contribuciones espec&iacute;ficas est&aacute;n referenciadas en el documento. </P>
<P>Esta versi&oacute;n fue especialmente creada para el libro de RedHat Dr.  Linux,
ya que yo y otros autores del LDP fuimos avisados de su inminente
publicaci&oacute;n. Esto es de agradecer, debido a que informaci&oacute;n err&oacute;nea o
desfasada dura mucho m&aacute;s en un libro que en Internet. </P>
<P>Sin duda, usted tambi&eacute;n ha contribuido y no le he mencionado. No se
preocupe, fue un accidente. Lo siento. Av&iacute;seme y le a&ntilde;adir&eacute; a la siguiente
versi&oacute;n. </P>

<HR>
<A HREF="Accesibilidad-Como-9.html">Anterior</A>
<A HREF="Accesibilidad-Como-11.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc10">Indice</A>
</BODY>
</HTML>
