<HTML>
<HEAD>
<TITLE>Accesibilidad COMO: Paquetes de software</TITLE>
</HEAD>
<BODY>
<A HREF="Accesibilidad-Como-7.html">Anterior</A>
<A HREF="Accesibilidad-Como-9.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc8">Indice</A>
<HR>
<H2><A NAME="s8">8. Paquetes de software</A></H2>


<P>Las referencias de esta secci&oacute;n est&aacute;n sacadas directamente del mapa de
software para Linux (LSM) que se puede encontrar en cualquier servidor del
proyecto de documentaci&oacute;n Linux y que lista la pr&aacute;ctica totalidad del
software existente para Linux. </P>

<H2><A NAME="emacspeak"></A> <A NAME="ss8.1">8.1 Emacspeak</A></H2>


<P><CODE>Emacspeak</CODE> es la parte de software de una interfaz de voz para Linux. 
Cualquier programa basado en caracteres, como un paginador web, un cliente
telnet u otro editor pueden ser utilizados con <CODE>Emacspeak</CODE>. La
principal diferencia entre <CODE>Emacspeak</CODE> y un lector de pantalla normal
para sistemas del estilo del DOS es que adem&aacute;s incluye caracter&iacute;sticas
extra. Est&aacute; basado en el editor <CODE>Emacs</CODE>. </P>
<P>Un editor de texto normalmente es &uacute;nicamente un programa que permite
cambiar el contenido de un fichero, por ejemplo, a&ntilde;adiendo informaci&oacute;n
nueva a una carta. <CODE>Emacs</CODE> est&aacute;, de hecho, m&aacute;s all&aacute; de cualquier editor
de texto normal, y por eso es mucho m&aacute;s &uacute;til de lo que parece. Se puede
ejecutar cualquier otro programa desde <CODE>Emacs</CODE>, obteniendo la salida
que se genere en el emulador de terminal de <CODE>Emacs</CODE>. </P>
<P>La raz&oacute;n de que <CODE>Emacs</CODE> sea el mejor entorno para <CODE>Emacspeak</CODE> es que
puede entender la organizaci&oacute;n de la pantalla e interpretar
inteligentemente el significado de, por ejemplo, un calendario, que de
otra forma no ser&iacute;a m&aacute;s que una embrollada matriz de n&uacute;meros. El creador
del paquete se las arregla para manejar completamente su propia m&aacute;quina
Linux, llevando toda la administraci&oacute;n desde <CODE>Emacs</CODE>. Tambi&eacute;n lo usa
para controlar una amplia variedad de software y dispositivos directamente
desde su m&aacute;quina. </P>
<P><CODE>Emacspeak</CODE> se incluye en la distribuci&oacute;n Debian de Linux, y aparece
como contribuci&oacute;n en la Slackware. Esto significa que est&aacute; disponible en
varias de las distribuciones de Linux con formato CDROM. A la fecha de
publicaci&oacute;n de este documento la versi&oacute;n deber&iacute;a ser la 5 o superior, pero
en el momento de escribir estas l&iacute;neas, solo dispongo de la versi&oacute;n 4 para
examinar. </P>
<P>
<UL>
<LI> T&iacute;tulo: <CODE>Emacspeak</CODE> - interfaz de salida de voz para <CODE>Emacs</CODE>
</LI>
<LI> Versi&oacute;n: 4.0
</LI>
<LI> Fecha: 30 Mayo 96
</LI>
<LI> Descripci&oacute;n: <CODE>Emacspeak</CODE> es el primer sistema de salida de voz
que permite a alguien que no puede ver trabajar directamente en un sistema
UNIX. (Hasta ahora, la &uacute;nica opci&oacute;n posible para un discapacitado visual
era utilizar un PC parlante como terminal).  <CODE>Emacspeak</CODE> est&aacute;
construido sobre Emacs. Una vez iniciado <CODE>Emacs</CODE> con <CODE>Emacspeak</CODE>
cargado, se obtiene informaci&oacute;n hablada sobre cualquier cosa que se haga.
Su capacidad depender&aacute; de c&oacute;mo de bien pueda usted usar <CODE>Emacs</CODE>. No hay
nada que no se pueda hacer desde <CODE>Emacs</CODE> :-) 
</LI>
<LI> Palabras clave: discapacidad accesibilidad invidente voz lenguaje
Emacs
</LI>
<LI> Autor: <CODE>
<A HREF="mailto:raman@adobe.com">T.V. Raman</A></CODE>
</LI>
<LI> Mantenido por: <CODE>
<A HREF="mailto:jrv@vanzandt.mv.com">Jim Van Zandt</A></CODE>
</LI>
<LI> Lugar principal:
<CODE>
<A HREF="ftp://sunsite.unc.edu/apps/sound/speech/emacspeak-4.0.tgz">ftp://sunsite.unc.edu/apps/sound/speech/emacspeak-4.0.tgz</A></CODE> 124
Kb.
</LI>
<LI> Otros lugares: 
</LI>
<LI> Lugar original:  <CODE>
<A HREF="http://www.cs.cornell.edu/pub/raman/emacspeak/emacspeak.tar.gz">http://www.cs.cornell.edu/pub/raman/emacspeak/emacspeak.tar.gz</A></CODE>
123kB <CODE>
<A HREF="http://www.cs.cornell.edu/Info/People/raman/emacspeak/emacspeak.tar.gz">http://www.cs.cornell.edu/Info/People/raman/emacspeak/emacspeak.tar.gz</A></CODE>
</LI>
<LI> Plataformas: DECTalk Express o DEC Multivoice Speech Synthesizer,
GNU FSF Emacs 19 (versi&oacute;n 19.23 o superior) y TCLX 7.3B (Extended TCL) 
</LI>
<LI> Licencia: GNU Public License</LI>
</UL>
</P>


<H2><A NAME="brltty"></A> <A NAME="ss8.2">8.2 BRLTTY</A></H2>


<P>Es un programa para utilizar un terminal Braille de puerto serie. Ha sido
ampliamente probado y usado, y soporta varios tipos diferentes de hardware
(v&eacute;ase 
<A HREF="Accesibilidad-Como-7.html#lsm">Linux Software Map</A>). </P>
<P>De su mantenimiento se encarga Nikhil Nair <CODE>
<A HREF="mailto:nn201@cus.cam.ac.uk">nn201@cus.cam.ac.uk</A></CODE>.  Las
otras personas trabajando en ello son Nicole Pitre <CODE>
<A HREF="mailto:nico@cam.org">nico@cam.org</A></CODE> y Stephane Doyon
<CODE>
<A HREF="mailto:doyons@jsp.umontreal.ca">doyons@jsp.montreal.ca</A></CODE>. Env&iacute;eles cualquier comentario. </P>
<P>Los autores est&aacute;n dispuestos a a&ntilde;adir soporte para m&aacute;s dispositivos, as&iacute;
que si usted posee uno, piense en ponerse en contacto con ellos.
Seguramente necesitar&aacute;n informaci&oacute;n sobre la programaci&oacute;n del dispositivo,
as&iacute; que si puede contactar con el fabricante de su dispositivo y
conseguirla, ser&aacute; m&aacute;s f&aacute;cil que le puedan ayudar. </P>
<P>Una breve lista de caracter&iacute;sticas (de su fichero LEAME) que le interesar&aacute;</P>
<P>
<OL>
<LI>Completa implementaci&oacute;n de las facilidades est&aacute;ndar de revisi&oacute;n de
pantalla. 
</LI>
<LI>Una amplia gama de caracter&iacute;sticas a&ntilde;adidas opcionales, que incluyen
cursor parpadeante y letras de imprenta, congelaci&oacute;n de la pantalla para
una lectura tranquila, enlaces de hipertexto, capacidad de localizaci&oacute;n
del texto marcado, etc. 
</LI>
<LI>Gu&iacute;a inteligente del cursor. Esto permite un f&aacute;cil movimiento del
rat&oacute;n en editores de texto, etc. sin mover las manos de la pantalla
Braille. 
</LI>
<LI>Funci&oacute;n 'Cortar y Pegar', particularmente &uacute;til para copiar nombres
de fichero largos, comandos complejos, ... 
</LI>
<LI>Ayuda en l&iacute;nea.
</LI>
<LI>Soporte de m&uacute;ltiples c&oacute;digos Braille.
</LI>
<LI>Dise&ntilde;o modular, que permite una relativa facilidad para la adici&oacute;n
de manejadores de otros dispositivos Braille, o incluso portarlo a otras
plataformas tipo Unix. </LI>
</OL>
</P>
<P>
<UL>
<LI>T&iacute;tulo: BRLTTY - Software de acceso a un sistema UNIX para personas
invidentes mediante un terminal Braille software
</LI>
<LI>Versi&oacute;n: 1.0.2, 17 Septiembre 96
</LI>
<LI>Fecha: 17 Septiembre 96
</LI>
<LI>Descripci&oacute;n: BRLTTY es un demonio que proporciona acceso a una
consola UNIX para una persona invidente mediante un terminal Braille
software (v&eacute;ase el fichero LEAME para una explicaci&oacute;n completa). BRLTTY
s&oacute;lo funciona con aplicaciones en modo texto. Confiamos en que este
sistema ser&aacute; ampliado para soportar otros dispositivos Braille, y
posiblemente, incluso otras plataformas tipo UNIX. 
</LI>
<LI>Palabras clave: Braille consola accesibilidad invidente
</LI>
<LI>Autor:

<UL>
<LI>Nikhil Nair <CODE>
<A HREF="mailto:nn201@cus.cam.ac.uk">nn201@cus.cam.ac.uk</A></CODE></LI>
<LI>Nicolas Pitre <CODE>
<A HREF="mailto:nico@cam.org">nico@cam.org</A></CODE></LI>
<LI>Stephane Doyon <CODE>
<A HREF="mailto:doyons@jsp.umontreal.ca">doyons@jsp.montreal.ca</A></CODE></LI>
<LI>James Bowden <CODE>
<A HREF="mailto:jrbowden@bcs.org.uk">jrbowden@bcs.org.uk</A></CODE></LI>
</UL>

</LI>
<LI> Plataformas: Linux (n&uacute;cleo 1.1.92 o superior) sobre un PC o un DEC
Alpha. 

No soporta X/gr&aacute;ficos. 

Dispositivos Braille soportados (s&oacute;lo puerto serie)

<UL>
<LI>Tieman B.V.: CombiBraille 25/45/85;</LI>
<LI>Alva B.V.: serie ABT3xx;
</LI>
<LI> Telesensory Systems Inc.:PowerBraille 40 (no 65/80), Navigator
20/40/80 (solo la &uacute;ltima versi&oacute;n de firmware??). 
</LI>
</UL>

</LI>
<LI> Licencia: GNU Public License
</LI>
</UL>
</P>


<H2><A NAME="screen"></A> <A NAME="ss8.3">8.3 screen</A></H2>


<P><CODE>screen</CODE> es una parte est&aacute;ndar de software que permite a varios
programas diferentes ejecutarse a la vez en un terminal. Ha sido mejorada
para soportar algunos terminales Braille (los de Telesensory)
directamente. </P>


<H2><A NAME="rsynth"></A> <A NAME="ss8.4">8.4 rsynth</A></H2>


<P>Es una utilidad de s&iacute;ntesis de voz que aparece en el mapa de software de
Linux. Parece que no funciona lo suficientemente bien como para que la use
una persona con discapacidades visuales. Utilice hardware en su lugar, o
intente mejorarlo... una utilidad de s&iacute;ntesis de voz de libre distribuci&oacute;n
ser&iacute;a realmente &uacute;til. </P>


<H2><A NAME="xocr"></A> <A NAME="ss8.5">8.5 xocr</A></H2>


<P><CODE>xocr</CODE> es un paquete que implementa el reconocimiento &oacute;ptico de
caracteres (OCR) para Linux. Como sucede con <CODE>rsynth</CODE>, no creo que sea
un paquete aceptable como &uacute;nico dispositivo de entrada para una persona
con discapacidades visuales. Sospecho que el algoritmo utilizado necesita
que lo supervise alguien que pueda comprobar que est&aacute; leyendo
correctamente. Me encantar&iacute;a que me demostrasen que me equivoco. </P>


<H2><A NAME="xzoom"></A> <A NAME="ss8.6">8.6 xzoom</A></H2>


<P><CODE>xzoom</CODE> es una lupa de pantalla, del mismo estilo que <CODE>xmag</CODE>, pero
lo sufucientemente mejor como para ser muy &uacute;til para una persona con
problemas visuales. Las mayores desventajas de <CODE>xzoom</CODE> son que no puede
agrandarse a s&iacute; mismo, que algunos de los controles de teclado son
incompatibles con <CODE>fvwm</CODE>, el manejador de ventanas usual de Linux, y
que su configuraci&oacute;n por defecto no tiene soporte de red (esto se puede
arreglar a cambio de perder algo de velocidad). Aparte de esto, es
excelente. Produce aumentos continuos que permiten, por ejemplo, desplazar
un documento arriba y abajo, mientras se mantiene aumentada la secci&oacute;n que
se est&aacute; leyendo. Como alternativa, se puede mover una peque&ntilde;a caja por la
pantalla, aumentando su contenido y permitiendole buscar la zona que desea
ver. <CODE>xzoom</CODE> tambi&eacute;n est&aacute; disponible en formato rpm, en los lugares de
descarga de Red Hat, haciendo muy f&aacute;cil su intalaci&oacute;n. </P>
<P>
<UL>
<LI> T&iacute;tulo: xzoom
</LI>
<LI> Versi&oacute;n: 0.1
</LI>
<LI> Fecha: 30 Marzo 96
</LI>
<LI> Descripci&oacute;n: xzoom puede aumentar (un n&uacute;mero entero de veces),
rotar (un m&uacute;ltiplo de 90 grados) y reflejar sobre los ejes X o Y &aacute;reas de
la pantalla X11, y mostrarlas en su ventana. 
</LI>
<LI> Palabras clave: X11 zoom aumentar xmag
</LI>
<LI> Autor: Itai Nahshon <CODE>
<A HREF="mailto:nahshon@best.com">nahshon@best.com</A></CODE>
</LI>
<LI> Mantenido por: Itai Nahshon <CODE>
<A HREF="mailto:nahshon@best.com">nahshon@best.com</A></CODE>
</LI>
<LI> Lugar principal: <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/X11/xutils/xzoom-0.1.tgz">ftp://sunsite.unc.edu/pub/Linux/X11/xutils/xzoom-0.1.tgz</A></CODE>
</LI>
<LI> Plataformas: Linux + X11. S&oacute;lo soporta modos de 8 bits. Probado
&uacute;nicamente en Linux 1.3.* con el manejador XSVGA 3.1.2. Necesita la
extensi&oacute;n XSHM. 
</LI>
<LI> Licencia: libre distribuci&oacute;n. </LI>
</UL>
</P>


<H2><A NAME="nfbtrans"></A> <A NAME="ss8.7">8.7 NFBtrans</A></H2>


<P><CODE>NFBTrans</CODE> es un programa de traducci&oacute;n Braille multigrado distribuido
por la 'National Federation for the Blind' en los E.E.U.U. Es de libre
distribuci&oacute;n, con la esperanza de que alguien lo mejore. Los idiomas
soportados son ingl&eacute;s americano, ingl&eacute;s, espa&ntilde;ol, ruso, esperanto, alem&aacute;n,
hebreo b&iacute;blico (!) y griego cl&aacute;sico, pero se pueden a&ntilde;adir otros solamente
con a&ntilde;adir una tabla de traducci&oacute;n.  Tambi&eacute;n soporta temas de ordenadores
y matem&aacute;ticas. Yo he conseguido compilarlo en Linux, pero al no tener un
traductor Braille, por ahora no he podido probarlo. </P>
<P><CODE>NFBTrans</CODE> est&aacute; disponible en </P>
<P><CODE>
<A HREF="ftp://nfb.org/ftp/nfb/braille/nfbtrans/">ftp://nfb.org/ftp/nfb/braille/nfbtrans/</A></CODE></P>
<P>Despu&eacute;s de descargarlo, ser&aacute; necesario compilarlo.</P>

<H3>Compilaci&oacute;n de NFBTrans en Linux</H3>


<P>He enviado este parche al responsable del <CODE>NFBTrans</CODE> y dice que lo ha
incluido, as&iacute; que si consigue una versi&oacute;n posterior a la 740, posiblemente
no tenga que hacer nada especial. Basta con seguir las instrucciones
incluidas en el paquete. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        unzip -L NFBTR740.ZIP   # o el nombre del fichero que tenga
        mv makefile Makefile
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Despu&eacute;s escriba lo siguiente en un fichero (por ejemplo, <CODE>patch-file</CODE>) </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        *** nfbpatch.c.orig     Tue Mar 12 11:37:28 1996
        --- nfbpatch.c  Tue Mar 12 11:37:06 1996
        ***************
        *** 185,190 ****
        --- 185,193 ----
           return (finfo.st_size);
        }                /* filelength */

        + #ifndef linux
        + /* pretty safe to assume all linux has usleep I think ?? this should be
        + done properly anyway */
        #ifdef SYSVR4
        void usleep(usec)
        int usec;
        ***************
        *** 195,200 ****
        --- 198,204 ----
        UKP  }                /* usleep */      

        #endif
        + #endif

        void beep(count)
        int count;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y ejecute</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
       patch &lt; patch-file
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>despues escriba</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
       make
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y pulse <CODE>RETURN</CODE>, y el programa deber&iacute;a compilarse.</P>


<H2><A NAME="unwindows"></A> <A NAME="ss8.8">8.8 UnWindows</A></H2>


<P><CODE>UnWindows</CODE> es un paquete de utilidades de accesibilidad para X, que
proporciona muchas facilidades para los discapacitados visuales (no
invidentes). Incluye una lupa de pantalla y otras utilidades
personalizables que ayudan a localizar el puntero. </P>
<P>UnWindows se puede descargar desde</P>
<P><CODE>
<A HREF="ftp://ftp.cs.rpi.edu/pub/unwindows/">ftp://ftp.cs.rpi.edu/pub/unwindows/</A></CODE></P>
<P>Con la configuraci&oacute;n por defecto, el paquete no funcionar&aacute; en Linux porque
utiliza algunas caracter&iacute;sticas de las m&aacute;quinas Sun. Sin embargo, algunas
utilidades funcionan y yo me las he arreglado para portar la mayor&iacute;a de
las dem&aacute;s, as&iacute; que este paquete podr&iacute;a ser interesante para algunos. Mi
versi&oacute;n va a ser incorporada al original, o si no, estar&aacute; disponible en
los archivos BLINUX (v&eacute;ase 
<A HREF="Accesibilidad-Como-7.html#www">Referencias en la WWW</A>).
La &uacute;nica utilidad que todav&iacute;a no funciona es la utilidad de configuraci&oacute;n. </P>
<P>En mi versi&oacute;n los programas, en lugar de generar ellos mismos los sonidos,
llaman a otros programas. Estos programas pueden ser, por ejemplo</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        play /usr/lib/games/xboing/sounds/ouch.au
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>que provocar&aacute; que se oiga el sonido 'ouch' de <CODE>xboing</CODE>. Por ejemplo, se
podr&iacute;a hacer esto cuando el puntero llegue al borde superior izquierdo de
la pantalla. </P>

<H3><A NAME="dynamag"></A> dynamag</H3>


<P><CODE>dynamag</CODE> es una lupa de pantalla. V&eacute;ase la secci&oacute;n sobre lupas de
pantalla (
<A HREF="Accesibilidad-Como-3.html#lupa">Aumento del tama&ntilde;o de la pantalla</A>). Este
programa me funcion&oacute; en la distribuci&oacute;n normal. </P>

<H3><A NAME="coloreyes"></A> coloreyes</H3>


<P><CODE>coloreyes</CODE> facilita encontrar el puntero del rat&oacute;n. Consiste en un par
de ojos que miran siempre en la direcci&oacute;n del puntero (como <CODE>xeyes</CODE>).
Esto no funciona en la distribuci&oacute;n normal, pero parece que la versi&oacute;n de
prueba s&iacute; que lo hace. </P>

<H3><A NAME="border"></A> border</H3>


<P><CODE>border</CODE> es un programa que detecta cu&aacute;ndo el puntero del rat&oacute;n ha
llegado al borde de la pantalla y produce un sonido diferente dependiendo
del borde del que se trate. La versi&oacute;n disponible utiliza un sistema de
sonido espec&iacute;fico de Sun. He cambiado esto de forma que en lugar de eso,
se limita a ejecutar un comando, que puede ser cualquier programa de
sonido de Linux. </P>

<H3><A NAME="un-twm"></A> un-twm</H3>


<P>El manejador de ventanas es un programa especial que controla la posici&oacute;n
de todas las ventanas (programas) mostrados en la pantalla X. <CODE>un-twm</CODE>
es una versi&oacute;n especial que producir&aacute; un sonido cada vez que el puntero
entre en una ventana diferente. El sonido depender&aacute; de a qu&eacute; ventana se ha
entrado. La versi&oacute;n distribuida no funciona en Linux porque, como
<CODE>border</CODE>, se basa en las capacidades de audio de Sun. Por supuesto, yo
tengo una versi&oacute;n especial que estar&aacute; disponible para cuando lea esto. </P>


<HR>
<A HREF="Accesibilidad-Como-7.html">Anterior</A>
<A HREF="Accesibilidad-Como-9.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc8">Indice</A>
</BODY>
</HTML>
