<HTML>
<HEAD>
<TITLE>Accesibilidad COMO: Hardware</TITLE>
</HEAD>
<BODY>
<A HREF="Accesibilidad-Como-8.html">Anterior</A>
<A HREF="Accesibilidad-Como-10.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc9">Indice</A>
<HR>
<H2><A NAME="s9">9. Hardware</A></H2>



<H2><A NAME="term-bra-hard"></A> <A NAME="ss9.1">9.1 Terminales Braille dirigidos por hardware</A></H2>


<P>Son terminales Braille que pueden leer la memoria de pantalla directamente
en modo texto. Es posible usarlos para trabajar con Linux en casi
cualquier cosa que un usuario con visi&oacute;n normal pueda hacer en la consola,
incluida la instalaci&oacute;n. Sin embargo tiene un problema con el
desplazamiento del n&uacute;cleo normal de Linux, por lo que hace falta
parchearlo. V&eacute;ase 
<A HREF="#parcheo">Parchear el n&uacute;cleo</A>. </P>

<H3>Braillex</H3>


<P><CODE>Braillex</CODE> es un terminal dise&ntilde;ado para leer directamente de la memoria
de pantalla, as&iacute; como para evitar cualquier problema con programas de
MSDOS con comportamientos peculiares. Si se puede ver por pantalla,
entonces este terminal deber&iacute;a ser capaz de mostrarlo en Braille. En
Linux, desafortunadamente, el manejo de la pantalla se hace de diferente
forma que en MS-DOS, as&iacute; que hay que cambiar algunas cosas. </P>
<P>Para conseguir que funcione este terminal, hay que aplicar el parche de la
secci&oacute;n 
<A HREF="#parcheo">Parchear el n&uacute;cleo</A>. Una vez hecho, el
<CODE>Braillex</CODE> se convierte en una de las mejores formas de usar Linux, ya
que permite acceder a toda la informaci&oacute;n que una persona sin problemas de
visi&oacute;n pudiera leer. Otras terminales no comienzan a funcionar hasta que
el sistema est&aacute; completamente arrancado. </P>
<P>El <CODE>Braillex</CODE> est&aacute; disponible en dos versiones seg&uacute;n la disposici&oacute;n de
los caracteres, 80x1 &oacute; 40x2), y hay un modelo, el <I>IB 2-D</I>, que tiene
adem&aacute;s una barra vertical para mostrar informaci&oacute;n sobre todas las l&iacute;neas
de la pantalla (usando 4 puntos programables por l&iacute;nea). </P>
<P>
<UL>
<LI>Precio: 8.995 libras esterlinas (unos 2 millones de pesetas), o
11495 libras (unos 2 millones y medio de pesetas) </LI>
<LI> Fabricante: Alphavision Limited (Reino Unido) </LI>
<LI>    Distribuidores: ????</LI>
</UL>
</P>

<H3>Brailloterm</H3>


<P>'Pero qu&eacute; diablos es <CODE>Brailloterm</CODE>? </P>
<P>Es un dispositivo de salida Braille refrescable, fabricado por KTS
Kommunikations-Technik Stolper GmbH. Tiene 80 caracteres Braille en una
&uacute;nica l&iacute;nea. Cada car&aacute;cter tiene 8 puntos que se combinan (arriba/abajo)
para representar una letra. Por defecto, <CODE>Brailloterm</CODE> muestra la l&iacute;nea
en la que se encuentra el cursor.  Puedo usar funciones de
<CODE>Brailloterm</CODE> para ver cualquier l&iacute;nea de la pantalla.' - Jose Vilmar
Estacio deSouza <CODE>
<A HREF="mailto:jvilmar@embratel.net.br">jvilmar@embratel.net.br</A></CODE></P>
<P>Jose contin&uacute;a diciendo que el terminal tambi&eacute;n puede usar el puerto serie
bajo DOS, pero que para ello necesita programas especiales. No s&eacute; si
funcionar&aacute; alguno de los de Linux. </P>
<P>Como en el caso de <CODE>Braillex</CODE>, se necesita aplicar un parche al n&uacute;cleo
para que funcione. V&eacute;ase la secci&oacute;n 
<A HREF="#parcheo">Parchear el n&uacute;cleo</A>. </P>
<P>
<UL>
<LI> Precio: unos 23.000 marcos alemanes / 15.000 d&oacute;lares USA (un par de
millones de pesetas) 
</LI>
<LI> Fabricante: Kommunikations-Technik Stolper GmbH
</LI>
<LI> Distribuidores: ???? </LI>
</UL>
</P>

<H3><A NAME="parcheo"></A> Parchear el n&uacute;cleo para <CODE>Braillex</CODE> y <CODE>Brailloterm</CODE></H3>


<P>Posiblemente esto se pueda aplicar a otros terminales que lean
directamente la memoria de pantalla para funcionar bajo MS-DOS.  Env&iacute;eme
un mensaje para confirmar cualquier terminal que le funcione. Esto no es
aplicable y provocar&aacute; la p&eacute;rdida de algunas caracter&iacute;sticas para aquellos
terminales manejados por software <CODE>BRLTTY</CODE>. </P>
<P>He o&iacute;do que este parche se aplica a todos los n&uacute;cleos versi&oacute;n 1.2.x.
Deber&iacute;a funcionar tambi&eacute;n en n&uacute;cleos desde versiones 1.1.x hasta la
1.3.72, &uacute;nicamente con un aviso del comando <CODE>patch</CODE> (he comprobado que
el parche funciona e la versi&oacute;n 1.3.68 al menos). </P>
<P>Desde la versi&oacute;n 1.3.75, el parche ya no hace falta porque el n&uacute;cleo puede
configurarse para que no haya desplazamiento con <CODE>'linux no-scroll'</CODE>
como par&aacute;metro del LILO. V&eacute;ase el <B>Boot Prompt HOWTO</B> para m&aacute;s
detalles. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        *** drivers/char/console.c~     Fri Mar 17 07:31:40 1995
        --- drivers/char/console.c      Tue Mar  5 04:34:47 1996
        ***************
        *** 601,605 ****
        static void scrup(int currcons, unsigned int t, unsigned int b)
        {
        !       int hardscroll = 1;

               if (b &gt; video_num_lines || t &gt;= b)
        --- 601,605 ----
         static void scrup(int currcons, unsigned int t, unsigned int b)
         {
         !       int hardscroll = 0;

               if (b &gt; video_num_lines || t &gt;= b)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para aplicarlo:</P>
<P>
<OL>
<LI>escriba las l&iacute;neas de c&oacute;digo anteriores en un fichero de texto (por
ejemplo, <CODE>patch-file</CODE>) 
</LI>
<LI>cambie al directorio <CODE>drivers/char</CODE> de las fuentes de su
n&uacute;cleo
</LI>
<LI>ejecute

<BLOCKQUOTE><CODE>
<PRE>
        patch &lt; patch-file
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>compile su n&uacute;cleo como de costumbre.</LI>
</OL>
</P>
<P>Despu&eacute;s de aplicar estos parches, deber&iacute;a poder utilizar el terminal
Braille para leer la consola de Linux. </P>
<P>Dicho en palabras, el parche significa <I>cambia el 1 por 0 en la primera
l&iacute;nea de la funci&oacute;n</I> <CODE>scrup</CODE>, <I>que m&aacute;s o menos estar&aacute; por la l&iacute;nea
603 del fichero</I> <CODE>drivers/char/console.c</CODE>. La parte importante del
comando <CODE>patch</CODE> es que el programa entiende esto, y que sabe adivinar
qu&eacute; hacer cuando un desarrollador de Linux cambie algo en ese fichero.</P>
<P>Si lo que quiere es usar un n&uacute;cleo m&aacute;s moderno con el desplazamiento
completamente deshabilitado (en lugar de la soluci&oacute;n de los par&aacute;metros),
utilice el siguiente parche. Esto no funciona para n&uacute;cleos anteriores al
1.3.75. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
       *** console.c~  Fri Mar 15 04:01:45 1996
       --- console.c   Thu Apr  4 13:29:48 1996
       ***************
       *** 516,520 ****
         unsigned char has_wrapped;          /* all of videomem is data of fg_console */
         static unsigned char hardscroll_enabled;
       ! static unsigned char hardscroll_disabled_by_init = 0;

         void no_scroll(char *str, int *ints)
       --- 516,520 ----
         unsigned char has_wrapped;          /* all of videomem is data of fg_console */
         static unsigned char hardscroll_enabled;
       ! static unsigned char hardscroll_disabled_by_init = 1;

         void no_scroll(char *str, int *ints)
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="term-bra-soft"></A> <A NAME="ss9.2">9.2 Terminales Braille dirigidos por software</A></H2>


<P>Los principios de operaci&oacute;n de estos terminales est&aacute;n muy cerca de un
terminal CRT como el <CODE>vt100</CODE>. Se conectan al puerto serie y se debe
ejecutar en el ordenador un programa que les env&iacute;e la salida. Por el
momento hay dos conocidos programas para Linux. <CODE>BRLTTY</CODE> (v&eacute;ase la
secci&oacute;n 
<A HREF="Accesibilidad-Como-8.html#brltty">BRLTTY</A>) y <CODE>Braille enhanced screen</CODE>. </P>

<H3>Tieman B.V.</H3>



<H3>CombiBraille</H3>


<P>Este terminal Braille est&aacute; soportado por el software <CODE>BRLTTY</CODE>.  Existen
3 versiones con 25, 45 o 48 caracteres. Los 5 caracteres extra sobre un
dispositivo est&aacute;ndar se utilizan para informar del estado. </P>
<P>
<UL>
<LI> Precio: unas 4600 libras esterlinas (900.000 pts) </LI>
<LI> Fabricantes: Tieman B.V. </LI>
<LI> Distribuidores: Concept Systems, Nottingham, Inglaterra (tlfno: 
+44 115 925 5988) </LI>
</UL>
</P>

<H3>Alva B.V.</H3>


<P>La serie ABT3xx est&aacute; soportada en <CODE>BRLTTY</CODE>. S&oacute;lo se ha confirmado que
funcione la ABT340 por el momento. Por favor, env&iacute;e informaci&oacute;n sobre
otros modelos a los autores del <CODE>BRLTTY</CODE>. </P>
<P>
<UL>
<LI>    Precio: 
<UL>
<LI>20 caracteres - 2200 libras (500.000 pts);</LI>
<LI>40 caracteres - 4500 libras (900.000 pts);</LI>
<LI>80 caracteres - 8000 libras (1.600.000 pts);</LI>
</UL>

</LI>
<LI> Fabricante: Alva
</LI>
<LI> Distruibuidor: Professional Vision Services LTD, Hertshire,
Inglaterra (tlfno: +44 1462 677331) </LI>
</UL>
</P>

<H3>Dispositivos de Telesensory Systems Inc.</H3>


<P><CODE>BRLTTY</CODE> y <CODE>screen</CODE> soportan dispositivos Telesensory, ya que esta
empresa ha proporcionado la informaci&oacute;n necesaria para ello. </P>

<H3>Powerbraille</H3>


<P>Hay 3 modelos, el 40, el 65 y el 80. S&oacute;lo se sabe que el <CODE>BRLTTY</CODE>
soporta el modelo 40. </P>
<P>
<UL>
<LI>    Precio: 
<UL>
<LI>20 caracteres - 2200 libras (500.000 pts);</LI>
<LI>40 caracteres - 4500 libras (900.000 pts);</LI>
<LI>80 caracteres - 8000 libras (1.600.000 pts);</LI>
</UL>

</LI>
<LI> Fabricante: Alva
</LI>
<LI> Distribuidor: Professional Vision Services LTD, Hertshire,
Inglaterra

(tlfno: +44 1462 677331)</LI>
</UL>
</P>

<H3>Navigator</H3>


<P>Hay 3 modelos, de 20, 60 y 80 caracteres. Se sabe que las nuevas versiones
funcionan con <CODE>BRLTTY</CODE>, pero no se ha confirmado si esto pasa tambi&eacute;n
con versiones anteriores (firmware anterior). </P>
<P>
<UL>
<LI>    Precio: 80 caracteres - 7800 libras esterlinas (1.500.000 pts)</LI>
<LI>    Fabricante: Alva</LI>
<LI>    Distribuidor: Professional Vision Services LTD, Hertshire, England
(+44 1462 677331)</LI>
</UL>
</P>

<H3>Braille Lite</H3>


<P>M&aacute;s portable que un terminal. Podr&iacute;a, sin embargo, usarse con el
<CODE>BRLTTY</CODE> versi&oacute;n 0.22 (pero no con versiones m&aacute;s nuevas) como si se
tratase de un terminal Braille normal.  Desafortunanadamente, muchas de
las caracter&iacute;sticas del <CODE>CombiBraille</CODE> no se pueden usar con
<CODE>Braille Lite</CODE>. Esto significa que deber&iacute;a evitarse su uso en la medida
de lo posible. </P>
<P>
<UL>
<LI>    Precio: 3.395 d&oacute;lares (unas  600.000 pesetas)</LI>
<LI>    Fabricante: Blazie Engineering</LI>
</UL>
</P>


<H2><A NAME="ss9.3">9.3 Herramientas de s&iacute;ntesis de voz</A></H2>


<P>Normalmente se conectan al puerto serie de un PC. Entre sus cualidades
est&aacute;n:</P>
<P>
<UL>
<LI>Etiquetas Braille en los componentes</LI>
<LI>Varias voces para permitir que que cada parte de un documento sea
f&aacute;cilmente distinguible</LI>
<LI>Uso con auriculares (no disponible en todos los modelos)</LI>
</UL>
</P>
<P>El mayor problema es la calidad del lenguaje. Esto es mucho m&aacute;s importante
para alguien que usa la s&iacute;ntesis de voz como su fuente principal de
informaci&oacute;n que para alguien que &uacute;nicamente est&aacute; jugueteando. Por esta
raz&oacute;n, T.V. Raman &uacute;nicamente recomienda <CODE>DECTalk</CODE>. Ser&iacute;a bueno disponer
de alternativas aceptables. </P>

<H3>DECTalk Express</H3>


<P>Es un dispositivo hardware de s&iacute;ntesis de voz. Se recomienda usarlo con
<CODE>Emacspeak</CODE> y de hecho, &eacute;stos son los &uacute;nicos dispositivos que funcionan
con el paquete Emacspeak por el momento. Este dispositivo tiene todas las
cualidades deseables que a mi se me ocurren.  El &uacute;nico defecto que le
encuentro por el momento es el precio. </P>
<P>
<UL>
<LI> Precio: 1.195 d&oacute;lares (mill&oacute;n y medio largo de pesetas) 
</LI>
<LI> Fabricante: Digital Equipment Corporation</LI>
<LI> Distribuidores: Varios. Me gustar&iacute;a conocer detalles &uacute;nicamente de
aquellos que tengan soporte espec&iacute;fico para Linux y con distribuci&oacute;n
internacional, por favor. Si no es el caso, p&oacute;ngase en contacto con
organizaciones locales, la misma empresa Digital o las p&aacute;ginas web de
<CODE>Emacspeak</CODE>. 
</LI>
</UL>
</P>

<H3>Accent SA</H3>


<P>Es una herramienta de Aicom Corporation. Se est&aacute; tratando de escribir un
driver para ella, pero hace falta ayuda. Visite la direcci&oacute;n <CODE>
<A HREF="http://www.cyberspc.mb.ca/~astrope/speak.html">http://www.cyberspc.mb.ca/~astrope/speak.html</A></CODE> si cree que
puede ser de utilidad. </P>

<H3>Chip SPO256-AL2 Speak and Spell</H3>


<P>Hay inter&eacute;s en la utilizaci&oacute;n de este chip en circuitos de habla
integrada. Estoy interesado en conocer si alguien lo ha encontrado &uacute;til.
David Sugar <CODE>dyfet@tycho.com</CODE> ha producido un paquete de software,
<CODE>speak-0.2pl1.tar.gz</CODE>. Sospecho que la calidad de la salida no es lo
suficientemente buena para un uso regular. </P>


<HR>
<A HREF="Accesibilidad-Como-8.html">Anterior</A>
<A HREF="Accesibilidad-Como-10.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc9">Indice</A>
</BODY>
</HTML>
