<HTML>
<HEAD>
<TITLE>Accesibilidad COMO: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Accesibilidad-Como-2.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="intro"></A> <A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>El objetivo de este documento es servir como una introducci&oacute;n a las
tecnolog&iacute;as disponibles para hacer Linux utilizable por personas que, por
diversas discapacidades, habr&iacute;an tenido problemas con ello. En otras
palabras, los grupos destinatarios de estas tecnolog&iacute;as son: invidentes,
discapacitados visuales, sordos y discapacitados f&iacute;sicos. En el momento en
que se descubran nuevas tecnolog&iacute;as o informaciones ser&aacute;n incluidas. </P>
<P>La informaci&oacute;n aqu&iacute; mostrada no es s&oacute;lo para estas personas (aunque
posiblemente sea el objetivo principal) sino tambi&eacute;n para permitir a los
desarrolladores de Linux percatarse de las dificultades relacionadas.
Posiblemente el mayor problema es que, actualmente, muy pocos
desarrolladores de Linux est&aacute;n al tanto de los factores y de varias
sencillas formas de hacer la vida m&aacute;s f&aacute;cil a los implementadores de estos
sistemas. Esto, sin embargo, ha cambiado notablemente desde la aparici&oacute;n
de este documento, por un lado se ha reducido el trabajo potencial de
recopilar informaci&oacute;n gracias a este documento, pero por otro se ha
aumentado el trabajo de la gente dedicada a ello, algunos de ellos
mencionados en los agradecimientos del documento. </P>
<P>Por favor, env&iacute;eme cualquier comentario o informaci&oacute;n adicional, u ofertas
de ayuda a <BR> <CODE>
<A HREF="mailto:access-howto@ed.ac.uk">access-howto@ed.ac.uk</A></CODE>.  Esta direcci&oacute;n podr&iacute;a convertirse en
una lista de correo en un futuro, o pasar directamente a manos de un
hipot&eacute;tico responsable del COMO, as&iacute; que, por favor, no la use para correo
personal.</P>
<P>No tengo tiempo de seguir el desarrollo en todas las &aacute;reas.  Posiblemente
ni siquiera lea un correo hasta que tenga tiempo de actualizar este
documento. Aun y todo ser&aacute; bienvenido. Si se env&iacute;a un correo a la
<B>access-list</B> o a la <B>blind-list</B>, posiblemente lo lea y a&ntilde;ada
informaci&oacute;n &uacute;til al documento. Si no, por favor, env&iacute;e una copia de
cualquier cosa interesante a la direcci&oacute;n de correo electr&oacute;nico anterior.</P>
<P>El correo por el m&eacute;todo tradicional se puede enviar a</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        Linux Access HOWTO
        23 Kingsborough Gardens
        Glasgow G12 9NH
        Scotland
        U.K.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Y poco a poco recorrer&aacute; el mundo hasta m&iacute;. El correo electr&oacute;nico ser&aacute;
unas semanas m&aacute;s r&aacute;pido. </P>
<P>Puede ponerse en contacto personal conmigo mediante <CODE>
<A HREF="mailto:miked@ed.ac.uk">miked@ed.ac.uk</A></CODE>.  Debido a que
utilizo filtros en el correo que recibo, por favor use la otra direcci&oacute;n
si no se trata de correo personal. Es m&aacute;s probable que as&iacute; se llegue a una
respuesta adecuada. </P>

<H2><A NAME="intro-poli"></A> <A NAME="ss1.1">1.1 Pol&iacute;tica de distribuci&oacute;n</A></H2>


<P>El Accesibilidad-COMO tiene copyright (c) de Michael De La Rue.</P>
<P>El Accesibilidad-COMO puede ser distribuido, a su elecci&oacute;n, bajo los
t&eacute;rminos de la <B>Licencia P&uacute;blica GNU (GPL)</B> versi&oacute;n 2 o superior, o los
del <B>Proyecto de Documentaci&oacute;n Linux (LDP)</B>.  Estas licencias deber&iacute;an
estar disponibles en el lugar del que sac&oacute; este documento. Por favor,
tenga en cuenta que los t&eacute;rminos de LDP no permiten la modificaci&oacute;n (salvo
la traducci&oacute;n), por lo que las versiones modificadas deber&aacute;n ser
distribuidas bajo la licencia GPL. </P>


<HR>
Anterior
<A HREF="Accesibilidad-Como-2.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc1">Indice</A>
</BODY>
</HTML>
