<HTML>
<HEAD>
<TITLE>Accesibilidad COMO: Comparaci&oacute;n de Linux con otros sistemas operativos</TITLE>
</HEAD>
<BODY>
<A HREF="Accesibilidad-Como-1.html">Anterior</A>
<A HREF="Accesibilidad-Como-3.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="compa"></A> <A NAME="s2">2. Comparaci&oacute;n de Linux con otros sistemas operativos</A></H2>



<H2><A NAME="compa-gral"></A> <A NAME="ss2.1">2.1 Comparaci&oacute;n general</A></H2>

<P>     </P>
<P>El mejor sitio para saber m&aacute;s de esto es en documentos tales como la
<B>'Linux info sheet'</B> (pliego de informaci&oacute;n sobre Linux), <B>'Linux
Meta FAQ'</B> (preguntas y respuestas acerca de las PUF de Linux)  y
<B>'Linux FAQ'</B> (PUF de Linux; Preguntas de Uso Frecuente; v&eacute;ase 
<A HREF="Accesibilidad-Como-7.html#doc">Documentaci&oacute;n de Linux</A>). </P>
<P>Las principales razones para que un invidente use Linux incluir&iacute;an el
hecho de que este sistema est&aacute; equipado internamente con un completo
soporte para trabajo en red, lo que proporciona acceso total a Internet. 
M&aacute;s generalmente, los usuarios son atra&iacute;dos por el completo entorno de
desarrollo incluido. Tambi&eacute;n, a diferencia de la mayor&iacute;a de los Entornos
Gr&aacute;ficos de Usuario (GUI)  modernos, la parte gr&aacute;fica de Linux (XWindow) 
est&aacute; claramente separada del entorno subyacente, y hay un completo grupo
de programas modernos tales como navegadores web y software de fax que
trabajan directamente en el entorno no-gr&aacute;fico. Esto proporciona la forma
de proveer caminos alternativos en el acceso a la funcionalidad del
sistema; un buen ejemplo es <CODE>Emacspeak</CODE>.</P>
<P>Para otros usuarios, la comparaci&oacute;n es posiblemente menos favorable y no
tan clara. Personas con necesidades muy espec&iacute;ficas y complejas
encontrar&aacute;n que el completo sistema de desarrollo incluido permite
soluciones razonablemente personalizadas. Sin embargo, la mayor parte del
software que existe en otros sistemas est&aacute; todav&iacute;a empezando a estar
disponible. Se est&aacute; llevando a cabo m&aacute;s desarrollo en casi todas las
direcciones.</P>


<H2><A NAME="ss2.2">2.2 Disponibilidad de tecnolog&iacute;a adaptativa</A></H2>

<P>     </P>
<P>Pr&aacute;cticamente no hay nada comercial disponible espec&iacute;ficamente para Linux.
Hay una notable cantidad de software de libre distribuci&oacute;n que puede ser
&uacute;til para la adaptaci&oacute;n, por ejemplo, una aplicaci&oacute;n de s&iacute;ntesis de voz, o
alg&uacute;n programa de control por voz. Tambi&eacute;n hay una serie de paquetes de
libre distribuci&oacute;n que proporcionan un buen apoyo para ciertas terminales
Braille, por ejemplo. </P>


<H2><A NAME="ss2.3">2.3 Usabilidad inherente</A></H2>

<P>     </P>
<P>Linux tiene la gran ventaja sobre Windows de tener la mayor&iacute;a de su
software orientado a l&iacute;nea de comandos. Esto est&aacute; cambiando y casi todo
est&aacute; disponible con una apariencia gr&aacute;fica. Sin embargo, debido a que en
sus or&iacute;genes fue un sistema operativo de programadores, todav&iacute;a se
escriben programas orientados a l&iacute;nea de comandos, que cubren casi todas
las nuevas &aacute;reas de inter&eacute;s. Para el discapacitado f&iacute;sico, esto significa
que es f&aacute;cil construir programas personalizados que se ajusten a sus
necesidades. Para los invidentes, esto deber&iacute;a hacer f&aacute;cil el uso con una
herramienta de s&iacute;ntesis de voz o un terminal Braille en un previsible
futuro. </P>
<P>El sistema de m&uacute;ltiples consolas virtuales de Linux hace pr&aacute;ctico el que
una persona invidente trabajando directamente mediante Braille pueda
usarlo como un sistema operativo multitarea. </P>
<P>El sistema de ventanas utilizado por Linux (X11) viene con varias
herramientas de programaci&oacute;n, y deber&iacute;a ser adaptable. Sin embargo, en la
pr&aacute;ctica, los programas adaptativos disponibles hasta ahora han sido m&aacute;s
primitivos que los de Mac o Windows. Son, en cambio, completamente
gratuitos (frente a los miles de pesetas de los otros), y la calidad
definitivamente est&aacute; mejorando. </P>
<P>En principio deber&iacute;a ser posible montar un sistema Linux completo para una
persona invidente por unas 60-80.000 pts (PC baratillo + tarjeta de
audio). Esto contrasta con los cientos de miles de otros sistemas
(software de lectura de pantalla/hardware de s&iacute;ntesis de voz).  Todav&iacute;a
tengo que verlo. Dudo que funcionase en la pr&aacute;ctica porque el software de
s&iacute;ntesis de voz disponible para Linux no es lo suficientemente bueno. Para
un discapacitado f&iacute;sico, la limitaci&oacute;n todav&iacute;a est&aacute; en la carest&iacute;a del
hardware de entrada de datos. </P>


<HR>
<A HREF="Accesibilidad-Como-1.html">Anterior</A>
<A HREF="Accesibilidad-Como-3.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc2">Indice</A>
</BODY>
</HTML>
