<HTML>
<HEAD>
<TITLE>Accesibilidad COMO: Invidentes</TITLE>
</HEAD>
<BODY>
<A HREF="Accesibilidad-Como-2.html">Anterior</A>
<A HREF="Accesibilidad-Como-4.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="invi"></A> <A NAME="s3">3. Invidentes</A></H2>

<P>     </P>
<P>Voy a usar dos categor&iacute;as generales. Las personas que tienen deficiencias
visuales y necesitan ayuda para ver/descifrar/seguir el texto y aquellas
que son incapaces de usar ninguna interfaz visual. </P>

<H2><A NAME="invi-panta"></A> <A NAME="ss3.1">3.1 Ver la pantalla con mala visi&oacute;n</A></H2>


<P>Aqu&iacute; hay varios problemas diferentes. A veces el aumento de tama&ntilde;o puede
ser &uacute;til, pero ah&iacute; no se acaba todo. A veces las personas no pueden
percibir la acci&oacute;n, otras no pueden ver el cursor hasta que se mueve. Esto
requiere una gama de t&eacute;cnicas, la mayor&iacute;a de las cuales est&aacute;n siendo
a&ntilde;adidas a las X. </P>

<H3><A NAME="svgatextmode"></A> SVGATextMode</H3>


<P>Este programa es &uacute;til para mejorar la visibilidad de la pantalla de texto
normal que proporciona Linux. La pantalla muestra 80 caracteres
horizontalmente y 25 verticalmente. Esto se puede cambiar (a la vez que
mejorar la calidad de estos caracteres) utilizando <CODE>SVGATextMode</CODE>. El
programa permite un acceso completo a los modos posibles de una tarjeta
SVGA.  Por ejemplo, el texto se puede alargar de forma que solo aparezcan
en pantalla 50 por 15 caracteres. No hay una forma f&aacute;cil de aumentar una
determinada zona de la pantalla, pero se puede variar su tama&ntilde;o a
voluntad. </P>

<H3><A NAME="X"></A> Sistema X Window</H3>


<P>Para las personas capaces de ver la pantalla hay numerosas formas de
mejorar las X Window. Estas no forman a&uacute;n un conjunto de caracter&iacute;sticas
coherente, pero si se configuran bien, pueden resolverse diversos
problemas. </P>

<H3><A NAME="reso"></A> Diferentes resoluciones de pantalla</H3>


<P>El servidor X puede configurarse a diferentes resoluciones (modos). La
simple pulsaci&oacute;n de una tecla puede cambiar entre ellas permitiendo ver
texto dif&iacute;cil de leer. </P>
<P>En el fichero <CODE>/etc/XF86Config</CODE>, hay una entrada en la secci&oacute;n de
la pantalla (<CODE>screen</CODE>) con una l&iacute;nea que comienza con los modos. Si por
ejemplo, se pone</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        Modes   &quot;1280x1024&quot; &quot;1024x768&quot; &quot;800x600&quot; &quot;640x480&quot; &quot;320x240&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>con cada modo correctamente configurado (lo que requiere un monitor
razonablemente bueno para la mayor resoluci&oacute;n), ser&aacute; capaz de tener un
aumento de tama&ntilde;o de hasta el 400% cambiando entre los diferentes modos,
utilizando <CODE>CTRL+ALT+'+'</CODE> (del teclado num&eacute;rico) y
<CODE>CTRL+ALT+'-'</CODE> (del teclado num&eacute;rico)</P>
<P>Moviendo el rat&oacute;n por la pantalla podremos situarnos en la zona que nos
interese. Para m&aacute;s detalles sobre la configuraci&oacute;n v&eacute;ase la documentaci&oacute;n
que se incluye con el servidor X XFree86. </P>

<H3><A NAME="lupa"></A> Aumento del tama&ntilde;o de la pantalla</H3>


<P>Hay numerosos programas de lupa conocidos, <CODE>xmag</CODE> aumentar&aacute; una zona de
la pantalla tanto como se necesite, pero es muy primitivo.  Otro es
<CODE>xzoom</CODE>. Previamente he dicho que ten&iacute;a que haber algo mejor que
<CODE>xmag</CODE>, bueno, pues es &eacute;ste. V&eacute;ase la secci&oacute;n 
<A HREF="Accesibilidad-Como-8.html#xzoom">xzoom</A>.</P>
<P>Otro programa disponible es <CODE>puff</CODE>. Est&aacute; espec&iacute;ficamente orientado
hacia los discapacitados visuales. Proporciona caracter&iacute;sticas como una
caja alrededor del puntero del rat&oacute;n de forma que sea m&aacute;s f&aacute;cil
localizarlo. Otras cualidades interesantes de <CODE>puff</CODE> son las que,
correctamente configuradas, son capaces de seleccionar y aumentar
porciones de pantalla en el momento en que cambian. Sin embargo parece que
hay alg&uacute;n tipo de interacci&oacute;n entre <CODE>xpuff</CODE> y el manejador de ventanas
que hace dif&iacute;cil su uso. Cuando se utiliza con <CODE>fvwm</CODE>, no responde a la
pulsaci&oacute;n de ninguna tecla, sin embargo esta situaci&oacute;n se evita usando
<CODE>twm</CODE>. </P>
<P>El &uacute;ltimo programa que he visto trabajar es el <CODE>dynamag</CODE>. De nuevo &eacute;ste
tiene caracter&iacute;sticas espec&iacute;ficas como la capacidad de seleccionar una
determinada zona de la pantalla y monitorizarla, refrescando la imagen
aumentada a intervalos regulares de pocas cent&eacute;simas de segundo o varios
segundos. <CODE>Dynamag</CODE> es parte de la distribuci&oacute;n <CODE>UnWindows</CODE>. V&eacute;ase
la secci&oacute;n 
<A HREF="Accesibilidad-Como-8.html#unwindows">UnWindows</A> para m&aacute;s detalles. </P>

<H3><A NAME="fuente"></A> Cambiar la fuente de pantalla</H3>


<P>Las fuentes de pantalla deber&iacute;an poder cambiarse en cualquier software
para X correctamente escrito. Se puede entonces hacerlas lo
suficientemente grandes como para leerlas. Esto generalmente se lleva a
cabo poniendo una l&iacute;nea en el fichero <CODE>.Xdefaults</CODE> del directorio
propio. A&ntilde;adiendo las l&iacute;neas correctas en este fichero se pueden cambiar
las fuentes de los programas, por ejemplo</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        Emacs.font: -sony-fixed-medium-r-normal-16-150-75-75-c-80-iso8859-*
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para conocer las fuentes disponibles, utilice el programa <CODE>xfontsel</CODE>
bajo X. </P>
<P>Deber&iacute;a haber forma de cambiar esto de manera m&aacute;s general, para que todo
aparezca con la fuente aumentada. Esto se podr&iacute;a hacer renombrando las
fuentes, y diciendo a los programas generadores de fuentes que utilicen un
nivel de escalado diferente. Si alguien consigue que esto funcione, por
favor que me env&iacute;e los detalles de c&oacute;mo lo hizo. </P>

<H3><A NAME="curso"></A> Cursores con hilos, etc...</H3>


<P>Para la gente que tiene dificultad siguiendo el cursor, aqu&iacute; hay algunas
cosas que pueden ayudar:</P>
<P>
<UL>
<LI> cursores con hilos (l&iacute;neas horizontal y vertical desde el
borde de la pantalla).</LI>
<LI> cursores parpadeantes (cursores que se iluminan al pulsar una
tecla).</LI>
</UL>
</P>
<P>No conozco ning&uacute;n programa que proporcione espec&iacute;ficamente un cursor de
hilos. <CODE>Puff</CODE>, mencionado en la secci&oacute;n anterior, proporciona una caja
destelleante alrededor del cursor que puede hacer considerablemente m&aacute;s
f&aacute;cil su localizaci&oacute;n. </P>
<P>Lo mejor que se puede hacer es cambiar el mapa de bits del cursor. Cree un
fichero de mapa de bits como usted desee, y otro con la misma forma, pero
completamente negro. Convi&eacute;rtalos a formato XBM y ejecute</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        xsetroot -cursor ficherocursor.xbm cursor-negro.xbm
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Realmente, si conoce el uso de m&aacute;scaras, <CODE>cursor-negro.xbm</CODE> no tiene
por qu&eacute; ser completamente negro, pero es mejor comenzar con algo as&iacute;. El
fichero <CODE>.Xdefaults</CODE> controla los cursores que utiliza la aplicaci&oacute;n
actual.  Para ampliar la informaci&oacute;n, v&eacute;ase el <B>X Big Cursor
mini-HOWTO</B>, de Joerg Schneider <CODE>
<A HREF="mailto:schneid@ira.uka.de">schneid@ira.uke.de</A></CODE>. </P>

<H3><A NAME="audio"></A> Audio</H3>


<P>Mientras el usuario tenga la capacidad de o&iacute;r, la entrada de audio puede
ser muy &uacute;til para crear un entorno m&aacute;s amigable y comunicativo. Para una
persona con mala visi&oacute;n, las indicaciones de audio pueden ayudar a
localizar el cursor (v&eacute;ase 
<A HREF="Accesibilidad-Como-8.html#unwindows">UnWindows</A>). Para un
modo consola utilizando <CODE>Emacspeak</CODE> (v&eacute;ase 
<A HREF="Accesibilidad-Como-8.html#emacspeak">Emacspeak</A>), los iconos de audio disponibles proporcionar&aacute;n
caracter&iacute;sticas muy &uacute;tiles. </P>
<P>La configuraci&oacute;n del audio en Linux est&aacute; explicada en el <B>Sonido-Como</B>
(v&eacute;ase 
<A HREF="Accesibilidad-Como-7.html#doc">Documentaci&oacute;n de Linux</A>). Una vez que el
sonido est&aacute; configurado, se pueden producir salidas de audio con el
comando <CODE>play</CODE> incluido en la mayor&iacute;a de las versiones de Linux.  Esta
es la forma de utilizar mi versi&oacute;n de <CODE>UnWindows</CODE>.</P>

<H3><A NAME="grantext"></A> Texto de gran tama&ntilde;o</H3>


<P>Imprimir en gran tama&ntilde;o en Linux es bastante f&aacute;cil. Hay varias t&eacute;cnicas. </P>

<H3><A NAME="latex"></A> LaTeX / TeX</H3>


<P>LaTeX es un sistema de preparaci&oacute;n de documentos extremadamente potente.
Puede ser utilizado para imprimir documentos de casi cualquier naturaleza
en tama&ntilde;o grande. Aunque algo complicado de aprender, muchos documentos se
producen usando LaTeX, o el programa de formateo de texto subyacente, TeX. </P>
<P>Esto producir&aacute; texto razonablemente grande</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        \font\magnifiedtenrm=cmr10 at 20pt      % configurar fuente grande
        \magnifiedtenrm
        Esto es un texto grande
        \bye
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para m&aacute;s detalles, v&eacute;ase el libro de LaTeX, disponible en cualquier
librer&iacute;a. Hay tambi&eacute;n un gran n&uacute;mero de introducciones disponibles en
Internet. </P>

<H3><A NAME="print"></A> Impresi&oacute;n de texto grande</H3>


<P>Casi todas las impresiones en Linux utilizan <CODE>postscript</CODE>, y Linux
puede dirigir casi cualquier impresora us&aacute;ndolo. Yo imprimo el material de
ense&ntilde;anza en texto grande en una Epson matricial. </P>
<P>Para los usuarios de X, hay varias herramientas disponibles que pueden
producir texto grande. Estas incluyen <CODE>LyX</CODE>, y varios procesadores de
texto comerciales. </P>


<H2><A NAME="invi-ayuda"></A> <A NAME="ss3.2">3.2 Ayudas para aquellos que no pueden utilizar salida visual </A></H2>


<P>Para alguien que es totalmente incapaz de utilizar una pantalla normal hay
dos alternativas, Braille o voz. Obviamente para la gente que adem&aacute;s tenga
dificultades auditivas, la voz no es siempre &uacute;til, as&iacute; que el Braille
siempre va a ser importante. </P>
<P>Si pudiese elegir, ¿qu&eacute; elegir&iacute;a? Este es un buen tema de debate. El
lenguaje (la voz) es r&aacute;pido de usar, razonablemente barato y especialmente
bueno para aplicaciones textuales (por ejemplo la lectura de un documento
largo, como &eacute;ste). Los problemas incluyen la necesidad de un entorno
silencioso, y posiblemente ser&aacute;n necesarios auriculares para trabajar sin
molestar a otros y evitar ser escuchado (no disponible para todos los
programas de s&iacute;ntesis de voz).</P>
<P>El Braille es mejor para aplicaciones en las que una disposici&oacute;n precisa
es importante (por ejemplo en hojas de c&aacute;lculo).  Tambi&eacute;n puede ser algo
m&aacute;s conveniente si se quiere comprobar el principio de una frase cuando se
llega al final. El Braille es, sin embargo, mucho m&aacute;s caro y lento para
leer texto.  Obviamente, cuanto m&aacute;s use el Braille, m&aacute;s r&aacute;pido lo har&aacute;. El
grado II de Braille es dif&iacute;cil de aprender, pero casi merece la pena
debido a su mayor rapidez. Esto significa que si no utiliza Braille
durante alg&uacute;n tiempo, nunca podr&aacute; descubrir su verdadero potencial y
decidir por usted mismo. De todas formas, ya he dicho bastante sobre este
tema tan lleno de controversia. </P>
<P>Basado en el original de James Bowden <CODE>
<A HREF="mailto:jrbowden@bcs.org.uk">jrbowden@bcs.org.uk</A></CODE></P>

<H3><A NAME="termbraille"></A> Terminales Braille</H3>


<P>Los terminales Braille normalmente constan de una o dos l&iacute;neas de
Braille. Teniendo en cuenta que un terminal tiene 80 caracteres de ancho y
normalmente 40 de largo, est&aacute;n algo limitados. Personalmente
conozco 2 tipos</P>
<P>
<UL>
<LI>Terminales Braille dirigidos por hardware.</LI>
<LI>Terminales Braille dirigidos por software.</LI>
</UL>
</P>
<P>El primer tipo funciona cuando el ordenador est&aacute; en modo texto y lee la
memoria de pantalla directamente. V&eacute;ase la secci&oacute;n 
<A HREF="Accesibilidad-Como-9.html#term-bra-hard">Terminales Braille dirigidos por hardware</A>. </P>
<P>El segundo tipo de terminales Braille es similar, en varios sentidos, a la
pantalla de un terminal normal del tipo de los que soporta Linux
autom&aacute;ticamente. Desafortunadamente, necesitan software especial para
hacerlos utilizables. </P>
<P>Hay dos paquetes que ayudan con esto. El primero, <CODE>BRLTTY</CODE>, trabaja con
bastantes tipos de pantallas Braille y los autores est&aacute;n dispuestos a
soportar m&aacute;s si la informaci&oacute;n necesaria se encuentra disponible.
Actualmente <CODE>BRLTTY</CODE> soporta la serie <CODE>CombiBraille</CODE> de Tieman B.V.,
la serie <CODE>ABT3</CODE> de Alva B.V., y las series <CODE>PowerBraille</CODE> y
<CODE>Navigator</CODE> de Telesensory Systems Inc. El uso del <CODE>Braille Lite</CODE> de
Blazie Engineering como pantalla Braille est&aacute; desaconsejado, pero el
soporte puede ser renovado a petici&oacute;n.  V&eacute;ase la secci&oacute;n 
<A HREF="Accesibilidad-Como-9.html#term-bra-soft">Terminales Braille dirigidos por software</A>. </P>
<P>El otro paquete que conozco es el <CODE>Braille Enhanced Screen</CODE>.  Est&aacute;
dise&ntilde;ado para trabajar en sistemas UNIX as&iacute; como Linux. Esto deber&iacute;a
permitir al usuario acceder a una terminal Braille con muchas
caracter&iacute;sticas &uacute;tiles, como la capacidad de ejecutar diferentes programas
en distintas 'terminales virtuales' al mismo tiempo. </P>

<H3><A NAME="sintvoz"></A> S&iacute;ntesis de voz</H3>


<P>La s&iacute;ntesis de voz toma, normalmente, un texto ASCII y lo convierte en
salida hablada real. Es posible tener esto implementado como hardware o
software. Desafortunadamente, las herramientas de s&iacute;ntesis de voz de libre
distribuci&oacute;n para Linux no son, como se sabe, lo suficientemente buenas
como para usarlas como &uacute;nico medio de salida. </P>
<P>La alternativa es la s&iacute;ntesis por hardware. La principal herramienta que
conozco es <CODE>DECtalk</CODE>, de Digital, manejado por <CODE>Emacspeak</CODE>. Sin
embargo, ahora (marzo del 97) se acaba de anunciar un manejador para el
<CODE>Doubletalk</CODE>. Usando <CODE>Emacspeak</CODE>, el acceso total a las facilidades
de Linux es bastante sencillo. Esto incluye el uso normal de la interfaz
de comandos, un navegador web y varias otras caracter&iacute;sticas similares,
como email. Aunque con programas que no entiende act&uacute;a solamente como un
lector de texto plano (similar al de IBM para PC), con los que si entiende
puede proporcionar un control mucho m&aacute;s sofisticado. V&eacute;ase la secci&oacute;n 
<A HREF="Accesibilidad-Como-8.html#emacspeak">Emacspeak</A>. </P>

<H3><A NAME="consoleout"></A> Controlar la salida de la consola</H3>


<P>Cuando se inicia, Linux imprime todos sus mensajes en la pantalla normal
(pantalla visual), aunque esto se podr&iacute;a cambiar si alguien con
conocimientos b&aacute;sicos para programar el n&uacute;cleo quisiera.  Esta forma de
arranque implica que es imposible para la mayor&iacute;a de los dispositivos
Braille obtener informaci&oacute;n sobre lo que Linux est&aacute; haciendo antes de que
el sistema est&eacute; completamente operativo. </P>
<P>Unicamente en ese momento podr&aacute; arrancar el programa necesario para su
accesibilidad. Si se usa el <CODE>BRLTTY</CODE>, y se ejecuta muy pronto en el
proceso de arranque, a partir de ese momento se podr&aacute;n leer los mensajes
en la pantalla. La mayor&iacute;a del software y el hardware todav&iacute;a tendr&aacute;n que
esperar a que el sistema est&eacute; completamente listo. Esto hace que el hecho
de administrar un sistema Linux sea dif&iacute;cil, pero no imposible, para una
persona con discapacidades visuales. Sin embargo, una vez que el sistema
est&aacute; listo, se puede hacer un desplazamiento hacia atr&aacute;s pulsando (en el
dispositivo de teclado por defecto)  </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        SHIFT+RePag
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Hay un sistema Braille que puede utilizar la consola directamente, llamado
<CODE>Braillex</CODE>. Est&aacute; dise&ntilde;ado para leer directamente de la memoria de
pantalla. Desafortunadamente el desplazamiento normal del terminal se
tropieza con esto. Si est&aacute; usando un n&uacute;cleo superior al 1.3.75,
sencillamente teclee</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        linux no-scroll
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>en el prompt de LILO o configure LILO para que lo haga autom&aacute;ticamente. Si
tiene una versi&oacute;n anterior de Linux, vaya a la secci&oacute;n 
<A HREF="Accesibilidad-Como-9.html#parcheo">parcheo</A>. </P>
<P>Otra cosa &uacute;til que se puede hacer es utilizar sonidos para indicar cu&aacute;ndo
se llega a cada etapa del proceso de arranque. (sugerencia de T.V. Raman) </P>

<H3><A NAME="roc"></A> Reconocimiento &oacute;ptico de caracteres</H3>


<P>Existe un programa de Reconocimiento Optico de Caracteres (OCR) de libre
distribuci&oacute;n para Linux llamado <CODE>xocr</CODE>. En principio, si fuese
suficientemente bueno, este programa permitir&iacute;a a los discapacitados
visuales leer libros normales hasta cierto punto (la precisi&oacute;n del OCR
nunca es suficiente...). Sin embargo, de acuerdo con la documentaci&oacute;n,
este programa necesita una preparaci&oacute;n para reconocer la fuente en
particular que se va a utilizar y yo no tengo ni idea de c&oacute;mo va este
programa ya que no tengo el hardware para probarlo. </P>


<H2><A NAME="invi-linux"></A> <A NAME="ss3.3">3.3 Empezando con Linux</A></H2>


<P>Empezar a aprender Linux puede parecer dif&iacute;cil e intimidatorio para
alguien que proviene de un entorno <CODE>DOS</CODE> o de ninguno. Hacer lo
siguiente puede ayudar: </P>
<P>
<UL>
<LI>Aprender a usar Linux (o UNIX) en el sistema de otra persona antes
de montar el nuestro. 
</LI>
<LI>Inicialmente controlar Linux desde la propia terminal Braille o de
voz. Si planea usar la voz, tendr&aacute; que aprender Emacs antes. Aunque
tambi&eacute;n puede ir aprendiendo sobre la marcha. Vea m&aacute;s abajo. 
</LI>
<LI>Si proviene de un entorno <CODE>MS-DOS</CODE>, lea el <B>DOS2Linux
Mini-HOWTO</B> (v&eacute;ase 
<A HREF="Accesibilidad-Como-7.html#howto">Documentos HOWTO de Linux</A>). </LI>
</UL>
</P>
<P>El <B>Emacspeak HOWTO</B> de Jim Van Zandt <CODE>
<A HREF="mailto:jrv@vanzandt.mv.com">jrv@vanzandt.mv.com</A></CODE> cubre
esto con m&aacute;s detalle (v&eacute;ase 
<A HREF="Accesibilidad-Como-7.html#howto">Documentos HOWTO de Linux</A>). </P>
<P>Si planea usar <CODE>Emacspeak</CODE>, deber&iacute;a saber que <CODE>Emacspeak</CODE> no le
ense&ntilde;a <CODE>Emacs</CODE>, as&iacute; que ser&iacute;a muy &uacute;til un conocimiento previo de
<CODE>Emacs</CODE>. Dicho esto, ciertamente no se necesita saber mucho sobre
<CODE>Emacs</CODE> para usar <CODE>Emacspeak</CODE>. De hecho, una vez que <CODE>Emacspeak</CODE>
est&aacute; instalado y ejecut&aacute;ndose, proporciona una &aacute;gil interfaz ante el rico
conjunto de documentaci&oacute;n en l&iacute;nea incluyendo las 'info pages', y hace m&aacute;s
f&aacute;cil aprender lo que necesita. </P>
<P>'En resumen: comenzar a usar Emacspeak necesita un poco de aprendizaje. 
Convertirse en un gur&uacute; del Emacs y del Emacspeak, sobre todo si pretende
usarlo como reemplazo de las X Window como hago yo implicar&aacute; conocer
muchas extensiones Emacs; pero esto es un proceso incremental, y no
necesita hacerse en un d&iacute;a' - T.V. Raman</P>
<P>Otra opini&oacute;n que puede ser interesante son las cintas de entrenamiento
<CODE>RNIB</CODE>, que incluyen una sobre el tema UNIX. Estas se pueden obtener de</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        RNIB
        Customer Sevices
        PO Box 173
        Peterborough
        Cambridgeshire PE2 6WS
        Tel: 01345 023153       (posiblemente solo funcione en el Reino
Unido)
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="invi-braille"></A> <A NAME="ss3.4">3.4 Dispositivos Braille</A></H2>


<P>Linux deber&iacute;a ser la plataforma perfecta desde la que manejar un
dispositivo Braille. Hay varias herramientas de formateo destinadas
espec&iacute;ficamente para un dispositivo de anchura fija. Un dispositivo
Braille puede ser conectado al puerto serie utilizando los mecanismos de
impresi&oacute;n est&aacute;ndar de Linux. Para m&aacute;s informaci&oacute;n, v&eacute;ase el <B>Linux
Printing HOWTO</B>. </P>
<P>Hay un paquete de software de libre distribuci&oacute;n de la 'National
Federation for the Blind' americana disponible para Linux que act&uacute;a como
un traductor multilingue de grado II, llamado <CODE>NFBtrans</CODE>. V&eacute;ase la
secci&oacute;n 
<A HREF="Accesibilidad-Como-8.html#nfbtrans">NFBtrans</A>. </P>


<HR>
<A HREF="Accesibilidad-Como-2.html">Anterior</A>
<A HREF="Accesibilidad-Como-4.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc3">Indice</A>
</BODY>
</HTML>
