<HTML>
<HEAD>
<TITLE>Accesibilidad COMO: Problemas f&iacute;sicos</TITLE>
</HEAD>
<BODY>
<A HREF="Accesibilidad-Como-4.html">Anterior</A>
<A HREF="Accesibilidad-Como-6.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Problemas f&iacute;sicos</A></H2>


<P>Muchos de estos problemas tienen que considerarse individualmente. Las
necesidades del individuo, las formas en que puede generar una entrada y
otros factores var&iacute;an tanto que todo lo que este HOWTO puede ofrecer es un
conjunto general de indicaciones sobre software &uacute;til y experiencias. </P>

<H2><A NAME="ss5.1">5.1 Imposibilidad de usar un rat&oacute;n/puntero</A></H2>


<P>La movilidad limitada puede hacer dif&iacute;cil usar un rat&oacute;n.  Para algunas
personas, un dispositivo <CODE>trackball</CODE> puede ser una buena soluci&oacute;n, pero
para otras la &uacute;nica posibilidad como dispositivo de entrada es el teclado
(o incluso algo que simule un teclado). Para un uso normal de Linux, esto
no deber&iacute;a ser un problema (v&eacute;ase la secci&oacute;n 
<A HREF="#teclado">Configurar especialmente el teclado</A>), pero para los usuarios de X,
esto puede causar graves problemas bajo determinadas circunstancias. </P>
<P>Afortunadamente, el manejador de ventanas <CODE>fvwm</CODE> ha sido dise&ntilde;ado para
el uso sin puntero y la mayor&iacute;a de las cosas pueden hacerse as&iacute;. Yo mismo
lo hago as&iacute; cuando pierdo mi rat&oacute;n (¡no pregunte!) o sencillamente no
quiero usarlo. <CODE>Fvwm</CODE> est&aacute; incluido en todas las distribuciones Linux
que conozco. El uso de otros programas depender&aacute; de su capacidad para
aceptar pulsaciones de teclas. Muchos programas de X lo hacen para todas
las funciones. Otros muchos no. Los botones de rat&oacute;n persistentes, que se
supone que est&aacute;n presentes en la versi&oacute;n actual de X facilitan todo esto. </P>

<H3>Imposibilidad de usar un teclado</H3>


<P>La gente que no puede usar un teclado normalmente, puede a veces usarlo
mediante dispositivos especiales de adaptaci&oacute;n como punteros bucales. Esto
requiere una configuraci&oacute;n especial del teclado.  V&eacute;ase la secci&oacute;n 
<A HREF="#teclado">Configurar especialmente el teclado</A>. </P>

<H3>Otros dispositivos de entrada (s&oacute;lo sistema X Window) </H3>


<P>Para algunos, el teclado no se puede usar en absoluto, y solo est&aacute;n
disponibles dipositivos se&ntilde;aladores. En este caso, no hay posible soluci&oacute;n
para la consola Linux, y deber&aacute;n ser usadas las X.  Si se pudiese hacer
que la entrada de las X usase el dispositivo y el software correcto para
convertir la entrada del dispositivo se&ntilde;alador en caracteres (todav&iacute;a no
lo he visto) entonces cualquier dispositivo se&ntilde;alador podr&iacute;a ser usado sin
un teclado. </P>
<P>Hay un cierto n&uacute;mero de dispositivos que merecen ser considerados para tal
entrada, como pantallas t&aacute;ctiles, o punteros oculares.  Muchos de estos
necesitar&aacute;n que se escriba un manejador de dispositivo para ellos. Esto no
es terriblemente dif&iacute;cil si la documentaci&oacute;n necesaria est&aacute; disponible,
pero requiere a alguien con buen nivel de programaci&oacute;n en C. V&eacute;ase la
<B>Linux Kernel Hacker's Guide</B> y otro material de referencia sobre el
n&uacute;cleo para m&aacute;s informaci&oacute;n. Una vez listo, deber&iacute;a ser posible utilizar
estos dispositivos como un rat&oacute;n normal. </P>

<H3>Controlar hardware f&iacute;sico desde Linux</H3>


<P>El principal grupo de inter&eacute;s es el Linux Lab Project.  Generalmente, la
mayor parte del hardware GPIB (un interfaz est&aacute;ndar para el equipamiento
cient&iacute;fico, tambi&eacute;n conocido como el bus IEEE)  puede ser controlado. Esto
da mucho potencial a proyectos de accesibilidad muy ambiciosos. Por lo que
yo s&eacute;, todav&iacute;a no se ha intentado ninguno.</P>


<H2><A NAME="ss5.2">5.2 Reconocimiento de voz</A></H2>


<P>El reconocimiento de voz es una herramienta muy poderosa para habilitar el
uso del ordenador. Hay dos sistemas de reconocimiento de voz para Linux,
que yo conozca, <CODE>ears</CODE>, descrito como 'el reconocimiento no es &oacute;ptimo,
pero est&aacute; bien para jugar y ser&aacute; mejorado', y <CODE>AbbotDemo</CODE> 'un sistema
de reconocimiento de voz continua e independiente del usuario' que es
mucho m&aacute;s interesante, aunque no est&aacute; disponible para uso comercial sin un
acuerdo previo.  V&eacute;ase el Linux Software Map para m&aacute;s detalles (v&eacute;ase 
<A HREF="Accesibilidad-Como-7.html#doc">Documentoaci&oacute;n de Linux</A>). </P>


<H2><A NAME="teclado"></A> <A NAME="ss5.3">5.3 Configurar especialmente el teclado</A></H2>



<H3>Sistema X Window</H3>


<P>El &uacute;ltimo servidor X que viene con Linux incluye numerosas caracter&iacute;sticas
que pueden ayudar en la entrada de datos. Estas caracter&iacute;sticas incluyen
<CODE>StickKeys</CODE>, <CODE>MouseKeys</CODE>, <CODE>RepeatKeys</CODE>, <CODE>BounceKeys</CODE>,
<CODE>Slowkeys</CODE> y <CODE>TimeOut</CODE>. Estas permiten la adaptaci&oacute;n del teclado a
las necesidades del usuario.  Se proporcionan como parte de la extensi&oacute;n
XKB en versiones de X superiores a la 6.1. Para averiguar su versi&oacute;n y
comprobar si tiene la extensi&oacute;n instalada, puede probar</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        xdpyinfo -queryExtensions
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Librarse de la repetici&oacute;n autom&aacute;tica</H3>


<P>Para quitar la repetici&oacute;n de teclas en la consola de Linux ejecute el
siguiente comando (creo que tiene que ejecutarse una vez por consola;  un
buen sitio donde ponerlo ser&iacute;a en los ficheros de login, <CODE>.profile</CODE> o
<CODE>.login</CODE> del directorio propio). </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        setterm -repeat off
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para librarse de la repetici&oacute;n autom&aacute;tica en cualquier servidor X, se
puede usar el comando</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        xset -r
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>que se puede meter en el fichero que se ejecuta al iniciar las X (a veces
<CODE>.xsession</CODE> o <CODE>.xinit</CODE>) </P>
<P>Ambos comandos merecen ser investigados para encontrar m&aacute;s formas de
cambiar el comportamiento de la consola. </P>

<H3>Macros / Mucha entrada, pocas pulsaciones de teclas</H3>


<P>A veces en situaciones como esta, el mayor problema es la velocidad de
entrada de datos. Aqu&iacute; el objetivo primordial es conseguir el mayor n&uacute;mero
de comandos con el menor n&uacute;mero de teclas pulsadas.  Para usuarios de la
interfaz de comandos (<CODE>bash/tcsh</CODE>), se deber&iacute;a mirar las p&aacute;ginas
del manual, en particular la forma que tiene Linux de completar comandos y
nombres de ficheros (pulse la tecla <CODE>TAB</CODE> y el <CODE>bash</CODE> tratar&aacute; de
adivinar qu&eacute; viene despu&eacute;s).  Para informaci&oacute;n sobre macros que
proporcionan secuencias de comandos con solo pulsar una tecla, mire el
<B>Keystroke HOWTO</B>. </P>

<H3>Teclas persistentes</H3>


<P>Las teclas persistentes son una caracter&iacute;stica que permite a alguien que
solo pueda pulsar un bot&oacute;n a la vez, utilizar un teclado con todas las
teclas modificadoras como <CODE>SHIFT</CODE> y <CODE>CTRL</CODE>.  Estas teclas, en lugar
de tener que mantenerlas presionadas mientras se pulsa la otra tecla, se
convierten en algo como el <CODE>BLOQ MAYUS</CODE>, y se mantienen pulsadas solas,
mientras la otra tecla es pulsada. Entonces pueden liberarse o seguir
pulsadas, dependiendo de lo que se necesite.  Para informaci&oacute;n sobre c&oacute;mo
preparar esto, v&eacute;ase el <B>Linux Keyboard HOWTO</B>, especialmente la
secci&oacute;n 'Solo puedo usar un dedo para escribir' (secci&oacute;n 15 en la versi&oacute;n
que tengo yo).  - Informaci&oacute;n por Toby Reed. </P>


<HR>
<A HREF="Accesibilidad-Como-4.html">Anterior</A>
<A HREF="Accesibilidad-Como-6.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc5">Indice</A>
</BODY>
</HTML>
