<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Enlazando dos redes mediante PPP</TITLE>
 <LINK HREF="PPP-Como-23.html" REL=next>
 <LINK HREF="PPP-Como-21.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc22" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-23.html">Página siguiente</A>
<A HREF="PPP-Como-21.html">Página anterior</A>
<A HREF="PPP-Como.html#toc22">Índice general</A>
<HR>
<H2><A NAME="WAN"></A> <A NAME="s22">22. Enlazando dos redes mediante PPP</A></H2>

<P>No hay ninguna diferencia b&aacute;sica entre enlazar un s&oacute;lo PC Linux a un
servidor PPP y entrelazar dos redes locales utilizando PPP en una m&aacute;quina de
cada red local. Recuerde que PPP es un protocolo <B>entre iguales</B>, entre
parejas iguales.
<P>
<P>
<P>Sin embargo, usted necesita entender <B>DE MANERA PRECISA</B> c&oacute;mo se
establece el encaminamiento. Lea el c&oacute;mo RED-2 y la Gu&iacute;a del Administrador
de Redes en Linux (GARL). Tambi&eacute;n encontrar&aacute; de gran ayuda 
&quot; TCP/IP Network Administration&quot; (publicado por O'Reilly and 
Associates - ISBN 0-937175-82-X).
<P>
<P>Si va a haber direcciones IP de red local no conectada en cada lado del
enlace, deber&iacute;a leer el minihowto sub networking de Linux. Est&aacute; disponible
en <EM>Linux Sub networking mini-HOWTO</EM>
<CODE>
<A HREF="http://www.interweft.com.au/other/">http://www.interweft.com.au/other/</A></CODE>.
<P>
<P>Para enlazar dos redes locales, <B>debe</B> utilizar direcciones IP de red
distintas (o subredes con la misma direcci&oacute;n de red) y necesitar&aacute; utilizar
direcciones IP est&aacute;ticas - o utilizar enmascaramiento IP. Si desea utilizar
enmascaramiento IP, lea el mini-como de enmascaramiento IP para buscar
instrucciones para hacerlo funcionar.
<P>
<H2><A NAME="ss22.1">22.1 Configurando las direcciones IP.</A>
</H2>

<P>Acuerde con el administrador de red de la otra red local qu&eacute; direcciones IP
van a utilizarse para cada lado de la interfaz PPP. Si utiliza direcciones IP
est&aacute;ticas, esto tambi&eacute;n requerir&aacute; que marque un n&uacute;mero de tel&eacute;fono
espec&iacute;fico.
<P>
<P>Ahora edite el fichero <CODE>/etc/ppp/options[.ttyXX]</CODE> apropiado - es una
buena idea tener un m&oacute;dem y un puerto espec&iacute;fico en su ordenador para esta
conexi&oacute;n. Esto puede que requiera que cambie su fichero de opciones
<CODE>/etc/ppp/options</CODE> - y que cree los ficheros options.ttyXX para 
cualesquiera otras conexiones.
<P>
<P>Especifique las direcciones IP de su extremo de la conexi&oacute;n PPP con las
opciones adecuadas exactamente como se mostr&oacute; para las direcciones IP
est&aacute;ticas anteriormente.
<P>
<H2><A NAME="ss22.2">22.2 Configurando el encaminamiento</A>
</H2>

<P>Debe hacer que los paquetes de su red local se encaminen a trav&eacute;s de la
interfaz que establece la conexi&oacute;n PPP. Esto es un proceso de dos fases.
<P>
<P>Primero, necesitar&aacute; establecer un camino desde la m&aacute;quina que ejecute la
conexi&oacute;n PPP hasta la red remota. Si la conexi&oacute;n es a Internet, esto puede
manejarse con una ruta por defecto establecida por el propio pppd en su
extremo de conexi&oacute;n utilizando la opci&oacute;n 'defaultroute' con pppd.
<P>
<P>
<P>Si, sin embargo, la conexi&oacute;n entrelaza dos redes locales, entonces deber&aacute;
a&ntilde;adirse un camino espec&iacute;fico de red para cada red que sea accesible a
trav&eacute;s de la conexi&oacute;n. Esto se consigue utilizando la orden 'route' para
cada red existente en el script /etc/ppp/ip-up (ver Tras establecer la
conexi&oacute;n... para averiguar c&oacute;mo hacer esto).
<P>
<P>Lo segundo que necesita hacer es decir a los otros ordenadores de su red
local que su ordenador Linux es, realmente, la pasarela para la red situada
al otro lado del enlace ppp.
<P>
<P>Por supuesto, el administrador de la red remota tambi&eacute;n debe hacer esto. Sin
embargo, como el/ella encaminar&aacute; paquetes hacia nuestra red, ser&aacute; necesario
establecer un <B>camino espec&iacute;fico de red</B>, no un camino por defecto (a
menos que la red local remota se conecte con usted para acceder a Internet
mediante su conexi&oacute;n).
<P>
<H2><A NAME="ss22.3">22.3 Seguridad de red</A>
</H2>

<P>Si enlaza su red local a Internet utilizando PPP - o incluso solo si la
conecta a una red local &quot;extra&ntilde;a&quot;, necesitar&aacute; saber de temas de
seguridad. Le sugiero que piense en instalar un cortafuegos.
<P>
<P>Usted deber&iacute;a hablar con el administrador de su red local de <B>ANTES</B> de
que comience a conectar con redes locales extra&ntilde;as o con Internet de esta
manera. Un fallo a la hora de hacer esto podr&iacute;a producir desde que nada
funcionara hasta que todo fuera seriamente problem&aacute;tico.
<P>
<HR>
<A HREF="PPP-Como-23.html">Página siguiente</A>
<A HREF="PPP-Como-21.html">Página anterior</A>
<A HREF="PPP-Como.html#toc22">Índice general</A>
</BODY>
</HTML>
