<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Otros documentos &uacute;tiles/importantes</TITLE>
 <LINK HREF="PPP-Como-6.html" REL=next>
 <LINK HREF="PPP-Como-4.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-6.html">Página siguiente</A>
<A HREF="PPP-Como-4.html">Página anterior</A>
<A HREF="PPP-Como.html#toc5">Índice general</A>
<HR>
<H2><A NAME="s5">5. Otros documentos &uacute;tiles/importantes</A></H2>

<P>Se recomienda que los usuarios lean :-
<UL>
<LI>la documentaci&oacute;n incluida con el paquete PPP;</LI>
<LI>las p&aacute;ginas de manual de pppd y chat;<BR>
(utilice <CODE>man chat</CODE> y <CODE>man pppd</CODE> para explorarlas)</LI>
<LI>la Gu&iacute;a del Administrador de Redes con Linux (GARL);<BR>
ver <EM>P&aacute;gina oficial del proyecto LuCAS (Linux en Castellano)</EM>
<CODE>
<A HREF="http://lucas.ctv.es">http://lucas.ctv.es</A></CODE></LI>
<LI>los documentos Red2-COMO y Red3-COMO;<BR>
ver <EM>Linux NET-2/3-HOWTO</EM>
<CODE>
<A HREF="http://sunsite.unc.edu/mdw/HOWTO/NET-2-HOWTO.html">http://sunsite.unc.edu/mdw/HOWTO/NET-2-HOWTO.html</A></CODE></LI>
<LI>La documentaci&oacute;n del n&uacute;cleo situada en 
<CODE>/usr/src/linux/Documentation</CODE> tras instalar el c&oacute;digo fuente de
Linux;</LI>
<LI>La p&aacute;gina de configuraci&oacute;n del m&oacute;dem - ver <EM>Modem Setup
Information</EM>
<CODE>
<A HREF="http://www.in.net/info/modems/index.html">http://www.in.net/info/modems/index.html</A></CODE></LI>
<LI>Los excelentes libros de Unix/Linux publicados por O'Reilly and
Associates. Vea (<EM>O'Reilly and Associates On-Line Catalogue</EM>
<CODE>
<A HREF="http://www.ora.com/">http://www.ora.com/</A></CODE>).
Si usted es novato, <B>corra</B> (no vaya) a su librer&iacute;a inform&aacute;tica y
compre uno de estos libros inmediatamente.</LI>
<LI>El PUF-PPP mantenido por Al Longyear, disponible en <EM>Linux
PPP-FAQ</EM>
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/faqs">ftp://sunsite.unc.edu/pub/Linux/docs/faqs</A></CODE>.<BR>
Este documento contiene mucha informaci&oacute;n en formato pregunta/respuesta
que es muy &uacute;til a la hora de averiguar por qu&eacute; PPP no funciona
(adecuadamente).</LI>
<LI>El creciente n&uacute;mero de libros sobre Linux de muchas editoriales y
autores; <BR>
Le sugiero que compruebe la vigencia de estos libros. El desarrollo de
Linux y de las distribuciones tienden a evolucionar muy r&aacute;pido, mientras
que la actualizaci&oacute;n de los libros suele desarrollarse m&uacute;cho m&aacute;s despacio.
Comprar un libro excelente (y hay muchos) que est&aacute; anticuado puede causar
a los nuevos usuarios bastante confusi&oacute;n y mucha frustraci&oacute;n.</LI>
</UL>
<P>
<P>El mejor punto de partida a la hora de buscar documentaci&oacute;n para Linux es
<EM>la Web del Proyecto de Documentaci&oacute;n de Linux (LDP)</EM>
<CODE>
<A HREF="http://sunsite.unc.edu/mdw/">http://sunsite.unc.edu/mdw/</A></CODE>, o de su equivalente hispano
<EM>la Web del Proyecto LuCAS (Linux en Castellano)</EM>
<CODE>
<A HREF="http://lucas.ctv.es">http://lucas.ctv.es</A></CODE>.
Los documentos COMO tienden a ser revisados de manera peri&oacute;dica.
<P>
<P>Usted puede utilizar este documento para crear su conexi&oacute;n PPP sin
leer ninguno de los otros documentos, pero si los lee podr&aacute; comprender
mejor lo que sucede en su ordenador. Tambi&eacute;n podr&aacute; solucionar los
problemas usted mismo (o al menos podr&aacute; hacer preguntas m&aacute;s inteligentes
en los foros de noticias comp.os.linux... o las listas de correo sobre
Linux).
<P>
<P>Estos documentos (al igual que otros varios, incluyendo las referencias
relevantes) dan una explicaci&oacute;n adicional y m&aacute;s detallada a lo que se
expone en este documento HOWTO.
<P>
<P>Si conecta una red local a Internet v&iacute;a PPP, necesitar&aacute; tener una cantidad
considerable de conocimientos de redes TCP/IP. Adem&aacute;s de los documentos
anteriormente mencionados, encontrar&aacute; de gran ayuda los libros de O'Reilly 
<CODE>&quot;</CODE>TCP/IP Network Administration<CODE>&quot;</CODE> y
<CODE>&quot;</CODE>Building Internet Firewalls<CODE>&quot;</CODE>.
<P>
<H2><A NAME="ss5.1">5.1 Listas de correo &uacute;tiles</A>
</H2>

<P>Hay muchas listas de correo sobre Linux que funcionan como un medio de
comunicaci&oacute;n entre usuarios de niveles distintos. Suscr&iacute;base a una de ellas.
Le interesar&aacute; y contribuir&aacute; a su experiencia.
<P>
<P><B>Un consejo</B>: algunas listas de correo est&aacute;n especialmente dirigidas a
gente con alto nivel de conocimientos. Mientras que nadie se quejar&aacute; si
usted "esp&iacute;a" (se suscribe pero no env&iacute;a mensajes), es probable que se gane
comentarios despectivos (cuando no insultos) si usted env&iacute;a preguntas de
"novato" a listas inadecuadas.
<P>
<P>Esto no es debido a que los usuarios de alto nivel odien a los nuevos
usuarios, sino a que esas listas est&aacute;n ah&iacute; para gestionar temas de un
determinado nivel de dificultad.
<P>
<P>Desde aqu&iacute; se le anima a que se adhiera a las listas que permiten
suscripci&oacute;n p&uacute;blica, pero mantenga sus comentarios de acuerdo con el tema de
la lista.
<P>
<P>Un buen punto de partida para buscar listas de correo Linux es <EM>Linux
Mailing List Directory</EM>
<CODE>
<A HREF="http://summer.snu.ac.kr/~djshin/linux/mail-list/index.shtml">http://summer.snu.ac.kr/~djshin/linux/mail-list/index.shtml</A></CODE>.
<P>
<P>
<HR>
<A HREF="PPP-Como-6.html">Página siguiente</A>
<A HREF="PPP-Como-4.html">Página anterior</A>
<A HREF="PPP-Como.html#toc5">Índice general</A>
</BODY>
</HTML>
