<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Introducci&oacute;n</TITLE>
 <LINK HREF="PPP-Como-2.html" REL=next>

 <LINK HREF="PPP-Como.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="PPP-Como.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>

<P>PPP (el Protocolo Punto a Punto) es un mecanismo que sirve para crear y
ejecutar IP (el protocolo Internet) y otros protocolos de red a trav&eacute;s de
un enlace serie, que puede ser una conexi&oacute;n serie directa (utilizando un
cable m&oacute;dem-nulo), o a trav&eacute;s de un telnet o a trav&eacute;s de una conexi&oacute;n que
utiliza m&oacute;dems y l&iacute;neas telef&oacute;nicas (y por supuesto l&iacute;neas digitales
como RDSI).
<P>
<P>Utilizando PPP, usted puede conectar su PC Linux a un servidor PPP y
acceder a los recursos de la red a la que el servidor est&aacute; conectado
(casi) como si estuviera directamente conectado a esa red.
<P>
<P>Tambi&eacute;n puede configurar su PC Linux como un servidor PPP, por lo que
otros ordenadores podr&iacute;an entrar en el suyo y acceder a los recursos de
su PC local y su red.
<P>
<P>Como PPP es un sistema entre iguales, puede usar PPP en dos PCs Linux para
conectar dos redes (o una red local a Internet), creando una red de &aacute;rea
extensa (WAN).
<P>
<P>Una de las mayores diferencias entre PPP y una conexi&oacute;n Ethernet es, por
supuesto, la velocidad: una conexi&oacute;n Ethernet est&aacute;ndar funciona a una
velocidad m&aacute;xima te&oacute;rica de 10 Mbs (millones de bits por segundo),
mientras que un m&oacute;dem anal&oacute;gico funciona como mucho a 56 kbps (miles de
bits por segundo).
<P>
<P>Tambi&eacute;n, dependiendo del tipo de conexi&oacute;n PPP, pueden haber otras
limitaciones en el uso de algunas aplicaciones y servicios.
<P>
<H2><A NAME="ss1.1">1.1 Clientes y Servidores</A>
</H2>

<P>PPP es, estrictamente, un protocolo <B>entre iguales</B>; esto quiere decir
(t&eacute;cnicamente) que no hay diferencia entre la m&aacute;quina que accede y la
m&aacute;quina que es accedida. Sin embargo, para aclarar las cosas, es &uacute;til
pensar en t&eacute;rminos de <B>servidores</B> y <B>clientes</B>.
<P>
<P>Un ordenador ser&aacute; <B>cliente</B> cuando acceda a una m&aacute;quina para establecer
una conexi&oacute;n PPP. La m&aacute;quina a la que se conecta es el <B>servidor</B>.
<P>
<P>Cuando se configure una m&aacute;quina Linux para que reciba y controle
conexiones PPP entrantes, se estar&aacute; configurando un <B>servidor</B> PPP.
<P>
<P>Cualquier PC Linux puede ser tanto un servidor PPP como un cliente -
incluso simult&aacute;neamente si se tiene m&aacute;s de un puerto serie (y m&oacute;dems si
son necesarios). Como se coment&oacute; antes, una vez realizada la conexi&oacute;n, no
hay diferencia real entre clientes y servidores en lo que a PPP respecta.
<P>
<P>Este documento se refiere a la m&aacute;quina que inicia la llamada (que accede)
como el <B>CLIENTE</B>, mientras que la m&aacute;quina que contesta el tel&eacute;fono,
comprueba la autenticidad de la petici&oacute;n de entrada (usando nombres de
usuario, contrase&ntilde;as y posiblemente otros mecanismos) es denominada
<B>SERVIDOR</B>.
<P>
<P>El uso de PPP como cliente para conectar una o m&aacute;s m&aacute;quinas de un cierto
lugar a Internet es, probablemente, el uso en el que la mayor parte de la
gente est&aacute; interesada - es decir: utilizar su PC Linux como cliente.
<P>
<P>El procedimiento descrito en este documento le permitir&aacute; establecer y
automatizar su conexi&oacute;n a Internet.
<P>
<P>Este documento tambi&eacute;n le dar&aacute; consejos acerca de c&oacute;mo configurar su PC
Linux como <B>servidor</B> PPP y para interconectar dos redes locales (con
encaminamiento completo) utilizando PPP (esto es a lo que se denomina
frecuentemente ``establecer un enlace WAN'' - red de &aacute;rea extensa).
<P>
<H2><A NAME="ss1.2">1.2 Diferencias entre las distribuciones Linux</A>
</H2>

<P>Hay muchas distribuciones Linux distintas y todas ellas tienen su propia
idiosincrasia y distintas maneras de hacer las cosas.
<P>
<P>En particular, hay dos maneras distintas de inicializar un ordenador Linux
(o Unix), configurando sus interfaces y realizando otras tareas.
<P>
<P>Estas son la <B>inicializaci&oacute;n de sistema BSD</B> y la <B>inicializaci&oacute;n de
sistema System V</B>. Si pasa por un foro de noticias sobre Unix, podr&iacute;a
encontrarse con guerras de religi&oacute;n entre los partidarios de estos
sistemas. Si ese tipo de cosas le divierten, ¡puede pasar un buen rato si
se apunta a la pelea! 
<P>
<P>Posiblemente, las distribuciones m&aacute;s ampliamente extendidas son:
<P>
<UL>
<LI>Slackware<BR>
que usa la inicializaci&oacute;n de sistema estilo BSD</LI>
<LI>Red Hat (y su antiguo socio Caldera)<BR>
que usa la inicializaci&oacute;n de sistema SysV (aunque ligeramente modificada)</LI>
<LI>Debian<BR>
que usa la inicializaci&oacute;n de sistema SysV</LI>
</UL>
<P>
<P>El estilo BSD de inicializaci&oacute;n suele guardar los archivos de inicializaci&oacute;n
en <CODE>/etc/...</CODE> y esos archivos son:-
<P>
<HR>
<PRE>
 /etc/rc
 /etc/rc.local
 /etc/rc.serial
     (y posiblemente otros m&aacute;s)
</PRE>
<HR>
<P>
<P>En los &uacute;ltimos tiempos, algunos esquemas de inicializaci&oacute;n de sistema BSD
usan el directorio <CODE>/etc/rc.d...</CODE> para guardar los ficheros de
inicializaci&oacute;n en lugar de ponerlo todo bajo <CODE>/etc</CODE>.
<P>
<P>
<P>La inicializaci&oacute;n System V mantiene sus ficheros de inicializaci&oacute;n en
el directorio <CODE>/etc/...</CODE> o  <CODE>/etc/rc.d/...</CODE> y en varios
subdirectorios situados en este mismo directorio:-
<P>
<HR>
<PRE>
drwxr-xr-x   2 root     root         1024 Jul  6 15:12 init.d
-rwxr-xr-x   1 root     root         1776 Feb  9 05:01 rc
-rwxr-xr-x   1 root     root          820 Jan  2  1996 rc.local
-rwxr-xr-x   1 root     root         2567 Jul  5 20:30 rc.sysinit
drwxr-xr-x   2 root     root         1024 Jul  6 15:12 rc0.d
drwxr-xr-x   2 root     root         1024 Jul  6 15:12 rc1.d
drwxr-xr-x   2 root     root         1024 Jul  6 15:12 rc2.d
drwxr-xr-x   2 root     root         1024 Jul 18 18:07 rc3.d
drwxr-xr-x   2 root     root         1024 May 27  1995 rc4.d
drwxr-xr-x   2 root     root         1024 Jul  6 15:12 rc5.d
drwxr-xr-x   2 root     root         1024 Jul  6 15:12 rc6.d
</PRE>
<HR>
<P>
<P>Si intenta averiguar d&oacute;nde se configuran la interfaz Ethernet y las
rutas de red asociadas, deber&aacute; explorar estos ficheros buscando las
&oacute;rdenes que lo hacen.
<P>
<H2><A NAME="ss1.3">1.3 Herramientas de configuraci&oacute;n PPP espec&iacute;ficas de cada distribuci&oacute;n</A>
</H2>

<P>En algunas distribuciones (como Red Hat y Caldera), hay un sistema de
marcado PPP configurado bajo X-Window.  Este COMO no cubre esas
herramientas espec&iacute;ficas de distribuci&oacute;n. Si tiene problemas con ellas,
contacte con los autores.
<P>
<P>Para los usuarios de Red Hat, existe una <EM>Gu&iacute;a PPP Red Hat</EM>
<CODE>
<A HREF="http://www.interweft.com.au">http://www.interweft.com.au</A></CODE>
en el &aacute;rea de recursos de Linux y tambi&eacute;n en <EM>Red Hat Software</EM>
<CODE>
<A HREF="http://www.redhat.com">http://www.redhat.com</A></CODE>
en el &aacute;rea de servicio t&eacute;cnico.
<P>
<HR>
<A HREF="PPP-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="PPP-Como.html#toc1">Índice general</A>
</BODY>
</HTML>
