<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Si su servidor PPP utiliza PAP (Protocolo de Autentificaci&oacute;n de</TITLE>
 <LINK HREF="PPP-Como-14.html" REL=next>
 <LINK HREF="PPP-Como-12.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc13" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-14.html">Página siguiente</A>
<A HREF="PPP-Como-12.html">Página anterior</A>
<A HREF="PPP-Como.html#toc13">Índice general</A>
<HR>
<H2><A NAME="pap"></A> <A NAME="s13">13. Si su servidor PPP utiliza PAP (Protocolo de Autentificaci&oacute;n de</A>Contrase&ntilde;as)</H2>

<P>Si el servidor al que usted se conecta requiere autentificaci&oacute;n PAP o CHAP,
tiene que trabajar un poco m&aacute;s.
<P>
<P>A las opciones arriba indicadas, a&ntilde;ada las siguientes l&iacute;neas
<HR>
<PRE>
#
# obligar a que pppd utilice su nombre de usuario en el ISP como 'nombre
# de m&aacute;quina' durante el proceso de autentificaci&oacute;n
name &lt;su nombre de usuario en el ISP>    # debe editar esta l&iacute;nea
#
# Si est&aacute; ejecutando un *servidor* PPP y necesita obligar a PAP o CHAP
# quite el comentario a una de las siguientes l&iacute;neas. NO utilice estas
# l&iacute;neas si usted es un cliente que se conecta a un servidor PPP (aunque
# el servidor utilice PAP o CHAP) ya que esto obligar&aacute; al SERVIDOR a
# autentificarse ante su m&aacute;quina (lo que casi con toda seguridad no puede
# hacer - y har&aacute; que la conexi&oacute;n sea fallida).
#+chap
#+pap
#
# Si utiliza secretos ENCRIPTADOS en el fichero /etc/ppp/pap-secrets
# entonces quite el comentario a la l&iacute;nea siguiente.
# Nota: esto NO es lo mismo que utilizar contrase&ntilde;as encriptadas Micro$oft
# tal y como se puede configurar MS RAS en Windows NT.
#+papcrypt
</PRE>
<HR>
<P>
<H2><A NAME="ss13.1">13.1 Utilizando MSCHAP</A>
</H2>

<P>Microsoft Windows NT RAS puede configurarse para usar una variaci&oacute;n del
protocolo CHAP. En el paquete tar de c&oacute;digo fuente de PPP, encontrar&aacute; un
fichero denominado README.MSCHAP80 que trata sobre esto.
<P>
<P>Usted puede determinar si un servidor solicita autentificaci&oacute;n mediante
este protocolo habilitando el modo de depuraci&oacute;n para pppd. Si el servidor
solicita autentificaci&oacute;n MS CHAP, ver&aacute; l&iacute;neas como
<P>
<HR>
<PRE>
rcvd [LCP ConfReq id=0x2 &lt;asyncmap 0x0> &lt;auth chap 80> &lt;magic
0x46a3>]
</PRE>
<HR>
<P>
<P>La informaci&oacute;n importante es <B>auth chap 80</B>.
<P>
<P>Para hacer que utilice MS CHAP, necesitar&aacute; recompilar pppd para dar soporte
a esto. Por favor, lea las instrucciones en el fichero README.MSCHAP80 del
c&oacute;digo fuente para m&aacute;s instrucciones acerca de c&oacute;mo compilar y utilizar esta
variaci&oacute;n.
<P>
<P>Debe darse cuenta de que de momento este c&oacute;digo s&oacute;lo da soporte a clientes
PPP Linux que se conecten a un servidor MS Windows NT. <B>NO</B> permite que
un servidor PPP Linux utilice autentificaci&oacute;n MSCHAP80 con sus clientes.
<P>
<H2><A NAME="ss13.2">13.2 El fichero de secretos PAP/CHAP</A>
</H2>

<P>Si utiliza autentificaci&oacute;n pap o chap, tambi&eacute;n necesitar&aacute; crear un fichero
de secretos. Estos son:
<HR>
<PRE>
/etc/ppp/pap-secrets
/etc/ppp/chap-secrets
</PRE>
<HR>
<P>
<P>Deben pertenecer al usuario root, grupo root y tener permisos de fichero 740
por seguridad.
<P>
<P>Lo primero de lo que debe darse cuenta acerca de PAP y CHAP es que est&aacute;n
dise&ntilde;ados para autentificar <B>sistemas inform&aacute;ticos</B> y no <B>usuarios</B>.
<P>
<P>&quot;¿C&oacute;mo? ¿Cu&aacute;l es la diferencia?&quot; le escucho preguntar.
<P>
<P>Bien. Una vez que su ordenador ha realizado una conexi&oacute;n PPP con el
servidor, <B>CUALQUIER</B> usuario de su sistema puede utilizar esa conexi&oacute;n -
no s&oacute;lo usted. Esto es lo que le permite configurar un enlace de red de
&aacute;rea extensa (WAN) que interconecte dos redes locales utilizando PPP.
<P>
<P>PAP puede requerir autentificaci&oacute;n bidireccional (y CHAP <B>LA REQUIERE</B>) -
esto es: en cada ordenador son necesarios un nombre v&aacute;lido y un secreto 
para el otro ordenador implicado. Sin embargo, esta <B>NO</B> es la manera en
la que la mayor&iacute;a de los servidores PPP ofrecen conexiones PPP
autentificadas con PAP.
<P>
<P>Lo m&aacute;s probable es que su ISP le haya proporcionado un nombre de usuario y
una contrase&ntilde;a para permitirle conectar a su sistema y, una vez all&iacute;, a
Internet. Su ISP no est&aacute; en absoluto interesado en el nombre de su
ordenador, por lo que probablemente necesite utilizar el nombre de usuario
de su ISP como nombre de su ordenador.
<P>
<P>Esto se realiza utilizando la opci&oacute;n <CODE>name user name</CODE> de pppd. Por lo que
si va a utilizar como nombre de usuario el que su ISP le ha proporcionado,
a&ntilde;ada la l&iacute;nea
<P>
<HR>
<PRE>
name su_usuario nombre_en_el_ISP
</PRE>
<HR>
<P>a su fichero <CODE>/etc/ppp/options</CODE>.
<P>
<P>T&eacute;cnicamente, deber&iacute;a usar <CODE>user usuario nombre_en_su_ISP</CODE> para PAP, pero
pppd es lo suficientemente inteligente para interpretar <CODE>name</CODE> como
<CODE>user</CODE> si se utiliza PAP. La ventaja de utilizar <CODE>name</CODE> es que tambi&eacute;n
es v&aacute;lida para CHAP.
<P>
<P>Ya que PAP es para autentificar <B>ordenadores</B>, t&eacute;cnicamente necesita
tambi&eacute;n especificar un nombre de ordenador remoto. Sin embargo, como la
mayor&iacute;a de la gente s&oacute;lo tiene un ISP, puede utilizar un comod&iacute;n (*) como
nombre de m&aacute;quina remota en el fichero de secretos.
<P>
<P>Tambi&eacute;n es valioso recordar que muchos ISP funcionan con bancos m&uacute;ltiples de
m&oacute;dems conectados a servidores distintos - cada uno con un nombre
diferente, pero ACCEDIDOS desde un n&uacute;mero de tel&eacute;fono &uacute;nico. 
Puede ser a veces bastante dif&iacute;cil en algunas circunstancias saber en ese
momento cu&aacute;l es el nombre del ordenador remoto, ya que depende de a que
servidor de terminales est&eacute; usted conectado.
<P>
<H2><A NAME="ss13.3">13.3 El fichero de secretos PAP</A>
</H2>

<P>El fichero <CODE>/etc/ppp/pap-secrets</CODE> tiene este aspecto
<HR>
<PRE>
# Secretos para autentificaci&oacute;n utilizando PAP
# cliente        servidor       secreto      direcciones_IP_locales_aceptables
</PRE>
<HR>
<P>
<P>Los cuatro campos se delimitan con un espacio en blanco y el &uacute;ltimo puede
estar vac&iacute;o (lo que es deseable para una asignaci&oacute;n de IP din&aacute;mica de su
ISP).
<P>
<P>Supongamos que su ISP le ha proporcionado el nombre de usuario de <CODE>pedro</CODE>
y la contrase&ntilde;a de <CODE>picapiedra</CODE> por lo que establecer&iacute;a la opci&oacute;n
<CODE>name pedro</CODE> en <CODE>/etc/ppp/options[.ttySx]</CODE> y establecer&iacute;a su
fichero <CODE>/etc/ppp/pap-secrets</CODE> como sigue:
<P>
<HR>
<PRE>
# Secretos para la autentificaci&oacute;n utilizando PAP
# cliente       servidor      secreto      direcciones_IP_locales_aceptables
pedro     *   picapiedra
</PRE>
<HR>
<P>
<P>Esto hace que para el nombre de m&aacute;quina local <CODE>pedro</CODE> (el cual hemos
hecho que pppd use incluso aunque no sea nuestro nombre de m&aacute;quina local) y
para <B>CUALQUIER</B> servidor, se utilice la contrase&ntilde;a (secreto)
<CODE>picapiedra</CODE>.
<P>
<P>F&iacute;jese en que se necesita especificar una direcci&oacute;n local IP, a menos que
sea necesario FORZAR una direcci&oacute;n IP local y est&aacute;tica. Incluso aunque
intente hacer esto, no es probable que funcione en la mayor&iacute;a de servidores
PPP (por razones de seguridad) que no permiten que el sistema remoto
establezca la direcci&oacute;n IP que desea tener.
<P>
<H2><A NAME="ss13.4">13.4 El fichero de secretos CHAP</A>
</H2>

<P>Este m&eacute;todo requiere una autentificaci&oacute;n mutua - esto es: usted debe
permitir que su m&aacute;quina se autentifique ante el servidor <B>Y</B> que el
servidor se autentifique ante su m&aacute;quina.
<P>
<P>Por lo que, si su m&aacute;quina es <CODE>pedro</CODE> y la remota es <CODE>pablo</CODE>, en su
m&aacute;quina debe configurar <CODE>name pedro remotename pablo</CODE> y en la 
m&aacute;quina remota debe configurarse <CODE>name pablo nombreRemoto pedro</CODE> en
sus respectivos ficheros <CODE>/etc/ppp/options[.ttySx]</CODE>.
<P>
<P>El fichero <CODE>/etc/chap-secrets</CODE> de pedro tendr&iacute;a este aspecto
<HR>
<PRE>
# Secretos para autentificaci&oacute;n mediante CHAP
# cliente       servidor  secreto   direcciones_IP_locales_aceptables
pedro   pablo   picapiedra
pablo   pedro   marmol
</PRE>
<HR>
<P>
<P>y para pablo
<P>
<HR>
<PRE>
# Secretos para autentificaci&oacute;n mediante CHAP
# cliente       servidor  secreto   direcciones_IP_locales_aceptables
pablo   pedro   picapiedra
pedro   pablo   marmol
</PRE>
<HR>
<P>
<P>Fijese en que ambas m&aacute;quinas deben tener entradas para la autentificaci&oacute;n
bidireccional. Esto permite que la m&aacute;quina local se autentifique ante la
remota <B>Y</B> que la remota se autentifique ante la local.
<P>
<H2><A NAME="ss13.5">13.5 Manejar conexiones m&uacute;ltiples autentificadas con PAP</A>
</H2>

<P>Algunos usuarios tienen m&aacute;s de un servidor al que conectarse con PAP.
Si su nombre de usuario es distinto para cada m&aacute;quina a la que desea
conectarse no hay ning&uacute;n problema.
<P>
<P>Pero muchos usuarios tienen el mismo nombre de usuario en dos (o m&aacute;s -
incluso en todos) sistemas a los que se conecta. Esto entonces es un
problema a la hora de seleccionar la l&iacute;nea correcta de
<CODE>/etc/ppp/pap-secrets</CODE>
<P>
<P>Como podr&iacute;a imaginar, PPP da un mecanismo para solucionar esto. PPP permite
establecer un 'nombre asumido' para el servidor remoto de la conexi&oacute;n
utilizando la opci&oacute;n <B>remotename</B> de pppd.
<P>
<P>Supongamos que se conecta a dos servidores PPP utilizando como nombre de
usuario pedro. Debe establecer su fichero <CODE>/etc/ppp/pap-secrets</CODE> de
m&aacute;s o menos como sigue:
<P>
<HR>
<PRE>
pedro servidorppp1  pablo
pedro servidorppp2  wilma
</PRE>
<HR>
<P>
<P>Ahora, para conectarse al servidorppp1 deber&iacute;a utilizar <CODE>name pedro
remotename servidorppp1</CODE> en su ppp-optiones y para el servidorppp2
<CODE>name pedro remotename servidorppp2</CODE>.
<P>
<P>Como puede selecionar el fichero de opciones ppp a usar con pppd utilizando
la opci&oacute;n <CODE>file fichero</CODE>, puede establecer un script para conectarse
a cada uno de sus servidores PPP, escogiendo el fichero de opciones correcto
a utilizar, y una vez all&iacute; seleccionando la opci&oacute;n <CODE>remotename</CODE>
adecuada.
<P>
<HR>
<A HREF="PPP-Como-14.html">Página siguiente</A>
<A HREF="PPP-Como-12.html">Página anterior</A>
<A HREF="PPP-Como.html#toc13">Índice general</A>
</BODY>
</HTML>
