<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>``GNU Privacy Guard'' (GnuPG) Mini Como: Instalaci&oacute;n y configuraci&oacute;n</TITLE>
 <LINK HREF="GPG-Mini-Como-3.html" REL=next>
 <LINK HREF="GPG-Mini-Como-1.html" REL=previous>
 <LINK HREF="GPG-Mini-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="GPG-Mini-Como-3.html">Página siguiente</A>
<A HREF="GPG-Mini-Como-1.html">Página anterior</A>
<A HREF="GPG-Mini-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2. Instalaci&oacute;n y configuraci&oacute;n</A></H2>

<P>
<P>
<H2><A NAME="ss2.1">2.1 C&oacute;digo fuente de GnuPG</A>
</H2>

<P>
<P>El sitio oficial para para la distribuci&oacute;n de <CODE>GnuPG</CODE> es el sitio oficial de
GnuPG, 
<A HREF="ftp://ftp.guug.de/pub/gcrypt/gnupg/">ftp://ftp.guug.de/pub/gcrypt/gnupg/</A>.  En las p&aacute;ginas oficiales de
GnuPG, 
<A HREF="http://www.gnupg.org/download.html">http://www.gnupg.org/download.html</A> tambi&eacute;n se pueden encontrar enlaces
a r&eacute;plicas oficiales.
<P>Debido a restricciones legales no se permite bajar material criptogr&aacute;fico
desde servidores localizados en los EE.UU., a los no residentes en este pa&iacute;s.
En EE.UU. existen unas leyes que imponen restricciones a la exportaci&oacute;n de
c&oacute;digo criptogr&aacute;fico as&iacute; como de programas que los incluyan.  Por esta raz&oacute;n
PGP se encuentra siempre disponible en dos versiones:  una internacional y
otra para los EE.UU.  El c&oacute;digo fuente para la versi&oacute;n internacional fue
exportado en formato ascii imprimido en un libro.  A continuaci&oacute;n fue
escaneado en Europa (Oslo) y recompuesto.  Se puede obtener m&aacute;s informaci&oacute;n
al respecto en la p&aacute;gina internacional de PGP, 
<A HREF="http://www.pgpi.com/">http://www.pgpi.com/</A>.  La versi&oacute;n
internacional de PGP puede ser importada libremente a los EE.UU. siempre y
cuando no se vuelva a reexportar fuera de &eacute;stos.  Una vez se ha instalado una
versi&oacute;n de <CODE>GnuPG</CODE> o <CODE>PGP</CODE>, se deber&iacute;a verificar la firma digital que
acompa&ntilde;a al fichero (Ver 
<A HREF="GPG-Mini-Como-6.html#fyv">Firmar y Verificar</A>).
<P>
<H2><A NAME="ss2.2">2.2 Configuraci&oacute;n</A>
</H2>

<P>
<P>GnuPG se puede obtener como un paquete de binarios de Debian, 
<A HREF="http://www.debian.org/">http://www.debian.org/</A> (<CODE>.deb</CODE>), como
un paquete de binarios de RedHat, 
<A HREF="http://www.redhat.com/">http://www.redhat.com/</A> (<CODE>.rpm</CODE>), o en c&oacute;digo fuente.  Los paquetes
son archivos comprimidos de los ficheros binarios que se pueden instalar con
las correspondientes herramientas, seg&uacute;n la distribuci&oacute;n.  Si se necesita
instalar GnuPG en otros sistemas operativos, entonces lo debe compilar uno
mismo a partir de los fuentes.  Se agradece que quien compile un paquete de
instalaci&oacute;n para un sistema o arquitectura diferente, lo haga de dominio
p&uacute;blico.
<P>Dado que la mayor&iacute;a del desarrollo de GnuPG tiene lugar en m&aacute;quinas x86
bajo Linux (
<A HREF="http://www.linux.org/">http://www.linux.org/</A>,
la migraci&oacute;n a un sistema diferente no deber&iacute;a ser ning&uacute;n problema.  La lista
de sistemas operativos que est&aacute;n soportados por GnuPG se puede encontrar en las
p&aacute;ginas de GnuPG (
<A HREF="http://www.gnupg.org/">http://www.gnupg.org/</A>.  El procedimiento que se describe a continuaci&oacute;n
no es exclusivo de ninguna plataforma.  Este procedimiento se puede usar para
compilar e instalar GnuPG partiendo de un archivo comprimido del c&oacute;digo fuente
(<CODE>loquesea.tar.gz</CODE>).
<P>Descomprimir y desempaquetar el paquete del c&oacute;digo fuente con la orden (si
estamos usando GNU <CODE>tar</CODE>):
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ tar zxvf gnupg-?.?.?.tar.gz
</PRE>
</CODE></BLOCKQUOTE>
<P>El siguiente paso es cambiar al directorio que contenga el c&oacute;digo fuente,
y ejecutar el gui&oacute;n de configuraci&oacute;n:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ ./configure
</PRE>
</CODE></BLOCKQUOTE>
<P>Con este paso no deber&iacute;a suceder nada especial;  si ejecutamos
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ ./configure --help
</PRE>
</CODE></BLOCKQUOTE>
<P>se pueden ver las opciones de configuraci&oacute;n que existen para la compilaci&oacute;n.
Si durante la internacionalizaci&oacute;n (GET text) ocurriera alg&uacute;n problema, se
puede incluir una versi&oacute;n que venga con c&oacute;digo fuente, usando la opci&oacute;n
<P>
<BLOCKQUOTE><CODE>
<PRE>
--with-included-gettext
</PRE>
</CODE></BLOCKQUOTE>
<P>o desactivarla usando la opci&oacute;n
<P>
<BLOCKQUOTE><CODE>
<PRE>
--disable-NLS
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss2.3">2.3 Compilaci&oacute;n</A>
</H2>

<P>
<P>A continuaci&oacute;n, para empezar a compilar ejecutaremos la orden de
compilaci&oacute;n:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ make
</PRE>
</CODE></BLOCKQUOTE>
<P>Compilaci&oacute;n que deber&aacute; finalizar sin problemas.  Si ocurriera algo anormal, se
seguir&aacute;n los siguientes pasos (en el mismo orden en el que se describen aqu&iacute;):
Primero, intentar solucionarlo por uno mismo (haciendo uso de la
documentaci&oacute;n existente);  segundo, asegurarnos de que no es un error
conocido (comprobar el fichero <CODE>BUGS</CODE> en 
<A HREF="http://www.gnupg.org/">http://www.gnupg.org</A>.  Si estos pasos no
resuelven el problema, enviar la pregunta a la lista de correo de GnuPG (en
ingl&eacute;s) (ver 
<A HREF="GPG-Mini-Como-7.html#font">Fuentes de Informaci&oacute;n</A>).  Por si el
problema estuviera relacionado con la compilaci&oacute;n, se deber&iacute;a intentar <CODE>make
clean</CODE>, ejecutar <CODE>configure</CODE> de nuevo, e intentar otra vez la compilaci&oacute;n.
Si nada de esto soluciona el problema, es el momento de preocuparse de verdad.
<P>
<H2><A NAME="ss2.4">2.4 Instalaci&oacute;n</A>
</H2>

<P>
<P>Suponiendo que hayamos compilado el programa sin problemas, el siguiente
paso es instalarlo.  Para ello ejecutaremos la orden de instalaci&oacute;n:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ make install
</PRE>
</CODE></BLOCKQUOTE>
<P>que copiar&aacute; el programa y las p&aacute;ginas de manual en el directorio de
instalaci&oacute;n.  Si no hemos cambiado el directorio de instalaci&oacute;n cuando
ejecutamos <CODE>./configure</CODE>, &eacute;ste ser&aacute; <CODE>/usr/local/share/gnupg/</CODE>
por defecto.  Es posible encontrar este directorio en el fichero
<CODE>options.skel</CODE>.  Cuando se cambie <CODE>options.skel</CODE>, si se copia a
<CODE>~/.gnupg/options</CODE>, se usar&aacute;n los ajustes t&iacute;picos.  Al crear
<CODE>~/.gnupg/</CODE> la acci&oacute;n copiar deber&iacute;a ser autom&aacute;tica.  Todas las
opciones posibles est&aacute;n bien documentadas, y tratar de explicarlas aqu&iacute; no
ser&iacute;a de utilidad.
<P>Se puede ejecutar GnuPG como <I>suid</I> root.  De este modo el programa se
ejecutar&aacute; con todos los permisos que tiene el superusuario, y se excluye la
posibilidad de que ciertas partes del programa se guarden externamente y
puedan ser le&iacute;das por cualquiera.  Sin entrar a valorar los riesgos de
ejecutar el programa como superusuario, se deber&iacute;a alertar de los peligros
que conllevar&iacute;a un troyano, ya que &eacute;stos, si se est&aacute; ejecutando como
superusuario, pueden da&ntilde;ar todo el sistema.  Si por esta raz&oacute;n, o por
cualquier otra, se decide no ejecutar GnuPG como root, es posible desactivar
el aviso activando <CODE>no-secmem-warning</CODE> en <CODE>~/gnupg/options</CODE>.
<P>
<HR>
<A HREF="GPG-Mini-Como-3.html">Página siguiente</A>
<A HREF="GPG-Mini-Como-1.html">Página anterior</A>
<A HREF="GPG-Mini-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
