<HTML>
<HEAD>
<TITLE>Quake I&amp;II Mini Como: Quake II</TITLE>
</HEAD>
<BODY>
<A HREF="QuakeI-II-Como-3.html">Anterior</A>
<A HREF="QuakeI-II-Como-5.html">Siguiente</A>
<A HREF="QuakeI-II-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Quake II</A></H2>


<P>Para jugar al quake2 lo &uacute;nico que hace falta es el cd y el ejecutable,
osea que aunque tu disco duro est&eacute; lleno con un poco m&aacute;s de 800k que es lo
que ocupa el ejecutable puedes jugar. Lo &uacute;nico que hay que hacer es lo 
siguiente:</P>
<P>
<UL>
<LI>Lo primero, creamos un directorio <CODE>/usr/local/games/quake2</CODE>
(por ejemplo) y dentro de este un directorio <CODE>baseq2</CODE>.
</LI>
<LI>Copiamos el fichero <CODE>/mnt/cdrom/Install/Data/baseq2/pak0.pak</CODE>
a este directorio. Si se quiere jugar sin copiarlo se hace un enlace
simb&oacute;lico con 

<BLOCKQUOTE><CODE>
<PRE>
ln -s /mnt/cdrom/Install/Data/baseq2/pak0.pak /usr/local/games/quake2/baseq2
</PRE>
</CODE></BLOCKQUOTE>


Atenci&oacute;n que el <I>ficherito</I> s&oacute;lo ocupa 160 megas ;).
</LI>
<LI>Luego creamos el directorio <CODE>players</CODE> dentro del <CODE>baseq2</CODE>
y los directorios <CODE>male</CODE> y <CODE>female</CODE> dentro de este (osea que queda
algo as&iacute;:

<BLOCKQUOTE><CODE>
<PRE>
        quake2---|-baseq2---|-players---|-male
                                        |-female
</PRE>
</CODE></BLOCKQUOTE>
</LI>
<LI>Compiamos todos los ficheros que hay en 
<CODE>/mnt/cdrom/Install/Data/baseq2/players/male</CODE> en <CODE>male</CODE> y los
del <CODE>female</CODE> en <CODE>female</CODE>.
</LI>
<LI>Descomprimimos el <CODE>quake2-3.20-i386-unknown-linux2.0.tar.gz</CODE> en
el directorio <CODE>quake2</CODE>.</LI>
</UL>
</P>
<P>Y listo, ya podemos jugar. </P>
<P>Si no tiene la librer&iacute;as <CODE>MesaGL</CODE> instaladas tendr&aacute; que copiar la que
viene con el ejecutable a <CODE>/usr/local/lib</CODE> (por ejemplo) y poner
<CODE>ldconfig</CODE> como root (tiene que ser la version 2.6beta3 como m&iacute;nimo) e
instalar las librerias <CODE>glide</CODE> si va a usar una 3dfx (ver 
<A HREF="QuakeI-II-Como-2.html#3dfx">Configuraci&oacute;n de tarjetas aceleradoras</A>). </P>
<P>Si se va a jugar en la svga el fichero <CODE>quake2</CODE> tiene que estar
<CODE>setuid root</CODE> (con el ejecutable vienen un script para poner bien los
permisos), simplemente ponemos <CODE>./fixperms.sh</CODE> como root en el
directorio <CODE>quake2</CODE>).</P>
<P>Para arrancarlo usamos:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        ./quake2 +set vid_ref soft (para la svga)
        ./quake2 +set vid_ref softx (para las X)
        ./quake2 +set vid_ref gl (para jugar con 3dfx)
        ./quake2 +set vid_ref xgl (soporte para OpenGL,solo funciona en las X)
        ./quake2.3dfxgl (para usar el mini-port del OpenGL, solo en sistemas
con glibc, es decir RedHat 5.X o debian 2.0)
</PRE>
</CODE></BLOCKQUOTE>

Eso solo se hace la primera vez, luego con poner <CODE>./quake2</CODE> sirve.</P>

<H2><A NAME="ss4.1">4.1 Juego en Red</A></H2>


<P>Para jugar en red arrancamos el quake2, vamos al <CODE>menu multiplayer</CODE> y
le damos a <CODE>join network game</CODE>.</P>
<P>Hay dos opciones, <CODE>server list</CODE>, <CODE>update server list</CODE> y luego una
lista. Le damos a <CODE>server list</CODE> y a&ntilde;adimos las direcciones de servers
que queramos , luego le damos a <CODE>update server list</CODE> y nos saldr&aacute;n los
servers con la informaci&oacute;n en la lista, colocado por ping, de menor a
mayor.</P>
<P>Tambien puedemos jugar poniendo <CODE>+connect IP</CODE> desde la consola del
quake2 (que sale dandole a la tecla <CODE>º</CODE>). Previamente habremos
configurado nuestro jugador en <CODE>player config</CODE> (el nombre, el modelo,
la <I>skin</I>, el tipo de conexi&oacute;n y las opciones de descarga que se usan
para bajarse <I>skins</I>, mapas, sonidos y dem&aacute;s cosas de los servidores).</P>
<P>La mayoria de los servers usan lo mapas de deathmatch (q2dm*). En el quake 
ven&iacute;an en el cd, pero en el quake2 salieron despu&eacute;s con lo que si queremos
jugar en internet estamos obligados a baj&aacute;rnoslos.</P>
<P>Los mapas vienen en la versi&oacute;n 3.13, ocupan unos 10 megas, ver 
<A HREF="QuakeI-II-Como-2.html#soft">Software.</A>, que adem&aacute;s del ejecutable traen un
<CODE>pak1.pak</CODE> con los mapas de deathmatch).</P>
<P>Se instalan descomprimiendo el archivo en el directorio quake2, pero hay
que recordar que tenemos que instalar luego la versi&oacute;n 3.20 que es la que
usan los servidores (esta es la &uacute;ltima versi&oacute;n que ha salido hasta la
fecha, es recomendable tener siempre la &uacute;ltima versi&oacute;n y algunas veces
necesario :) ).</P>


<H2><A NAME="ss4.2">4.2 Principales Problemas</A></H2>


<P>Aparte de los del quake uno (que tambien pasan aqu&iacute;) un problema del quake
2 es:</P>
<P>
<UL>
<LI><CODE>Cuando juego como usuario y me conecto a un server el programa
termina ...</CODE>. Este es un problema de permisos, con una mala soluci&oacute;n ...
cuando juega en servers con modificaciones (como el <I>ctf2</I> o el
<I>Lithium II</I>) al conectar se reinicia el sistema de video, y si no esta
como root el quake2 "suelta" la id del root despu&eacute;s de iniciar el sonido y
el v&iacute;deo y se produce el problema de I/O perm. La &uacute;nica manera de que esto
no pase es jugando como root o usando <CODE>sudo</CODE>.
</LI>
</UL>

Nota: para jugar al quake2 en red NO necesita tener el Cd del quake, s&oacute;lo
tiene que tenerlo instalado (por supuesto, si est&aacute; jugando desde el cd
tendr&aacute; que meterlo ;) ).</P>


<H2><A NAME="ss4.3">4.3 Principales modificaciones.</A></H2>


<P>Al igual que para quake, para quake 2 hay muchas modificaciones, la m&aacute;s
extendida es el <I>Lithium II</I>, que a&ntilde;ade nuevas funcionalidades al quake
(como runas que te dan distintos poderes o el "hook"), de hecho la mayor 
parte de los servidores usan el <I>Lithium II</I>, pero para jugar en ellos
no hace falta ningun fichero extra. </P>
<P>Si queremos usar bots como en el quake los &uacute;nicos que conozco que 
funcionen en linux son los eraser (ver la url que hay en 
<A HREF="QuakeI-II-Como-3.html#ads">A&ntilde;adidos al quake.</A>) pero consumen muchos recursos (a&uacute;n as&iacute; se
pueden usar).</P>
<P>Otra modificaci&oacute;n que est&aacute; sustituyendo al ctf2 es el lmctf que es una
variaci&oacute;n de este con mapas m&aacute;s grandes.</P>
<P>El equivalente al <CODE>Team Fortress</CODE> del quake2 se llama <CODE>Weapons Factory</CODE>,
que se puede obtener de 
<A HREF="http://www.captured.com/weaponsfactory/">http://www.captured.com/weaponsfactory/</A>.</P>
<P>El <CODE>Rocket Arena 2</CODE> tambien est&aacute; disponible y se puede bajar de la misma
p&aacute;gina que el <CODE>Rocket Arena</CODE> para quake (ver 
<A HREF="QuakeI-II-Como-3.html#ads">A&ntilde;adidos al quake.</A>.</P>



<HR>
<A HREF="QuakeI-II-Como-3.html">Anterior</A>
<A HREF="QuakeI-II-Como-5.html">Siguiente</A>
<A HREF="QuakeI-II-Como.html#toc4">Indice</A>
</BODY>
</HTML>
