<HTML>
<HEAD>
<TITLE>Quake I&amp;II Mini Como: Problemas con las tarjetas aceleradoras.</TITLE>
</HEAD>
<BODY>
<A HREF="QuakeI-II-Como-5.html">Anterior</A>
<A HREF="QuakeI-II-Como-7.html">Siguiente</A>
<A HREF="QuakeI-II-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Problemas con las tarjetas aceleradoras.</A></H2>

<P>Hay una p&aacute;gina con una faq muy completa sobre las 3dfx en 
<A HREF="http://www.voodooextreme.com/3Fingers">www.voodooextreme.com/3Fingers</A>.
Tambien hay un programa llamado <CODE>GlideControl</CODE> disponible en 
<A HREF="http://www.ling.ed.ac.uk/~oliphant/gc">http://www.ling.ed.ac.uk/~oliphant/gc</A> muy &uacute;til para configurar los
par&aacute;metros de las 3dfx.
Los problemas m&aacute;s comunes suelen ser:</P>
<P>
<UL>
<LI> Los usuarios no pueden usar la tarjeta aceleradora: Esto se puede
solucionar instalando el <I>Device3Dfx</I>, que es un paquete que nos crea un
dispositivo <CODE>/dev/3dfx</CODE> y mediante la inserci&oacute;n de un m&oacute;dulo en el
kernel (<CODE>3dfx</CODE>) permite que los usuarios puedan acceder a la tarjeta
aceleradora. Asegurese si lo instala de que los permisos de <CODE>/dev/3dfx</CODE>
est&aacute;n correctamente puestos ( ejecute <CODE>chmod  666 /dev/3dfx </CODE> ). Este
paquete se puede encontrar en 
<A HREF="http://glide.xxedgexx.com/3DfxRPMS.html">http://glide.xxedgexx.com/3DfxRPMS.html</A>.</LI>
<LI> Cuando ejecuto el glquake me da un <I>core dump</I>:. El quake2 y el
glqwcl est&aacute;n disponibles para glibc, sin embargo el glquake no, esto crea
bastantes problemas a la hora de hacerlo funcionar. Si tiene una voodoo2 en
principio no deber&iacute;a tener problemas porque el propio paquete del Glide_V2
trae adem&aacute;s de las versiones de las librer&iacute;as para glibc las de libc5 (que se
instalan en <CODE>/usr/i486-linux-libc5/lib</CODE>), sin embargo el paquete de la
voodoo 1 no las trae, con lo que puede que tenga que bajarse la versi&oacute;n para
libc5, extraer las librer&iacute;as (si est&aacute; en rpm con el <CODE>mc</CODE> es muy sencillo
hacerlo, sino tendr&aacute; que usar el <CODE>rpm2cpio</CODE> o el <CODE>rpmget</CODE> ya que si lo
instala directamente con el <CODE>rpm</CODE> sobrescribir&aacute; las de la versi&oacute;n para
glibc) e instalarlas (en <CODE>/usr/i486-linux-libc5/lib</CODE>). Adem&aacute;s asegurese
de que en el fichero <CODE>/etc/ld.so.conf</CODE> aparece el directorio
<CODE>/usr/i486-linux-libc5/lib</CODE> y de que tiene instalado el paquete de
compatibilidad con la libc5 (libc-5.3.X-Y en redhat).
<BLOCKQUOTE><CODE>
<PRE>
¡asegurese si se baja este paquete de que lo est&aacute; cogiendo de una versi&oacute;n de
RedHat 5.X o del directorio /libc6 en caso de que lo est&eacute; cogiendo del contrib
de RedHat, sino le sobreescribir&aacute; las antiguas librer&iacute;as y no funcionar&aacute; el
sistema!
</PRE>
</CODE></BLOCKQUOTE>

Otra posible causa de error es que falte alguna librer&iacute;a en la ruta de
b&uacute;squeda del ejecutable, esto se puede comprobar mediante el comando <CODE>ldd
fichero</CODE>. Si por ejemplo al hacer <CODE>ldd glquake</CODE> le sale alguna librer&iacute;a
seguida de la linea <I>Not Found</I> ah&iacute; estar&aacute; el problema, asegurese de que
tiene esa librer&iacute;a instalada y que el directorio en el que est&aacute; dicha librer&iacute;a
aparece en el fichero <CODE>/etc/ld.so.conf</CODE>, si no lo est&aacute; a&ntilde;ada el
directorio y ejecute luego como root <CODE>ldconfig</CODE>.
</LI>
<LI> Cuando ejecuto el glquake me da el error <CODE>glquake: can't resolve symbol
'__register_frame_info'</CODE>. El glquake necesita las <CODE>MesaGL-2.6</CODE>, si no las
ten&iacute;a (vienen con el ejecutable del quake2) consulte la direcci&oacute;n de las
librerias en 
<A HREF="QuakeI-II-Como-2.html#soft">Software</A>, instalelas y ejecute ldconfig.
</LI>
<LI> El glquake/glqwcl/quake2 se ve muy oscuro. Ajuste el contraste de la
tarjeta, esto se hace mediante la variable de entorno <CODE>SST_GAMMA</CODE> en una
voodoo 1 y <CODE>SSTV2_GAMMA</CODE> en las voodoo 2, por ejemplo poniendo :
<BLOCKQUOTE><CODE>
<PRE>
[unscared][~]$ export SSTV2_GAMMA=1.70
</PRE>
</CODE></BLOCKQUOTE>

Otra opci&oacute;n es bajarse el programa <CODE>GlideControl</CODE> mencionado anteriormente
con el que puede cambiar la <I>gamma</I> de la tarjeta adem&aacute;s de otros
par&aacute;metros.
</LI>
<LI> Al jugar en linux obtengo menos fps que en windows: Bueno, las Mesa no
est&aacute;n todav&iacute;a lo suficientemente optimizadas, y en procesadores <I>lentos</I> no
dan un buen rendimiento. Una opci&oacute;n es probar el port de opengl que han
incluido los autores del quake como opci&oacute;n a las librer&iacute;as Mesa (se llama
<CODE>lib3dfxgl.so</CODE>). Para usarlo creese un fichero llamado glquake.3dfxgl y
meta en &eacute;l lo siguiente:
<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh
LD_PRELOAD=./lib3dfxgl.so ./glquake $*
</PRE>
</CODE></BLOCKQUOTE>

Para el quake world puede usar el <CODE>glqwcl.3dfxgl</CODE> que viene con el
<CODE>glqwcl</CODE> y en el quake2 puede especificar el miniport en las opciones de
video.
Otra opci&oacute;n es asegurarse de que la <CODE>libMesaGL.so.2</CODE> es un enlace a la
<CODE>libMesaGL.so.3</CODE>. La versi&oacute;n 3 est&aacute; bastante m&aacute;s optimizada que la 2.6 y el
rendimiento aumenta bastante, el problema es que el glquake necesita la
versi&oacute;n 2.6. Una soluci&oacute;n <I>chapucera</I> es hacer lo siguiente; lo primero
vemos donde est&aacute;n las librer&iacute;as y los ejecutables:
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][/usr/local/games/quake2]# ls -la libMesaGL.so*
lrwxrwxrwx  1 root  root     14 ene 18 19:30 libMesaGL.so -&gt; libMesaGL.so.2
lrwxrwxrwx  1 root  root     16 ene 18 19:30 libMesaGL.so.2 -&gt; libMesaGL.so.2.6
-rwxr-xr-x  1 root  root 897135 dic 26 14:43 libMesaGL.so.2.6
[root@unsCAred][~]# ls -la /usr/lib/libMesaGL.so.2
lrwxrwxrwx  1 root  root     12 ene 13 20:01 /usr/lib/libMesaGL.so.2 -&gt; libMesaGL.so
[root@unsCAred][~]# ls /usr/local/games/quake/glquake*
/usr/local/games/quake/glquake         /usr/local/games/quake/glquake.mesa
/usr/local/games/quake/glquake.3dfxgl
</PRE>
</CODE></BLOCKQUOTE>

ahora hacemos un script que borre el enlace de la libMesaGl.so.2,que  a&ntilde;ada en
el <CODE>path</CODE> de b&uacute;squeda el directorio /usr/local/games/quake2, que ejecute el
glquake y que deje todo como estaba.
Para usar las MesaGL:
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][~]# cat /usr/local/games/quake/glquake.mesa
#!/bin/sh
# Movemos la libreria para que no la carge:
mv /usr/lib/libMesaGL.so.2 /usr/lib/libMesaGL.so.2.tmp
# A&ntilde;adimos el directorio del quake2 a la ruta de b&uacute;squeda
LD_LIBRARY_PATH_OLD = $LD_LIBRARY_PATH
LD_LIBRARY_PATH=/usr/local/games/quake2
# Ejecutamos el glquake
./glquake $*
# Dejamos todo como estaba.
mv /usr/lib/libMesaGL.so.2.tmp /usr/lib/libMesaGL.so.2
LD_LIBRARY_PATH= $LS_LIBRARY_PATH_OLD
</PRE>
</CODE></BLOCKQUOTE>

Para el miniport de 3dfx:
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][~]# cat /usr/local/games/quake/glquake.3dfxgl 
#!/bin/sh

# This script preloads the lib3dfxgl.so library which overrides the functions
# present in libMesaGL.so.  This allows glquake to run using 3DFX's miniport
# and without Mesa 3-D.  Glide and X11 libraries have to be installed tho, 
# even tho GLQuake doesn't use X11, it's linked against it because Mesa 3-D
# requires them.
mv /usr/lib/libMesaGL.so.2 /usr/lib/libMesaGL.so.2.tmp

LD_LIBRARY_PATH_OLD= $LS_LIBRARY_PATH
LD_LIBRARY_PATH=/usr/local/games/quake2
LD_PRELOAD=./lib3dfxgl.so ./glquake $*
mv /usr/lib/libMesaGL.so.2.tmp /usr/lib/libMesaGL.so.2
LD_LIBRARY_PATH= $LS_LIBRARY_PATH_OLD
</PRE>
</CODE></BLOCKQUOTE>


El problema de hacer esto es que el script se tiene que ejecutar como root.
Una opci&oacute;n para hacer lo mismo pero sin necesidad de ser root es eliminar la 
<CODE>libMesaGL.so.2</CODE> de la ruta de b&uacute;squeda del ldconfig y ponerla en otro
directorio (por ejemplo en <CODE>/usr/local/lib/MesaGL</CODE>). Para que nos
funcionen los programas que necesitan las Mesa lo &uacute;nico que tenemos que hacer
es a&ntilde;adir la linea <CODE> export LD_LIBRARY_PATH=/usr/local/lib/MesaGL</CODE> en
el fichero <CODE>~/.bashrc</CODE> si usamos el <I>bash</I> como shell o la linea
<CODE> setenv LD_LIBRARY_PATH /usr/local/lib/MesaGL</CODE> en el .cshrc/.tcsh si
usamos <I>csh/tcsh</I>. Haciendo esto tendr&iacute;amos lo siguiente:
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][~]# cd /usr/local/lib/MesaGL/
[root@unsCAred][/usr/local/lib/MesaGL]# ls -la libMesaGL.so.2 
lrwxrwxrwx   1 root  root 23 ene 22 21:19 libMesaGL.so.2 -&gt; /usr/lib/libMesaGL.so.3
</PRE>
</CODE></BLOCKQUOTE>

Ahora ya podemos eliminar las lineas que llevan un <I>mv</I> de los scripts 
<CODE>glquake.mesa</CODE> y <CODE>glquake.3dfx</CODE> con lo que ya no es necesario ser 
root para que funcione.

</LI>
<LI> No me funciona el rat&oacute;n: Las <CODE>3dfx</CODE> y el <CODE>gpm</CODE> no se llevan bien
, en el README viene bastante claro que para que funcione el rat&oacute;n con las
tarjetas aceleradoras hay que mat&aacute;r el gpm antes. Para hacerlo solo que
ejecutar un <CODE>killall gpm</CODE> como root (o un <CODE>gpm -k</CODE>>. Tambien se puede
hacer mediante la orden <CODE>/etc/rc.d/init.d/gpm stop</CODE> y reiniciarlo con
<CODE>/etc/rc.d/inid.d/gpm start</CODE> (esto para redhat, en otras distribuciones
puede variar ligeramente el directorio <CODE>stat.d</CODE> ); Este sistema es el m&aacute;s
recomendable. 
</LI>
</UL>
</P>

<HR>
<A HREF="QuakeI-II-Como-5.html">Anterior</A>
<A HREF="QuakeI-II-Como-7.html">Siguiente</A>
<A HREF="QuakeI-II-Como.html#toc6">Indice</A>
</BODY>
</HTML>
