<HTML>
<HEAD>
<TITLE>Quake I&amp;II Mini Como: Quake :</TITLE>
</HEAD>
<BODY>
<A HREF="QuakeI-II-Como-2.html">Anterior</A>
<A HREF="QuakeI-II-Como-4.html">Siguiente</A>
<A HREF="QuakeI-II-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Quake :</A></H2>

<P>Bueno, se acabaron las configuraciones, ahora toca jugar :)</P>
<P>Necesitamos los archivos <CODE>pak0.pak</CODE> (para la share) y el <CODE>pak0.pak</CODE>
y <CODE>pak1.pak</CODE> para la registrada. Si tenemos el quake ya instalado en 
otra partici&oacute;n (por ejemplo en windows) no hace falta copiarlos a la 
partici&oacute;n linux, podemos usar enlaces simb&oacute;licos, lo &uacute;nico que tenemos que 
hacer es montar la particion de windows, por ejemplo en <CODE>/mnt/dos</CODE>. </P>
<P>Vamos a instalar el quake en <CODE>/usr/local/games/quake</CODE> (se puede
instalar en cualquier sitio). </P>
<P>
<UL>
<LI>Lo primero es crear ese directorio (<CODE>mkdir /usr/local/games/quake</CODE>). Un vez hecho eso creamos el directorio 
<CODE>id1</CODE> (a partir de ahora todos los directorios van referenciados al
<CODE>/usr/local/games/quake</CODE>) dentro del directorio quake.
</LI>
<LI>Copiamos el <CODE>pak0.pak</CODE> y el <CODE>pak1.pak</CODE> al directorio <CODE>id</CODE>
(si lo hacemos con enlaces simb&oacute;licos, y suponiendo que tenemos la
partici&oacute;n donde est&aacute; el <CODE>pak0.pak</CODE> y el <CODE>pak1.pak</CODE> montada en
<CODE>/mnt/dos</CODE> ponemos como root:

<BLOCKQUOTE><CODE>
<PRE>
ln -s /mnt/dos/[ruta_al_quake]/quake/id/pak* /usr/local/games/quake/id
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Descomprimimos el ejecutable para linux en
<CODE>/usr/local/games/quake</CODE>.
</LI>
<LI>Y ahora ... a jugar, ya no hace falta nada m&aacute;s ... vamos al 
directorio <CODE>/usr/local/games/quake</CODE> y ponemos <CODE>./squake</CODE> (o 
<CODE>xquake</CODE> si estamos en las X) y cruzamos los dedos. Si todo a ido bien 
ya est&aacute; funcionando el quake. Si usamos una tarjeta aceleradora ejecutaremos 
<CODE>./glquake</CODE>.</LI>
</UL>
</P>
<P>Para cambiar la resoluci&oacute;n de la pantalla se usan dos comandos, nos 
ponemos en la consola del quake y ponemos <CODE>vid_describemodes</CODE> que nos 
da una descripci&oacute;n de todos los modos de video posible (cada uno con un
n&uacute;mero).</P>
<P>Ah&iacute; luego ponemos <CODE>vid_mode N</CODE> siendo <CODE>N</CODE> el n&uacute;mero que corresponde
a la resoluci&oacute;n que queremos. Esto no funciona con las tarjetas aceleradoras,
para cambiar la resoluci&oacute;n en ellas hay que especificarlo en el arranque
mediate los par&aacute;metros <CODE>-width ANCHO -height ALTO</CODE>, sino arrancar&aacute; por
defecto en 640x480 (otra resoluci&oacute;n muy utilizada es 512x384).</P>
<P>Si queremos medir los <I>fps</I> a una resoluci&oacute;n podemos hacerlo con
<CODE>timedemo demo1</CODE> desde consola, que intenta ejecutar lo m&aacute;s r&aacute;pido
posible la <CODE>demo1</CODE> y nos dice los <I>fps</I>.</P>
<P>Si queremos comprobar los <I>fps</I> durante el juego lo podemos hacer
con <CODE>timerefresh</CODE> (pero depende de la parte de la fase en la que 
nos encontremos).</P>

<H2><A NAME="ss3.1">3.1 Principales problemas:</A></H2>


<P>Pueden ser:</P>
<P>
<UL>
<LI> La tarjeta de sonido no est&aacute; configurada y hemos intentado arrancar 
con sonido. Soluci&oacute;n: arrancamos con <CODE>./squake -nosound</CODE>.
</LI>
<LI> No tenemos puesto el <CODE>HOSTNAME</CODE>. Soluci&oacute;n: editamos el fichero 
<CODE>/etc/hosts</CODE> y a&ntilde;adimos el nombre de nuestra m&aacute;quina, por ejemplo:

<BLOCKQUOTE><CODE>
<PRE>
127.0.0.1       localhost       localhost.localdomain        unsCAred
</PRE>
</CODE></BLOCKQUOTE>


y nos aseguramos de que en <CODE>/etc/HOSTNAME</CODE> pone unsCAred (en mi 
caso claro ;) )
</LI>
<LI><CODE>can't get I/O permisions</CODE>. El squake necesita ser
<I>setuid root</I> , ejecutamos como root 

<BLOCKQUOTE><CODE>
<PRE>
chown root.root squake
chmod 4755 squake/ 
</PRE>
</CODE></BLOCKQUOTE>


(No me responsabilizo de nada que pase por tener el ejecutable 
<I>setuid</I>) (No se asuste!!!, esto tiene problemas de seguridad, si es la
m&aacute;quina de casa no se te va a romper el ordenador ni nada parecido,
simplemente, la svga no es muy segura en cuanto a <I>seguridad del 
sistema</I> se refiere).
</LI>
<LI>No nos arranca en las X. Soluci&oacute;n arrancamos el servidor a 8 bits de
profundidad de color con (<CODE>startx -bpp 8</CODE>).
</LI>
</UL>
</P>


<H2><A NAME="ss3.2">3.2 Juego en Red (Quake World).</A></H2>


<P>El quake es un buen juego, pero cuando de verdad sorprende y crea adicci&oacute;n 
es cuando se juega en red. No es lo mismo matar a un monstruo en mitad de 
un nivel que a tu amigo <I>pukka</I> (con lo segundo disfrutas ;) ).</P>
<P>Cambia totalmente tu visi&oacute;n del juego y la manera de jugar, los 
movimientos se aceleran en un 200%. Para jugar en red lo &uacute;nico que
necesita es una conexi&oacute;n a internet o a una LAN. </P>
<P>En la p&aacute;gina de quake en linux ( ver 
<A HREF="QuakeI-II-Como-2.html#soft">Software.</A>) se 
puede encontrar un ejecutable que se llama <CODE>qwcl</CODE>. Esto es el cliente
de QuakeWorld, que no es m&aacute;s que una mejora de la engine de red del quake 
(solo sirve para jugar en red) con algunos a&ntilde;adidos, como el poder 
"cambiar" de piel o uniforme.</P>
<P>Se puede jugar en red con el quake normal, pero la mejora con el <I>qw</I> es 
muy notable, de hecho, es muy raro encontrar servers de quake normal en 
internet, lo normal es que sean de quakeworld. </P>
<P>Una herramienta muy &uacute;til para jugar en internet es el <CODE>qspy</CODE> o el 
<CODE>quickspy</CODE> (para consola) que consiste en un programa que localiza 
servers de quake world y nos dice cuantas personas hay, el ping, etc. </P>
<P>Hace poco ha salido el <CODE>xqf</CODE> que es un magn&iacute;fico interface para el
<CODE>qspy</CODE> hecho con gtk (para las X), se puede bajar de <CODE>
<A HREF="http://www.botik.ru/~roma/quake">www.botik.ru/~roma/quake</A></CODE></P>
<P>Para instalar el qw lo &uacute;nico que hay que hacer es descomprimir el archivo 
<CODE>qwcl</CODE> en el directorio <CODE>/usr/local/games/quake</CODE> y poner 
<CODE>./qwcl +connect IP</CODE> siendo IP la direcci&oacute;n en donde queremos jugar
(ver 
<A HREF="QuakeI-II-Como-7.html#servers">Servidores espa&ntilde;oles de quake</A>).</P>
<P>Lo mejor es tener la &uacute;ltima versi&oacute;n del qw (actualmente la 2.30) y la 
anterior ya que algunos server no se han actualizado a&uacute;n.</P>
<P>Si se tiene una tarjeta aceleradora necesitar&aacute; el <CODE>glqwcl</CODE>. Para indicarle
la resoluci&oacute;n de pantalla se hace como en el <CODE>glquake</CODE> mediante los
par&aacute;metros <CODE>-width ANCHO -height ALTO</CODE>.</P>
<P>El par&aacute;metro <CODE>rate XXXX</CODE> controla el numero de <I>bps</I> que recibimos 
del servidor adem&aacute;s del n&uacute;mero de <I>fps</I>. Para un modem de 33.6 el 
par&aacute;metro &oacute;ptimo es de 3000, para un 28.8 de 2500. </P>


<H2><A NAME="ads"></A> <A NAME="ss3.3">3.3 A&ntilde;adidos al quake.</A></H2>


<P>Uno de los principales factores que han hecho al quake un juego "de culto" 
es ademas de su excelente modo de red el que se le puedan a&ntilde;adir 
variaciones f&aacute;cilmente. </P>
<P>Puede a&ntilde;adirle nuevas armas, nuevos montruos, nuevos niveles, incluso 
nuevos "juegos". El m&aacute;s popular es el <CODE>Capture the Flag</CODE>, que divide a
todos los jugadores en dos equipos (es para jugar en red) y le da a cada
uno una bandera y una base, la misi&oacute;n de cada equipo es capturar la
bandera del otro y llevarla a su base, siempre y cuando no lo capturen la
suya. La mayor&iacute;a de los patches o modificaciones se instalan igual.
Supongamos el ctf. Los pasos para instalarlo son.</P>
<P>
<OL>
<LI>Se crea el directorio <CODE>/usr/local/games/quake/ctf</CODE></LI>
<LI>Se descomprimen los ficheros del ctf en ese directorio.
</LI>
<LI>Desde el directorio quake se pone <CODE>./squake -game ctf</CODE>.</LI>
</OL>
</P>
<P>Sin duda alguna la mejor variaci&oacute;n que se ha hecho del quake son los bots, 
osea robots dotados de inteligencia artificial para simular el juego en 
red con <I>humanos</I>. Los mejores son el omicron (por lo menos es el que
m&aacute;s me gusta a mi ;) ) y el reaperbot (una lista completa de los bots, con
puntuaciones a cada uno y comentarios se puede encontrar en <CODE>
<A HREF="http://www.ionet.net/~mimpchnk">www.ionet.net/~mimpchnk</A></CODE>)</P>
<P>Otra variaci&oacute;n muy interesante es el <CODE>Team Fortress</CODE> que se puede 
encontrar en <CODE>
<A HREF="http://www.planetfortress.com/teamfortress/">www.planetfortress.com/teamfortress</A>></CODE>. Es b&aacute;sicamente el
<CODE>ctf</CODE> solo que podemos elegir distintos <I>caracteres</I> cada uno con
funciones y armas diferentes. En este mod es donde menos importa las
diferencias de ping y donde m&aacute;s se juega en equipo.</P>
<P>El <CODE>Rocket Arena</CODE> es otra variaci&oacute;n del quake, el argunmento es muy simple,
<I>dos entran, uno sale</I>, osea, son combates uno contra uno en mapas
especiales, los dos jugadores salen con todas las armas y armaduras y el que
mate al otro se queda y sigue jugando contra el siguiente contrincante.
Tambien se pueden configurar los servidores para poder jugar por equipos. Se
puede obtener de 
<A HREF="http://www.planetquake.com/servers/arena/">http://www.planetquake.com/servers/arena/</A>.</P>


<HR>
<A HREF="QuakeI-II-Como-2.html">Anterior</A>
<A HREF="QuakeI-II-Como-4.html">Siguiente</A>
<A HREF="QuakeI-II-Como.html#toc3">Indice</A>
</BODY>
</HTML>
