<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="es">
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <TITLE>LinuxFocus Noviembre 1997  PGP en Linux</TITLE>
 <META name="Author" CONTENT="Miguel Angel Sepulveda">
 <META name="Keywords" CONTENT="linux magazine opengl povray photoshop gimp">
 <META name="Description" CONTENT="Free online magazine on Linux for users and developers">
 <META name="Copyright" CONTENT="&copy; 1998 LinuxFocus">
 <META name="Translator" CONTENT="">
 <META name="Date" CONTENT="1998-02-91T00:00:00Z">


</HEAD>

<BODY bgcolor="#FFFFFF" text="#000000" link="#ff0033" vlink="#FF3333">

  <MAP name="navegator">
  <AREA shape="rect" coords="0, 0, 65, 28" alt="Hogar" href="../">
  <AREA shape="rect" coords="66, 0, 124, 28" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="125, 0, 193, 28" alt="Busqueda" href="../search.html">
  <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
  <AREA shape="rect" coords="261, 0, 350, 28" alt="Sobre Nosotros" href="../aboutus.html">
  </MAP>



 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0">

 <THEAD>
   <TR align="center">
      <TD colspan="2"><IMG src="../../common/images/border-short.jpg" width="407" height="88"></TD>
   </TR>

   <TR align="center">
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/November1997/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28"></TD>
   </TR>

   <TR align="center">
     <TD colspan="2">     
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5">
		<TR bgcolor="#000000">
		   <TD align="center">
               <A href="../News/index.html"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Noticias</B></FONT></A>
               <A href="../Archives/index.html"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Archivos</B></FONT></A>
               <A href="../Companies/index.html"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Compa&ntilde;ias</B></FONT></A>
               <A href="../Tips/index.html"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Consejos y Trucos &nbsp;</B></FONT></A> 
               </TD>
            </TR>
            
		<TR>
            <!--   Here goes the Title of the article, authors name and abstract -->
		   <TD align="center">
 			<FONT face="Helvetica,Arial" color="#660066"><H1>Pretty-Good-Privacy en Linux</H1></FONT>
 			<FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:alogo@mx2.redestb.es"><FONT color="#000000">Angel Lopez</FONT></A></H3></FONT>
                  <HR size="2" noshade>
	         </TD>
            </TR>

           </TABLE>

     </TD>
   </TR>

 </THEAD>



 <TBODY>
  
 <TR>
    <TD valign="top">
<H4><A HREF="#intro">Introducci&oacute;n</A></H4>
<H4><A HREF="#cripto">Criptografia de Llave P&uacute;blica</A></H4>
<H4><A HREF="#versiones">Versiones de PGP</A></H4>
<H4><A HREF="#instalacion">Instalaci&oacute;n</A></H4>
<H4><A HREF="#config">Configuraci&oacute;n</A></H4>
<H4><A HREF="#creacion">Haciendo Llaves</A></H4>
<H4><A HREF="#a&ntilde;adiendo">A&ntilde;adiendo Llaves</A></H4>
<H4><A HREF="#quitando">Eliminando Llaves</A></H4>
<H4><A HREF="#extrayendo">Extra&ntilde;endo Llaves</A></H4>
<H4><A HREF="#contenido">Contenido del Llavero</A></H4>
<H4><A HREF="#encriptando">Codificando Mensajes</A></H4>
<H4><A HREF="#mensaje">Extra&ntilde;endo Mensajes</A></H4>
<H4><A HREF="#firma">Firmando Mensajes</A></H4>
<H4><A HREF="#desencriptando">Descrifrando Mensajes</A></H4>
<H4><A HREF="#ficheros">Usando ficheros de texto</A></H4>
<H4><A HREF="#huellas">Huellas digitales</A></H4>
<H4><A HREF="#shells">Shells</A></H4>
<H4><A HREF="#integracion">Integraci&oacute;n con lectores de correo</A></H4>


    </TD>
   
    <TD align="center">
       <TABLE border="0" width="80%" cellspacing="0" cellpadding="0">
	  <TR>
          <TD>

<A NAME="intro"></A>
<H3><FONT face="Helvetica,Arial" color="#660033">Introducci&oacute;n</FONT></H3>



<p>PGP son las siglas de Pretty Good Privacy; con ellas se hace

referencia a la aplicaci&oacute;n criptogr&aacute;fica m&aacute;s popular entre toda la

comunidad inform&aacute;tica.</p>



<p>Con PGP obtenemos la herramienta adecuada para asegurar la

privacidad y la autentificaci&oacute;n de la informaci&oacute;n en redes de

comunicaciones inseguras como puede ser Internet.</p>



<p>Con la <b>privacidad</b> conseguimos que &uacute;nicamente el destinatario de la

informaci&oacute;n pueda hacer uso de ella. Si esta informaci&oacute;n

cayera en manos de otra persona le resultar&iacute;a totalmente in&uacute;til ya 

que no podr&iacute;a desencriptarla.</p>



<p>Con la <b>autentificaci&oacute;n</b> se puede asegurar que una cierta informaci&oacute;n

generada por una persona proviene efectivamente de ella y no ha sido manipulada o 

falsificada por ninguna otra.</p>



<p>El PGP se basa en un sistema criptogr&aacute;fico conocido como de <i>llave

p&uacute;blica</i>, que puede ser usado en canales inseguros, lo que le hace 

perfecto para asegurar la privacidad de la informaci&oacute;n que es transmitida 

por redes como Internet.</p>



<p>No hace falta estar involucrado en una trama de espionaje industrial :) para

querer privacidad en tus comunicaciones y por tanto tener necesidad de usar

una herramienta criptogr&aacute;fica. Algo tan simple y &uacute;til como el E-Mail puede

ser la raz&oacute;n perfecta para comenzar a usar PGP. Veamos por qu&eacute;:



<dl>

<dd>Podemos comparar al E-Mail con las postales. Todo el mundo por cuyas manos

pasa una postal puede leerla, ya que no hay ning&uacute;n obst&aacute;culo f&iacute;sico para

ello. En cambio, con una carta dentro de un sobre obtenemos m&aacute;s privacidad.

La gente maneja el sobre, pero no ve la carta, y si quiere leer la carta

debe romper el sobre.<br>



<dd>Podemos hacer una analog&iacute;a entre el sobre de nuestras cartas y PGP, que

actuar&iacute;a como el sobre de nuestro E-Mail, ya que no permite que nadie

excepto el receptor leg&iacute;timo del mismo pueda leerlo; esta es una de las

muchas ventajas que, como m&aacute;s adelante veremos, tiene usar PGP.

</dl></p>


<A NAME="cripto"></A>

<H3><FONT face="Helvetica,Arial" color="#660033">C&oacute;mo funciona la criptograf&iacute;a de llave

     p&uacute;blica</FONT></H3>






<p>En sistemas de llave p&uacute;blica, cada persona tiene dos llaves que son 

complementarias entre s&iacute;, una es la llave p&uacute;blica y otra la llave privada.</p>



<p>La llave p&uacute;blica puede y debe ser difundida libremente, ya que ser&aacute;

con ella con la que el resto de personas podr&aacute;n enviarte informaci&oacute;n

de manera privada.  A trav&eacute;s de la llave p&uacute;blica no se pone en peligro

la privacidad de tu llave privada.</p>



<p>Supongamos dos amigos, Juan y Pedro. Juan podr&aacute; enviar informaci&oacute;n

privada a Pedro si conoce su llave p&uacute;blica. Por otro lado, Pedro podr&aacute;

desencriptar el mensaje que le ha enviado Juan con su propia llave

privada. Supongamos que hay otra persona, Marcos, que intercepta el

mensaje que ha enviado Juan a Pedro, pues bien, Marcos no va a poder

hacer nada con ese mensaje porque desconoce la llave privada de

Pedro. Incluso Juan que es quien ha generado el mensaje no puede

desencriptarlo, &uacute;nicamente podr&aacute; hacerlo Pedro.</p>



<p><i>La seguridad del sistema se basa en que cada uno guarde su llave privada,

aunque la llave p&uacute;blica pueda ser ampliamente conocida</i>. Si alguien se plantease romper

el sistema desconociendo la llave privada del receptor, tardar&iacute;a tantos a&ntilde;os

en hacerlo que ser&iacute;a in&uacute;til.</p>



<p>Como se ha comentado en la introducci&oacute;n, adem&aacute;s de

privacidad, PGP tambi&eacute;n ofrece autentificaci&oacute;n de la

informaci&oacute;n. Veamos por qu&eacute;:<br>



<p>Nuestra llave privada, adem&aacute;s de para encriptar los

mensajes, tambi&eacute;n puede ser usada para "firmar" la informaci&oacute;n enviada,

de forma an&aacute;loga a las firmas que realizamos a menudo sobre documentos

en papel.</p>



<p>Un documento que haya sido firmado digitalmente con nuestra llave privada,

podr&aacute; ser autentificado por cualquiera que disponga de nuestra llave

p&uacute;blica. Esto es &uacute;til para comprobar que el documento proviene efectivamente

de quien se supone y que nadie lo ha manipulado o falsificado.</p>



<p>Ambos procesos, encriptaci&oacute;n y firma, pueden ser realizados para

ofrecer privacidad y autentificaci&oacute;n. Primero se firma el documento

con nuestra llave privada para despu&eacute;s encriptarlo usando la llave

p&uacute;blica del receptor.</p>



<p>El receptor al recibir el documento invierte los pasos, desencriptando

primero el documento con su llave privada y comprobando despu&eacute;s

nuestra firma con nuestra llave p&uacute;blica.</p>



<p>Todos estos procesos se pueden automatizar como veremos m&aacute;s tarde.</p>



<p>Una llave p&uacute;blica es almacenada por PGP en lo que llama <i>certificado de

la llave</i> (key certificate), que no es m&aacute;s que la propia llave p&uacute;blica junto 

al nombre de la persona a la cual pertenece la llave y la fecha en la cual 

fue generada.</p>



<p>La llave privada est&aacute; protegida con una contrase&ntilde;a, que

impide su utilizaci&oacute;n por cualquier usuario ileg&iacute;timo.



<p>Las llaves son guardadas juntas en un fichero denominado <i>llavero</i> (key

ring), que almacena varios certificados de llave. Tendremos normalmente un

llavero para las llaves p&uacute;blicas y otro para las privadas.</p>



<p>Las llaves son internamente referenciadas por un <i>identificador</i> (key

ID) que son los &uacute;ltimos 64 bits de la llave. Al mostrar la informaci&oacute;n

de la llave &uacute;nicamente se mostrar&aacute;n los &uacute;ltimos 32 bits. Estos

identificadores ser&aacute;n usados, por ejemplo, para que PGP localice una

llave a la hora de desencriptar un mensaje.</p>



<p>Cuando firmamos un documento, PGP genera 128 bits que representan

al documento. Esta firma es una especie de checksum o CRC que va a

permitir detectar cambios en el documento. A diferencia de un CRC o

checksum normal, un posible impostor no va a ser capaz de regenerar

esta firma para que se adecue a los cambios que ha podido introducir

en el mensaje original, ya que la firma se realiza usando la clave

privada del emisor; y el impostor normalmente la desconocer&aacute;.</p>



<A NAME="versiones"></A>

<H3><FONT face="Helvetica,Arial" color="#660033">Versiones de PGP</FONT></H3>







<p>Una vez que ya sabemos para qu&eacute; nos va a ser &uacute;til PGP, seguramente tengamos

como m&iacute;nimo ganas de probarlo.</p>



<p>Llegados a este punto hay que destacar el considerable desconcierto que 

aparece con las diferentes versiones de PGP existentes. Debido a la pol&iacute;tica 

existente en Estados Unidos en lo referente a exportaci&oacute;n de material 

criptogr&aacute;fico, han ido surgiendo diferentes versiones de PGP y diferentes 

legislaciones para su uso. Con la intenci&oacute;n de aclarar un poco todo este lio 

expondr&eacute; a continuaci&oacute;n las diferentes versiones de PGP existentes a fecha 

de hoy.</p>



Versiones Freeware de PGP:



<ul>

<li>PGP 2.3a <br><br>



Es la versi&oacute;n "cl&aacute;sica" de PGP. Se puede seguir usando hoy d&iacute;a aunque se

pueden surgir algunos problemas de compatibilidad al procesar llaves y

mensajes generados con las versiones 2.6.x y posteriores o cuando se usan

llaves mayores de 1280 bits. Se supone que PGP 2.3a no se puede usar fuera

de Estados Unidos debido a restricciones en la patente.<br><br>



<li>PGP 2.6ui<br><br>



Es una versi&oacute;n no oficial de PGP 2.3a que corrige los problemas de

incompatibilidad antes comentados. Esta versi&oacute;n no es una versi&oacute;n 2.6.x ya

que se basa en los fuentes de la 2.3a.<br><br>



<li>PGP 2.62ui<br><br>



Se basa en los fuentes de la 2.6ui, es una modificaci&oacute;n que intenta

ser compatible con las &uacute;ltimas novedades incorporadas en las versiones

2.6.x.<br><br>



<li>MIT PGP 2.6.2<br><br>



Es la &uacute;ltima versi&oacute;n oficial de PGP. Sus mensajes no pueden ser leidos

por versiones anteriores a la 2.5 y usa la librer&iacute;a de encriptaci&oacute;n

RSAREF.  Es ilegal exportar esta versi&oacute;n fuera de los Estados Unidos,

pero curiosamente una vez exportada puede ser usada libremente.<br><br>



<li>PGP 2.6.3i<br><br>



Se basa en los fuentes del MIT PGP 2.6.2 los cuales sido modificados para su 

uso internacional. Uno de esos cambios es la no utilizaci&oacute;n de la libreria

RSAREF anteriormente comentada.

El uso de esta versi&oacute;n dentro de los Estados Unidos es ilegal.<br><br>



<li>PGP 5.0<br><br>



PGP 5.0 (anteriormente conocido como PGP 3.0) es una versi&oacute;n de PGP

totalmente nueva, sus fuentes han sido reescritas desde cero. A&ntilde;ade nuevas

opciones, incluyendo soporte para otros algoritmos de encriptaci&oacute;n adem&aacute;s

del RSA y el IDEA. Incluir&aacute; un GUI para simplificar su manejo. 

Se espera que est&eacute; disponible para su uso internacional a mediados de este

verano.

</ul>



Versiones comerciales de PGP (para Estados Unidos y Canad&aacute; &uacute;nicamente):



<ul>

<li>ViaCrypt PGP 2.7.1 y 4.0 <br><br>



Al ser comercial incluye manual, licencia de uso individual. No incluye

fuentes.<br><br>



<li>PGP 4.5 y 5.0<br><br>



En Junio de 1996 PGP Inc. compra ViaCrypt y comienza a desarrollar versiones

comerciales de PGP para los Estados Unidos y Canad&aacute;. La versi&oacute;n m&aacute;s reciente

es PGPMail 4.5.<br><br>

</ul>



<p>En nuestro caso, si nos encontramos fuera de Estados Unidos, la versi&oacute;n 

correcta a usar es la 2.6.3i, si estamos en Estados Unidos debemos optar por 

la 2.6.2 o la 2.6.3. <p>



<p>Hay que tener en cuenta que a&uacute;n hay algunos paises como Francia,

Iran, Iraq, Rusia y China donde el uso de la criptograf&iacute;a est&aacute;

regulado legalmente o prohibido.<p>



<p>Algunos links interesantes para conseguir la versi&oacute;n 2.6.3i para diferentes 

distribuciones de Linux:



<ul>

<li>Binarios ELF:<br>



<a

href="ftp://tonelli.sns.it/pub/Linux/pgp/pgp263.is.bin.tgz">tonelli.sns.it/pub/Linux/pgp/pgp263.is.bin.tgz</a><br><br>



<li>Binarios y fuentes para Red Hat:<br>



<a

href="ftp://ftp.replay.com/pub/replay/ub/redhat/i386/pgp-2.6.3i-1.i386.rpm">ftp.replay.com/pub/replay/ub/redhat/i386/pgp-2.6.3i-1.i386.rpm</a><br>



<a

href="ftp://ftp.replay.com/pub/replay/ub/redhat/SRPMS/pgp-2.6.3i-1.src.rpm">ftp.replay.com/pub/replay/ub/redhat/SRPMS/pgp-2.6.3i-1.src.rpm</a><br><br>



<li>Fuentes:<br>



<a

href="ftp://ftp.dit.upm.es/mirror/ftp.ifi.uio.no/pub/pgp/src/pgp263is.tar.gz">ftp.dit.upm.es/mirror/ftp.ifi.uio.no/pub/pgp/src/pgp263is.tar.gz</a>

</ul>



<A NAME="instalacion"></A>

<H3><FONT face="Helvetica,Arial" color="#660033">Instalaci&oacute;n de PGP</FONT></H3>




<p>Ya hemos obtenido el PGP. Suponemos que hemos obtenido el fichero con el

c&oacute;digo fuente de la versi&oacute;n 2.6.3i de tal forma que en nuestro disco duro

tenemos el fichero pgp263is.tar.gz</p>



<p>Lo primero es crear un directorio para descomprimir el fichero:</p> 



<pre>mkdir pgp</pre>



<p>A continuaci&oacute;n descomprimimos el fichero:</p> 



<pre>tar -C ./pgp -xzvf pgp263is.tar.gz</pre>



<p>Nos cambiamos al directorio que hemos creado y donde hemos descomprimido el

fichero: </p>



<pre>cd pgp</pre>



<p>A continuaci&oacute;n descomprimimos el fichero pgp263ii.tar que contiene la

documentaci&oacute;n y el c&oacute;digo fuente del programa, para ello ejecutamos el

comando:</p> 



<pre>tar -xvf pgp263ii.tar</pre>



<p>El siguiente paso es compilar el PGP. Si no hemos obtenido las fuentes, sino

la versi&oacute;n compilada ya sea a.out o ELF, podemos saltarnos este paso. Si

hemos optado por la versi&oacute;n con las fuentes, para compilarlas deberemos

realizar las siguientes operaciones:</p>



<pre>

cd src

make linux

</pre>



<p>Si todo va bien, tendremos en este directorio un fichero pgp ejecutable. Si

estamos haciendo una instalaci&oacute;n global para el sistema, podemos copiarlo a

/usr/local/bin a /usr/bin o donde mejor creamos. En caso contrario podemos

dejarlo en nuestro directorio personal.</p>



<p>De igual manera, podemos copiar la pagina de manual pgp.1 a

/usr/man/man1 en caso de que estemos haciendo una instalaci&oacute;n para

todo el sistema.</p>



<A NAME="config"></A>

<H3><FONT face="Helvetica,Arial" color="#660033">Configuraci&oacute;n B&aacute;sica</FONT></H3>





<p>PGP usa por defecto el directorio ~/.pgp para encontrar los anillos de

llaves y algunos ficheros de configuraci&oacute;n as&iacute; que como primer paso 

deberemos crear este directorio en nuestro directorio personal:</p>



<pre>

cd

mkdir .pgp

</pre>



<p>Si nos fijamos en los ficheros que tenemos, veremos un fichero <tt>config.txt</tt>

que sirve para configurar algunos aspectos de PGP. Para tener una

configuraci&oacute;n personalizada podemos copiar este fichero a nuestro reci&eacute;n

creado directorio ~/.pgp</p> 



<p>Opcionalmente, en vez de ~/.pgp/config.txt podemos llamarlo <tt>.pgprc</tt> y

almacenarlo en nuestro directorio, es decir, ~/.pgprc</p>



<p>Entre otras cosas, en este fichero se puede especificar el lenguaje a usar

con el parametro <tt>Languaje</tt>, podemos tener:</p>



<pre>

Languaje = en (Ingl&eacute;s)

Languaje = es (Castellano)

Languaje = ja (Japon&eacute;s)

</pre>



<p>... y otros m&aacute;s que vienen especificados en este fichero. Para sacar

provecho de esta opci&oacute;n deberemos copiar el fichero

<tt>languaje.txt</tt> a ~/.pgp</p>



<p>Otra cosa recomendable es copiar tambi&eacute;n el fichero de ayuda personalizado

para nuestro lenguaje a ~/.pgp en nuestro caso para el fichero en castellano

copiariamos el fichero <tt>es.hlp</tt></p>



<A NAME="creacion"></A>

<H3><FONT face="Helvetica,Arial" color="#660033">Creaci&oacute;n del par de llaves</FONT></H3>






<p>El siguiente paso para poder comenzar a usar PGP es crear nuestro par de

llaves (P&uacute;blica/Privada). Para ello ejecutaremos el comando:</p>



<pre>pgp -kg</pre>



<p>Se nos pide que elijamos el tama&ntilde;o de la llave (512, 768 o 1024), cuanto

mayor sea la llave m&aacute;s seguridad obtendremos a cambio de una peque&ntilde;a

penalizaci&oacute;n en velocidad.</p>



<p>Tras elegir el tama&ntilde;o de la llave, se nos pide el identificador que queremos

darle a nuestra llave p&uacute;blica. Aqu&iacute; se suele poner nuestro nombre y

direcci&oacute;n de E-Mail, en mi caso por ejemplo he puesto:</p>



<tt>Angel Lopez Gonzalez &lt;alogo@mx2.redestb.es&gt;</tt>



<p>A continuaci&oacute;n se nos pide una contrase&ntilde;a para proteger nuestra llave

privada, elige como contrase&ntilde;a una frase que te sea f&aacute;cil de recordar. Esto

se hace para proteger tu llave privada en caso de que te la roben, ya que no

se puede usar sin introducir primero esta contrase&ntilde;a.</p>



<p>A continuaci&oacute;n deberemos pulsar aleatoriamente varias teclas con el fin de

ayudar a crear una secuencia de bits que el programa usar&aacute; para generar 

n&uacute;meros aleatorios. El programa se basa en el intervalo de tiempo pasado 

entre cada una de nuestras pulsaciones para crear esta secuencia de bits.</p>



<p>PGP generar&aacute; las llaves tras unos segundos de espera y se nos notificar&aacute; con

un mensaje. Podemos comprobarlo cambiando a nuestro directorio ~/.pgp y

viendo que se han creado dos ficheros nuevos: <tt>pubring.pgp</tt> y <tt>secring.pgp</tt> </p>



<p>El primero, <tt>pubring.pgp</tt>, es el anillo con las llaves p&uacute;blicas, por el

momento solo tiene la nuestra.</p>



<p>El segundo, <tt>secring.pgp</tt>, es como te imaginas el anillo con las llaves

privadas, que tambi&eacute;n contiene solo la que acabamos de crear.</p>



<p>Hay que recordar que toda la seguridad de los m&eacute;todos de llave p&uacute;blica se

basa en la privacidad, valga la redundancia, de nuestra llave privada; por 

tanto, aseg&uacute;rate que nadie m&aacute;s en el sistema puede acceder a tu anillo con 

llaves privadas, f&iacute;jate en los permisos de secring.pgp y aseg&uacute;rate que 

&uacute;nicamente t&uacute; tienes acceso de lectura y escritura, el resto no deben tener 

ning&uacute;n acceso.</p>



<p>Por &uacute;ltimo decir tanto la informaci&oacute;n, que sirve de identificaci&oacute;n para las

llaves, como las contrase&ntilde;as de las llaves privadas, pueden ser

editadas y modificadas con el comando:</p>



<pre>pgp -ke identificador [anillo]</pre>




<A NAME="a&ntilde;adiendo"></A>

<H3><FONT face="Helvetica,Arial" color="#660033">A&ntilde;adiendo llaves a un anillo</FONT></H3>




<p>Llegados a este punto, seguramente quieras a&ntilde;adir las llaves p&uacute;blicas de

tus amigos en el anillo de llaves p&uacute;blicas. Para ello has debido de conseguir estas llaves

p&uacute;blicas de alg&uacute;n modo: en un servidor de llaves, directamente de la

persona en cuesti&oacute;n, haciendo un finger a su cuenta, por E-Mail,

etc... recordemos que la llave p&uacute;blica puede distribuirse libremente y

no hace falta que sea transmitida por un canal seguro, como en los

m&eacute;todos de encriptaci&oacute;n de una sola clave.</p>



<p>Supongamos que tenemos una llave en el fichero llave.pgp, para

a&ntilde;adirla a uno de los anillos haremos:</p>



<pre>pgp -ka llave [anillo]</pre>



<p>Por defecto se toma la extensi&oacute;n <tt>.pgp</tt> para el fichero con la llave, y los

nombres <tt>pubring.pgp</tt> y <tt>secring.pgp</tt> para los nombres de anillo dependiendo de

si la llave es p&uacute;blica o privada.</p>



<p>Cuando se a&ntilde;ade una llave, PGP puede avisar de que la llave que se est&aacute;

a&ntilde;adiendo <i>no est&aacute; completamente certificada</i>, con esto nos est&aacute; avisando de

que la llave que tenemos en nuestra mano pueda ser falsa y no

pertenecer realmente a qui&eacute;n se supone que es su due&ntilde;o.</p>



<p>Si tenemos la seguridad de que la llave es correcta, ya sea porque nos la ha

dado en persona o por un canal seguro, entonces podemos certificarla

nosotros mismos, lo que significa que estamos firmando esa llave nosotros.</p>



<p>Esto posibilita que si pasamos esta llave a otra persona y ella

conf&iacute;a en nosotros, tenga la seguridad que la llave que le estamos pasando sea buena y pertenezca

realmente a qui&eacute;n dice pertenecer.</p>



<p>Este matiz tiene incluso un nombre, y es <i>web trust</i> o <i>red de confianza</i>.

En Estados Unidos incluso se hacen reuniones entre usuarios de PGP donde se

intercambian las llaves p&uacute;blicas y se las firman entre ellos :)</p>



<p>Pongamos un ejemplo con nombres para aclarar este concepto. Imaginemos a dos

amigos, Juan y Pedro. Juan da a Pedro su llave p&uacute;blica. Pedro est&aacute; seguro

que la llave que tiene de Juan es correcta y no es de ning&uacute;n impostor ya que

el mismo Juan se la ha dado en mano. Cuando llega a su casa y la a&ntilde;ade a su

anillo de llaves p&uacute;blicas puede certificar que la llave de Juan es correcta

firm&aacute;ndola con su propia llave privada.</p>



<p>Ahora entran en escena otras dos personas Luis y Maria. Luis recibe de Pedro

la llave de Juan y m&aacute;s tarde Luis se la pasa a Mar&iacute;a. Mar&iacute;a no se f&iacute;a mucho

de Luis pero ve que la llave de Juan est&aacute; certificada por Pedro. Mar&iacute;a puede

comprobar la llave p&uacute;blica de Juan gracias a la firma que Pedro puso en

ella. Mar&iacute;a tiene la llave p&uacute;blica de Pedro y &eacute;ste se la di&oacute; en mano con

lo que Mar&iacute;a conf&iacute;a en ella y puede comprobar la veracidad de la llave de 

Juan a trav&eacute;s de la firma de Pedro aunque no haya confiado en Luis.</p>



<p>Todo este l&iacute;o :) se monta para intentar asegurar el &uacute;nico punto d&eacute;bil de la

criptograf&iacute;a de este tipo y es el echo de que las llaves p&uacute;blicas puedan ser

falsificadas.</p>




<A NAME="quitando"></A>

<H3><FONT face="Helvetica,Arial" color="#660033">Quitando llaves de un anillo</FONT></H3>






<p>Siguiendo con nuestra peque&ntilde;a gu&iacute;a de uso del PGP, el siguiente paso tras

saber c&oacute;mo a&ntilde;adir llaves a un anillo, es saber como eliminarlas, esto lo

podemos hacer con el comando:</p>



<pre>pgp -kr identificativo [anillo]</pre>



<p>Por ejemplo: pgp -kr juan elimina la llave que tenga la cadena "juan" en

alguna parte de su identificativo. Por defecto se toma el anillo de llaves

p&uacute;blicas.</p>




<A NAME="extrayendo"></A>

<H3><FONT face="Helvetica,Arial" color="#660033">Extrayendo una llave</FONT></H3>





<p>Ya hemos guardado la llave de alguno de nuestros amigos en nuestro anillo de

llaves p&uacute;blicas, pero ahora tenemos que mandarle la nuestra. Para ello

debemos extraerla de nuestro anillo:</p>



<pre>pgp -kx identificativo fichero [anillo]</pre>



<p>Por ejemplo: pgp -kx angel millave extraer&iacute;a la llave p&uacute;blica identificada

por la subcadena "angel" al fichero millave.pgp</p>



<p>Si hacemos un cat de millave.pgp veriamos que no es un fichero ASCII, si 

queremos que la llave se represente en ASCII para poder enviarla por

E-Mail o ponerla como informaci&oacute;n adicional para un finger, se har&iacute;a:</p>



<pre>pgp -kxa identificativo fichero [anillo]</pre>



<p>Por ejemplo: pgp -kxa angel millave extrae la llave p&uacute;blica identificada por

la subcadena "angel" al fichero millave.asc</p>



<p>Junto con la llave se extraen tambi&eacute;n todos los certificados que se hayan

hecho de ella.</p>




<A NAME="contenido"></A>

<H3><FONT face="Helvetica,Arial" color="#660033">Contenido de un anillo</FONT></H3>



<p>Para ver las llaves contenidas en un anillo basta con el comando:</p>



<pre>pgp -kv [identificativo] [anillo]</pre>



<p>De nuevo por defecto se toma el anillo de llaves p&uacute;blicas, <tt>pubring.pgp</tt>

De no indicar identificativo se mostrar&aacute;n todas las llaves del anillo.</p>



<p>Si se quieren ver tambi&eacute;n todos los certificados para cada llave,

se usar&iacute;a:</p>



<pre>pgp -kvv [identificativo] [anillo]</pre>



<A NAME="encriptando"></A>
<H3><FONT face="Helvetica,Arial" color="#660033">Encriptando un mensaje</FONT></H3>



<p>Ya sabemos manejar las llaves, as&iacute; que podemos empezar a usarlas en serio,

para ello vamos a ver como encriptariamos un fichero:</p>



<pre>pgp -e fichero identificativo</pre>



<p>Pongamos un ejemplo. Un profesor quiere mandarle a otro por E-Mail

un examen, y lo quieren encriptar para que ningun alumno lo intente

coger :) supongamos que el segundo profesor se llama Marcos y el

identificativo de su llave p&uacute;blica como es su nombre contiene por

tanto esta cadena, el primer profesor har&iacute;a:</p>



<pre>pgp -e examen.doc marcos</pre>



<p>Este comando produce un fichero de nombre examen.pgp que contiene

el fichero de texto examen.doc encriptado de tal manera que &uacute;nicamente

lo podr&aacute; desencriptar Marcos ya que se ha usado su llave p&uacute;blica.</p>



<p>&Uacute;nicamente resaltar que el fichero examen.pgp obtenido no es un fichero

ASCII, si quisi&eacute;ramos mandarlo por E-Mail a&ntilde;adir&iacute;amos la opci&oacute;n -a, para que 

la salida fuese ASCII, de la siguiente manera:</p>



<pre>pgp -ea examen.doc marcos</pre>



<p>Al encriptar el fichero nos puede interesar, por motivos de

seguridad, que PGP borre el original autom&aacute;ticamente una vez que lo ha

encriptado, para ello a&ntilde;adimos la opci&oacute;n -w:</p>



<pre>pgp -eaw examen.doc marcos</pre>



<A NAME="mensaje"></A>
<H3><FONT face="Helvetica,Arial" color="#660033">Encriptando un mensaje para varios
     receptores</FONT></H3>




<p>Imaginemos ahora que el profesor del ejemplo anterior quiere enviar el

examen a todos sus compa&ntilde;eros de departamento, para ello &uacute;nicamente tiene

que indicar varios identificadores en vez de uno solo:</p>



<pre>pgp -ea examen.doc marcos juan alicia</pre>



<p>Notese como incluimos el par&aacute;metro <tt>-a</tt> para que la salida sea un fichero

ASCII para que pueda ser enviado como mensaje de correo.</p>



<A NAME="firma"></A>
<H3><FONT face="Helvetica,Arial" color="#660033">C&oacute;mo firmar un mensaje</FONT></H3>



<p>Ya hemos comentado con anterioridad que la firma digital de un mensaje es

an&aacute;loga a la firma que podemos realizar en un documento de papel. El que

firmemos un documento va a permitir que el receptor del mismo pueda

verificar que el documento no ha sido modificado y que realmente viene de

nosotros.</p>



<p>Para firmar un documento con nuestra llave privada haremos:</p>



<pre>pgp -s fichero [-u identificador]</pre>



<p>Si tenemos varias llaves privadas en nuestro secring.pgp podemos elegir una

de ellas con el identificador.</p>



<p>Para que nuestro profesor del ejemplo firme el examen digitalmente de tal

manera que el resto de profesores no piense que alg&uacute;n alumno gracioso ha

hecho un examen y se lo ha mandado a ellos :) podr&iacute;a hacer:</p>



<pre>pgp -s examen.doc</pre>



<p>Con el comando anterior se crear&iacute;a un fichero examen.doc.pgp que no est&aacute; en

ASCII ya que se intenta comprimir despu&eacute;s de firmarlo. Si lo que se quiere

es firmar un documento pero que se pueda seguir leyendo directamente y que

la firma aparezca al final del mismo, se puede hacer con el comando:</p>



<pre>pgp -sta examen.doc</pre>



<p>Este &uacute;ltimo comando puede ser muy &uacute;til para firmar correo electr&oacute;nico de tal

manera que pueda seguir siendo leido incluso para aquellos que no tengan PGP

o no quieran comprobar la firma.</p>



<p>Podemos firmar un documento y posteriormente encriptarlo con el siguiente

comando:</p>



<pre>pgp -es fichero identificador_receptor

[-u mi_identificador]</pre>



Por ejemplo:



<pre>pgp -es examen.doc marcos -u angel</pre>



<p>Encripta y firma el fichero examen.doc creando el fichero examen.pgp, la

llave p&uacute;blica usada para encriptar el fichero es la identificada por la

cadena "marcos" por lo que unicamente el due&ntilde;o de tal llave p&uacute;blica podr&aacute;

desencriptar este mensaje, identifico mi llave privada con la cadena "angel"

ya que en mi anillo de llaves privadas puedo tener varias llaves.</p>



<p>De nuevo podr&iacute;a usar la opci&oacute;n <tt>-a</tt> para obtener como resultado un fichero

ASCII.</p>



<p>Quiz&aacute;s otra opci&oacute;n que nos interese sea generar la firma en un fichero a

parte del de datos, para ello se usa la opci&oacute;n <tt>-b</tt>:</p>



<pre>pgp -sb examen.doc</pre>



<p>Con este comando se crear&iacute;a un fichero examen.sig que contiene

&uacute;nicamente la firma.</p>





<A NAME="desencriptando"></A>
<H3><FONT face="Helvetica,Arial" color="#660033">Desencriptando</FONT></H3>





<p>Para desencriptar un fichero y/o para comprobar la firma usaremos

el comando:</p>



<pre>pgp fichero_entrada [-o fichero_salida]</pre>



<p>El fichero de entrada se asume que por defecto tiene la extensi&oacute;n .pgp 

El fichero de salida es opcional y es donde se almacenar&iacute;a el fichero

desencriptado, si no se especifica la salida se guarda en el fichero de

entrada pero eliminando la extensi&oacute;n.</p>



<p>Al desencriptar un fichero podemos indicar que la salida sea a la salida

estandard en vez de a un fichero, esto lo conseguimos con la opci&oacute;n

<tt>-m</tt>:</p>



<pre>pgp -m fichero</pre>



<p>Tambi&eacute;n podemos usar pipes para entrada y salida, con la opci&oacute;n

<tt>-f</tt>:</p>



<pre>pgp -fs identificador < fichero_entrada >

fichero_salida</pre>



<p>Se puede dar el caso de que deseemos desencriptar un mensaje firmado que nos

llegue pero nos interesa que siga manteniendo su firma, quiz&aacute;s porque

queramos encriptarlo de nuevo para mand&aacute;rselo a una tercera persona, esto se

puede lograr usando la opci&oacute;n <tt>-d</tt>:</p>



<pre>pgp -d examen</pre>



<p>Tomar&iacute;a el fichero examen.pgp y lo desencriptar&iacute;a, pero dejar&iacute;a la firma en

el fichero. Podriamos entonces volver a encriptarlo con la clave p&uacute;blica de

una tercera persona y &eacute;sta podr&iacute;a seguir comprobando la autenticidad del

fichero ya que la firma original no se ha tocado.</p>



<A NAME="ficheros"></A>
<H3><FONT face="Helvetica,Arial" color="#660033">Tratando ficheros de texto</FONT></H3>



<p>Frecuentemente se usa PGP para encriptar el correo electr&oacute;nico, que

normalmente es &uacute;nicamente texto. Un problema con el texto es la

representaci&oacute;n que toma en diferentes m&aacute;quinas, por ejemplo, en MSDOS todas

las l&iacute;neas terminan en un retorno de carro y en un avance de linea. En Linux

unicamente con avance de linea, en Macintosh &uacute;nicamente con retorno de

carro... para evitar problemas entre plataformas podemos indicar a PGP que

vamos a encriptar un fichero de texto no un fichero binario, y que al

descomprimir lo adapte a las particularidades del sistema en donde se est&aacute;

ejecutando, para ello usamos la opci&oacute;n <tt>-t</tt>. Si quisieramos encriptar un

fichero de texto con esta opci&oacute;n para mandarlo por E-Mail har&iacute;amos:</p>



<pre>pgp -sta mensaje_texto identificador</pre>




<A NAME="huellas"></A>
<H3><FONT face="Helvetica,Arial" color="#660033">Huellas dactilares</FONT></H3>




<p>Una huella dactilar (fingerprint) es una secuencia de 16 bytes que

identifican una llave un&iacute;vocamente. Se puede comprobar que tenemos la llave

correcta de alguien comprobando estos 16 bytes en vez de comprobar uno a uno

los 1024 bytes que podr&iacute;a llegar a tener una llave.</p>



<p>Para ver la huella de una llave usamos el comando:</p>



<pre>pgp -kvc identificador [anillo]</pre>




<A NAME="shells"></A>
<H3><FONT face="Helvetica,Arial" color="#660033">Usando PGP en shells</FONT></H3>




<p>Hay algunas opciones de PGP que pueden resultarnos &uacute;tiles a la hora de

usarlo desde shells cuando queremos automatizar alg&uacute;n trabajo.</p>



<b>batchmode</b>



<p>Con esta opci&oacute;n no se preguntar&aacute; nada que no sea estrictamente necesario.

Es &uacute;til cuando se quiere comprobar la firma de un mensaje autom&aacute;ticamente,

cuando el fichero no tiene firma el codigo de error devuelto es 1, si el

fichero ten&iacute;a firma y era correcta devuele un 0.</p>



<pre>

pgp +batchmode fichero

</pre>



<b>force</b>



<p>Con esta opci&oacute;n hacemos que ante una pregunta de sobreescritura de

un fichero o eliminaci&oacute;n de una llave se tome como respuesta "S&iacute;".</p>



<pre>pgp +force +kr marcos</pre>



<p>En shells es muy &uacute;til evitar que PGP nos pida la contrase&ntilde;a cuando vamos a

encriptar un fichero, por ejemplo, para evitar que nos la pida

interactivamente en el proceso de encriptaci&oacute;n podemos dejarsela indicada en

la variable de entorno <tt>PGPPASS</tt>.</p>



<p>Por ejemplo:</p>



<pre>

PGPPASS="contrase&ntilde;a"

export PGPPASS

pgp -s fichero.txt marcos

</pre>



<p>Otra forma de pasar la contrase&ntilde;a a PGP de manera no interactiva es usando

la opci&oacute;n <tt>-z</tt></p>



<p>Por ejemplo:</p>



<pre>pgp -sta examenes.txt angel -z "contrase&ntilde;a"</pre>



<p>Puede ser &uacute;til en los shells hacer que PGP saque los mensajes

imprescindibles y nada m&aacute;s, esto se consigue con la opci&oacute;n

<tt>+verbose</tt>, por ejemplo, para establecer el <i>quiet mode</i>, es decir, sin mensajes

informativos, &uacute;nicamente los de error:</p>



<pre>pgp fichero.pgp +verbose=0</pre> 



<A NAME="integracion"></A>
<H3><FONT face="Helvetica,Arial" color="#660033">Integraci&oacute;n de PGP con lectores de
     correo</FONT></H3>




<p>La integraci&oacute;n de PGP con los lectores de correo, para desencriptar

el correo autom&aacute;ticamente as&iacute; como encriptar o firmar los mensajes que

escribamos, es sencilla; aunque depende en gran medida del programa que

estemos usando.</p>



<p>Como ejemplo pr&aacute;ctico se comentar&aacute; la integraci&oacute;n de PGP con Pine. Espero

que este ejemplo sirva como base para que integres PGP con cualquier otro

lector que est&eacute;s usando t&uacute; en tu sistema.</p>



<p>La filosof&iacute;a a seguir es sencilla y aunque se expondr&aacute; para realizarlo con

Pine, con cualquier otro lector ser&iacute;a igual, salvando las diferencias en las

opciones de configuraci&oacute;n.</p>



<p>Para lograr desencriptar el correo autom&aacute;ticamente antes de leerlo, se va a

usar un filtro que tome el mensaje antes de visualizarlo por pantalla. Otra

opci&oacute;n ser&iacute;a crear una macro que automatizase la toma del mensaje actual, y

lo desencriptase mostr&aacute;ndolo en pantalla.</p>



<p>En el caso de Pine tenemos una opci&oacute;n para definir filtros que se ejecutar&aacute;n

antes de visualizar el mensaje, es la opci&oacute;n <tt>display-filters</tt> del men&uacute; de

configuraci&oacute;n. En esta opci&oacute;n debemos a&ntilde;adir un nuevo filtro que sea algo

como lo siguiente:</p>



<pre>

_BEGINNING("-----BEGIN PGP MESSAGE-----")

_ /usr/local/bin/pgp

</pre>



<p>Todo mensaje encriptado aparece entre dos marcas legibles que son

<tt>"-----BEGIN PGP MESSAGE-----"</tt> y <tt>"-----END PGP

MESSAGE-----"</tt> de tal manera que si queremos identificar si un

mensaje tiene un texto encriptado en su cuerpo nos basta por buscar

por alguna de las dos cadenas anteriores. El filtro definido en el

pine hace exactamente eso, antes de visualizar el mensaje actual mira

si en el cuerpo del mismo existe la cadena <tt>"-----BEGIN PGP

MESSAGE-----"</tt> con la restricci&oacute;n de que debe aparecer al comienzo

de cualquier linea. Si aparece se ejecuta el programa

<tt>/usr/local/bin/pgp</tt>

</p>



<p>Por tanto si hay un mensaje encriptado dentro del cuerpo del mensaje se

ejecuta pgp, nos pedir&iacute;a nuestra contrase&ntilde;a y podr&iacute;amos ver el mensaje. Si

queremos automatizar este proceso a&uacute;n m&aacute;s, ahorr&aacute;ndonos el tener que

introducir nuestra contrase&ntilde;a cada vez que queramos desencriptar un mensaje,

podemos hacerlo de las dos formas anteriormente expuestas: estableciendo la variable de

entorno <tt>PGPPASS</tt> o con la opci&oacute;n <tt>-z</tt></p>



<p>Ya s&oacute;lo nos queda definir un filtro que se ejecute opcionalmente antes de

enviar un mensaje que hayamos escrito y que lo que haga sea encriptar el

mensaje escrito con las claves p&uacute;blicas de los destinatarios del mensaje,

esto lo podemos hacer definiendo un filtro en la opci&oacute;n de configuraci&oacute;n

<tt>sending-filters</tt> de la siguiente manera:</p>



<pre>/usr/local/bin/pgp -etaf _RECIPIENTS_</pre>



<p>Cuando escribamos un mensaje y pulsemos CTRL-X para grabarlo, Pine nos

preguntar&aacute; si queremos enviar el mensaje directamente sin pasarlo por

ninguno de los filtros que tenemos definidos. Si no queremos encriptarlo

aceptaremos esta opci&oacute;n, pero si queremos encriptarlo pulsaremos CTRL-N o

CTRL-P para movernos por la lista de filtros definidos hasta que encontremos

el que nos interese, en este caso el que hemos definido para PGP.</p>



<p>De esta manera tan sencilla, y con &uacute;nicamente dos filtros hemos integrado

PGP con Pine a un nivel b&aacute;sico.</p>



<p>Para obtener m&aacute;s informaci&oacute;n de c&oacute;mo integrar PGP con otros sistemas puedes

consultar los siguientes enlaces:</p>



<a

href="http://ftp.rediris.es/ftp/software/security/crypt/pgp/utils/elm/README.html">elm</a>

|



<a

href="http://ftp.rediris.es/ftp/software/security/crypt/pgp/utils/emacs/README.html"> GNU Emacs</a>

|



<a

href="http://ftp.rediris.es/ftp/software/security/crypt/pgp/utils/mail_tin/README.html"> tin</a>

|



<a

href="http://ftp.rediris.es/ftp/software/security/crypt/pgp/utils/mailx/README.html"> mailx</a>

|



<a

href="http://ftp.rediris.es/ftp/software/security/crypt/pgp/utils/mh/README.html"> MH</a> |



<a

href="http://ftp.rediris.es/ftp/software/security/crypt/pgp/utils/pine/README.html"> Pine</a> |



<a

href="http://ftp.rediris.es/ftp/software/security/crypt/pgp/utils/sendmail/README.html"> sendmail</a>

|



<a

href="http://ftp.rediris.es/ftp/software/security/crypt/pgp/utils/vi/README.html"> vi</a> |



<a

href="http://ftp.rediris.es/ftp/software/security/crypt/pgp/utils/zmail/README.html">zmail

</a><br><br>















          </TD>
        </TR>
	 </TABLE>

     <HR size=2 noshade>

    </TD>

 </TR>

 </TBODY>

<TBODY>
  <TR>
    <TD colspan="2">
    <B>Para m&aacute;s informaci&oacute;n</B>:<BR>
    <UL>
      <LI>Lea la documentaci&oacute;n de PGP</A>. </LI>
      <LI>Otros art&iacute;culos por el mismo autor: 
       <A href="article8.html">Procesando su correo con procmail</A>.</LI> 
     <UL><BR><BR>
    <TD>
  </TR>
</TBODY>

 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 Angel Lopez</B></FONT><BR>
    <FONT color="#ffffff">This website is mantained by 
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>



</TABLE>


</BODY>
</HTML>






