<HTML>
<HEAD>
<TITLE>Spanish Linux HOWTO: Ayuda a la instalaci&oacute;n de la distribuci&oacute;n Slackware</TITLE>
</HEAD>
<BODY>
<A HREF="Spanish-Como-2.html">Anterior</A>
<A HREF="Spanish-Como-4.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Ayuda a la instalaci&oacute;n de la distribuci&oacute;n Slackware</A></H2>


<P><EM>Este es un extracto de la <CODE>Installation-HOWTO</CODE>, orientada fundamentalmente
a la instalaci&oacute;n de Linux Slackware. Mucha de la informaci&oacute;n sobre
instalacion de Slackware es aplicable a cualquier versi&oacute;n de Linux, pero
no necesariamente al pie de la letra.</EM></P>

<P>Aparte de otras muchas variantes que se puedan considerar, a la hora de
instalar Linux en nuestro disco duro hay b&aacute;sicamente
dos formas: UMSDOS y Partici&oacute;n nativa. Cada una tiene
sus ventajas e inconvenientes, pero como se ver&aacute; es recomendable que
todos los usuarios terminen usando el segundo m&eacute;todo ya que es el m&aacute;s
eficiente y el que mejor aprovecha las ventajas de Linux.</P>

<H2><A NAME="ss3.1">3.1 Instalaci&oacute;n con UMSDOS</A></H2>


<P>Consiste en aprovechar el espacio de disco que queda libre en los PCs con MSDOS,
sin necesidad de tocar las particiones de disco. Linux es un sistema operativo,
y como tal totalmente independiente, no requiriendo por tanto ningun otro
sistema operativo en su ordenador (aunque puede convivir perfectamente con
ellos). Sin embargo es un parque muy amplio el de usuarios que ya tienen
instalado MSDOS y/o MS-Windows y que, al no considerase expertos, no se atreven en
un primer momento a reparticionar el disco para sustituir total o parcialmente
a su sistema actual. Para ellos, o simplemente para quien quiera ver y probar
Linux sin ser tan drasticos formateando discos duros, la soluci&oacute;n es UMSDOS. Permite crear, a partir
de un directorio de MSDOS, toda la estructura que tendr&iacute;a un disco nativo
de Linux. Cuando arranque el sistema, Linux emular&aacute; su disco a partir
de la informaci&oacute;n en ese directorio. Es totalmente funcional, pero puede
ser ligeramente m&aacute;s lento en ordenadores de gama media-baja y no aprovecha la
gesti&oacute;n de disco nativo. Una gran ventaja es que si se libera disco en Linux,
impl&iacute;citamente estamos creando espacio que ser&aacute; aprovechable cuando arranquemos
MSDOS, y viceversa. Adem&aacute;s, el d&iacute;a que queramos deshacernos de Linux (¡poco
probable!) o que simplemente nos decidamos a hacer una instalaci&oacute;n completa,
desinstalar ese Linux es tan sencillo como simplemente borrar sin contemplaciones
el directorio <CODE>C:\LINUX</CODE> que cre&oacute; desde MSDOS.</P>


<H2><A NAME="ss3.2">3.2 Instalaci&oacute;n en partici&oacute;n nativa de Linux.</A></H2>


<P>Salvo la fase inicial en la que se preparan las particiones nativas o el
UMSDOS, el procedimiento restante de instalaci&oacute;n es b&aacute;sicamente el mismo.
Ya que puede ser el que provoque m&aacute;s dudas, centraremos estos consejos
de instalaci&oacute;n en la instalaci&oacute;n con partici&oacute;n nativa. Pero recuerde que</P>
<P>
<HR>
<PRE>
   ESTO NO ES UNA GUIA DE INSTALACION, SINO UN COMPLEMENTO A LAS
   INTRUCCIONES DE INSTALACION DE SU VERSION DE LINUX.

   LEA LA INSTALLATION-HOWTO Y/O EL MANUAL QUE ACOMPA&ntilde;A A SU DISTRIBUCION
   ANTES DE COMENZAR, O DE LO CONTRARIO PUEDE FALLAR LA INSTALACION E
   INCLUSO INUTILIZAR EL SOFTWARE QUE PUEDA TENER YA INSTALADO EN SU
   ORDENADOR.

   LA DISTRIBUCION TOMADA COMO BASE ES LINUX SLACKWARE 3.0. EL PROCEDIMIENTO
   PUEDE VARIAR DE UNAS VERSIONES A OTRAS. EN CASO DE DUDA ACUDA A LOS
   MANUALES DE SU SISTEMA O CONSULTE A LOS CANALES DE AYUDA Y SOPORTE LINUX
   HABITUALES (EN INTERNET O A SU DISTRIBUIDOR)

   LOS AUTORES DE ESTA DOCUMENTACION NO SE RESPONSABILIZAN DE LOS POSIBLES
   DESASTRES QUE PUEDA OCASIONAR. SI DECIDE CONTINUAR ES BAJO SU EXCLUSIVA
   RESPONSABILIDAD. (Nos gusta dormir tranquilos ;^) )
</PRE>
<HR>
</P>

<H3>Preliminares</H3>


<P>En esta instalaci&oacute;n es necesario que LINUX disponga de una partici&oacute;n
distinta a la de MSDOS para trabajar. Si ya tiene alg&uacute;n sistema instalado,
lo m&aacute;s frecuente es que sea una &uacute;nica partici&oacute;n DOS que ocupe todo el disco,
por lo que reparticionar supone eliminar esa partici&oacute;n para volver a crearla
asign&aacute;ndole menos disco para hacer sitio a Linux (o para d&aacute;rselo totalmente,
seg&uacute;n la instalaci&oacute;n escogida). Eso supone perder como norma general
todos los datos en las particiones ya existentes.</P>
<P>Existe, sin embargo, una utilidad anexa a Linux que corre sobre MSDOS y que
permite "encoger" una partici&oacute;n de DOS siempre que la unidad tenga espacio
libre y haya sido totalmente defragmentada (con la utilidad "DEFRAG" de MSDOS 6.x
o similares). Esto le permitir&aacute; crear nuevas particiones conservando sus datos
en la partici&oacute;n MSDOS actual. Esta utilidad se llama <CODE>"fips"</CODE> y la encontrar&aacute;
en su servidor habitual en la red junto a otras utilidades de MSDOS para
ayudar a la instalaci&oacute;n de Linux.</P>
<P>LEA LA DOCUMENTACION DE FIPS ANTES DE UTILIZARLO.</P>
<P>Primero debe liberar en MSDOS el espacio que pretenda reservar para la
nueva partici&oacute;n de Linux (y para el espacio de swap, como despu&eacute;s se
comentar&aacute;). Despu&eacute;s debe defragmentar la partici&oacute;n de DOS con la utilidad
"defrag" que acompa&ntilde;a a las &uacute;ltimas versiones de DOS, o bien sus equivalentes
de PCTools o Norton. Ahora puede correr el programa fips y crear una nueva
partici&oacute;n con el espacio liberado. Lo habitual ser&aacute; crear dos particiones:
una <EM>Linux native</EM> para el sistema, y una <EM>Linux swap</EM> con por ej. el doble
que de RAM, pero en caso de necesidad incluso puede ahorrarse una partici&oacute;n
espec&iacute;fica para swap, y "robar" ese espacio de disco bien a MSDOS o al propio
Linux.</P>

<H3>Formateo de la partici&oacute;n.</H3>

<P>Una vez a&ntilde;adida la nueva partici&oacute;n que destinaremos a Linux, hay que preparar
la siguiente etapa, el arranque de Linux, ya que salvo el apartado anterior
en el que salvaguardamos la instalaci&oacute;n previa de MSDOS, toda la instalaci&oacute;n
se har&aacute; desde el propio Linux. Para arrancar necesitaremos dos disquetes
(en algunas distribuciones como RedHat pueden ser tres), donde grabaremos
tanto el n&uacute;cleo del sistema operativo como los primeros programas con los que
poder empezar a instalar. El primer disquete es el que etiquetaremos como
"boot disk", y es donde ir&aacute; el n&uacute;cleo del sistema con el que arrancar. Como
Linux es casi un sistema "a la carta", que puede llevar en el n&uacute;cleo m&aacute;s o
menos funcionalidades seg&uacute;n nuestras necesidades, deberemos escoger entre
los n&uacute;cleos precompilados aquel que se adapte mejor a nuestro caso. En el
futuro ser&aacute; recomendable que incluso recompilemos nuestro propio n&uacute;cleo
para personalizarlo a&uacute;n m&aacute;s, a&ntilde;adir lo que falte y simplificar lo que
sobre en nuestro caso. El siguiente disquete es el "root disk" o "ramdisk",
que incluye el software m&iacute;nimo que cargaremos en memoria para la instalaci&oacute;n.</P>
<P>En la distribuci&oacute;n de Linux tendremos una serie de ficheros que constituyen
"im&aacute;genes" de esos disquetes. Es decir, una vez elegidas qu&eacute; diquetes
necesitaremos, los crearemos a partir de esas im&aacute;genes,
bien desde otro sistema Linux ya funcionando (o incluso de cualquier Unix en
general), bien desde MSDOS con otra utilidad complementaria de "fips":
"rawrite".</P>
<P>Una vez hecho esto ya puedes arrancar con tus discos. Introduce el "boot
disk", arranca el ordenador y sigue sus instrucciones. Cuando finalice la
fase de arranque Slackware te ofrecer&aacute; un s&iacute;mbolo para hacer "login" (entrar en el
sistema), mientras que RedHat arrancar&aacute; directamente la aplicaci&oacute;n de
instalaci&oacute;n. Utiliza el nombre "root" como nombre de usuario (es el super-usuario
que administra el sistema). La primera vez no necesitar&aacute;s clave alguna para
entrar.</P>
<P>Ya estas en el prompt de Linux, desde donde puedes crear tus particiones y
tu espacio de swap (es una zona especial de disco que Linux usa como memoria
virtual que complementa a la memoria RAM del ordenador). Al igual que en MSDOS,
el comando para gestionar particiones se llama "fdisk". En algunas versiones
hay tambi&eacute;n una "cfdisk" con un interfaz m&aacute;s asequible, aunque iguales en
lo b&aacute;sico.</P>
<P>Si posees una partici&oacute;n de MSDOS, no te asustes, sigue adelante, no la vas
a perder simplemente por entrar en fdisk, pero s&iacute; que debes tener precauci&oacute;n
al a&ntilde;adir la partici&oacute;n linux sobre el espacio que le hab&iacute;amos quitado a MSDOS,
para no afectar a &eacute;ste.</P>
<P>Dentro de fdisk usa la opci&oacute;n 'n' para a&ntilde;adir nuevas particiones. Dalas de 
alta como particiones primarias (si ya tienes una particion de arranque con
MSDOS, &eacute;sta ser&aacute; la partici&oacute;n 1 y a partir de ah&iacute; a&ntilde;adir&aacute;s particiones Linux).
Es ahora el momento de a&ntilde;adir el espacio de swap, conveniente siempre, e
incluso imprescindible si se dispone de memoria igual o inferior a 8Mb. Como
regla orientativa puede servir tener el doble de swap que RAM (para 8Mb o menos
de RAM), y 1.5 veces para memorias superiores, pero depende de la disponibilidad
de disco y de memoria que tengamos, as&iacute; como del uso que le vayamos a dar. En
realidad ser&aacute; tu experiencia la que te ir&aacute; diciendo en sucesivas instalaciones
cu&aacute;nto swap necesitas. En caso de disponer de m&aacute;s de un disco duro es muy
recomendable tener separadas las particiones de linux y de swap (por ej. DOS+swap
en uno y linux en el otro), lo que mejorar&aacute; el rendimiento global.</P>
<P>Una vez creadas las particiones, hay que definir tambi&eacute;n en fdisk el uso
que van a tener (tipo de partici&oacute;n), siendo obviamente "linux swap partition"
(tipo 83) para el swap, y "Linux native partition" para el propio linux. Al final,
y siguiendo con este ejemplo, tendr&aacute;s tres particiones definidas:</P>
<P>
<UL>
<LI>MSDOS, marcada como "activa", con el arranque.</LI>
<LI>Linux swap.</LI>
<LI>Linux Native, donde residir&aacute; el linux.</LI>
</UL>
</P>
<P>NO TENGAS MIEDO POR TOCAR Y PROBAR: HASTA QUE NO USES LA OPCION DE ESCRIBIR
A DISCO, PUEDES HACER TODO TIPO DE PRUEBAS Y/O CANCELARLO TODO HASTA ESTAR
SEGURO Y GRABAR LA NUEVA TABLA DE PARTICIONES.</P>
<P>Es probable que haya que rearrancar si modificamos las particiones, y continuar
con el software de instalaci&oacute;n de nuestro Linux. En el caso de Slackware, ese
software de instalaci&oacute;n ya necesita al menos 8Mb de memoria, por lo que si estamos
justos de memoria tendremos que activar ya mismo el swap antes de ejecutarlo. Si
ese es el caso, hay que hacerlo en dos pasos: formatear la partici&oacute;n de swap y
luego activarla para que empiece a complementar la RAM. Los comandos ser&iacute;an</P>
<P>
<HR>
<PRE>
  mkswap -c /dev/hdXX
  swapon /dev/hdXX
</PRE>
<HR>
</P>
<P>donde <CODE>/dev/hdXX</CODE> ser&iacute;a el nombre de la partici&oacute;n que hemos definido
como swap. Una vez hecho esto, Slackware ya aporta una utilidad de instalaci&oacute;n que
detectar&aacute; las particiones creadas y proceder&aacute; con el resto de la instalaci&oacute;n
con la aplicaci&oacute;n "setup", que nos guiar&aacute; durante toda la instalaci&oacute;n con un
sencillo interfaz de men&uacute;s, que no requiere muchas explicaciones. Durante una de
las etapas de la instalaci&oacute;n Setup intentar&aacute; preparar el swap. Si lo hemos hecho
ya a mano habr&aacute; que indicarle que se lo salte, mientras que en el resto de los casos
dejaremos que setup haga todo lo que tenga que hacer.</P>

<H3>Instalaci&oacute;n de los discos.</H3>


<P>Slackware divide la distribuci&oacute;n del sistema operativo en "series" tem&aacute;ticas,
y a su vez cada una de ellas en directorios que se corresponden perfectamente con
disquetes de 1.44Mb. Los discos esenciales ser&iacute;an los de la "Serie A", con los que
el sistema ya es arrancable aut&oacute;nomamente desde el disco duro, aunque en la pr&aacute;ctica
l&oacute;gicamente instalaremos tambi&eacute;n la "AP" (aplicaciones b&aacute;sicas), "N" (software
de red, si vamos a conectarnos con cualquier modalidad), "D" (compiladores y librer&iacute;as),
"X" y "XAP" para el entorno gr&aacute;fico XFree86.</P>
<P>Por su parte RedHat organiza el software tambi&eacute;n en "paquetes" instalables de forma
independiente y tambi&eacute;n agrupados por temas, aunque no sigue ning&uacute;n esquema
traducible en disquetes, por lo que las &uacute;nicas v&iacute;as de instalaci&oacute;n son CDROM
o directamente de la red.</P>

<H3>Configuraci&oacute;n</H3>

<P> </P>
<P>Una vez cargados a disco los paquetes de software, la siguiente fase ser&aacute; la de
configuraci&oacute;n, que se realiza desde el mismo programa de setup. Como esta parte es
muy variable y depende de cada caso. Nos centraremos en dos puntos t&iacute;picamente
problematicos: el arranque del sistema (incluida la posibilidad de arrancar m&uacute;ltiples
sistemas operativos desde distintas particiones o distintos discos) y la configuraci&oacute;n
de red</P>
<P>Para instalar un m&eacute;todo de arranque de Linux hay dos utilidades: "Lilo" y "Loadlin".
La primera es un peque&ntilde;o programa que se instala en el "Master boot record" del disco
duro o en la partici&oacute;n que fdisk marc&oacute; como "activa", y que permite arrancar
indistintamente Linux, DOS 6.x, Windows95, etc. La segunda es una utilidad de MSDOS que
permite dejar en paz los arranques de particiones, haciendo en su lugar un "arranque
en caliente" directamente desde DOS. Ambos funcionan bien, por lo que elegir una u otra es cuesti&oacute;n
de preferencias de cada cual. En el segundo caso podr&iacute; darnos alg&uacute;n error si
hubiera alg&uacute;n programa de DOS residente en memoria que
pueda obstaculizar la carga de Linux. Eso es relativamente facil de solucionar jugando
un poco con las configuraciones de DOS (incluso con los menus de arranque que incorpora
el config.sys de MSDOS 6.x), pero incluso en ese caso podemos encontrarnos dos obstaculos
mas: si tenemos instalado DoubleSpace/Drivespace hay que evitar que se cargue en memoria pulsando F8
durante el inicio de DOS para poder ejecutar Loadlin (no hay otra forma de pararlo ya que
normalmente se carga incluso antes que config.sys), y ademas si usamos Windows95 hay que
pulsar igualmente F8 para arrancar con solo el s&iacute;mbolo del sistema, evitando entrar en el
modo gr&aacute;fico.</P>
<P>Linux puede convivir con cualquier sistema operativo, pero unos dan mas dolores de cabeza
que otros, por lo que en caso de duda acude a la documentaci&oacute;n correspondiente (la de
instalaci&oacute;n de la propia distribuci&oacute;n y la Booting-HOWTO. De todas formas, si una
vez instalado Linux no conseguimos arrancarlo (sabemos que est&aacute; ah&iacute; pero no conseguimos
entrar en &eacute;l), siempre queda un recurso asequible: introduce el "boot disk" y en vez de
darle a INTRO cuando te aparezca un simbolo "boot", teclea <CODE>root=</CODE>dev/XXXX/ indicando
que ya hay un Linux en la partici&oacute;n correspondiente, y que debe usarlo en vez de
continuar con una hipot&eacute;tica instalaci&oacute;n. Lo &uacute;nico diferente es que se estar&iacute;a
usando el n&uacute;cleo (kernel) del disquete en vez del instalado en el disco duro, pero a
partir de ah&iacute; montar&aacute; la partici&oacute;n del disco duro y usar&aacute; todo lo ya instalado all&iacute;.</P>
<P>Otro problema frecuente (solventado en la &uacute;ltima version de RedHat pero no a&uacute;n en
Slackware) es que graba en el disco duro un n&uacute;cleo gen&eacute;rico en vez del que hayamos
usado en el "boot disk", que era precisamente el que hab&iacute;amos elegido, por lo que es
habitual que, si necesitamos alg&uacute;n controlador espec&iacute;fico
para alg&uacute;n dispositivo o cualquier otra funcionalidad, cuando arranquemos directamente desde el disco duro ya no nos
lo reconocer&aacute;. Si estamos usando LILO haz lo siguiente para arreglarlo: entra como
superusuario, copia la imagen que habias usado para generar el "boot disk" sobre el
fichero "/vmlinuz" del disco duro y ejecuta "lilo" para reinstalar el arranque con el
n&uacute;cleo correcto. Si estas usando LOADLIN, simplemente dale como par&aacute;metro el fichero
del n&uacute;cleo correcto (es facil tener varios n&uacute;cleos y elegir en cada caso
el que interese). Seguir arrancando con el disquete como en el caso anterior ser&iacute;a tambi&eacute;n
otra posibilidad para no perder ese CDROM, esa tarjeta, etc.</P>


<HR>
<A HREF="Spanish-Como-2.html">Anterior</A>
<A HREF="Spanish-Como-4.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc3">Indice</A>
</BODY>
</HTML>
