<HTML>
<HEAD>
<TITLE>Spanish Linux HOWTO: Espa&ntilde;olizaci&oacute;n de Linux</TITLE>
</HEAD>
<BODY>
<A HREF="Spanish-Como-3.html">Anterior</A>
<A HREF="Spanish-Como-5.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. <EM>Espa&ntilde;olizaci&oacute;n</EM> de Linux</A></H2>


<P>Uno de los aspectos m&aacute;s molestos es no poder escribir con naturalidad en nuestro
idioma por falta de soporte de los caracteres especiales en el software. El juego de
caracteres b&aacute;sico de ASCII
es de 7 bits, y no incluye ni las vocales acentuadas ni nuestra maltratada '&ntilde;'.  Hay
una norma ISO-8859-1 (&oacute; ISO-Latin1) que s&iacute; que abarca todos los caracteres pero
que sigue dando la lata en muchas tareas habituales, como el correo electr&oacute;nico
(muchos sistemas solo respetan 7 bits, por lo que textos que podemos ver correctamente
en nuestro ordenador probablemente se visualizar&aacute;n de forma lamentable cuando los enviemos a otra
persona. A continuaci&oacute;n se mencionan algunas de las situaciones m&aacute;s frecuentes y c&oacute;mo
intentar solucionarlas.</P>

<H2><A NAME="ss4.1">4.1 Consola</A></H2>


<P><EM> ...O c&oacute;mo demonios poder usar acentos en nuestro propio ordenador</EM></P>

<P>Mediante el comando loadkeys se cargan las tablas de traducci&oacute;n del teclado.
Estas tablas traducen los c&oacute;digos que se generan al pulsar las teclas a los que
reciben los programas. Los ficheros que contienen estas tablas de traducci&oacute;n se
encuentran en el directorio <CODE>/usr/lib/kbd/keytables/</CODE> y el fichero que
contiene el mapeado del teclado espa&ntilde;ol se denomina <CODE>es.map</CODE>. Su objetivo es
que si pulsamos una determinada combinaci&oacute;n de teclas, aparezca en pantalla
el car&aacute;cter que tenemos pintado en nuestro teclado, y no su equivalente en el
teclado que se usa en cualquier otro pa&iacute;s.</P>
<P>La llamada a este comando suele ser de la forma siguiente, que aparecer&aacute;
en el arranque por defecto (en Slackware estar&iacute;a en<CODE>/etc/rc.d/rc.keymap</CODE>):</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
loadkeys /usr/lib/kbd/keytables/es.map
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><EM>Nota del autor: A igual configuraci&oacute;n de teclado, m&aacute;s de una vez me
han fallado los acentos por recompilar el n&uacute;cleo, pero en el momento de escribir
estas l&iacute;neas a&uacute;n no he visto la causa...</EM></P>


<H2><A NAME="ss4.2">4.2 Shell bash</A></H2>


<P>Para que la bash soporte el uso de vocales acentuadas asi como de la letra
&ntilde; basta con incluir las siguientes l&iacute;neas en un fichero <CODE>.inputrc</CODE>
(o al menos en <CODE>.bash_profile</CODE>) en tu $HOME:</P>
<P>
<HR>
<PRE>
set meta-flag on                # conservar bit 8 en entrada de teclado
set output-meta on      # conservar bit 8 en salida por terminal
set convert-meta off    # no convertir secuencias de escape

export LC_CTYPE=ISO_8859_1
</PRE>
<HR>
</P>


<H2><A NAME="ss4.3">4.3 Shell tcsh</A></H2>


<P>Para que la tcsh soporte el uso de vocales acentuadas asi como de la letra
&ntilde; basta con incluir las siguientes l&iacute;neas en un fichero <CODE>.tcshrc</CODE>
(o al menos en <CODE>.login</CODE>) en tu $HOME:</P>
<P>
<HR>
<PRE>
setenv LANG C
setenv LC_CTYPE &quot;iso_8859_1&quot;
</PRE>
<HR>
</P>


<H2><A NAME="ss4.4">4.4 Algunas aplicaciones</A></H2>


<P>Ser&iacute;a excesivamente largo detallar todas las posibilidades para trabajar
con caracteres de 8 bits en todas las aplicaciones, utilidades, comandos
del sistema, etc. Aqu&iacute; van algunos ejemplos:</P>
<P>
<DL>
<DT><B>Editor joe</B><DD><P>Joe tiene un par&aacute;metro <CODE>-asis</CODE> para que conserve los caracteres de 8 bits.</P>
<DT><B>less</B><DD><P>Por defecto muestra solamente los caracteres de 7 bits (los de 8 los
representa por su c&oacute;digo ASCII). Ello protege
de ver en pantalla "basura" si por error intentamos leer ficheros binarios,
de datos, etc., pero impide ver nuestros acentos. Se puede modificar
moment&aacute;neamente con el modificador <CODE>-r</CODE> desde la propia utilidad,
pero ser&iacute;a mejor tener definida la variable de entorno <CODE>LESSCHARSET=latin1</CODE>.</P>
<DT><B>ls</B><DD><P>Para que muestre los caracteres especiales en los nombres de los ficheros tiene
las opciones <CODE>-8 -N</CODE>, que se pueden a&ntilde;adir a la variable <CODE>LS_OPTIONS</CODE>
que probablemente ya tengas definida por defecto.</P>
<DT><B>mc</B><DD><P>Este cl&oacute;nico Norton tiene una opci&oacute;n <EM>Full 8 bits</EM> del submen&uacute;
<EM>Display bits...</EM> bajo <EM>Options</EM>.</P>
<DT><B>nroff, groff</B><DD><P>Dispone de una opci&oacute;n <CODE>-Tlatin1</CODE></P>
</DL>
</P>


<H2><A NAME="ss4.5">4.5 Xwindow</A></H2>


<P>El entorno gr&aacute;fico XWindow usa para configurar el teclado un comando llamado
<CODE>xmodmap</CODE> que tiene la misma funcion que <CODE>loadkeys</CODE> para la consola de
texto. Ernest Artiaga (drw@portos.upc.es) prepar&oacute; un fichero de configuracion
para Xmodmap que genera los acentos con la tecla <F>AltGr</F>, que entre otros sitios puede encontrar
en 
<A HREF="ftp://ftp.cs.us.es/pub/Linux/contrib/Xmodmap-es">ftp://ftp.cs.us.es/pub/Linux/contrib/Xmodmap-es</A>, y que podemos
colocar como $HOME/.xmodmap para que se cargue como parte de nuestra
configuraci&oacute;n. Existe tambi&eacute;n una utilidad <CODE>/usr/lib/kbd/keytables/mk_modmap</CODE>
que genera un listado para Xmodmap a partir del mapa de teclado usado por loadkeys.</P>
<P>De todas formas este m&eacute;todo no es perfecto, ya que muchas aplicaciones bajo Xwindow
tienen su propia forma de configuraci&oacute;n o simplemente no tienen soporte para caracteres
extendidos por lo que a veces es posible que podamos usar acentos en una ventana y no
en la aplicaci&oacute;n de la ventana de al lado.</P>


<H2><A NAME="ss4.6">4.6 Emulador de DOS (DOSEMU)</A></H2>


<P>La linea de configuraci&oacute;n del teclado en <CODE>/etc/dosemu.conf</CODE> deber&aacute;
incluir '<CODE>layout es-latin1</CODE>' para poder usar la '&ntilde;' y las aperturas
de interrogaci&oacute;n y admiraci&oacute;n. Una vez hecho esto, es posible cargar la
configuraci&oacute;n habitual con <CODE>keyb sp</CODE> desde el propio emulador de DOS, o
bien ejecutar '<CODE>keybes2.com</CODE>, una peque&ntilde;a utilidad para el propio emulador
disponible en varias de las direcciones habituales.</P>


<H2><A NAME="ss4.7">4.7 Correo electr&oacute;nico</A></H2>


<P>Por &uacute;ltimo en relaci&oacute;n con el uso del espa&ntilde;ol en Linux, pero no menos
importante, es poder leer y recibir por mensajer&iacute;a electr&oacute;nica textos
escritos en espa&ntilde;ol sin deformar su contenido ni perder los acentos y
s&iacute;mbolos propios.</P>
<P>El problema se reduce a lo de siempre: el uso de
caracteres especiales no incluidos en la tipograf&iacute;a b&aacute;sica sajona requiere
trabajar con 8 bits, pero a&uacute;n hay muchos sistemas que siguen trabajando con
7 bits, lo que trunca o deforma mensajes escritos sin las debidas precauciones.</P>
<P>En el est&aacute;ndar RFC822 que define el formato usado en los mensajes de correo
de Internet no se permite el uso de 8 bits en las <EM>cabeceras</EM> de los mensajes,
dejando abierta la posibilidad de 8 bits en el <EM>cuerpo</EM> del mensaje. Pero
tampoco podemos abusar de esa posibilidad ya que no tenemos garant&iacute;as de que
lo respete cualquier sistema que pueda recibir nuestros documentos. Una soluci&oacute;n
cada vez m&aacute;s extendida, y que permite a los usuarios escribir con libertad y
enviar pr&aacute;cticamente cualquier informaci&oacute;n dejando todos esos detalles al software
de gesti&oacute;n del correo (tanto los <EM>agentes de usuario</EM> como los <EM>agentes de
transporte</EM> en los servidores de correo) es mediante el estandar MIME, que
permite <EM>codificar</EM> nuestros mensajes de 8 bits y reducirlos a caracteres
de 7 bits que puedan pasar a trav&eacute;s de cualquier sistema sin peligro de
perder informaci&oacute;n. El inconveniente (cada vez menor a medida que este sistema
se extienda m&aacute;s y m&aacute;s) es que si intentamos leer un mensaje con codificaci&oacute;n
MIME sin un software que no implemente este sistema y no pueda interpretarlo,
puede que veamos "basura" intercalada con nuestro mensaje, o que incluso no
entendamos nada de nada.</P>
<P>MIME deja toda la responsabilidad al software, por lo que si ambos extremos
(remitente y destinatario) usan software compatible con MIME, el usuario
puede enviar junto a textos simples cualquier combinaci&oacute;n de tipos de ficheros
(documentos generados por procesadores de textos, gr&aacute;ficos, sonido, video, etc). Ni siquiera
es necesario que ambos usen el mismo software. Basta con que ambos sean capaces
de generar la codificaci&oacute;n durante el env&iacute;o, y de interpretarla en la recepci&oacute;n.</P>



<HR>
<A HREF="Spanish-Como-3.html">Anterior</A>
<A HREF="Spanish-Como-5.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc4">Indice</A>
</BODY>
</HTML>
