<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.38">
 <META NAME="LFCATEGORY" CONTENT="Community">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf312, Community: Ambientes Colaborativos Virtuales y sus ventajas</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 pre.code { font-family:monospace,Courier;background-color:#aedbe8; }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Carlos     Andr&eacute;s P&eacute;rez
 =LF=CAT___: Community
 =LF=TITLE_: Ambientes Colaborativos Virtuales y sus ventajas
 =LF=NUMBER: 312
 =LF=ANAME_: article312.shtml
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar, style=2 -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top">
                 <A class="nodec" href="./"><FONT color=
                 "#DDDDDD" size="2">&lt;--</FONT></A> &nbsp;| 
                 <A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;| 
                 <A class="nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;| 
                 <A class="nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;| 
                 <A class="nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<img src="../../common/images/CarlosAndresPerez.jpg" alt=
    "[Photo of the Author]" width="100" height="105">
<BR>por  Carlos Andr&eacute;s P&eacute;rez <br> <small>&lt;caperez/at/usaca.edu.co&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<p>Especialista en Simulaci&oacute;n Molecular, Doctorando en
    Biotecnolog&iacute;a. Asesor t&eacute;cnico del Grupo de
    Investigaci&oacute;n en Educaci&oacute;n Virtual (GIEV).
    Direcci&oacute;n: Universidad Santiago de Cali, Calle 5&ordf;
    carrera 62 Campus Pampalinda, Cali &ndash; Colombia.</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#312lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#312lfindex1">Materiales y M&eacute;todo</A></LI>
  <LI><A HREF="#312lfindex2">Resultados</A></LI>
  <LI><A HREF="#312lfindex3">Referencias Bibliogr&aacute;ficas</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=312">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Ambientes Colaborativos Virtuales y sus ventajas</H2>
 <img src="../../common/images/article312/edu.gif" alt=
    "[Illustration]" hspace="10" width="230" height="151">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->

    El presente escrito es producto de las experiencias obtenidas
    en el desarrollo y puesta en marcha del primer diplomado en
    docencia universitaria de la Universidad Santiago de Cali y
    otros cursos impartidos mediante la utilizaci&oacute;n de
    ambientes colaborativos virtuales, videoconferencia y chat,
    cuya edificaci&oacute;n se inicio a partir del problema:
    &iquest;Cu&aacute;les son las condiciones, criterios y
    metodolog&iacute;as requeridos para la construcci&oacute;n de
    escenarios educativos sobre la base de mediaciones
    tecnol&oacute;gicas, que favorezcan nuevos modos de aprender y
    nuevas relaciones educador-educando?. Los resultados de esta
    primer experiencia de aprendizaje en ambientes colaborativos y
    cooperativos virtuales logr&oacute; propiciar espacios en los
    cuales se dio el desarrollo de habilidades individuales y
    grupales a partir de la discusi&oacute;n entre estudiantes
    localizados en diferentes regiones de Colombia, al momento de
    explorar nuevos conceptos, siendo cada quien responsable tanto
    de su propio aprendizaje como del de los dem&aacute;s miembros
    del grupo.

    
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


    <A NAME="312lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>


    <p>En estos momentos la educaci&oacute;n virtual aporta, entre
    otras cosas, un valor agregado de inmediatez, telepresencia e
    interacci&oacute;n al modelo convencional de educaci&oacute;n
    superior.<br>
     Varias teor&iacute;as del aprendizaje pueden aplicarse a este
    tipo de ambientes virtuales, entre ellas las de Piaget,
    Vigotsky [2] y Dewey. Los ambientes de aprendizaje
    colaborativos y cooperativos preparan al estudiante para
    [1,4]:<br>
    </p>

    <ul>
      <li>Participar activamente en la construcci&oacute;n
      colectiva.</li>

      <li>Asumir y cumplir compromisos grupales.</li>

      <li>Dar ayuda a los dem&aacute;s y pedirla cuando se
      requiera.</li>

      <li>Poner al servicio de los dem&aacute;s sus fortalezas
      individuales.</li>

      <li>Comprender las necesidades de los dem&aacute;s.</li>

      <li>Descubrir soluciones que beneficien a todos.</li>

      <li>Establecer contacto significativo con comunidades que
      poseen culturas diferentes.</li>

      <li>Contrastar sus actividades y creencias con las de los
      dem&aacute;s.</li>

      <li>Establecer metas, tareas, recursos, roles, etc.</li>

      <li>Escuchar cr&iacute;tica y respetuosamente a sus
      interlocutores.</li>

      <li>Exponer sus ideas y planteamientos en forma
      argumentada.</li>

      <li>Aceptar la cr&iacute;tica razonada de parte de otras
      personas.</li>

      <li>Ceder ante evidencia o argumentaci&oacute;n de peso.</li>

      <li>Reconocer los cr&eacute;ditos ajenos.</li>

      <li>Negociar lenguaje y m&eacute;todos.</li>

      <li>Desarrollar habilidades interpersonales.</li>

      <li>Familiarizarse con procesos democr&aacute;ticos.<br>
      </li>

      <li>El crecimiento acelerado de Internet ha posibilitado la
      creaci&oacute;n de ambientes colaborativos y cooperativos que
      cruzan fronteras. Ahora los estudiantes pueden
      &lsquo;salir&rsquo; de su mundo cotidiano para embarcarse en
      una aventura con compa&ntilde;eros de pr&aacute;cticamente
      cualquier parte del mundo. Este tipo de trabajo a distancia,
      posibilitado por Internet, se compone de proyectos en forma
      de actividad did&aacute;ctica que debe desarrollarse en
      grupo, en el que los participantes no son simplemente
      &lsquo;amigos por correspondencia&rsquo;, sino que conforman
      un equipo que debe lograr un objetivo. En la
      planificaci&oacute;n de este tipo de actividades es muy
      importante que para solucionar los retos planteados a los
      participantes, se requiera de estos una comunicaci&oacute;n
      efectiva, buscando con lo anterior que la comunicaci&oacute;n
      y la interacci&oacute;n sean necesarias y significativas
      [3].<br>
      </li>
    </ul>

    <p>Las aplicaciones cada vez m&aacute;s ricas e integradoras de
    la multimedia educativa , la cada vez m&aacute;s poderosa
    plataforma de redes de comunicaci&oacute;n y transmisi&oacute;n
    de datos en diversos formatos, ha sido utilizada por el Grupo
    de Investigaci&oacute;n en Educaci&oacute;n Virtual de la
    Universidad Santiago de Cali (GIEV: http://cvw.usaca.edu.co) en
    la contribuci&oacute;n para la creaci&oacute;n de ambientes
    pedag&oacute;gicos que por su versatilidad para el
    procesamiento, manejo y recuperaci&oacute;n de
    informaci&oacute;n disponible en los soportes
    electr&oacute;nicos y documentales, favorezcan la actividad
    cognitiva y la formaci&oacute;n investigativa y
    cient&iacute;fica de los aprendices. Es competencia de este
    grupo de investigaci&oacute;n orientar a directivos y docentes
    de la instituci&oacute;n, en la gesti&oacute;n de recursos
    tecnol&oacute;gicos con una visi&oacute;n clara de sus
    posibilidades y su papel dentro del entorno educativo.<br>
     Todo este enfoque investigativo se sustenta en la
    convicci&oacute;n de que no es la tecnolog&iacute;a en
    s&iacute; misma la que introduce calidad en los sistemas
    educativos, sino su uso planificado y la adopci&oacute;n
    cr&iacute;tica basada en las caracter&iacute;sticas propias del
    contexto adem&aacute;s de las lecciones que dejan las
    experiencias referenciales e investigaciones preliminares en
    otros contextos.<br>
     La Educaci&oacute;n Virtual no se puede asimilar solo como
    metodolog&iacute;a de educaci&oacute;n a distancia o asociada
    con programas en esa modalidad, ni solo en Educaci&oacute;n
    Superior. El GIEV revisa las posibilidades de plantear
    escenarios de mediaci&oacute;n con tecnolog&iacute;a para
    ampliar las alternativas de desarrollo curricular presenciales
    con la ideaci&oacute;n de nuevos entornos virtuales que se
    articulen estrat&eacute;gicamente agregando valor a los modelos
    de ense&ntilde;anza y de formaci&oacute;n en distintos niveles
    y poblaciones educativas en la regi&oacute;n.<br>
    </p>

    <p>Con estos lineamientos, se inicio una serie de acciones para
    implementar el modelo de educaci&oacute;n virtual, en primera
    instancia al interior de nuestra instituci&oacute;n pues se
    consider&oacute; viable la articulaci&oacute;n de esfuerzos y
    recursos humanos, log&iacute;sticos y t&eacute;cnicos en una
    tarea que trascienda y produzca cambios sustanciales en el
    quehacer educativo y que desde la instituci&oacute;n superior
    se proyecte a la comunidad acad&eacute;mica, irradiada desde el
    Grupo de Educaci&oacute;n Virtual (GIEV), de nuestra Alma
    mater. El proyecto de Educaci&oacute;n Virtual se justifica
    entonces no solo para crear nuevas formas de trabajo docente
    sino para hacer funcionar mejor un proceso que se viene
    redimensionando y reconceptualizando en la &uacute;ltima
    d&eacute;cada debido a la marcada influencia de las
    tecnolog&iacute;as en el ser y hacer de la sociedad actual.<br>
    </p>

    <A NAME="312lfindex1">&nbsp;</A>
<H2>Materiales y M&eacute;todo</H2>


    <p>La base probl&eacute;mica de formulaci&oacute;n para este
    trabajo se concret&oacute; as&iacute;:<br>
     &iquest;Cu&aacute;les son las condiciones, criterios y
    metodolog&iacute;as requeridos para la construcci&oacute;n de
    escenarios educativos sobre la base de mediaciones
    tecnol&oacute;gicas, que favorezcan nuevos modos de aprender y
    nuevas relaciones educador-educando ?<br>
     Dentro de los primeros acercamientos propios del GIEV con los
    diferentes estamentos institucionales se encontr&oacute; un
    marco amplio de opciones de interrogaci&oacute;n que se
    afin&oacute; durante dos a&ntilde;os de interlocuci&oacute;n y
    encuentros, proceso &uacute;til para delimitar el estudio, la
    caracterizaci&oacute;n de la realidad , la acci&oacute;n y la
    intervenci&oacute;n mediada con tecnolog&iacute;as:<br>
    </p>

    <p>&iquest;Qu&eacute; es educar en Tecnolog&iacute;a?<br>
     &iquest;Cu&aacute;les son las bases para la
    incorporaci&oacute;n de Medios en el curr&iacute;culo desde una
    pedagog&iacute;a de la Comunicaci&oacute;n y de lo
    audiovisual?<br>
     &iquest;Cu&aacute;l es la relaci&oacute;n (es) existente entre
    los docentes y educandos universitarios de la Universidad, con
    los recursos tecnol&oacute;gicos de la informaci&oacute;n y de
    la comunicaci&oacute;n?<br>
     &iquest;Qu&eacute; aspectos cient&iacute;ficos,
    pedag&oacute;gicos y computacionales se requieren para la
    incorporaci&oacute;n apropiada de tecnolog&iacute;as en los
    procesos educativos?.<br>
     &iquest;Qu&eacute; aspectos cient&iacute;ficos,
    pedag&oacute;gicos y computacionales se requieren para la
    implementaci&oacute;n de un modelo de Educaci&oacute;n Virtual
    desde la Universidad?.<br>
     &iquest;C&oacute;mo influye la incorporaci&oacute;n de estos
    dispositivos tecnol&oacute;gicos en las din&aacute;micas de
    ense&ntilde;anza y aprendizaje?<br>
     &iquest;Siempre que hablamos de educaci&oacute;n Virtual
    estamos caracterizando escenarios de la modalidad de
    educaci&oacute;n a distancia?<br>
    </p>

    <p>El emprender la investigaci&oacute;n en el campo de
    tecnolog&iacute;as aplicadas al curr&iacute;culo al interior de
    la Universidad Santiago de Cali, y a las comunidades educativas
    del sector de influencia desde el concepto de mediaci&oacute;n
    para el aprendizaje y desde la valoraci&oacute;n de la utilidad
    de los proyectos colaborativos virtuales as&iacute; como de
    otras estrategias permiti&oacute; elaborar formulaciones y
    modelamientos precisos desde la toma de conciencia
    institucional de que este proceso va m&aacute;s all&aacute; de
    aprender como se aplican las nuevas tecnolog&iacute;as a la
    educaci&oacute;n y aplicarlas experimentando con ellas,
    desconociendo las virtudes de los cambios que eventualmente
    pueden generar. En t&eacute;rminos de alcance de este proyecto,
    la idea es que a mediano plazo , profesores universitarios,
    maestros en formaci&oacute;n y en ejercicio de las diferentes
    &aacute;reas y alumnos de los diferentes niveles, desarrollen y
    apliquen habilidades anal&iacute;ticas en el uso de los nuevos
    instrumentos y de los canales de interlocuci&oacute;n y que
    sean capaces de reflejar a trav&eacute;s del gestionar,
    producir y compartir la informaci&oacute;n, la cultura
    adquirida y propagar la tradici&oacute;n as&iacute; como la
    megahabilidad de transformar y a&ntilde;adir valor a cada vez
    m&aacute;s informaci&oacute;n lo que contribuir&aacute; a la
    generaci&oacute;n y actualizaci&oacute;n de conocimientos y a
    la resoluci&oacute;n de problemas contextuales de sus
    comunidades educativas a trav&eacute;s de proyectos
    pedag&oacute;gicos que se puedan construir colectivamente y
    luego socializar.<br>
    </p>

    <p>El modelo que se opto para impartir el diplomado en docencia
    para la educaci&oacute;n superior fue el de aprendizaje
    colaborativo, toda la infraestructura tecnol&oacute;gica
    utilizada se desarrollo mediante la utilizaci&oacute;n de
    herramientas libres. El sistema operativo utilizado ha sido
    Linux, dado que ha mostrado una gran estabilidad, rapidez y
    confiabilidad como servidor<br>
    </p>

    <p>La plataforma utilizada ha sido Claroline
    (http://www.claroline.net/index.php), avalada por la UNESCO y
    de c&oacute;digo abierto, desarrollada completamente en PHP, lo
    cual permite f&aacute;cilmente adaptarla, complementarla a la
    necesidades o modelo a implementar.<br>
    </p>

    <p>La base de datos se ha ejecutado mediante MySQL,
    teni&eacute;ndose un promedio de 80 usuarios diarios en
    l&iacute;nea de manera simultanea.<br>
    </p>

    <p>El hardware utilizado ha sido bastante econ&oacute;mico ya
    que Linux es un sistema operativo tipo Unix para PC&acute;s, lo
    cual, en estas primeras etapas de planeaci&oacute;n, desarrollo
    y experimentaci&oacute;n, ha permitido que se utilice los
    recursos inform&aacute;ticos con que cuenta la
    instituci&oacute;n sin la necesidad de invertir grandes
    cantidades de dinero en potentes servidores.<br>
    </p>

    <A NAME="312lfindex2">&nbsp;</A>
<H2>Resultados</H2>


    <p>Mediante la utilizaci&oacute;n de ambiente colaborativos
    virtuales, herramientas inform&aacute;ticas y un modelo
    pedag&oacute;gico colaborativo se logr&oacute;:<br>
     - La eliminaci&oacute;n de uno de los mayores inconvenientes
    del modelo convencional de educaci&oacute;n a distancia: el
    aislamiento del estudiante. Con base en la experiencia
    profesional en este campo, es viable afirmar que dicho modelo
    reduce a escasos momentos el contacto y la interacci&oacute;n
    de los grupos de estudiantes con el docente tutor y, para
    muchos, aun el encuentro presencial con otros compa&ntilde;eros
    es absolutamente imposible. Las nuevas tecnolog&iacute;as
    teleinform&aacute;ticas propician cambios substanciales en la
    concepci&oacute;n de la distancia, el tiempo y las formas de
    comunicaci&oacute;n.</p>

    <p>- A la activaci&oacute;n de los procesos de aprendizaje
    autodirigido, aut&oacute;nomo y autorregulado, de tal forma que
    trasciende la dimensi&oacute;n individual y se proyecte al
    trabajo grupal colaborativo. Los estudiantes y los docentes
    tutores construyen conjuntamente el conocimiento y desarrollan
    aptitudes de tolerancia y cooperaci&oacute;n, indispensable en
    un mundo en el que el conocimiento tiende a ser cada vez
    m&aacute;s social.</p>

    <p>- Lograr un alto nivel de motivaci&oacute;n, pues entre
    muchos j&oacute;venes, el mundo de las computadoras y las
    telecomunicaciones ha causado un gran impacto y sienten que las
    tecnolog&iacute;as forman parte del entorno en que crecen y,
    sobre todo, del mundo laboral al que ingresar&aacute;n. Y el
    modelo de educaci&oacute;n virtual, mediante las redes, puede
    convertir las pantallas de las computadoras en una ventana
    abierta al aprendizaje colaborativo.</p>

    <p>- A la soluci&oacute;n de los graves problemas de
    producci&oacute;n y distribuci&oacute;n de materiales impresos
    y audiovisuales que, en general, ha sido otro de los
    principales factores que dificultan y en muchas ocasiones hacen
    fracasar los programas convencionales a distancia. Los
    contenidos no est&aacute;n limitados a las propuestas
    institucionales o del docente tutor pues los mismos estudiantes
    pueden encontrar en la red numerosos acervos y m&uacute;ltiples
    bancos de informaci&oacute;n.</p>

    <p>- A la flexibilidad del modelo pedag&oacute;gico de
    educaci&oacute;n virtual y a distancia pues propicia la
    adecuaci&oacute;n del mismo a las necesidades de aprendizaje de
    los diversos grupos de destinatarios. De ah&iacute; que el
    modelo pedag&oacute;gico m&aacute;s recomendado para la
    educaci&oacute;n virtual y a distancia sea el trabajo
    cooperativo en medios virtuales de aprendizaje,] pues estimula
    tanto la participaci&oacute;n individual como la grupal,
    siempre y cuando el modelo tome en cuenta el conocimiento
    previo de las necesidades y posibilidades espec&iacute;ficas de
    los participantes, respetando su identidad y su entorno
    sociocultural.</p>

    <p>- A la viabilidad para llevar un registro hist&oacute;rico
    de todo el proceso de desarrollo del aprendizaje de los alumnos
    y de los procesos de interacci&oacute;n entre los estudiantes y
    entre &eacute;stos y los docentes tutores, lo que facilita el
    dise&ntilde;o de nuevas estrategias pedag&oacute;gicas con base
    en los resultados obtenidos en los diversos cursos. Este
    aspecto hab&iacute;a estado ausente de la educaci&oacute;n a
    distancia tradicional, pues los procesos metacognitivos, las
    actitudes, los h&aacute;bitos y los valores de los grupos de
    estudiantes muy pocas veces se registraban.</p>

    <p>- Fomentar, mediante el chat, la organizaci&oacute;n de
    ideas de forma escrita y estimular la construcci&oacute;n de
    im&aacute;genes a partir del escrito, como la formaci&oacute;n
    de conceptos sobre los compa&ntilde;eros debido a los textos
    expuestos.</p>

    <p>Estas y otras razones nos dan la seguridad de que los
    procesos universitarios de educaci&oacute;n virtual y a
    distancia se pueden extender a muchos sitios nacionales e
    internacionales, ampliando la cobertura y la calidad de la
    educaci&oacute;n superior y aprovechando mejor las facilidades
    de acceso a la informaci&oacute;n y a los saberes que se
    encuentran en la red y que se ampliar&aacute;n con las
    autopistas de banda ancha, que ya se ofrece a los
    investigadores y a los docentes tutores en Internet 2.</p>

    <p>En s&iacute;ntesis, los ambientes virtuales colaborativos
    brindan a grupos de estudiantes universitarios de pregrado y
    postgrado espacios o puntos de encuentro con la finalidad de
    establecer una interacci&oacute;n sistem&aacute;tica con otros
    estudiantes y con los docentes tutores, aportando en forma
    mancomunada las habilidades y destrezas requeridas para la
    construcci&oacute;n del conocimiento en grupos virtuales de
    aprendizaje cooperativo.<br>
    </p>

    <p>&nbsp;</p>

    <A NAME="312lfindex3">&nbsp;</A>
<H2>Referencias Bibliogr&aacute;ficas</H2>


    <p>[1] Manuel Antonio Unigarro Guti&eacute;rrez,
    Educaci&oacute;n Virtual: Encuentro Formativo en el
    Ciberespacio. Editorial UNAB, Bucaramanga, Colombia, 2001.<br>
     [2] Luz Adriana Osorio G&oacute;mez, cap&iacute;tulo
    &ldquo;Aprendizaje en Ambientes Virtuales y
    Colaborativos&rdquo; del libro &ldquo;Los Computadores en la
    Nueva Visi&oacute;n Educativa&rdquo;, Escuela Colombiana de
    ingenier&iacute;a, 2000.<br>
     [3] Propuesta de Integraci&oacute;n de las Tecnolog&iacute;as
    de Informaci&oacute;n y Comunicaciones a los Centros Escolares
    de Fe y Alegr&iacute;a. <a href=
    "http://www.feyalegria.org">http://www.feyalegria.org</a><br>
     [4] Jos&eacute; Guadalupe Escamilla, &ldquo;Selecci&oacute;n y
    Uso de Tecnolog&iacute;a Educativa&rdquo;, segunda
    edici&oacute;n, Trillas, ITESM, 1999.<br>
    </p>
    <!-- vim: set sw=2 ts=2 et: -->
  



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=312"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<a style="background-color:#bdc6d5" href="./">&lt;--, back to the index of this issue </a><br><HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#bdc6d5" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Carlos     Andr&eacute;s P&eacute;rez, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#bdc6d5">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">es --&gt; -- : Carlos Andr&eacute;s P&eacute;rez <small>&lt;caperez/at/usaca.edu.co&gt;</small></font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2003-08-26, generated by lfparser version 2.38</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
