<HTML>
<HEAD>
<TITLE>Linux COMO Servidor de Intranets: Acceso al servidor Web</TITLE>
</HEAD>
<BODY>
<A HREF="Servidor-Intranet-Como-5.html">Anterior</A>
<A HREF="Servidor-Intranet-Como-7.html">Siguiente</A>
<A HREF="Servidor-Intranet-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Acceso al servidor Web</A></H2>


<P>Ahora que tenemos configurado el servidor de HTTP, los clientes y el
servidor Linux interconectado con otros servidores, es necesario hacer
unos peque&ntilde;os ajustes para permitir el acceso a los sistemas de archivos
montados en la m&aacute;quina Linux desde el navegador Web.</P>

<H2><A NAME="ss6.1">6.1 Acceso a los sistemas de archivos externos montados en el servidor</A>Linux</H2>


<P>Para acceder a los directorios externos montados en el servidor Linux,
donde residen las p&aacute;ginas HTML puede usar dos m&eacute;todos: </P>
<P>
<UL>
<LI>Crear un enlace simb&oacute;lico en el directorio designado como
<CODE>DocumentRoot</CODE> para el servidor HTTP,
(<CODE>/usr/local/etc/httpd/htdocs</CODE>) que apunte al directorio
montado
<SL>N. del Revisor <BR> Los comandos suponen que est&aacute; usted
en <CODE>/usr/local/etc/httpd/htdocs</CODE></SL>
:

<BLOCKQUOTE><CODE>
<PRE>
ln -s /mnt/MIDOM_NW/vol1/home/htmldocs netware
</PRE>
</CODE></BLOCKQUOTE>
                     

o bien

<BLOCKQUOTE><CODE>
<PRE>
   ln -s /mnt/MIDOM_NT    winNT
</PRE>
</CODE></BLOCKQUOTE>

                     
o bien
<BLOCKQUOTE><CODE>
<PRE>
   ln -s /mnt/MIDOM_UNIX    unix
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Editar el archivo <CODE>srm.conf</CODE> del directorio
<CODE>/usr/local/etc/httpd/conf</CODE> y a&ntilde;adir un nuevo alias: 

<BLOCKQUOTE><CODE>
<PRE>
       # Alias pseudonimo nombre real
       Alias /icons/     /usr/local/etc/httpd/icons/

       # alias para sistemas de ficheros externos montados en la maquina
       Alias /netware/   /mnt/MIDOM_NW/vol1/home/htmldocs/
       Alias /winNT/     /mnt/MIDOM_NT/
       Alias /unix/      /mnt/MIDOM_UNIX
</PRE>
</CODE></BLOCKQUOTE>


reinicialice HTTPd. Podr&aacute; acceder a los documentos del servidor netware y
referirse a ellos como <CODE>http://linux.midominio/netware/index.htm</CODE>
para los archivos netware y notaciones similares para los otros. </LI>
</UL>
</P>


<H2><A NAME="ss6.2">6.2 Conexi&oacute;n a Internet</A></H2>


<P>Puede finalmente conectar su Intranet a Internet para acceder a correo
electr&oacute;nico (e-mail) y todo la maravillosa informaci&oacute;n disponible en &Eacute;l. 
Le propongo escribir una breve nota de c&oacute;mo hacer esto en una futura
revisi&oacute;n. Hay explicaciones detalladas el ISP-Hookup-HOWTO
<SL>Para
aquellos en los que en su pa&iacute;s exista el servicio Infov&iacute;a, puede resultar
de utilidad el <I>Infobia-Como</I>, disponible en <CODE>
<A HREF="http://sunsite.unc.edu/pub/Linux/docs/howto/translations/es">sunsite.unc.edu/pub/Linux/docs/howto/translations/es</A></CODE></SL>

disponible en <CODE>
<A HREF="http://sunsite.unc.edu/mdw/HOWTO/ISP-Hookup-HOWTO.html">http://sunsite.unc.edu/mdw/HOWTO/ISP-Hookup-HOWTO.html</A></CODE> y el
mini-Diald-HOWTO, de <CODE>
<A HREF="http://sunsite.unc.edu/mdw/HOWTO/mini/Diald">http://sunsite.unc.edu/mdw/HOWTO/mini/Diald</A></CODE> para configurar
este tipo de conexiones.</P>


<H2><A NAME="ss6.3">6.3 Otros usos</A></H2>


<P>El servidor HTTPD puede ser usado en la oficina para proveer acceso
transparente a la informaci&oacute;n residente en diferentes servidores, en
varias localizaciones y directorios. La informaci&oacute;n pueden ser simples
documentos en Word, Hojas de c&aacute;lculo de Lotus o complejas bases de datos. </P>
<P>La aplicaci&oacute;n de esta tecnolog&iacute;a esta siendo t&iacute;picamente usada como
sigue:</P>
<P>
<UL>
<LI> Publicaci&oacute;n de documentos corporativos:

Estos documentos pueden incluir noticias, informes anuales, mapas,
instalaciones de la compa&ntilde;&iacute;a, listas de precios, informaci&oacute;n sobre
productos, y cualquier documento que sea de valor en una entidad
corporativa. 
</LI>
<LI>Acceso a directorios de b&uacute;squeda:

Acceso r&aacute;pido a agendas telef&oacute;nicas corporativas y similares. Esta
informaci&oacute;n puede ser replicada en el sitio Web o, v&iacute;a scripts CGI, el
servidor Web puede servir como interfaz a la base de datos preexistente o
nuevas aplicaciones. 

Esto quiere decir que usando los mismos mecanismos de acceso est&aacute;ndar, la
informaci&oacute;n puede hacerse m&aacute;s accesible de una forma simple. Esto
significa que puede ser usada para crear una interface con RDBMS como
ORACLE y SYBASE para generar informaci&oacute;n en tiempo real. 

He aqu&iacute; una lista de enlaces Web que usan este tipo de tecnolog&iacute;a: 

<UL>
<LI><CODE>
<A HREF="http://cscsun1.larc.nasa.gov/~beowulf/db/web_access.html">http://cscsun1.larc.nasa.gov/~beowulf/db/web_access.html</A></CODE>
</LI>
<LI>Interfaces CGI: <CODE>
<A HREF="http://www.w3.org/hypertext/WWW/RDBGate/Overview.html">http://www.w3.org/hypertext/WWW/RDBGate/Overview.html</A></CODE></LI>
</UL>

</LI>
<LI>P&aacute;ginas Corporativas/Departamentales/Individuales:

Las organizaciones deben tender a nivelar cada movimiento departamental
cumpliendo su propia misi&oacute;n individual; la tecnolog&iacute;a de Intranet provee
el medio ideal para acceder a la informaci&oacute;n m&aacute;s reciente sobre
departamentos o individuos. Potentes motores de b&uacute;squeda proporcionar&aacute;n
medios para que la gente busque al grupo o individuo que tiene las
respuestas a las continuas preguntas que se originan en el curso normal de
cada d&iacute;a y durante el desarrollo de los negocios. 
</LI>
<LI>Aplicaciones simples de trabajo en grupo:

Con el soporte de los formularios HTML, los servidores pueden proveer
p&aacute;ginas para firma electr&oacute;nica, supervisi&oacute;n o planificaci&oacute;n simple.
</LI>
<LI>Distribuci&oacute;n del Software: 

Los Administradores pueden usar la Intranet para liberar software y
actualizaciones bajo demanda de los usuarios a trav&eacute;s de la red
corporativa. Esto puede ser hecho con <I>Java</I>, que permite la
creaci&oacute;n y distribuci&oacute;n transparente de objetos en demanda mas que
solamente datos o aplicaciones. Esto es posible m&aacute;s f&aacute;cilmente con las
nuevas versiones de Linux con soporte para Java integrado. 
</LI>
<LI>Correo electr&oacute;nico (<I>email</I>):

Con la tendencia en alza del uso de productos de correo de Intranet como
est&aacute;ndar, as&iacute; como m&eacute;todos simples para compartir documentos, sonido,
v&iacute;deo y otras tecnolog&iacute;as multimedia entre individuos, el correo est&aacute;
siendo impulsado m&aacute;s all&aacute; del simple m&eacute;todo de comunicaci&oacute;n <I>de facto</I>.
El correo es comunicaci&oacute;n esencialmente de individuo a individuo, o de
individuo a un grupo peque&ntilde;o. Las diversas utilidades disponibles sobre
plataforma Linux permiten configurar un sistema de correo electr&oacute;nico como
<CODE>sendmail, pop3d, imapd</CODE>.
                </LI>
<LI>Interfaz de Usuario:

La tecnolog&iacute;a de Intranet est&aacute; evolucionado tan r&aacute;pidamente que las
herramientas disponibles, en particular HTML, pueden ser usadas para
cambiar dram&aacute;ticamente la manera en que nos relacionamos con los sistemas. 
 
El lenguaje HTML permite elaborar una interfaz limitada &uacute;nicamente por la
imaginaci&oacute;n de los autores. La belleza acerca de usar tecnolog&iacute;as de
Intranet para esto reside en su extremada simplicidad. Haciendo click en
un enlace HTML puede ir a otra p&aacute;gina, accionar una alarma, ejecutar un
procedimiento de cierre de fin de a&ntilde;o o cualquier cosa que se pueda hacer
desde un programa de computadora. </LI>
</UL>
</P>


<HR>
<A HREF="Servidor-Intranet-Como-5.html">Anterior</A>
<A HREF="Servidor-Intranet-Como-7.html">Siguiente</A>
<A HREF="Servidor-Intranet-Como.html#toc6">Indice</A>
</BODY>
</HTML>
