<HTML>
<HEAD>
<TITLE>Linux COMO Servidor de Intranets: Conexi&oacute;n al Servidor Linux</TITLE>
</HEAD>
<BODY>
<A HREF="Servidor-Intranet-Como-3.html">Anterior</A>
<A HREF="Servidor-Intranet-Como-5.html">Siguiente</A>
<A HREF="Servidor-Intranet-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Conexi&oacute;n al Servidor Linux</A></H2>


<P>Por favor refi&eacute;rase al diagrama mostrado en el cap&iacute;tulo <I>Introducci&oacute;n</I>
(secci&oacute;n 
<A HREF="Servidor-Intranet-Como-1.html#intro">intro</A>) para el esquema de direccionamiento usado. La
Estaci&oacute;n de Trabajo 1 (<CODE>E/T 1</CODE>) est&aacute; sobre la red 172.16.0.0 y
puede acceder al Servidor Linux directamente considerando que la Estaci&oacute;n
de Trabajo 2 (<CODE>E/T 2</CODE>) est&aacute; sobre la red 172.17.0.0 y necesita usar
la m&aacute;quina <CODE>pasarela</CODE>, 172.17.0.254 para acceder a la m&aacute;quina Linux.
Esta pasarela es necesaria s&oacute;lo para los programas clientes de la m&aacute;quina
<CODE>E/T 2</CODE>. Netware se refiere a la pasarela como <CODE>ip_router</CODE>.</P>
<P>Yo estoy usando <CODE>E/T 2</CODE> para ilustrar la configuraci&oacute;n cliente. Para
configurar <CODE>E/T 1</CODE> cambie s&oacute;lo la direcci&oacute;n 172.17.0.5 por
172.16.0.5 e ignore todas las referencias a la m&aacute;quina pasarela. </P>
<P>Si no tiene ninguna m&aacute;quina pasarela, puede pasar a la siguiente secci&oacute;n y
seguir con</P>
<P>
<UL>
<LI><I>Configuraci&oacute;n de Servidor Netware</I>, secci&oacute;n 
<A HREF="#netware">netware</A> si
usa un servidor Netware.</LI>
<LI><I>Configuraci&oacute;n de Clientes Windows</I>, secci&oacute;n 
<A HREF="#microsoft">microsoft</A>
si usa el Cliente Microsoft. </LI>
</UL>
</P>

<H2><A NAME="ss4.1">4.1 Configuraci&oacute;n del Servidor Linux</A></H2>


<P>Puede saltarse esta secci&oacute;n si no tiene m&aacute;quina pasarela. </P>
<P>Ha de configurar el servidor Linux para reconocer la pasarela,
de este modo permitimos a la Estaci&oacute;n de Trabajo 2 conectarse al servidor 
Web. Para establecer la configuraci&oacute;n del servidor Linux debe acceder como
root. En la l&iacute;nea de comandos del servidor escriba</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
route add gw default 172.16.0.254
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para que se use este <I>gateway</I> o pasarela cada vez que arranque el
servidor Linux, edite el archivo <CODE>/etc/rc.d/rc.inet1</CODE>
<SL>Nota
del Revisor <BR> En caso de ser una distribuci&oacute;n RedHat, edite en su lugar
<CODE>/etc/sysconfig/network</CODE></SL>
 y asigne el valor
<CODE>172.16.0.254</CODE> al par&aacute;metro <CODE>GATEWAY =</CODE>.  Aseg&uacute;rese de que la
l&iacute;nea para a&ntilde;adir el gateway no est&eacute; comentada. </P>
<P>Alternativamente: Puede a&ntilde;adir la ruta a la red al otro lado del
equipo pasarela. Esto puede hacerse as&iacute;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
route add -net 172.17.0.0 gw 172.16.0.254
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para agregar la ruta cada vez que arranque Linux, a&ntilde;&aacute;dalo a su archivo
<CODE>/etc/rc.d/rc.local</CODE>. </P>


<H2><A NAME="netware"></A> <A NAME="ss4.2">4.2 Configuraci&oacute;n del Servidor Netware </A></H2>


<P>Para configurar el Servidor Netware debe tener permisos de Supervisor
o por lo menos permisos de operador de consola. Si no puede obtenerlos,
pida ayuda a su Administrador de Red con la configuraci&oacute;n. Active el frame
tipo Ethernet_II sobre su Red Local (LAN) tecleando los comandos o
incluy&eacute;ndolos en el archivo <CODE>AUTOEXEC.ncf</CODE>. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        load NE2000 frame=Ethernet_II name=IPNET
        load TCPIP
        bind IP to IPNET addr=172.16.0.2 mask=FF.FF.FF.0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Podr&iacute;a tener que especificar el slot o n&uacute;mero de tarjeta cuando cargue el
controlador de dispositivo NE2000 dependiendo de la configuraci&oacute;n de su
m&aacute;quina. (pe: <CODE>load NE2000 slot=3 frame=.....</CODE>) </P>


<H2><A NAME="netwarecl"></A> <A NAME="ss4.3">4.3 Configuraci&oacute;n de Clientes Netware </A></H2>


<P>Tiene que escoger entre Windows 3.1, 3.11 o Win95. El procedimiento de
instalaci&oacute;n difiere entre Win95 y los viejos windows, si est&aacute; usando el
cliente de 32 bits de Microsoft o Novell. Si va a usar el cliente de 16
bits, el procedimiento es el mismo y puede referirse a las
instrucciones de instalaci&oacute;n de Windows 3.x. Para instalar el cliente de
32 bits para Win95 vaya directo a Instalaci&oacute;n Windows 95 (secci&oacute;n 
<A HREF="#win95w">win95w</A>). </P>

<H3>Windows 3.x</H3>


<P>Si est&aacute; usando Win3.1 o W3.11 puede instalar el Cliente Netware
(VLMs) y algunos archivos adicionales los cuales est&aacute;n suministrados
con el diskette TCP/IP, llamados:</P>
<P><CODE>TCPIP.exe, VTCPIP.386, WINSOCK.dll y WLIBSOCK.dll</CODE></P>
<P>Tenga en cuenta que el archivo <CODE>WINSOCK.dll</CODE> es diferente al
suministrado con Win95 y Trumpet. Instale el Cliente Netware con el
soporte para windows. Copie <CODE>VTCPIP.386, WINSOCK.dll y WLIBSOCK.dll</CODE> al
directorio <CODE>SYSTEM</CODE> y <CODE>TCPIP.exe</CODE> al directorio <CODE>NWCLIENT</CODE>.
Modifique el fichero <CODE>STARTNET.bat</CODE> del directorio <CODE>NWCLIENT</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        lsl
        ne2000                    ----&gt; su controlador de tarjeta de red
        c:\windows\odihlp.exe     ----&gt; Si usa W3.11
        ipxodi
        tcpip                     ----&gt; Agregue esta linea
        nwip                      ----&gt; Si usa Netware/IP
        vlm
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Cree un subdirectorio, por ejemplo <CODE>\NET\TCP</CODE> y copie los
archivos <CODE>HOSTS, NETWORKS, PROTOCOLS y SERVICES</CODE> desde
<CODE>/etc</CODE> del servidor Linux o del directorio <CODE>SYS:ETC</CODE> de su
Servidor Netware.  Edite el archivo <CODE>HOSTS</CODE> copiado y a&ntilde;ada una
l&iacute;nea para su nuevo servidor Linux. Esto le permitir&aacute; referirse a su
Servidor Linux como <CODE>http://linux.midominio/</CODE> en lugar de
<CODE>http://172.16.0.1/</CODE> en su navegador WWW. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        127.0.0.1       localhost
        172.16.0.1      linux.midominio
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Edite el archivo <CODE>BET.cfg</CODE> del directorio <CODE>NWCLIENT</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        Link Driver NE2000
            port 300
            int 3
            MEM D0000
            FRAME Ethernet_802.2

     ; ---- agregue estas lineas ----

           FRAME Ethernet_II

        Protocol TCPIP
           PATH TCP_CFG C:\NET\TCP
           ip_address  172.17.0.5
           ip_netmask  255.255.255.0
           ip_router   172.17.0.254   ; ---&gt; agregue la direccion de su gateway 
                                      ; ---&gt; solo si tiene que usar este gateway 
                                      ; ---&gt; para alcanzar a su Servidor HTTP 

        Link Support
           MemPool 6192       ; ---&gt; el minimo es 1024. Pruebe con diferentes valores

           Buffers 10 1580    ; ---&gt; tambien puede ser afinado.

     ;---------------------------------
     ; Necesita agregar lineas como estas si esta usando Netware/IP      
     ;
        NWIP
           NWIP_DOMAIN_NAME  midominio
           NSQ_BROADCAST   ON
           NWIP1_1 COMPATIBILITY   OFF
           AUTORETRIES     1
           AUTORETRY SECS  10
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Edite el archivo <CODE>SYSTEM.ini</CODE> del directorio <CODE>WINDOWS</CODE> y
a&ntilde;ada esta entrada para <CODE>VTCPIP.386</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        [386Enh]
        .....
        network=*vnetbios, vipx.386, vnetware.386, VTCPIP.386
        .....
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Reinicie su PC, ejecute <CODE>STARTNET.bat</CODE> y podr&aacute; ahora usar su 
navegador favorito para acceder a sus p&aacute;ginas Web. No necesita 
acceder a Netware y no necesita ejecutar <CODE>TCPMAN</CODE> (si est&aacute; usando
Trumpet Winsock).</P>

<H3><A NAME="win95n"></A> Windows 95 </H3>


<P>Esta secci&oacute;n explica c&oacute;mo instalar el cliente de 32 bits para Win95. 
Primeramente tiene que instalar lo siguiente:</P>
<P>
<UL>
<LI>Cliente para Redes Netware (de Microsoft o Novell)</LI>
<LI>Protocolo de Microsoft TCP/IP</LI>
<LI>Adaptador de Red</LI>
</UL>
</P>
<P>Para instalar estos m&oacute;dulos, haga click en <I>Mi PC, Panel de Control y
Red</I>. Haga click en <I>A&ntilde;adir</I>. Estar&aacute; ahora en una ventana que muestra
<I>Cliente, Adaptador, Protocolo y Servicios</I>. Para Instalar el
<I>Cliente de Redes Netware</I>:</P>
<P>
<OL>
<LI>Haga doble click en <I>Clientes</I></LI>
<LI>Haga click en <I>Microsoft</I> o <I>Novell</I></LI>
<LI>Haga doble click en <I>Cliente para Redes Netware</I> </LI>
</OL>
</P>
<P>Para instalar el protocolo TCP/IP:</P>
<P>
<OL>
<LI>Haga doble click en <I>Protocolos</I></LI>
<LI>Haga click en <I>Microsoft</I></LI>
<LI>Haga doble click en <I>TCP/IP</I></LI>
</OL>
</P>
<P>Windows 95 por omisi&oacute;n instala varios protocolos adicionales
autom&aacute;ticamente. Elim&iacute;nelos haciendo click en ellos y luego en el bot&oacute;n
Eliminar.  T&iacute;picamente Win95 instala el protocolo de Microsoft NetBeui, y
el protocolo IPX/SPX compatible. Puede eliminar el protocolo NetBEUI, pero
necesitar&aacute; el protocolo IPX/SPX si desea acceder al Servidor Netware. </P>
<P>Para configurar TCP/IP, haga click en <I>TCP/IP</I>, <I>Propiedades</I>,
leng&uuml;eta de direcci&oacute;n IP. </P>
<P>
<OL>
<LI>Coloque su direcci&oacute;n IP en el campo <I>Especificar una direcci&oacute;n
IP</I> como <CODE>172.17.0.5</CODE>
</LI>
<LI>En <I>M&aacute;scara de subred</I> introduzca <CODE>255.255.255.0</CODE>
</LI>
<LI>Seleccione la leng&uuml;eta <I>Gateway</I>
</LI>
<LI>Coloque la direcci&oacute;n del gateway o pasarela en el cuadro <I>Nuevo
gateway</I> como <CODE>172.17.0.254</CODE>
</LI>
<LI>Haga click en el bot&oacute;n <I>Agregar</I>
</LI>
</OL>
</P>
<P>La direcci&oacute;n del gateway debe aparecer ahora en la ventana de gateways
instalados. Haga click en <I>Aceptar</I>. </P>
<P>Debe obtener un mensaje de reiniciar. H&aacute;galo, debe ser capaz ahora de usar
su navegador para conectarse a su Servidor HTTP.</P>


<H2><A NAME="microsoft"></A> <A NAME="ss4.4">4.4 Configuraci&oacute;n de Clientes Microsoft </A> </H2>


<P>Si est&aacute; usando el Cliente de Microsoft para acceder a la red, en esta
secci&oacute;n encontrar&aacute; detalles acerca de c&oacute;mo instalar TCP/IP para:</P>
<P>
<UL>
<LI>Windows 3.11</LI>
<LI>Windows 95</LI>
<LI>Windows NT 4.0</LI>
</UL>
</P>
<P>Nota: Para que sea posible referirse al servidor Linux como
<CODE>http://linux.midominio/</CODE> en lugar de <CODE>http://172.16.0.1/</CODE>
en los navegadores WWW y todos los comandos de intranet, necesitar&aacute; editar
el archivo <CODE>HOSTS</CODE>
<SL>N. del Revisor <BR> O configurar un
servidor de nombres (DNS) en el Linux y dirigir la resoluci&oacute;n de nombres
de los dem&aacute;s equipos a &eacute;l; vea el <I>DNS-Como</I>, disponible en
castellano en cualquier r&eacute;plica de sunsite en el directorio
<CODE>../docs/Howto/translations/es</CODE></SL>
.  Puede a&ntilde;adir m&aacute;s
entradas por cada uno de los dem&aacute;s equipos (Netware, Unix, WinNT).</P>
<P>La familia Windows mantiene este archivo <CODE>HOSTS</CODE> en
<CODE>\WINDOWS</CODE> o en <CODE>\WINDOWS\SYSTEM</CODE> dependiendo de la versi&oacute;n. 
Edite este archivo y a&ntilde;ada una l&iacute;nea para su servidor Linux como: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        127.0.0.1      localhost
        172.16.0.1     linux.midominio

        172.16.0.2     netware.midominio
        172.16.0.3     winNT.midominio
        172.16.0.5     et_1
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Windows 3.11.</H3>


<P>Esta secci&oacute;n explica c&oacute;mo instalar el cliente de 32 bits para W3.11. 
Primeramente debe descargar los controladores TCP/IP para Windows del
servidor de Microsoft en Internet. La versi&oacute;n actual es la <CODE>3.11b</CODE>,
estando disponible en <CODE>
<A HREF="ftp://ftp.microsoft.com">ftp://ftp.microsoft.com</A></CODE> o en otros servidores como
<CODE>tcp32b.exe</CODE>. Aseg&uacute;rese de tener instalado <CODE>Win32s</CODE> antes de
tratar de instalar el controlador TCP/IP de 32 bits. </P>
<P>Habiendo expandido los archivos de TCP/IP en un directorio temporal
(digamos <CODE>C:\TEMP</CODE>), compruebe que en el directorio
<CODE>\WINDOWS\SYSTEM</CODE> no exista una copia de
<CODE>OEMSETUP.INF</CODE>. Si tiene alguna, ren&oacute;mbrela. Copie el archivo
<CODE>OEMSETUP.INF</CODE> desde el directorio <CODE>TEMP</CODE> al directorio
<CODE>\WINDOWS\SYSTEM</CODE>. Si ha instalado alguna otra pila
TCP/IP en el sistema, por favor elim&iacute;nelas antes de proceder.</P>
<P>Arrancar <I>Configuraci&oacute;n de Red</I> o <I>Configurar Windows/Cambiar
Configuraci&oacute;n de Red</I></P>
<P>
<OL>
<LI>Haga click en el bot&oacute;n <I>Redes</I>.</LI>
<LI>Haga click en <I>Instalar Red de Microsoft Windows</I>.</LI>
<LI>Escoja soporte para redes adicionales (si se requiere).</LI>
<LI>Haga click en <I>Aceptar</I>.</LI>
</OL>
</P>
<P>Debe preguntarle sobre su adaptador de red, seleccione uno apropiado.  Si
no le pregunta, entonces:</P>
<P>
<OL>
<LI>Haga click en el bot&oacute;n <I>Adaptador</I>.
<UL>
<LI>seleccione un adaptador (por ejemplo, NE2000)</LI>
<LI>Haga click en <I>Aceptar</I></LI>
</UL>
</LI>
<LI>Haga click en el bot&oacute;n de <I>protocolo</I>
<UL>
<LI>Seleccione <I>Protocolo TCP/IP-32 de Microsoft</I>.</LI>
<LI>Haga click en <I>Aceptar</I></LI>
</UL>
</LI>
</OL>
</P>
<P>Le ser&aacute; requerido configurar la pila de protocolos TCP/IP.  Siempre puede
volver a configurarlo escogiendo <I>protocolo TCP/IP</I> en el cuadro de
di&aacute;logo <I>Adaptadores</I> mostrado y haciendo click en el bot&oacute;n
<I>Configurar</I>. </P>
<P>
<OL>
<LI>En el campo <I>direcci&oacute;n IP</I> introduzca <CODE>172.17.0.5</CODE></LI>
<LI>En <I>M&aacute;scara de Subred</I> escriba <CODE>255.255.255.0</CODE>
</LI>
<LI>Introduzca la direcci&oacute;n de su gateway o pasarela en el campo
<I>gateway por defecto</I>, por ejemplo <CODE>172.17.0.254</CODE> </LI>
</OL>
</P>
<P>Haga click en <I>Aceptar</I>. La computadora le preguntar&aacute; si desea
reiniciar. H&aacute;galo. Debe ser capaz de usar el navegador para conectarse a
su Servidor HTTP. </P>

<H3><A NAME="win95w"></A> Windows 95 </H3>


<P>Esta secci&oacute;n explica c&oacute;mo instalar el Cliente de 32 bits de Microsoft
para Win95. Primero deber&aacute; instalar lo siguiente:</P>
<P>
<UL>
<LI>Cliente para Redes Microsoft</LI>
<LI>Protocolo TCP/IP de Microsoft</LI>
<LI>Adaptador de Red</LI>
</UL>
</P>
<P>Para instalar estos m&oacute;dulos, vaya a <I>Mi PC, Panel de Control, Red</I>. 
Haga click en <I>Agregar</I>. Estar&aacute; ahora en una ventana que muestra
<I>Cliente, Adaptador, Protocolo</I> y <I>Servicio</I>. Para instalar el
<I>Cliente de Redes de Microsoft</I>:</P>
<P>
<OL>
<LI>Haga doble click en <I>Cliente</I></LI>
<LI>Haga <I>click</I> en <I>Microsoft</I></LI>
<LI>Haga doble click en <I>Cliente para Redes de Microsoft</I></LI>
</OL>
</P>
<P>Para instalar el Protocolo TCP/IP:</P>
<P>
<OL>
<LI>Haga doble click en <I>Protocolo</I></LI>
<LI>Haga doble click en <I>Microsoft</I></LI>
<LI>Haga doble click en <I>TCP/IP</I></LI>
</OL>
</P>
<P>Windows 95 por omisi&oacute;n instala varios protocolos autom&aacute;ticamente. 
Elim&iacute;nelos seleccion&aacute;ndolos y haciendo click en el bot&oacute;n <I>Eliminar</I>.
Win95 instala por defecto el Protocolo de Microsoft <I>NetBeui</I>. </P>
<P>Para configurar TCP/IP, haga click en <I>TCP/IP</I>, click en
<I>Propiedades</I>, y en la leng&uuml;eta <I>Direcci&oacute;n IP</I></P>
<P>
<OL>
<LI>Introduzca su direcci&oacute;n IP en el cuadro <I>Especificar una
direcci&oacute;n IP</I> como por ejemplo <CODE>172.17.0.5</CODE> En el cuadro de di&aacute;logo de
<I>M&aacute;scara de subred</I> introduzca <CODE>255.255.255.0</CODE>. 
</LI>
<LI>seleccione la leng&uuml;eta <I>Gateway</I>
</LI>
<LI>Escriba la direcci&oacute;n IP de su pasarela o gateway en el cuadro
<I>Nuevo gateway</I>, por ejemplo <CODE>172.17.0.254</CODE>. Haga click en el bot&oacute;n
<I>Agregar</I>. </LI>
</OL>
</P>
<P>La direcci&oacute;n de la m&aacute;quina pasarela o gateway aparecer&aacute; bajo el campo de
gateways instalados. Haga click en <I>Aceptar</I>. Llegados a este punto,
deber&iacute;a ser capaz de usar un navegador para conectar a su Servidor HTTP. </P>

<H3><A NAME="wnt"></A> Windows NT </H3>


<P>Esta secci&oacute;n detalla c&oacute;mo instalar el cliente TCP/IP para WinNT 4.0. </P>
<P>Vaya a <I>Inicio, Panel de Control, Red</I>.</P>
<P>Seleccione la leng&uuml;eta <I>Adaptador</I>. Haga click en <I>Agregar nuevo
adaptador</I> (si no tiene ninguno).</P>
<P>Deber&aacute; preguntarle sobre su adaptador de red. Seleccione uno apropiado.</P>
<P>Para agregar los protocolos:</P>
<P>Seleccione la leng&uuml;eta <I>protocolos</I></P>
<P>Haga click en <I>Agregar</I></P>
<P>Seleccione el protocolo <I>TCP/IP</I> </P>
<P>Haga click en <I>Aceptar</I>.</P>
<P>Le preguntar&aacute; sobre la configuraci&oacute;n de la pila de protocolo TCP.
Siempre puede volver a configurar esto seleccionado el protocolo
TCP/IP y haciendo click en el bot&oacute;n <I>Propiedades</I>.</P>
<P>Seleccione la leng&uuml;eta <I>Direcci&oacute;n IP</I></P>
<P>Active la casilla de verificaci&oacute;n <I>Especificar una direcci&oacute;n IP</I></P>
<P>En la casilla de direcci&oacute;n IP introduzca <CODE>172.17.0.5</CODE></P>
<P>En la casilla de m&aacute;scara de subred introduzca <CODE>255.255.255.0</CODE></P>
<P>Escriba la direcci&oacute;n de la m&aacute;quina pasarela o gateway en la caja de
<I>Default Gateway</I>, por ejemplo <CODE>172.17.0.254</CODE>.</P>
<P>Haga click en <I>Aceptar</I>. La computadora le preguntar&aacute; si desea
reiniciar.  Llegados a este punto debe poder ser capaz de utilizar
cualquier navegador para conectar a su Servidor HTTP. </P>


<H2><A NAME="ss4.5">4.5 Configuraci&oacute;n de TCP/IP en Macintosh</A></H2>


<P>Si est&aacute; usando alg&uacute;n Macintosh en su red, esta secci&oacute;n le ayudar&aacute; a
instalar MacTCP para PowerMacs. </P>
<P>Nota: Para habilitar el poder referirse al servidor Linux como
<CODE>http://linux.midominio/</CODE> en lugar de <CODE>http://172.16.0.1/</CODE> en el 
navegador de WWW y todos sus comandos en la intranet necesitar&aacute;
editar el archivo <CODE>hosts</CODE>. </P>
<P>El formato del archivo <CODE>hosts</CODE> est&aacute; basado en el RFC-1035. Puede a&ntilde;adir
m&aacute;s entradas para cada uno de sus otros servidores (Netware, Unix, WinNT) 
tambi&eacute;n. El MacOS mantiene el archivo <CODE>HOSTS</CODE> en la carpeta
de <I>Preferencias</I> bajo la carpeta de <I>Sistema</I>. Edite este archivo y
a&ntilde;ada una linea para su servidor Linux como:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
       linux.midominio   A  172.16.0.1

       netware.midominio A  172.16.0.2
       winNT.midominio   A  172.16.0.3
       et_1              A  172.16.0.5
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>MacTCP</H3>


<P>Esta secci&oacute;n explica c&oacute;mo instalar MacTCP. Primero ha de descargar los
archivos de MacTCP de Apple, o instalarlos desde el CD de Conexi&oacute;n a
Internet. Para Configurar MacTCP, haga click en <I>Men&uacute; Apple,
Paneles de Control</I>, <I>TCP/IP</I>. </P>
<P>
<OL>
<LI>Cambie los par&aacute;metros <I>Connect via</I>: a <I>Ethernet</I>. </LI>
<LI>Cambie el par&aacute;metro <I>Configurar</I> a <I>Manualmente</I>.</LI>
<LI>En el campo de direcci&oacute;n IP introduzca <CODE>172.17.0.5</CODE></LI>
<LI>En la casilla de <I>M&aacute;scara de subred</I> introduzca
<CODE>255.255.255.0</CODE></LI>
<LI>Escriba la direcci&oacute;n de su equipo pasarela o gateway en la casilla
de direcci&oacute;n de equipo pasarela (<I>Router address</I>), por ejemplo
<CODE>172.17.0.254</CODE>. </LI>
</OL>
</P>
<P>Haga click en <I>Aceptar</I>. Ahora deber&aacute; ser capaz de usar el navegador
para conectar a su Servidor HTTP. </P>


<HR>
<A HREF="Servidor-Intranet-Como-3.html">Anterior</A>
<A HREF="Servidor-Intranet-Como-5.html">Siguiente</A>
<A HREF="Servidor-Intranet-Como.html#toc4">Indice</A>
</BODY>
</HTML>
