<HTML>
<HEAD>
<TITLE>Linux COMO Servidor de Intranets: Instalaci&oacute;n del servidor HTTP </TITLE>
</HEAD>
<BODY>
<A HREF="Servidor-Intranet-Como-1.html">Anterior</A>
<A HREF="Servidor-Intranet-Como-3.html">Siguiente</A>
<A HREF="Servidor-Intranet-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Instalaci&oacute;n del servidor HTTP </A></H2>


<P>Cuando descargue el servidor tiene dos opciones: Obtener el fuente y
compilarlo por s&iacute; mismo, u obtener los binarios precompilados. Los
binarios precompilados para la versi&oacute;n Linux (ELF) est&aacute;n disponibles en
NCSA, pero no para las versiones m&aacute;s antiguas. </P>

<H2><A NAME="ss2.1">2.1 Preparaci&oacute;n antes de descargar</A></H2>


<P>El servidor en NCSA le guiar&aacute; paso a paso por las opciones de
configuraci&oacute;n y preparar&aacute; varios archivos para Vd. Pero antes debe
intentar descargar HTTPd estando preparado con las respuestas a las
siguientes preguntas. </P>

<H3>El Sistema Operativo</H3>


<P>Primero, debe escoger entre descargar el fuente o la versi&oacute;n precompilada
del software. Si su sistema en particular no aparece en el men&uacute;, entonces
tendr&aacute; que obtener el fuente por omisi&oacute;n, y compilarlo usted mismo. </P>
<P>Compruebe la versi&oacute;n de Linux yendo a la linea de comandos de su m&aacute;quina
Linux y teclee:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
       linux:~$  uname -a
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>de esta forma responder&aacute; con una l&iacute;nea similar a esta:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
   linux:~$  uname -a
   Linux linux 2.0.29 %4 Tue Sep 13 04:05:51 CDT 1994 i586
   linux:~$
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La versi&oacute;n de Linux es <CODE>2.0.29</CODE>.</P>
<P>Los par&aacute;metros restantes pueden ser especificados antes de descargar o
configurados despu&eacute;s modificando el archivo <CODE>srm.conf</CODE> en el directorio
<CODE>/usr/local/etc/httpd/conf</CODE>.  Los nombres de las directivas
actuales aparecen en el archivo <CODE>httpd.conf</CODE> mostrados entre
corchetes. La &uacute;nica excepci&oacute;n es la directiva <CODE>DocumentRoot</CODE> la cual
aparece en el archivo <CODE>srm.conf</CODE></P>

<H3><A NAME="servertype"></A> Tipo de Procesamiento (<CODE>ServerType</CODE>) </H3>


<P>Especifica c&oacute;mo se ejecutar&aacute; el Servidor HTTPd. El m&eacute;todo preferido es
<CODE>standalone</CODE>. Este hace que el demonio HTTP sea ejecutado
constantemente. Si escoge cargar HTTPd sobre <CODE>inetd</CODE>, el binario del
servidor ser&aacute; recargado en memoria para cada solicitud, lo cual puede
ralentizar un poco el servidor.</P>

<H3><A NAME="puerto"></A> Puerto de Enlace (<CODE>Port</CODE>) </H3>


<P>Especifica qu&eacute; puerto de su m&aacute;quina ser&aacute; enlazado al demonio HTTPd y
escuchar&aacute; las solicitudes de HTTP. Si inici&oacute; sesi&oacute;n como root, use la
configuraci&oacute;n por defecto, el puerto <CODE>80</CODE>. En otro caso escoja
entre los puertos <CODE>1025</CODE> y <CODE>65535</CODE>.</P>

<H3><A NAME="usuario"></A> Identidad del Servidor (<CODE>User</CODE>) </H3>


<P>Es el usuario cuyos privilegios el servidor asumir&aacute; cuando se den
respuestas a las solicitudes y se act&uacute;e sobre archivos. Esta directiva
necesita ser contestada solamente si se est&aacute; ejecutando el servidor como
<CODE>standalone</CODE>.  Si Vd no tiene privilegios de root, &uacute;nicamente podr&aacute;
usar su nombre de usuario. Si Vd. es el administrador del sistema, puede
querer crear un usuario especial para controlar los permisos de control
del archivo. </P>

<H3><A NAME="grupo"></A> Identidad de Grupo del servidor (<CODE>Group</CODE>) </H3>


<P>Es el grupo cuyos privilegios asumir&aacute; el servidor cuando se den respuestas
a las solicitudes y se act&uacute;e sobre archivos. Es similar a <I>Identidad
del Servidor</I> y es aplicable s&oacute;lo si se est&aacute; ejecutando el servidor como
<CODE>standalone</CODE>. </P>
<P>Si no tiene privilegios de root, use el nombre del grupo primario al que
pertenezca. Puede averiguar su grupo tecleando <CODE>groups</CODE> desde la
l&iacute;nea de comandos de Linux.</P>

<H3><A NAME="webmaster"></A> Direcci&oacute;n de correo del administrador del Servidor(<CODE>ServerAdmin</CODE>) </H3>


<P>Es la direcci&oacute;n de correo electr&oacute;nico a la que el usuario deber&aacute; mandar un
mensaje de correo electr&oacute;nico cuando informe de alg&uacute;n problema con el
servidor. Puede poner su direcci&oacute;n personal de correo electr&oacute;nico. </P>

<H3><A NAME="serverroot"></A> Directorio de localizaci&oacute;n del servidor (<CODE>ServerRoot</CODE>)</H3>


<P>Localizaci&oacute;n del servidor en su sistema. Si tiene privilegios de root
d&eacute;jelo en el lugar recomendado, <CODE>/usr/local/etc/httpd</CODE>. Si no tiene
acceso como root, escoja un subdirectorio de su directorio personal. 
Puede averiguar la localizaci&oacute;n de su directorio personal con el comando
<CODE>finger usuario</CODE>.</P>

<H3><A NAME="documentroot"></A> Localizaci&oacute;n de los archivos HTML (<CODE>DocumentRoot</CODE>) </H3>


<P>Lugar donde residen los archivos HTML que son servidos. El lugar por
omisi&oacute;n es <CODE>/usr/local/etc/httpd/htdocs</CODE>. Podr&iacute;a no obstante
fijarse al directorio personal de un usuario especial que escoja en la
Identidad del Servidor (secci&oacute;n 
<A HREF="#usuario">usuario</A>), o un subdirectorio en
su directorio personal si no tiene acceso como root. </P>
<P>En caso de duda, use los par&aacute;metros por omisi&oacute;n. Existen algunas
respuestas sobre esto que puede descargar de NCSA HTTPd en <CODE>
<A HREF="http://hoohoo.ncsa.uiuc.edu/docs/setup/OneStep.html">http://hoohoo.ncsa.uiuc.edu/docs/setup/OneStep.html</A></CODE>. Debe
leer la documentaci&oacute;n de HTTPd en <CODE>
<A HREF="http://hoohoo.ncsa.uiuc.edu/docs/">http://hoohoo.ncsa.uiuc.edu/docs/</A></CODE> antes de intentar la
instalaci&oacute;n. Si est&aacute; planeando compilar el c&oacute;digo necesitar&aacute; modificar los
<CODE>Makefile</CODE> en cada uno de los directorios <CODE>support</CODE>, <CODE>src</CODE> y
<CODE>cgi-src</CODE>. Si su versi&oacute;n de Linux est&aacute; ya soportada entonces solamente
tendr&aacute; que escribir <CODE>make linux</CODE> en el directorio de m&aacute;s alto nivel
(p.ej. <CODE>/usr/local/etc/httpd</CODE>) </P>


<H2><A NAME="ss2.2">2.2 Compilaci&oacute;n de HTTPd</A></H2>


<P>La compilaci&oacute;n es simple, solamente tiene que teclear <CODE>make linux</CODE> en
la l&iacute;nea de comandos de su directorio ra&iacute;z del servidor. Nota: Usuarios de
Linux pre-ELF tienen que descomentar <CODE>#define NO_PASS</CODE> en el
archivo <CODE>portability.h</CODE> y fijar <CODE>DBM_LIBS=-ldbm</CODE> en el archivo
<CODE>Makefile</CODE> antes de compilar HTTPd. </P>


<HR>
<A HREF="Servidor-Intranet-Como-1.html">Anterior</A>
<A HREF="Servidor-Intranet-Como-3.html">Siguiente</A>
<A HREF="Servidor-Intranet-Como.html#toc2">Indice</A>
</BODY>
</HTML>
