<HTML>
<HEAD>
<TITLE>NIS(YP)/NIS+/NYS COMO: ¿ Qu&eacute; necesitas para configurar NYS ?</TITLE>
</HEAD>
<BODY>
<A HREF="Nis-Como-5.html">Anterior</A>
<A HREF="Nis-Como-7.html">Siguiente</A>
<A HREF="Nis-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="confnys"></A> <A NAME="s6">6. ¿ Qu&eacute; necesitas para configurar NYS ?</A></H2>

<H2><A NAME="ss6.1">6.1 Determinar si eres un Servidor, Esclavo o Cliente.</A></H2>

<P>Para contestar esta cuesti&oacute;n debes considerar dos casos:</P>
<P>
<UL>
<LI>Tu m&aacute;quina va a ser parte de una red en la que ya existen
servidores NIS.
</LI>
<LI>Todav&iacute;a no tienes servidores NIS en la red.</LI>
</UL>
</P>
<P>En el primer caso tienes dos opciones:</P>
<P>
<UL>
<LI>O reenlazas todos los programas cliente y demonio con la librer&iacute;a 
NYS <CODE>libnsl.so</CODE> (o las enlazas est&aacute;ticamente con 
<CODE>libnsl.a</CODE>). Esto supone a&ntilde;adir la l&iacute;nea:

<BLOCKQUOTE><CODE>
<PRE>
            LIBS=-lnsl
        
</PRE>
</CODE></BLOCKQUOTE>


a tu Makefile, que indica que quieres enlazar la Network Services 
Library. B&aacute;sicamente, todos los demonios de red y el programa 
"<CODE>login</CODE>" necesitan ser recompilados.
</LI>
<LI>O puedes recompilar la librer&iacute;a C est&aacute;ndar <CODE>libc</CODE> para que 
incluya las funciones de librer&iacute;a de los clientes NYS, y despu&eacute;s 
reenlazar todos los programas enlazados est&aacute;ticamente (los programas 
enlazados din&aacute;micamente tienen la nueva versi&oacute;n de libc 
autom&aacute;ticamente). Para m&aacute;s informaci&oacute;n sobre &eacute;sta opci&oacute;n, mira la 
secci&oacute;n
<A HREF="#hazusar">Haz usar NYS a tus binarios</A>  m&aacute;s abajo.</LI>
</UL>
</P>
<P>De forma similar al caso del NIS tradicional, si no tienes servidores NIS, 
entonces tambi&eacute;n necesitar&aacute;s un programa servidor NIS (normalmente 
llamado <CODE>ypserv</CODE>) y tendr&aacute;s que designar una de las m&aacute;quinas de tu red como 
servidor NIS maestro. De nuevo, quiz&aacute;s quieras establecer al menos un 
servidor esclavo junto con el maestro.</P>



<H2><A NAME="ss6.2">6.2 El Software</A></H2>


<P>Necesitas obtener y compilar la librer&iacute;a <CODE>libnsl.so</CODE> de servicios NYS. Si 
no tienes las herramientas DLL instaladas puedes obtener una librer&iacute;a 
precompilada compartida, est&aacute;tica o en c&oacute;digo fuente del mismo servidor 
mencionado m&aacute;s abajo. Nota, de todos modos, que la versi&oacute;n precompilada 
puede ser (y probablemente es) m&aacute;s vieja que la &uacute;ltima edici&oacute;n del 
c&oacute;digo fuente.</P>
<P>La librer&iacute;a NYS (en versi&oacute;n c&oacute;digo fuente y precompilada) puede ser 
obtenida de:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    Servidor            Directorio                     Nombre fichero

    ftp.lysator.liu.se  /pub/NYS/libs                  nys-0.27.4.tar.gz
    ftp.lysator.liu.se  /pub/NYS/binaries/lib          libnsl.so.1.0.a26
 
    ftp.funet.fi        /pub/OS/Linux/BETA/NYS/libs    nys-0.27.4.tar.gz
    ftp.funet.fi        /pub/OS/Linux/BETA/NYS/lib     libnsl.so.1.0.a26
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Versiones precompiladas de los programas "<CODE>login</CODE>" y "<CODE>su</CODE>" pueden ser 
obtenidos de:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    Servidor            Directorio                     Nombre fichero

    ftp.lysator.liu.se  /pub/NYS/binaries/bin          login
    ftp.lysator.liu.se  /pub/NYS/binaries/bin          su

    ftp.funet.fi        /pub/OS/Linux/BETA/NYS/bin     login
    ftp.funet.fi        /pub/OS/Linux/BETA/NYS/bin     su
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Similarmente, se pueden obtener ejemplos de ficheros de cofiguraci&oacute;n de:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    Servidor            Directorio                     Nombre fichero

    ftp.lysator.liu.se  /pub/NYS/binaries/etc          *conf
    ftp.funet.fi        /pub/OS/Linux/BETA/NYS/etc     *conf
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para compilar la librer&iacute;a <CODE>nsl</CODE>, sigue las instrucciones que vienen con el 
software. Si deseas compilar la librer&iacute;a DLL compartida debes tener las 
herramientas DLL instaladas en su sitio (<CODE>/usr/dll</CODE>). Las herramientas DLL 
(el paquete <CODE>tools-2.11.tar.gz</CODE> o posterior) pueden ser obtenidas de los 
servidores habituales.</P>



<H2><A NAME="ss6.3">6.3 Configurar un Cliente NYS usando NYS</A></H2>

<P>A diferencia del NIS tradicional, no se necesita ninguna configuraci&oacute;n 
para un cliente NYS. Todo lo que se necesita, es que el fichero de 
configuraci&oacute;n NIS (<CODE>/etc/yp.conf</CODE>) apunte al servidor correcto para su 
informaci&oacute;n. Adem&aacute;s, el fichero de configuraci&oacute;n del <I>Name Services Switch</I> 
(<CODE>/etc/nsswitch.conf</CODE>) debe estar correctamente configurado.</P>
<P>Por favor, refier&aacute;se a los ejemplos proporcionados con el c&oacute;digo fuente.</P>



<H2><A NAME="ss6.4">6.4 El Fichero <CODE>nsswitch.conf</CODE></A></H2>

<P>El fichero de <I>Network Services Switch</I> <CODE>/etc/nsswitch.conf</CODE> determina el 
orden de las b&uacute;squedas realizadas cuando se pide una pieza espec&iacute;fica de 
informaci&oacute;n, de la misma forma que el fichero <CODE>/etc/host.conf</CODE> determina la 
manera en que se realizan las b&uacute;squedas de hosts. Insistimos, eche un 
vistazo al fichero proporcionado en la distribuci&oacute;n del c&oacute;digo fuente. Por 
ejemplo, la l&iacute;nea</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    hosts: files nis dns
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>especifica que las funciones de b&uacute;squeda de host deben primero mirar en 
el fichero <CODE>/etc/hosts</CODE> local, seguido de una b&uacute;squeda NIS y, finalmente, 
usar el DNS (<CODE>/etc/resolv.conf</CODE> y <CODE>named</CODE>). Si al llegar a este punto no se 
encuentra el host correspondiente se devuelve un error.</P>



<H2><A NAME="hazusar"></A> <A NAME="ss6.5">6.5 Haz usar NYS a tus binarios</A></H2>

<P>En vez de reenlazar cada binario con la librer&iacute;a NYS (<CODE>libnsl.so</CODE>), se ha 
conseguido una soluci&oacute;n m&aacute;s limpia proporcionando al usuario la 
posibilidad de compilar una libc que incluya NYS. Esto significa que todo 
lo que necesitas hacer es recompilar una nueva libc y sustituir la 
<CODE>/lib/libc.so.x.y.z</CODE> existente para que todos los programas (los compilados 
no-est&aacute;ticamente) utilicen NYS.</P>
<P>Esta combinaci&oacute;n tambi&eacute;n te da la ventaja sobre la implementaci&oacute;n del NIS 
tradicional en la libc de linux, en que permite soporte transparente para 
<I>shadow passwords</I> (v&iacute;a el fichero <CODE>/etc/nisswitch.conf</CODE>).</P>
<P>Sigue los sencillos pasos indicados m&aacute;s adelante para recompilar una libc que 
incluya NYS.</P>
<P>
<UL>
<LI>Aseg&uacute;rate de que tienes las &uacute;ltimas herramientas DLL instaladas. 
Para m&aacute;s informaci&oacute;n acerca de d&oacute;nde conseguirlas l&eacute;ete el GCC-FAQ.
</LI>
<LI>Consigue los &uacute;ltimos fuentes de la <CODE>libc</CODE>. (de nuevo, mira el GCC-FAQ)
</LI>
<LI>Consigue los &uacute;ltimos fuentes del <CODE>nys</CODE> de:

<BLOCKQUOTE><CODE>
<PRE>
          ftp.lysator.liu.se:/pub/NYS/libs
      
</PRE>
</CODE></BLOCKQUOTE>


y descompr&iacute;melos en el directorio de la libc-linux fuente.      
Actualmente la distribuci&oacute;n es la "<CODE>nys-0.27.4.tar.gz</CODE>".
</LI>
<LI>Ejecuta el <CODE>./configure</CODE> y contesta "n" a la pregunta

<BLOCKQUOTE><CODE>
<PRE>
          Values correct (y/n) [y] ?
      
</PRE>
</CODE></BLOCKQUOTE>


Luego sigue con las siguientes cuestiones y la &uacute;ltima pregunta 
ahora ser&aacute;
         
<BLOCKQUOTE><CODE>
<PRE>
          Build a NYS libc from nys-0.27 (y default) ?
      
</PRE>
</CODE></BLOCKQUOTE>

 
contesta "y" a &eacute;sta.
</LI>
<LI>Luego ejecuta el comando

<BLOCKQUOTE><CODE>
<PRE>
          % make
      
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>
<P>La librer&iacute;a generada tras la compilaci&oacute;n se llamar&aacute; algo as&iacute; como</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    libc.so.4.5.26
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y estar&aacute; bajo el directorio <CODE>jump/libc-nys</CODE>. Para instalar esta librer&iacute;a 
nuestro consejo ser&iacute;a copiarla a <CODE>/lib</CODE> con un nombre lexicogr&aacute;ficamente 
superior que el n&uacute;mero que actualmente tiene. Simplemente con a&ntilde;adir la 
letra "a" lo podremos conseguir. Por ejemplo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    % cp jump/libc-nys/libc.so.4.5.26 /lib/libc.so.4.5.26a
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Alternativamente, podr&iacute;amos a&ntilde;adirle "nys" para poder identificarlo 
r&aacute;pidamente. Ahora ejecuta el siguiente comando</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    % ldconfig
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>que resetear&aacute; tu cach&eacute; para usar la nueva librer&iacute;a. La estrategia del 
enlazador din&aacute;mico puede ser examinada con el comando "<CODE>ldconfig -p</CODE>".</P>
<P>B&aacute;sicamente esto es todo. Ahora todos tus programas deben poder utilizar 
NYS. Por favor, nota que usualmente el programa "<CODE>login</CODE>" est&aacute; 
compilado est&aacute;ticamente y que por lo tanto no puede acceder a las nuevas 
funciones NYS de la nueva <CODE>libc</CODE>. Deber&aacute;s recompilar "<CODE>login</CODE>" sin el par&aacute;metro 
<CODE>-static</CODE>, o enlazarlo est&aacute;ticamente a la librer&iacute;a <CODE>libnsl.a</CODE>.</P>



<HR>
<A HREF="Nis-Como-5.html">Anterior</A>
<A HREF="Nis-Como-7.html">Siguiente</A>
<A HREF="Nis-Como.html#toc6">Indice</A>
</BODY>
</HTML>
