<HTML>
<HEAD>
<TITLE>NIS(YP)/NIS+/NYS COMO: ¿ Qu&eacute; necesitas para configurar NIS ?</TITLE>
</HEAD>
<BODY>
<A HREF="Nis-Como-4.html">Anterior</A>
<A HREF="Nis-Como-6.html">Siguiente</A>
<A HREF="Nis-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. ¿ Qu&eacute; necesitas para configurar NIS ?</A></H2>

<H2><A NAME="puertosrpc"></A> <A NAME="ss5.1">5.1 El Mapeador de Puertos RPC</A> </H2>


<P>Para ejecutar alg&uacute;n software de los mencionados m&aacute;s adelante necesitar&aacute;s 
ejecutar antes el programa <CODE>/usr/sbin/rpc.portmap</CODE>. Algunas 
distribuciones 
Linux ya tienen c&oacute;digo para arrancar &eacute;ste demonio en <CODE>/etc/rc.d/rc.inet2.</CODE> 
Todo lo que tienes que hacer es "descomentar" ese c&oacute;digo y rearrancar tu 
m&aacute;quina Linux para activarlo.</P>
<P>El mapeador RPC (<CODE>portmap(8c)</CODE>) es un servidor que convierte n&uacute;meros de 
programas RPC en n&uacute;meros de puerto de protocolo TCP/IP (o UDP/IP). Debe 
estar ejecut&aacute;ndose para poder realizar llamadas RPC (que es lo que el 
software de cliente NIS hace) a servidores RPC (como un servidor NIS) de 
esa m&aacute;quina. Cuando un servidor RPC arranca, avisar&aacute; al mapeador de 
puertos por cu&aacute;l puerto est&aacute; escuchando, y a qu&eacute; n&uacute;meros de programas 
RPC est&aacute; preparado para servir. Cuando un cliente desea hacer una llamada 
RPC a un n&uacute;mero de programa dado, primero deber&aacute; contactar con el mapeador 
de puertos de la m&aacute;quina servidora para determinar el n&uacute;mero de puerto al 
que los paquetes RPC deben ser enviados.</P>
<P>Normalmente los servidores RPC est&aacute;ndar son arrancados por <CODE>inetd(8c)</CODE>, de 
modo que el mapeador de puertos debe ser iniciado antes de que <CODE>inetd</CODE> sea 
invocado.</P>



<H2><A NAME="ss5.2">5.2 Determinar si eres Servidor, Esclavo o Cliente.</A></H2>

<P>Para contestar a esta cuesti&oacute;n debes considerar dos casos:</P>
<P>
<OL>
<LI>Tu m&aacute;quina va a ser parte de una red en la que ya existen 
servidores NIS.
</LI>
<LI>Todav&iacute;a no tienes servidores NIS en la red.</LI>
</OL>
</P>
<P>En el primer caso, s&oacute;lo necesitas los programas cliente (<CODE>ypbind, ypwhich,
ypcat, yppoll, ypmatch</CODE>). El programa m&aacute;s importante es <CODE>ypbind</CODE>. Este 
programa debe estar ejecut&aacute;ndose en todos los casos, esto es, debe 
aparecer siempre en la lista de procesos. Es un proceso de los llamados 
demonio y necesita ser iniciado desde el fichero de arranque del 
sistema (ej. <CODE>/etc/rc.local</CODE>). Tan pronto como <CODE>ypbind</CODE> est&eacute; en marcha, tu 
sistema se convierte en un cliente NIS.</P>
<P>En el segundo caso, si no tienes servidores NIS, entonces tambi&eacute;n 
necesitar&aacute;s un programa servidor NIS (normalmente llamado <CODE>ypserv</CODE>). La 
secci&oacute;n 
<A HREF="Nis-Como-6.html#confnys">¿ Qu&eacute; necesitas para configurar NYS ?</A> 
describe como configurar un servidor NIS en tu maquina Linux 
usando la implementaci&oacute;n del <CODE>ypserv</CODE> de Peter Eriksson 
(<CODE>&lt;pen@lysator.liu.se></CODE>). Nota que &eacute;sta implementaci&oacute;n NO 
soporta el concepto maestro-esclavo del que hemos hablado en la secci&oacute;n 
<A HREF="Nis-Como-3.html#nisnis+">¿ NIS o NIS+ ?</A>.  
Usando este software, todos tus servidores NIS ser&aacute;n servidores 
maestros. Hay otro servidor gratuito disponible, llamado "<CODE>yps</CODE>", escrito 
por Tobias Reber en Alemania que s&iacute; soporta el concepto maestro-esclavo, 
pero que tiene otras limitaciones.</P>



<H2><A NAME="ss5.3">5.3 El Software</A></H2>

<P>La librer&iacute;a del sistema "<CODE>/usr/lib/libc.a</CODE>" (version 4.4.2 y superiores) o 
la librer&iacute;a compartida "<CODE>/usr/lib/libc.sa</CODE>" y sus DLL relacionadas 
contienen todas las llamadas al sistema necesarias para compilar 
satisfactoriamente el software del cliente y del servidor NIS.</P>
<P>Ha habido informes de gente diciendo que NIS s&oacute;lo funciona con las 
versiones 4.5.21 y superiores de "<CODE>/usr/lib/libc.a</CODE>" as&iacute; que si quieres 
ir a lo seguro, no uses libc's m&aacute;s antiguas. El software de cliente NIS 
puede obtenerse de:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
  Servidor               Directorio                       Nombre de fichero
  
  ftp.uni-paderborn.de   /pcsoft2/linux/local/yp          yp-clients.tar.gz
  ftp.funet.fi           /pub/OS/Linux/BETA/NYS/clients   yp-clients.tar.gz
  ftp.lysator.liu.se     /pub/NYS/clients                 yp-clients.tar.gz
  sunsite.unc.edu        /pub/Linux/system/Network/admin  yp-clients.tar.gz
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Una vez hayas obtenido el software, por favor, sigue las instrucciones 
que vienen con &eacute;l.</P>



<H2><A NAME="conficli"></A> <A NAME="ss5.4">5.4 Configurar un Cliente NIS usando NIS Tradicional</A></H2>

<P>Asumiendo que hayas compilado satisfactoriamente el software, ya estar&aacute;s 
preparado para instalarlo. Un lugar id&oacute;neo para el demonio <CODE>ypbind</CODE> es el 
directorio <CODE>/usr/sbin</CODE>.</P>
<P>Por supuesto, para ello deber&aacute;s entrar como root. Los otros binarios 
(<CODE>ypwhich, ypcat, yppoll, ypmatch</CODE>) deben ir en un directorio accesible por 
todos los usuarios, <CODE>/usr/etc</CODE> o <CODE>/usr/local/bin</CODE> por ejemplo. Ser&iacute;a una 
buena idea probar el <CODE>ypbind</CODE> antes de incorporarlo en <CODE>/etc/rc.d/rc.inet2</CODE>.</P>
<P>Para probar el <CODE>ypbind</CODE> haz lo siguiente:</P>
<P>
<UL>
<LI>Aseg&uacute;rate de que tienes establecido ya tu nombre de dominio. Si no 
lo tienes ejecuta el comando:

<BLOCKQUOTE><CODE>
<PRE>
            /bin/domainname-yp nis.domain
        
</PRE>
</CODE></BLOCKQUOTE>

        
donde <CODE>nis.domain</CODE> debe ser alguna cadena de caracteres, 
que normalmente ¡_NO_ debe estar relacionada con el nombre de 
dominio de tu m&aacute;quina! La raz&oacute;n para esto es que hace un poco m&aacute;s 
dif&iacute;cil a crackers externos el obtener la base de datos de passwords 
de tus servidores NIS. Si no sabes cu&aacute;l es el nombre de dominio 
NIS de tu red, pregunta al administrador de tu sistema/red.
</LI>
<LI>Arrancar "<CODE>/usr/sbin/rpc.portmap</CODE>" si no est&aacute; ya ejecut&aacute;ndose.
</LI>
<LI>Crear el directorio "<CODE>/var/yp</CODE>" si no existe.
</LI>
<LI>Iniciar "<CODE>/usr/sbin/ypbind</CODE>"
</LI>
<LI>Usar el comando "<CODE>rpcinfo -p localhost</CODE>" para comprobar si <CODE>ypbind</CODE> es 
capaz de registrar su servicio con el mapeador de puertos. El 
rpcinfo deber&iacute;a producir una salida parecida a:

<BLOCKQUOTE><CODE>
<PRE>
       program vers proto   port
        100000    2   tcp    111  portmapper
        100000    2   udp    111  portmapper
        100007    2   udp    637  ypbind
        100007    2   tcp    639  ypbind
        300019    1   udp    660
      
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Podr&iacute;as tambi&eacute;n ejecutar "<CODE>rpcinfo -u localhost ypbind</CODE>". Este 
comando deber&iacute;a producir una salida similar a:

<BLOCKQUOTE><CODE>
<PRE>
        program 100007 version 2 ready and waiting
      
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>
<P>Finalmente, no olvides que para b&uacute;squedas de nodos debes establecer (o 
a&ntilde;adir) "<CODE>nis</CODE>" a la entrada de orden de b&uacute;squedas en tu fichero 
<CODE>/etc/host.conf</CODE>. Por favor, lee la p&aacute;gina man "<CODE>resolv+.8</CODE>" para m&aacute;s 
detalles. </P>
<P>En este punto, ya podr&iacute;as usar programas cliente NIS como <CODE>ypcat</CODE>, etc... 
Por ejemplo, "<CODE>ypcat passwd</CODE>" te devolver&aacute; la base de datos NIS de 
los passwords completa.</P>
<P>IMPORTANTE: Si te saltaste el procedimiento de prueba aseg&uacute;rate de que 
has establecido el nombre de dominio, y creado el directorio:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    /var/yp
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Este directorio DEBE existir para que <CODE>ypbind</CODE> pueda iniciarse 
satisfactoriamente.</P>
<P>Si el test funcion&oacute;, puede que ahora quieras cambiar los ficheros 
<CODE>/etc/rc.d/rc.M</CODE> y <CODE>/etc/rc.d/rc.inet2</CODE> en tu sistema para que <CODE>ypbind</CODE> se 
inicie durante el arranque y para que tu sistema act&uacute;e como un cliente 
NIS. Edita el fichero <CODE>/etc/rc.d/rc.M</CODE> y busca los comandos que establecen 
el nombre de dominio. Cambia el nombre de dominio por el nombre de tu 
dominio. Tambi&eacute;n, edita el fichero <CODE>/etc/rc.d/rc.inet2</CODE>, ``descomenta'' las 
l&iacute;neas que inician el demonio <CODE>rpc.portmap</CODE>, y a&ntilde;ade las siguientes l&iacute;neas 
justo despu&eacute;s del lugar donde se arranca <CODE>rpc.portmap</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    #
    # Arranca el demonio ypbind:
    #
    if [ -f ${NET}/ypbind -a -d /var/yp ]; then
        echo -n &quot; ypbind&quot;
        ${NET}/ypbind
    fi
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Al contrario que con la implementaci&oacute;n de Sun del NIS no necesitas editar 
los ficheros <CODE>/etc/passwd</CODE> y <CODE>/etc/group</CODE> para poder aprovechar NIS. La 
implementaci&oacute;n de Sun necesita una l&iacute;nea "<CODE>+:*:0:0:::</CODE>" en el <CODE>/etc/passwd</CODE> y 
una l&iacute;nea "<CODE>+:*:0:</CODE>" en el <CODE>/etc/group</CODE> para decirle a NIS que busque en las 
bases de datos NIS de los passwords y de los grupos.</P>
<P>IMPORTANTE: Nota que el comando finger te informar&aacute; con mensajes "no such 
user" si no a&ntilde;ades la l&iacute;nea "<CODE>+:*:0:0:::</CODE>" en <CODE>/etc/passwd</CODE>. Volver a 
poner la l&iacute;nea "<CODE>+:*:0:0:::</CODE>" en <CODE>/etc/passwd</CODE> arreglar&aacute; el finger.</P>
<P>Bueno, esto es todo. Rearranca la m&aacute;quina y observa los mensajes de arranque 
para ver si ypbind efectivamente se ha iniciado.</P>
<P>IMPORTANTE: Nota que la caracter&iacute;stica netgroup est&aacute; implementada 
empezando en la libc v4.5.26. Los netgroups permiten control de acceso 
para cada m&aacute;quina y para cada usuario en el dominio NIS, y requieren una 
entrada como &eacute;sta:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    +@this_machine_users
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>en <CODE>/etc/passwd</CODE>. Pero si tienes una versi&oacute;n de libc anterior a la 4.5.26, 
todos los usuarios de la base de datos NIS de passwords pueden acceder a 
tu m&aacute;quina Linux si ejecutas "<CODE>ypbind</CODE>".</P>



<HR>
<A HREF="Nis-Como-4.html">Anterior</A>
<A HREF="Nis-Como-6.html">Siguiente</A>
<A HREF="Nis-Como.html#toc5">Indice</A>
</BODY>
</HTML>
