<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Estructura del Sistema de Archivos de Linux</TITLE>


</HEAD>
<BODY>
<H1>Estructura del Sistema de Archivos de <B>Linux</B></H1>

<H2>Grupo de Standard de el Sistema de Archivos [<B>FSSTND</B>] <BR> Daniel Quinlan <BR>
Traductor: Israel Barrientos <CODE>
<A HREF="mailto:jbarrien@ccr.dsi.uanl.mx">mailto:jbarrien@ccr.dsi.uanl.mx</A></CODE><BR> Maquetador Linuxdoc-SGML: Antonio Ismael Olea Gonz&aacute;lez, <BR>
<CODE>
<A HREF="mailto:olea@poboxes.com">mailto:olea@poboxes.com</A></CODE>
<CODE>2:345/108.9@fidonet.org</CODE></H2>r1.2, abril de 1996
<P><HR>
<EM>El proceso abierto y distribuido en el cual el sistema operativo <B>Linux</B> se ha
desarrollado propicia un r&aacute;pido crecimiento, tanto del sistema operativo,
como de aplicaciones, y distribuciones integradas. Por tanto, existe la
necesidad de la estandarizaci&oacute;n de la estructura del sistema de archivos de
<B>Linux</B>. Este documento intenta especificar la localizaci&oacute;n est&aacute;ndar de
archivos y directorios en sistemas <B>Linux</B>. Una estructura del sistema de
archivos estandarizada permite a usuarios, desarrolladores, y
distribuidores, el obtener componentes del sistema de varias fuentes que
trabajar&aacute;n juntas tan bien como si hubiesen sido desarrolladas bajo un
proceso de desarrollo centralizado. &Eacute;sto tambi&eacute;n facilita la administraci&oacute;n
del sistema, as&iacute; como el desarrollo de paquetes de segundas y terceras
personas, y la escritura de documentaci&oacute;n que no depende de la
implementaci&oacute;n.</EM>
<HR>
<H2><A NAME="s1">1. Advertencia legal </A></H2>

<P> <B>Linux</B> no es una Marca Registrada y no tiene conexi&oacute;n con <B>UNIX</B><BR>
 <B>UNIX</B> es una marca registrada de <B>X</B>Open Company, Ltd/.<BR>
<B>HP-UX</B> es una marca registrada de <B>Hewlett-Packard</B>.<BR> <B>Novell</B>
y <B>Novell NetWare</B> son marcas registradas de <B>Novell</B>. <BR> <B>SunOS
Sun Microsystems</B>, <B>Sun NIS</B>, <B>Sun RPC</B>, y <B>NFS</B> son marcas
registradas de <B>Sun Microsystems</B>.<BR> <B>System V</B> y <B>SVR4</B> son
marcas registradas de <B>AT&amp;T</B>. <BR> <B>X Windows System</B> es una marca
registrada de el <B>X Consortium, Inc</B>.<BR> Todos los otros copyrights son
de los propietarios, a menos que se especifique otra cosa .<BR> El uso de
cualquier t&eacute;rmino en este documento no deber&iacute;a ser tomado como que afecte la
validez de una marca registrada o servicio registrado.<BR>
<P>
<P>Copyright 1994 Daniel Quinlan
<P>
<P> Se permite la distribuci&oacute;n y copia de este est&aacute;ndar siempre que se
preserve este copyright y este mensaje en todas las copias.
<P>
<P> Se permite a los participantes y contribuyentes de la <B>FSSTND</B> copiar
y distribuir versiones modificadas de este est&aacute;ndar para prop&oacute;sitos de las
actividades de estandarizacion del sistema de archivos solamente, bajo las
condiciones abajo especificadas. Todas las copias o porciones de este
documento deben identificar el titulo del documento y la secci&oacute;n, y deben
acompa&ntilde;ar este aviso en un lugar prominente.
<P>
<P> Ninguna porci&oacute;n de este documento puede ser redistribuida en una forma
modificada o recortada sin la aprobaci&oacute;n previa de el coordinador del
<B>FSSTND</B>. Cualquier entidad que busque permiso para distribuir cualquier
material derivado de este documento (Que no sean copias id&eacute;nticas) debe de
contactar al coordinador del <B>FSSTND</B> para la licencia apropiada. 
<P>
<P>
<H2><A NAME="s2">2. Prefacio </A></H2>

<P>
<H2>2.1 Estatus del Est&aacute;ndar</H2>

<P> &Eacute;sta es la versi&oacute;n 1.2 de la Estructura del Sistema de Archivos de
<B>Linux</B> (<B>Linux</B> Filesystems Structure) <B>FSSTND</B>
<P>
<P> Las gu&iacute;as de este est&aacute;ndar est&aacute;n sujetas a cambio. El uso de la
informaci&oacute;n contenida en este documento es bajo su propio riesgo.
<P>
<H2><A NAME="s3">3. Organizaci&oacute;n del Est&aacute;ndar</A></H2>

<P>Este est&aacute;ndar est&aacute; dividido en 6 partes:
<UL>
<LI>General: incluyendo un enunciado de enfoque, problemas, objetivos, y requerimientos de conformidad. (
<A HREF="#sec1">Secci&oacute;n 1</A>). </LI>
<LI>El Sistema de Archivos: Un enunciado de algunos principios gu&iacute;as.  (
<A HREF="#sec2">Secci&oacute;n 2</A>). </LI>
<LI>El Directorio ra&iacute;z <CODE>/</CODE>:  (
<A HREF="#sec3">Secci&oacute;n 3</A>). </LI>
<LI>La jerarqu&iacute;a <CODE>/usr</CODE>:  (
<A HREF="#sec4">Secci&oacute;n 4</A>). </LI>
<LI>La jerarqu&iacute;a <CODE>/var</CODE>:  (
<A HREF="#sec5">Secci&oacute;n 5</A>). </LI>
<LI>Razonamientos adicionales y asuntos sin resolver  (
<A HREF="#sec6">Secci&oacute;n 6</A>). </LI>
</UL>
<P>
<H2>3.1 Convenciones Tipogr&aacute;ficas </H2>

<P> La fuente tipo courier se usa para los nombres de archivos y
directorios.
<P>
<P> Los componentes de nombres de archivos que var&iacute;an son representados por
una descripci&oacute;n del contenido encerrada entre los caracteres &quot; &lt;
&quot; y &quot; &gt; &quot;. Las direcciones de correo electr&oacute;nico est&aacute;n
tambi&eacute;n encerradas entre &quot; &lt; &quot; y &quot; &gt; &quot; pero se
muestran en la fuente usual.
<P>
<P> Los componentes adicionales de los nombres de los archivos se encierran
entre los caracteres &quot; [ &quot; y &quot; ] &quot; y pueden ser
combinados con la convenci&oacute;n &quot; &lt; &quot; y &quot; &gt; &quot;. Por
ejemplo, si existe un archivo que puede ser encontrado con o sin extensi&oacute;n,
&eacute;ste podr&iacute;a ser representado por &lt;nombre&gt;[.extensi&oacute;n].
<P>
<P> Las subcadenas variables de los nombres de archivos y directorios se
indican con &quot; * &quot;.
<P>
<H2><A NAME="sec1"></A> <A NAME="s4">4. General </A> </H2>

<H2>4.1 Enfoque</H2>

<P> Este documento especifica una estructura est&aacute;ndar del sistema de
archivos para los sistemas <B>Linux</B>, incluyendo la localizaci&oacute;n de
archivos y directorios, y el contenido de algunos archivos de sistema.
<P>
<P> El est&aacute;ndar de sistema de archivos ha sido dise&ntilde;ado para ser usado por
desarrolladores de distribuciones, desarrolladores de paquetes e
implementadores de sistemas. De cualquier forma est&aacute; hecho para ser una
referencia y no es un tutorial de como manejar un sistema de archivos
<B>Linux</B> &oacute; jerarqu&iacute;a de directorios.
<P>
<P> &Eacute;stos son algunos de los problemas fundamentales que motivaron
originalmente el esfuerzo de estandarizaci&oacute;n. No hab&iacute;a una estructura &uacute;nica,
bien aceptada estructura de directorios <B>Linux</B>, en su lugar hab&iacute;a muchas
estructuras cada una incompatible con las dem&aacute;s. Las jerarqu&iacute;as m&aacute;s
ampliamente usadas no estaban bien estructuradas y difer&iacute;an bastante de las
estructuras de directorios modernas &quot;est&aacute;ndares&quot; (tales como
System V, BSD, SunOS, y otras). El sistema de archivos era poco familiar e
inc&oacute;modo para los usuarios de <B>UNIX</B> con experiencia y los
administradores que hab&iacute;an tenido experiencia con otros sistemas operativos
similares a <B>UNIX</B>.  La falta de regularidad tambi&eacute;n confund&iacute;a a los
reci&eacute;n-iniciados en <B>Linux</B>, especialmente aquellos que no ten&iacute;an un
conocimiento previo de <B>UNIX</B>. Cualquier incompatibilidad entre las
distribuciones primarias de <B>Linux</B> y los paquetes de aplicaci&oacute;n se
resolv&iacute;an por m&eacute;todos de una naturaleza poco elegante. Los enlaces
simb&oacute;licos(symbolic links) eran usados demasiado frecuentemente para
arreglar los problemas. (De todas maneras, hay veces en las que los enlaces
se usan para asegurar compatibilidad hacia atr&aacute;s o para permitir a algunos
sistemas espec&iacute;ficos que tengan un sistema de archivos individual y muy
particular).
<P>
<P> En cualquier esfuerzo de estandarizaci&oacute;n surgen diferencias de opini&oacute;n.
La necesidad del consenso y la pr&aacute;ctica com&uacute;n dentro de la comunidad de
<B>Linux</B> deben opacar estas diferencias.
<P>
<P> Este est&aacute;ndar del sistema de archivos fue primeramente desarrollado
dentro de la lista de correo <B>FSSTND</B> y previamente, en el canal
<B>FSSTND</B> de la lista de correo de los LINUX-ACTIVISTS. Los comentarios y
recomendaciones fueron recibidos de un gran numero de desarrolladores de
<B>Linux</B>, notables programadores de <B>Linux</B>, administradores de
sistemas y usuarios. Estos voluntarios quienes han contribuido
extensivamente al est&aacute;ndar est&aacute;n listados en el final de este documento.
Este est&aacute;ndar representa la visi&oacute;n en consenso de &eacute;stos y otros
contribuyentes.
<P>
<P> Este est&aacute;ndar busca atacar los problemas estos problemas con una
estructura de sistema de archivos bien dise&ntilde;ada que esperamos que la
comunidad <B>Linux</B> seguir&aacute; voluntariamente. Aunque este est&aacute;ndar comprende
m&aacute;s y es m&aacute;s completo que cualquier anterior intento de estandarizaci&oacute;n, lo
m&aacute;s seguro es que nunca est&eacute; verdaderamente terminado. Las necesidades de la
comunidad <B>Linux</B> cambiar&aacute;n continuamente debido a las tecnolog&iacute;as
emergentes. Es tambi&eacute;n muy posible que se descubran mejores soluciones a los
problemas que nosotros atacamos o que las soluciones que nosotros ahora
proponemos dejen de ser las mejores es por eso que el <B>FSSTND</B> planea
publicar suplementos y actualizaciones peri&oacute;dicas a este documento.
<P>
<P> Los comentarios relacionados con este documento se agradecen y son
bienvenidos por el grupo <B>FSSTND</B>. Cualquier comentario o sugerencia de
cambio deber&aacute; ser dirigida a al coordinador del <B>FSSTND</B> o si lo
prefiere, cualquier coordinador listado en este documento. Los comentarios
tipogr&aacute;ficos o gram&aacute;ticos deber&aacute;n ser dirigidos a el coordinador
<B>FSSTND</B>.
<P>
<P>
<P> Existe tambi&eacute;n una FAQ mantenida por Ian McCloghrie, que responde
algunas de las preguntas m&aacute;s frecuentemente hechas acerca de este est&aacute;ndar.
Si desea implementar el <B>FSSTND</B> o si tiene alguna pregunta por favor lea
antes el <B>FSSTND FAQ</B>. &Eacute;sta est&aacute; disponible v&iacute;a ftp anonymous en
tsx-11.mit.edu en el directorio
/pub/linux/docs/linux-standards/fsstnd/FSSTND-FAQ. 
<P>
<P>Por favor no mande correo a la lista de correo sin antes contactar a el
coordinador del <B>FSSTND</B> o a un colaborador listado. Los mensajes
impropios no van a ser bien recibidos en la lista. 
<P>
<P>Preguntas de como interpretar ciertos art&iacute;culos en este documento pueden
ocasionalmente hacerse, si tiene necesidad de aclarar alg&uacute;n punto, por favor
contacte al coordinador. Dado que este est&aacute;ndar representa el consenso de
muchos participantes es importante asegurarse que cierta interpretaci&oacute;n es
tambi&eacute;n el consenso de su opini&oacute;n colectiva. Por esa raz&oacute;n puede no ser
posible una respuesta inmediata a menos que la pregunta halla sido objeto de
discusi&oacute;n previa. 
<P>
<P>El coordinador del <B>FSSTND</B> es Daniel Quinlan
&lt;Daniel.Quinlan@linux.org&gt; 
<P>
<P>
<H2>4.2 Problemas espec&iacute;ficos.</H2>

<P> Naturalmente, exist&iacute;an ciertos problemas espec&iacute;ficos que trat&aacute;bamos de
corregir cuando estandarizamos la estructura del sistema de archivos de
<B>Linux</B>, estos son algunos de los m&aacute;s obvios y m&aacute;s grandes. Los
directorios binarios principales /bin y /usr/bin no tienen divisiones bien
definidas entre ellos. Como resultado la distribuci&oacute;n de los binarios entre
estos dos directorios var&iacute;a grandemente entre en cada distribuci&oacute;n de
<B>Linux</B>. Al incluir ambos, los archivos binarios y los de configuraci&oacute;n
en /etc hace m&aacute;s confuso este directorio y m&aacute;s dif&iacute;cil de mantener para
ambos, el administrador de sistema y el usuario inexperto (especialmente
aquellos con sistemas grandes) La divisi&oacute;n entre lo que debe ser un archivo
de configuraci&oacute;n espec&iacute;fico de un site, y lo que es un archivo de
configuraci&oacute;n local de una m&aacute;quina es dif&iacute;cil de establecer. Muchas
implementaciones comunes de /usr no pueden ser montadas s&oacute;lo-lectura debido
a que contienen archivos variables y directorios a los cuales se necesita
escribir En un ambiente en red es deseable servir software a las estaciones
de trabajo v&iacute;a NFS. Tales sistemas de archivos pueden necesitar ser montados
s&oacute;lo-lectura, para que los accidentes o malicia deliberada desde un estaci&oacute;n
de trabajo no puedan da&ntilde;ar los archivos en el servidor. &Eacute;sto requiere la
identificaci&oacute;n y la separaci&oacute;n de los archivos a los que una m&aacute;quina debe
escribir y los que son espec&iacute;ficos de una m&aacute;quina.  Las estructuras de los
sistemas de archivos <B>Linux</B> tradicionales no eran muy adecuadas para
instalaciones en red, las cuales podr&iacute;an requerir que componentes
s&oacute;lo-lectura dentro del sistema de archivos ( principalmente en la jerarqu&iacute;a
/usr ) o involucrar estaciones sin discos.
<P>
<P> Mientras que algunos de los mayores problemas fueron atacados, surgieron
numerosos y adicionales que necesitan ser resueltos. Este est&aacute;ndar intenta
atacar muchos de estos problemas, pero puede haber algo que fue pasado por
alto. Si desea traer algo a nuestra atenci&oacute;n, por favor note que hubo
asuntos que se han discutido largamente y que no fueron incluidos en este
est&aacute;ndar.
<P>
<P>
<H2>4.3 Objetivos</H2>

<P> Al tratar de resolver los problemas arriba mencionados, se identificaron
varios objetivos que necesitaban ser alcanzados en adici&oacute;n a los problemas
m&aacute;s t&eacute;cnicos. Estas metas comprenden la correcci&oacute;n de problemas
sobresalientes as&iacute; como la validaci&oacute;n de este est&aacute;ndar.
<P>
<P> Resolver los problemas listados antes, y al mismo tiempo limitar las
dificultades transicionales mientras se traslada desde los antiguos
estandartes de facto.  Ganar la aprobaci&oacute;n de los distribuidores,
desarrolladores y otra gente importante en la comunidad <B>Linux</B>, as&iacute; como
alentarlos a que compartan con nosotros sus sugerencias. Proveer un est&aacute;ndar
que la comunidad <B>Linux</B> escoja seguir por que resuelve los problemas
anteriores y provee la m&aacute;s sensata estructura de sistemas de archivos de las
instalaciones <B>Linux</B>.
<P>
<P> Algunos de estos objetivos se han completado total o parcialmente debido
a la distribuci&oacute;n limitada de este documento (en borrador) al distribuidor o
desarrollador que solicit&oacute; alguno.
<P>
<P>
<P>
<H2>4.4 Historia y Progreso</H2>

<P> El mensaje original que motiv&oacute; este esfuerzo para reestructurar el
sistema de archivos <B>Linux</B> fue escrito por Olaf Kirsh
&lt;okir@monad.swb.de&gt; el 02 de Agosto de 1993 en el entonces canal
NORMAL de la lista de correo de los LINUX-activists.
<P>
<P> En corto tiempo se decidi&oacute; que la mejor manera para acometer la
necesaria reestructuraci&oacute;n de el sistema de archivos de <B>Linux</B> ser&iacute;a la
creaci&oacute;n de una lista de correo separada con el fin de desarrollar un
standard de consenso.
<P>
<P> Despu&eacute;s de una discusi&oacute;n comprensiva y con muy pocas discordias un
borrador preliminar fue emitido, con la ayuda de algunas personas dedicadas,
el borrador fue terminado y el borrador resultante sometido a consideraci&oacute;n
en el canal <B>FSSTND</B> para mayor discusi&oacute;n.
<P>
<P> El primer borrador fue emitido al canal el 18 de Septiembre de 1993 por
Daniel Quinlan.
<P>
<P> Al tiempo que la discusi&oacute;n continuaba y los borradores de las
recomendaciones de el <B>FSSTND</B> se desarrollaban m&aacute;s, se establecieron
contactos con los desarrolladores m&aacute;s accesibles quienes entonces ofrecieron
su apoyo y comentarios a nuestro esfuerzo.
<P>
<P> Muchos desarrolladores de <B>Linux</B> estuvieron de acuerdo en que este
esfuerzo de estandarizaci&oacute;n val&iacute;a la pena y lo apoyaron.
<P>
<P> A continuaci&oacute;n estan algunos de los desarrolladores que intentan seguir
el est&aacute;ndar <B>FSSTND</B>, parcial o completamente, listados en orden
alfab&eacute;tico:
<P>
<P>
<DL>
<DT><B>ATIM LINUX</B><DD><P>PRO/ 
Fred N van Kempen et al. &lt;waltje@infomagic.com&gt;
<DT><B>BOGUS LINUX</B><DD><P>Rik Faith, Kevin E. Martin, y Doug L. Hoffman &lt;linux-bogus@cs.unc.edu&gt;
<DT><B>DEBIAN LINUX</B><DD><P>Ian A. Murdock   &lt;imurdock@debian.org&gt;
<DT><B>LILO boot loader</B><DD><P>Werner Almesberger  &lt;almesber@nessie.cs.id.ethz.ch&gt;
<DT><B>MCC Interim LINUX</B><DD><P>Owen LeBlanc &lt;LeBlanc@mcc.ac.uk&gt;
<DT><B>Red Hat Software LINUX (RHS LINUX)</B><DD><P>Marc Ewing  &lt;marc@redhat.com&gt;
<DT><B>Slackware LINUX</B><DD><P>Patrick J. Volkerding  &lt;volkerdi@mhd1.moorehead.msus.edu&gt;
<DT><B>TAMU LINUX</B><DD><P>Dave Safford  &lt;dave.safford@net.tamu.edu&gt;
<DT><B>util-linux  (paquete)</B><DD><P>Rik Faith  &lt;faith@cs.unc.edu&gt;
<DT><B>Yggdrasil Plug-and-Play LINUX</B><DD><P>Adam J. Richter &lt;adam@yggdrasil.com&gt;
</DL>
<P>
<H2>4.5 Conformidad con este Documento</H2>

<P> Esta secci&oacute;n define los t&eacute;rminos &quot;conforme&quot; y
&quot;compatible&quot; con respecto a este est&aacute;ndar, y el de &quot;
&quot;parcialmente&quot; conforme y compatible.
<P>
<P> Una &quot;implementaci&oacute;n&quot; aqu&iacute; se refiere a una distribuci&oacute;n, un
sistema instalado, un programa, un paquete ( o alguna pedazo similar de
software o datos), o alg&uacute;n componente de ellos. 
<P>
<P>Una implementaci&oacute;n es totalmente conforme con este est&aacute;ndar si cada
requerimiento en este est&aacute;ndar es cubierto. Cada archivo o directorio que
sea parte de la implementaci&oacute;n debe estar localizado como se especifica en
este documento. Si el contenido de un archivo es descrito aqu&iacute;, el contenido
actual debe corresponder con el de la descripci&oacute;n. La implementaci&oacute;n tambi&eacute;n
debe intentar encontrar a los archivos o directorios (externos a s&iacute; mismo)
primeramente o exclusivamente en el lugar especificado en este est&aacute;ndar. 
<P>
<P>Una implementaci&oacute;n es totalmente compatible con este est&aacute;ndar si cada
archivo o directorio que contiene puede ser encontrado viendo en el lugar
especificado aqu&iacute;, a&uacute;n cuando este no sea el lugar primario o el lugar
f&iacute;sico del archivo o directorio en cuesti&oacute;n. La implementaci&oacute;n debe, cuando
intente encontrar cualquier archivo o directorio que no sea parte de s&iacute;, en
el lugar especificado en este est&aacute;ndar, aunque tambi&eacute;n puede intentar
encontrarlos en otros lugares no-est&aacute;ndar. 
<P>
<P>Una implementaci&oacute;n es parcialmente conforme o compatible si cumple con o es
compatible con un subconjunto significante de este documento. La conformidad
o compatibilidad parcial se aplica solamente a distribuciones y no a
programas separados. La frase subconjunto significante es deliberadamente
subjetiva y en casos marginales, la parte interesada deber&aacute; contactar al
coordinador del <B>FSSTND</B>. Se anticipa que cierta variaci&oacute;n ser&aacute; tolerada
en casos marginales. 
<P>
<P>Para calificar como parcialmente conforme con <B>FSSTND</B> o parcialmente
compatible con <B>FSSTND</B>, una implementaci&oacute;n debe de proporcionar una
lista de lugares en los cuales ella y el <B>FSSTND</B> difieren, junto con una
nota breve explicando la raz&oacute;n de la discrepancia. Esta lista deber&aacute; de ser
provista con la distribuci&oacute;n en cuesti&oacute;n y deber&aacute; estar disponible para la
lista <B>FSSTND</B> o el coordinador del <B>FSSTND</B>. 
<P>
<P>Los t&eacute;rminos &quot;tiene que &quot;, &quot;debe&quot;, &quot;contiene&quot;,
&quot;es&quot; y dem&aacute;s deben ser le&iacute;dos como requerimientos para la
conformidad o compatibilidad. 
<P>
<P>Note que una implementaci&oacute;n no necesita contener  todos los archivos y
directorios especificados en este est&aacute;ndar para ser conforme o compatible.
S&oacute;lo es necesario que aquellos archivos y directorios que s&iacute; contiene, que
est&eacute;n localizados apropiadamente. Por ejemplo si el sistema de archivos ext2
no est&aacute; soportado por una distribuci&oacute;n, las herramientas ext2 no necesitan
estar incluidas, aunque se mencionen expl&iacute;citamente en la secci&oacute;n sobre
/sbin. 
<P>
<P>M&aacute;s a&uacute;n, ciertas porciones de este documento son opcionales. En este caso se
enunciar&aacute; expl&iacute;citamente, o se indicar&aacute; con el uso de una o m&aacute;s de las
palabras &quot; puede&quot;, &quot;se recomienda&quot; o &quot;se
sugiere&quot; . Los art&iacute;culos marcados como opcionales no tienen influencia
en la conformidad o compatibilidad de una implementaci&oacute;n, s&oacute;lo son
sugerencias pensadas para motivar la pr&aacute;ctica com&uacute;n, pero pueden estar
localizados en cualquier lugar a juicio del implementador.  
<P>
<P>
<H2><A NAME="sec2"></A> <A NAME="s5">5. El sistema de Archivos </A></H2>

<P>El sistema de archivos <B>UNIX</B> est&aacute; caracterizado por:
<P>
<P> Una estructura jer&aacute;rquica. <BR> Un tratamiento consistente de la
informacion de los archivos. <BR> Proteccion de los archivos.
<P>
<P> Este est&aacute;ndar del sistema de archivos <B>Linux</B> sigue el mismo
principio basico que la mayor&iacute;a de los sistemas de archivos <B>UNIX</B>
siguen. Note, sin embargo que este est&aacute;ndar no intenta concordar en cada
aspecto posible con alguna implementacion particular del sistema <B>UNIX</B>.
De cualquier forma, muchos de los aspectos de este est&aacute;ndar estan basados en
ideas encontradas en <B>UNIX</B> y sistemas similares a <B>UNIX</B>.
<P>
<P> Es posible despu&eacute;s de cuidadosa consideracion de otros factores,
incluyendo:
<P>
<P> Pr&aacute;cticas comunes en la comunidad <B>Linux</B>.<BR> La implementaci&oacute;n de
otras estructuras de sistemas de archivos.<BR> Los est&aacute;ndares
aplicables.<BR>
<P>
<P> Definir dos categorizaciones ortogonales de archivos: Compartibles vs.
no compartibles, y variables vs. estaticos.
<P>
<P> La informacion compartible es aquella que puede ser compartida entre
varias m&aacute;quinas diferentes; la no compartible es aquella que debe ser local
a una m&aacute;quina particular. Por ejemplo. Los directorios hogar de los usuarios
son compartibles, pero los archivos de bloqueo de dispositivo (lock files)
son no compartibles.
<P>
<P> La informaci&oacute;n est&aacute;tica incluye binarios, librerias, documentaci&oacute;n y
todo aquello que no cambia sin la intervenci&oacute;n del administrador del
sistema. La informacion variable es todo lo que cambia sin la intervenci&oacute;n
del administrador.
<P>
<P> El entendimiento de estos principios b&aacute;sicos ayudar&aacute; a guiar la
estructura, a lo largo de este documento, y en cualquier sistema de archivos
bien planeado, esto brindar&aacute; consistencia adicional.
<P>
<P> La distinci&oacute;n entre informaci&oacute;n compartible y no compartible es
necesaria por varias razones:
<P>
<P> En un ambiente de red (i.e. m&aacute;s de un host en un site), existe una buena
cantidad de informaci&oacute;n que se puede compartir entre diferentes m&aacute;quinas
para ahorrar espacio y facilitar la tarea de administraci&oacute;n.<BR> En un
ambiente de red, ciertos archivos contienen informaci&oacute;n espec&iacute;fica a una
sola m&aacute;quina, por tanto, estos sistemas de archivos no pueden ser
compartidos (sin tomar medidas especiales).<BR> Las implementaciones de
facto del sistema de archivos no permit&iacute;an que la jerarqu&iacute;a /usr fuera
montada s&oacute;lo-lectura, porque conten&iacute;a archivos y directorios que nesecitaban
ser escritos muy frecuentemente. &Eacute;ste es un factor que debe atacarse cuando
algunas partes de /usr se comparten en una red, o se montan s&oacute;lo-lectura
debido a otras consideraciones tales como la seguridad.
<P>
<P> La distincion &quot;compartible&quot; puede ser usada para soportar, por
ejemplo:
<P>
<UL>
<LI>Una partici&oacute;n /usr (o componentes de /usr) montada (s&oacute;lo-lectura) atraves de la red (usando NFS).</LI>
<LI>Una particion /usr (o componentes de /usr) montada desde medios de s&oacute;lo-lectura.Un cd-rom puede ser considerado como un sistema de archivos  s&oacute;lo-lectura compartido con otros sistemas <B>Linux</B> utilizando el sistema de correo como una red.</LI>
</UL>
<P>La distincion &quot;est&aacute;tica&quot; contra &quot;variable&quot; afecta el
sistema de archivos de dos maneras principales:
<P>
<P> Dado que / contiene ambos tipos de informaci&oacute;n, variable y est&aacute;tica
necesita montarse lectura-escritura.<BR> Dado que el /usr tradicional
contiene ambos tipos de informaci&oacute;n variable y est&aacute;tica y dado que podr&iacute;amos
desear montarlo s&oacute;lo-lectura (vea arriba), es necesario proporcionar un
m&eacute;todo para hacer que /usr se monte s&oacute;lo-lectura. &Eacute;sto se logra con la
creaci&oacute;n de una jerarqu&iacute;a /var que se monta lectura-escritura (o es parte de
una partici&oacute;n lectura-escritura tal como /), que toma mucho de la
funcionalidad tradicional de la particion /usr. 
<P>
<P>
<H2>5.1 Tabla con ejemplos.</H2>

<P>CompartibleNo-CompartibleEst&aacute;tica/usr/etc/home/bootVariable/var/spool/mail/var/run/var/spool/news/var/lock3.
El directorio ra&iacute;z /. Esta secci&oacute;n describe la estructura del directorio
ra&iacute;z. El contenido del sistema de archivos ra&iacute;z ser&aacute; el adecuado para
arrancar, bootear, restaurar,recuperar y/o reparar el sistema:
<P>
<P> Para arrancar el sistema, debe estar presente lo suficiente como para
montar /usr y otras partes no-esenciales del sistema de archivos. &Eacute;sto
incluye herramientas, informaci&oacute;n de configuraci&oacute;n y del cargador de
arranque (boot loader) y alguna otra informaci&oacute;n esencial al arrancar. <BR>
Para habilitar la recuperaci&oacute;n y/o la reparaci&oacute;n del sistema, estar&aacute;
presente en el sistema de archivos ra&iacute;z aquellas herramientas que un
administrador experimentado necesitar&iacute;a para diagnosticar y reconstruir un
sistema da&ntilde;ado. <BR> Para restaurar un sistema, estar&aacute;n presentes en el
sistema de archivos ra&iacute;z aquellas herramientas necesarias para restaurar el
sistema desde respaldos (en floppy, cintas, etc).
<P>
<P> La principal preocupaci&oacute;n que se usa para balancear las anteriores
consideraciones, que favorecen el colocar muchas cosas en el sistema de
archivos ra&iacute;z, es la meta de mantener / tan pequeno como sea razonablemente
posible. Por varias razones es deseable mantener el sistema de archivos /
<P>
<P> Es frecuentemente montado desde media muy pequena. Por ejemplo muchos
usuarios de <B>Linux</B> instalan y recuperan sistemas montando / como un
disco ram, que es copiado de un disco de 1.44Mb &uacute;nico. <BR> El sistema de
archivos / tiene muchos archivos de configuraci&oacute;n espec&iacute;ficos de un sistema.
Posibles ejemplos son un kernel que es espec&iacute;fico al sistema, un hostname
diferente, etc. &Eacute;sto significa que el sistema de archivos / no es siempre
compartible entre sistemas en red. Manteni&eacute;ndolo peque&ntilde;o en sistemas en red,
se minimiza el espacio perdido en los servidores por archivos
no-compartibles. Tambi&eacute;n permite estaciones de trabajo con discos duros
locales m&aacute;s peque&ntilde;os. <BR> Aunque usted podr&iacute;a tener el sistema de archivos
/ en una partici&oacute;n grande, y ser capaz de llenarla seg&uacute;n sus deseos, siempre
habr&aacute; gente con particiones m&aacute;s peque&ntilde;as. Si usted tiene m&aacute;s archivos
instalados, podr&iacute;a encontrar incompatibilidades con otros sistemas que
utilizan un sistema de archivos / en particiones m&aacute;s peque&ntilde;as. Si usted es
un desarrollador entonces estar&iacute;a volviendo su suposici&oacute;n en un problema
para un gran n&uacute;mero de usuarios. <BR> Los errores del disco, que corrompen
la informaci&oacute;n en el sistema de archivos / son un problema mayor que los
errores en cualquier otra partici&oacute;n. Un sistema de archivos / peque&ntilde;o es
menos propenso a corromperse como resultado de una falla del sistema. <BR>
En este documento, actualmente se requiere un sistema de archivos /
escribible (debido principalmente a /etc/mtab). De cualquier forma, no se
necesita que el sistema de archivos / est&eacute; totalmente almacenado localmente.
La partici&oacute;n / no tiene porque estar almacenada localmente para ser
espec&iacute;fica del sistema por ejemplo, podr&iacute;a estar montada de un servidor NFS.
<P>
<P> El software no deber&aacute; crear o requerir archivos o subdirectorios
especiales en el directorio /. La estructura del sistema de archivos
<B>Linux</B> proporciona m&aacute;s que suficiente flexibilidad para cualquier
paquete. Cualquier paquete que ocupe un directorio bajo la ra&iacute;z / del
sistema de archivos sufre de bastante arrogancia. 
<P>
<P>
<H2><A NAME="sec3"></A> 5.2 El Directorio Ra&iacute;z </H2>

<P>
<BLOCKQUOTE><CODE>
<PRE>

bin             Binarios de comandos esenciales  
boot            Archivos est&aacute;ticos de cargador de arranque(boot-loader)
dev             Archivos de dispositivos
etc             Configuraci&oacute;n del sistema local-m&aacute;quina
home            Directorios home de los usuarios
lib             Librer&iacute;as compartidas
mnt             Punto de montaje de particiones temporales
root            Directorio hogar del usuario root
sbin            Binarios del sistema esenciales
tmp             Archivos temporales 
usr             Segunda jerarqu&iacute;a mayor
var             Informaci&oacute;n variable
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P> Cada directorio listado ser&aacute; discutido en detalle en una subsecci&oacute;n
separada m&aacute;s delante. /usr y /var, cada uno tiene en su propia secci&oacute;n en
este documento.
<P>
<P> El kernel de <B>Linux</B> estar&iacute;a localizado en, ya sea / &oacute; en /boot. Si
est&aacute; localizado en / recomendamos usar el nombre VMLINUX o VMLINUZ, nombres
que han sido usados en paquetes fuentes del kernel de <B>Linux</B> recientes.
M&aacute;s informaci&oacute;n de la localizaci&oacute;n del kernel se puede encontrar en la
secci&oacute;n acerca de / m&aacute;s delante. 
<P>
<P>
<H2>5.3 /bin   Binarios de comandos esenciales de usuarios (disponibles para todos los usuarios).</H2>

<P> bin contiene comandos que pueden ser utilizados por ambos los usuarios y
/el administrador del sistema, pero que son requeridos en el modo
/mono-usuario (single-user mode) puede tambi&eacute;n contener comandos que son
/utilizados indirectamente por algunos scripts.
<P>
<P> Todos los binarios utilizables s&oacute;lo por root, tales como
daemons,init,getty, update, etc. Estar&iacute;an localizados en /sbin &oacute; /usr/sbin
dependiendo si son o no esenciales. Para una mayor discusi&oacute;n de la
definici&oacute;n de que es esencial en el sistema de archivos /, lea por favor la
secci&oacute;n 6, &quot;Razonamientos adicionales y asuntos sin resolver&quot;.
<P>
<P> No habr&aacute; subdirectorios dentro de /bin.
<P>
<P> Los binarios de los comandos que no son suficientemente esenciales para
estar en /bin estar&aacute;n localizados en /usr/bin, los elementos que son
utilizados por usuarios solamente (pero no por root) (mail,chsh, etc) no son
suficientemente esenciales para estar dentro de la partici&oacute;n /.
<P>
<P>Archivos requeridos en /bin:
<P>
<H3>Comandos generales:</H3>

<P> Los siguientes comandos han sido incluidos porque son esenciales.
algunos est&aacute;n presentes debido a que tradicionalmente han estado en /bin.
<P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
arch, cat, chgrp, chmod, chown, cp, date, dd, df, dmesg, echo, ed, false,kill, in, login, mxdir, mknod, more, mount, mv, ps, pwd, rm, rmdir, sed, setserial, sh, sfty, su, sinc, true, umount, uname.
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>Si /bin/sh es Bash, entonces /bin/sh ser&iacute;a en enlace simb&oacute;lico o duro a
/bin/bash dado que bash se comporta diferente cuando es llamado como sh &oacute;
bash. La pdksh que puede ser la /bin/sh en los discos de instalaci&oacute;n y ser&iacute;a
igualmente arreglada a que /bin/sh sea un enlace simb&oacute;lico a /bin/ksh. El
uso de enlaces simb&oacute;licos en estos casos permite que los usuarios vean
f&aacute;cilmente que /bin/sh no es una shell estilo bourne.
<P>
<P> Dado que la localizaci&oacute;n est&aacute;ndar de facto de shell estilo c es
/bin/csh,si y s&oacute;lo si est&aacute; disponible en el sistema una shell estilo c &oacute;
equivalente (tal como /bin/tcsh, esta, estar&iacute;a disponible con el nombre
/bin/csh. /bin/csh puede ser un enlace simb&oacute;lico a /bin/tcsh &oacute;
/usr/bin/tcsh).
<P>
<P> Los comandos [ y test est&aacute;n interconstruidos en bash, pdksh, zsh, y
las shell korn recientes, esencialmente cada remplazo de las shell tipo
bourne que hay para <B>Linux</B>. Estos comandos estar&iacute;an localizados dentro
de /usr/bin. (se deben incluir como binarios separados con cualquier sistema
<B>Linux</B> que intente cumplir con el est&aacute;ndar POSIX).
<P>
<P> bin/arch producir&iacute;a el mismo resultado que uname-m, especificamente; 386
/o; 486 para sistemas intel y compatibles.
<P>
<H3>Comandos para restauraci&oacute;n.</H3>

<P> Estos comandos se han incluido para hacer posible el restaurar el
sistema(siempre que / este intacto). <BR>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
tar, gzip, gunzip (enlace hacia gzip), zcat (enlace hacia gzip).
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>Si se hacen respaldos de sistemas utilizando otros programas, entonces la
particion / contendr&aacute; los componentes m&iacute;nimos necesarios. Por ejemplo,muchos
sistemas incluir&iacute;an cpio como la segunda utiler&iacute;a m&aacute;s usada para respaldos
despu&eacute;s de tar. Pero si jam&aacute;s se espera restaurar el sistema desde la
partici&oacute;n /, entonces estos binarios se pueden omitir (i.e.,montar / en chip
ROM, montar /usr desde NFS). Si la restauraci&oacute;n del sistema se planea a
traves de la red, Entonces FTP &oacute; TFTP (junto con todo lo necesario para
obtener una conexi&oacute;n FTP) estar&iacute;an disponibles en la partici&oacute;n /. <BR> Los
comandos de restauraci&oacute;n pueden aparecer en, ya sea /bin &oacute; /usr/bin en
sistemas <B>Linux</B> diferentes. 
<P>
<P>
<H3>Comandos de red.</H3>

<P>&Eacute;stos son unicamente los binarios de red que los usuarios y root querr&aacute;n o necesitar&aacute;n ejecutar que no sean los que estan en /usr/bin &oacute; /usr/local/bin <BR> 
<BLOCKQUOTE><CODE>
<HR>
<PRE>
domainname, hostname, netstat, ping.
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>
<H2>5.4 /boot: Archivos est&aacute;ticos del cargador de arranque (boot loader).</H2>

<P> Este directorio contiene todo para arrancar excepto los archivos de
configuraci&oacute;n y el instalador de mapas. En su sentido m&aacute;s sencillo /boot es
para cualquier cosa que se utiliza antes de que el kernel ejecute
/sbin/init. &Eacute;sto incluye sectores maestros de arranque (master boot sectors)
guardados, archivos de mapeo de sectores y cualquier otra cosa que no es
editada directamente a mano.Los programas necesarios para arreglar que el
cargador de arranque sea capaz de arrancar un archivo (tal como el
instalador de mapas [lilo] ) estar&aacute;n localizados en /sbin. Los archivos de
configuraci&oacute;n para cargadores de arranque podr&iacute;an estar localizados en /etc.
<P>
<P> Como se expuso arriba, el kernel de <B>Linux</B> puede estar localizado en
/ &oacute; en /boot, si se localiza en /boot, recomendamos que se le d&eacute; un nombre
m&aacute;s descriptivo.
<P>
<H2>5.5 /dev Archivos de dispositivos.</H2>

<P> &Eacute;ste es el directorio de los dispositivos. Contendr&iacute;a un archivo por
cada dispositivo que el kernel de <B>Linux</B> puede soportar.
<P>
<P> dev tambi&eacute;n contiene un script llamado MAKEDEV el cual puede crear
/dispositivos cuando se necesiten. Puede contener un MAKEDEV local para
/dispositivos s&oacute;lo-local.
<P>
<P> MAKEDEV debe hacer previsi&oacute;n para crear cualquier archivo de dispositivo
especial listado en la lista de numeros mayores/menores, no s&oacute;lo aquellos de
una distribuci&oacute;n particular.
<P>
<P> Los enlaces simb&oacute;licos no se deben distribuir en sistemas <B>Linux</B>,
sino s&oacute;lo como se preve&eacute; en la lista de dispositivos de <B>Linux</B>. &Eacute;sto es
porque las instalaciones locales seguro diferir&aacute;n de aquellas de la m&aacute;quina
del desarrollador. Ademas si un script de instalaci&oacute;n configura enlaces
simb&oacute;licos en la instalaci&oacute;n, estos enlaces seguramente no se actualizar&aacute;n
si se hacen cambios locales en el hardware. Cuando se usan
responsablemente,como sea, son de buen uso.
<P>
<P> Este documento incorpora como referencia la lista de dispositivos de
<B>Linux</B>, mantenida por: Peter.Anvin@linux.org: El encargado de los
dispositivos <B>Linux</B>.Todos los archivos especiales de dispositivo
seguir&aacute;n el est&aacute;ndar en ese documento, que est&aacute; disponible en
ftp.yggdrasil.com en /pub/device-list. 
<P>
<P>
<H2>5.6 /etc : Configuraci&oacute;n del sistema local a la m&aacute;quina.</H2>

<P> etc contiene archivos y directorios que son locales al sistema actual.
<P>
<P> Ning&uacute;n binario debe ir directamente dentro de /etc. Los binarios que en
el pasado se encontraban en /etc, ir&aacute;n en /sbin &oacute; /usr/sbin. &Eacute;sto incluye
archivos tales como init, getty y update. Los binarios tales como hostname
que son utilizados por usuarios ordinarios y por root no ir&iacute;an en /sbin
sino en /bin.
<P>
<BLOCKQUOTE><CODE>
<PRE>
/etc --- Configuracion de sistemas locales de m&aacute;quina.

X11             Archivos deconfiguracion para el x11
skel            Esqueletos de configuracion de usuarios
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P> etc/skel es la localidad para los llamados archivos esqueletos de
/usuarios, que le son dados por defecto cuando un nuevo usuario recibe una
/cuenta, este directorio puede contener subdirectorios para diferentes
/grupos de usuarios (i.e./etc/skell/apoyo, /etc/skell/usuarios).
<P>
<P> etc/X11 es el lugar recomendado para todos los archivos de configuraci&oacute;n
/de X11 locales a la m&aacute;quina. Este directorio es necesario para permitir el
/control local si /usr se monta s&oacute;lo-lectura. Los archivos que deben ir en
/este directorio incluyen Xconfig (y/o XF86Config) y Xmodmap.
<P>
<P> Los subdirectorios de /etc/X11 pueden incluir aquellos para xdm y para
cualesquier otros programas (como algunos manejadores de ventanas por
ejemplo) que lo necesiten. Recomendamos que los manejadores de ventanas con
un solo archivo de configuraci&oacute;n que es un archivo .*wmrc por defecto, que
lo llamen system.*wmrc (a menos que exista una alternativa ampliamente
aceptada) y que no utilize un subdirectorio. Cualquier subdirectorio de un
manejador de ventanas se llamar&iacute;a id&eacute;ntico al binario del manejador de
ventanas.
<P>
<P> etc/X11/xdm retiene los archivos de configuraci&oacute;n de xdm. &Eacute;sto es la
/mayor&iacute;a de los archivos normalmente hallados en /usr/lib/X11/xdm; Vea la
/seccion 5,/var/lib/xdm, para mayor informaci&oacute;n.
<P>
<P> La siguiente secci&oacute;n intenta parcialmente examinar la descripci&oacute;n del
contenido de /etc con algunos ejemplos: Definitivamente &eacute;sta no es una
lista exhaustiva.
<P>
<P>Archivos requeridos en /etc:
<P>
<H3>Archivos generales:</H3>

<P> Estos archivos son necesarios en la mayor&iacute;a de los sistemas <B>Linux</B>.<BR>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
adjtime, csh.login, disktab, fdprm, fstab, gettydefs, group, inittab, issue, ld.so.conf, lilo.conf, magic, motd, mtab, mtools, passwd, profile, psdatabase, securetty, shells, syslog.conf, tercamp, ttytype
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>
<H3>Archivos de Red: </H3>

<P> Estos archivos estar&iacute;an instalados en la mayoria
de los sistemas <B>Linux</B>. <BR> 
<P>
<BLOCKQUOTE><CODE>
 
<HR>
<PRE>
 

exports, ftpusers, gateways, hosts, host.conf, host.equiv, host.lpd,
inetd.conf, networks, printcap, protocols, resolv.conf.rpc, services
</PRE>
<HR>
 
</CODE></BLOCKQUOTE>
 
<P>
<P> Hay dos modelos para la instalaci&oacute;n de los scripts de comandos
&quot;rc&quot; los cuales son invocados por init(8) al momento de arrancar,
el modelo
/etc/rc.d/* estilo SystemV.  Cualquiera puede ser utilizado o una mezcla de
los dos.
<P>
<P> Los sistemas con la suite de passwords sombreadas (shadow password)
tendr&aacute;n archivos de configuraci&oacute;n adicionales, en /etc (/etc/shadow y otros)
y /usr/bin (useradd, usermod, y otros). 
<P>
<P>
<H2>5.7 /home:  Directorios hogar de los usuarios (opcional) </H2>

<P> home es un concepto algo est&aacute;ndar, pero es claramente un sistema de
/archivos espec&iacute;fico de un site. El arreglo diferir&aacute; de m&aacute;quina a m&aacute;quina. 
/Esta secci&oacute;n describe una localizaci&oacute;n sugerida para los directorios hogar
/de los usuarios, aun as&iacute;, recomendamos que todas las distribuciones
/<B>Linux</B> usen este lugar como la localizaci&oacute;n por defecto de los
/directorios hogar.
<P>
<P> En sistemas peque&ntilde;os, cada directorio de usuario es uno de los
subdirectorios debajo de /home, p.ej. /home/smith, /home/torvalds,
/home/operador, etc.
<P>
<P> En sistemas grandes (especialmente cuando los directorios /home son
compartidos entre varias m&aacute;quinas usando NFS) es &uacute;til subdividir los
directorios hogar.  La subdivisi&oacute;n puede ser llevada a cabo utilizando
subdirectorios tales como /home/apoyo, /home/hu&eacute;spedes, /home/estudiantes,
etc.
<P>
<P> Muchas personas prefieren poner las cuentas de los usuarios en una
variedad de lugares.  Por tanto, ning&uacute;n programa deber&aacute; confiar en esta
localizaci&oacute;n.  Si usted desea encontrar el directorio hogar de cualquier
usuario, deber&iacute;a usar la funci&oacute;n de librer&iacute;a getpwent(3) en vez de contar
con /etc/passwd, por que la informaci&oacute;n puede estar almacenada remotamente
usando usando sistemas como NIS. 
<P>
<P>
<H2>5.8 /lib: Librer&iacute;as compartidas y m&oacute;dulos de kernel escenciales</H2>

<P> El directorio /lib contiene aquellas im&aacute;genes de las librer&iacute;as
compartidas que se necesitan para arrancar el sistema y ejecutar los
comandos en el sistema de archivos ra&iacute;z.
<P>
<P> lib --- librer&iacute;as compartidas y modulos de kernel esenciales. <BR>
modules Modulos de kernel cargables.
<P>
<P> Esto incluye /lib/libc.so.*, /lib/libm.so.*, el enlazador din&aacute;mico
compartido /lib/ld.so.*, y otras librer&iacute;as compartidas requeridas por
binarios en /bin y /sbin.
<P>
<P> Las librer&iacute;as que son necesitadas s&oacute;lo por los binarios en /usr (como
cualquier binario de X Window) no pertenecen a /lib.  S&oacute;lo las librer&iacute;as
compartidas requeridas para ejecutar los binarios dentro de /bin y /sbin
deben estar aqu&iacute;.  La librer&iacute;a libm.so.* podr&iacute;a estar localizada en /usr/lib
si no es requerida por nada en /bin &oacute; /sbin.
<P>
<P> Por razones de compatibilidad, /lib/cpp necesita existir como una
referencia al pre-procesador C instalado en el sistema.  La localizaci&oacute;n
usual del binario es /usr/lib/gcc-lib/&lt;target&gt;/&lt;version&gt;/cpp.
Puede existir un enlace/lib/cpp apuntando a este binario o a cualquier otra
referencia a este binario que exista en el sistema de archivos. (Por
ejemplo, /usr/bin/cpp se usa frecuentemente).
<P>
<P> La especificaci&oacute;n para /lib/modules est&aacute; a&uacute;n por aparecer. 
<P>
<P>
<H2>5.9 /mnt:  Punto de montaje para sistemas de archivos montados temporalmente.</H2>

<P> Este directorio se ha provisto para que el administador pueda montar
temporalmente sistemas de archivos cuando lo necesite.  El contenido de este
directorio es un asunto local y no debe afectar la manera en la cual se
ejecuta ning&uacute;n programa.
<P>
<P> Recomendamos la no utlizaci&oacute;n de este directorio por programas de
instalaci&oacute;n, y sugerimos utilizar un directorio temporal adecuado que no
este en uso por el sistema.
<P>
<H2>5.10 /proc:  Sistema de archivos virtual de informacion de procesos y del kernel.</H2>

<P> El sistema de archivos proc se est&aacute; convirtiendo en el est&aacute;ndar de facto
para el manejo de informacion de procesos y de sistema en vez de /dev/kmem y
otros metodos similares. Recomendamos fuertemente esto para el
almacenamiento y obtenci&oacute;n de informaci&oacute;n de procesos asi como otra
informaci&oacute;n del kernel y de memoria. 
<P>
<P>
<H2>5.11 /root:  Directorio hogar de root (opcional)</H2>

<P> El directorio / es tradicionalmente el directorio hogar del usuario root
en los sistemas <B>UNIX</B>.  /root se usa en muchos sistemas <B>Linux</B> y en
algunos sistemas <B>UNIX</B>. El directorio hogar de la cuenta de el usuario
root puede ser determinada por el desarrollador o por preferencias locales. 
Las posibilidades obvias incluyen /, /root, y /home/root.
<P>
<P> Si el directorio hogar de root no est&aacute; almacenado en la partici&oacute;n ra&iacute;z,
ser&aacute; necesario asegurarse que tome / por defecto si no puede ser localizado.
<P>
<P> NOTA: Recomendamos contra el uso de la cuenta root para cosa mundanas
tales como leer el correo y ver las noticias (mail &amp; news) sino que se use
solamente para la administraci&oacute;n del sistema. Por esta raz&oacute;n recomendamos
que no aparezcan subdirectorios como Mail y News en el directorio hogar de
la cuenta del usuario root.  Recomendamos que el Mail para root y postmaster
sean redirigidos a un usuario m&aacute;s adecuado.
<P>
<P> 
<H2>5.12 /sbin: Binarios del Sistema (Alguna vez mantenidos en /etc)</H2>

<P> Los &uacute;tiles usados por la administraci&oacute;n del sistema ( y otros comandos
que s&oacute;lo root utiliza ) est&aacute;n almacenados en /sbin, /usr/sbin, y
/usr/local/sbin.  /sbin t&iacute;picamente contiene binarios escenciales para
arrancar el sistema ademas de los binarios en /bin.  Cualquier cosa que se
ejecuta despu&eacute;s de que se sabe que /usr se ha montado (cuando no hay
problemas) deber&iacute;a estar en /usr/sbin.  Los binarios de administraci&oacute;n de
sistema s&oacute;lo-locales deben estar localizados en /usr/local/sbin.
<P>
<P> Decidir que cosa va en los directorios de /sbin es sencillo: Si un
usuario necesitar&aacute; ejecutarlo, debe de ir en otro lado.  Si s&oacute;lo ser&aacute;
ejecutado por el administrador del sistema o por root como scripts de
administraci&oacute;n, entonces debe ir en /sbin (o en /usr/sbin o en
/usr/local/sbin, si el archivo no es vital para la operaci&oacute;n del sistema).
<P>
<P> Archivos como chfn que los usuarios usan s&oacute;lo ocasionalmente deben aun
estar en /usr/bin. ping aunque es absolutamente necesario para el root
(recuperaci&oacute;n de la red y diagn&oacute;stico) es tambien frecuentemente usado por
los usuarios y por esa razon debe ir en /bin.
<P>
<P> Los usuarios ordinarios no tendr&aacute;n que poner ninguno de los directorios
sbin en su b&uacute;squeda (path).
<P>
<P> Recomendamos que los usuarios tengan permisos de lectura y ejecuci&oacute;n en
todo lo que se encuentra en /sbin excepto tal vez ciertos programas; setuid
y setgid.  La divisi&oacute;n entre /sbin y /bin no fue creada por motivos de
seguridad o para evitar que los usuarios vieran el sistema operativo, sino
para proveer una buena partici&oacute;n entre binarios que todos usan y los que se
usan, principalmente las tareas de administraci&oacute;n. No hay ganancia inherente
en seguridad en hacer que /sbin este fuera del alcance de los usuarios.
<P>
<P>Archivos requeridos en /sbin:
<P>
<H3>Comandos Generales.</H3>

<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
clock, getty, init, update, mkswap, swapon, swapoff, telinit.
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>
<H3>Comandos de Apagado.</H3>

<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
fastboot, fasthalt, halt, reboot, shutdown.
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>
<H3>Comandos de manejo de sistemas de archivos.</H3>

<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
fdisk, fsck, fsck.*, mkfs, mkfs.*
</PRE>
<HR>
 
</CODE></BLOCKQUOTE>
<P>donde * = uno de los siguientes. <BR>
ext, ext2 minix, msdos, xia, y tal vez otros. <BR>
<P>
<H3>Comandos del sistema de archivos ext2 (opcional)</H3>

<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
badblocks, dumpe2fs, e2fsck, mke2fs, mklost+found, tune2fs.
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>Instalador del mapa del cargador de arranque. <BR>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
lilo
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>
<H3>Comandos de Red.</H3>

<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
arp, ifconfig, route.
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>
<P>Archivos opcionales en /sbin:
<P>
<H3>Binarios est&aacute;ticos. (compilados est&aacute;ticamente)</H3>

<P> ln est&aacute;tico sln y sync est&aacute;tico ssync son &uacute;tiles cuando las cosas salen
mal. El principal uso de sln (reparar enlaces simb&oacute;licos incorrectos en /lib
despues de una actualizaci&oacute;n mal orquestrada) ya no es preocupaci&oacute;n mayor
ahora que existe el programa ldconfig (usualmente localizado en /usr/sbin) y
puede actuar como una mano guiadora al actualizar las librer&iacute;as din&aacute;micas.
sync est&aacute;tico es &uacute;til en algunas ocasiones de emergencia.  Note que estas no
necesitan ser versiones compiladas est&aacute;ticamente de los ln y sync
est&aacute;ndares, pero pueden ser.
<P>
<P> El binario ldconfig es opcional en /sbin, dado que un site puede escoger
ejecutar ldconfig al arrancar, en vez de s&oacute;lo cuando se actualizan las
librer&iacute;as compartidas. (No est&aacute; claro si es o no ventajoso ejecutar ldconfig
en cada arranque).  Aun as&iacute;, a algunos les gusta tener ldconfig a la mano
para las siguientes (muy comunes) situaciones: <BR> Se acaba de remover
/lib/&lt;archivo&gt;. <BR> No se puede encontrar el nombre de la librer&iacute;a
porque ls est&aacute; enlazado din&aacute;micamente.  Se est&aacute; usando una shell que no
tiene ls interconstruida y no se sabe como usar &quot;echo * &quot; como
remplazo. <BR> Se tiene un sln, pero no se sabe como nombrar al enlace. 
<P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>
ldconfig, sln, ssync.
</PRE>
<HR>
</CODE></BLOCKQUOTE>
<P>
<P>
<H3>Miscel&aacute;neos</H3>

<P>Para lidiar con el hecho de que muchos teclados vienen con una tasa de repeticion tan alta como para hacerlos inutilizables, se puede instalar kbdrate en /sbin en algunos sistemas.  Dado que la acci&oacute;n por defecto del kernel ante la combinacion de teclas Ctrl-Alt-Del es un rearranque instant&aacute;neo duro, es recomendable generalmente deshabilitar esta conducta antes de montar el sistema de archivos ra&iacute;z con modo lectura-escritura. Algunas suites init son capaces de deshabilitar Ctrl-Alt-Del, pero otras pueden requerir el programa ctrlaltdel, el cual puede ser instalado en /sbin en estos sistemas.
<P>
<HR>
<PRE>
ctrlaltdel, kbdrate
</PRE>
<HR>
<P>
<P>
<H2>5.13 /tmp:  Archivos temporales.</H2>

<P> tmp se utiliza para archivos temporales, preferentemente en un
/dispositivo r&aacute;pido (un sistema de archivos basado en memoria por ejemplo)
<P>
<P> La &quot;persistencia&quot; de la informacion que es almacenada en /tmp
es diferente de aquella que sea almacenada en /var/tmp.  /tmp puede ser
limpiada en cada arranque o a intervalos relativamente frecuentes. Por
tanto, no se debe esperar que la informacion almacenada en /tmp permanezca
por alg&uacute;n periodo largo de tiempo.
<P>
<P> Los programas deben utilizar /tmp &oacute; /var/tmp (que era originalmente
/usr/tmp) de acuerdo a los requerimientos esperados de la informacion, pero
no deben confiar en alguna persistencia temporal particular en cualquier
directorio de almacenamiento temporal.
<P>
<P> Los administradores de sistemas pueden elegir enlazar /tmp a algun otro
directorio, tal como /var/tmp; esto es &uacute;til, por ejemplo, para conservar
espacio en la partici&oacute;n ra&iacute;z.  Si &eacute;sto se lleva a cabo, entonces la
persistencia de archivos en /var/tmp debe ser al menos tan larga como la de
/tmp.
<P>
<P> tmp puede estar e un disco RAM.  /var/tmp no debe nunca localizarse en
/algun dispositivo RAM.
<P>
<P>
<H2><A NAME="sec4"></A> <A NAME="s6">6. La jerarqu&iacute;a /usr </A></H2>

<P> usr es la segunda mayor seccion del sistema de archivos.  /usr es
/informacion compartible, de s&oacute;lo-lectura, esto significa que /usr, debe ser
/compartible entre varias m&aacute;quinas que corren <B>Linux</B> y no se debe
/escribir.  Cualquier informacion que es local a una m&aacute;quina o var&iacute;a con el
/tiempo, se almacena en otro lugar.
<P>
<P>Ningun paquete grande (como <B>TeX</B> o <B>GNU Emacs</B>) debe utilizar un
subdirectorio directo bajo /usr, en vez, debe haber un subdirectorio dentro
de /usr/lib (o /usr/local/lib si fu&eacute; instalado completamente local) para ese
prop&oacute;sito, con el sistema X Window se hace una excepci&oacute;n debido a un
considerable precedente y a la pr&aacute;ctica ampliamente aceptada. 
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr --- Segundo mayor punto de montaje (permanente)

X11R6           Sistema X Window Version 11 release 6
X386            Sistema X Windows Version 11 release 5 en plataformas  X 86
bin             La mayor&iacute;a de los comandos de usuario
dict            Listas de palabras
doc             Documentaci&oacute;n miscel&aacute;nea
etc             Configuraci&oacute;n del Sistema (todo el site)
games           Juegos y binarios educacionales
include         Archivos header incluidos por programas C
info            Directorio primario del sistema GNU Info
lib             Librer&iacute;as
local           Jerarqu&iacute;a local (vac&iacute;a justo despu&eacute;s de la instalaci&oacute;n principal)
man             Manuales en l&iacute;nea
sbir            Binarios de Administraci&oacute;n del Sistema No-Vitales
share           Informaci&oacute;n independiente de la arquitectura
src             C&oacute;digo fuente
</PRE>
</CODE></BLOCKQUOTE>
<P>Los siguientes enlaces simb&oacute;licos a directorios pueden estar presentes. 
Esta posibilidad se basa en la necesidad de preservar la compatibilidad con
sistemas anteriores hasta que en todas las implementaciones se pueda asumir
el uso de la jerarqu&iacute;a /var. 
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>

/usr/adm  ------------------&gt;  /var/adm
/usr/preserve  -------------&gt;  /var/preserve
/usr/spool  ----------------&gt;  /var/spool
/usr/tmp  ------------------&gt;  /var/tmp
/var/spool/locks  ----------&gt;  /var/lock
</PRE>
</CODE></BLOCKQUOTE>
<P>Una vez que el sistema ya no requiera m&aacute;s alguno de los anteriores enlaces
simb&oacute;licos, el enlace se puede remover, si se desea.  Notablemente, s&oacute;lo se
necesita poco esfuerzo para remover completamente /usr/preserve, dado que
s&oacute;lo ex y vi lo utilizan. 
<P>
<P>
<H2>6.1 /usr/X11R6:  El sistema X Window, Version 11 release 6</H2>

<P> Esta jerarqu&iacute;a est&aacute; reservada para el sistema X Window, Version 11
release 6 y archivos relacionados.
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/X11R6 --- X Window System (Version 11, release 6)

bin
doc
include
lib
man
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P> Para simplificar los problemas y hacer <B>XFree86</B> m&aacute;s compatible con
el sistema X Window en otros sistemas, los siguientes enlaces simbolicos
deben estar presentes.
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>

/usr/bin/X11  ------------&gt;  /usr/X11R6/bin
/usr/lib/X11  ------------&gt;  /usr/X11R6/lib/X11
/usr/include/X11  --------&gt;  /usr/X11R6/include/X11
</PRE>
</CODE></BLOCKQUOTE>
<P>En general, el software no se debe instalar o manejar v&iacute;a los anteriores
enlaces simb&oacute;licos.  S&oacute;lo est&aacute;n para la utilizaci&oacute;n por usuarios.  La
dificultad est&aacute; relacionada con la versi&oacute;n y el release del sistema X
Window; en per&iacute;odos transicionales es imposible saber que release de X11
est&aacute; utilizandose . <BR> Por la misma raz&oacute;n no debe existir un enlace desde
/usr/X11 apuntando a la jerarqu&iacute;a del sistema X Window actual. 
<P>
<P>
<H2>6.2 /usr/X386:  El sistema X Window, Version 11 release 5 en plataformas X 86</H2>

<P> Esta jerarqu&iacute;a es generalmente id&eacute;ntica a /usr/X11R6, excepto que los
enlaces simb&oacute;licos de /usr deben estar ausentes si est&aacute; instalado /usr/X11R6
<P>
<P>
<H3>/usr/bin:  La mayor&iacute;a de los comandos del usuario.</H3>

<P>&Eacute;ste es el directorio principal de comandos ejecutables en el sistema.
<BLOCKQUOTE><CODE>
<PRE>
mh      comandos para el sistema de manejo de correo M H 
X11     Enlace simb&oacute;lico hacia /usr/X11R6/bin
</PRE>
</CODE></BLOCKQUOTE>
<P>Debido a que los interpretadores de scripts de los shell (invocados con #!
&lt;ruta&gt; en la primera linea del script de shell) no pueden depender de
una ruta, es ventajoso el estandarizar la localizaci&oacute;n de ellos.  La shell
Bourne y C estan fijos en /bin, pero Perl, Python, Tlc se encuentran en
muchos lugares diferentes /usr/bin/perl, /usr/bin/python y /usr/bin/tcl
deben referenciar a los int&eacute;rpretes de shell perl, python y tcl
respectivamente. &Eacute;stos pueden ser enlaces simb&oacute;licos a la localizaci&oacute;n
f&iacute;sica de los int&eacute;rpretes de shell. 
<P>
<P>
<H2>6.3 /usr/dict:  Listas de palabras </H2>

<P>Archivos recomendados en /usr/dict <BR>
<HR>
<PRE>
words
</PRE>
<HR>
<P>Tradicionalmente este directorio contiene s&oacute;lo el archivo words de palabras
inglesas, el cual es utilizado por look(1) y varios programas de ortograf&iacute;a,
words puede utilizar ortograf&iacute;a americana o brit&aacute;nica.  Los sites que
requieran ambos, pueden enlazar words a /usr/dict/american-english &oacute;
/usr/dict/british-english.
<P>
<P> Las listas de palabras para otros lenguajes se pueden a&ntilde;adir usando el
nombre en ingl&eacute;s para ese lenguaje, por ejemplo, /usr/dict/french,
/usr/dict/danish, etc.  &Eacute;stos deben, si es posible, utilizar un juegos de
caracteres ISO 8859 que sea apropiado para el lenguaje en cuesti&oacute;n, si es
posible el juego de caracteres ISO 8859-1 (Latin1) debe ser utilizado (esto
es a veces imposible)
<P>
<P> Cualquier otra lista de palabras, tal como el directorio web2, debe ser
incluido aqu&iacute;, si est&aacute; presente.
<P>
<P> Las razones tras tener s&oacute;lo las listas de palabras aqu&iacute; es que ellas son
los &uacute;nicos archivos comunes a todos los verificadores de ortogaf&iacute;a. 
<P>
<P>
<H2>6.4 /usr/etc:  Configuraci&oacute;n del sistema (todo el site)</H2>

<P> Almacenar la configuraci&oacute;n en /usr/etc del software que se encuentra en
/usr/bin y /usr/sbin es un problema.  Hace que el montar /usr s&oacute;lo-lectura
de un CDROM o a trav&eacute;s de NFS sea dif&iacute;cil en el mejor de los casos.
<P>
<P> Una posible soluci&oacute;n que se consider&oacute; fue eliminar completamente
/usr/etc y especificar que todas las configuraciones se almacenen en /etc. 
Un problema con esta aproximaci&oacute;n es que no anticipa propiamente la
posibilidad de que muchos sites pueden querer tener algunos archivos de
configuracion que no sean locales de m&aacute;quina.
<P>
<P> Eventualmente se decidi&oacute; que /etc deber&aacute; ser el &uacute;nico directorio que sea
referenciado por los programas (esto es, todos deben buscar configuraciones
en /etc y no en /usr/etc).  Cualquier archivo de configuraci&oacute;n que necesite
ser para todo el site y que no es necesario antes de montar /usr (o en una
situaci&oacute;n de emergencia debe entonces estar localizado en /usr/etc. 
Entonces archivos espec&iacute;ficos (en /etc), en m&aacute;quinas espec&iacute;ficas pueden ser
o no ser enlaces simb&oacute;licos a los archivos de configuraci&oacute;n localizados en
/usr/etc. &Eacute;sto tambi&eacute;n significa que /usr/etc es t&eacute;cnicamente un directorio
opcional en el sentido estricto, pero a&uacute;n as&iacute; recomendamos que todos los
sistemas <B>Linux</B> lo incorporen. <BR> No se recomienda que /usr/etc
contenga enlaces simb&oacute;licos que apunten a archivos en /etc. &Eacute;sto es
innecesario e interfiere con el control local en m&aacute;quinas que comparten un
directorio /usr. 
<P>
<P>
<H2>6.5 /usr/include:  Directorio para archivos include est&aacute;ndar.</H2>

<P> Aqu&iacute; es donde todos los archivos include de uso general del sistema para
programaci&oacute;n en lenguajes C y C++ deben ser localizados.
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/include    Archivos include
X11             Enlace simb&oacute;lico hacia /usr/X11R6/include/X11
arpa            Definiciones del protocolo definido por  ARPNET.
asm             Enlace simb&oacute;lico hacia /usr/scr/linux/include/asm-&lt;arch&gt;.
bsd             Archivos include de compatibilidad con BSD.
g++             Archivos include de GNU C++.
gnu             Archivos include GNU.
linux           Enlace simbolico a /usr/src/linux/include/linux.
net             Definiciones gen&eacute;ricas relacionadas con redes.
netax25         Definiciones espec&iacute;ficas a  +AX25 ( ARRL AX25).
netinet         Definiciones espec&iacute;ficas a  TCP/IP.
netipx          Definiciones espec&iacute;ficas a +IPX (Novel IPX/SPX).
protocols       Definiciones de protocolos ( Mayormente basadas en  INET)
readline        La librer&iacute;a readline GNU.
rpc             Definiciones RPC de Sun Microsystems.
rpcsvc          Definiciones de servicios RPC de Sun Microsystems.
sys             Archivos  include de generaci&oacute;n de sistemas.
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P> El subdirectorio arpa contiene definiciones de cabecera de protocolos
para los protocolos ARPANET, TCP/IP, definiciones para ftp, prototipos
telnet y material similar.
<P>
<P> El subdirectorio net contiene definiciones gen&eacute;ricas relacionadas con
redes, define la interface sistema-kernel, detalles de la familia de
protocolo, etc.
<P>
<P> El subdirectorio netinet contiene definiciones especificas de INET
(DARPA Internet, que tambien es conocida como TCP/IP )
<P>
<P> ARRL AX.25 es mejor conocido como packet radio. Los protocolos novell
IPX/SPX son parte de los servicios de archivos Novell Netware. 
<P>
<P>
<H2>6.6 /usr/lib:  Librer&iacute;as para programas y paquetes.</H2>

<P> usr/lib incluye librer&iacute;as objeto, binarios del programa compilador e
/informaci&oacute;n est&aacute;tica de varias clases, ambos, c&oacute;digos ejecutable ( por
/ejemplo los binarios internos de gcc estan localizados bajo
//usr/lib/gcc-lib ) y otros tipos de informacion.
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/lib/ - librerias para programci&oacute;n y paquetes:

X11             Enlace simb&oacute;lico a /usr/X11R6/lib/X11
emacs           Archivos de soporte est&aacute;ticos para el editor GNUEmacs.
games           Archivos de datos est&aacute;ticos para /usr/games.
groff           Librer&iacute;as / Directorios para GNU groff
gcc-lib         Archivos/ Directorios espec&iacute;ficos del sistema para gcc.
kbd             Tablas de traducci&oacute;n de teclado e informaci&oacute;n relacionada.
Mh              Librer&iacute;as para el sistema de manejo de correo MH:
news            Cnews/INN.
smail           Smail.
terminfo        Directorios para la base de datos terminfo.
texmf           TeX/MF ( y LaTeX ) librer&iacute;as de informaci&oacute;n.
uucp            Comandos de  UUCP.
zoneinfo        Configuraci&oacute;n e informaci&oacute;n de la zona horaria.
</PRE>
</CODE></BLOCKQUOTE>
<P>Hist&oacute;ricamente, /usr/lib ha incluido adem&aacute;s algunos comandos ejecutables
tales como sendmail y makewhatis. <BR> Dado que makewhatis no es
referenciado por otros programas, no hay problemas al moverlo a un
directorio binario. Dado que los usuarios tienen buena raz&oacute;n para usar
makewhatis, /usr/lib es donde pertenece. El binario catman que remplaza al
script makewhatis en muchos sistemas <B>Linux</B>, debe tambi&eacute;n estar en
usr/bin
<P>
<P> El binario sendmail es referenciado por muchos programas con su nombre
hist&oacute;rico /usr/lib/sendmail. &Eacute;ste debe ser un enlace simb&oacute;lico a la
localizaci&oacute;n est&aacute;ndar para los agentes de transferencia de correo con una
interfaz de l&iacute;nea de comando compatible con sendmail, /usr/bin/sendmail.
<P>
<P> En sistemas que utilizan smail deben localizar smail en /usr/sbin/smail
y /usr/bin/sendmail debe ser un enlace simbolico a smail. <BR> Este arreglo
tambi&eacute;n se conforma a la nueva locaci&oacute;n est&aacute;ndar sendmail definida en
Sendmail 8.6.x y BSD 4.4 <BR> Note que esta localizaci&oacute;n demanda que
/usr/sbin y /usr/sbin/sendmail deben ser ejecutables para usuarios normales.
<P>
<P> Cualquier paquete o programa que contenga o requiera informaci&oacute;n que no
necesite ser modificada debe almacenar tal informaci&oacute;n en /usr/lib ( &oacute;
/usr/local/lib, si est&aacute; instalado localmente ). Se recomienda la utilizacion
de un subdirectorio en /usr/lib para este prop&oacute;sito.
<P>
<P> La informaci&oacute;n de juegos almacenada en /usr/lib/games debe ser solamente
informaci&oacute;n est&aacute;tica. Cualquier archivo modificable . tal como archivos de
marcadores, registros de juego y similares, deben ser localizados en
var/lib. Si es necesario para compatibilidad de juegos con el viejo estilo
BSD, se puede usar un enlace simb&oacute;lico desde /usr/games/lib hacia
/usr/lib/games.
<P>
<P> Nota: ninguna informaci&oacute;n espec&iacute;fica de host para el sistema X window
debe almacenarse en /usr/lib/X11 ( que es realmente /usr/X11R6/lib/X11) .
Los archivos de configuraci&oacute;n espec&iacute;ficos de host tales como Xconfig &oacute;
XF86Config deben almacenarse en /etc/X11. &Eacute;ste debe incluir informaci&oacute;n de
configuraci&oacute;n como system.twmrc a&uacute;n si es s&oacute;lo un enlace simb&oacute;lico a un
archivo de configuraci&oacute;n m&aacute;s global ( tal vez en /usr/etc/X11 &oacute;
/usr/X11R6/lib/X11). 
<P>
<P>
<H2>6.7 /usr/local:  Jerarqu&iacute;a local</H2>

<P> La jerarqu&iacute;a /usr/local est&aacute; para ser utilizada por el administrador del
sistema cuando se instale el software localmente. Necesita estar a salvo de
ser sobreescrito cuando el software del sistema se actualiza. Puede ser
usado por programas y por informaci&oacute;n que son compartibles entre un grupo
de m&aacute;quinas, pero no se encuentran en /usr.
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/local      Jerarqu&iacute;a local.

bin             Binarios s&oacute;lo-locales
doc             Documentaci&oacute;n local
etc             Binarios de configuraci&oacute;n s&oacute;lo-local
games           Juegos instalados localmente
lib             Librer&iacute;s para /usr/local
info            P&aacute;ginas de info local
man             Jerarqu&iacute;as de p&aacute;ginas de manual para /usr/local
sbin            Administraci&oacute;n del sistema s&oacute;lo-local
scr             C&oacute;digo fuente local.
</PRE>
</CODE></BLOCKQUOTE>
<P>Este directorio debe estar vac&iacute;o al terminar de instalar <B>Linux</B> por
primera vez. No debe haber excepciones a la regla, excepto quiz&aacute; los
subdirectorios vac&iacute;os listados.
<P>
<P> El software instalado localmente debe estar localizado dentro de
/usr/local, en vez de /usr a menos que este siendo instalado para reemplazar
o actualizar el software en /usr.
<P>
<P> Note que el software localizado en / o en /usr puede ser sobreescrito
por actualizaciones del sistema (aunque recomendamos que las distribuciones
no sobreescriban informacion en /etc bajo estas circunstancias). Por esta
raz&oacute;n, el software local no se debe localizar fuera de /usr/local sin una
buena causa. 
<P>
<P>
<H2>6.8 /usr/man :  P&aacute;ginas del manual.</H2>

<P> Esta secci&oacute;n detalla la organizaci&oacute;n de las p&aacute;ginas del manual a trav&eacute;s
del sistema. Incluyendo /usr/man.
<P>
<P> Las p&aacute;ginas del manual est&aacute;n almacenadas
&lt;mandir&gt;/&lt;locale&gt;/man [1-9]. M&aacute;s delante se d&aacute; una explicaci&oacute;n
de &lt;mandir&gt; y &lt;locale&gt;.
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
&lt;mandir&gt;/&lt;locale&gt; --- Una  jerarqu&iacute;a de p&aacute;ginas de manuales.

man1            Programas para usuarios.
man2            Llamadas al sistema.
man3            Subrutinas y funciones de librer&iacute;a
man4            Dispositivos.
man5            Formato de archivos
man6            Juegos.
man7            Miscel&aacute;neas.
man8            Administraci&oacute;n del Sistema.
man9            Funciones y variables internas del kernel.
</PRE>
</CODE></BLOCKQUOTE>
<P>El &lt;mandir&gt; primario del sistema es /usr/man contiene informaci&oacute;n del
manual para comandos e informaci&oacute;n bajo los sistemas de archivos / y /usr.
Obviamente no hay p&aacute;ginas de manual en / por que no se necesitan para
arrancar ni en emergencias.
<P>
<P> Se debe hacer provisi&oacute;n en la estructura de /usr/man para el soporte de
p&aacute;ginas del manual que est&eacute;n escritas en diferentes (o multiples idiomas ).
Estas provisiones deben tomar en cuenta el almencenamiento y referencia de
estas p&aacute;ginas del manual. Los factores relevantes incluyen el idioma (
incluyendo diferencias basadas en la geografia ) y el c&oacute;digo del conjunto de
caracteres.
<P>
<P> Esta nomenclatura de los subdirectorios de idiomas de /usr/man est&aacute;
basada en el apendice E del est&aacute;ndar POSIX 1003.1 que describe la cadena de
identificaci&oacute;n locale ---El metodo m&aacute;s aceptado para describir un ambiente
cultural. La cadena &lt;locale&gt;es: <BR>
&lt;idioma&gt;[&lt;_territorio&gt;][.&lt;conjunto_de_caracteres&gt;][,&lt;version&gt;]
<P>
<P> El campo &lt;idioma&gt; se tomar&aacute; del ISO639 (un c&oacute;digo para la
representacion de los nombres de los idiomas). Sera de dos caracteres de
ancho y especificado con min&uacute;sculas solamente.
<P>
<P> El campo &lt;_territorio&gt; sera el c&oacute;digo de dos letras de ISO3116
(una especificaci&oacute;n de la representaci&oacute;n de los nombres de los pa&iacute;ses), si
es posible. (mucha gente est&aacute; familiarizada con el c&oacute;digo de 2 letras
empleado en el c&oacute;digo de pa&iacute;s en las direcciones de e-mail.
<P>
<P> El campo &lt;conjunto_de_caracteres&gt; debe representar el est&aacute;ndar que
describe el c&oacute;digo de caracteres. Si el campo &lt;conjunto_de_caracteres&gt;
es s&oacute;lo una especificaci&oacute;n num&eacute;rica, el n&uacute;mero representa el n&uacute;mero del
est&aacute;ndar internacional que describe a ese conjunto de caracteres. Se
recomienda que este sea una representacion num&eacute;rica siempre que sea posible
(especialmente, est&aacute;ndares ISO), que no incluya s&iacute;mbolos de puntuaci&oacute;n y que
todas las letras sean min&uacute;sculas.
<P>
<P> Un p&aacute;rametro que especifique &lt;version&gt; del perfil puede ser
colocada despues del campo &lt;conjunto_de_caracteres &gt;, delimitado con
una coma. &Eacute;sto puede utilizarse para discriminar entre diferentes
necesidades culturales, por ejemplo un orden de diccionario en vez de un
orden de acomodo m&aacute;s orientado hacia el sistema. Este est&aacute;ndar recomienda no
usar el campo &lt;version&gt; a menos que sea necesario.
<P>
<P> En sistemas que usen s&oacute;lo un idioma y un c&oacute;digo de conjunto de
caracteres para todas las p&aacute;ginas del manual, pueden omitir la subcadena
&lt;locale&gt; y almacenar todas las p&aacute;ginas del manual en &lt;mandir&gt;.
Por ejemplo en sistemas que s&oacute;lo tienen p&aacute;ginas del manual en ingl&eacute;s
codificados en ASCII, pueden almacenar las p&aacute;ginas del manual (los
directorios man[1-9]) directamente en /usr/man (&eacute;stas son las circunstancias
y el arreglo tradicional, de hecho).
<P>
<P> En pa&iacute;ses para los cuales existe un c&oacute;digo de conjunto de caracteres
est&aacute;ndar, puede omitir el campo &lt;conjunto_de_caracteres&gt;, pero
recomendamos fuertemente que se incluya, especialmente para pa&iacute;ses con
varios est&aacute;ndares en competencia.
<P>
<P>Varios ejemplos: 
<P>
<BLOCKQUOTE><CODE>
<PRE>
Idioma          Territorio      Conjunto de caracteres  Directorio

Ingl&eacute;s           --------        ASCII                   /usr/man/en
Ingl&eacute;s           Reino Unido     ASCII                   /usr/man/en_GB
Ingl&eacute;s           Estados Unidos  ASCII                   /usr/man/en_US
Franc&eacute;s          Canad&aacute;   ISO8859-1               /usr/man/fr_CA
Franc&eacute;s          Francia         ISO8859-1               /usr/man/fr_FR
Alem&aacute;n           Alemania        ISO646-DE               /usr/man/de_DE646de
Alem&aacute;n           Alemania        ISO6937                 /usr/man/de_DE6937
Alem&aacute;n           Alemania        ISO8859-1               /usr/man/de_DE.88591
Alem&aacute;n           Suiza           ISO646-CH               /usr/man/de_CH.646ch
Japon&eacute;s          Jap&oacute;n            JIS                     /usr/man/ja_JP.jis
Japon&eacute;s          Jap&oacute;n            SJCS                    /usr/man/ja_JP.sjis
Japon&eacute;s          Jap&oacute;n    UJ (o EUC-J)            /usr/man/ja_JP.ujis
</PRE>
</CODE></BLOCKQUOTE>
<P>Las p&aacute;ginas del manual para los comandos e informaci&oacute;n que se encuentra bajo
/usr/local est&aacute;n almacenadas en /usr/local/man. las p&aacute;ginas del manual para
el sistema X Window est&aacute;n almacenadas en /usr/X11R6/man. Luego todas las
jerarqu&iacute;as de p&aacute;ginas del manual en el sistema deben tener la misma
estructura que /usr/man. Los directorios vac&iacute;os pueden ser omitidos de la
jerarqu&iacute;a de p&aacute;ginas del manual. Por ejemplo si, /usr/local/man no tiene
p&aacute;ginas del manual en la secci&oacute;n 4 (dispositivos) entonces se puede omitir
/usr/local/man/man4. <BR> Las secciones de p&aacute;ginas cat (cat[1-9]) que
contiene p&aacute;ginas del manual formateadas, tambi&eacute;n se encuentran dentro de los
subdirectorios /&lt;mandir&gt;/&lt;locale&gt;, pero no son requeridas ni
deben ser distribuidas en el lugar de las fuentes nroff de las p&aacute;ginas del
manual. <BR> Las p&aacute;ginas del Manual del sistema de manejo de correo mh deben
tener el prefijo mh en todos los nombres de archivos de las p&aacute;ginas. <BR>
Las p&aacute;ginas del sistema X Window deben tener el prefijo x en todos los
nombres de los archivos de las p&aacute;ginas. <BR> La pr&aacute;ctica de colocar las
p&aacute;ginas del manual de diferentes idiomas, en los subdirectorios apropiados
de /usr/man tambi&eacute;n se aplica a las otras jerarqu&iacute;as de p&aacute;ginas del manual,
tales como /usr/local/man, y /usr/X11R6/man. <BR> (Esta porci&oacute;n de este
est&aacute;ndar tambien se aplica m&aacute;s delante en la estructura opcional de
/var/catman). <BR> 
<P>
<P>A continuaci&oacute;n una descripci&oacute;n de cada secci&oacute;n.
<P>
<H3>man1: Programas de usuario.</H3>

<P> Las p&aacute;ginas del manual que describen los comandos accesibles
p&uacute;blicamente se encuentran en esta secci&oacute;n. La mayor&iacute;a de la documentaci&oacute;n
de los programas que un usuario necesitar&aacute; se encuentra aqu&iacute;.
<P>
<P>
<H3>man2: Llamadas al sistema.</H3>

<P> Esta secci&oacute;n describe todas las llamadas al sistema (requisiciones hacia
el kernel de <B>Linux</B> para realizar ciertas operaciones).
<P>
<P>
<H3>man3: Subrutinas y funciones de librer&iacute;a.</H3>

<P> La secci&oacute;n 3 describe programas rutinas de librer&iacute;a que no son llamdas
directas al servicios del kernel. Esta secci&oacute;n y la 2 son de inter&eacute;s casi
solamente para programadores.
<P>
<P>
<H3>man4: Archivos especiales.</H3>

<P> Esta secci&oacute;n describe los archivos especiales, funciones relacionadas
con los manejadores y el soporte para la red que est&eacute;n disponibles en el
sistema. T&iacute;picamente, esto incluye los archivos de dispositivo que se
encuentran en /dev y la interfaz del kernel para el soporte de protocolos de
red.
<P>
<P>
<H3>man5: Formatos de archivos.</H3>

<P> Aqu&iacute; se encuentran los formatos para muchos de los archivos cuyo formato
no sea intuitivo. &Eacute;sto incluye varios archivos include, archivos de salida
de programas, y archivos de sistema.
<P>
<P>
<H3>man6: Juegos.(Binarios Educativos)</H3>

<P> Esta secci&oacute;n documenta los juegos,demos y programas triviales. Muchas
personas tienen una opini&oacute;n muy diferente de que tan escencial es esta
secci&oacute;n.
<P>
<P>
<H3>man7: Miscel&aacute;neos</H3>

<P> Las p&aacute;ginas del manual que son dif&iacute;ciles de clasificar se designan como
pertenecientes a la secci&oacute;n 7. Las de troff y otros macro paquetes de
procesamiento de texto se encuentran aqu&iacute;.
<P>
<P>
<H3>man8: Administraci&oacute;n del Sistema</H3>

<P> Aqu&iacute; se documentan los programas utilizados por los administradores de
sistemas para la operaci&oacute;n y mantenimiento. Algunos de estos programas son
ocasionalmente &uacute;tiles para usuarios normales.
<P>
<P>
<H3>man9: Funciones y variables internas del kernel</H3>

<P>&Eacute;ste es utilizado para documentar el c&oacute;digo fuente del kernel en los
Sistemas <B>Linux</B>.
<P>
<P>
<H2>6.9 /usr/sbin: Binarios de sistema est&aacute;ndar no-esenciales.</H2>

<P> Este directorio contiene cualesquier binario no-esencial utilizando
exclusivamente por el administrador del sistema. <BR> Los programas de
administraci&oacute;n del sistema que sean requeridos para la reparaci&oacute;n del
sistema, recuperaci&oacute;n del sistema, montaje de /usr u otras funciones
esenciales deben localizarse en /sbin en vez de aqu&iacute;. <BR> T&iacute;picamente
/usr/sbin contiene los deamons de red, cualquier herramienta de
administraci&oacute;n no-escencial y binarios para programas servidores
no-cr&iacute;ticos. &Eacute;sto incluye los deamons de internet que son llamados por inted
(llamados in.*) tales como in.telnetd y in.fingerd y los deamons basados en
rpc manejados por portmap (llamados rcp.*) tales como rcp.infsd y
rcp.mountd. <BR> Estos programas servidores son utilizados cuando se entra
en un estado que el System V conoce como &quot;run level 2&quot; (estado
multi-usuario) y el &quot;run level 3&quot; (estado en-red) o el estado que
el BSD conoce como &quot;modo multi-usuario&quot;. En este punto se hacen
disponibles los servicios para los usuarios (p. ej. soporte de impresi&oacute;n) y
hacia otras m&aacute;quinas (p. ej. exportar NFS).
<P>
<P> Los programas administrativos instalados localmente deben estar
localizados en : /usr/local/sbin. 
<P>
<P>
<H2>6.10 /usr/share : Informaci&oacute;n Independiente de Arquitectura.</H2>

<P> Cualquier especificaci&oacute;n para /usr/share se incluir&aacute; en un documento
suplementario al <B>FSSTND</B>. Note que es la opini&oacute;n en consenso del
<B>FSSTND</B> que /usr/share no es necesario en la mayor&iacute;a de los sistemas
<B>Linux</B>. En este momento, si nos confinamos a proporcionar una definici&oacute;n
extensiva de este directorio, ser&iacute;a una mala idea. Por favor refi&eacute;rase a la
secci&oacute;n 6 para una discusi&oacute;n m&aacute;s de /usr/share.
<P>
<P>
<H2>6.11 /usr/src : C&oacute;digo fuente.</H2>

<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/src --- C&oacute;digo fuente
        linux            C&oacute;digo fuente para el kernel de Linux.
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P> Cualquier c&oacute;digo fuente no-local debe localizarse en este directorio. El
&uacute;nico c&oacute;digo fuente que siempre debe localizarse en un lugar espec&iacute;fico es
el c&oacute;digo del kernel (cuando exista o est&eacute; enlazado como parte de una
estructura en /usr/include). Se pueden usar subdirectorios si se desea.<BR>
El c&oacute;digo fuente para el kernel debe siempre estar en su lugar o al menos
los archivos include del c&oacute;digo del kernel. Esos archivos est&aacute;n localizados
en estos directorios.
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        /usr/src/linux/include/asm-&lt;arch&gt;
        /usr/src/linux/include/linux
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P> usr/include debe contener enlaces a estos directorios, llamados asm y
/<B>Linux</B>, dados que son necesitados por el compilador de C, al menos
/estos archivos include deben siempre ser distribuidos en las instalaciones
/que incluye un compilador C. Deben ser distribuidos en el directorio
//usr/src/linux de forma que no existan problemas cuando los administradores
/del sistema actualicen su versi&oacute;n del kernel por primera vez. <BR>
/usr/src/linux puede tambi&eacute;n ser un enlace simb&oacute;lico a un &aacute;rbol de c&oacute;digo
/fuente del kernel.
<P>
<P>
<H2><A NAME="sec5"></A> <A NAME="s7">7. La Jerarqu&iacute;a /var </A></H2>

<P>
<BLOCKQUOTE><CODE>
<PRE>
/var    Informaci&oacute;n variable

        adm             Info administrativa del sistema (obsoleto). Enlace simb&oacute;lico hacia /var/log
        catman          P&aacute;ginas del manual formateadas localmente
        lib             Informaci&oacute;n del estado de aplicaciones
        local           Informaci&oacute;n variable del software de /usr/local
        lock            Archivos de bloqueo
        log             Archivos de bit&aacute;cora
        named           Archivos DNS, s&oacute;lo red
        nis             Archivos base de datos NIS
        preserve        Archivos almacenados despu&eacute;s de una falla de ex &oacute; vi 
        run             Archivos relevantes a procesos ejecut&aacute;ndose
        spool           Directorios de trabajos en fila para realizarse despu&eacute;s
        tmp             Archivos temporales, utilizado para mantener /tmp peque&ntilde;o
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>
<P> var contiene archivos con informaci&oacute;n variable. &Eacute;sto incluye archivos y
/directorios en fila de ejecuci&oacute;n, informaci&oacute;n de bit&aacute;cora administrativa y
/archivos temporales y transitorios. <BR>
Algunas porciones de /var son no-compartibles entre diferentes sistemas. Por
ejemplo, /var/log, /var/lock y /var/run. Otras porciones son compartibles,
notablemente /var/spool/mail y /var/spool/news.
<P>
<P> var se especifica aqu&iacute; para hacer posible el montar /usr s&oacute;lo-lectura.
/Todo aquello que alguna vez fu&eacute; en /usr que es escrito durante la operaci&oacute;n
/normal del sistema (pero no durante la instalaci&oacute;n y el mantenimiento del
/software) debe ir en /var.
<P>
<P> Si /var no puede ser una participaci&oacute;n separada, es preferible mover
/var fuera de la participaci&oacute;n ra&iacute;z pero dentro de la partici&oacute;n /usr (esto
se hace algunas veces para reducir el tama&ntilde;o de la partici&oacute;n ra&iacute;z o cuando
hay poco espacio en la partici&oacute;n ra&iacute;z). Como sea, /var no debe ser enlazada
a /usr, porque hace que la separaci&oacute;n entre /usr y /var sea m&aacute;s dif&iacute;cil y
seguramente crear&aacute; un conflicto de nombres, En vez enlace /var a / usr/var.
<P>
<P>
<H2>7.1 /var/adm : Bit&aacute;cora del sistema y archivos contables (obsoleto)</H2>

<P> Este directorio ha sido remplazado por /var/log y otros directorios.
Debe ser un enlace simb&oacute;lico a /var/log hasta que todos los programas ya no
se refieran m&aacute;s a alg&uacute;n archivo en /var/adm.
<P>
<P> utmp se ha movido a /var/run. Todos los archivos bit&aacute;coras se han movido
a /var/log incluyen en el archivo wtmp.
<P>
<P> El soporte de empaquetado de distribuciones se debe almacenar en
/var/lib/&lt;nombre&gt; .
<P>
<P> <B>Nota</B>: El enlace simb&oacute;lico /var/adm no debe ser necesario en la
mayor&iacute;a de los sistemas Linux-i386ELF dado que el cambio fu&eacute; introducido
antes que ELF fuera liberado al p&uacute;blico. 
<P>
<P>
<H2>7.2 /var/catman : P&aacute;ginas del Manual Formateadas localmente (opcional)</H2>

<P> Este directorio proporcionara una localizaci&oacute;n est&aacute;ndar para los sites
que proporcionan una partici&oacute;n /usr s&oacute;lo-lectura, pero que desean permitir
el almacenamiento temporal de p&aacute;ginas del manual formateados localmente. Los
sites que montan /usr como escribible (p. pj. instalaciones mono-usuarios)
pueden escoger no usar /var/catman y escribir las p&aacute;ginas del manual
formateadas dentro de los directorios cat[1-9] dentro de /usr directamente.
Recomendamos que la mayor&iacute;a de los sites utilicen una de las siguientes
opciones en su lugar.
<P>
<P> Preformate&eacute; todas las p&aacute;ginas del manual dentro de /usr con el programa
(catman). <BR>: No se permita el almacenamiento temporal de las p&aacute;ginas
formateadas del manual y requiera que se ejecute nroff cada vez que se
necesite una p&aacute;gina. <BR> Se permita el almacenamiento temporal local de las
p&aacute;ginas del manual en /var/catman.
<P>
<P> La estructura de /var/catman necesita reflejar ambos, el hecho de la
existencia de m&uacute;ltiples jerarqu&iacute;as de p&aacute;gina del manual y la posibilidad del
uso de m&uacute;ltiples idiomas.
<P>
<P> Dada una p&aacute;gina del manual sin formatear que normalmente aparece en
/usr/&lt;ruta1&gt;/man/man[1-9], la versi&oacute;n formateada almacenada temporal
debe ir en /var/catman/&lt;ruta2&gt;/cat[1-9], donde &lt;ruta2&gt; es
&lt;ruta1&gt;. Los componentes &lt;ruta2&gt; y &lt;ruta1&gt; est&aacute;n ausentes
en el caso de /usr/man y /var/catman. 
<P>
<P>Por ejemplo, /usr/man/man1/ls.1 se formatea en /var/catman/cat1/ls.1 y
/usr/X11R6/man/&lt;locale&gt;/man3/XtClass.3x lo hace en
/var/catman/X11R6/&lt;locale&gt;/cat3/XtClass.3x . 
<P>
<P>Las p&aacute;ginas del manual escritas en /var/catman/cat[1-9] pueden
eventualmente, transferirse a /usr/&lt;ruta&gt;/cat[1-9] &oacute; expirarse. De
igual forma las p&aacute;ginas del manual formateadas dentro de
/usr/&lt;ruta&gt;/cat[1-9] pueden expirarse si no son accesadas en un
periodo de tiempo. 
<P>
<P>Si vienen p&aacute;ginas del manual preformateadas con un sistema <B>Linux</B> en un
medio s&oacute;lo-lectura. (p. ej. un COROM), deben estar instaladas en
/usr/&lt;ruta&gt;/cat[1-9]. /var/catman est&aacute; reservado como un lugar de
almacenamiento temporal para p&aacute;ginas de manual formateados. 
<P>
<P>
<H2>7.3 /var/lib : Informaci&oacute;n de Estado de Aplicaciones.</H2>

<P>
<BLOCKQUOTE><CODE>
<PRE>
/var/lib.- Informaci&oacute;n de Estado de Aplicaciones

        emacs           Directorio del estado de Emacs
        games           Informaci&oacute;n variable de juegos(archivos de marcadores)
        news            Archivos variables de Cnews/INN
        texmf           Informaci&oacute;n variable asociada con TeX
        xdm             Archivos de autenticaci&oacute;n y bit&aacute;coras de error del manejador de despliegues X
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P> var/lib/&lt;nombre&gt; es el lugar apropiado para el soporte de
/empaquetamiento de todas las distribuciones. Diferentes distribuciones de
/<B>Linux</B> pueden utilizar diferentes nombres por supuesto.
<P>
<P>
<H3>/var/lib/emacs</H3>

<P> El directorio del estado <B>GNU Emacs</B>, el lugar donde los archivos de
informaci&oacute;n independiente de la arquitectura, que <B>Emacs</B> modifica cuando
se ejecuta, debe ser /var/lib. En el presente, <B>Emacs</B> s&oacute;lo localiza su
directorio de archivos de bloqueo bajo el directorio de estado (en
&lt;direstado&gt;/emacs/lock), pero puede hacer uso m&aacute;s extenso del mismo en
el futuro. Notablemente, s&oacute;lo se requiere la adici&oacute;n de una opci&oacute;n sencilla
en el programa configure de <B>Emacs</B> para hacer este cambio (antes de
compilar). 
<P>
<P>
<H3>/var/lib/games</H3>

<P> As&iacute; como los subdirectorios antes citados, cualquier informaci&oacute;n
variable relacionada con los juegos que se encuentran en /usr/games, deben
estar aqu&iacute;. /var/lib/games debe incluir la informaci&oacute;n variable que
previamente se encontraba en /usr/lib/games; La informaci&oacute;n est&aacute;tica, tal
como textos de ayuda, descripciones del nivel y dem&aacute;s, debe permanecer en
/usr/lib/games. 
<P>
<P>
<H3>/var/lib/news</H3>

<P> var/lib/news se debe usar parea almacenar toda la informaci&oacute;n variable
/asociada con los servidores de news tales como Cnews y INN, inclusive el
/archivo hist&oacute;rico, el archivo activo y dem&aacute;s.
<P>
<P>
<H3>/var/lib/texmf</H3>

<P> var/lib/texmf se debe usar para almacenar la informaci&oacute;n variable
/asociada con <B>TeX</B>. Particularmente, en /var/lib/texmf/fonts se
/almacenar&aacute;n todas las fuentes tipogr&aacute;ficas que son generadas
/autom&aacute;ticamente por MakeTeXPK.
<P>
<P> Debe haber un enlace desde /usr/lib/texmf/fonts/tmp hacia
/usr/lib/texmf/fonts. Este enlace permite a los usuarios hacer uso de una
sola ruta /usr/lib/texmf/fonts/tfm cuando le hacen cambios a su variable de
entorno TEXFONTS (&eacute;sta es la ruta por defecto en las herramientas <B>TeX</B>
de Karl Berry distribuidas desde ftp.cs.umb.edu:pub/tex [La raz&oacute;n de
mencionarlos aqu&iacute; es que son el est&aacute;ndar de facto en las instalaciones
<B>UNIX</B>, estas herramientas son ampliamente usadas entre la comunidad
<B>Linux</B>]. Si se utiliza otra distribuci&oacute;n de <B>TeX</B>, se debe hacer un
enlace desde el directorio de fuentes apropiado hacia /usr/lib/texmf/fonts).
<P>
<P> El MakeTeXPK que se distribuye con dvipsk colocar&aacute; los archivos .pk en
fonts/pk/&lt;dispositivo&gt;/&lt;nombre_de_la_fuente&gt;, (p.ej.
fonts/pk/Canon_CX/cmr10.300pk). Los archivos .pk se pueden purgar
peri&oacute;dicamente del &aacute;rbol /var/lib/texmf o se puede mover dentro del &aacute;rbol
/usr/lib/texmf. Si se usan generadores autom&aacute;ticos de .mf &oacute; .tfm, &eacute;stos
deben poner su informaci&oacute;n en los subdirectorios mf &oacute; tfm de
/var/lib/texmf/fonts.
<P>
<P>
<H3>/var/lib/xdm</H3>

<P>/var/lib/xdm contiene la informaci&oacute;n variable de xdm que consiste en los
/archivos xdm-errors y cualquier archivo de autoridad xdm. Los binarios de
/xdm tales como chooser deben a&uacute;n estar localizados en la localidad
/hist&oacute;rica en /usr/X11R6/lib/X11/xdm. El archivo xdm-pid debe estar en
//var/lib/xdm a pesar de existir /var/run. Los archivos restantes deben
/estar en /etc/X11/xdm.
<P>
<P>
<H2>7.4 /var/local : Informaci&oacute;n variable del software que est&aacute; en /usr/local</H2>

<P> Este directorio contiene toda la informaci&oacute;n variable que est&eacute;
relacionada con el software que se encuentra en /usr/local. Naturalmente la
implementaci&oacute;n de este subdirectorio se deja a el administrador del sistema
. Como sea la informaci&oacute;n que se puede categotizar en otro lugar del
directorio /var, no se debe colocar en /var/local. Por ejemplo, todos los
archivos de bloqueo a&uacute;n ir&aacute;n en /var/lock. 
<P>
<P>
<H2>7.5 /var/lock : Archivos de Bloqueo</H2>

<P> Los archivos de bloqueo deben almacenarse dentro de una estructura del
directorio de /var/lock.
<P>
<P> Para preservar la habilidad de montar /usr s&oacute;lo-lectura, no se deber&aacute;
colocar los archivos de bloqueo en la partici&oacute;n /usr.
<P>
<P> Los archivos de bloqueo de dispositivo, tales como los archivos de
bloqueo de dispositivos serie que antes se encontraban en /usr/spool/lock &oacute;
en /usr/spool/uucp deben ahora almacenarse en /var/lock. la convenci&oacute;n para
la nomenclatura que debe utilizarse es LCK... seguido del nombre base del
dispositivo. Por ejemplo, para bloquear /dev/cua0 se deber&aacute; crear el archivo
LCK... cua0.
<P>
<P> El formato usado para los archivos de bloqueo de dispositivo en
<B>Linux</B> deber&aacute; ser el formato de archivos de bloqueo HDB UUCP. El formato
HDB es almacenar el PID (Identificador del proceso) como un n&uacute;mero decimal
en ASCII de 10 bytes, con un caracter de l&iacute;nea nueva.
<P>
<P> Por ejemplo, si el proceso 1230 retiene un archivo de bloqueo, contendr&aacute;
los siguientes once (11) caracteres: espacio, espacio, espacio, espacio,
espacio, espacio, uno, dos, tres, cero y nueva l&iacute;nea.
<P>
<P> Entonces cualquier cosa que desee usar /dev/cua0, puede leer el archivo
de bloqueo y actuar de acuerdo (Todos los archivos de bloqueo en /var/lock
deben ser le&iacute;bles por todos). 
<P>
<P>
<H2>7.6 /var/log : Archivos bit&aacute;cora y directorios</H2>

<P> Este directorio contiene archivos bit&aacute;cora miscel&aacute;neos. la mayor&iacute;a de
los archivos bit&aacute;cora se deben escribir en este directorio o subdirectorios
apropiados. 
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        lastlog         Registro del &uacute;ltimo acceso de cada usuario
        messages        Mensajes del sistema desde syslogd
        wtmp            Registro de todos los accesos y salidas
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P> Se puede requerir de un enlace simb&oacute;lico desde /var/log/utmp hacia
/var/run/utmp hasta que ning&uacute;n programa se refiera a /var/adm/utmp (/var/adm
es en s&iacute; mismo un enlace simb&oacute;lico transicional hacia /var/log).
<P>
<P>
<H2>7.7 /var/named : Archivos DNS</H2>

<P> Este directorio contiene todos los archivos de trabajo del servidor de
nombres Internet, named. <BR>: Recomendamos que /etc/named.boot sea un enlace
simb&oacute;lico hacia /var/named/named.boot, dado que /etc/named.boot es el
archivo de arranque por defecto, si no se dan argumentos a named. 
<P>
<P>
<H2>7.8 /var/nis : Archivos de bases de datos del servicio de informaci&oacute;n dered (NIS)</H2>

<P> El sistema de informaci&oacute;n de red (NIS) era anteriormente conocido como
las P&aacute;ginas Amarillas Sun (YP). La funcionalidad y localizaci&oacute;n de
directorios de ambos es el mismo pero el nombre (Yellow Pages) es una marca
registrada en el Reino Unido, pertenece a Bristish Telecommunications PLC. y
no puede ser usada sin permiso.
<P>
<P>
<P>
<H2>7.9 /var/preserve:Archivos guardados despu&eacute;s de una colisi&oacute;n o unaterminaci&oacute;n inesperada de ex &oacute; vi</H2>

<P> Este directorio contiene los archivos que son almacenados ante cualquier
terminaci&oacute;n no-esperada de ex, vi, &oacute; de alguno de sus clones.
<P>
<P>
<H2>7.10 /var/run : Archivos variables de tiempo de ejecuci&oacute;n</H2>

<P> Este directorio contiene archivos con informaci&oacute;n del sistema que lo
describen desde que arranc&oacute;. Generalmente los archivos en este directorio se
deben limpiar (remover o truncar, seg&uacute;n corresponda) al comenzar el proceso
de arranque.
<P>
<P> Los archivos identificados de proceso (PID), que estaban originalmente
/etc, se deben colocar en /var/run. La convenci&oacute;n de nomenclatura de
archivos PID es &lt;nombre-programa&gt;.pid, por ejemplo el archivo PID de
crond se llama /var/run/crond.pid.
<P>
<P> El formato interno de los archivos PID permanecen sin cambio. El archivo
debe de consistir del indicador del proceso en decimales codificado como
ASCII, seguido por un caracter nueva l&iacute;nea Por ejemplo, si crond fue el
proceso n&uacute;mero 25, /var/run/cond.pid contendr&aacute; 3 caracteres, dos cinco y
nueva l&iacute;nea.
<P>
<P> Los programas que l&eacute;an archivos PID deben ser flexibles en lo que
aceptan, p. ej. deben ignorar los espacios extras, ceros a la izquierda,
ausencia del caracter nueva l&iacute;nea o l&iacute;neas adicionales en el archivo PID.
Los programas que crean archivos PID deben utilizar la sencilla
especificaci&oacute;n dada en el anterior p&aacute;rrafo.
<P>
<P> El archivo utmp, que almacena informaci&oacute;n acerca de qui&eacute;n est&aacute;
actualmente utilizando el sistema, se localiza en este subdirectorio.
<P>
<P> Los programas que mantengan sockets transitorios de dominio <B>UNIX</B>,
deben colocarlos en este directorio.
<P>
<P>
<H2>7.11 /var/spool : Directorios de fila de trabajos para procesamiento posterior</H2>

<P> var/spool es tradicionalmente utilizado para la informaci&oacute;n local de
/m&aacute;quina que es enviada para procesarse despu&eacute;s, hacia o desde subsistemas
/<B>UNIX</B>. Por ejemplo, trabajos de impresi&oacute;n que son almacenados aqu&iacute; para
/entrega posterior al daemon de la impresora, el correo que sale es
/almacenado aqu&iacute; para entrega a sistemas remotos y los archivos UUCP son
/almacenados aqu&iacute; para transmisi&oacute;n a los sistemas UUCP vecinos. El correo
/que entra y las noticias son almacenados aqu&iacute; para entregarse a los
/usuarios y los trabajos de at y cron son almacenados aqu&iacute; para ejecuci&oacute;n
/retardada por el daemon cron.
<P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/var/spool
        at              Trabajos de at
        cron            Trabajos de cron
        lpd             Directorio de impresora * 
        mail            Archivos caja-postal(buz&oacute;n) de los usuarios
        mqueue          Fila del correo saliente
        news            Directorio de noticias *
        rwhod           Archivos rwhod
        smail           Directorio de smail *
        uucp            Directorio de UUCP
</PRE>
</CODE></BLOCKQUOTE>
<P><B>Nota</B>: * Significa  fila de trabajos para proceso posterior.
<P>
<P> Los archivos de bloqueo UUCP deben localizarse en /var/lock. V&eacute;a la
secci&oacute;n acerca de /var/lock. 
<P>
<P>
<H3>/var/spool/lpd</H3>

<P>
<BLOCKQUOTE><CODE>
<PRE>
/var/spool/lpd --- Directorio de fila  de trabajos para proceso posterior o impresi&oacute;n
        &lt;impresora&gt;               Directorio que tiene la fila espec&iacute;fica de esta impresora
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P> El archivo de bloqueo para lpd, lpd.lock debe estar localizado en
/var/spool/lpd. El archivo de bloqueo de cada impresora debe localizarse en
el directorio &lt;impresora&gt; de la impresora especifica y se debe llamar
lock. 
<P>
<P>
<H2>7.12 /var/tmp : Archivos temporales, utilizando para mantener /tmp peque&ntilde;o.</H2>

<P> Los archivos que est&aacute;n en /var/tmp est&aacute;n almacenados por una duraci&oacute;n no
especifica. (Recuerde que los directorios temporales del sistema no
garantizan mantener la informaci&oacute;n por ning&uacute;n periodo particular).
<P>
<P> La informaci&oacute;n almacenada en /var/tmp t&iacute;picamente se limpia en una
&quot;forma definida localmente&quot; pero usualmente menos frecuentemente
que /tmp. Se puede encontrar informaci&oacute;n sobre directorios temporales en la
selecci&oacute;n dedicada a /tmp (arriba).
<P>
<P> Debe existir un enlace simb&oacute;lico desde /usr/tmp hacia var/tmp por
razones de compatibilidad. 
<P>
<P>
<H2><A NAME="sec6"></A> <A NAME="s8">8. Razonamientos adicionales y asuntos sin resolver </A></H2>

<P> Esta secci&oacute;n discute varias &aacute;reas que pueden requerir mayor explicaci&oacute;n.
<P>
<P>
<H2>8.1 Qu&eacute; es esencial?</H2>

<P> La respuesta es: esencial para limpiar, crear, preparar, verificar,
encontrar y montar otros sistemas de archivos (posiblemente en m&aacute;quinas
remotas). Hay otras definiciones, pero &eacute;sta es una definici&oacute;n general que la
mayor&iacute;a de las personas al menos la incorporar&aacute; en la suya.
<P>
<P>
<H2>8.2 Red</H2>

<P> La red presenta un dilema interesante, algunas personas quieren separar
los binarios y de configuraci&oacute;n de la red de los que no lo son. Como sea,
estamos en desacuerdo. Sentimos que la red no es un &quot;paquete&quot;,
sino una parte integral de la mayor&iacute;a de la m&aacute;quinas <B>UNIX</B> (y
similares). Debido a lo anterior, la red no debe colocarse en un s&oacute;lo
directorio sino localizarse sistem&aacute;ticamente en los directorios apropiados.
<P>
<P> 
<H3>/bin :Cualquier cosa que alg&uacute;n usuario querr&aacute; utilizar y que estambi&eacute;n considerado vital. </H3>

<P>
<P>
<HR>
<PRE>
hostname, netstat, ping
</PRE>
<HR>
<P>
<H3>/sbin :Cualquier cosa que s&oacute;lo root necesita y se considere vital.</H3>

<P>
<HR>
<PRE>
arp, ifconfig, route
</PRE>
<HR>
<P>
<H3>/usr/bin : Alg&uacute;nos binarios que alg&uacute;n usuario querr&aacute; utilizar y queno son vitales. </H3>

<P>
<P>
<HR>
<PRE>
finger, rep, rlogin, telnet, etc.
</PRE>
<HR>
<P>
<H3>/usr/sbin : Alg&uacute;nos binarios s&oacute;lo para el administrador que no sonvitales. </H3>

<P>
<P>
<HR>
<PRE>
in.ftpd, inetd, lpd, portmap, etc.
</PRE>
<HR>
<P>
<P> Aunque puede parecer confuso al principio (y toma tiempo digerirlo),
tiene sentido. Si por alguna raz&oacute;n usted s&oacute;lo puede montar la partici&oacute;n
ra&iacute;z, y necesita accesar a la red para reparar su sistema, no se quiere que
los archivos est&eacute;n en /usr/etc (como est&aacute;n algunas veces). Los archivos que
se necesitan para montar /usr en las situaciones normales (y de emergencia)
est&aacute;n colocados dentro del sub-&aacute;rbol ra&iacute;z, y cualesquier otros se colocan en
/usr, para mantener el tama&ntilde;o del sistema de archivos ra&iacute;z peque&ntilde;o. 
<P>
<P>Los archivos de configuraci&oacute;n para la red pertenecen a /etc.
<P>
<P>
<H2>8.3 Estructuras independientes de la arquitectura</H2>

<P> El directorio /usr/share t&iacute;picamente contiene archivos independientes de
la arquitectura, tales como p&aacute;ginas del manual, zona horaria, informaci&oacute;n de
terminfo, etc. En el momento presente no hay diferentes arquitecturas para
<B>Linux</B>, pero con el tiempo, veremos que <B>Linux</B> incluir&aacute; otras
arquitecturas y otros sistemas similares a <B>UNIX</B>. 
<P>
<P><B>Nota</B>: Ning&uacute;n programa nunca deber&aacute; hacer referencia a alguna cosa en
/usr/share. Por ejemplo, un programa de p&aacute;ginas del manual no debe nunca
buscar directamente /usr/share/man/man1/1s.1, sino que siempre se debe
referir a /usr/man/man1/1s.1. Cualquier cosa en /usr/share, ser&aacute;
&quot;apuntada&quot; a trav&eacute;s de uso de enlaces s&iacute;mbolos desde otras &aacute;reas
del sistema de archivos, tales como /usr/man, /usr/lib/&lt;algo&gt;, etc...
A&uacute;n se trabaja en las especificaciones de /usr/share.
<P>
<P>
<H2>8.4 Enlaces Simb&oacute;licos.</H2>

<P> Hay muchos usos para los enlaces simb&oacute;licos en cada sistemas de
archivos. Aunque un est&aacute;ndar como &eacute;ste no respalda el uso de enlaces
simb&oacute;licos en la implementaci&oacute;n por defecto (Los encontrados despu&eacute;s de
instalar <B>Linux</B>), se usan frecuentemente con buenos prop&oacute;sitos en
diferentes sistemas. El punto es que los enlaces simb&oacute;licos deben estar all&iacute;
para mantener todos los archivos y directorios donde cada quien los espera
encontrar.
<P>
<P> Est&aacute; preparado para aceptar que ciertos directorios, a&uacute;n aquellos
contenidos en el directorio ra&iacute;z, a&uacute;n sean enlaces simb&oacute;licos. Por ejemplo
en algunos sistemas /home no estar&aacute; en el ra&iacute;z, sino enlazado simb&oacute;licamente
a un directorio /var o alg&uacute;n otro lugar. /home podr&iacute;a tener tambi&eacute;n su
propia partici&oacute;n f&iacute;sica y desde luego, ser montado como tal.
<P>
<P> Similarmente, dado que /usr podr&iacute;a estar en un servidor de archivos
central montado v&iacute;a NFS, /usr/local se puede enlazar simb&oacute;licamente a
/var/local. Este cambio se puede justificar recordando la raz&oacute;n principal de
tener /var: separar directorios de archivos que var&iacute;an con el tiempo y entre
diferentes sistemas y m&aacute;quinas de aquellos que se pueden compartir y sean
s&oacute;lo-lectura.
<P>
<P> Algunos sistemas adem&aacute;s enlazar&aacute;n /tmp a /var/&lt;algo&gt; si la
partici&oacute;n ra&iacute;z se vuelve muy peque&ntilde;a (&oacute; es muy peque&ntilde;a). Hay m&aacute;s ejemplos de
&quot;buenos&quot; usos de enlaces simb&oacute;licos, pero todo el asunto se reduce
a dos cosas: Los paquetes deben ser capaces de encontrar las cosas donde lo
esperan (razonablemente) y los enlaces simb&oacute;licos se pueden utilizar para
resolver los problemas de muchos casos. Como sea, se pueden generar
problemas con el uso de demasiados enlaces simb&oacute;licos. este problema incluye
sobre-confianza en los enlaces simb&oacute;licos para resolver problemas, confusi&oacute;n
resultante del sobre-uso de enlaces simb&oacute;licos y las preferencias est&eacute;ticas
de diferentes personas. 
<P>
<P>
<H2>8.5 Binarios Compilados Est&aacute;ticamente.</H2>

<P> <B>Linux</B> se ejecuta corre actualmente en una gama de sistemas, algunos
con s&oacute;lo un usuario y disco peque&ntilde;o, otros como servidores en ambientes con
redes muy grandes, dada esta variedad, este est&aacute;ndar no impone regla sobre
qu&eacute; binarios est&aacute;n compilados est&aacute;ticamente o din&aacute;micamente, con las
siguientes excepciones. Ambos ln y sync, deben existir en /bin; cualquier
versi&oacute;n est&aacute;tica se puede colocar en /sbin o remplazar aquellas en /bin.
<P>
<P> Los grandes sistemas <B>Linux</B> pueden desear incluir otros binarios
est&aacute;ticos (sh, init, mkfs, fsch, tunefs, mount, umount, swapon, swopff,
getty, login y otros). Los desarrolladores y los administradores de
sistemas, son libres de enlazar din&aacute;mica o est&aacute;ticamente &eacute;stos y otros
binarios seg&uacute;n le convengan, siempre que la localizaci&oacute;n de los binarios no
cambie.
<P>
<P> En sistemas de red, (especialmente aquellos que no tienen unidades de
disco flexible), pueden querer compilar est&aacute;ticamente ifconfig, route,
hostname y otras herramientas de red. &Eacute;sto usualmente no es necesario.
<P>
<P>
<H2><A NAME="s9">9. La lista del correo del <B>FSSTND</B></A></H2>

<P> La lista del correo del <B>FSSTND</B> se encuentra en
&lt;Linux-fsstnd@ucsd.edu&gt;. Esta lista estaba originalmente localizada en
&lt;Linux-activists@niksula.hut.fi&gt; &quot;Mail Net&quot; como el canal
<B>FSSTND</B>. (Para subscribirse a la lista mande correo
&lt;listserv@ucsd.edu&gt; con el mensaje &quot;ADD Linux-fsstnd&quot;). <BR>
Gracias a Operaciones de Red en la Universidad de California en San Diego
quien nos permiti&oacute; utilizar su excelente servidor de listas de correo. <BR>
<P>
<P>
<H2><A NAME="s10">10. Reconocimientos:</A></H2>

<P>
<P>Se debe dar cr&eacute;dito por este texto a las activistas <B>FSSTND</B>,
desarrolladores, administradores de sistemas y usuarios cuyos comentarios
fueron esenciales a este est&aacute;ndar. Tambi&eacute;n deseo agradecer a cada
contribuyente que ayud&oacute; a escribir, compilar y componer &eacute;ste, un est&aacute;ndar de
consenso. 
<P>
<P>Deseo tambi&eacute;n dar real cr&eacute;dito a aquellos desarrolladores que han visto que
el dar a <B>Linux</B> un arreglo com&uacute;n del sistema de archivos es algo que
expandir&aacute; el desarrollo del sistema operativo <B>Linux</B>. Deseo tambi&eacute;n la
valent&iacute;a y perseverancia de aquellos desarrolladores de <B>Linux</B> quienes
comenzaron a seguir este est&aacute;ndar a&uacute;n antes de que fuera completado. 
<P>
<P>Los que contribuyeron originalmente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
Drew Eckhard            (US)    drew@colorado.edu
Brondon S. Allbery      (US)    bsa@kf8nh.wariat.org
Ian Jackson             (UK)    ijackson@cus.cam.ac.uk
Rik Faith               (US)    faith@cs.unc.edu
Iar Mc Cloghrie         (US)    ian@ucsd.edu
Stephen Harris          (UK)    sweh@spuddy.mew.co.uk
Daniel Quilan           (US)    Daniel.Quinlan@linux.org
Fred N. van Kemper      (US)    waltje@infomagic.com
Mike Sangrey            (US)    mike@sojurn.lns.pa.us
Jhon A. Martir          (US)    jmartin@csc.com
David H. Silber         (US)    dhs@glowworm.firefly.com
Chris Netcalf           (US)    metcalf@lcs.mit.edu
Theodore Ts&oacute;             (US)    tytso@athena.mit.edu
Ian Murdock             (US)    imurdock@debian.org
Stephen Tweedie         (UK)    sct@dcs.ed.ac.uk
David C. Niemi          (US)    niemid@clarck.net
</PRE>
</CODE></BLOCKQUOTE>

<BLOCKQUOTE><CODE>
<HR>
<PRE>
Estructura del sistema de archivos de Linux                     Abril 1996
</PRE>
<HR>
</CODE></BLOCKQUOTE>
</BODY>
</HTML>
