<HTML>
<HEAD>
<TITLE>EL C&Oacute;MO DEL UMSDOS: POR-QU&Eacute;-UMSDOS </TITLE>
</HEAD>
<BODY>
<A HREF="Umsdos-Como-7.html">Anterior</A>
<A HREF="Umsdos-Como-9.html">Siguiente</A>
<A HREF="Umsdos-Como.html#toc8">Indice</A>
<HR>
<H2><A NAME="porque"></A> <A NAME="s8">8. POR-QU&Eacute;-UMSDOS </A></H2>

<P>No basta con explicar c&oacute;mo funciona o se instala un sistema
con <CODE>umsdos</CODE>. La mayor&iacute;a de la gente busca algunos consejos
sobre si usar <CODE>umsdos</CODE> o no.</P>


<H2><A NAME="ss8.1">8.1 El objetivo de <CODE>umsdos</CODE></A></H2>

<P>El objetivo de <CODE>umsdos</CODE> era facilitar la instalaci&oacute;n de <EM>Linux</EM>.
Otro objetivo era facilitar su DESinstalaci&oacute;n. La idea detr&aacute;s
de esto era favorecer la difusi&oacute;n de <EM>Linux</EM>.
La instalaci&oacute;n de un nuevo sistema operativo es siempre problem&aacute;tica.
<EM>OS/2</EM> por ejemplo enguarrina tranquilamente el directorio
ra&iacute;z del disco <CODE>C:</CODE> con una ristra de nuevos directorios.
Si eres tan inteligente como yo, adem&aacute;s te borra los ficheros
<CODE>config.sys</CODE> y <CODE>autoexec.bat</CODE> :-(</P>
<P>El invento de la pseudorra&iacute;z de <CODE>umsdos</CODE> evita esta invasi&oacute;n
no deseada. <EM>Linux</EM> se puede DESinstalar sin ning&uacute;n
efecto lateral.</P>


<H2><A NAME="ss8.2">8.2 Qui&eacute;n lo necesita</A></H2>

<P>Si se tiene un disco duro peque&ntilde;o, <CODE>umsdos</CODE> permite compartir
el espacio del disco entre <EM>DOS</EM> y <EM>Linux</EM>. Un disco de
menos de 300M es en mi opini&oacute;n un disco peque&ntilde;o. Baso esta 
opini&oacute;n en el tama&ntilde;o de los diversos paquetes disponibles hoy
d&iacute;a. Un popular procesador de textos se puede cepillar unos
70 megaoctetos si se seleccionan todas las opciones.</P>
<P>Si se tiene un disco duro m&aacute;s grande, se debe tomar en consideraci&oacute;n
la opci&oacute;n de tener una partici&oacute;n dedicada para <EM>Linux</EM> donde
use el sistema de ficheros <EM>Ext2</EM>. <EM>Ext2</EM> utiliza un tama&ntilde;o
de bloque m&aacute;s peque&ntilde;o que <EM>DOS</EM> (exactamente 1K) por lo que
instalar muchos ficheros peque&ntilde;os utiliza menos espacio que en
una partici&oacute;n <CODE>umsdos</CODE>.</P>


<H2><A NAME="ss8.3">8.3 Acerca de la eficiencia</A></H2>

<P>Lo siguiente es aplicable a <CODE>umsdos</CODE> si se le compara con <EM>Ext2</EM>.</P>
<P>
<UL>
<LI>El manejo de directorios es m&aacute;s r&aacute;pido en <EM>Ext2</EM>. Esto
es debido a la sobrecarga de la estructura de doble
directorio de <CODE>umsdos</CODE>.</LI>
<LI>El acceso a los ficheros (lectura y escritura) es probablemente
m&aacute;s r&aacute;pido en <CODE>umsdos</CODE> que en <EM>Ext2</EM>. Esto es debido a
la simplicidad del sistema de ficheros con <EM>FAT</EM> usado
por el <EM>DOS</EM>.

T&eacute;ngase en cuenta que esta simplicidad tiene un coste:

<UL>
<LI>Un m&aacute;ximo de alrededor de 65.000 ficheros o bloques
por partici&oacute;n. Esto tambi&eacute;n significa que una
partici&oacute;n de 500 megaoctetos utiliza un tama&ntilde;o de
bloque de 16K. En otras palabras, un fichero
que contenga un s&oacute;lo octeto consumir&aacute; 16K de espacio
de disco.</LI>
<LI>Todo es controlado por una <CODE>FAT</CODE> ubicada al principio
del disco duro. Esto hace probablemente m&aacute;s fr&aacute;gil
al sistema de ficheros <EM>DOS</EM>.</LI>
<LI>No se toman precauciones para evitar la fragmentaci&oacute;n
de los ficheros. Un sistema <CODE>umsdos</CODE> se
usar&aacute; generalmente como estaci&oacute;n de trabajo de
un s&oacute;lo usuario. En ese caso tiene demasiada
importancia. Si se usa como sistema multiusuario,
los ficheros se esparcir&aacute;n por todo el disco,
reduciendo la eficiencia de los accesos a
los mismos.</LI>
</UL>
</LI>
<LI>Los enlaces simb&oacute;licos se guardan en ficheros normales. Si
se
intenta tener muchos, se encontrar&aacute; que <CODE>umsdos</CODE>
usa bastante m&aacute;s espacio de disco que <EM>Ext2</EM>.</LI>
</UL>
</P>


<HR>
<A HREF="Umsdos-Como-7.html">Anterior</A>
<A HREF="Umsdos-Como-9.html">Siguiente</A>
<A HREF="Umsdos-Como.html#toc8">Indice</A>
</BODY>
</HTML>
