<HTML>
<HEAD>
<TITLE>EL C&Oacute;MO DEL UMSDOS: ¿D&oacute;nde est&aacute; el UMSDOS?</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Umsdos-Como-2.html">Siguiente</A>
<A HREF="Umsdos-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. ¿D&oacute;nde est&aacute; el UMSDOS?</A></H2>



<H2><A NAME="ss1.1">1.1 Historia</A></H2>


<P>El proyecto <CODE>umsdos</CODE> comenz&oacute; en 1992 y se puso a disposici&oacute;n
de la red en enero del 1994 en forma de parche. Se incluy&oacute; en
la distribuci&oacute;n est&aacute;ndar del n&uacute;cleo (<EM>kernel</EM>) de linux
en Julio, comenzando con el n&uacute;cleo 1.1.36.</P>
<P><CODE>umsdos</CODE> fue pronto adoptado por la distribuci&oacute;n <EM>Slackware</EM>,
incluso antes de que fuera oficialmente incluido en el n&uacute;cleo.</P>
<P><CODE>umsdos</CODE> empez&oacute; a ser mejorado a partir del n&uacute;cleo 1.1.60.
Su rendimiento ha mejorado radicalmente, especialmente en lo que
se refiere a escritura. A partir del 1.1.70 (m&aacute;s o menos), vuelve
a ser estable.</P>
<P>Un error de consideraci&oacute;n fue corregido en <EM>Linux</EM> 1.2.2. El 
error en cuesti&oacute;n estaba dando la lata a los usuarios desde el 
principio (se cambiaba el nombre a algunos ficheros dando la
impresi&oacute;n de que hab&iacute;an desaparecido). N&oacute;tese
que la <EM>Slackware</EM> 2.2 a&uacute;n incluye la versi&oacute;n 1.2.1 del
n&uacute;cleo, luego contiene ese error.</P>


<H2><A NAME="ss1.2">1.2 Disponibilidad</A></H2>


<P>Est&aacute; disponible como parche para los n&uacute;cleos 1.0.x. Va incluido
en los n&uacute;cleos 1.2. Se puede compilar dentro del n&uacute;cleo o
cargarlo como m&oacute;dulo. Sin embargo, hay que tener en cuenta que
hoy por hoy, si se quiere usar <CODE>umsdos</CODE> en forma de m&oacute;dulo cargable
se debe tambi&eacute;n usar el sistema de ficheros Ms-DOS como 
m&oacute;dulo cargable. Esto es debido a una limitaci&oacute;n en el sistema
de m&oacute;dulos (algunos s&iacute;mbolos se exportan s&oacute;lo cuando los
controladores se instalan como m&oacute;dulos).</P>


<H2><A NAME="ss1.3">1.3 Distribuciones que lo soportan</A></H2>


<P>Por el momento creo que s&oacute;lo <EM>Slackware</EM> lo incluye. Seguramente
me equivoco, as&iacute; que por favor corregidme.</P>


<H2><A NAME="ss1.4">1.4 Lugar original donde encontrarlo</A></H2>


<P>El lugar original de <CODE>umsdos</CODE> es <CODE>
<A HREF="ftp://sunsite.unc.edu">sunsite.unc.edu</A></CODE>. Se debe
buscar en el directorio <BR> <CODE>/pub/Linux/system/Filesystems/umsdos</CODE>.</P>


<H2><A NAME="ss1.5">1.5 Documentaci&oacute;n T&eacute;cnica</A></H2>

<P>Hay un mont&oacute;n de documentaci&oacute;n sobre el funcionamiento interno de
<CODE>umsdos</CODE>. Se encuentra disponible tanto en formato <CODE>HTML</CODE>
como en formato texto en la misma ubicaci&oacute;n que las utilidades.</P>
<P>Por lo que yo s&eacute;, la versi&oacute;n <CODE>HTML</CODE> no est&aacute; disponible en 
ning&uacute;n servidor de Web. Se debe transferir, destarrar, y leer
localmente.</P>


<H2><A NAME="ss1.6">1.6 Qui&eacute;n lo escribi&oacute;</A></H2>


<P>Jacques Gelinas <CODE>
<A HREF="mailto:jacques@solucorp.qc.ca">jacques@solucorp.qc.ca</A></CODE></P>


<HR>
Anterior
<A HREF="Umsdos-Como-2.html">Siguiente</A>
<A HREF="Umsdos-Como.html#toc1">Indice</A>
</BODY>
</HTML>
