<HTML>
<HEAD>
<TITLE>EL C&Oacute;MO DEL UMSDOS: Distintos aspectos del funcionamiento de umsdos</TITLE>
</HEAD>
<BODY>
<A HREF="Umsdos-Como-2.html">Anterior</A>
<A HREF="Umsdos-Como-4.html">Siguiente</A>
<A HREF="Umsdos-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Distintos aspectos del funcionamiento de <CODE>umsdos</CODE></A></H2>

<H2><A NAME="ss3.1">3.1 Opciones de <CODE>mount</CODE></A></H2>


<P>Se pueden usar las mismas opciones que para el sistema de ficheros
Ms-DOS. La opci&oacute;n <CODE>conv=</CODE> es cuestionable en un sistema <CODE>umsdos</CODE>.
Yo sugiero evitarla. Las opciones que m&aacute;s probablemente se querr&aacute;
usar son</P>
<P>
<UL>
<LI><CODE>uid=</CODE></LI>
<LI><CODE>gid=</CODE></LI>
<LI><CODE>umask=</CODE></LI>
</UL>
</P>
<P>&Uacute;nicamente se debe recordar que <CODE>umsdos</CODE> trata los directorios
no promovidos de la misma forma que el sistema de ficheros
<EM>Ms-DOS</EM>. Las opciones de arriba se aplicar&aacute;n globalmente
a todos los directorios no promovidos. <EM>uid</EM> establece
el propietario por omisi&oacute;n, <EM>gid</EM> establece el grupo por
omisi&oacute;n, y <EM>umask</EM> establece los permisos por omisi&oacute;n.</P>


<H2><A NAME="ss3.2">3.2 C&oacute;mo establecer los valores por omisi&oacute;n para la ra&iacute;z</A></H2>


<P><CODE>umssetup</CODE> sirve para establecer en tiempo de ejecuci&oacute;n 
el propietario de la partici&oacute;n ra&iacute;z. Para otras particiones
<CODE>umsdos</CODE>, se pueden usar las opciones de mount o umssetup.
La manera recomendada para particiones no ra&iacute;z es poner la
opci&oacute;n apropiada en <CODE>/etc/fstab</CODE>. Aqu&iacute; va un ejemplo. Se
deber&iacute;a poner lo siguiente en <CODE>/etc/rc.d/rc.S</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
       /sbin/umssetup -u jack -g group -m 0755 /
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss3.3">3.3 Swap o no swap</A></H2>


<P>El uso de un fichero de intercambio (<EM>swap</EM>) es por lo general
m&aacute;s lento que una partici&oacute;n de intercambio. Sin embargo, es mucho
m&aacute;s flexible.  Un fichero de intercambio en una partici&oacute;n <CODE>umsdos</CODE>
se configura de la misma manera que para cualquier otro sistema
de ficheros de <EM>Linux</EM>. Por ejemplo, para poner 8 megaoctetos
de fichero de intercambio en el directorio ra&iacute;z:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
dd if=/dev/zero bs=1024k count=8 of=/swap
mkswap /swap 8192
sync
swapon /swap
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Una vez hecho esto, se puede poner lo siguiente en <CODE>/etc/fstab</CODE></P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/swapswapswapdefault   
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Y el fichero de intercambio se activar&aacute; en cada arranque del sistema
(hay por lo general un "<CODE>swapon -a</CODE>" en <CODE>/etc/rc.d/rc.S</CODE>).</P>


<HR>
<A HREF="Umsdos-Como-2.html">Anterior</A>
<A HREF="Umsdos-Como-4.html">Siguiente</A>
<A HREF="Umsdos-Como.html#toc3">Indice</A>
</BODY>
</HTML>
