<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Filtros de impresi&oacute;n con Ghostscript: La orden gs y sus opciones</TITLE>
 <LINK HREF="Filtros-Impresion-Como-4.html" REL=next>
 <LINK HREF="Filtros-Impresion-Como-2.html" REL=previous>
 <LINK HREF="Filtros-Impresion-Como.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="Filtros-Impresion-Como-4.html">Página siguiente</A>
<A HREF="Filtros-Impresion-Como-2.html">Página anterior</A>
<A HREF="Filtros-Impresion-Como.html#toc3">Índice general</A>
<HR>
<H2><A NAME="s3">3. La orden gs y sus opciones</A></H2>

<P>
<P>El programa Ghostcript se ejecuta a trav&eacute;s de la orden <EM>gs</EM> con
diferentes opciones
<P>
<H2><A NAME="ss3.1">3.1 Entradas a gs</A>
</H2>

<P>
<P>Adem&aacute;s de las opciones a considerar, <EM>gs</EM> act&uacute;a sobre un fichero de
entrada en formato PS:
<P>
<BLOCKQUOTE><CODE>
<PRE>
gs [opciones] fichero.ps
</PRE>
</CODE></BLOCKQUOTE>
<P>Donde <CODE>fichero.ps</CODE> es el fichero de entrada, pero uno tambi&eacute;n puede
conectar una entrada por tuber&iacute;a (en el sentido de «to pipe») en
Ghostscript utilizando el nombre de fichero especial «<CODE>-</CODE>», como por
ejemplo 
<P>
<BLOCKQUOTE><CODE>
<PRE>
{programa convertidor a formato PS} | gs [opciones] -
</PRE>
</CODE></BLOCKQUOTE>
<P>La presencia del argumento «<CODE>-</CODE>» al final de la l&iacute;nea de &oacute;rdenes indica
a Ghostscript que lea la entrada est&aacute;ndar (<EM>STDIN</EM>) desde un fichero o
tuber&iacute;a en lugar de desde el teclado. Es la opci&oacute;n de recibo cuando se dise&ntilde;a
un filtro de entrada para imprimir en PS.
<P>El fichero «<CODE>-</CODE>» presenta las siguientes caracter&iacute;sticas:
<P>
<UL>
<LI>Cuando Ghostscript termina de leer la tuber&iacute;a, deja de estar en modo
interactivo. Por ello, «<CODE>-</CODE>» es &uacute;til &uacute;nicamente como &uacute;ltimo argumento
de la l&iacute;nea de &oacute;rdenes.</LI>
<LI>«<CODE>-</CODE>» no puede usarse para conectar con una entrada PDF en
tuber&iacute;a.</LI>
</UL>
<P>
<H2><A NAME="ss3.2">3.2 Dispositivo de salida</A>
</H2>

<P>
<P>Ghostscript dispone de una serie de dispositivos controladores para
diversos tipos de impresora. Si invocamos <CODE>gs -h</CODE>, nos aparecer&aacute;
gran cantidad de informaci&oacute;n sobre nuestra versi&oacute;n instalada de
Ghostscript, entre la que encontraremos los dispositivos controladores.
He aqu&iacute; el listado correspondiente a dicha orden:
<P>
<BLOCKQUOTE><CODE>
<PRE>
GNU Ghostscript 5.10 (1998-12-17)
Copyright (C) 1997 Aladdin Enterprises, Menlo Park, CA.  All rights reserved.
Usage: gs [switches] [file1.ps file2.ps ...]
Most frequently used switches: (you can use # in place of =)
-dNOPAUSE           no pause after page   | -q       `quiet', fewer messages
-g&lt;width&gt;x&lt;height&gt;  page size in pixels   | -r&lt;res&gt; pixels/inch resolution
-sDEVICE=&lt;devname&gt;  select device         | -dBATCH  exit after last file
-sOutputFile=&lt;file&gt; select output file: - for stdout, |command for pipe,
                                         embed %d or %ld for page #
Input formats: PostScript PostScriptLevel1 PostScriptLevel2 PDF
Available devices:
   x11 x11alpha x11cmyk x11gray2 x11mono lvga256 vgalib t4693d2 t4693d4
   t4693d8 tek4696 appledmp ccr lp2563 lbp8 lips3 m8510 necp6 cp50 oce9050
   oki182 okiibm r4081 sj48 xes ln03 la50 la70 la75 la75plus sxlcrt deskjet
   djet500 laserjet ljetplus ljet2p ljet3 ljet4 declj250 paintjet pjetxl
   cdeskjet cdjcolor cdjmono cdj550 cdj500 djet500c dnj650c pj pjxl pjxl300
   hpdj uniprint epson eps9mid eps9high epsonc lq850 lp8000 st800 stcolor
   ap3250 ibmpro bj10e bj200 bjc600 bjc800 ljet3d lj4dith lj5mono lj5gray
   lj250 faxg3 faxg32d faxg4 dfaxhigh dfaxlow pcxmono pcxgray pcx16 pcx256
   pcx24b pcxcmyk pbm pbmraw pgm pgmraw pgnm pgnmraw pnm pnmraw ppm ppmraw
   pkm pkmraw tiffcrle tiffg3 tiffg32d tiffg4 tifflzw tiffpack cif bmpmono
   bmp16 bmp256 bmp16m tiff12nc tiff24nc psmono psgray bit bitrgb bitcmyk
   sgirgb pngmono pnggray png16 png256 png16m cgmmono cgm8 cgm24 jpeg
   jpeggray miff24 mgrmono mgrgray2 mgrgray4 mgrgray8 mgr4 mgr8 pdfwrite
   pswrite epswrite pxlmono pxlcolor nullpage
Search path:
   . : /usr/lib/ghostscript/common : /usr/lib/ghostscript/5.10 :
   /usr/lib/ghostscript/fonts
For more information, see /usr/doc/gs/use.txt.
Report bugs to ghost@aladdin.com; use the form in bug-form.txt.
</PRE>
</CODE></BLOCKQUOTE>
<P>As&iacute;, si disponemos de una impresora HP Deskjet 550C y vamos a imprimir el
<CODE>fichero.ps</CODE>, haremos:
<P>
<BLOCKQUOTE><CODE>
<PRE>
gs -sDEVICE=cdj550 fichero.ps
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss3.3">3.3 Resoluci&oacute;n de la impresi&oacute;n</A>
</H2>

<P>
<P>Algunas impresoras pueden imprimir a diferentes resoluciones (siendo la
menor la que se toma por defecto). Para seleccionar la resoluci&oacute;n
horizontal (<CODE>num1</CODE>) y vertical (<CODE>num2</CODE>) en pixels por pulgada, se
utiliza la opci&oacute;n
<P>
<BLOCKQUOTE><CODE>
<PRE>
-rnum1xnum2
-rnum es equivalente a -rnumxnum (cuando num1=num2=num)
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss3.4">3.4 Salida a un fichero</A>
</H2>

<P>
<P>Si seleccionamos una impresora como dispositivo de salida, Ghostscript
tambi&eacute;n permite controlar a d&oacute;nde env&iacute;a el dispositivo su salida. En el
sistema DOS, la salida se dirige normalmente a a la impresora (PRN); en
UNIX, generalmente se env&iacute;a a un fichero temporal para su impresi&oacute;n en
cola. Para dirigir la salida a un fichero (<CODE>fichero.out</CODE>), se utiliza la
opci&oacute;n 
<P>
<BLOCKQUOTE><CODE>
<PRE>
-sOutputFile=fichero.out
</PRE>
</CODE></BLOCKQUOTE>
<P>Pero en UNIX, tambi&eacute;n podemos usar esta opci&oacute;n para enviar la salida a
una conexi&oacute;n por tuber&iacute;a, por ejemplo al servidor de impresi&oacute;n, mediante
la orden <EM>lpr</EM>
<P>
<BLOCKQUOTE><CODE>
<PRE>
-sOutputFile=\|lpr
</PRE>
</CODE></BLOCKQUOTE>
<P>o enviarlo a la salida est&aacute;ndar (<CODE>sOutputFile=-</CODE>) para que, por
ejemplo, el demonio <EM>lpd</EM> tome esos datos de la salida est&aacute;ndar y
los entregue a la impresora. Esta es una de las opciones usadas en la
construcci&oacute;n de filtros de impresi&oacute;n.
<P>
<BLOCKQUOTE><CODE>
<PRE>
gs [opciones] -sOutputFile=- -q |...
</PRE>
</CODE></BLOCKQUOTE>
<P>En este caso es necesario emplear la opci&oacute;n <CODE>-q</CODE> (quiet) que evita que
el programa Ghostscript escriba mensajes en la salida est&aacute;ndar y se
mezclen con la corriente de salida del dispositivo de impresi&oacute;n.
<P>
<H2><A NAME="ss3.5">3.5 Escogiendo el tama&ntilde;o de papel</A>
</H2>

<P>
<P>Ghostscript se distribuye configurado para usar papel «US letter», que es
el tama&ntilde;o de p&aacute;gina por defecto, pero existen otros tama&ntilde;os que se
configuran empleando la instrucci&oacute;n <CODE>-sPAPERSIZE=<EM>opci&oacute;n</EM></CODE>, 
como por ejemplo
<P>
<BLOCKQUOTE><CODE>
<PRE>
-sPAPERSIZE=a4
-sPAPERSIZE=legal
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss3.6">3.6 Otras opciones a considerar</A>
</H2>

<P>
<P>En el caso de construcci&oacute;n de filtros de entrada, hay otras opciones
interesantes:
<P>
<UL>
<LI><CODE>-dSAFER</CODE>: Evita que act&uacute;en los operadores de borrado o
renombrado de ficheros, as&iacute; como la posibilidad de abrir ficheros en
cualquier otro modo que no sea de s&oacute;lo lectura. Esto es fundamental para
el mecanismo de <EM>spooling</EM> del demonio de impresi&oacute;n.</LI>
<LI><CODE>-dNOPAUSE</CODE>: Deshabilita el <EM>prompt</EM> y la pausa al final
de cada p&aacute;gina. Se utiliza para producir salidas de impresi&oacute;n o para
controlar <EM>gs</EM> desde otro programa.</LI>
<LI><CODE>@<EM>fichero</EM></CODE>: Hace que <EM>gs</EM> lea el fichero y trate
su contenido como si fueran l&iacute;neas de &oacute;rdenes. Las instrucciones dentro
del fichero pueden estar separadas por al menos un espacio en blanco.</LI>
</UL>
<P>
<HR>
<A HREF="Filtros-Impresion-Como-4.html">Página siguiente</A>
<A HREF="Filtros-Impresion-Como-2.html">Página anterior</A>
<A HREF="Filtros-Impresion-Como.html#toc3">Índice general</A>
</BODY>
</HTML>
