<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>``GNU Privacy Guard'' (GnuPG) Mini Como: Uso y gesti&oacute;n de las claves</TITLE>
 <LINK HREF="GPG-Mini-Como-4.html" REL=next>
 <LINK HREF="GPG-Mini-Como-2.html" REL=previous>
 <LINK HREF="GPG-Mini-Como.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="GPG-Mini-Como-4.html">Página siguiente</A>
<A HREF="GPG-Mini-Como-2.html">Página anterior</A>
<A HREF="GPG-Mini-Como.html#toc3">Índice general</A>
<HR>
<H2><A NAME="s3">3. Uso y gesti&oacute;n de las claves</A></H2>

<P>
<P>
<H2><A NAME="ss3.1">3.1 Generaci&oacute;n de una clave</A>
</H2>

<P>
<P>Con la orden
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --gen-key
</PRE>
</CODE></BLOCKQUOTE>
<P>se genera un nuevo par de claves (el par se compone de clave privada y
clave p&uacute;blica).  La primera pregunta es qu&eacute; algoritmo se va a usar.  
Para m&aacute;s informaci&oacute;n sobre algoritmos, ver la lista de respuestas a Preguntas
de Uso Frecuente (PUF, FAQ en ingl&eacute;s) sobre <I>PGP DH vs. RSA FAQ</I> en 
<A HREF="http://www.hertreg.ac.uk/ss/pgpfaq.html">http://www.hertreg.ac.uk/ss/pgpfaq.html</A> o 
<A HREF="GPG-Mini-Como-7.html#BSchneier">Applied Cryptography</A>.  El algoritmo recomendado por GnuPG es
DSA/ElGamal, ya que &eacute;ste no est&aacute; patentado.
<P>La siguiente pregunta es la longitud de la clave.  Esta parte depende
de los requerimientos del usuario.  Es necesario elegir entre la seguridad
y el tiempo de los procesos.  Cuanto mayor sea una clave, menor ser&aacute; el
riesgo de que el mensaje sea descodificado si es interceptado, pero tambi&eacute;n
aumentar&aacute; el tiempo que emplear&aacute; para el c&aacute;lculo de los procesos.  El tama&ntilde;o
m&iacute;nimo que requiere GnuPG es de 768 bits, aunque mucha gente opina que
deber&iacute;a ser de 2048 (que es el m&aacute;ximo con GnuPG en este momento).
Para DSA 1024 es un tama&ntilde;o fijo.  Cuando la seguridad es una prioridad m&aacute;s alta
que el tiempo, la opci&oacute;n es elegir el tama&ntilde;o de clave m&aacute;s grande que se
permita.
<P>El sistema nos pedir&aacute; a continuaci&oacute;n que se introduzca el nombre, 
comentario y direcci&oacute;n de correo electr&oacute;nico.  El c&oacute;digo se calcular&aacute; en 
base a estas entradas.  Esto se puede cambiar m&aacute;s tarde (ver 
<A HREF="#admon">Administraci&oacute;n de Claves</A>).  La direcci&oacute;n de correo electr&oacute;nico que 
se escoja deber&iacute;a ser una v&aacute;lida, ya que se usar&aacute; para firmar el
identificador de usuario.  Si esta direcci&oacute;n se modifica en alg&uacute;n modo, la 
firma no corresponder&aacute;.  Finalmente, se puede introducir un comentario.
<P>El &uacute;ltimo paso consiste en introducir una contrase&ntilde;a.  N&oacute;tese la 
diferencia entre los t&eacute;rminos anglosajones para la palabra 
«contrase&ntilde;a»: el t&eacute;rmino &quot;password&quot; indica una 
&quot;palabra de paso&quot;, mientras que el t&eacute;rmino &quot;passphrase&quot; 
indica una &quot;frase de paso&quot;.  Por tanto esta contrase&ntilde;a se debe
componer de m&aacute;s de una palabra.  Para que una contrase&ntilde;a sea efectiva 
(segura), deber&aacute; cumplir los siguientes requisitos:
<P>
<UL>
<LI>que sea larga;</LI>
<LI>que combine may&uacute;sculas, min&uacute;sculas y n&uacute;meros;</LI>
<LI>que contenga caracteres especiales (no alfanum&eacute;ricos);</LI>
<LI>que sea dif&iacute;cil de adivinar.  Por lo tanto, que no sean nombres, fechas
significativas, n&uacute;meros de tel&eacute;fono, n&uacute;meros de documentos, ...</LI>
</UL>
<P>En general, para una contrase&ntilde;a fuerte es aconsejable intercalar maY&uacute;sCUlas 
con mIn&uacute;sCulas, n&uacute;meros, otros caracteres no alfanum&eacute;ricos, etc.  Al escoger 
las palabras y frases debemos evitar aquellas palabras demasiado obvias, o 
fechas significativas, y nunca usar citas de libros o frases famosas.  Dicho 
esto, debemos asegurarnos de que la contrase&ntilde;a que elijamos sea lo 
suficientemente dif&iacute;cil para que no pueda ser traspasada por un «ataque 
de fuerza bruta», ni siquiera por un «ataque de diccionario»,
pero lo suficientemente f&aacute;cil como para que la recordemos.  Si olvid&aacute;ramos una 
contrase&ntilde;a nuestra clave quedar&iacute;a totalmente inutilizada, y los criptogramas 
con ella cifrados, indescifrables.  Ante esta posibilidad se recomienda crear 
siempre certificados de revocaci&oacute;n junto con las claves (ver 
<A HREF="#revoc">Certificados de Revocaci&oacute;n</A>).
<P>Una vez se han introducido todos los datos requeridos, empieza el proceso 
de generaci&oacute;n de las claves, que tardar&aacute; un tiempo dependiendo del tama&ntilde;o de 
&eacute;stas.  Durante este proceso el programa recoge datos aleatorios que usar&aacute; para 
generar las claves;  un modo para ayudar a generar estos datos es cambiando a 
una consola virtual diferente y usando el teclado mientras el proceso est&aacute; en 
marcha.
<P>
<H2><A NAME="ss3.2">3.2 Exportaci&oacute;n de claves</A>
</H2>

<P>
<P>La orden para exportar la clave es:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --export [UID]
</PRE>
</CODE></BLOCKQUOTE>
<P>Si no designamos un identificador de usuario (UID) todas las claves presentes 
en el anillo de claves ser&aacute;n exportadas.  El resultado es enviado por defecto 
a <CODE>stdout</CODE>, pero con la opci&oacute;n <CODE>-o</CODE> podemos especificar que sea enviado 
a un fichero.  Se recomienda usar la opci&oacute;n <CODE>-a</CODE> para que el resultado sea
un fichero de 7-bit ASCII en lugar de un fichero binario.
<P>Al exportar la clave p&uacute;blica se ampl&iacute;a el abanico de personas con las que se
podr&aacute; comunicar de modo seguro.  La clave se puede exportar poni&eacute;ndola en una
p&aacute;gina <EM>web</EM>, mediante <EM>finger</EM>, <EM>ftp</EM>, haci&eacute;ndola accesible en un
servidor de claves p&uacute;blicas, o cualquier otro m&eacute;todo.
<P>
<H2><A NAME="ss3.3">3.3 Importaci&oacute;n de claves</A>
</H2>

<P>
<P>Cuando se recibe la clave p&uacute;blica de otra persona hay que a&ntilde;adirla a la base de
datos (anillo de claves) para poder hacer uso de ella.  La orden para
importarlas es la siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --import [fichero]
</PRE>
</CODE></BLOCKQUOTE>
<P>Si se omite el nombre del fichero se leer&aacute;n los datos de <CODE>stdin</CODE>.  
El fichero puede contener una sola clave o varias a la vez, pertenecientes a 
la misma o a diferentes personas.
<P>
<H2><A NAME="revoc"></A> <A NAME="ss3.4">3.4 Revocaci&oacute;n de claves</A>
</H2>

<P>
<P>Existen diversos motivos por los que se pueda querer revocar una clave.  
Por ejemplo, si la clave secreta ha sido robada, o si se ha olvidado la 
contrase&ntilde;a de &eacute;sta.  En cualquier caso la orden de revocaci&oacute;n es:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --gen-revoke
</PRE>
</CODE></BLOCKQUOTE>
<P>Esto crear&aacute; un <B>Certificado de revocaci&oacute;n</B>.  Para ello es necesaria la
clave secreta, de lo contrario cualquiera podr&iacute;a hacer un certificado y 
revocar una clave que no le perteneciera.  En el caso anterior en el que la 
contrase&ntilde;a ha sido olvidada, se hace imposible generar un certificado de 
revocaci&oacute;n.  Por este motivo es muy aconsejable generar un certificado de 
revocaci&oacute;n a continuaci&oacute;n de la generaci&oacute;n de la clave.  Es primordial guardar 
este certificado en un lugar seguro para que nadie pueda usarlo y revocar la 
clave.
<P>
<H2><A NAME="admon"></A> <A NAME="ss3.5">3.5 Administraci&oacute;n de claves</A>
</H2>

<P>
<P>Existe un fichero que es una suerte de base de datos, en el que se guardan 
todos los datos relacionados con las claves, incluidos los valores relativos al 
grado de confianza (<EM>Ownertrust</EM>);  para m&aacute;s informaci&oacute;n sobre esto v&eacute;ase 
<A HREF="#firmk">Firmar las claves</A>. Con la orden
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --list-keys
</PRE>
</CODE></BLOCKQUOTE>
<P>se muestran todas las claves existentes.  Para poder ver tambi&eacute;n las firmas en 
cada clave, utilice la orden:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --list-sigs
</PRE>
</CODE></BLOCKQUOTE>
<P>(ver 
<A HREF="#firmk">Firmar las claves</A> para m&aacute;s informaci&oacute;n).  Para 
ver las huellas digitales (<EM>fingerprints</EM>):
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --fingerprint
</PRE>
</CODE></BLOCKQUOTE>
<P>Las «huellas digitales» sirven para confirmar la identidad de la persona.  Esta
orden nos muestra una lista alfanum&eacute;rica que podemos comprobar, por ejemplo,
por tel&eacute;fono, con la persona en cuesti&oacute;n.
<P>Para ver el listado de las claves secretas:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --list-secret-keys
</PRE>
</CODE></BLOCKQUOTE>
<P>Nota: el listado de las huellas digitales y las firmas de las claves secretas
no es de ninguna utilidad.
<P>Para eliminar una clave p&uacute;blica:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --delete-key UID
</PRE>
</CODE></BLOCKQUOTE>
<P>Para eliminar una clave secreta:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --delete-secret-key
</PRE>
</CODE></BLOCKQUOTE>
<P>Existe otra orden que es relevante para trabajar con las claves:
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --edit-key UID
</PRE>
</CODE></BLOCKQUOTE>
<P>Para esta orden necesitaremos la contrase&ntilde;a, y podemos, entre otras cosas, 
editar la fecha de caducidad, a&ntilde;adir una huella digital y firmar la clave.
<P>
<P>
<H2><A NAME="firmk"></A> <A NAME="ss3.6">3.6 Firma de las claves</A>
</H2>

<P>
<P>Como se ha mencionado anteriormente en la introducci&oacute;n, existe un tal&oacute;n de 
Aquiles en el sistema: la autentificaci&oacute;n de las claves p&uacute;blicas.  Si se 
obtiene una clave p&uacute;blica err&oacute;nea, ya se puede despedir uno del valor del 
cifrado.  Para evitar estos riesgos est&aacute; la posibilidad de firmar las claves.  
Cuando tenemos la certeza de que una clave es v&aacute;lida y pertenece a quien dice, 
podemos firmarla digitalmente, de modo que otros que conf&iacute;en en nuestra firma 
la puedan dar por v&aacute;lida.
<P>Usando la orden 
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gpg --edit-key UID
</PRE>
</CODE></BLOCKQUOTE>
<P>para la clave que queremos firmar, nos llevar&aacute; a la suborden 
<P>
<BLOCKQUOTE><CODE>
<PRE>
Command> sign
</PRE>
</CODE></BLOCKQUOTE>
<P><B>¡S&oacute;lo se debe firmar una clave cuando se est&eacute; ABSOLUTAMENTE SEGURO de 
que dicha clave es aut&eacute;ntica!</B>  En realidad, s&oacute;lo se puede estar totalmente 
seguro cuando la clave se ha recibido en mano, o por ejemplo si se ha recibido 
por correo y a continuaci&oacute;n se han comprobado las huellas digitales por 
correo.  Una clave no debe ser nunca firmada con base en una suposici&oacute;n.
<P>Bas&aacute;ndose en las firmas existentes en una clave y en el «grado de
confianza», <CODE>GnuPG</CODE> determina la validez de las claves.  El grado de
confianza (<EM>Ownertrust</EM>) es un valor que el propietario de una clave usa
para determinar el nivel de confianza para una cierta clave.  Estos valores 
son:
<P>
<UL>
<LI>1 = Don't know (No s&eacute;, no conozco)</LI>
<LI>2 = I do NOT trust (Confianza nula)</LI>
<LI>3 = I trust marginally (Confianza marginal)</LI>
<LI>4 = I trust fully (Confianza plena)</LI>
</UL>
<P>Si el usuario no se f&iacute;a de una firma puede indicarlo as&iacute;, y rechazar la 
confianza en &eacute;sta.  La informaci&oacute;n sobre la confianza no se guarda en el 
mismo fichero que el de las claves, sino en otro diferente.
<P>
<HR>
<A HREF="GPG-Mini-Como-4.html">Página siguiente</A>
<A HREF="GPG-Mini-Como-2.html">Página anterior</A>
<A HREF="GPG-Mini-Como.html#toc3">Índice general</A>
</BODY>
</HTML>
