<HTML>
<HEAD>
<TITLE>Quake I&amp;II Mini Como: Requisitos.</TITLE>
</HEAD>
<BODY>
<A HREF="QuakeI-II-Como-1.html">Anterior</A>
<A HREF="QuakeI-II-Como-3.html">Siguiente</A>
<A HREF="QuakeI-II-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Requisitos.</A></H2>



<H2><A NAME="soft"></A> <A NAME="ss2.1">2.1 Software.</A></H2>


<P>Nos hacen falta los ejecutables para linux. Se pueden encontrar en muchos 
sitios , el principal es en idsoftware (<CODE>
<A HREF="ftp://ftp.idsoftware.com">ftp.idsoftware.com</A></CODE>) pero este 
server va muy lento, el mejor sitio para bajarse todo lo necesario es la 
p&aacute;gina de quake en linux (<CODE>
<A HREF="http://captured.com/threewave/linux/index.html">captured.com/threewave/linux/index.html</A></CODE>). Ah&iacute; se puede bajar
todo lo necesario sin tener que sumergirse en los oscuros directorios de
idsoftware ... Otro sitio sobre el Quake y Linux es 
<A HREF="http://quake.medina.net">quake.medina.net</A>. Otros sitios donde se 
puede obtener casi todo el software necesario para el quake son:</P>
<P>
<UL>
<LI><CODE>
<A HREF="ftp://ftp.cdrom.com">ftp.cdrom.com</A></CODE>
(muy lento, es mejor el mirror que hay en <CODE>
<A HREF="ftp://ftp.doc.ic.ac.uk">ftp.doc.is.ac.uk</A></CODE>).
</LI>
<LI><CODE>
<A HREF="ftp://ftp.sci.com/quake">ftp.sci.com/quake</A></CODE>.
</LI>
<LI><CODE> 
<A HREF="http://www.quake2.com">www.quake2.com</A></CODE>
</LI>
</UL>
</P>
<P>Para descomprimir un fichero <CODE>tgz</CODE> o <CODE>tar.gz</CODE> ponemos <CODE>tar
zxfv nombre_del_fichero</CODE>.</P>


<H2><A NAME="ss2.2">2.2 Hardware:</A></H2>


<P>Los que pide el propio juego, osea, una tarjeta de video y un Pentium a 90
(yo he visto el quake corriendo en un 486 bajo linux y funcionaba, as&iacute; que
todo es cuesti&oacute;n de probar ;) ). </P>

<H3><A NAME="video"></A> Configuraci&oacute;n de la tarjeta de video.</H3>


<P>Se puede jugar al quake desde las X o desde la SVGA, recomiendo la SVGA
porque es mas r&aacute;pida, pero si es un servidor con varios usuarios
recomiendo la versi&oacute;n de las X (principalmente porque para correr la
vers&iacute;on SVGA hace falta que el ejecutable sea setuid root, con los
consiguientes riesgos de seguridad que esto conlleva), pero cada uno que
use la que m&aacute;s le guste ...</P>
<P>Si vas a jugar en las X tendr&aacute; que tenerlas configuradas (cualquier
duda sobre c&oacute;mo hacerlo mirela en el XFree86-Como)</P>
<P>Para la SVGA normalmente no hay que tocar nada, el archivo de 
configuraci&oacute;n est&aacute; en <CODE>/etc/vga/libvga.config</CODE> (En RedHat) o en
<CODE>/etc/libvga.config </CODE> (Slack). Si algo no va bien con la vga tendr&aacute;
que editar el fichero y poner los par&aacute;metros de su tarjeta (tipo de
chipset, RamDac, etc) y del monitor (m&iacute;relas en los manuales del
ordenador).</P>

<H3><A NAME="3dfx"></A> Configuraci&oacute;n de tarjetas aceleradoras.</H3>


<P>Lo primero que necesitaremos es una tarjeta aceleradora; hasta la fecha solo
est&aacute;n soportadas las basadas en el chip <CODE>3dfx</CODE> (en el momento de escribir
esto estaban portando los drivers para la <CODE>banshee</CODE>). Para poder usar una
3dfx necesitaremos bajarnos los siguientes ficheros:
<UL>
<LI><CODE>glide</CODE> son las librer&iacute;as que acceden directamente a la tarjeta, se
pueden obtener de 
<A HREF="http://glide.xxedgexx.com/3DfxRPMS.html">http://glide.xxedgexx.com/3DfxRPMS.html</A> , ah&iacute; podemos encontrar
versiones en formato <CODE>rpm</CODE> (para RedHat, OpenLinux, SuSe) as&iacute; como para
glibc (RedHat 5.X, debian 2.X, SuSe 6.X) o, libc5. En esta p&aacute;gina se puede
obtener tambien informaci&oacute;n sobre las tarjetas soportadas. Necesitaremos como
m&iacute;nimo dos archivos:
<OL>
<LI><CODE>Glide2x_SDK-2.1</CODE> es el kit de desarrollo de la librer&iacute;a glide.</LI>
<LI><CODE>Glide</CODE> son las librer&iacute;as propiamente dichas, dependiendo del tipo de
3dfx que tengamos necesitaremos:
<OL>
<LI><CODE>Glide_VG-2.46</CODE> para las tarjetas <CODE>voodoo 1</CODE>.</LI>
<LI><CODE>Glide_VR-2.46</CODE> para las tarjetas <CODE>voodoo rush</CODE>.</LI>
<LI><CODE>Glide_V2-2.51</CODE> para las tarjetas <CODE>voodoo 2</CODE>.</LI>
</OL>
</LI>
</OL>
</LI>
<LI><CODE>Mesa</CODE> es la versi&oacute;n <I>free</I> de las librer&iacute;as <CODE>OpenGL</CODE>, se pueden 
obtener de 
<A HREF="http://www.ssec.wisc.edu/~brianp/Mesa.html">http://www.ssec.wisc.edu/~brianp/Mesa.html</A>. La &uacute;ltima versi&oacute;n estable
es la 3.0 y de desarrollo la 3.1, es recomendable bajarse la &uacute;ltima estable
(en este caso la 3.0). De ah&iacute; cojeremos dos ficheros:
<OL>
<LI><CODE>MesaLib</CODE> las librer&iacute;as propiamente dichas.</LI>
<LI><CODE>MesaDemos</CODE> demos de la librer&iacute;a.</LI>
</OL>

Existen binarios de las librer&iacute;as en todos los formatos, pero en este caso
necesitaremos los fuentes porque las tenemos que recompilar.</LI>
</UL>
</P>
<P>Una vez obtenidos los ficheros necesarios lo primero que instalaremos son las
<CODE>glide</CODE>, si nos las hemos bajado en rpm lo haremos con 
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][~]# rpm -Uhv Glide_V[tipo de tarjeta]-[versi&oacute;n].rpm
 
</PRE>
</CODE></BLOCKQUOTE>

Si no disponemos del programa rpm podemos usar la utilidad <CODE>rpm2cpio</CODE> de la
siguiente manera (desde el directorio / para que nos cree bien los directorios
necesarios):
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][/]# cd /
[root@unsCAred][/]# rpm2cpio archivo.rpm | cpio -i --make-directories
[root@unsCAred][/]# ldconfig
</PRE>
</CODE></BLOCKQUOTE>

Para comprobar que las librer&iacute;as est&aacute;n correctamente instaladas ejecutamos en
el shell el comando:
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][~]# ldconfig -p|grep libglide
[root@unsCAred][~]# ldconfig -p|grep libtexus
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ahora instalamos el fichero <CODE>Glide2x_SDK-2.1</CODE>, del que solo necesitamos los
includes
Si tenemos rpm ponemos 
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][~]# rpm -Uhv Glide2x_SDK-2.1-3.i386.rpm
</PRE>
</CODE></BLOCKQUOTE>

Si no disponemos de rpm usamos nuevamente el rpm2cpio de la siguiente manera:
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][~]# cd /tmp
[root@unsCAred][/tmp]# rpm2cpio Glide2x_SDK-2.1-3.i386.rpm | cpio -i --make-directories
[root@unsCAred][/tmp]# cd /usr/local/
[root@unsCAred][/usr/local]# mkdir glide
[root@unsCAred][/usr/local]# cd glide
[root@unsCAred][/usr/local/glide]# mkdir include
[root@unsCAred][/usr/local/glide]# cd include
[root@unsCAred][/usr/local/glide/include]# cp /tmp/include/* .
[root@unsCAred][/usr/local/glide/include]# ls
3dfx.h      glidesys.h  gump.h      sst1vid.h
glide.h     glideutl.h  linutil.h   texus.h
</PRE>
</CODE></BLOCKQUOTE>

En caso de haber usado el rpm tenemos que hacer un enlace simb&oacute;lico ya que las
librer&iacute;as Mesa buscar&aacute;n la librer&iacute;a <CODE>libglide</CODE> en <CODE>/usr/local/glide/lib</CODE>, lo hacemos con lo siguiente:
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][~]#cd /usr/local/glide
[root@unsCAred][/usr/local/glide]# mkdir lib
[root@unsCAred][/usr/local/glide]# cd lib
[root@unsCAred][/usr/local/glide/lib]# ln -s /usr/lib/libglide2x.so .
[root@unsCAred][/usr/local/glide/lib]# ls
libglide2x.so@
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>Ahora que ya hemos instalado correctamente las librer&iacute;as glide nos vamos a por
las Mesa. Haremos lo siguiente:
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][~]# cd /tmp
[root@unsCAred][/tmp]# tar zxfv MesaLib*
[иии]
[root@unsCAred][/tmp]# tar zxfv MesaDemos*
[иии]
[root@unsCAred][/tmp]# cd Mesa-3.0
[root@unsCAred][/tmp/Mesa-3.0]# make realclean
</PRE>
</CODE></BLOCKQUOTE>

Ahora es cuando nos leemos el README que viene con las librer&iacute;as, una vez
hecho eso las compilamos, dependiendo del tipo de tarjeta aceleradora que
tengamos pondremos lo siguiente:
<UL>
<LI><CODE>make linux-386-opt-glide</CODE> si tenemos una voodoo 1.</LI>
<LI><CODE>make linux-386-opt-V2-glide</CODE> si tenemos una voodoo 2.</LI>
<LI> si tenemos una voodoo rush podemos hacer uno de estos tres:
<OL>
<LI><CODE>make linux-glide</CODE> para linux glide.</LI>
<LI><CODE>make linux-386-glide</CODE> para micros i386.</LI>
<LI><CODE>make linux-386-glide-mits</CODE> micros i386 con multiproceso.</LI>
</OL>
</LI>
</UL>

Despues de un rato y si no hemos tenido ningun problema las librer&iacute;as ya
estar&aacute;n compiladas, ahora lo &uacute;nico que queda es instalarlas. Si ya las
ten&iacute;amos instaladas antes lo &uacute;nico que tenemos que hacer es copiar la librer&iacute;a
nueva que hemos generado, para eso hacemos:
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][/tmp/Mesa-3.0]# cd lib
[root@unsCAred][/tmp/Mesa-3.0/lib]# cp -a * /usr/lib
</PRE>
</CODE></BLOCKQUOTE>

He puesto el <CODE>/usr/lib</CODE> porque es donde las ten&iacute;a yo instaladas, si ya
las ten&iacute;amos en <CODE>/usr/local/lib</CODE> las copiaremos ah&iacute;.
Si no las ten&iacute;amos instaladas antes lo hacemos poniendo: 
<BLOCKQUOTE><CODE>
<PRE>
[root@unsCAred][/tmp/Mesa-3.0]# make install
</PRE>
</CODE></BLOCKQUOTE>
 </P>
<P>Para concluir, ejecutamos como root el comando <CODE>ldconfig</CODE> y ya tendremos
todo lo necesario para que funcione la 3dfx (bueno, a&uacute;n nos faltan los
ejecutables para el quake, el quakeworld y el quake2).</P>


<H3><A NAME="raton"></A> Configuraci&oacute;n del rat&oacute;n.</H3>


<P>Para que funcione el rat&oacute;n tenemos que editar otra vez el fichero de
configuraci&oacute;n de la vga (ver 
<A HREF="#video">Configuraci&oacute;n de la tarjeta de video</A>) y poner el tipo de rat&oacute;n que tenemos. Es necesario
tener el <CODE>gpm</CODE> funcionando, que es el que se encarga de controlar el
rat&oacute;n en la consola. Si usa el <CODE>gpm</CODE> con el par&aacute;metro <CODE>-R</CODE> es
recomendable cambiarlo antes de jugar con un script o algo parecido, ya
que se nota bastante la velocidad de respuesta del mouse. </P>
<P>En el quake se puede especificar el dispositivo en el que se encuentra el
rat&oacute;n mediante los par&aacute;metros <CODE>-mdev [device]</CODE> y la velocidad 
con <CODE>-mrate [speed]</CODE>. Los par&aacute;metros por defecto son 
<CODE>/dev/mouse</CODE> para el <CODE>-mdev</CODE> y <CODE>1200</CODE> para el <CODE>-mrate</CODE>. </P>
<P>Lo errores con el rat&oacute;n normalmente se deben a fallos en la configuraci&oacute;n 
del gpm o porque no se ha especificado el tipo de rat&oacute;n en el
<CODE>libvga.config</CODE>. Adem&aacute;s es muy com&uacute;n que cuando se est&aacute; jugando al
quake y se cambia a otra consola el rat&oacute;n deje de responder, esto se puede
arreglar de dos maneras:</P>
<P>
<UL>
<LI> Reiniciando el gpm (en RedHat con <CODE>/etc/rc.d/init/gpm restart</CODE>)</LI>
<LI> Poniendo <CODE>echo "*n" >/dev/mouse</CODE> en una consola.</LI>
</UL>
</P>
<P>Para cualquier duda o problema con un rat&oacute;n de tres botones es recomendable 
consultar el <CODE>Raton_3_botones-Como</CODE>.</P>

<H3>Configuraci&oacute;n de la tarjeta de sonido.</H3>


<P>No es extrictamente necesaria, pero jugar al quake sin sonido es como una 
primavera sin flores ;) . Para configurar la tarjeta de sonido consultar
el <CODE>Sonido-Como</CODE>.) Para jugar sin sonido ponemos el par&aacute;metro 
<CODE>-nosound</CODE>. Adem&aacute;s de este hay otros parametr&oacute;s que son:</P>
<P>
<UL>
<LI><CODE>sndbits</CODE> [8 or 16]</LI>
<LI><CODE>sndspeed [speed]</CODE> (8000, 11025, 22051 and 44100), por
defecto 11025.</LI>
<LI><CODE>sndmono</CODE>.</LI>
<LI><CODE>sndstereo</CODE> (por defecto, siempre que sea posible).
</LI>
</UL>
</P>
<P>En el quake2 he experimentado problemas con el OSS y el driver para mi
tarjeta (una AWE32), ya que cuando se reinicia el sistema de sonido deja 
de funcionar (esto no ocurre con el driver normal del kernel). El problema
estaba en el compilador, si est&aacute; usando el <CODE>OSS</CODE>, el <CODE>egcs</CODE> o el
<CODE>pgcc</CODE> como compilador y un kernel de la serie <CODE>2.0.X</CODE> puede que tenga
problemas, la soluci&oacute;n pasa por instalarse el gcc-2.7.2.3 y recompilar el
sndconfig con &eacute;l (adem&aacute;s los kernels de esa versi&oacute;n es recomnedable
compilarlos con el <CODE>gcc</CODE> y no con el <CODE>egcs/pgcc</CODE>).</P>


<HR>
<A HREF="QuakeI-II-Como-1.html">Anterior</A>
<A HREF="QuakeI-II-Como-3.html">Siguiente</A>
<A HREF="QuakeI-II-Como.html#toc2">Indice</A>
</BODY>
</HTML>
