<HTML>
<HEAD>
<TITLE>Pilot COMO: Informaci&oacute;n General</TITLE>
</HEAD>
<BODY>
<A HREF="Pilot-Como-1.html">Anterior</A>
<A HREF="Pilot-Como-3.html">Siguiente</A>
<A HREF="Pilot-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Informaci&oacute;n General</A></H2>



<H2><A NAME="ss2.1">2.1 ¿Qu&eacute; es un Pilot?</A></H2>


<P>El Pilot es un peque&ntilde;o Asistente Personal Digital. Est&aacute; fabricado por U.S. 
Robotics, ahora parte de 3Com. </P>
<P>Para los que no est&eacute;n familiarizados con el t&eacute;rmino, un Asistente Personal
Digital es uno de esos peque&ntilde;os dispositivos electr&oacute;nicos que contienen
normalmente varios tipos de informaci&oacute;n personal, como pueden ser
direcciones y n&uacute;meros de tel&eacute;fono, un calendario, lista de recordatorios
y/o apuntes y est&aacute; dise&ntilde;ado para ser transportado c&oacute;modamente as&iacute; como
estar a mano cuando la informaci&oacute;n se requiera. </P>
<P>Los PDAs m&aacute;s vers&aacute;tiles, como el Pilot, permiten que los datos almacenados
en el PDA sean copiados a otro ordenador y que otros datos y nuevos
programas sean instalados en el PDA desde un ordenador. </P>


<H2><A NAME="ss2.2">2.2 Diferentes tipos de Pilot</A></H2>


<P>Hay cuatro versiones del Pilot. Los dos m&aacute;s antiguos, el 1000 y el 5000
tienen 128k y 512k de RAM respectivamente. </P>
<P>Los dos m&aacute;s recientes, el PalmPilot Personal y el PalmPilot Professional
tienen 512k y 1 Mb de RAM respectivamente. Tambi&eacute;n tienen una pantalla LCD
retroiluminada y la versi&oacute;n 2.0 del sistema operativo. El Professional
tambi&eacute;n incorpora soporte para el protocolo TCP/IP e incluye algunos
programas adicionales. </P>
<P>Es posible actualizar cualquier Pilot cambi&aacute;ndole la tarjeta de memoria,
la cual incluye tanto la RAM como la ROM. Por supuesto, esto no har&aacute; que
los pilots antiguos tengan una pantalla retroiluminada. </P>


<H2><A NAME="ss2.3">2.3 Instalaci&oacute;n del Hardware</A></H2>


<P>Los Pilot vienen con un "soporte" para el intercambio de datos con el
ordenador de sobremesa. Este dispositivo es realmente un cable serie con un
recept&aacute;culo hecho a medida para colocar el Pilot y con un bot&oacute;n de
"sincronizaci&oacute;n". Conecte su soporte a un puerto serie libre del
ordenador. Cuando ejecute alguno de los programas, necesitar&aacute; colocar su
Pilot en el soporte y pulsar el bot&oacute;n de sincronizaci&oacute;n para que el Pilot
sepa que se tiene que comunicar. Si se pulsa el bot&oacute;n estando el Pilot
apagado, &eacute;ste se encender&aacute; autom&aacute;ticamente.</P>
<P>Por comodidad, cree un dispositivo, <CODE>/dev/pilot</CODE> que ser&aacute; un nombre
alternativo para el puerto serie donde el soporte del Pilot est&eacute;
conectado. Ejecute lo siguiente como root: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        ln /dev/cua0 /dev/pilot
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Sustituya <CODE>cua0</CODE> con el nombre del puerto al cual tenga conectado su
soporte del Pilot.</P>


<HR>
<A HREF="Pilot-Como-1.html">Anterior</A>
<A HREF="Pilot-Como-3.html">Siguiente</A>
<A HREF="Pilot-Como.html#toc2">Indice</A>
</BODY>
</HTML>
