<HTML>
<HEAD>
<TITLE>Spanish Linux HOWTO: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Spanish-Como-2.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>

<H2><A NAME="ss1.1">1.1 Empecemos por el principio...</A></H2>


<P>Este documento pretende ser el punto de entrada de los hispanohablantes al
mundo Linux, intentando abarcar tanto a los principiantes de este
apasionante sistema como a los ya iniciados que buscan informaci&oacute;n
puntual. Se tratar&aacute;n de forma gen&eacute;rica todos los temas que puedan
interesar al usuario de Linux, desarroll&aacute;ndolos en castellano o dando
referencias a otras fuentes de informaci&oacute;n en nuestro idioma, as&iacute; como
orientaci&oacute;n cuando tenga que acudir a otras HOWTO y en general a cualquier
documento en ingl&eacute;s. </P>
<P>Se distribuye integrado con el Linux Documentation Project en todos los foros de
informaci&oacute;n Linux en Internet. Se actualiza peri&oacute;dicamente, pudiendo
encontrar la &uacute;ltima versi&oacute;n en 
<A HREF="http://www.cs.us.es/archive/linux.html">Linux/Espa&ntilde;a</A></P>
<P>Notas del autor: Aunque puede ser interesante de por s&iacute;, traducir sin
m&aacute;s informaci&oacute;n ya editada en ingl&eacute;s no es el objetivo de este documento,
sino m&aacute;s bien servir de base al usuario hispanohablante y divulgar el Linux en nuestro idioma. Una ambici&oacute;n
de quien escribe es, desde estas l&iacute;neas, poner su grano de arena para
coordinar los esfuerzos (valiosos pero muy diseminados por la red) de tanto
Linuxero como ya hay. Otro
objetivo menos pretencioso de este documento es complementar todas las demas
Howto's en aquellos aspectos concretos que afecten a los usuarios hispanos
(configuraci&oacute;n del sistema y de las aplicaciones para trabajar en nuestro
idioma, teclados, correo electr&oacute;nico en espa&ntilde;ol, etc). Un tercer objetivo ser&aacute;
servir de agenda actualizada de direcciones espa&ntilde;olas dedicadas a Linux, tanto para
difusi&oacute;n de las distribuciones originales de software Linux como de
desarrollos propios en espa&ntilde;ol que se vayan publicando. Vaya desde aqu&iacute; mi
agradecimiento en esta primera versi&oacute;n para 
<A HREF="mailto:antonio-luis.delgado@cs.us.es">Antonio L. Delgado</A>,
compa&ntilde;ero de la Facultad de Inform&aacute;tica de Sevilla, por prestarse a echar una
mano redactando esta Howto en las calurosas tardes de Sevilla.</P>
<P>Cualquier comentario, sugerencia para nuevos contenidos, rectificaci&oacute;n
de errores, cr&iacute;tica, etc. es no s&oacute;lo bienvenido sino tambi&eacute;n esperado.
Contacta por correo electr&oacute;nico para todo lo que quieras.</P>


<H2><A NAME="ss1.2">1.2 ¿Qu&eacute; es linux?</A></H2>

<P>   </P>
<P>Linux es una implementaci&oacute;n del sistema operativo UNIX (uno m&aacute;s de entre
los numerosos cl&oacute;nicos del hist&oacute;rico Unix), pero con la originalidad de
ser gratuito y a la vez muy potente, que sale muy bien parado (no pocas veces
victorioso) al compararlo con las versiones comerciales para sistemas de
mayor envergadura y por tanto te&oacute;ricamente superiores. Comenz&oacute; como proyecto personal del -entonces
estudiante- Linus Torvalds, quien tom&oacute; como punto de partida otro viejo
conocido, el Minix de Andy. S. Tanenbaum (profesor de sistemas operativos
que cre&oacute; su propio sistema operativo Unix en PCs XT para
usarlo en su docencia). Actualmente Linus lo sigue desarrollando, pero a estas
alturas el principal autor es la red Internet, desde donde una gigantesca
familia de programadores y usuarios aportan diariamente su tiempo
aumentando sus prestaciones y dando informaci&oacute;n y soporte t&eacute;cnico m&uacute;tuo.
La versi&oacute;n original -y aun predominante- comenz&oacute; para PCs compatibles (Intel
386 y superiores),
existiendo tambi&eacute;n en desarrollo versiones para pr&aacute;cticamente todo tipo de
plataformas: 
<A HREF="http://www.cs.us.es/archive/linuxppc/">PowerPC</A>,
<A HREF="http://www.geog.ubc.ca/sparclinux.html">Sparc</A>,
<A HREF="http://www.azstarnet.com/~axplinux">Alpha</A>,
<A HREF="http://www.fnet.fr/linux-mips/">Mips</A>,
etc. De todas ellas la m&aacute;s
reciente en este momento es la versi&oacute;n para 
<A HREF="http://www.mklinux.org">PowerMac</A> (el PowerPC de Apple)
basada en el microkernel Mach 3.0 y de la que ya hay una distribuci&oacute;n para
desarrolladores avalada directamente por Apple y OSF pero conservando el
esp&iacute;ritu (gratuito, de libre distribuci&oacute;n, etc) de la version original. Un servidor
la acaba de probar hace unos d&iacute;as y se ha llevado una grata sorpresa (a&uacute;n tendr&aacute; muuuchos
fallos, pero para ser una primer&iacute;sima versi&oacute;n y el poco tiempo que lleva en marcha, ha
avanzado m&aacute;s de lo que me esperaba).</P>


<H2><A NAME="ss1.3">1.3 ¿C&oacute;mo conseguirlo?</A></H2>


<P>La primera fuente para conseguir el sistema Linux es la propia red
Internet, y es donde estar&aacute;n siempre las &uacute;ltimas versiones y las
aplicaciones m&aacute;s actualizadas en muchos servidores de FTP an&oacute;nimo. Otra
v&iacute;a muy frecuente, de inter&eacute;s para principiantes y para quienes no deseen
o no puedan permitirse copiar tanta cantidad de informaci&oacute;n a traves de
la red, es mediante las versiones comercializadas en CDROM. Hay empresas
que se dedican a elaborar CDROMs de bajo coste con recopilaciones de
software, manuales, etc. El coraz&oacute;n del sistema es el mismo, aunque pueden
tener externamente presentaciones y formas distintas de instalaci&oacute;n. Hay
revistas especializadas que tambi&oacute;n suelen incluir CDs con alguna versi&oacute;n
de Linux. Hacia el final de este documento se relacionan diversas
fuentes de Linux, tanto servidores p&uacute;blicos en la red como direcciones de
empresas que lo comercializan.</P>
<P>Una ventaja (para muchos usuarios termina siendo un inconveniente) es la gran rapidez con
la que se se desarrolla Linux. Constantemente llegan a los principales
servidores Linux en la red actualizaciones del n&uacute;cleo del sistema, de
aplicaciones, utilidades, manuales y documentaci&oacute;n, etc. Es bueno estar al
d&iacute;a, seguir con atenci&oacute;n su evoluci&oacute;n y aprovechar las mejoras que se
incorporen, pero en la mayor&iacute;a de los casos no vale la pena estar
reinstalando software por el simple hecho de ser una nueva versi&oacute;n, sino
que hay que ser un poco selectivos, al menos con el software. En el caso
de los manuales, How-To's, grupos de noticias y/o listas de correo s&iacute; que
vale la pena estar "a la &uacute;ltima", sobre todo porque es all&iacute; donde nos
sacar&aacute;n de apuros cuando agotemos nuestros propios recursos... </P>


<H2><A NAME="ss1.4">1.4 ¡Socorro! ¿D&oacute;nde est&aacute;n los manuales?</A></H2>


<P>Como ocurre en todas las versiones de Unix, el primer sitio donde mirar
cuando tenga una duda concreta sobre tal comando, fichero de
configuraci&oacute;n, etc. es la orden '<CODE>man</CODE>', que incluye la ayuda de referencia
de Unix. Pero s&oacute;lo es &uacute;til en ese &aacute;mbito, cuando ya se sabe m&aacute;s o menos lo se que busca, y s&oacute;lo
se necesita aclarar dudas concretas. Para todo lo dem&aacute;s la mejor fuente de
informaci&oacute;n es, c&oacute;mo no, la propia red. En ella est&aacute;n disponibles tanto
libros completos (de los que algunas editoriales especializadas han publicado versiones
en papel) como la colecci&oacute;n "Linux HOWTO", de la que
este documento forma parte. Hay una HOWTO para pr&aacute;cticamente cualquier
tema. Su objetivo es cubrir, mediante manuales breves, concisos y
espec&iacute;ficos, cualquier duda que pueda surgir. Se actualizan
permanentemente, y se distribuyen a trav&eacute;s del denominado "Linux
Documentation Project" (LDP) en Internet. La misma informaci&oacute;n se publica
en muy diferentes formatos, orientados tanto a la b&uacute;squeda y consulta en
l&iacute;nea como a su lectura convencional. Todas las versiones de Linux incluyen
estos manuales (al menos la &uacute;ltima edici&oacute;n disponible en el momento de
recopilar el CDROM correspondiente), y al final de este documento se
aportan algunas de las muchas direcciones para consultar en la red. </P>


<HR>
Anterior
<A HREF="Spanish-Como-2.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc1">Indice</A>
</BODY>
</HTML>
