<HTML>
<HEAD>
<TITLE>Spanish Linux HOWTO: Conectividad de Linux</TITLE>
</HEAD>
<BODY>
<A HREF="Spanish-Como-4.html">Anterior</A>
<A HREF="Spanish-Como-6.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Conectividad de Linux</A></H2>


<P><EM>Uno de los puntos muy fuertes de Linux es su gran conectividad: incluso
con recursos modestos en hardware puede ser un h&aacute;bil servidor de red y
convivir practicamente con cualquier configuracion que ya tengamos funcionando
en nuestra red. A medida que mejoremos el equipamiento, Linux aprovechar&aacute; todos
los recursos convirti&eacute;ndose en un potente centro de servicios.
Si no consigo abrirte el apetito de curiosidad, echa un vistazo a las varias
How-To sobre el tema o lo lamentaras... :)</EM></P>


<P>Como digno miembro de la familia Unix, el entorno nativo de red en el que ha
nacido Linux es el TCP/IP, asi que nos moveremos en Internet y en las redes
locales basadas en esta familia de protocolos como pez en el agua. Puede
actuar tanto
de simple cliente hasta como una potente estacion de
trabajo de bajo coste, pasando por un XTerminal con todo su entorno grafico con
absolutamente todo el software necesario, ya incluido o de
m&aacute;s o menos f&aacute;cil instalacion.</P>
<P>En el nivel f&iacute;sico (cacharreo para entendernos), Linux puede conectarse con
otros Linux o con cualquier otro sistema usando casi cualquier cosa: cableado serie, paralelo,
modems convencionales, tarjetas RDSI, Frame Relay, redes locales ethernet &oacute; token ring,
radiopaquete (AX.25 para radioaficionados), etc.</P>
<P>En cuanto a protocolos de red, lo que lleva en la sangre es el mencionado
TCP/IP, pero puede acceder (como cliente o como servidor, segun los casos) a
redes basadas en IPX (Novell), AppleTalk (Macintosh) y SMB (red LanManager
para conectar con Windows para trabajo en grupo, Windows 95 y Windows NT).
Por si sirve de pista, quien escribe ha hecho ya la prueba de poner un simple PC de gama media como
nodo principal para dar servicios de
disco, impresoras y, sobre todo, acceso a Internet a una LAN ethernet de 75
puestos de trabajo que usan indistintamente cualquiera de los mencionados protocolos
compartiendo indistintamente sus recursos. Y lo mejor de todo es que nadie fue capaz de
distinguir desde sus respectivos puestos a Linux del servidor propio que les
atend&iacute;a hasta entonces. De hecho lleva
varios meses en uso ininterrumpido y s&oacute;lo Linux ha sido capaz de hacer simult&aacute;neamente de
servidor para usuarios Unix, Windows 3.11, Windows 95, NT, DOS, Netware y
Mac sin colgarse ni una sola vez y con un coste rid&iacute;culo. Nadie me garantiza
que nunca me vaya a fallar, pero lo doy por modesta pero absolutamente
victorioso en comparaci&oacute;n con sistemas comerciales te&oacute;ricamente superiores y
con un coste mucho mayor.</P>
<P>Otra situaci&oacute;n en la que actualmente uso Linux es como servidor de Web, mail,
FTP an&oacute;nimo (de servicio p&uacute;blico a la red) y servicios de salida a Internet para
una red local de 2.100 usuarios, tambi&eacute;n con muy buenos resultados
a pesar de la fuerte carga de trabajo cont&iacute;nuo las 24 horas.</P>

<H2><A NAME="ss5.1">5.1 Conectividad casera</A></H2>


<P>Algunas de las situaciones t&iacute;picas en las que se puede aprovechar la
capacidad de trabajo en red de Linux podr&iacute;an ser:</P>


<H2><A NAME="ss5.2">5.2 Servidor de terminales</A></H2>


<P>¿Qui&eacute;n no tiene en casa un PC (o algo peor) que se ha quedado antiguo pero
que a&uacute;n funciona? Cualquier ordenador con un puerto serie y algun software
de emulaci&oacute;n de terminal puede conectarse a un Linux, permitiendo varios
usuarios trabajando simultaneamente. Para quien no lo haya hecho alguna vez,
es la forma m&aacute;s simple de comprobar por s&iacute; mismo que Linux es un sistema 100%
multiusuario y multitarea. Todos los recursos de memoria, disco, etc.
estar&aacute;n a la vez disponibles para compartirlos entre tantos usuarios como puertos serie
tengamos.</P>


<H2><A NAME="ss5.3">5.3 Red PPP</A></H2>


<P>Enlazando ordenadores por puertas serie, paralelo, modems, etc, es posible
no solamente que un Linux sea el ordenador principal y otros usuarios accedan a
trav&eacute;s de simples terminales,
sino que es posible aprovechar la capacidad de todos los equipos sumando recursos.
Desde un equipo se puede acceder a impresoras, discos, etc. de cualquier
otro equipo. El protocolo PPP permite crear una red TCP/IP entre todos
ellos, usando como enlace tanto modems como simples cables. A medida que cambiemos
la red f&iacute;sica por algo mas "decente" como una LAN ethernet o an&aacute;logo, mejorar&aacute;n
las prestaciones como es l&oacute;gico, pero la idea es la misma
y el software de usuario son id&eacute;nticos (lo que var&iacute;a, claro esta, es la
configuraci&oacute;n del propio sistema operativo).</P>


<H2><A NAME="ss5.4">5.4 Servidor de modems</A></H2>


<P>Combinando los dos apartados anteriores, podemos unir la capacidad de servidor
de puertos serie (a los que conectaremos modems) y el protocolo PPP (para dar
a esas l&iacute;neas serie la funcionalidad del TCP/IP). As&iacute; podemos dar servicio de
acceso a Internet a los usuarios que se nos conecten por tel&eacute;fono.</P>


<H2><A NAME="ss5.5">5.5 Conexion directa a Internet</A></H2>


<P>Ciertamente no es lo normal en casa, pero es relativamente frecuente
encontrarlo en universidades y de un tiempo para ac&aacute; tambi&eacute;n es habitual
en empresas. Si tenemos
una red local enganchada a su vez a un proveedor
(acad&eacute;mico o comercial), entonces una simple tarjeta de red y una simple
configuraci&oacute;n del sistema ser&aacute;n suficientes para conectar Linux, que actuar&aacute; como
un ordenador Unix cualquiera, con todas sus ventajas. De hecho en la red encontraremos
m&aacute;s de un servidor que esconde un Linux en sus "entra&ntilde;as", o que precisamente quien
nos est&eacute; haciendo de proveedor de acceso sea un Linux. Pero hay que tener en
cuenta tambien sus inconvenientes de seguridad: igual que podemos
conectarnos desde Linux, es perfectamente posible que se conecten a nosotros
inadvertidamente, por lo que, salvo que necesitemos mantener abierto algun
servicio en particular, es recomendable cerrar "todas las ventanas" para
evitar problemas. Algunos buenos consejos para un Linux de uso personal ser&iacute;an:</P>
<P>
<UL>
<LI>Crea cuentas para los usuarios que realmente vayan a usarlo, y as&iacute;gnales claves
dificilmente adivinables (no hace falta complicarse la vida con claves
imposibles, pero tampoco debes pon&eacute;rselo f&aacute;cil a los intrusos)</LI>
<LI>Hazte cargo de la clave del administrador <CODE>root</CODE> y procura
mantenerla a salvo. Si la facilitas a alguien m&aacute;s, mental&iacute;zale para que
la use con precauci&oacute;n (por otra parte tambi&eacute;n es una forma de aprender
nociones b&aacute;sicas de administraci&oacute;n de sistemas...)</LI>
<LI>Ponte como <CODE>root</CODE>, edita <CODE>/etc/inetd.conf</CODE> y ponle un signo de comentario
(<CODE>#</CODE>) a todas las lineas excepto aquellas que abran servicios que necesites
mantener accesibles; luego haz "killall -1 inetd". No te cortes y cierralo
todo, que siempre estaras a tiempo de reabrir aisladamente aquello que eches
en falta</LI>
<LI>Aunque te consideres muy capaz de administrar un sistema de este tipo,
no tengas la mala costumbre de usar <CODE>root</CODE> como usuario habitual con el que
te conectes al sistema, o en caso de despiste podr&iacute;as provocar algun destrozo.
Es mas seguro que entres como un usuario "raso" y uses <CODE>su - root</CODE>
cuando necesites hacer alguna operacion concreta como super-usuario (recuerda
usar <CODE>exit</CODE> para volver a tu status normal cuando termines lo que ten&iacute;as que
hacer como super-usuario)</LI>
<LI>El sistema va dejando muchos mensajes registrando la actividad de los
usuarios y del propio sistema en m&uacute;ltiples ficheros de contabilidad. Muchos
de ellos se centralizan a traves del servicio <CODE>syslogd</CODE>. En cuanto
empieces a desenvolverte un poco con el manual y los comandos b&aacute;sicos para
moverte por el sistema, aprende a recoger la informaci&oacute;n que genere ese
servicio, eliminar la in&uacute;til, revisar la &uacute;til y limpiar la contabilidad
de vez en cuando (de lo contrario te puedes dar un susto cuando veas
ficheros gigantescos que devoran espacio de disco con informaci&oacute;n desfasada
despues de tanto tiempo)</LI>
</UL>
</P>


<H2><A NAME="ss5.6">5.6 Infov&iacute;a: acceso a Internet desde casa</A></H2>



<H3>¿Qu&eacute; es infov&iacute;a?</H3>


<P>Infov&iacute;a es una red creada por Telef&oacute;nica a la que los usuarios acceden desde
cualquier punto de la red telef&oacute;nica espa&ntilde;ola a precio de llamada local. Funciona como
una intranet (una red basada en los mismos protocolos que Internet, pero
independiente y sin integrarse en ella). No tiene por tanto acceso
directo a Internet, pero es un buen intermediario ya que abarata costes
tanto para el usuario como para el proveedor de acceso a internet, que
aprovecha su infraestructura sin tener que invertir en una red propia.
En este sentido es una v&iacute;a interesante de acceso, pero para evitar confusiones
hay que tener presente que Infov&iacute;a NO es Internet, sino un producto comercial de
Telef&oacute;nica. A&uacute;n despues de habernos conectado a Infov&iacute;a
seguimos necesitando un proveedor de acceso a Internet para estar verdaderamente
conectados a la <EM>red de redes</EM>.</P>
<P>Al funcionar igual que Internet (el software de Infov&iacute;a no es m&aacute;s que
un PPP y un navegador de web, que utiliza como interfaz de usuario) es
perfectamente posible usar Linux para conectarse,
pero surge el problema t&iacute;pico de configuraci&oacute;n: Telef&oacute;nica facilita su software
gratuito para entornos comerciales t&iacute;picos (Windows 3.11, Windows95 y Macintosh) que Linux
no necesita (ya lo tiene). Pero Linux lo que necesita es conocer la
configuracion de su red, para poder integrarse en ella.</P>

<H3>¿Como conectar entonces?</H3>


<P>El software b&aacute;sico es el <CODE>pppd</CODE>, que a trav&eacute;s del modem crear&aacute; un enlace
TCP/IP entre nuestro ordenador e Infovia. Una vez creado, podremos
contactar con nuestro "verdadero" proveedor, quien
nos abrir&aacute; las puertas a Internet, y a partir de ese momento ya podremos usar
cualquiera de nuestras propias aplicaciones habituales desde Linux.
Como complemento de <CODE>pppd</CODE> usaremos una utilidad <CODE>chat</CODE> que se encargara
de dialogar via modem con el ordenador remoto al comienzo de la llamada, mientras
se establece la conexi&oacute;n. Tambi&eacute;n intervendr&aacute;n varios ficheros de configuraci&oacute;n
(unos gen&eacute;ricos de Linux para cualquier conexi&oacute;n TCP/IP, otros caracter&iacute;sticos
de las conexiones a trav&eacute;s de PPP y modem, y por &uacute;ltimo alguno que usemos en el
caso concreto de Infov&iacute;a). Un detalle sobre versiones de software: un inconveniente
en la evoluci&oacute;n de Linux ha sido un cambio en la implementaci&oacute;n del PPP que hace
incompatible algunos <CODE>pppd</CODE> con algunas versiones del <EM>kernel</EM>. Si nuestro
n&uacute;cleo est&aacute; entre 1.2.13 y 1.3.95 debemos usar un pppd 2.1.2d o superior,
mientras que necesitaremos un pppd 2.2.0e o superior para los n&uacute;cleos m&aacute;s recientes.</P>
<P>El listado siguiente es un ejemplo del fichero principal de configuraci&oacute;n
de <CODE>pppd</CODE>, en el que a su vez se hace referencia a varios ficheros que
deberemos crear: identificaci&oacute;n y clave facilitada por el proveedor de
acceso, el gui&oacute;n de inicio de conexi&oacute;n, y el de cierre y cuelgue
del modem. <CODE>/dev/modem</CODE> es un enlace (un <EM>"symbolic link"</EM>) que
usaremos como nombre gen&eacute;rico para el modem, y que debe apuntar al nombre
del dispositivo real en el que lo tengamos conectado.</P>
<P><EM>/etc/ppp/options</EM>:
<HR>
<PRE>
  modem passive crtscts noipdefault defaultroute
  lock lcp-echo-interval 15 lcp-echo-failure 5 mtu 1500
  +ua /etc/ppp/infovia.pass
  connect &quot;/usr/sbin/chat -v -f /etc/ppp/infovia.chat&quot;
  disconnect &quot;/usr/sbin/chat -v -f /etc/ppp/infovia-off.chat&quot;
  /dev/modem 38400
</PRE>
<HR>
</P>
<P><CODE>/etc/ppp/infovia.pass</CODE> es un fichero con simplemente dos l&iacute;neas, una con
el login (identificaci&oacute;n de usuario) y otra con la clave. Para acceder a Internet
deberemos introducir en ambos casos lo que indique el proveedor, mientras
que si s&oacute;lo vamos a navegar por Infov&iacute;a (sin salir a Internet) es suficiente
con poner <CODE>infovia</CODE> como usuario gen&eacute;rico e <CODE>infovia</CODE> como clave.</P>
<P><CODE>/etc/ppp/infovia.chat</CODE> contiene el gui&oacute;n que utilizar&aacute; <CODE>chat</CODE> en su
di&aacute;logo con el modem. Un ejemplo de su contenido podr&iacute;a ser:</P>
<P>
<HR>
<PRE>
  TIMEOUT 6
  ABORT '\nBUSY\r'
  ABORT '\nNO ANSWER\r'
  ABORT '\nNO CARRIER\r'
  ABORT '\nRING\r\n\r\RING\r'
  ABORT '\nNO DIALTONE\r'
  ''    ATDP055
  'CONNECT'
</PRE>
<HR>
</P>
<P>En el ejemplo anterior se usa marcaci&oacute;n por pulsos. Si fuera por tonos
sustituir <CODE>ATDP</CODE> por <CODE>ATDT</CODE>. Adem&aacute;s, si al n&uacute;mero 055 de llamada a
Infov&iacute;a hubiera que a&ntilde;adir alg&uacute;n prefijo de centralita o cualquier otra
marcaci&oacute;n especial, no hay m&aacute;s que incluirlo en el listado. Por su parte
el de cierre de conexi&oacute;n y reseteo del modem ser&iacute;a algo as&iacute;:</P>
<P><EM>/etc/ppp/infovia-off.chat</EM>:
<HR>
<PRE>
  TIMEOUT 3
  ''    '\r'
  '\r'  '+++\c'
  '\r'  ATH0
  OK    ATH0
  OK
</PRE>
<HR>
</P>


<HR>
<A HREF="Spanish-Como-4.html">Anterior</A>
<A HREF="Spanish-Como-6.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc5">Indice</A>
</BODY>
</HTML>
