<HTML>
<HEAD>
<TITLE>Spanish Linux HOWTO: Distribuciones</TITLE>
</HEAD>
<BODY>
<A HREF="Spanish-Como-1.html">Anterior</A>
<A HREF="Spanish-Como-3.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Distribuciones</A></H2>


<P><EM>Extracto de la <CODE>Distributions-HOWTO</CODE> sobre distintas versiones de
Linux. Acuda a ella para ampliar informaci&oacute;n</EM></P>

<P>El &uacute;nico elemento com&uacute;n a todas las versiones Linux es su kernel -el
n&uacute;cleo del sistema operativo-, que se desarrolla de forma coordinada y con
actualizaciones sistem&aacute;ticas. Sin embargo todo sistema operativo necesita,
junto al n&uacute;cleo del sistema, todo un conjunto de utilidades y herramientas
de instalaci&oacute;n, configuraci&oacute;n y uso. Ah&iacute; juegan su papel las diferentes
distribuciones: algunos particulares, entidades y empresas se dedican a
hacer determinadas recopilaciones de software que ellos mismos preparan
para que sean facilmente instalables y configurables. Todas ellas facilitan
el software junto a su c&oacute;digo fuente, pero la flexible licencia GNU
a la que se acojen permite tanto ofrecerlas gratuitamente como distribuirlas
por canales comerciales (lo que se paga es el trabajo de recopilaci&oacute;n, el software
de cosecha propia que pueda aportar, una presentaci&oacute;n m&aacute;s elaborada, gastos de
distribuci&oacute;n y soporte t&eacute;cnico al usuario).</P>
<P>Algunas de las distribuciones m&aacute;s conocidas son:</P>
<P>
<DL>

<DT><B>Slackware</B><DD><P>Esta distribucion es quizas de las m&aacute;s
extendidas en todo el mundo y la m&aacute;s conocida en Espa&ntilde;a, ya que es la que han
divulgado las publicaciones del sector. Incluye con creces todo el
software que cualquier usuario medio o avanzado pueda necesitar, y su m&eacute;todo de instalaci&oacute;n
es asequible aunque lejos de las t&iacute;picas y vistosas instalaciones a las que
el usuario ne&oacute;fito esta acostumbrado en los sistemas comerciales.
Tiene diversos derivados comercializados bajo diferentes nombres (por ej. "Slackware Pro")
que mejoran la instalaci&oacute;n e incluyen manuales y bibliograf&iacute;a en
un &uacute;nico lote. Esta en todos los FTPs principales, siendo 
<A HREF="http://www.cdrom.com/">http://www.cdrom.com/</A> su distribuidor de origen.</P>

<DT><B>Red Hat</B><DD><P>Creada por Red Hat Software, en Connecticut, EE.UU. Una de
sus ventajas es el atractivo sistema de instalaci&oacute;n (en modo gr&aacute;fico) y el
c&oacute;modo mantenimiento de componentes de software, lo que facilita
enormemente las tan frecuentes actualizaciones. Se puede obtener tanto
gratuitamente en la red como adquiriendo el CDROM correspondiente. Otras
empresas comercializan tambi&eacute;n sistemas basados en Red Hat, como Caldera
Inc. y Pacific Hi-Tech. A&uacute;n poco conocida en Espa–a pero pujante, sobre
todo para principiantes. Sus creadores estan en 
<A HREF="http://www.redhat.com">http://www.redhat.com</A>. El mencionado sistema de gesti&oacute;n de componentes
de software es obra suya, pero lo han ofrecido con car&aacute;cter abierto y gratuito
a los dem&aacute;s desarrolladores bajo la licencia de GNU, por lo que es previsible que en el futuro otros
muchos asuman este sistema en sus propias distribuciones, lo que facilitar&aacute;
enormemente las actualizaciones.</P>

<DT><B>Debian</B><DD><P>La Free Software Fundation (FSF) es bien conocida entre los
ac&eacute;rrimos usuarios de software gratuito para Unix. Son los creadores del
sistema <B>GNU</B>, su futuro Unix gratuito. Ya hay mucho material pero no
un sistema operativo completo, asi que mientras tanto ofrecen un Unix integrado
por el nucleo de Linux y el software de GNU. 
<A HREF="http://www.debian.org">http://www.debian.org</A>.</P>

</DL>
</P>

<HR>
<A HREF="Spanish-Como-1.html">Anterior</A>
<A HREF="Spanish-Como-3.html">Siguiente</A>
<A HREF="Spanish-Como.html#toc2">Indice</A>
</BODY>
</HTML>
