<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
	<META NAME="CREATED" CONTENT="20000915;1222406">
	<META NAME="CHANGED" CONTENT="16010101;0">
	<STYLE>
	<!--
		@page { size: 21.59cm 27.94cm; margin-left: 3.18cm; margin-right: 3.18cm; margin-top: 1.27cm; margin-bottom: 1.27cm }
	-->
	</STYLE>
</HEAD>
<BODY>
<DIV TYPE=HEADER>
	<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
	<BR>
	</P>
</DIV>
<P STYLE="margin-bottom: 0cm">Una Breve Historia del 'Hackerismo'.</P>
<P STYLE="margin-bottom: 0cm">por Eric S. Raymond</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">Yo explore los or&iacute;genes de la
cultura 'hacker', incluida la prehistoria</P>
<P STYLE="margin-bottom: 0cm">de los 'Aut&eacute;nticos
Programadores', los d&iacute;as de gloria del Laboratorio de
Inteligencia Artificial del MIT, y como la precoz ARPANET nutri&oacute;
el primer 'pa&iacute;s en la red'. Nubes tormentosas sobre J&uacute;piter.
 Yo describ&iacute; la antigua ascensi&oacute;n y el anquilosamiento
final de Unix, la nueva esperanza desde Finlandia, y como 'el &uacute;ltimo
'hacker' verdadero' volvi&oacute; como el patriarca de la siguiente
generaci&oacute;n. Yo narre la manera en que Linux y el liderazgo de
opini&oacute;n de Internet trajo a la cultura 'hacker' desde la
periferia del conocimiento p&uacute;blico a su importancia actual.</P>
<P STYLE="margin-bottom: 0cm">	</P>
<P STYLE="margin-bottom: 0cm">1. Prologo: Los 'Aut&eacute;nticos
Programadores'.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">Al principio, hab&iacute;a 'Aut&eacute;nticos
Programadores'.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">No es que se autodenominaran as&iacute;.
Tampoco se llamaban a si mismos 'hackers', o de otra forma
particular. El soniquete de 'Aut&eacute;nticos Programadores' no fue
acu&ntilde;ado, posteriormente por uno de ellos, hasta despu&eacute;s
de 1.980. Pero desde 1.945 hacia delante, la tecnolog&iacute;a de la
inform&aacute;tica atrajo muchas de las mentes mas brillantes y
creativas del mundo. Desde el primer ordenador ENIAC de Eckert y
Mauchly hacia delante, hab&iacute;a mas o menos una cultura t&eacute;cnica
continua y autoconsciente de programadores entusiastas. Gente que
construyo y jugo con el software por diversi&oacute;n.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">Los 'Aut&eacute;nticos Programadores'
salieron por lo general del campo de la ingenier&iacute;a o de la
f&iacute;sica. Desde luego eran radio aficionados. Llevaban
calcetines blancos, camisas de poliester, corbatas y gruesas gafas;
codificaban en c&oacute;digo maquina, ensamblador, FORTRAN y una
media docena de viejisimos lenguajes ahora olvidados.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">Desde el final de la Segunda Guerra
Mundial hasta principio de los 70, en los grandes d&iacute;as de la
inform&aacute;tica por lotes y los gigantescos 'mainframes' de acero,
los 'Aut&eacute;nticos Programadores' eran los dominantes de la
cultura t&eacute;cnica en inform&aacute;tica. Algunas de las piezas
reverenciadas del folclore 'hacker' pertenecen a esta era, incluyendo
varias listas de Leyes de Murphy y el p&oacute;ster en seudoaleman
&quot;Blinkenlights&quot; que aun adorna muchas salas de
computadoras.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">Algunas personas que se criaron en la
cultura de los 'Aut&eacute;nticos Programadores' permanecen activos
en los 90. Seymour Cray, dise&ntilde;ador de la l&iacute;nea de
superordenadores CRAY, estuvo entre los mejores, cont&oacute; una vez
que tecleo un sistema operativo completo, de su propio dise&ntilde;o
dentro de una computadora de su propio dise&ntilde;o a trav&eacute;s
del teclado de su panel frontal. En octal. Sin un error. Y funciono.
'Macho Supremo' de los 'Aut&eacute;nticos Programadores'.</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">La cultura 'Aut&eacute;nticos
Programadores', sin embargo, estaba muy asociada con  inform&aacute;tica
'batch' (y especialmente 'batch' cient&iacute;fico). Fue finalmente
eclipsada por el surgimiento de la inform&aacute;tica interactiva,
las universidades y las redes de ordenadores. Estos dieron a luz  a
otra tradici&oacute;n de ingenier&iacute;a que, finalmente,
evolucionar&iacute;a a la actual cultura 'hacker' de fuente abierta
(open-source).</P>
<P STYLE="margin-bottom: 0cm"> 
</P>
<P STYLE="margin-bottom: 0cm">2. Los Primeros 'Hackers'</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
<P STYLE="margin-bottom: 0cm">El comienzo de la cultura 'hacker' tal
como la conocemos hoy puede ser convenientemente datada en 1.961, el
a&ntilde;o que el MIT adquiri&oacute; el primer PDP-1. El comit&eacute;
de energ&iacute;a y se&ntilde;ales del Club T&eacute;cnico de
Maquetas de Ferrocarril del MIT adopto la maquina como su juguete
tecnol&oacute;gico favorito e invento, herramientas de programaci&oacute;n,
argot y una completa cultura adicional,  que aun hoy es identificable
con nosotros. Esos primeros a&ntilde;os han sido examinados en la
primera parte del libro de Steven Levy, <FONT COLOR="#000000"><I>Hackers</I><SPAN STYLE="font-weight: medium"><SPAN STYLE="text-decoration: none"><SPAN STYLE="font-style: normal"><FONT SIZE=3><FONT FACE="Roman 10cpi, monospace">.</FONT></FONT></SPAN></SPAN></SPAN></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>La
cultura de computadoras del MIT parece haber sido la primera en
adoptar el termino 'hacker'. Los 'Hackers' del Club T&eacute;cnico de
Maquetas de Ferrocarril se convirtieron en el n&uacute;cleo del
Laboratorio de Inteligencia Artificial del MIT. El centro mas
importante del mundo de investigaci&oacute;n en IA en los primeros
80. Y su influencia fue mucho mas amplia despu&eacute;s de 1.969, el
primer a&ntilde;o de ARPANET.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>ARPANET
fue la primera red de computadoras de alta velocidad,
transcontinental. Fue construida por el Departamento de Defensa como
un experimento en comunicaciones digitales. pero creci&oacute; hasta
enlazar juntas cientos de universidades, contratistas de Defensa y
laboratorios de investigaci&oacute;n. Permiti&oacute; a los
investigadores de cualquier lugar intercambiar informaci&oacute;n con
una velocidad y flexibilidad sin precedentes, dando un enorme empuje
al trabajo colaborativo e incrementando tremendamente el ritmo y la
intensidad del avance tecnol&oacute;gico.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Pero
ARPANET tambi&eacute;n hizo algo muy bien. Su autopista electr&oacute;nica
aglutino una masa critica de 'hackers' por todos los EE.UU.; en vez
de permanecer en peque&ntilde;os grupos aislados cada uno
desarrollando sus propias y ef&iacute;meras culturas locales, se
descubrieron (o reinventaron) a si mismos como una tribu
interconectada.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm"><SPAN STYLE="font-weight: medium"><SPAN STYLE="text-decoration: none"><FONT SIZE=3><FONT FACE="Roman 10cpi, monospace"><FONT COLOR="#000000"><SPAN STYLE="font-style: normal">Los
primeros objetos intencionados de la cultura 'hacker' - la primera
lista del argot, las primeras s&aacute;tiras, las primeras
discusiones autoconscientes de la &eacute;tica 'hacker' - fueron
propagados en la ARPANET en sus primeros a&ntilde;os. En particular
la primera versi&oacute;n del Fichero de Jerga, desarrollado como una
colaboraci&oacute;n cruzada durante el periodo 1.973 - 1.975. Este
diccionario de argot llego a ser uno de los documentos definitorios
de la cultura. Fue finalmente publicado como </SPAN><I>The New
Hacker&acute;s Dictionary</I><SPAN STYLE="font-style: normal">.</SPAN></FONT></FONT></FONT></SPAN></SPAN></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>El
'hackerismo' floreci&oacute; en las universidades conectadas a la
red, especialmente (pero no exclusivamente) en sus departamentos de
ciencia de la inform&aacute;tica. El laboratorio de IA del MIT fue el
primero entre pares desde los &uacute;ltimos a&ntilde;os 60. Pero el
Laboratorio de Inteligencia Artificial de Stanford (SAIL) y la
Universidad Carnegie-Mellon (CMU) han llegado ha tener casi la misma
importancia. En todas fueron prosperando centros de ciencia de la
inform&aacute;tica e investigaci&oacute;n en IA. Todas atrajeron
gente brillante que contribuyeron con grandes cosas al 'hackerismo',
tanto en el nivel t&eacute;cnico como folcl&oacute;rico.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Sin
embargo, para entender lo que llego mas tarde, necesitamos echar otro
vistazo a los computadoras; porque el ascenso de Lab y su eventual
ca&iacute;da, fue conducido por las oleadas de cambio en la
tecnolog&iacute;a inform&aacute;tica.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Desde
los d&iacute;as del PDP-1 la fortuna del 'hackerismo' ha sido tejida
junto con la serie de miniordenadores PDP de Digital Equipment
Corporation. DEC estuvo en la vanguardia de la inform&aacute;tica
interactiva comercial y los sistemas operativos de tiempo compartido.
Debido a que sus maquinas eran flexibles, potentes y relativamente
baratas para la &eacute;poca, montones de universidades las
compraron.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Tiempo
compartido barato, fue el medio en el que creci&oacute; la cultura
'hacker', y en la mayor parte de su vida ARPANET fue principalmente
una red de maquinas DEC. La mas importante de estas fue la PDP-10,
comercializada en 1.967. la 10 permaneci&oacute; como la maquina
favorita del 'hackerismo' durante casi 50 a&ntilde;os; TOPS-10 (el
sistema operativo de DEC para la maquina) y MACRO-10 (su ensamblador)
aun son recordados con nost&aacute;lgico cari&ntilde;o en gran parte
del argot y el folclore.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>En
el MIT, a pesar de usar el mismo PDP-10 que todo los dem&aacute;s,
cogieron un camino ligeramente diferente; ellos rechazaron totalmente
el software para el PDP-10 de DEC y construyeron su propio sistema
operativo, el fabuloso ITS.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>ITS
significaba 'Incompatible Tiemesharing System' (Sistema de tiempo
compartido incompatible) lo cual da un buen ejemplo de la actitud de
los 'hackers' del MIT. Ellos lo quer&iacute;an a su manera.
Afortunadamente para todos, la gente del MIT ten&iacute;an la
inteligencia igualada con su arrogancia. ITS, a pesar de que siempre
fue raro, exc&eacute;ntrico y ocasionalmente err&oacute;neo, hospedo
una brillante serie de innovaciones t&eacute;cnicas y aun podr&iacute;a
decirse que mantiene el r&eacute;cord del sistema de tiempo
compartido de  uso continuado mas largo.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>ITS
se escribi&oacute; en ensamblador, pero muchos proyectos ITS fueron
escritos en el lenguaje de IA LISP. LISP era bastante mas potente y
flexible que cualquier otro lenguaje de su tiempo; de hecho, esta aun
mejor dise&ntilde;ado que muchos de los lenguajes de hoy, veinticinco
a&ntilde;os despu&eacute;s. LISP facilito a los 'hackers' de ITS
pensar de forma creativa e inusual. Fue un importante factor de su
&eacute;xito, y permanece como uno de los lenguajes favoritos del
'hackerismo'.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Muchas
de las creaciones t&eacute;cnicas de la cultura ITS, permanecen vivas
hoy; el programa editor EMACS es quiz&aacute;s el mas conocido. Y
mucho del folclore ITS esta aun vivo en los 'hackers', como uno puede
ver en el Fichero de Jerga.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>SAIL
y CMU no estuvieron dormidos, ninguna de las dos. Muchos de los
lideres de los 'hackers' crecieron alrededor del PDP-10 de SAIL,
despu&eacute;s llegaron a ser figuras clave en el desarrollo de la
ordenador personal y de los actuales interfaces de software
ventana/icono/rat&oacute;n. Mientras tanto los 'hackers' en CMU
estaban haciendo el trabajo que pudo encabezar la primera practica a
gran escala de aplicaciones rob&oacute;ticas industriales y de
sistemas expertos .</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Otro
importante nodo de la cultura fue XEROX PARC, el famoso Palo Alto
Research Center (Centro de Investigaci&oacute;n Palo Alto). Por mas
de una d&eacute;cada, desde los primeros 70, hasta mitad de los 80,
PARC produjo un asombroso volumen de originales innovaciones de
hardware y software. El moderno rat&oacute;n, la interface de
software con ventanas e iconos, fueron inventados all&iacute;.
Tambi&eacute;n la impresora l&aacute;ser y la red de &aacute;rea
local; y la serie de maquinas D de PARC anticiparon una d&eacute;cada
la potencia de la computadora personal de los 80. Lamentablemente, no
fueron profetas en su propia compa&ntilde;&iacute;a; tanto que llego 
ha haber un chiste que describ&iacute;a PARC como un lugar
caracterizado por el desarrollo de brillantes ideas para todos los
dem&aacute;s. Su influencia en el 'hackerismo' fue generalizada.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Las
culturas de ARPANET y del PDP-10 crecieron en fuerza y variedad
durante los 70. Las facilidades para las listas de correo electr&oacute;nico
que hab&iacute;an sido utilizadas para fomentar la cooperaci&oacute;n
entre grupos de inter&eacute;s a trav&eacute;s de los continentes,
fue incrementandose tambi&eacute;n con el uso para prop&oacute;sitos
mas sociales y recreativos. DARPA hizo la vista gorda a todas las
actividades t&eacute;cnicamente 'no autorizadas'; Comprendieron que
la sobrecarga extra era un peque&ntilde;o precio a pagar por atraer
una generaci&oacute;n completa de gente brillante hacia el campo de
la inform&aacute;tica.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Quiz&aacute;s
la mas conocida de las listas de correo 'sociales' de ARPANET fue la
lista SF-LOVERS, para los forofos de la ciencia ficci&oacute;n; aun
hoy permanece muy activa, de hecho, en la gran 'Internet' en la que
se transformo ARPANET. Pero hubo muchos otros, pioneros de un estilo
de comunicaci&oacute;n que mas tarde pudo ser comercializado para
servicios de tiempo compartido, como Compuserve, GEnie y Prodigy ( y
mas tarde dominados por AOL).</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>3.
El ascenso de UNIX</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Mientras
tanto, sin embargo, fuera en las tierras v&iacute;rgenes de New
Jersey, en alguna parte ha estado llegando desde 1969 que pod&iacute;a
hacer sombra a la tradici&oacute;n de PDP-10. El a&ntilde;o del
nacimiento de ARPANET fue tambi&eacute;n el a&ntilde;o que un
'hacker' de Bell Labs llamado Ken Thompson invento UNIX.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Thompson
hab&iacute;a estado metido con el trabajo de desarrollo de un sistema
operativo de tiempo compartido llamado Multics, el cual compart&iacute;a
ancestros comunes con ITS. Multics fue un artefacto de pruebas para
algunas importantes ideas acerca de como la complejidad de un sistema
operativo pod&iacute;a ocultarse dentro de &eacute;l, invisible al
usuario, e incluso a la mayor&iacute;a de los programadores. La idea
era hacer el uso desde fuera de Multics (y programar para el) mucho
mas simple, para que el trabajo mas real pudiera realizarse.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Los
Bell Labs salieron del proyecto cuando Multics mostr&oacute; signos
de hinchaz&oacute;n a un inservible elefante blanco (el sistema fue
promocionado comercialmente posteriormente por Honeywell pero nunca
llego a triunfar). Ken Thompson perdi&oacute; el entorno Multics, y
comenz&oacute; a probar una implementacion de esas ideas y algunas
propias sobre un DEC PDP-7 desahuciado.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Otro
'hacker' llamado Dennis Ritchie invento un nuevo lenguaje llamado 'C'
 para usar bajo el embrionario Unix de Thompson. Como Unix, 'C' fue
dise&ntilde;ado para ser agradable, &quot;no cautivo&quot; y
flexible. El inter&eacute;s por estas herramientas se extendi&oacute;
a los Bell Labs, y ellos consiguieron un respaldo en 1971 cuando
Thompson y Ritchie consiguieron una oferta para producir lo que
llamar&iacute;amos un sistema de automatizaci&oacute;n de oficinas,
para uso interno. Pero Thompson y Ritchie ten&iacute;an puesto el ojo
en algo mas grande.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Tradicionalmente
los sistemas operativos han sido escritos estrictamente en
ensamblador, para conseguir sacar la mayor eficiencia posible de sus
maquinas 'Hosts'. Thompson y Ritchie fueron entre los primeros en
darse cuenta que la tecnolog&iacute;a del hardware y el compilador
eran lo suficientemente buenos como para que pudiera escribirse un
sistema operativo completo en 'C', y por 1974 el entorno completo
hab&iacute;a sido satisfactoriamente portado a muchas maquinas de
diferentes tipos.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Esto
no hab&iacute;a ocurrido nunca anteriormente, y las implicaciones
fueron enormes. Si Unix pod&iacute;a presentar el mismo aspecto, las
mismas capacidades en maquinas de muy diferentes tipos, esto pod&iacute;a
servir como un entorno de desarrollo para todas ellas. Nunca mas los
usuarios tendr&iacute;an que pagar por un dise&ntilde;o completo de
nuevo software cada vez que una maquina quedara obsoleta. Los
'hackers' pod&iacute;an portar sus conjuntos de herramientas entre
diferentes maquinas, en vez de tener que reinventar el equivalente
del fuego y la rueda cada vez.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Junto
a la portabilidad, Unix y 'C' ten&iacute;an tambi&eacute;n otras
fortalezas importantes. Ambos estaban construidos bajo la filosof&iacute;a
'Mantelo simple, est&uacute;pido'. Un programador pod&iacute;a
f&aacute;cilmente mantener la estructura l&oacute;gica completa de
'C' en su cabeza (no como otros lenguajes anteriores o posteriores)
antes que necesitar consultar el manual constantemente; y Unix estaba
estructurado como un flexible kit de herramientas de programas
simples dise&ntilde;ados para combinarse entre ellos de manera
practica.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>La
combinaci&oacute;n demostr&oacute; ser adaptable a una amplia
variedad de tareas inform&aacute;ticas, incluyendo muchas
completamente imprevistas por los dise&ntilde;adores. Se esparci&oacute;
muy r&aacute;pidamente dentro de AT&amp;T, a pesar de la ausencia de
cualquier programa de soporte formal para el. Por 1980 se hab&iacute;a
extendido a un amplio numero de universidades y lugares de
investigaci&oacute;n inform&aacute;tica, y miles de 'hackers' lo
consideraron su sede.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Las
maquinas que hicieron de caballo de tiro de la primera cultura Unix
fue el PDP-11 y su descendiente el VAX. Pero, gracias a la
portabilidad de Unix, funcionaba sobre la amplia variedad de maquinas
que uno pod&iacute;a encontrar en la totalidad de ARPANET sin cambios
sustanciales. Y nadie uso ensamblador; los programas en C fueron
facilmante portados a todas esas maquinas.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Unix
hasta tenia su propio sistema de redes, del tipo UUCP: Baja velocidad
y poco fiable, pero barato. Dos maquinas Unix cualquiera pod&iacute;an
intercambiar correo electr&oacute;nico punto-a-punto sobre l&iacute;neas
de tel&eacute;fono normales y corrientes; esta capacidad estaba
construida dentro del sistema, no como un extra opcional. En 1980 el
primer sitio USENET comenz&oacute;  el intercambio de noticias,
formando un gigantesco tabl&oacute;n de anuncios distribuido que
crecer&iacute;a r&aacute;pidamente mas grande que ARPANET. Los sitios
Unix comenzaron a formar su propio 'pa&iacute;s en la red' alrededor
de USENET.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>As&iacute;
mismo algunos sitios Unix estaban en ARPANET. Las culturas PDP-10 y
Unix/USENET comenzaron a encontrarse y entremezclarse en los bordes,
pero no se mezclaron muy bien al principio. Los 'hackers' del PDP-10
tend&iacute;an a considerar a la legi&oacute;n Unix un grupo de
advenedizos, empleando herramientas que parec&iacute;an rid&iacute;culamente
primitivas cuando se comparaban con las barroca y encantadora
complejidad de LISP y ITS. &quot;Cuchillos de piedra y pieles de
oso!&quot; murmuraban.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Y
todav&iacute;a hubo un tercera corriente que broto. Los primeros
ordenadores personales se vendieron en 1975; Apple se fundo en 1977,
y progresaron llegando con una casi incre&iacute;ble rapidez en la
creaci&oacute;n de j&oacute;venes y deslumbrantes 'hackers'. Su
lenguaje fue BASIC, tan primitivo que tanto los partisanos de PDP-10
y los aficionados de Unix los consideraban, con desd&eacute;n,
inferiores.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>4.
El fin de los viejos d&iacute;as</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>De
este modo se llego a 1980; tres culturas, solapadas en los bordes
pero agrupadas alrededor de tecnolog&iacute;as muy diferentes. La
cultura ARPANET/PDP-10 emparejada a LISP, MACRO, TOPS-10, ITS y SAIL.
La legi&oacute;n Unix y C con sus PDP-11,  sus VAX y las diminutas
conexiones telef&oacute;nicas. Y una an&aacute;rquica horda de
primerizos entusiastas de la microinform&aacute;tica inclinados a
llevar el poder de la inform&aacute;tica al pueblo.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>En
medio de esto, la cultura ITS pod&iacute;a aun pretender ser el
orgullo del lugar. Pero nubes tormentosas estaban acumul&aacute;ndose
sobre el Lab. La tecnolog&iacute;a del PDP-10, de la cual depend&iacute;a
ITS , estaba envejeciendo, y el propio Lab estaba escindido en bandos
por el primer intento de comercializaci&oacute;n de la Inteligencia
Artificial. Algunos de los mejores del Lab ( y de SAIL y de CMU)
estaban siendo tentados fuera con altos salarios en nuevas compa&ntilde;&iacute;as.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>El
golpe mortal llego en 1983, cuando DEC cancelo su proyecto
consecutivo del PDP-10, 'J&uacute;piter', con el prop&oacute;sito de
concentrarse en las l&iacute;neas PDP-11 y VAX. ITS no tenia un gran
futuro. Puesto que no era portable, supon&iacute;a mas esfuerzo del
que cualquiera pod&iacute;a permitirse trasladar ITS al nuevo
hardware. La variante de Unix de Berkeley, corriendo en un VAX se
convirti&oacute; en el sistema de hackeo por excelencia, y cualquiera
con un ojo puesto en el futuro pod&iacute;a ver que la
microinform&aacute;tica estaba imponi&eacute;ndose en el poder tan
r&aacute;pidamente que muy probablemente barrer&iacute;a a todos los
anteriores a ella.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Fue
alrededor de ese tiempo que Levy escribi&oacute; 'hackers'. Uno de
sus primeras fuentes fue Richard M. Stallman (inventor de EMACS), una
figura destacada en el Laboratorio y su m&aacute;s fan&aacute;tico
defensor en demorar la comercializaci&oacute;n de la Tecnolog&iacute;a
del Laboratorio.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Stallman
(que es conocido com&uacute;nmente por sus siglas y su nombre de
login, RMS) continuo con la formaci&oacute;n de la Free Software
Foundation (Fundaci&oacute;n del Software Libre) y el mismo se dedico
a producir software libre de alta calidad. Levy lo alabo como &quot;el
&uacute;ltimo 'hacker' verdadero&quot;, una afirmaci&oacute;n que
felizmente demostr&oacute; ser incorrecta.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>El
plan m&aacute;s magnifico de Stallman, encarno n&iacute;tidamente la
transici&oacute;n que experiment&oacute; el 'Hackerismo' en los
primeros a&ntilde;os ochenta. &Eacute;l comenz&oacute; la
construcci&oacute;n en 1982 de un clon completo de Unix, escrito en C
y de libre disposici&oacute;n . Su proyecto fue conocido como sistema
operativo GNU (Gnu's Not Unix), en una especie de acr&oacute;nimo
recursivo. GNU lleg&oacute; r&aacute;pidamente a ser un foco
importante para la actividad 'hacker'. De esta forma, el esp&iacute;ritu
y la tradici&oacute;n de ITS se conserv&oacute; como una parte
importante de lo  m&aacute;s nuevo, la cultura 'hacker' centrada en
Unix y VAX.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Efectivamente,
durante m&aacute;s de una d&eacute;cada despu&eacute;s de su
fundaci&oacute;n la Free Software Foundation de RMS definir&iacute;a
la mayor parte de la ideolog&iacute;a p&uacute;blica de la cultura
'hacker', y el mismo Stallman seria el &uacute;nico aspirante cre&iacute;ble
al liderazgo de la tribu.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Fue
tambi&eacute;n alrededor 1982-83 que las tecnolog&iacute;as del
microhip y de la red de &aacute;rea local comenzaron a tener un serio
impacto sobre el 'Hackerismo'. Ethernet y el microchip Motorola 68000
generaron una combinaci&oacute;n potencialmente poderosa, y se hab&iacute;an
creado varias 'startups' diferentes para construir la primera
generaci&oacute;n de lo qu&eacute; nosotros llamamos ahora estaciones
de trabajo.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>En
1982, un grupo de 'hackers' Unix de Standford y Berkeley fund&oacute;
Sun Microsystem en la convicci&oacute;n de que Unix funcionando sobre
el relativamente barato hardware basado en el Motorola 68000
demostrar&iacute;a ser una combinaci&oacute;n ganadora para una
amplia variedad de aplicaciones. Tuvieron raz&oacute;n, y su visi&oacute;n
sent&oacute; el modelo para una industria entera. A pesar de que
todav&iacute;a manten&iacute;an un precio fuera de alcance de la
mayor&iacute;a de los particulares, las &#145;workstations&#146;
(estaciones de trabajo) eran baratas para las corporaciones y las
universidades; las redes de &#145;workstations&#146; (uno por
usuario) reemplazaron r&aacute;pidamente a los VAX m&aacute;s viejos
y otros sistemas de tiempo compartido.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>5.
La Era del Unix propietario.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Alrededor
de 1984, cuando Mami Bell fue desmenbrada y Unix lleg&oacute; a ser,
por primera vez, un producto soportado de AT&amp;T, la l&iacute;nea
mas importante de divisi&oacute;n en el 'Hackerismo' estuvo entre un
relativamente coherente 'pa&iacute;s en la red' centrado alrededor de
Internet y USENET (mayormente usando m&aacute;quinas del tipo de los
miniordenadores - o estaciones de trabajo que corr&iacute;an Unix), y
un extenso territorio desconectado de entusiastas de los
microordenadores.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Fue
tambi&eacute;n por aquella &eacute;poca en que los primeros episodios
serios de craqueo fueron cubiertos en la prensa de masas y un
periodista comenz&oacute; a malversar el t&eacute;rmino 'hacker' para
referirse a v&aacute;ndalos de los ordenadores, un ultraje que
contin&uacute;a hasta nuestros d&iacute;as.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>La
estaciones de trabajo -el tipo de ordenadores construidos por Sun y
otros- abrieron nuevos mundos para los 'hackers'. Estaban hechas
especialmente para gr&aacute;ficos de alto rendimiento y comunicaci&oacute;n
de datos compartidos sobre una red. Durante la d&eacute;cada de 1980
el 'Hackerismo' estaba preocupado por el reto de conseguir del
software y las herramienta de construcci&oacute;n mas usos aparte de
esas caracter&iacute;sticas. El Unix desarrollado por Berkeley
incorporaba soporte para los protocolos de ARPANET, ofreciendo una
soluci&oacute;n a los problemas del networking asociado con los
lentos enlaces punto-a-punto del UUCP  y adicionalmente impulso el
crecimiento de Internet.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Hubo
varios intentos de domar las &#145;workstations&#146; gr&aacute;ficas
. El &uacute;nico que prevaleci&oacute; fue el sistema de ventana X ,
desarrollado en el MIT con contribuciones de centenares de individuos
en docenas de compa&ntilde;&iacute;as. Un factor cr&iacute;tico en su
&eacute;xito fue que los desarrolladores de X estuvieron dispuestos a
dar el c&oacute;digo original gratis seg&uacute;n la &eacute;tica
'hacker', y pudieron distribuirlo sobre Internet. La victoria de X
sobre los sistemas gr&aacute;ficos patentados (incluyendo uno
ofrecido por la misma Sun) fue un importante presagio de los cambios
que, unos a&ntilde;os mas tarde, afectar&iacute;an profundamente al
mismo Unix.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Hab&iacute;a
una pizca de partidismo visceral que aun descargaba ocasionalmente en
la rivalidad ITS/Unix (mayormente desde el lado de los ex-usuarios de
ITS). Pero la m&aacute;quina ITS paro para siempre en 1990; los
fan&aacute;ticos ya no ten&iacute;an un sitio para resistir y la gran
mayor&iacute;a fue asimilada en la cultura Unix con diversos grados
de refunfu&ntilde;adura.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Dentro
del 'Hackerismo' interconectado, la gran rivalidad de la d&eacute;cada
de los 80 estuvo entre los entusiastas de las versiones del Unix de
Berkeley y los de AT&amp;T. A veces te puedes encontrar todav&iacute;a
copias de un cartel de aquella &eacute;poca, mostrando un
caricaturizado caza rebelde de la pel&iacute;cula &quot;La Guerra de
Las Galaxias&quot; que pasa como un rayo sobre la explosi&oacute;n de
 la &quot;Estrella De La Muerte&quot; decorada con el logo de AT&amp;T.
Los 'hackers' de Berkeley se ve&iacute;an a s&iacute; mismos como
rebeldes contra los imperios corporativos desalmados. EL Unix de AT&amp;T
nunca alcanzo al de BSD/Sun en el mercado, pero gan&oacute; las
guerra de los 'standards'. Hacia 1990 las versiones de AT&amp;T y BSD
llegaron a ser m&aacute;s dif&iacute;ciles de diferenciar, habiendo
adoptado cada uno muchas de las innovaciones del otro.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Al
comienzo de la d&eacute;cada de los 90, la tecnolog&iacute;a de la
&#145;workstation&#146; de la d&eacute;cada anterior comenzaba a
verse claramente amenazada por los nuevos ordenadores personales ,de
bajo costo y alto rendimiento basados en el chip Intel 386 y sus
descendientes. Por primera vez, los 'hackers' particulares pod&iacute;an
permitirse tener m&aacute;quinas dom&eacute;sticas comparables en
capacidad de almacenamiento y potencia a las miniordenadores de diez
a&ntilde;os antes; maquinas Unix capaces de soportar un entorno
completo de desarrollo y conectadas a Internet.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>El
mundo MSDOS permaneci&oacute; felizmente ignorante de todo esto.
Aunque esos precoces entusiastas de los microordenadores se
expandieron r&aacute;pidamente hacia una poblaci&oacute;n de
'hackers' DOS y Mac algunas ordenes de magnitud mas grandes que la
cultura del 'pa&iacute;s en la red', ellos nunca se transformaron en
una cultura autoconsciente. El ritmo del cambio fue tan r&aacute;pido
que cincuenta culturas t&eacute;cnicas diferentes crecieron y
murieron tan r&aacute;pidamente como mascas ef&iacute;meras, sin
lograr la estabilidad necesaria para desarrollar una tradici&oacute;n
com&uacute;n de jerga, folklore e historia m&iacute;tica. La ausencia
de una red realmente penetrante comparable a UUCP o Internet les
impidi&oacute; llegar a ser un 'pa&iacute;s en la red'.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>El
acceso comercial generalizado a servicios en l&iacute;nea como
CompuServe y</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>GEnie
comenzaba a tener apoyo, pero el hecho que los sistemas operativos no
Unix no ven&iacute;an empaquetados con herramientas de desarrollo
significaba que muy poco c&oacute;digo propio se intercambio entre
ellos. De este modo, no se  desarrollo ninguna tradici&oacute;n de
hacking cooperativo.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>La
corriente principal del 'Hackerismo', (des)organizada en torno a
Internet y por ahora identificada mayormente con la cultura t&eacute;cnica
Unix, no se intereso por los servicios comerciales.  Ellos quer&iacute;an
mejores herramientas y m&aacute;s Internet, y los ordenadores
personales de 32 bits baratos promet&iacute;an poner ambas cosas al
alcance de todos.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>&iquest;Pero
donde estaba el software? Los Unix comerciales permanec&iacute;an
caros, en</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>el
rango de varios miles de d&oacute;lares. Al comienzo de los 90 varias
compa&ntilde;&iacute;as se lanzaron a la venta de Unix AT&amp;T o BSD
portados a m&aacute;quinas del tipo PC. El &eacute;xito era
escurridizo, los precios no bajaron mucho, y (lo peor de todo) no
pod&iacute;as modificar y redistribuir las fuentes del sistema
operativo. El modelo tradicional del negocio del software no dio a
los 'hackers' lo qu&eacute; ellos quer&iacute;an.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Tampoco
fue la Fundaci&oacute;n Libre de Software. El desarrollo de HURD, el
n&uacute;cleo de Unix libre, largamente prometido por RMS, para
'hackers', qued&oacute; atascado durante a&ntilde;os y fracaso en
producir algo parecido a un n&uacute;cleo &uacute;til hasta 1996
(aunque por el 1990 la FSF suministro casi todas las partes dif&iacute;ciles
de un sistema operativo tipo Unix).</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Aun
peor, al comienzo de los 90 llego a ser claro que diez a&ntilde;os de
esfuerzo en la comercializaci&oacute;n de un Unix patentado
terminar&iacute;a en el fracaso. La promesa Unix de una plataforma
cruzada de portabilidad se perdi&oacute; en la ri&ntilde;a entre
media docena de versiones  patentadas de Unix. Los actores del Unix
patentado demostraron ser tan pesados, tan ciegos, y tan ineptos en
la comercializaci&oacute;n que Microsoft fue capaz de echar el guante
a una gran parte de su mercado con la tecnolog&iacute;a
espantosamente inferior de su sistema operativo Windows.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Al
principio de 1993, un observador enemigo podr&iacute;a haber tenido
fundamentos para pensar que la historia del Unix  se jug&oacute; casi
fuera, y con la suerte de la tribu 'hacker'. Y no hab&iacute;a
escasez de observadores enemigos en la prensa inform&aacute;tica
comercial, muchos de los que hab&iacute;an pronosticado la muerte
inminente de Unix a intervalos regulares de seis meses desde los
&uacute;ltimos 70.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>En
esos d&iacute;as la creencia generalizada era que la &eacute;poca del
tecno-hero&iacute;smo individual estaba acabada, que la industria de
software y la emergente Internet ser&iacute;an dominados cada vez m&aacute;s
por colosos como Microsoft. La primera generaci&oacute;n de 'hackers'
Unix parec&iacute;an envejecidos y cansados (al grupo de
Investigaci&oacute;n de Ciencias de la Inform&aacute;tica de Berkeley
se le termino el vapor y perdi&oacute; su financiaci&oacute;n en
1994). Era tiempos deprimentes.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Afortunadamente,
hab&iacute;an habido algunas cosas fuera de la vista de la prensa
comercial, y tambi&eacute;n fuera de la vista de la mayor&iacute;a de
los 'hackers', que inesperadamente producir&iacute;an certeros
desarrollos en 1993 y 1994. A la larga, estos desarrollos conducir&iacute;an
la cultura 'hacker' en una direcci&oacute;n totalmente nueva y nunca
so&ntilde;ada de &eacute;xitos.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>6.
 Los Primeros Unix Libres</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Por
la brecha dejada por el incompleto HURD de la Free Software
Foundation</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>hab&iacute;a
caminado un estudiante de la Universidad de Helsinki llamado Linus
Torvalds. En 1991 &eacute;l comenz&oacute; desarrollando un n&uacute;cleo
libre de Unix para m&aacute;quinas 386 usando el toolkit de la Free
Software Foundation. Su r&aacute;pido &eacute;xito inicial, atrajo
muchos 'hackers' de Internet para ayudarla a desarrollar Linux, un
Unix completamente equipado libre y de fuentes redistribuibles.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Linux
no estaba sin competidores. En 1991, contempor&aacute;neamente con el
precoz experimento de Linus Torvalds, William y Lynne Jolitz estaban
portando de manera experimental las fuentes del Unix BSD al 386. La
mayor&iacute;a de los observadores que comparan la tecnolog&iacute;a
BSD con los primeros y toscos esfuerzos de Linus anticiparon que el
BSD portado llegar&iacute;a a ser el Unix libre m&aacute;s importante
sobre el PC.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>El
aspecto m&aacute;s importante de Linux, sin embargo, no fue t&eacute;cnico
sino sociol&oacute;gico. Hasta que Linux se desarrollo, todos cre&iacute;an
que cualquier software tan complejo como un sistema operativo tenia
que ser desarrollado de una forma cuidadosamente coordenada por un
grupo de gente relativamente peque&ntilde;o y altamente cohesionado.
Este modelo era y todav&iacute;a es t&iacute;pico de ambos modelos,
el software comercial y las grandes catedrales construidas por la
Free Software Foundation en la d&eacute;cada de los 80; tambi&eacute;n
de los proyectos freeBSD/netBSD/OpenBSD que surgieron a partir del
386BSD original de Jolitzes.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Linux
evolucion&oacute; de una manera completamente diferente. Desde casi
el comienzo, fue hackeado de manera m&aacute;s bien informal por un
formidable n&uacute;mero de voluntarios coordinados &uacute;nicamente
mediante Internet. La calidad se mantuvo no por la autocracia o
normas r&iacute;gidas sino por la ingenuidad y la estrategia simple
de liberar cada semana y consiguiendo retroalimentaci&oacute;n de
centenares de usuarios en unos d&iacute;as, creando un tipo de
selecci&oacute;n Darwiniana r&aacute;pida sobre las mutaciones
introducida por los desarrolladores. Ante el  estupor de casi todos,
esto funciono bastante bien.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Hacia
el final de 1993 Linux pod&iacute;a competir en estabilidad y
confiabilidad con muchos Unix comerciales, y albergar ampliamente m&aacute;s
software. Estaba incluso comenzando a atraer el portado de
aplicaciones de software comerciales. Un efecto indirecto de este
desarrollo fue que extermino la mayor&iacute;a de los vendedores
menores de Unix propietarios, sin desarrolladores y 'hackers' a quien
vender, ellos plegaron. Uno de los pocos supervivientes, BSDI
(Berkeley Systems Design, Incorporated), alcanzo el &eacute;xito por
ofertar las fuentes completas con su Unix basado en BSD y estrechando
lazos con la comunidad 'hacker'.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Estos
desarrollos no fueron muy comentados entonces, aun dentro de la
cultura 'hacker', y en absoluto fuera de ella. La cultura 'hacker',
desafiando los repetidos pron&oacute;sticos de su defunci&oacute;n,
estaba simplemente comenzando a rehacer el mundo del software
comercial a su propia imagen. Pasar&iacute;an cinco a&ntilde;os m&aacute;s,
sin embargo, antes de que esta tendencia llegara a ser obvia.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>7.
 La Gran Explosi&oacute;n de la Web</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>El
precoz crecimiento de Linux sinergizo con otro fen&oacute;meno: El 
descubrimiento p&uacute;blico de Internet. El inicio de los 90
tambi&eacute;n vio el comienzo de una floreciente industria de
proveedores de Internet, que vend&iacute;a  conectividad al p&uacute;blico
por pocos d&oacute;lares al mes. Seguido de la invenci&oacute;n de la
World Wide Web, el crecimiento de Internet ya de por si r&aacute;pido,
acelero a un ritmo atropellado.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Por
1994, el a&ntilde;o que el grupo de desarrollo del Unix de Berkeley
cerro formalmente, diferentes versiones libres de Unix (Linux y los
descendientes de 386BSD) hicieron el papel de importantes puntos
centrales de actividad de hackeo. Linux estaba siendo distribuido
comercialmente sobre CDROM y se vend&iacute;a como pan caliente. A
finales de 1995, las principales compa&ntilde;&iacute;as de
ordenadores comenzaron a sacar brillantes anuncios celebrando la
simpat&iacute;a hacia Internet de su software y hardware!</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>En
los &uacute;ltimos 90 el desarrollo de Linux y el liderazgo de
opini&oacute;n en Internet llegaron a ser las actividades centrales
del 'Hackerismo'. La World Wide Web al final hab&iacute;a convertido
Internet en un mass media, y la mayor&iacute;a de los  'hackers' de
los 80 y el comienzo de los 90 lanzaron Servicios de Acceso a
Internet, vendiendo o dando acceso a las masas.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>El
liderazgo de opini&oacute;n en Internet incluso trajo a la cultura
'hacker' el</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>comienzo
de la respetabilidad e influencia pol&iacute;tica.  En 1994 y 1995 el</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>activismo
'hacker' extermino la propuesta Clipper que habr&iacute;a puesto</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>la
encriptacion fuerte bajo el control del gobierno. En 1996 los
'hackers' movilizaron una amplia coalici&oacute;n para derrotar la
mal llamada 'Acta de Decencia de la Comunicaciones' e impedir la
censura en Internet.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>Con
la victoria sobre la CDA, pasamos por la historia, entre los asuntos
del d&iacute;a. Tambi&eacute;n cruzamos por una &eacute;poca en la
cual su historiador (m&aacute;s bien para su propia sorpresa) lleg&oacute;
a ser un actor antes que un simple observador. Este relato continuara
en 'La Venganza de los 'hackers''.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>9.
 Bibliograf&iacute;a</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm"><SPAN STYLE="font-weight: medium"><SPAN STYLE="text-decoration: none"><FONT SIZE=3><FONT FACE="Roman 10cpi, monospace"><FONT COLOR="#000000"><SPAN STYLE="font-style: normal">[Levy]
Levy, Steven; '</SPAN><I>Hackers'</I><SPAN STYLE="font-style: normal">,
Anchor/Doubleday 1984, ISBN</SPAN></FONT></FONT></FONT></SPAN></SPAN></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>0-385-19195-2.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm"><SPAN STYLE="font-weight: medium"><SPAN STYLE="text-decoration: none"><FONT SIZE=3><FONT FACE="Roman 10cpi, monospace"><FONT COLOR="#000000"><SPAN STYLE="font-style: normal">[Raymond]
Raymond, Eric S.; '</SPAN><I>The New Hacker's Dictionary</I><SPAN STYLE="font-style: normal">'
, MIT Press,</SPAN></FONT></FONT></FONT></SPAN></SPAN></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>tercera
edici&oacute;n 1996. ISBN 0-262-68092-0.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<P STYLE="margin-bottom: 0cm"><SPAN STYLE="font-weight: medium"><SPAN STYLE="text-decoration: none"><FONT SIZE=3><FONT FACE="Roman 10cpi, monospace"><FONT COLOR="#000000"><SPAN STYLE="font-style: normal">David
E. Lundstrom proporciono una historia anecd&oacute;tica de la &eacute;poca
de los 'Aut&eacute;nticos Programadores' en '</SPAN><I>A Few Good Men
>From UNIVAC</I><SPAN STYLE="font-style: normal">', 1987,</SPAN></FONT></FONT></FONT></SPAN></SPAN></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<FONT COLOR="#000000"><FONT FACE="Roman 10cpi, monospace"><FONT SIZE=3>ISBN-0-262-62075-8.</FONT></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
<BR>
</P>
<DIV TYPE=FOOTER>
	<P STYLE="margin-top: 1.27cm; margin-bottom: 0cm; font-style: normal; font-weight: medium; text-decoration: none">
	<BR>
	</P>
</DIV>
</BODY>
</HTML>