<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="SystemAdministration">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf274, SystemAdministration: Detecci&oacute;n de intrusos con Debian GNU/Linux</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Jos&eacute; Salvador Gonz&aacute;lez Rivera
 =LF=CAT___: SystemAdministration
 =LF=TITLE_: Detecci&oacute;n de intrusos con Debian GNU/Linux
 =LF=NUMBER: 274
 =LF=ANAME_: article274.shtml
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/JoseGonzalez.jpg" alt="[Photo of the Author]" width="110" height="150">
<BR>por  Jos&eacute; Salvador Gonz&aacute;lez Rivera <br> <small>&lt;jsgr(at)linuxpuebla.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<p>
Jos&eacute; Salvador Gonz&aacute;lez Rivera
es miembro activo del Grupo de Usuarios Linux de Puebla en M&eacute;xico, constantemente
participa en eventos para promover el uso de Software Libre y principalmente Linux,
este semestre egres&oacute; de la Licenciatura en Sistemas Computacionales, puedes contactarlo
en jsgr(at)linuxpuebla.org y tambi&eacute;n en jsgr(at)tec.com.mx
</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#274lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#274lfindex1">&iquest;Porqu&eacute; Debian GNU/Linux?</A></LI>
  <LI><A HREF="#274lfindex2">* Herramientas de host</A></LI>
  <LI><A HREF="#274lfindex3">Detecci&oacute;n de Escaneo de Puertos</A></LI>
  <LI><A HREF="#274lfindex4">An&aacute;lisis de Integridad</A></LI>
  <LI><A HREF="#274lfindex5">An&aacute;lisis de Bit&aacute;coras</A></LI>
  <LI><A HREF="#274lfindex6">Herramientas de red</A></LI>
  <LI><A HREF="#274lfindex7">Modo Sniffer y Packet Logger de Snort</A></LI>
  <LI><A HREF="#274lfindex8">Modo Detecci&oacute;n de intrusos de Snort</A></LI>
  <LI><A HREF="#274lfindex9">Otras Herramientas Utiles</A></LI>
  <LI><A HREF="#274lfindex10">Detecci&oacute;n de sniffers</A></LI>
  <LI><A HREF="#274lfindex11">Detecci&oacute;n de rootkits</A></LI>
  <LI><A HREF="#274lfindex12">Algunas Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=274">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Detecci&oacute;n de intrusos con Debian GNU/Linux</H2>
 <img src="../../common/images/debian.gif" width="51" height="62" alt="[debian]" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->
<p>
Ahora que toda la informaci&oacute;n se almacena de manera digital en medios electr&oacute;nicos
es mucho m&aacute;s &aacute;gil acceder a ella por medio de redes de computadoras que nos permiten
el paso de datos a distancia, datos de &iacute;ndole financiera, gubernamental, militar,
industrial y comercial que lamentablemente son objetivo f&aacute;cil para las personas
malintencionadas que no cuenten con la &eacute;tica suficiente para obtenerla o destruirla.
<br><br>
Debido a la falta de conciencia no existen recursos abundantes sobre este tema en
diversos idiomas, en este peque&ntilde;o art&iacute;culo har&eacute; una revisi&oacute;n "b&aacute;sica" sobre las t&eacute;cnicas
y herramientas que podemos utilizar para detectar a los intrusos en Linux. Procurar&eacute; no repetir
informaci&oacute;n con otras palabras de manuales de usuarios por lo que me centro en puntos
espec&iacute;ficos que se presentan.
</p>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


<A NAME="274lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

<p>
Al seleccionar un sistema operativo Linux debemos considerar al gran n&uacute;mero de distribuciones
que existen, la mayor&iacute;a se basan principalmente en RedHat, por ejemplo Conectiva (Brasil),
Hispa fuentes(Espa&ntilde;a), Mandrake(Francia), SuSE (Alemania), Caldera y muchas otras que utilizan
el manejador de paquetes RPM. Otra distribuci&oacute;n es Slackware, el cual busca un Unix
muy tradicional al seguir utilizando &uacute;nicamente archivos de instalaci&oacute;n .tgz

"Casi" todas son desarrolladas por empresas comerciales, pero Debian no es el caso.
Debian tiene un manejador de paquetes (DPKG) que nos facilita la actualizaci&oacute;n de programas al
buscar autom&aacute;ticamente las actualizaciones desde Internet y cumpliendo dependencias de archivos y
librer&iacute;as que un paquete requiera facilitando la administraci&oacute;n del sistema y permitiendo siempre
estar al d&iacute;a autom&aacute;ticamente con las nuevas actualizaciones de seguridad.
</p>

<A NAME="274lfindex1">&nbsp;</A>
<H2>&iquest;Porqu&eacute; Debian GNU/Linux?</H2>

<p>
Debian tambi&eacute;n presenta algunas caracter&iacute;sticas sustanciales importantes:
<br><br>
1) Carece de fines comerciales y no obedece a urgencias mercantiles.<br>
2) Tiene un buen seguimiento de errores, problemas son arreglados en menos de 48 horas.<br>
3) Desde el principio su principal prioridad es desarrollar un sistema operativo completo y confiable.<br>
4) Es desarrollado por voluntarios en todo el mundo.<br>
<br>
Cada nueva versi&oacute;n soporta nuevas arquitecturas de hardware, actualmente estan soportadas:
Alpha, ARM, HP PA-RISC, Intel x86, Intel IA-64, Motorola 680x0, MIPS, MIPS (DEC), Power PC,
IBM S/390, Sparc y actualmente est&aacute;n por soportar Sun UltraSparc y SuperH de Hitachi siendo el
sistema Linux que m&aacute;s arquitecturas soporta.

</p>
<p>
Dentro de los paquetes existentes en Debian tenemos varias herramientas para la detecci&oacute;n de
intrusiones en tiempo real que detectan comportamientos hostiles en una conexi&oacute;n, se suelen
clasificar de 2 tipos, los que monitorean intentos de ataque a toda una red o los que solo
monitorean las actividades de un host determinado.
</p>

<A NAME="274lfindex2">&nbsp;</A>
<H2>* Herramientas de host</H2>

<p>
Utilizamos la herramienta PortSentry para detectar escaneo de puertos,
TripWire para detectar modificaciones a los archivos de sistema y
LogSentry para el an&aacute;lisis de bit&aacute;coras; siendo el primero y el &uacute;ltimo parte de la suite de
herramientas llamada TriSentry de Psionic Technologies.
</p>

<A NAME="274lfindex3">&nbsp;</A>
<H2>Detecci&oacute;n de Escaneo de Puertos</H2>

<p>
El sistema PortSentry vigila los puertos de nuestro sistema y ejecuta
una acci&oacute;n (generalmente un bloqueo) en caso de detectar un intento de
conexi&oacute;n a un puerto que no queremos sea escuchado.
<br><br>
Su p&aacute;gina principal se encuentra en <a href="http://www.psionic.com/products/portsentry.html">http://www.psionic.com/products/portsentry.html</a>  y
est&aacute; disponible para sistemas Solaris, BSD, AIX, SCO, Digital Unix, HP-UX,  y Linux.
<br><br>
En Debian puede instalarse tecleando la instrucci&oacute;n:
<br><br>
apt-get install portsentry
</p>
<p>
Se pueden especificar diferentes niveles de actividad, el modo cl&aacute;sico,
stealth y avanzado, toda la configuraci&oacute;n se encuentra en el archivo
/usr/local/psionic/portsentry/portsentry.conf<br><br>Las principales opciones
las consulte directamente de un art&iacute;culo de Jos&eacute; Torres Luque en la revista
ES Linux Magazine y son las siguientes:
</p>
<p class="code">
TCP_PORTS, aqu&iacute; se ponen los puertos a logear tanto para el modo cl&aacute;sico
como para el stealth. El autor del programa propone tres listas
distintas de puertos seg&uacute;n el grado de sensibilidad que queramos
aplicar. El m&aacute;ximo de puertos es 64.<br><br>

UDP_PORTS, este es un equivalente al anterior pero para puertos UDP.<br><br>

ADVANCED_PORTS_TCP,
ADVANCED_PORTS_UDP, indican el rango m&aacute;ximo del puerto a usar para el
modo advanced. Todo puerto inferior al indicado ser&aacute; monitorizado salvos
los que ya vimos que eran excluidos. El rango m&aacute;ximo puede ser definido
hasta el 65535. Aunque no se recomienda exceder de mas de 1024 pues
podr&iacute;a generar falsas alarmas.<br><br>

ADVANCED_EXCLUDE_TCP,
ADVANCED_EXCLUDE_UDP, son una lista de exclusi&oacute;n de puertos, todo los
que aqui se pongan no ser&aacute;n tenidos en cuenta a la hora de monitorear
en el modo avanzado. Se ponen puertos t&iacute;picos de conexi&oacute;n que sean
habituales por clientes remotos y en los que no se este ofreciendo un
servicio real. Por ejemplo: ident<br><br>

IGNORE_FILE, Aqui especificamos el archivo donde incluiremos las IPs que
no tendremos en cuenta al momento de monitorear, en el tambi&eacute;n se deber&iacute;a poner
las IP de los interfaces locales incluyendo el "lo". Se podr&iacute;a tambi&eacute;n incluir
las IPs locales.<br><br>

KILL_ROUTE, aqui podemos poner el comando a ejecutar para bloquear
accesos del host atacante. p/e: iptables -I INPUT -s $TARGET$ -j DROP
aqui $TARGET$ sirve para hacer referencia al host atacante.<br><br>

KILL_RUN_CMD, indicamos un comando a ejecutar antes que se bloquee el
acceso al host atacante.<br><br>

SCAN_TRIGGER, define a los cuantos intentos har&aacute; saltar la alarma.<br><br>

PORT_BANNER, muestra un mensaje en los puertos abiertos con el modo connect.<br><br>

Una vez configurado tenemos que ejecutarlo en alguno de los 3 modos,
para esto se puede elegir las opciones: para TCP tenemos -tcp (modo
b&aacute;sico), -stcp (modo stealth) y -atcp (avanzado), para UDP tenemos -udp,
-sudp, -audp.
</p>

<A NAME="274lfindex4">&nbsp;</A>
<H2>An&aacute;lisis de Integridad</H2>

<p>
El sistema TripWire permite monitorear la integridad de los archivos del
sistema, su p&aacute;gina principal se encuentra <a href="http://www.tripwire.org/">http://www.tripwire.org/</a>
y est&aacute; disponible para el sistema operativo Linux y de manera comercial para
Windows NT, Solaris, AIX y HP-UX.
<br><br>
En Debian puede instalarse tecleando la instrucci&oacute;n:
<br><br>
apt-get install tripwire
<br><br>
Se utilizan dos claves para almacenar la informaci&oacute;n, la primera "site
key" se utiliza para cifrar los archivos de pol&iacute;ticas y configuraci&oacute;n,
la "local key" se utiliza para cifrar la informaci&oacute;n que muestra el
estado de los archivos que son monitoreados.
<br><br>
La configuraci&oacute;n se realiza de manera sencilla en el archivo
/etc/tripwrie/twpol.txt y una vez modificado se "instala" tecleando la
instrucci&oacute;n:
<br><br>
twadmin -m P /etc/tripwire/twpol.txt
<br><br>
Para generar la base de datos inicial con el estado actual de los
archivos  ejecutamos la instrucci&oacute;n:
<br><br>
tripwire -m i 2
<br><br>
Para verificar la integridad del sistema de archivos ejecutamos la
instrucci&oacute;n:
<br><br>
tripwire -m c
<br><br>
El archivo de configuraci&oacute;n puede ser borrado para que un posible
intruso no pueda ver que archivos son revisados por lo que ejecutamos la
siguiente instrucci&oacute;n:
<br><br>
rm /etc/tripwire/twcfg.txt /etc/tripwire/twpol.txt
<br><br>
Para crearlos en caso de ser necesario tecleamos la instrucci&oacute;n:
<br><br>
twadmin -m p &gt; /etc/tripwire/twpol1.txt
twadmin -m f &gt; /etc/tripwire/twcfg.txt
</p>

<A NAME="274lfindex5">&nbsp;</A>
<H2>An&aacute;lisis de Bit&aacute;coras</H2>

<p>
El sistema LogCheck forma parte de LogSentry, nos permite hacer una revisi&oacute;n de bit&aacute;coras de manera
m&aacute;s efectiva pues clasifica y genera reportes de las actividades y errores que realmente se deben
consultar, lo hace en 4 niveles: ignorar, actividad no usual, violaci&oacute;n de seguridad y ataque.
<br><br>
Su p&aacute;gina principal se encuentra en <a href="http://www.psionic.com/products/logsentry.html">http://www.psionic.com/products/logsentry.html</a>
y est&aacute; disponible para sistemas Solaris, BSD, HP-UX y Linux.
<br><br>
En Debian puede instalarse tecleando la instrucci&oacute;n:
<br><br>
apt-get install logcheck
<br><br>
Instala el programa logtail en /usr/local/bin para mantener un registro
de que logs ya han sido analizados, tambi&eacute;n instala los siguientes archivos:
</p>
<p class="code">
Logcheck.sh,<br>         Es un script que incluye la configuraci&oacute;n b&aacute;sica.<br><br>
Logcheck.hacking,<br>    Contiene las reglas para identificar los niveles de actividad.<br><br>
Logcheck.ignore,<br>     Contiene expresiones que no deben reportarse.<br><br>
Logcheck.violations,<br> Contiene expresiones que pueden considerarse como violaciones de seguridad.<br><br>
Logcheck.violations.ignore,<br> Ignora las expresiones que se encuentren en este archivo.<br><br>
</p>
<p>
Para programar el reporte de logs podemos crear un cron que corra el
programa cada hora:
0 * * * * /bin/sh /usr/local/etc/logcheck.sh
</p>
<A NAME="274lfindex6">&nbsp;</A>
<H2>Herramientas de red</H2>

<p>
Utilizamos la herramienta Snort para registrar los intentos de ataque a
nuestra red. Su p&aacute;gina principal se encuentra <a href="http://www.snort.org/">http://www.snort.org/</a> y est&aacute; disponible para
BSD, Solaris, AIX, Irix, Windows, MacOS y Linux. En Debian puede instalarse tecleando la instrucci&oacute;n:
<br><br>
apt-get install snort
<br><br>
Funciona en tres modos, como sniffer, packet logger y como detector de
intrusos.
</p>
<p>
Tiene los siguientes par&aacute;metros:
</p>
<p class="code">
-l directorio<br>Indicamos el directorio donde se almacenar&aacute;n los archivos.<br><br>
-h IP<br>Especificamos el IP de nuestra red que queramos monitorear.<br><br>
-b<br>Captura todos los paquetes en forma binaria.<br><br>
-r archivo<br>Procesa un archivo binario.
</p>

<A NAME="274lfindex7">&nbsp;</A>
<H3>Modo Sniffer y Packet Logger de Snort</H3>

<p>
En modo sniffer lee todos los paquetes que pasan por la red y los
muestra en consola, en modo packet logger env&iacute;a los datos a un archivo
dentro de un directorio.
<br><br>
Snort -v
<br><br>
Muestra el IP y las cabeceras.
<br><br>
Snort -dv
<br><br>
Tambi&eacute;n muestra los datos que pasan.
<br><br>
Snort -dev
<br><br>
De manera m&aacute;s detallada.
</p>

<A NAME="274lfindex8">&nbsp;</A>
<H3>Modo Detecci&oacute;n de intrusos de Snort</H3>

<p>
En este modo nos informar&aacute; de escaneos de puertos, ataques de denegaci&oacute;n
de servicio, ejecuci&oacute;n de exploits, etc. Bas&aacute;ndose en reglas
especificadas en el archivo /usr/local/share/snort estas reglas pueden
ser descargadas de la p&aacute;gina principal y son actualizadas del servidor
cada hora aproximadamente.
<br><br>
Su configuraci&oacute;n es tan sencilla como modificar el archivo snort.conf
donde especificamos los detalles de nuestra red y directorios de
trabajo, se modific&oacute; solamente la IP:
<br><br>
var HOME_NET IP
<br><br>
Para ejecutar snort tecleamos la instrucci&oacute;n:
<br><br>
snort -c snort.conf
<br><br>
Los archivos de registro se almacenan en /var/log/snort donde podemos
ver las IPs atacantes. Por supuesto esta es una revisi&oacute;n b&aacute;sica de lo
que podemos hacer con Snort, te recomiendo que revises m&aacute;s documentaci&oacute;n
ya que es una herramienta excelente que, por cierto, ha sido comparada por
revistas y grupos de seguridad recomend&aacute;ndola como la mejor herramienta de
detecci&oacute;n de intrusos para cualquier plataforma Unix y Windows.
Existe soporte comercial por empresas como Silicon Defense y Source Fire as&iacute;
como interfaces gr&aacute;ficas que empiezan a surgir para una mejor y m&aacute;s est&eacute;tica
presentaci&oacute;n de resultados.
<br><br>
En algunas ocasiones surgen emergencias que no fueron contempladas con
anterioridad y tienen que resolverse de manera inmediata.
Estos problemas generalmente son ocasionados por personas
malintencionadas o intrusos que intentan acceder por alg&uacute;n motivo a
nuestros servidores, desde robar o alterar nuestra informaci&oacute;n hasta
atacar a otros equipos desde el nuestro, desde instalar un programa
sniffer o alg&uacute;n rootkit.
</p>
<A NAME="274lfindex9">&nbsp;</A>
<H2>Otras Herramientas Utiles</H2>

<A NAME="274lfindex10">&nbsp;</A>
<H3>Detecci&oacute;n de sniffers</H3>

<p>
Un sniffer es una herramienta que pone en modo promiscuo nuestra
interfaz de red con la intenci&oacute;n de capturar todo el tr&aacute;fico que pasa
por la red, el comando ifconfig nos muestra informaci&oacute;n completa sobre
nuestra interfaz:
</p>
<p class="code">
eth0       Link encap:Ethernet  HWaddr 00:50:BF:1C:41:59<br>
           inet addr:10.45.202.145  Bcast:255.255.255.255 Mask:255.255.128.0<br>
           UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1<br>
           RX packets:7180 errors:0 dropped:0 overruns:0 frame:0<br>
           TX packets:4774 errors:0 dropped:0 overruns:0 carrier:0<br>
           collisions:0 txqueuelen:100<br>
           RX bytes:8122437 (7.7 MiB)  TX bytes:294607 (287.7 KiB)<br>
           Interrupt:10 Base address:0xc000<br>
</p>
<p>
Pero si el comando ifconfig fue sustituido o el sniffer se encuentra
situado en otra m&aacute;quina de la red es necesario monitorear las
conexiones al exterior, por ejemplo el env&iacute;o de e-mail a cuentas
extra&ntilde;as o detectar logs del sniffer.
</p>
<p>
Existe una herramienta llamada neped creada por un grupo de hackers
espa&ntilde;oles la cual nos informa sobre las interfaces de red que se
encuentran en modo promiscuo dentro de nuestra red, no forma parte de
Debian pero puede ser descargado de <a href="ftp://apostols.org/AposTools/snapshots/neped/neped.c">ftp://apostols.org/AposTools/snapshots/neped/neped.c</a>
<br>Nota: Estas &uacute;ltimas semanas ha permanecido ca&iacute;do su servidor.
</p>
<p>
Al ejecutar el programa obtendremos un resultado similar a lo siguiente:
</p>
<p class="code">
neped eth0<br>
----------------------------------------------------------<br>
 &gt; My HW Addr: 00:50:BF:1C:41:59<br>
 &gt; My IP Addr: 192.168.0.1<br>
 &gt; My NETMASK: 255.255.255.0<br>
 &gt; My BROADCAST: 192.168.1.255<br>
----------------------------------------------------------<br>
   Scanning ....<br>
*  Host 192.168.0.2, 00:C2:0F:64:08:FF **** Promiscuous mode detected !!!<br>
   End.<br>
</p>
<p>
Al enviar un paquete IP desde 191.168.0.1 hacia 192.168.0.2 necesitamos
conocer su direcci&oacute;n MAC, para esto se env&iacute;a un paquete broadcast a toda
la red preguntando la direcci&oacute;n MAC del IP especificado, todos los
equipos de la red escuchan la petici&oacute;n pero solo responde el host destino.
<br><br>
En este caso neped  realiza una petici&oacute;n para cada IP asignada en la red
pero no broadcast sino a una direcci&oacute;n IP inexistente. Solo los hosts
con su interfaz en modo promiscuo contestar&aacute;n esta petici&oacute;n pues son los
&uacute;nicas capaz de ver esos paquetes.
<br><br>
Este programa lo conoc&iacute; por un art&iacute;culo de detecci&oacute;n de esp&iacute;as que encontr&eacute;
por la red e inclu&iacute;a un ejemplo similar a este, si alguien sabe el sitio Internet
donde se encuentra el art&iacute;culo envieme la direcci&oacute;n por correo electr&oacute;nico
porque la perd&iacute; :-)
</p>

<A NAME="274lfindex11">&nbsp;</A>
<H3>Detecci&oacute;n de rootkits</H3>

<p>
Los RootKits es un m&eacute;todo para obtener m&aacute;s privilegios de los asignados
a un usuario, generalmente sustituyen archivos binarios de nuestro
sistema operativo por versiones propias para conservar el acceso
posterior al sistema, por lo que es necesario verificar si tenemos los
originales, para esto nos ayudamos de la herramienta chkrootkit que
puede ser instalado con la instrucci&oacute;n:
</p>
<p>
apt-get install chkrootkit
</p>
<p>
Su p&aacute;gina principal est&aacute; ubicada <a href="http://www.chkrootkit.org/">www.chkrootkit.org</a>
 y verifica los siguientes archivos:</p>
<p class="code">
aliens, asp, bindshell, lkm, rexedcs, sniffer, wted, z2, amd, basename,
biff, chfn, chsh, cron, date, du, dirname, echo, egrep, env, find,
fingerd, gpm, grep, hdparm, su, ifconfig, inetd, inetdconf, identd,
killall, ldsopreload, login, ls, lsof, mail, mingetty, netstat, named,
passwd, pidof, pop2, pop3, ps, pstree, rpcinfo, rlogind, rshd, slogin,
sendmail, sshd, syslogd, tar, tcpd, top, telnetd, timed, traceroute, w,
write
</p>
<br>
Esta herramienta es invocada tecleando:
<br><br>
chkrootkit
<br><br>
Haciendo la verificaci&oacute;n de archivos y buscando posibles sniffers y
paquetes de rootkits conocidos. Tiene otras herramientas que se utilizan
para verificar alteraci&oacute;n en los archivos de logs (chkwtmp y chklastlog)
as&iacute; como el programa ifpromisc para verificar si nuestra interface de
se encuentra en modo promiscuo.
</p>
<A NAME="274lfindex12">&nbsp;</A>
<H2>Algunas Referencias</H2>

<p>
Te recomiendo consultes las p&aacute;ginas man de los programas, tambi&eacute;n te
proporciono algunas referencias que consult&eacute;, por favor no dejen de
mandarme sugerencias y comentarios a mi correo electr&oacute;nico.
<br><br>
<br>
</p><ul>
<li>Alexander Reelsen, Securing Debian How To, version 1.4, 18 Febrero 2001<br>
</li><li>An&oacute;nimo, Linux M&aacute;xima Seguridad, Pearson Educaci&oacute;n, Madrid 2000<br>
</li><li>Brian Hatch, Hackers en Linux, Mc Graw Hill 2001<br>
</li><li>Jim Mellander, A Stealthy Sniffer Detector, Network Security<br>
</li><li>Antonio Villal&oacute;n Huerta, Seguridad en Unix y redes, Open Publication License, octubre 2000<br>
</li><li>CSI FBI Computer Crime and Security Survey, CSI Issues&amp;Trends, Vol.7<br>
</li><li>Who's Sniffing Your Network?, <a href="http://www.linuxsecurity.com/articles/intrusion_detection_article-798.html">www.linuxsecurity.com/articles/intrusion_detection_article-798.html</a>
</li></ul>
<p></p>

<!-- vim: set sw=2 ts=2 et tw=74: -->

<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=274"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Jos&eacute; Salvador Gonz&aacute;lez Rivera, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">es --&gt; -- : Jos&eacute; Salvador Gonz&aacute;lez Rivera <small>&lt;jsgr(at)linuxpuebla.org&gt;</small></font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-11-10, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
