<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.1">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Software Development">
 <TITLE>Software Development :  GNUstep, el OpenStep open source</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="[Photo of the Author]" HEIGHT=124 WIDTH=115>
<BR>por  <A HREF="mailto:georges.t@linuxfocus.org">Georges Tarbouriech</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Georges es un usuario viejo de Unix (comercial o libre). Siendo un "enamorado"
de NeXT, le gustan mucho los proyectos libres basados en la filosof&iacute;a
de este estupendo SO.
<BR></P>
<P><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Para empezar con...</A></LI>
  <LI><A HREF="#lfindex1">Para instalar...</A></LI>
  <LI><A HREF="#lfindex2">Ejemplos</A></LI>
  <LI><A HREF="#lfindex3">Los Pesos Pesados</A></LI>
  <LI><A HREF="#lfindex4">Utilidades</A></LI>
  <LI><A HREF="#lfindex5">Documentaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex6">Y NeXT (despu&eacute;s) ?</A></LI>
  <LI><A HREF="#lfindex7">Y la orquesta sigue tocando</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=195&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2> GNUstep, el OpenStep open source</H2>
 <IMG SRC="../../common/images/article195/GNUstep.jpg" HSPACE=10 ><P><i>Resumen</i>:
<P>
<p>
Hace m&aacute;s de 10 a&ntilde;os, aparec&iacute;a una m&aacute;quina
incre&iacute;ble con un a&uacute;n m&aacute;s incre&iacute;ble SO. Se llamaba
NeXT y NeXTStep era el apellido del SO. Nunca hab&iacute;amos visto tal cosa
antes: era una m&aacute;quina muy bonita, con un aspecto que quitaba
el hipo. Al principio, el SO se basaba en BSD 4.2, y 4.3 un poco m&aacute;s
tarde, con un kernel mach muy compacto. Con &eacute;l, apareci&oacute; la primera
herramienta de desarrollo gr&aacute;fica orientada a objetos: Interface Builder
(gracias a Jean-Marie Hullot y Bertrand Serlet por esta incre&iacute;ble
herramienta). Comercialmente, fue un fracaso, y NeXT decidi&oacute
portar el entorno a diferentes SO, como Sun, por ejemplo. Este API se
llamaba OpenStep, y a partir de ah&iacute; GNU empez&oacute; un proyecto muy
importante, GNUstep
<a href="http://www.gnustep.org">http://www.gnustep.org</a>, para proporcionar
un OpenStep libre. Este art&iacute;culo trata de presentar este gr&aacute;n
trabajo, aunque se encuentra muy lejos de su fin.
</p></P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Para empezar con...</H2>

<p>
...GNUstep, necesitan otro gran producto libre: Window Maker. Es un
gestor de ventanas a la NeXT. Si todav&iacute;a no lo conocen, pueden dar un
vistazo <a href="../January2000/article128.shtml">aqu&iacute;</a>. En el
momento de escribir la &uacute;ltima versi&oacute;n es 0.64.0.
Este gestor de ventanas forma parte del proyecto GNUstep y pueden obtenerlo
desde <a href="http://www.windowmaker.org">http://www.windowmaker.org</a>.
Podemos a&ntilde;adir que Window Maker funciona en casi todas plataformas Unix,
sean comerciales o libres. En cambio, GNUstep es un poco diferente.
Funcionar&aacute; en casi todos los sabores de Linux, NetBSD, FreeBSD, OpenBSD,
siendo m&aacute;s o menos estable seg&uacute;n el SO. Por lo parte de los Unixes
comerciales, funcionar&aacute; en Solaris, Irix... aqu&iacute; tambi&eacute;n con
m&aacute;s o menos estabilidad. Una vez que
su pantalla parece a la de NeXTStep, pueden ir al site de GNUstep para
descargar lo que necesitan.
</p>

<p>
Y qu&eacute; necesitan? Evidentemente, un compilador objective C (recuerden, es un
entorno orientado a objetos). gcc 2.8 y superiores valen. La librer&iacute;a libobjc
est&aacute; recomendada. Aparte de las herramientas necesarias para compilar, necesitan
el "coraz&oacute;n" de GNUstep: es decir, por lo menos, la librer&iacute;a de
base (base library), la librer&iacute;a del gui, el "backend" X11 (xgps o xdps),
etc. Pueden descargar muchas cosas segun su gusto: hay una lista para elegir.
Por ejemplo, pueden bajar Gorm, lo que es la implementaci&oacute;n de Interface
Builder (s&oacute;lo CVS), los ejemplos o las aplicaciones de los
usuarios.
</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>Para instalar...</H2>

<p>
¡S&oacute;lo tienen que compilar lo que han bajado! En serio, tendr&iacute;an
que leer los README y los INSTALL. Tambi&eacute;n tienen un GNUstep HOWTO, que recomendamos
leer.
Despu&eacute;s de compilar, la mayor&iacute;a del trabajo consiste en fijar variables de
entorno y programas que arrancar al lanzar el sistema (el motor por ejemplo,
llamado gdnc).
Como ya hemos mencionado, pueden usar dos "backends" diferentes: el X y el
dps, siendo este &uacute;ltimo la implementaci&oacute;n libre de Display
PostScript. Este dar&aacute; mejor resultado pero es mucho menos adelantado que
el X.
</P>

<P>
Seg&uacute;n el SO, definan los caminos adecuados en las variables de
entorno. Por lo menos, tienen que definir la variable GNUSTEP_SYSTEM_ROOT y el
camino hacia los diferentes scripts o programas.
Cuando hayan terminado con esta parte, pueden "jugar" con GNUstep.
</p>

<A NAME="lfindex2">&nbsp;</A>
<H2>Ejemplos</H2>

<p>
Hay muchos ejemplos disponibles en el site de GNUstep, sea en la parte "apps"
sea en la parte "download". Proporcionan la mejor forma de familiarizarse con
GNUstep si no conocen NeXTStep ni OpenStep. La mayor&iacute;a son ejemplos que
funcionan y permiten entender la filosof&iacute;a detr&aacute;s del entorno.
Mirar el c&oacute;digo ense&ntilde;ar&aacute; mucho sobre Objective C. Para
algui&eacute;n que conozca al C, Objective C es muy f&aacute;cil de aprender, y en
cualquier caso, es mucho m&aacute;s f&aacute;cil que C++ (bueno,
s&oacute;lo es mi opinion).
Entre estos ejemplos, un muy bonito es el "font panel". Realmente se parece al
original. A prop&oacute;sito, a lo largo de este art&iacute;culo,
ense&ntilde;aremos fotos de pantallas de GNUstep y NeXTStep, as&iacute;
podr&aacute;n comparar. Aqu&iacute; tienen el primer ejemplo: el "font panel"
de GNUstep y el de NeXTStep.
<br>
<A HREF="../../common/images/article195/fontp.jpg"><IMG
SRC="../../common/images/article195/fontpth.jpg" ALT="fontp.jpg" HEIGHT=240
WIDTH=360 ALIGN=TEXTTOP></A></TD>
<A HREF="../../common/images/article195/fontpn.jpg"><IMG
SRC="../../common/images/article195/fontpnth.jpg" ALT="fontpn.jpg" HEIGHT=240
WIDTH=360 ALIGN=TEXTTOP></A></TD>
</P>

<P>
Otro ejemplo interesante es Edit app. No funciona completamente pero es un
trabajo muy bueno y muy cercano al original.
Uno de los ejemplos m&aacute;s did&aacute;ctico se llama GSTest. Arrancar GSTest
permite entender todo lo relativo a ventanas, botones, scrollers... ¡Es
un todo en uno! Mirar el c&oacute;digo fuente es mejor que un libro.
Aunque &eacute;sto no significa que los otros ejemplos no tengan inter&eacute;s: ¡lo tienen!
El autor de muchas de las aplicaciones, Nicola Pero,
hizo un trabajo estupendo.
Otra gran aplicaci&oacute;n del mismo Nicola, se llama Finger. Es un
interfaz gr&aacute;fico para finger, ping, traceroute. Aqu&iacute; lo tienen:
<br>
<A HREF="../../common/images/article195/finger.jpg"><IMG
SRC="../../common/images/article195/fingerth.jpg" ALT="finger.jpg" HEIGHT=120 WIDTH=180 ALIGN=TEXTTOP></A></TD>
<br>
Podr&iacute;amos mencionar muchas otras aplicaciones pero dejamos el placer
de descubrirlas al lector.
</p>

<A NAME="lfindex3">&nbsp;</A>
<H2>Los Pesos Pesados</H2>

<p>
Una de las revoluciones de NeXTStep era Interface Builder. Como dice su
apellido, era una herramienta de creaci&oacute;n de interfaz para una
aplicaci&oacute;n. ¡Pero qu&eacute; herramienta! Recuerden que esto pasaba a
finales de los a&ntilde;os 80. ¡Incre&iacute;ble!
</p>

<p>
¿Por qu&eacute; fue una revoluci&oacute;n? Por que pod&iacute;an construir una ventana
con todo lo que necesita en menos de 5 minutos. Es decir, una ventana con su
men&uacute;, sus botones, sus sliders, etc, se creaba moviendo objetos desde una
paleta hacia la ventana. Despu&eacute;s se pod&iacute;an unir &eacute;stos objetos a otras
ventanas, men&uacute;s, o lo que fuera. Esto generaba un c&oacute;digo m&iacute;nimo que
ten&iacute;an que completar. Y estos objetos pod&iacute;an ser utilizados
de nuevo en otra parte.
¡Incre&iacute;ble a esta &eacute;poca!
</p>

<p>
Desde entonces, los mayores editores de software han tratado de hacer lo mismo,
aunque a mi humilde parecer, nunca han conseguido alcanzar al original.
Y ahora, podemos tener tal herramienta gratis. Se llama Gorm (GNUstep Graphics
Object Relationship Modeller) y el autor se llama Richard Frith-Macdonald.
Gorm s&oacute;lo est&aacute; disponible en CVS desde el site GNUstep. La versi&oacute;n
s&oacute;lo es 0.1 en el momento de escribir este art&iacute;culo, pero funciona
aunque le falten algunas caracter&iacute;sticas. Para descubrir la
filosof&iacute;a detr&aacute;s de Interface Builder, Gorm es LA herramienta.
</p>

<p>
Aqu&iacute; tienen un ejemplo muy sencillo (y est&uacute;pido), otra vez con el
equivalente bajo NeXTStep.
<br>
<A HREF="../../common/images/article195/gorm.jpg"><IMG
SRC="../../common/images/article195/gormth.jpg" ALT="gorm.jpg" HEIGHT=240
WIDTH=360 ALIGN=TEXTTOP></A>
<A HREF="../../common/images/article195/ib.jpg"><IMG
SRC="../../common/images/article195/ibth.jpg" ALT="ib.jpg" HEIGHT=240 WIDTH=360 ALIGN=TEXTTOP></A>
</p>

<p>
Como hemos dicho antes, esta herramienta y su modelo Interface Builder se usan
para crear la parte gr&aacute;fica de una aplicaci&oacute;n. Claro, no basta
para que dicha aplicaci&oacute;n funcione. Tendr&aacute;n que completar el
c&oacute;digo generado y mantener las diferentes fuentes como lo har&iacute;an
en cualquier proyecto. Y al final, tendr&aacute;n que compilar todo el
trabajo Es donde llega la segunda herramienta "pesada", llamada Project Builder
bajo NeXTStep y ProjectCenter bajo GNUstep. ProjectCenter es la obra de
Philippe C. D. Robert y la versi&oacute;n es 0.2. Otra vez, esta herramienta
funciona a pesar de su numero de versi&oacute;n. Pueden mantener un proyecto
como lo har&iacute;an bajo NeXTStep. Claro, queda mucho que hacer en el
tambi&eacute;n, pero vale la pena bajarlo.
</p>

<p>
Aqu&iacute; pueden ver a qu&eacute; parece comparado con su "padre".
<br>
<A HREF="../../common/images/article195/prcent.jpg"><IMG
SRC="../../common/images/article195/prcentth.jpg" ALT="prcent.jpg" HEIGHT=240
WIDTH=360 ALIGN=TEXTTOP></A>
<A HREF="../../common/images/article195/pb.jpg"><IMG
SRC="../../common/images/article195/pbth.jpg" ALT="pb.jpg" HEIGHT=240 WIDTH=360 ALIGN=TEXTTOP></A>
</p>

<p>
Usar estas dos herramientas es bastante f&aacute;cil si conocen NeXTStep u
OpenStep. Si nunca los han usado, tendr&aacute;n que entender la idea
detr&aacute;s. Hay mucha documentaci&oacute;n disponible y es recomendado
(para no decir obligatorio) leerla. Pero una vez entendido como funcionan...
¡No pueden vivir sin ellas! Han sido avisados.
</p>

<p>
Tenemos que mencionar otros grandes trabajos como GWorkspace o
GSBench. El GNU 3DKit es otra gran obra. Es una API creada para funcionar
encima de OpenGL. La encontrar&aacute;n en
<a href="http://www.nice.ch/~phip/softcorner.html">http://www.nice.ch/~phip/softcorner.html</a>
con muchas otras aplicaciones.
</p>

<A NAME="lfindex4">&nbsp;</A>
<H2>Utilidades</H2>

<p>
Las herramientas que vamos a mencionar aqu&iacute; fueron creadas para portar
aplicaciones desde OpenStep hacia GNUstep. Pero, de hecho, van mucho m&aacute;s
lejos, puesto que permiten tambi&eacute;n portar aplicaciones Mac OS X. Ese es un
punto importante: m&aacute;s sobre el asunto un poco m&aacute;s tarde.
</p>

<p>
Primero, hay una herramienta llamada OpenStep2GNUConverter, permitiendo
convertir un PBProject (proyecto de Project Builder) en un Makefile GNUstep. Es
decir, podr&aacute;n compilar un proyecto OpenStep en su m&aacute;quina Linux
(por ejemplo).
Para compilar este proyecto, necesitar&aacute;n otra herramienta llamada nfmake.
Una herramienta llamada nib2gmodel permite convertir un fichero nib (producido
con Interface Builder) en su equivalente bajo GNUstep, llamado gmodel. Por
&uacute;ltimo, pueden obtener gstep-db, lo que es una librer&iacute;a de base de datos
y a&uacute;n m&aacute;s, un interfaz Oracle.
NeXTStep y OpenStep prove&iacute;an interfaces para Sybase y Oracle, para
consultar bases de datos de &eacute;stos editores. GNUstep ofrece
lo mismo gratis (bajo NeXTStep u OpenStep, necesitaban el kit de desarrollo que
era muy caro, pero recib&iacute;an Enterprise Object Foundation gratis:
toneladas de ejemplos).
Claro, todas estas herramientas pueden ser bajadas desde el site GNUstep.
</p>

<p>
Desafortunadamente no pude probar todo eso, puesto que "s&oacute;lo" tengo una
vieja NeXTstation y estoy esperando (con impaciencia) la llegada de Mac OS X al
trabajo. Pero he tenido confianza en GNU desde hace unos 15 a&ntilde;os y no voy
a cambiar hoy ! Quiero decir: seguro que todo eso funciona. De todo modos, en
unos meses probar&eacute; todo eso...
</p>

<A NAME="lfindex5">&nbsp;</A>
<H2>Documentaci&oacute;n</H2>

<p>
Si les interesa desarrollar bajo este gran entorno, tienen mucha
documentaci&oacute;n disponible, como ya hemos dicho. La facilidad de uso no
es leyenda, pero a&uacute;n as&iacute; necesitan unos conocimientos sobre su funcionamiento.
En el site GNUstep, encontrar&aacute;n muchos enlaces interesantes. Sin embargo,
algunos de ellos merecen una atenci&oacute;n particular.
</p>

<p>
Si van a
<a href="http://www.gnustep.org/resources/documentation.html">http://www.gnustep.org/resources/documentation.html</a>
encontrar&aacute;n la documentaci&oacute;n general de GNUstep, es decir el libro
del Objective C, instrucciones de instalaci&oacute;n, FAQ...
Tambi&eacute;n hay una documentaci&oacute;n sobre la librer&iacute;a GNUstep.
A&uacute;n m&aacute;s, encontrar&aacute;n tutoriales. El de Nicola es muy
recomendable. Y pueden visitar
<a href="http://www.gnustep.it/nicola/Tutorials">http://www.gnustep.it/nicola/Tutorials</a>
Otra parte para visitar es la de los recursos: hay toneladas de enlaces hacia
art&iacute;culos, sites de desarrollo...
<a href="http://www.gnustep.net/">http://www.gnustep.net/</a> tambi&eacute;n es de
gran inter&eacute;s.
Es decir, pueden encontrar todo lo que necesitan para empezar con GNUstep.
</p>

<A NAME="lfindex6">&nbsp;</A>
<H2>Y NeXT (despu&eacute;s) ?</H2>

<p>
La extra&ntilde;a historia de NeXT sigue, esta vez esperamos con &eacute;xito, bajo el
apellido Mac OS X. ¡Que buena cosa! ¿Qu&eacute; piensan de un SO con m&aacute;s de 10
a&ntilde;os empezando una nueva carrera? Era muy adelantado, ¿no creen?
</p>

<p>
Pero ¿qu&eacute; significa para nosotros? Bueno, probablemente muchas aplicaciones muy
buenas, puesto que las que existen pueden ser facilmente recompiladas. Y no
olvidemos, que tanto Mac OS X como NeXTStep son sistemas Unix. Esto quiere decir
toneladas de aplicaciones potencialmente disponibles, tambi&eacute;n para Unixes
libres. En consecuencia, GNUstep es el entorno que necesitan...
Podr&iacute;amos decir que es un sue&ntilde;o: por fin, podremos
elegir el software que queremos para el uso que necesitamos. Desafortunadamente,
tenemos sol y sombra.
</p>

<p>
<strong>Sol</strong>
<br>
Un ejemplo: hoy, seg&uacute;n el SO utilizado, no tienen mucha alternativa
por lo que concierne los navegadores web. Ser&aacute; Netscape (y sus
derivados) o Exploder, es decir dos f&aacute;bricas con muchos bugs, agujeros de
seguridad, etc. Mac OS X propone OmniWeb: es un muy buen navegador. Usarlo
bajo NeXTStep es un placer, incluso siendo una versi&oacute;n bastante antigua.
Es el tipo de navegador en el cual pueden so&ntilde;ar hoy, cuando trabajan bajo
Unix o las cosas de M$. La &uacute;nica manera de encontrar navegadores "finos"
viene de lo que llamamos SO alternativos: tales como NetPositive bajo BeOS o
AWeb, por ejemplo, bajo AmigaOS. Claro, Opera parece atractivo, pero hasta ahora
no me ha convencido (pero s&oacute;lo es mi opini&oacute;n). Lo que quiero
decir, es que Mac OS X y GNUstep, van a proveer "nuevas"
herramientas, a menudo mejores que las que utilizamos hoy. Ya hemos tenido tales
herramientas hace unos diez a&ntilde;os... \!con NeXTStep!
</p>

<p>
Estp es as&iacute; para muchos tipos de software, y no solo para navegadores. Si van a
<a href="http://www.omnigroup.com/">http://www.omnigroup.com/</a> podr&aacute;n
ver muchas herramientas disponibles.
La diferencia principal entre GNUstep y Mac OS X viene del uso del X Window
System por el primero y no por el segundo. Esto ya fu&eacute; una queja para NeXTStep.
Aqu&iacute; es donde GNUstep se vuelve tan importante: permite usar estas
aplicaciones bajo X. Es probablemente una de las fuerzas del proyecto: esta
gente hizo un trabajo estupendo.
</p>

<p>
<strong>Sombra</strong>
<br>
Podemos tener miedo a la llegada a Mac OS X de Exploder y otras m...aletas de
software del mismo fabricante. Eso es un poco horroroso. Si estas aplicaciones
son nativas Mac OS X, podemos esperar lo peor: la entrada insidiosa
del ej&eacute;rcito de Redmond en el mundo del Unix libre. Claro, aqu&iacute; libre no
significa gratis puesto que estamos hablando de los ladrones de M$, pero... Si
quieren conocer a las aplicaciones en desarrollo para Mac OS X, echen un
vistazo a
<a href="http://www.apple.com/macosx/applications/">http://www.apple.com/macosx/applications/</a>
<br>
Vamos a decir que es la manera pesimista de pensar: ¡Esperen y vean!
</p>

<p>
No obstante, no olvidemos que GNUstep est&aacute; especialmente dise&ntilde;ado para
desarrollar. Cuando est&eacute; un poco m&aacute;s acabado, podr&aacute;n
desarrollar aplicaciones facilmente, como se hac&iacute;a bajo NeXTStep.
GNUstep es mucho m&aacute;s que un simple entorno, podr&iacute;amos decir que es
un verdadero IDE (Integrated Development Environment). Lo m&aacute;s importante
es que estas aplicaciones podr&aacute;n ser f&aacute;cilmente portables, hacia Mac
OS X, por ejemplo.
A prop&oacute;sito, no olvidemos el open source de Apple, Darwin, que pueden ver en
<a href="http://www.opensource.apple.com//">http://www.opensource.apple.com//</a>
</p>

<p>
Evidentemente, hay mucho m&aacute;s que decir sobre GNUstep pero estar&iacute;a
m&aacute;s all&aacute; del prop&oacute;sito de este art&iacute;culo. El objetivo era
darles ganas de probar este gr&aacute;n producto y, por qu&eacute; no, participar
en el proyecto.
</p>

<A NAME="lfindex7">&nbsp;</A>
<H2>Y la orquesta sigue tocando</H2>


<p>
Uno de mis placeres alrededor del software libre viene de &eacute;stos proyectos
que tratan de compensar las errores comerciales. Para mi, NeXTStep era una
verdadera revoluci&oacute;n. Soy muy feliz con mi vieja workstation y sus
10 a&ntilde;os, y no creen que est&aacute; cubierta de polvo: la uso cada
d&iacute;a a pesar de su CPU 68040/25 Mhz. Por suerte (o desafortunadamente),
mucha gente parece pensar lo mismo. Gracias a GNUstep y Window Maker por
proveernos tan gran trabajo.
</p>

<p>
La cosa m&aacute;s rara alrededor de NeXTStep viene del hecho que muchos
editores han tratado de "clonarlo"... y lo han logrado donde el modelo sali&oacute;
mal. Otra vez, tenemos que mencionar el Reino de Redmond: ¿han notado las
ventanas de W95 y sus gadgets? Bueno, echen un vistazo a las fotos de
pantallas de NeXTStep m&aacute;s arriba. NeXTStep apareci&oacute; en 1987 en los
Estados Unidos y alrededor de 1990 en Europa. Como dice su apellido, la cosa de
M$ apareci&oacute; m&aacute;s de cinco a&ntilde;os m&aacute;s tarde. Las hojas
volando de un directorio a otro, inventadas en los alrededores de Seattle, se
encontraban en NeXTStep 2.1, es decir alrededor de 1991...
Sin embargo, ¡por una vez, no han copiado in Redmond! Lo hicieron mucho mejor:
"compraron" gente de NeXT... Supongo por mucho, mucho dinero. ¡Pero
no hay derecho!
Esto para decir que NeXTStep nunca dej&oacute; la gente indiferente, lo que es
un eufemismo.
</p>

<p>
<a href="http://www.gnu.org/">GNU</a> es la referencia absoluta concerniendo el
software libre. El mundo entero debe mucho a GNU: cada SO se pudo beneficiar de su
trabajo. Sus compiladores son probablemente los mejores nunca visto, cualquier
que sea el SO. Eso es cierto para muchas otras herramientas. A&uacute;n m&aacute;s,
sus proyectos son a menudo (sino siempre) tan buenos como sus herramientas.
GNUstep es uno de ellos. A prop&oacute;sito, NeXTStep ten&iacute;a un directorio
GNU...
Si como a m&iacute;, no les gustan mucho los muy conocidos entornos de Unix (comercial o
libre), prueben GNUstep, van a "quererlo". A&uacute;n m&aacute;s, no
podr&aacute;n trabajar sin &eacute;l.
<br>
¡Disfruten!
</p>

<p>
¡Qu&eacute; &eacute;poca estupenda vivimos!


<!-- vim: set sw=2 ts=2 et: -->

<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=195&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article195.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>es</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-03-18, generated by lfparser version 2.1</font></p>
</BODY>
</HTML>
