<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Graphics">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Katja Socher
 =LF=CAT___: Graphics
 =LF=TITLE_: Jugando con los Dingbats y The Gimp
 =LF=NUMBER: 238
 =LF=ANAME_: article238.html
 -->
 <TITLE>lf238, Graphics: Jugando con los Dingbats y The Gimp</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/katjasocher.gif" alt="[Photo of the Author]" height="148" width="120">
<BR>por  Katja Socher <br> <small>&lt;katja(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<p>
Katja es la editora de LinuxFocus en alem&aacute;n. A ella le gustan Tux,
el cine, la fotograf&iacute;a y el mar. Puedes encontrar su p&aacute;gina
<a href="http://www.toppoint.de/~utuxfan/k/">aqu&iacute;</a>.
</p>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Gabriela Gonz&aacute;lez (<a href="http://www.webspawner.com/users/traductora/"><font size="1">homepage</font></a>)
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#238lfindex0">&iquest;Qu&eacute; son los Dingbats (caracteres decorativos)?</A></LI>
  <LI><A HREF="#238lfindex1">&iquest;D&oacute;nde conseguir estos caracteres o dingbats?</A></LI>
  <LI><A HREF="#238lfindex2">&iquest;C&oacute;mo puedo utilizar estos caracteres?</A></LI>
  <LI><A HREF="#238lfindex3">&iquest;Qu&eacute; puedo hacer con ellos?</A></LI>
  <LI><A HREF="#238lfindex4">Usando gradaciones de colores (gradients)</A></LI>
  <LI><A HREF="#238lfindex5">Script-Fu</A></LI>
  <LI><A HREF="#238lfindex6">Agregando algunos otros efectos...</A></LI>
  <LI><A HREF="#238lfindex7">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=238&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Jugando con los Dingbats y The Gimp</H2>
 <img src="../../common/images/article238/tuxswithflowers3.jpg" alt="[tuxswithsunflowers]" vspace="10" hspace="10" height="185" width="320">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<p>
En este art&iacute;culo te dar&eacute; ejemplos para que puedas crear f&aacute;cilmente
lindos dibujos mediante Dingbats (o caracteres decorativos) y The
Gimp. La versi&oacute;n de Gimp que se utiliz&oacute; en este art&iacute;culo es Gimp-1.2.2.
</p></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="238lfindex0">&nbsp;</A>
<H2>&iquest;Qu&eacute; son los Dingbats (caracteres decorativos)?</H2>


    <p>Probablemente ya hayas encontrado Dingbats al utilizar la herramienta
    de texto de Gimp. Dingbats son caracteres decorativos. Mientras probabas varias fuentes
    probablemente te encontraste con algunas llamadas, por ejemplo,
    dingbats, davysdingbats o davysotherdingbats que no eran
    letras normales sino peque&ntilde;os bosquejos de flores, un piano, animales,
    etc. Tal vez entonces te preguntaste que pod&iacute;as hacer con
    ellas. Sin embargo, sucede a menudo que al utilizar la herramienta de texto
    deseas incluir alg&uacute;n texto y m&aacute;s tarde cuando est&aacute;s buscando lindos
    motivos ya te has olvidado de esas fuentes. Vuelve a pensar en eso.
    Realmente te pueden ayudar a crear dibujos muy lindos en poco
    tiempo y no necesitas para ello ser muy talentoso para el dibujo.
    </p>

    <A NAME="238lfindex1">&nbsp;</A>
<H2>&iquest;D&oacute;nde conseguir estos caracteres o dingbats?</H2>


    <p>En este art&iacute;culo usar&eacute; principalmente dingbats que est&aacute;n incluidos
    en el paquete de sharefonts compartidas (davysdingbats, davysotherdingbats,&nbsp;...)
    ya que creo que muchos de ustedes ya las tendr&aacute;n instaladas
    en sus computadoras aunque les mostrar&eacute; tambi&eacute;n otros caracteres
    dingbats que me parecieron interesantes. Realmente hay toneladas de
    dingbats fascinantes que querr&aacute;s  instalar.<br>
    Puedes bajar las sharefonts de
    <a href="http://ibiblio.org/pub/Linux/X11/fonts/">
http://ibiblio.org/pub/Linux/X11/fonts/</a>
    y puedes encontrar una colecci&oacute;n de otros caracteres dingbats en <a href=
    "http://www.fontguy.com/">http://www.fontguy.com</a>.<br>
     Lee Andr&eacute; el art&iacute;culo de Pascual en <a href=
    "../November2001/article116.shtml">Fuentes y motivos con Gimp</a>
    para descubrir c&oacute;mo instalarlas.</p>

    <A NAME="238lfindex2">&nbsp;</A>
<H2>&iquest;C&oacute;mo puedo utilizar estos caracteres?</H2>

    <a href=
    "../../common/images/article238/screen_dynatext.gif"><img src=
    "../../common/images/article238/screen_dynatext_th.jpg" width=
    "250" height="193" alt="[DynamicText]" align="right" hspace=
    "5"></a>

    <p>Por supuesto que puedes utilizar la herramienta de texto normal pero existe una
    herramienta especial llamada GDyntext que te conviene utilizar aqu&iacute;. Encontrar&aacute;s
    GDyntext al hacer un click con el bot&oacute;n derecho en la imagen <br>
     Filter --&gt; Render --&gt; DynamicText<br>
    Al utilizarla puedes ver previamente los iconos y luego seleccionar el/los
    que t&uacute; deseas con tu rat&oacute;n (de la misma manera que copias y pegas algo)
    o si conoces la tecla tambi&eacute;n puedes pulsarla directamente.
    <br>
    Por defecto, la herramienta ya te muestra las letras del alfabeto
    tanto en letras min&uacute;sculas como en may&uacute;sculas. Sin embargo
    a veces hay pocos iconos disponibles que t&uacute;, por ejemplo, obtienes
    si presionas algunos caracteres especiales.<br>
    Otra forma de insertar iconos (y la que yo prefiero cuando busco
    nuevos iconos) es usar la ventana del <a
href="../../common/images/article238/screen_charmap.gif">mapa de caracteres</a>, que
    obtienes al presionar el bot&oacute;n que se encuentra m&aacute;s a la derecha
    en la barra superior de la ventana GDyntext. En el mapa puedes ver todos
    los caracteres disponibles en una fuente, y los puedes insertar en tu
    imagen. En la parte inferior a la izquierda tambi&eacute;n hay un peque&ntilde;o campo
    en el que puedes ver la tecla correspondiente.<br>
    Con GDyntext tambi&eacute;n puedes fijar el tama&ntilde;o del icono, que podr&aacute; ser
    mayor que el tama&ntilde;o disponible en la herramienta de texto.
    As&iacute; que tambi&eacute;n puedes querer utilizar GDyntext si deseas alg&uacute;n texto en un
    tama&ntilde;o muy grande.<br>
    Tambi&eacute;n puedes establecer en qu&eacute; color deseas tus caracteres (dingbats),
    rotarlos o determinar en qu&eacute; lugar de la imagen se encontrar&aacute;n
    posicionados. Al principio el color es el mismo que el de primer plano
    del men&uacute; principal de The Gimp pero cuando lo cambias
    posteriormente, no tendr&aacute; efecto alguno y tambi&eacute;n puedes elegir un color
    en la misma herramienta.<br>
    La &uacute;nica desventaja de utilizar esta herramienta es -por lo menos
    en mi computadora (Gimp1.2.2 con Mandrake8.0) -
    que a veces puede hacer caer a Gimp cuando bajas las numerosas
    fuentes especiales que pueden encontrarse.</p>

    <A NAME="238lfindex3">&nbsp;</A>
<H2>&iquest;Qu&eacute; puedo hacer con ellos?</H2>


    <p>Tal vez ya hayas detenido a observar estos caracteres decorativos o
dingbats a estas alturas. Por
    supuesto, hay algunos iconos como, por ej. el gran piano, que puedes utilizar
    as&iacute; como est&aacute;n, sin cambios:<br>
    <br>
    </p>

    <center>
      <img src="../../common/images/article238/grandpiano.jpg" alt=
      "[grand piano]" hspace="10" height="100" width="92"> <img
      src="../../common/images/article238/pandas.jpg" alt=
      "[pandas]" hspace="10" height="69" width="100"> <img src=
      "../../common/images/article238/dolphin.jpg" alt="[dolphin]"
      hspace="10" height="63" width="100"> <img src=
      "../../common/images/article238/penguin.jpg" alt="[penguins]"
      hspace="10" height="125" width="65">
    </center>
    <br>
    <br>
     Gran piano = davysotherdingbats: D. delfin = critters, por
    darrian: v. ping&uuml;ino = critters, por darrian: u <br>
     <br>
     o para algunos, como por ejemplo la rosa que utilizas para agregar
    color: <br>
    <br>


    <center>
      <img src="../../common/images/article238/rose.jpg" alt=
      "[rose]" hspace="10" height="97" width="100"> <img src=
      "../../common/images/article238/violins2.jpg" alt="[violins]"
      hspace="10" height="66" width="100"> <img src=
      "../../common/images/article238/easter.jpg" alt="[easter]"
      hspace="10" height="93" width="100"> <img src=
      "../../common/images/article238/smurf.jpg" alt="[smurf]"
      hspace="10" height="64" width="100">
    </center>
    <br>
    <br>
     Rosa = davysdingbats:  k. violines = davysotherdingbats: 5 .Pascuas =
    critters, por darrian: Q. smurf = Smurf: c <br>
    <br>
     Tal vez a&uacute;n no est&eacute;s del todo convencido de que puedes
    crear dibujos muy lindos f&aacute;cilmente con estos caracteres. Sin embargo &iexcl;es
    realmente muy f&aacute;cil! Con unos simples clicks de tu  rat&oacute;n
    puedes crear peque&ntilde;os dibujos muy lindos.<br>
    <br>

    <A NAME="238lfindex4">&nbsp;</A>
<H2>Usando gradaciones de colores (gradients)</H2>

    <img src=
    "../../common/images/article238/screen_gradient_button.gif"
    width="100" height="164" alt="[Gradient Button]" align="right"
    hspace="10">

    <p>A menudo un icono lucir&aacute; muy bien si lo completas con
    gradaciones de colores, o utilizas gradaciones de fondo.<br>
    Utilizar gradaciones en Gimp es muy f&aacute;cil. Para obtener una gradaci&oacute;n
    de tan s&oacute;lo dos colores, elige los dos colores que deseas como colores de fondo
    y de primer plano. Ahora haces doble click sobre el bot&oacute;n de gradaci&oacute;n
    (en la ventana principal, observa la pantalla a la
    derecha). La opci&oacute;n Mezclar (Blend) deber&iacute;a indicar: FG to BG (RGB). Ahora
    dibuja una l&iacute;nea con el rat&oacute;n de derecha a izquierda de
    tu dibujo y la imagen se completar&aacute; con una gradaci&oacute;n. Las opciones
    que encontrar&aacute;s en "gradient" (gradaci&oacute;n) determinan c&oacute;mo los colores de
    la gradaci&oacute;n se ubicar&aacute;n (p.e. lineal). Al variar la direcci&oacute;n o
    el largo de la l&iacute;nea que dibujas con el rat&oacute;n, tambi&eacute;n decidir&aacute;s
    c&oacute;mo se ver&aacute; la gradaci&oacute;n en tu imagen. Por supuesto,
    puedes utilizar gradaciones con m&aacute;s de dos colores.
    de Gimp,
    File--&gt;Dialogs--&gt;Gradients y
    podr&aacute;s ver una gran selecci&oacute;n de gradaciones. Si deseas utilizar una de ellas
    simplemente haz un click en ella para seleccionarla. Luego regresa al bot&oacute;n
    de gradaci&oacute;n y haz un doble click en &eacute;l nuevamente. La opci&oacute;n Mezclar (Blend)
    indicar&aacute; ahora "Custom Gradient" (gradaci&oacute;n personalizada). Luego repite la operaci&oacute;n y
    dibuja una l&iacute;nea con tu rat&oacute;n sobre la imagen y se completar&aacute; con la
    gradaci&oacute;n.</p>
    <b>Creando tus propias gradaciones</b>

    <p>Por supuesto, tambi&eacute;n puedes definir tus propias gradaciones. Para ello haz un
    click nuevamente en File--&gt;Dialogs--&gt;Gradients y elige una
    gradaci&oacute;n que se acerque a la que t&uacute; deseas lograr. Luego haz un
    click en Editar ("Edit"). Se abrir&aacute; una nueva ventana. Haz un click en "Copiar gradaci&oacute;n"
    (Copy Gradient) y asigna un nombre a tu elecci&oacute;n. Entonces la ver&aacute;s en la
    lista de gradaciones aunque a&uacute;n lucir&aacute; igual a la otra. No la editaremos.
    Nos mantendremos en la ventana "Gradaci&oacute;n de Edici&oacute;n" (Gradient Editor).
    Abajo ver&aacute;s los colores que componen la gradaci&oacute;n.
    Hay una l&iacute;nea donde podr&aacute;s observar algunos tri&aacute;ngulos.
    Entre dos tri&aacute;ngulos negros hay una secci&oacute;n y siempre cambiar&aacute;s
    una secci&oacute;n de una sola vez. Para ampliar la secci&oacute;n simplemente
    arrastra los tri&aacute;ngulos hasta el punto donde t&uacute; desees que est&eacute;n.
    Los colores del &aacute;rea que presentan un gris m&aacute;s oscuro se pueden cambiar.
    Haz un click derecho con el rat&oacute;n en la banda de colores y mant&eacute;nlo as&iacute;. Tendr&aacute;s
    varias opciones para elegir ahora: Puedes ver "Color de punto final
    izquierdo" (Left endpoint's color) y "Color de punto final derecho"
    (Right endpoints' color). Si te aproximas a estas opciones con el rat&oacute;n
    obtendr&aacute;s un c&iacute;rculo de color y podr&aacute;s elegir un nuevo
    color. El punto final de una secci&oacute;n deber&iacute;a tener el mismo
    color que el punto inicial de la secci&oacute;n adyacente si deseas un
    buen dibujo. Por supuesto esto no se aplica si deseas tener bordes
    sin cambios de color. Haciendo click en "Mezclar funci&oacute;n para la
    secci&oacute;n" ("Blending function for section") puedes decidir si el color
    se presentar&aacute; en forma lineal, en c&iacute;rculo, etc. Al hacer click en "Dividir segmentos en
    punto medio" (Split segments at midpoint) puedes dividir la secci&oacute;n en partes m&aacute;s peque&ntilde;as.</p>
    Veamos ahora algunos lindos dibujos: <br>
    <br>
    <br>


    <center>
      <img src="../../common/images/article238/trompet.jpg" alt=
      "[trompet]" hspace="10" height="135" width="73">
    </center>
    <br>
    <br>
     La trompeta es de davysotherdingbats, character r. Yo le d&iacute; una
gradaci&oacute;n
    de tonos amarillos y anaranjados. (Aseg&uacute;rate de que se ha seleccionado la trompeta
    porque de otro modo la totalidad de la imagen se completar&aacute; con la
    gradaci&oacute;n.) <br>
    <br>


    <center>
      <img src="../../common/images/article238/rabbitonhat.jpg"
      alt="[rabbitonhat]" hspace="10" height="200" width="217">
    </center>
    <br>
    <br>
     El conejo en el sombrero es de la fuente critters,
caracter b,
    y yo le di un color gris. En otro esquema eleg&iacute; un violeta y un
    tono gris como gradaci&oacute;n (gris=color de primer plano y
    violeta=color de fondo). En el medio del dibujo trac&eacute; una l&iacute;nea
    diagonal de un punto alto a uno m&aacute;s bajo (vertical con respecto
    a la l&iacute;nea que puedes ver) del largo del tono violeta m&aacute;s oscuro.
    <br>
    <br>


    <center>
      <img src="../../common/images/article238/sunflower.jpg" alt=
      "[sunflower]" hspace="10" height="200" width="200">
    </center>
    <br>
    <br>
     El girasol est&aacute; formado por dos iconos, los dos son de caracteres davysdingbats,
j y e. Al tallo le di un color verde. Para la flor utilic&eacute;
    una gradaci&oacute;n de tonos amarillos y anaranjados.<br>
    <br>
     <br>
    <br>
     Veamos un dibujo con una gradaci&oacute;n que hice yo misma:<br>
    <br>


    <center>
      <img src=
      "../../common/images/article238/comeandjointhefun.jpg" alt=
      "[comeandjointhefun]" hspace="10" height="190" width="190">
    </center>
    <br>
    <br>
     En primer lugar cre&eacute; el texto en un c&iacute;rculo. Para ello fui al
    men&uacute; principal e hice click en Xtns (a la derecha de File--&gt; Script Fu
    --&gt; Logo --&gt; Texto en c&iacute;rculo. Aqu&iacute; escrib&iacute;
    "Ven y &uacute;nete a la diversi&oacute;n" ("Come and join the fun") dejando un espacio al principio.
    De lo contrario la primera y la &uacute;ltima palabra estar&aacute;n muy juntas.
    Yo eleg&iacute; un radio de 80, c&iacute;rculo de inicio 0 y un &aacute;ngulo de cobertura de 360. Para
    el tama&ntilde;o de la fuente us&eacute; 25 y como fuente eleg&iacute; Jayne Print. El color del texto
    es el de primer plano del men&uacute;. Obtienes un dibujo separado
    de este modo. Borr&eacute; el fondo, abr&iacute; una nueva capa y le pegu&eacute;
    a los ping&uuml;inos adentro. Los ping&uuml;inos son de critters, I.
    Luego abr&iacute; de nuevo otra capa, la mov&iacute; hasta abajo
    y la complet&eacute; con la gradaci&oacute;n que yo cre&eacute;. <br>
    <br>
    &iquest;Qu&eacute; tal un bot&oacute;n? <br>
    <br>

    <center>
      <img src=
      "../../common/images/article238/buttonwithmouseandco.jpg"
      alt="[buttonwithmouseandco]" hspace="10" height="206" width=
      "225">
    </center>
    <br>
    <br>
     Como color de primer plano eleg&iacute; un azul suave y como color de fondo
    un azul oscuro. Luego abr&iacute; una imagen nueva con un fondo blanco.
    En una nueva capa eleg&iacute; un gran c&iacute;rculo con la herramienta de
    selecci&oacute;n y la complet&eacute; con esta gradaci&oacute;n de azul dibujando
    una l&iacute;nea con el rat&oacute;n de izquierda a derecha. Copi&eacute; esta capa
    y disminu&iacute; el tama&ntilde;o del c&iacute;rculo en ella.
    Luego la volv&iacute; a completar con la gradaci&oacute;n pero esta vez dibuj&eacute;
    una l&iacute;nea de derecha a izquierda. Repet&iacute; estos pasos para una tercera capa
    que ubiqu&eacute; por encima de estas dos. Pegu&eacute; el c&iacute;rculo adentro, lo llev&eacute; a una
    escala menor y luego lo complet&eacute; con la gradaci&oacute;n, esta vez dibujando nuevamente
    una l&iacute;nea de izquierda a derecha. Despu&eacute;s, en otra capa sobre ellas, pegu&eacute;
    el icono con el rat&oacute;n y las flores (de critters, A).
    Luego hice un click derecho en la secuencia de comandos de la capa
    Fu--&gt;Shadow--&gt;Drop-Shadow. <br>
    <br>


    <A NAME="238lfindex5">&nbsp;</A>
<H2>Script-Fu</H2>


    <p>Script-Fu son comandos que te permiten obtener con un click un
    efecto que de otro modo necesitar&iacute;as varios pasos. Puedes
    conseguir los Script-Fu bien haciendo un click derecho en la imagen o bien
    con un click en Xtns (junto a File en la parte superior de la ventana
    principal de Gimp). Debes hacer un click derecho en la imagen
    para trabajar con im&aacute;genes ya dise&ntilde;adas mientras que si haces click en
    Script-Fu sobre Xtns puedes crear una nueva imagen y determinar
    qu&eacute; fuente de texto y color usar, as&iacute; como qu&eacute; texto escribir.</p>
    Veamos algunos dibujos:<br>
    <br>

    <center>
      <img src="../../common/images/article238/rosewithchrome.jpg"
      alt="[rosewithchrome]" hspace="10" height="140" width="157">
    </center>
    <br>
    <br>
     Selecciona la rosa de davysdingbats, caracter k, y luego un click
derecho en
    Script-Fu --&gt; Alpha to Logo--&gt; Chrome. <br>
    <br>


    <center>
      <img src=
      "../../common/images/article238/grandpianogradientbevel.jpg"
      alt="[grandpianogradientbevel]" hspace="10" height="144"
      width="116">
    </center>
    <br>
    <br>
    Elige el gran piano de davysotherdingbats, caracter D. Yo us&eacute;
un tama&ntilde;o
    de 140 aqu&iacute;. Luego haz un click derecho en la imagen
    Script-Fu--&gt;Alpha to Logo--&gt; gradient bevel.<br>
    <br>

    <center>
      <img src="../../common/images/article238/catglossy.jpg" alt=
      "[catglossy]" hspace="10" height="139" width="203">
    </center>
    <br>
    <br>
     Elige el gato de davysotherdingbats, caracter 0, y
luego haz un click derecho en
    Script-Fu--&gt;Alpha to Logo--&gt;Glossy.<br>
    <br>
     <br>


    <center>
      <img src="../../common/images/article238/pianoplaying.jpg"
      alt="[pianoplaying]" hspace="10" height="300" width="300">
    </center>
    <br>
    <br>
     Yo tom&eacute; el gran piano de davysotherdingbats, D, la segunda gran mano
    (derecha) de davysotherdingbats, 2, (Tomas ambas manos y luego
    simplemente borras la primera (la mano izquierda) y tomas la mano derecha
    dos veces, y la cabeza de davysotherdingbats, 3 tambi&eacute;n y
    las colocas c&oacute;mo puedes ver en la imagen. Imit&eacute; las manos
    horizontalmente y borr&eacute; los dedos superiores.
    Luego se hace un click derecho en Script-Fu--&gt;Alpha to Logo--&gt; Textured.
    <br>
    Aqu&iacute; utilic&eacute; las siguientes configuraciones:<br>
    Tama&ntilde;o del borde (pixels):20<br>
    Modelo: aqu&iacute; utilic&eacute; un modelo madera (wood) <br>
    Tipo mosaico: Squares<br>
    Color de fondo: blanco (Hue: -1, Saturation:0, Valor, Rojo,
    Verde y Azul = 1)<br>
    Mezcla inicial: naranja: aqu&iacute; se utiliza el color del primer plano de
    Gimp, que es: H=29, S=73, V=91, R=234,
    G=147, B=61, HexTriplet:#ea933d <br>
    Mezcla final: amarillo: Hue: 43.76, Saturation: 0.77, Valor:
    0.92, Rojo: 0.92, Verde: 0.73, Azul: 0.21)<br>
    <br>


    <A NAME="238lfindex6">&nbsp;</A>
<H2>Agregando algunos otros efectos...</H2>


    <center>
      <img src="../../common/images/article238/happybirthday2a.jpg"
      alt="[happybirthday1]" hspace="10" height="300" width="300">
    </center>
    <br>
    <br>
    Coloqu&eacute; todo como puedes ver en el dibujo. Las bailarinas y
    el pianista son de davysdingbats, L. Borr&eacute; la bandera
    del encabezado y les di su color, haciendo sus manos
    blancas. Para los ojos tom&eacute; un gran pincel y dibuj&eacute; dos
    puntos. Las estrellas son ambas las mismas (dingbats, U) con
    diferentes tama&ntilde;os. Pegu&eacute; la estrella en una capa y le di su
    color. Luego abr&iacute; una nueva capa, copi&eacute; &amp; la pegu&eacute;,
    la imit&eacute; horizontalmente y la complet&eacute; con el segundo color.
    El gran piano es de davysotherdingbats,D. La fuente de texto es
    amaze. El teclado del piano es de davysotherdingbats, e. En una
    capa debajo del teclado complet&eacute; el espacio intermedio
    con color blanco. Fusion&eacute; las dos capas. Puedes hacer esto haciendo
    los ojos en el casillero de la capa de las otras capas que no son del
    piano y que se encuentran invisibles (haciendo click sobre ellas). Ahora s&oacute;lo
    se ver&aacute; el teclado del piano. Haz un click derecho en las capas
    --&gt;fusiona las capas visibles y se fusionar&aacute; el piano. Luego haz un click derecho
    en Filters--&gt;Distorts--&gt;IWarp. Aqu&iacute; las deform&eacute; con las opciones mover
    y aumentar. Simplemente deform&eacute; el tablero
    hasta que me gust&oacute;. Ahora
    vuelve a hacer visible las otras capas y haz un click derecho en Layer--&gt;Fusiona
    las capas visibles. Luego haz un click derecho en Script-Fu--&gt;Alpha to
    Logo--&gt;Blended (con los valores por defecto). <br>
    <br>
     <br>


    <center>
      <img src="../../common/images/article238/penguinsframe.jpg"
      alt="[penguinsframe]" hspace="10" height="310" width="309">
    </center>
    <br>
    <br>
     Tom&eacute; una imagen vac&iacute;a y luego hice un click derecho en
    ScriptFu--&gt;Decor--&gt;Add Border (valores por defecto). Luego
   otro click derecho en la imagen ScriptFu--&gt;Alpha to
    Logo--&gt;Glossy. Luego simplemente agregu&eacute; el grupo de ping&uuml;inos de
    critters, z. <br>
    <br>


    <center>
      <img src=
      "../../common/images/article238/sunflowerswithcats.jpg" alt=
      "[sunflowerswithcats]" hspace="10" height="240" width="320">
    </center>
    <br>
    <br>
    Pegu&eacute; el teclado del piano (davysotherdingbats, e) y llen&eacute; el
    espacio con blanco en una nueva capa y fusion&eacute; las dos como se
    describi&oacute; arriba. Luego hice un click derecho en la capa con el piano
    (filtros del teclado) keyboard Filters--&gt;Distorts--&gt;CurveBend. Aqu&iacute; puedes
    "dise&ntilde;ar" una curva en el sentido en que se doblar&aacute; el teclado.
    Entonces tom&eacute; una nueva capa y pegu&eacute; dos gatos
    (davysotherdingbats, 0) en ella, los rot&eacute; para que se vieran
    en la figura, eleg&iacute; un tono verde y agregu&eacute; los ojos. Tom&eacute; una
    nueva capa y la complet&eacute; con muchas de las imagenes de
    girasoles que se describieron antes de la forma en que las ves en el dibujo. Como
    fondo eleg&iacute; una gradaci&oacute;n de azul y verde. <br>
     <br>


    <center>
      <img src="../../common/images/article238/meadow.jpg" alt=
      "[meadow]" hspace="10" height="240" width="320">
    </center>
    <br>
    <br>
     Llen&eacute; una capa con girasoles como en el dibujo anterior.
    Luego le agregu&eacute; otra capa abajo y la complet&eacute; con girasoles
    en donde las flores contemplan una gradaci&oacute;n en rojo. Nuevamente
    otra capa abajo y la llen&eacute; con girasoles con gradaci&oacute;n violeta y
    una vez m&aacute;s con girasoles con gradaci&oacute;n verde. Para los girasoles
    amarillos/naranja y violetas llen&eacute; el centro de la flor
    con amarillo. Los girasoles tienen esta forma as&iacute; que
    agregu&eacute; una nueva capa abajo y llen&eacute; el espacio de las flores con
    amarillo para obtener este efecto. Para las flores azules y rojas
    simplemente llen&eacute; el centro de las flores con amarillo
    (pint&eacute; arriba del otro color). Como fondo, complet&eacute; con una gradaci&oacute;n
    verde.
     <br>
    <center>
      <img src="../../common/images/article238/flowermeadow.jpg"
      alt="[flowermeadow]" hspace="10" height="405" width="540">
    </center>
    <br>
     Este dibujo es similar al anterior. As&iacute; que toma el dibujo
    y simplemente reemplaza la gradaci&oacute;n de fondo, completa el fondo
    con el modelo de las hojas.
    Luego haz un click en la capa con los girasoles azules. Haz un click
    derecho en el filtro de la capa Filter--&gt;Map--&gt;Fractal Trace (configuraciones
    por defecto). Finalmente borr&eacute; algunos tallos que, a mi juicio, sobraban.
    Eso es todo.
    <br>
     Imagino que ahora tienes un mont&oacute;n de ideas para crear
    im&aacute;genes que superar&aacute;n a las m&iacute;as.<br>
     &iexcl;Hazlo y divi&eacute;rtete! :-)<br>


<A NAME="238lfindex7">&nbsp;</A>
<H2>Referencias</H2>


<ul>
  <li>El sitio web de The Gimp:
  <a href="http://www.gimp.org">http://www.gimp.org</a>
  </li>
  <li>Un sitio con muchas buenas ideas para gr&aacute;ficos 2D:
  <a href="http://www.webreference.com/graphics/">http://www.webreference.com/graphics</a>
  </li>
</ul>





<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=238&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Katja Socher, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article238.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Katja Socher <small>&lt;katja(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Gabriela Gonz&aacute;lez (<a href="http://www.webspawner.com/users/traductora/"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-03-12, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
