<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="Games">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf237, Games: Revisi&oacute;n de Juego Barrel Patrol 3D</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Harald Radke
 =LF=CAT___: Games
 =LF=TITLE_: Revisi&oacute;n de Juego Barrel Patrol 3D
 =LF=NUMBER: 237
 =LF=ANAME_: article237.html
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Harald-Radke.gif" WIDTH=110 HEIGHT=135 ALT="[Photo of the Author]">
<BR>por  Harald Radke <br> <small>&lt;harryrat(at)gmx.de&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<P>Harry estudia ciencia computacional en la Universidad de la Tecnolog&iacute;a en Aachen, Alemania, desde 1994. Entr&oacute; en el mundo Linux en 1995. Desde entonces anda metido en ello y siempre se sorprende de esta gran pieza de software. He programa un poco bajo X, le gustan los gr&aacute;ficos y por supuesto jugar a juegos. Otros de sus hobbies son: los juegos de mesa, leer ciencia-ficci&oacute;n, tocar la guitarra (mal), cocinar y practicar Ju-Jutsu.</P>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
David Losada <small>&lt;losadaz-(at)-euskalnet-(dot)-net&gt;</small>
<br>
<!--
 =LF=TRANSTO=es: David Losada
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#237lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#237lfindex1">Jugando al Juego</A></LI>
  <LI><A HREF="#237lfindex2">Conclusiones</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=237">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Revisi&oacute;n de Juego Barrel Patrol 3D</H2>
 <IMG SRC="../../common/images/article237/barrel_3d_logo.png" WIDTH=106 HEIGHT=68 ALT="[Illustration]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->
<I><P>Barrel Patrol 3D </I>es peque&ntilde;o y astuto juego 3d, basado en <I>Ripoff</I>, un cl&aacute;sico juego arcade de principios de los ochenta. </P>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


<A NAME="237lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

<P>A todos aquellos que nunca hayan jugado a Ripoff (como yo): Tu misi&oacute;n es proteger barriles de ser robados por tanques enemigos. Tu mismo tambi&eacute;n controlas un tanque equipado con un arma. B&aacute;sicamente tienes que destruir esos tanques para evitar que tus barriles sean eliminados adem&aacute;s de evitar ser disparado por los tanques enemigos que tambi&eacute;n est&aacute;n armados. En este art&iacute;culo revisaremos la versi&oacute;n 0.90 de Barrel Patrol 3D. </P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0>
<TR><TD VALIGN="MIDDLE">
<P><TBODY></P>
<P ALIGN="CENTER"><A HREF="../../common/images/article237/barrelpatrol-sc1.jpg"><IMG SRC="../../common/images/article237/barrelpatrol-sc1s.jpg" BORDER=0 WIDTH=287 HEIGHT=96 ALT="IMG: Standard View"><BR>
<I>Vista est&aacute;ndar, t&uacute; eres el m&aacute;s cercano</I></A></P>
<P></TBODY></TD>
</TR>
</TABLE>
</CENTER></P>

<H2 ALIGN="CENTER">Prepar&aacute;ndose para jugar</H2>
<P>Barrel Patrol 3D est&aacute; disponible para varias plataformas, incluido por supuesto Linux. Puedes conseguirlo de la p&aacute;gina <A HREF="http://www.fathomgames.com/">Fathon Entertainment</A> (pinchando en imagen en miniatura). No hay paquete con el c&oacute;digo fuente, s&oacute;lo un tar-ball zipeado con un binario precompilado y el fichero de datos. El archivo tiene un tama&ntilde;o aprox. 1 MB, por lo que no es problema para descargarlo incluso con conexiones lentas.</P>
<P>Despu&eacute;s de haberlo guardado en nuestro disco duro lo puedes extraer con <TT>tar -xzf &lt;NOMBREARCHIVO&gt;</TT>, ser&aacute; creado un nuevo directorio que contiene los ficheros. Simplemente cambie a ese directorio e introduzca <TT>./barrel_patrol_3d</TT>. Aparte del binario y el archivo de datos, hay un README con algunos requisitos.</P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0>
<TR><TD VALIGN="MIDDLE">
<P><TBODY></P>
<B><FONT COLOR="#ffffff"><P ALIGN="CENTER">Requerimientos</B></FONT></TD>
</TR>
<TR><TD VALIGN="MIDDLE">
<P>Sistema de ventanas X</TD>
</TR>
<TR><TD VALIGN="MIDDLE">
<P>Simple DirectMedia Layer (SDL)</TD>
</TR>
<TR><TD VALIGN="MIDDLE">
<P>OpenGL</TD>
</TR>
<TR><TD VALIGN="MIDDLE">
<P>Una tarjeta gr&aacute;fica 3D (recomendado)</TBODY></TD>
</TR>
</TABLE>
</CENTER></P>

<P ALIGN="CENTER"><BR>
<I>Nota: Tuve algunos problemas para hacer el juego funcionar con SDL 1.2.0, b&aacute;sicamente se colgaba. Despu&eacute;s de actualizar a SDL 1.2.3. funcion&oacute; sin fallos.</P>
</I><A NAME="237lfindex1">&nbsp;</A>
<H2>Jugando al Juego</H2>

<P>El juego tiene lugar en un &aacute;rea circular. El campo de juego est&aacute; rodeado de un campo de fuerza que usted como jugador no puede traspasar. Se controla un tanque futurista, equipado con una pistola para disparar a esos tanques enemigos que merodean tratando de llevarse tus barriles y sacarlos del &aacute;rea de juego. Los enemigos adem&aacute;s pueden dispararle a usted (y a otros tanques), por lo que no s&oacute;lo hay que tratar de cazarlos sino que tambi&eacute;n hay que evitar ser disparado. De vez en cuando aparecen ayudas y se pueden recoger para incrementar la potencia de fuego. Sin embargo esas «ayudas» sirven para <I>todos</I> los veh&iacute;culos, por lo que los enemigos tambi&eacute;n pueden conseguir mejores armas. Todas las ayudas son operativas hasta que el tanque es convertido en trocitos. Adem&aacute;s se pueden acumular.</P>
<P>El juego es bastante f&aacute;cil de jugar, se puede acelerar en la direcci&oacute;n a la que el mismo apunta, reducir y girar. La pistola se gira para apuntar siempre hacia delante y no hay posibilidad de apuntar a un objetivo con ella. Las ayudas aparecen como diferentes grandes letras y desaparecen despu&eacute;s de alg&uacute;n tiempo por lo que hay que ser r&aacute;pido o desaparecer&aacute;n, o porque el tiempo se ha acabado o, a&uacute;n peor, recogidas por el enemigo.</P>
<P>El juego consiste en varios niveles, con un n&uacute;mero fijo de barriles y enemigos. Una vez que todos los enemigos son destruidos se pasa al siguiente nivel. Despu&eacute;s de cada nivel se consiguen puntos por cada barril que ha quedado dentro del terreno de juego. De nivel a nivel el juego se hace cada vez m&aacute;s dif&iacute;cil, el enemigo se vuelve mejor y al mantenerse en un sitio desde el que disparar a esos tanques seguramente sea alcanzado. Un disparo es suficiente para destruir un tanque enemigo. Tu veh&iacute;culo en cambio es un poco m&aacute;s resistente y puede recibir m&aacute;s da&ntilde;os. Si se es alcanzado demasiado a menudo, tu tanque explota. Sin embargo, la &uacute;nica consecuencia final de esto es que se pierden todos los a&ntilde;adidos y una clase de castigo (unos pocos segundos), en los que tienes que ver a los tanques movi&eacute;ndose y probablemente llev&aacute;ndose fuera los barriles sin poderlo evitar. No hay recomienzo de nivel o alguna «vida» que te quiten cada vez que tu tanque es convertido a piezas. Al recoger ayudas se incrementa la potencia de fuego, por ejemplo tus misiles van m&aacute;s r&aacute;pido, rebotan en el campo de fuerza o se consiguen misiles buscadores. &iexcl;No olvidar que con el enemigo pasa lo mismo! Aparte de la zona de juego, se pueden ver en pantalla tu puntuaci&oacute;n actual, el n&uacute;mero de barriles que quedan, una pantalla de radar y un indicador de da&ntilde;os.</P>
<P>El juego finaliza cuando todos tus barriles han sido robados y llevados fuera de la zona de juego</P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0>
<TR><TD VALIGN="MIDDLE">
<P><TBODY></P>
<P ALIGN="CENTER"><A HREF="../../common/images/article237/barrelpatrol-sc2.jpg"><IMG SRC="../../common/images/article237/barrelpatrol-sc2s.jpg" BORDER=0 WIDTH=287 HEIGHT=96 ALT="IMG: Top View"><BR>
<I>Vista superior, como una versi&oacute;n 2D</I></A></P>
<P></TBODY></TD>
</TR>
</TABLE>
</CENTER></P>

<H2 ALIGN="CENTER">Opciones</H2>
<P>Presionando <TT>ESC</TT> durante el juego har&aacute; aparecer un men&uacute; de opciones donde se pueden modificar tanto las opciones de gr&aacute;ficos y sonido como cambiar la vista de juego entre la vista normal desde la que se ve tu tanque, vista desde dentro o a&eacute;rea. Adem&aacute;s se puede cambiar de ventana a modo pantalla completa y los controles del tanque. Por defecto tu tanque se mueve con las teclas de direcci&oacute;n y se dispara con <TT>ESPACIO</TT>. Entre las opciones gr&aacute;ficas se incluye mostrar obst&aacute;culos, sombras y el radar adem&aacute;s del nivel de detalle del humo.</P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0>
<TR><TD VALIGN="MIDDLE">
<P><TBODY></P>
<P ALIGN="CENTER"><A HREF="../../common/images/article237/barrelpatrol-sc4.jpg"><IMG SRC="../../common/images/article237/barrelpatrol-sc4s.jpg" BORDER=0 WIDTH=287 HEIGHT=96 ALT="IMG: Options Menu"><BR>
<I>El men&uacute; opciones</I></A></P>
<P></TBODY></TD>
</TR>
</TABLE>
</CENTER></P>

<H2 ALIGN="CENTER">Apariencia</H2>
<P>A pesar de los juegos como <I>Return to Castle Wolfenstein</I> son el «estado del arte» y Barrel Patrol 3D no se puede comparar con ellos, los gr&aacute;ficos son realmente buenos y puede que de los mejores en la escena Linux. El campo de fuerza es animado con reflejos de luz que se mueven y los tanques y barriles est&aacute;n muy bien modelados y texturados. La parte de atr&aacute;s muestra una imagen de unas oscuras monta&ntilde;as creando una atm&oacute;sfera surrealista realmente buena (eh, robar barriles con un tanque futurista de una zona rodeada por un campo de fuerza es algo bastante surrealista, &iquest;no es as&iacute;?). Tanto los barriles siendo lanzados al terreno de juego al principio de cada nivel como al ser retirados cuando el enemigo los saca del campo de fuerza est&aacute; tan bien animado como la aparici&oacute;n de ayudas y la explosi&oacute;n de los veh&iacute;culos. Cada acci&oacute;n y evento est&aacute; acompa&ntilde;ada de efectos de sonido particulares. El juego s&oacute;lo tiene efectos de sonido, no hay m&uacute;sica de fondo. El n&uacute;mero de pantallas mostradas por segundo que se ve en la esquina superior derecha es bastante alto en un Athlon Thunderbird 1.4 Ghz y una GForce 2 MX. Realmente es bastante alto, por lo que incluso en m&aacute;quinas menos potentes con aceleradores gr&aacute;ficos 3D anteriores el juego deber&iacute;a correr lo suficientemente r&aacute;pido como para divertirse un mont&oacute;n con &eacute;l.</P>
<A NAME="237lfindex2">&nbsp;</A>
<H2>Conclusiones</H2>

<P>Barrel Patrol 3D realmente es un buen mini-juego arcade. Lleva puede que un minuto entender las reglas del juego y la diversi&oacute;n durar&aacute; horas si te gustan este tipo de juegos. Los gr&aacute;ficos son muy buenos, creo que tanto como los de <I>Descent 3</I>, en lo &uacute;nico con lo que no est&eacute;s de acuerdo puede que sea el hecho de que la profundidad del juego no sea nada comparada a aqu&eacute;l legendario juego de disparos 3D.<BR>
El juego est&aacute; siendo desarrollado a&uacute;n (eh, &iexcl;es un juego Linux!); se plantean mejoras. Sin embargo el juego es totalmente jugable. Hay dos cosas que echo de menos en Barrel Patrol 3D: algo de m&uacute;sica atmosf&eacute;rica de fondo y alguna clase de modo multijugador. Esto har&iacute;a sin duda de Barrel Patrol 3D uno de los mejores juegos Linux.</P>
<P ALIGN="CENTER"><CENTER><TABLE CELLSPACING=0 BORDER=0>
<TR><TD VALIGN="MIDDLE">
<P><TBODY></P>
<P ALIGN="CENTER"><A HREF="../../common/images/article237/barrelpatrol-sc3.jpg"><IMG SRC="../../common/images/article237/barrelpatrol-sc3s.jpg" BORDER=0 WIDTH=287 HEIGHT=96 ALT="IMG: Tank View"><BR>
<I>Vista del tanque, la versi&oacute;n en primera persona</I></A></P>
<P></TBODY></TD>
</TR>
</TABLE>
</CENTER></P>

<H2 ALIGN="CENTER">Referencias</H2>

<UL>
<LI>El sitio web de <A HREF="http://www.fathomgames.com/">Fathom Entertainment</A> </LI>
<LI>El <A HREF="http://www.happypenguin.org/show?Barrel%20Patrol%203D">Linux Game Tome entry</A> de Barrel Patrol 3D en los que se detallan algunos comentarios de jugadores Linux<BR>
<BR>
<!-- vim: set sw=2 ts=2 et: --></LI></UL>



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=237"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Harald Radke, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Harald Radke <small>&lt;harryrat(at)gmx.de&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: David Losada &lt;losadaz-(at)-euskalnet-(dot)-net&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-12-02, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
