<HTML>
<HEAD>
<TITLE>Serie COMO de Linux: Trucos serie y miscel&aacute;neas</TITLE>
</HEAD>
<BODY>
<A HREF="Serie-Como-10.html">Anterior</A>
<A HREF="Serie-Como-12.html">Siguiente</A>
<A HREF="Serie-Como.html#toc11">Indice</A>
<HR>
<H2><A NAME="s11">11. Trucos serie y miscel&aacute;neas</A></H2>

<P> </P>
<P>Aqu&iacute; vienen algunos trucos serie que puede encontrar &uacute;tiles ...</P>

<H2><A NAME="ss11.1">11.1 <CODE>kermit y zmodem</CODE></A></H2>


<P>Para usar zmodem con <CODE>kermit</CODE>, a&ntilde;ada lo siguiente a <CODE>.kermc</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
define rz !rz &lt; /dev/cuaN &gt; /dev/cuaN
define sz !sz \%0 &gt; /dev/cuaN &lt; /dev/cuaN
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Aseg&uacute;rese de poner el puerto correcto en el que est&aacute; el m&oacute;dem.  Despu&eacute;s,
para usarlo, solamente escriba <CODE>rz</CODE> o <CODE>sz
&lt;nombre_de_fichero&gt;</CODE> en la l&iacute;nea de comandos de <CODE>kermit</CODE>. </P>


<H2><A NAME="ss11.2">11.2 Activando los tipos de terminal autom&aacute;gicamente</A></H2>


<P>Para activar autom&aacute;gicamente un tipo de terminal cuando se conecte,
a&ntilde;&aacute;dalo al fichero <CODE>/etc/inittab</CODE>. Si tengo un terminal vt100 en
<CODE>ttyS1</CODE>, debo a&ntilde;adir ``vt100'' al comando <CODE>getty</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
S1:456:respawn:/sbin/getty ttyS1 DT9600 vt100
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Tambi&eacute;n puede conseguir <CODE>tset</CODE> en <CODE>
<A HREF="ftp://sunsite.unc.edu:/pub/Linux/system/Terminal-management">ftp://sunsite.unc.edu:/pub/Linux/system/Terminal-management</A></CODE> o
en un servidor espejo. Vea los documentos que vienen con <CODE>tset</CODE> para
aprender como usarlo. <CODE>tset</CODE> puede establecer las caracter&iacute;sticas de un
terminal cuando usted se conecte, y no depende de ninguna opci&oacute;n por
defecto. </P>


<H2><A NAME="ss11.3">11.3 <CODE>ls</CODE> en color en conexiones serie</A></H2>


<P>Si <CODE>ls</CODE> est&aacute; causando problemas en la emulaci&oacute;n del terminal con la
opci&oacute;n de color, descon&eacute;ctela. <CODE>ls --color</CODE>, y <CODE>ls --colour</CODE> usan
las caracter&iacute;sticas de color. Algunas instalaciones tienen <CODE>ls</CODE>
preparado para usar el color por defecto. Busque en <CODE>/etc/profile</CODE>
y <CODE>/etc/csh.cshrc</CODE> alias de <CODE>ls</CODE>.  Tambi&eacute;n puede ponerle el
alias <CODE>ls --no-color</CODE> a <CODE>ls</CODE>, si no quiere cambiar la configuraci&oacute;n
por defecto del sistema. </P>


<H2><A NAME="ss11.4">11.4 Imprimiendo en una impresora conectada a un terminal</A></H2>

<P>     </P>
<P>Hay un programa llamado <CODE>vtprint</CODE> que hace esto, escrito por Garrett
D'Amore, <CODE>garrett@sdsu.edu</CODE>. Est&aacute; disponible en <CODE>
<A HREF="ftp://ftp.sdsu.edu/pub/vtprint">ftp://ftp.sdsu.edu/pub/vtprint</A></CODE>, y en <CODE>
<A HREF="http://www.sdsu.edu/~garrett">http://www.sdsu.edu/~garrett</A></CODE>. Lo siguiente ha sido
extra&iacute;do del fichero <CODE>README</CODE> que viene con el programa: </P>
<P>
<BLOCKQUOTE>
vtprint es un programa que permite a los usuarios imprimir desde un
anfitri&oacute;n Unix remoto a una impresora conectada a un terminal local o
emulador, lo cual es perfecto para imprimir ficheros en casa, etc. (S&oacute;lo
con ficheros de texto, creo.) 
</BLOCKQUOTE>
</P>


<H2><A NAME="ss11.5">11.5 ¿Puede linux configurar los dispositivos serie autom&aacute;gicamente?</A></H2>


<P>S&iacute;. Para conseguir que Linux detecte y configure los dispositivos serie
autom&aacute;ticamente al arrancar, a&ntilde;ada la l&iacute;nea: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/sbin/setserial /dev/cuaN auto_irq skip_test autoconfig
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>al fichero <CODE>/etc/rc.d/rc.local</CODE> o <CODE>/etc/rc.d/rc.serial</CODE>. 
Haga esto para cada puerto serie que quiera que se autoconfigure. 
Aseg&uacute;rese de poner un nombre de dispositivo que realmente exista en su
m&aacute;quina. </P>

<H3>Notas sobre placas multipuerto</H3>


<P>Para direcciones de placas, e IRQs, mire en <CODE>rc.serial</CODE> que viene con
el programa <CODE>setserial</CODE>. Trae muchos detalles sobre placas multipuerto,
incluyendo las direcciones de E/S y los nombres de los dispositivos. </P>


<HR>
<A HREF="Serie-Como-10.html">Anterior</A>
<A HREF="Serie-Como-12.html">Siguiente</A>
<A HREF="Serie-Como.html#toc11">Indice</A>
</BODY>
</HTML>
