<HTML>
<HEAD>
<TITLE>Serie COMO de Linux: Programas interesantes que deber&iacute;a conocer</TITLE>
</HEAD>
<BODY>
<A HREF="Serie-Como-3.html">Anterior</A>
<A HREF="Serie-Como-5.html">Siguiente</A>
<A HREF="Serie-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Programas interesantes que deber&iacute;a conocer</A></H2>

<H2><A NAME="ss4.1">4.1 ¿Qu&eacute; es <CODE>getty</CODE>?</A></H2>


<P><CODE>getty</CODE> es un programa que controla el proceso de login cuando se
conecta a una m&aacute;quina Unix. Puede necesitar <CODE>getty</CODE> si quiere que sea
posible llamar a su m&aacute;quina Linux con un m&oacute;dem. No necesita <CODE>getty</CODE> si
lo &uacute;nico que quiere es llamar con su modem. Existen tres versiones que son
normalmente usadas con Linux: <CODE>getty_ps</CODE>, <CODE>mgetty</CODE> y <CODE>agetty</CODE>. La
sintaxis de estos programas difieren, as&iacute; que aseg&uacute;rese de comprobar que
est&aacute; usando la sintaxis correcta para el <CODE>getty</CODE> que est&eacute; usando. </P>

<H3>Acerca de <CODE>getty_ps</CODE></H3>

<P>     </P>
<P>Esta versi&oacute;n de <CODE>getty</CODE> fue originalmente escrita por Paul Sutcliffe
Jr., <CODE>paul@devon.lns.pa.us</CODE>. Muchas distribuciones vienen
con el paquete <CODE>getty_ps</CODE> instalado. El paquete <CODE>getty_ps</CODE>
contiene dos programas. <CODE>getty</CODE> se usa para la consola, y
dispositivos de terminal - y <CODE>uugetty</CODE> se usa para los m&oacute;dems. Yo
uso esta versi&oacute;n de <CODE>getty</CODE>, as&iacute; que me concentrar&eacute; en el paquete
<CODE>getty_ps</CODE> en este COMO.</P>

<H3>Acerca de <CODE>mgetty</CODE></H3>


<P><CODE>mgetty</CODE> es una versi&oacute;n de <CODE>getty</CODE> escrita por Gert D&ouml;ring,
<CODE>
<A HREF="mailto:gert@greenie.muc.de">gert@greenie.muc.de</A></CODE>, para ser usada con el m&oacute;dem.  Adem&aacute;s de
permitir acceso telef&oacute;nico, <CODE>mgetty</CODE> tambi&eacute;n da soporte de FAX con
<CODE>sendfax</CODE>, que acompa&ntilde;a a <CODE>mgetty</CODE>. La documentaci&oacute;n de <CODE>mgetty</CODE>
es bastante buena, y no necesita ning&uacute;n suplemento.  Por favor, dir&iacute;jase a
ella para las instrucciones de instalaci&oacute;n.  Puede encontrar la &uacute;ltima
informaci&oacute;n sobre <CODE>mgetty</CODE> en <CODE>
<A HREF="http://www.leo.org/~doering/mgetty/">http://www.leo.org/~doering/mgetty/</A></CODE>. </P>

<H3>Acerca de <CODE>agetty</CODE></H3>


<P><CODE>agetty</CODE> es la tercera variaci&oacute;n de <CODE>getty</CODE>. Fue originalmente
escrita por W.Z. Venema, <CODE>wietse@wzv.win.tue.nl</CODE>. Es una simple, y
completamente funcional, implementaci&oacute;n de <CODE>getty</CODE> que va mejor con las
consolas virtuales o los terminales que con los m&oacute;dems. </P>


<H2><A NAME="ss4.2">4.2 ¿Qu&eacute; es <CODE>setserial</CODE>?</A></H2>


<P><CODE>setserial</CODE> es un programa que le permite ver y modificar los distintos
atributos de un dispositivo serie, incluyendo las direcciones de los
puertos, las interrupciones, y otras opciones de los puertos serie. Fue
inicialmente escrito por Rick Sladkey, y fue bastante modificado por Ted
T'so, <CODE>tytso@mit.edu</CODE>, que actualmente lo mantiene. Puede saber que
versi&oacute;n tiene ejecutando <CODE>setserial</CODE> sin argumentos. Recomiendo
conseguir la &uacute;ltima versi&oacute;n de alg&uacute;n servidor FTP de Linux. </P>
<P>Cuando su sistema Linux arranca, s&oacute;lo son configurados <CODE>ttyS{0-3}</CODE>,
usando las IRQs 3 y 4 por defecto. Por eso, si tiene cualquier otro puerto
serie en otras placas o si <CODE>ttyS{0-3}</CODE> tiene una IRQ no est&aacute;ndar,
<EM>debe</EM> usar este programa para configurar esos puertos serie. Para la
lista completa de opciones, consulte la p&aacute;gina man. </P>


<HR>
<A HREF="Serie-Como-3.html">Anterior</A>
<A HREF="Serie-Como-5.html">Siguiente</A>
<A HREF="Serie-Como.html#toc4">Indice</A>
</BODY>
</HTML>
