<HTML>
<HEAD>
<TITLE>Serie COMO de Linux: ¿Cu&aacute;les son los nombres de los puertos serie?</TITLE>
</HEAD>
<BODY>
<A HREF="Serie-Como-2.html">Anterior</A>
<A HREF="Serie-Como-4.html">Siguiente</A>
<A HREF="Serie-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. ¿Cu&aacute;les son los nombres de los puertos serie?</A></H2>


<P>Un puerto de E/S es un modo de conseguir que los datos entren y salgan de
un ordenador. Existen muchos tipos de puertos de E/S como los puertos
serie, puertos paralelos, controladores de disqueteras, placas ethernet,
etc. Trataremos con puertos serie ya que los m&oacute;dems y los terminales son
dispositivos serie. Cada puerto serie debe tener una direcci&oacute;n de E/S, y
una interrupci&oacute;n (IRQ). </P>
<P>Estos son los cuatro puertos serie correspondientes a COM1 - COM4: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 
/dev/cua0, /dev/ttyS0 (COM1) direccion 0x3f8 IRQ 4
/dev/cua1, /dev/ttyS1 (COM2) direccion 0x2f8 IRQ 3 
/dev/cua2, /dev/ttyS2 (COM3) direccion 0x3e8 IRQ 4 
/dev/cua3, /dev/ttyS3 (COM4) direccion 0x2e8 IRQ 3 
</PRE>
</CODE></BLOCKQUOTE>
 </P>
<P>Si Linux no detecta ning&uacute;n puerto serie cuando arranca, entonces aseg&uacute;rese
de que el soporte de comunicaciones serie est&aacute; compilado y activo en el
n&uacute;cleo.</P>
<P>Los dispositivos <CODE>/dev/ttyS</CODE><EM>N</EM> son para conexiones de entrada y
los dispositivos <CODE>/dev/cua</CODE><I>N</I> son para conexiones de salida.
<EM>N</EM> es el n&uacute;mero del puerto serie. </P>
<P>En este documento me referir&eacute; a COM1 como <CODE>ttyS0</CODE>, COM2 como
<CODE>ttyS1</CODE>, COM3 como <CODE>ttyS2</CODE>, y COM4 como <CODE>ttyS3</CODE>. Si me refiero a
un dispositivo espec&iacute;fico en <CODE>/dev</CODE>, siempre lo preceder&eacute; de
<CODE>/dev</CODE> para evitar confusiones. N&oacute;tese que por defecto estos
dispositivos tienen IRQs que se solapan. No puede usar todos los
puertos con la configuraci&oacute;n por defecto, debe reasignar IRQs diferentes.
Vea la secci&oacute;n 
<A HREF="Serie-Como-8.html#irqaddr">¿Puedo usar m&aacute;s de dos dispositivos serie?</A> para configurar las IRQs. </P>
<P>En algunas instalaciones se crean dos dispositivos extras,
<CODE>/dev/modem</CODE> para el m&oacute;dem y <CODE>/dev/mouse</CODE> para el rat&oacute;n. Los
dos son enlaces simb&oacute;licos al dispositivo <CODE>/dev/cua</CODE><EM>N</EM>
apropiado que usted especific&oacute; durante la instalaci&oacute;n (a menos que tenga
un bus mouse, entonces <CODE>/dev/mouse</CODE> apuntar&aacute; al dispositivo del bus
mouse).</P>
<P>Existen algunas discusiones sobre los m&eacute;ritos de <CODE>/dev/mouse</CODE> y
<CODE>/dev/modem</CODE>. Yo estoy <EM>totalmente</EM> en contra del uso de estos
enlaces. En particular, si est&aacute; planeando usar su m&oacute;dem para recibir
llamadas puede tener problemas debido a que los ficheros de bloqueo puede
que no funcionen correctamente si usa <CODE>/dev/modem</CODE>. &Uacute;selos si lo
desea, pero <EM>aseg&uacute;rese de que apuntan al dispositivo correcto</EM>. Sin
embargo, si mueve o borra este enlace, algunas aplicaciones (<CODE>minicom</CODE>
por ejemplo) pueden necesitar una reconfiguraci&oacute;n.</P>

<H2><A NAME="ss3.1">3.1 N&uacute;meros de dispositivo mayor y menor de los puertos serie en</A><CODE>/dev</CODE></H2>


<P>
<BLOCKQUOTE><CODE>
<PRE>
/dev/ttyS0 mayor 4, menor 64    /dev/cua0 mayor 5, menor 64
/dev/ttyS1 mayor 4, menor 65    /dev/cua1 mayor 5, menor 65
/dev/ttyS2 mayor 4, menor 66    /dev/cua2 mayor 5, menor 66
/dev/ttyS3 mayor 4, menor 67    /dev/cua3 mayor 5, menor 67
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>N&oacute;tese que todas las distribuciones deben traer estos dispositivos
correctamente creados. Puede comprobarlo escribiendo: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
linux% ls -l /dev/cua*
linux% ls -l /dev/ttyS*
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3><A NAME="dev"></A> Creaci&oacute;n de dispositivos en <CODE>/dev</CODE></H3>


<P>Si le falta un dispositivo, tendr&aacute; que crearlo con el comando <CODE>mknod</CODE>.
Por ejemplo, suponga que necesita crear un dispositivo para <CODE>ttyS0</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
linux# mknod -m 666 /dev/cua0 c 5 64
linux# mknod -m 666 /dev/ttyS0 c 4 64
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Puede usar el script <CODE>MAKEDEV</CODE>, que est&aacute; en <CODE>/dev</CODE>. Esto
simplifica la creaci&oacute;n de dispositivos. Por ejemplo, si necesita crear el
dispositivo para <CODE>ttyS0</CODE> puede escribir: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
linux# cd /dev
linux# ./MAKEDEV ttyS0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto dirige la creaci&oacute;n de dispositivos para entrada y salida, y deber&iacute;a
establecer los permisos adecuados. </P>


<H2><A NAME="ss3.2">3.2 Notas sobre placas multipuerto no-inteligentes</A></H2>


<P>Los dispositivos que su placa multipuerto usa dependen del tipo de placa
que tenga. Estas est&aacute;n listadas con detalle en <CODE>rc.serial</CODE> que
viene con el programa <CODE>setserial</CODE>. Recomiendo conseguir la &uacute;ltima
versi&oacute;n de <CODE>setserial</CODE> si est&aacute; intentando usar placas multipuerto.
Seguramente necesitar&aacute; crear estos dispositivos. Puede usar el comando
<CODE>mknod</CODE>, o el script <CODE>MAKEDEV</CODE>. Los dispositivos para placas
multipuerto se crean sumando ``64 + n&uacute;mero de puerto''. As&iacute;, si quiere
crear un dispositivo para <CODE>ttyS17</CODE>, debe escribir: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
linux# mknod -m 666 /dev/cua17 c 5 81
linux# mknod -m 666 /dev/ttyS17 c 4 81
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Note que ``64 + 17 = 81''. Si usa el script <CODE>MAKEDEV</CODE>, puede escribir: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
linux# cd /dev
linux# ./MAKEDEV ttyS17
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Nota: el manual SIIG en el listado de IO1812 para COM5-COM8 es err&oacute;neo.
Deber&iacute;a ser COM5=0x250, COM6=0x258, COM7=0x260, y COM8=0x268. </P>
<P>Nota: El Registro de Estado de Interrupci&oacute;n de la Digi PC/8 es en 0x140. </P>
<P>Nota: para una AST Fourport, puede necesitar especificar <CODE>skip_test</CODE> en
<CODE>rc.serial</CODE>. </P>


<H2><A NAME="ss3.3">3.3 Notas sobre placas multipuerto inteligentes</A></H2>


<P>Lea la informaci&oacute;n que viene con el controlador. Estas placas usan
dispositivos especiales, y no los est&aacute;ndar. Esta informaci&oacute;n var&iacute;a
dependiendo de su hardware. </P>


<HR>
<A HREF="Serie-Como-2.html">Anterior</A>
<A HREF="Serie-Como-4.html">Siguiente</A>
<A HREF="Serie-Como.html#toc3">Indice</A>
</BODY>
</HTML>
