<HTML>
<HEAD>
<TITLE>Serie COMO de Linux: ¿C&oacute;mo puedo llamar con mi m&oacute;dem?</TITLE>
</HEAD>
<BODY>
<A HREF="Serie-Como-4.html">Anterior</A>
<A HREF="Serie-Como-6.html">Siguiente</A>
<A HREF="Serie-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="dialout"></A> <A NAME="s5">5. ¿C&oacute;mo puedo llamar con mi m&oacute;dem?</A></H2>

<H2><A NAME="ss5.1">5.1 Requerimientos de hardware</A></H2>


<P>Primero, aseg&uacute;rese de que tiene el cable correcto. El m&oacute;dem requiere un
cable directo, sin pins cruzados. Cualquier tienda de inform&aacute;tica puede
tenerlo. Aseg&uacute;rese de tener el g&eacute;nero correcto. Si est&aacute; usando el puerto
serie DB25, siempre debe ser el DB25 macho. No lo confunda con el puerto
paralelo, que es el DB25 hembra. Conecte su m&oacute;dem a uno de los puertos
serie. Consulte el manual de su m&oacute;dem para saber c&oacute;mo hacerlo si necesita
ayuda. </P>

<H3>Notas sobre m&oacute;dems internos</H3>


<P>Para un m&oacute;dem interno, no necesitar&aacute; un cable. Un m&oacute;dem interno no
necesita un puerto serie, tiene uno interno. Todo lo que necesita hacer es
configurarlo para usar una interrupci&oacute;n que no est&eacute; siendo usada, y
configurar la direcci&oacute;n de E/S del puerto. Consulte el manual de su m&oacute;dem
si se atasca. Adem&aacute;s, vea la secci&oacute;n 
<A HREF="Serie-Como-8.html#irqaddr">¿Puedo usar m&aacute;s de dos dispositivos serie?</A> si necesita ayuda para elegir las
interrupciones y las direcciones. </P>
<P>En en algunas placas madres tendr&aacute; que desconectar el puerto serie que el
m&oacute;dem est&aacute; suplantando para evitar conflictos. Esto se puede hacer con los
puentes o en la configuraci&oacute;n de la BIOS, dependiendo de su placa madre.
Consulte el manual de su placa madre. </P>
<P>Debido a un error en la placa de v&iacute;deo IBM8514, puede tener problemas si
quiere poner su m&oacute;dem interno en <CODE>ttyS3</CODE>. Si Linux no detecta su m&oacute;dem
interno en <CODE>ttyS3</CODE>, puede usar <CODE>setserial</CODE> y el m&oacute;dem funcionar&aacute;
bien. Los m&oacute;dems internos conectados en <CODE>ttyS{0-2}</CODE> no deben tener
ning&uacute;n problema para ser detectados. Linux no efect&uacute;a ninguna
autoconfiguraci&oacute;n en <CODE>ttyS3</CODE> debido a este error en la placa de v&iacute;deo. </P>


<H2><A NAME="ss5.2">5.2 Hablando con el m&oacute;dem</A></H2>


<P>Use <CODE>kermit</CODE> o alg&uacute;n otro programa simple de comunicaciones para probar
la configuraci&oacute;n, antes de meterse en programas de comunicaci&oacute;n m&aacute;s
complejos. (Por razones legales, <CODE>kermit</CODE> no se distribuye en las
distribuciones comerciales. Puede encontrar la &uacute;ltima versi&oacute;n de
<CODE>kermit</CODE> en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/comm">ftp://sunsite.unc.edu/pub/Linux/apps/comm</A></CODE> y servidores
espejo). Por ejemplo, digamos que su m&oacute;dem est&aacute; en <CODE>ttyS3</CODE>, y su
velocidad es 38400 bps. Puede hacer lo siguiente: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
linux# kermit
C-Kermit 5A(188), 23 Nov 92, POSIX
Type ? or HELP for help
C-Kermit&gt;set line /dev/cua3
C-Kermit&gt;set speed 38400
/dev/cua3, 38400 bps
C-Kermit&gt;c
Connecting to /dev/cua3, speed 38400.
The escape character is Ctrl-\ (ASCII 28, FS)
Type the escape character followed by C to get back,
or followed by ? to see other options.
ATV1
OK
&lt;ctrl&gt;-\-C
(Back at linux)
C-Kermit&gt;quit
linux#
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si su m&oacute;dem responde a los comandos <CODE>AT</CODE>, puede suponer que est&aacute;
funcionando correctamente en lo que respecta a Linux. Intente llamar a
otro m&oacute;dem. Si no le gusta <CODE>kermit</CODE>, pruebe uno de los programas de
comunicaciones m&aacute;s avanzados. Mire en la secci&oacute;n 
<A HREF="Serie-Como-10.html#comms">Programas De Comunicaciones</A> sobre programas de comunicaciones si
necesita una gu&iacute;a. </P>
<P>Cuando llame con su m&oacute;dem, configure la velocidad a la m&aacute;s alta que &eacute;ste
soporte. Las versiones de Linux con una versi&oacute;n de <CODE>libc</CODE> superior a
5.x tienen soporte para velocidades de hasta 115200 bps. <CODE>libc</CODE>
normalmente est&aacute; en <CODE>/lib</CODE>, as&iacute; que mire all&iacute; para saber que versi&oacute;n
tiene. Si Linux no reconoce una velocidad de 57600 &oacute; 115200 bps, entonces
debe usar el programa <CODE>setserial</CODE> para configurar el puerto serie a una
velocidad mayor.  Vea la secci&oacute;n 
<A HREF="Serie-Como-9.html#spdhi">¿C&oacute;mo configurar el puerto serie para velocidades altas?</A> para saber c&oacute;mo hacer esto.
Despu&eacute;s, configure la velocidad a 38400 bps en el programa de
comunicaciones. </P>


<H2><A NAME="ss5.3">5.3 Configuraci&oacute;n del m&oacute;dem para llamar</A></H2>


<P>Si s&oacute;lo va a hacer llamadas, puede configurar el m&oacute;dem como quiera.  Si
tiene la intenci&oacute;n de usar el m&oacute;dem para recibir llamadas, <EM>debe</EM>
configurar el m&oacute;dem a la misma velocidad a la que quiera que funcione
<CODE>getty</CODE>. Es decir, si quiere usar <CODE>getty</CODE> a 38400 bps, ponga la
velocidad a 38400 bps cuando configure el m&oacute;dem. Esto se hace para
prevenir desajustes entre el ordenador y el m&oacute;dem. En general, la
configuraci&oacute;n de f&aacute;brica, que activa la correcci&oacute;n de errores y el control
de flujo por hardware, es la mejor configuraci&oacute;n para hacer llamadas,
consulte el manual de su m&oacute;dem para activar estas opciones. </P>
<P>A mi me gusta ver los c&oacute;digos resultantes, por eso activo <CODE>Q0</CODE> -
devuelve los c&oacute;digos resultantes. Para activar esto en mi m&oacute;dem, tengo que
preceder el nombre de registro con el comando <CODE>AT</CODE>.  Usando <CODE>kermit</CODE>
u otro programa de comunicaciones, con&eacute;ctelo al m&oacute;dem y escriba:
<CODE>ATQ0</CODE>. </P>
<P>Tambi&eacute;n me gusta ver lo que escribo, por eso activo <CODE>E1</CODE> - activa el
eco de comandos. Si su m&oacute;dem tiene capacidad de compresi&oacute;n de datos,
probablemente quiera activarlo.  Consulte el manual de su m&oacute;dem para m&aacute;s
ayuda, y una lista de opciones completa. Si su m&oacute;dem puede grabar la
configuraci&oacute;n activa, aseg&uacute;rese de guardarla (se suele hacer con
<CODE>AT&amp;W</CODE>, pero varia entre los fabricantes de m&oacute;dems), si no
tendr&aacute; que configurar los registros cada vez que active el m&oacute;dem, o lo
reinicie. </P>


<H2><A NAME="ss5.4">5.4 Control de flujo por hardware</A></H2>


<P>Si su m&oacute;dem soporta el control de flujo por hardware (RTS/CTS), le
recomiendo que lo use. Esto es particularmente importante para m&oacute;dems que
soporten la compresi&oacute;n de datos. Primero, tendr&aacute; que activar el control de
flujo RTS/CTS del puerto serie. Es mejor hacerlo en el arranque, en el
fichero <CODE>/etc/rc.d/rc.local</CODE> o <CODE>/etc/rc.d/rc.serial</CODE>.
¡Aseg&uacute;rese de que estos ficheros son llamados desde el fichero principal
<CODE>rc.sysinit</CODE>!. Necesita hacer lo siguiente para cada puerto serie en
que quiera activar el control de flujo por hardware: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
stty crtscts &lt; /dev/cuaN
</PRE>
</CODE></BLOCKQUOTE>
 </P>
<P>Tambi&eacute;n debe activar el control de flujo RTS/CTS en el m&oacute;dem.  Consulte el
manual de su m&oacute;dem para saber c&oacute;mo hacerlo, ya que var&iacute;a entre fabricantes
de m&oacute;dems. Aseg&uacute;rese de guardar la configuraci&oacute;n del m&oacute;dem si &eacute;ste soporta
el almacenamiento del perfil. </P>


<HR>
<A HREF="Serie-Como-4.html">Anterior</A>
<A HREF="Serie-Como-6.html">Siguiente</A>
<A HREF="Serie-Como.html#toc5">Indice</A>
</BODY>
</HTML>
