<HTML>
<HEAD>
<TITLE>Serie COMO de Linux: ¿C&oacute;mo puedo configurar el puerto serie para velocidades altas? ¿qu&eacute;</TITLE>
</HEAD>
<BODY>
<A HREF="Serie-Como-8.html">Anterior</A>
<A HREF="Serie-Como-10.html">Siguiente</A>
<A HREF="Serie-Como.html#toc9">Indice</A>
<HR>
<H2><A NAME="spdhi"></A> <A NAME="s9">9. ¿C&oacute;mo puedo configurar el puerto serie para velocidades altas? ¿qu&eacute;</A>velocidad debo usar con mi m&oacute;dem?</H2>


<P>Esta secci&oacute;n le ayudar&aacute; a calcular la velocidad a usar cuando use su m&oacute;dem
con un programa de comunicaciones, o con un programa <CODE>getty</CODE>. </P>
<P>
<UL>
<LI>Si tiene algo m&aacute;s lento que un m&oacute;dem de 9600 bps (V.32), configure
la velocidad a la m&aacute;s alta que su m&oacute;dem soporte. Por ejemplo 300 bps
(V.21/Bell 103), 1200 bps (V.22/Bell 212A), &oacute; 2400 bps (V.22bis). 
</LI>
<LI>Si tiene un m&oacute;dem de 9600 bps (V.32), con compresi&oacute;n de datos
V.42bis, ponga la velocidad a 38400 bps .  La compresi&oacute;n V.42bis tiene una
velocidad <EM>te&oacute;rica</EM> de 4:1, es decir ``4 * 9600 = 38400''. 
</LI>
<LI>Si tiene un m&oacute;dem de 14400 bps (V.32bis), con compresi&oacute;n de datos
V.42bis, use <CODE>setserial</CODE> con el par&aacute;metro <CODE>spd_hi</CODE> para configurar
el puerto serie a 57600 bps (4 * 14400 = 57600). 

Use el par&aacute;metro <CODE>spd_hi</CODE> si tiene un m&oacute;dem a 28800 &oacute; 33600 bps (V.FC o
V.34) (4 * 28800 = 115200). 

Despu&eacute;s, use la velocidad de 38400 bps en su programa de comunicaciones, o
en <CODE>/etc/inittab</CODE>. Esta es ahora la velocidad m&aacute;s alta que ha
configurado. Aseg&uacute;rese de tener UARTs 16550A. 

Si su versi&oacute;n de libc es por lo menos 5.x, debe haber velocidades llamadas
57600 y 115200. <CODE>libc</CODE> est&aacute; en <CODE>/lib</CODE>, as&iacute; que mire all&iacute; para
saber que versi&oacute;n tiene. Puede usar esto directamente (sin usar
<CODE>setserial</CODE>), si sus aplicaciones han sido compiladas para usarlas.
Existen muchas distribuciones por ah&iacute;, as&iacute; que lo mejor que puede hacer es
probar las velocidades m&aacute;s altas si tiene una versi&oacute;n reciente de una
distribuci&oacute;n Linux. </LI>
</UL>
</P>
<P>Compruebe primero la configuraci&oacute;n de <CODE>setserial</CODE> en la l&iacute;nea de
comandos, y despu&eacute;s cuando est&eacute; funcionando, p&oacute;ngalo en
<CODE>/etc/rc.d/rc.serial</CODE> o <CODE>/etc/rc.d/rc.local</CODE>, yo he puesto
<CODE>ttyS3</CODE> a 115200 bps escribiendo: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/sbin/setserial /dev/cua3 spd_vhi
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Aseg&uacute;rese de estar usando un path v&aacute;lido para <CODE>setserial</CODE>, y un nombre
v&aacute;lido para el dispositivo. Puede comprobar la configuraci&oacute;n de un puerto
serie ejecutando: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
setserial -a /dev/cuaN
</PRE>
</CODE></BLOCKQUOTE>
</P>

<HR>
<A HREF="Serie-Como-8.html">Anterior</A>
<A HREF="Serie-Como-10.html">Siguiente</A>
<A HREF="Serie-Como.html#toc9">Indice</A>
</BODY>
</HTML>
