<HTML>
<HEAD>
<TITLE>Serie COMO de Linux: Un paso m&aacute;s ...</TITLE>
</HEAD>
<BODY>
<A HREF="Serie-Como-11.html">Anterior</A>
<A HREF="Serie-Como-13.html">Siguiente</A>
<A HREF="Serie-Como.html#toc12">Indice</A>
<HR>
<H2><A NAME="s12">12. Un paso m&aacute;s ...</A></H2>


<P>Esta secci&oacute;n no necesita ser le&iacute;da, pero puede ayudarle a comprender algo
mejor el Unix, y el mundo de las telecomunicaciones. </P>

<H2><A NAME="ss12.1">12.1 ¿Qu&eacute; son los ficheros de bloqueo?</A></H2>


<P>Un fichero de bloqueo es simplemente un fichero que dice que dispositivo
se est&aacute; usando. Est&aacute;n en <CODE>/usr/spool/uucp</CODE>, o <CODE>/var/lock</CODE>.
Los ficheros de bloqueo en Linux se llaman <CODE>LCK..</CODE><EM>nombre</EM>, donde
<EM>nombre</EM> puede ser un nombre de dispositivo, o un nombre de un sitio
UUCP. Ciertos procesos crean estos bloqueos para as&iacute; poder tener acceso
exclusivo a un dispositivo, por ejemplo, si llama con su m&oacute;dem, aparecer&aacute;
un bloqueo para que otros procesos sepan que alguien est&aacute; usando
actualmente el m&oacute;dem. Los bloqueos principalmente contienen el PID del
proceso que tiene bloqueado el dispositivo. Muchos programas comprueban si
un dispositivo est&aacute; bloqueado, e intentan determinar si ese bloqueo es
todav&iacute;a v&aacute;lido buscando en la tabla de procesos el que tiene bloqueado el
dispositivo. Si el bloqueo es v&aacute;lido, el programa se cerrar&aacute; (o deber&iacute;a
cerrarse). Si no, algunos programas borran el bloqueo viejo, y usan el
dispositivo, creando su propio bloqueo. Otros programas solamente se
cierran y dicen que el dispositivo est&aacute; us&aacute;ndose. </P>


<H2><A NAME="ss12.2">12.2 ``baudios'' Vs. ``bps''</A></H2>


<P>``baudios'' y ``bps'' son, quiz&aacute;s, unos de los t&eacute;rminos peor usados
en el campo de los ordenadores y telecomunicaciones. Mucha gente usa
estos t&eacute;rminos indiferentemente, ¡cuando de hecho no son lo mismo!.</P>
<P>
<DL>

<DT><B>baudios</B><DD><P>La velocidad en baudios es una medida de cuantas veces por
segundo cambia una se&ntilde;al, por ejemplo una se&ntilde;al enviada por un m&oacute;dem
(<B>mo</B>ulador-<B>dem</B>odulador). Es decir, una velocidad de 1200 baudios
implica que una se&ntilde;al cambia cada 833 microsegundos. Las velocidades de
los m&oacute;dems normales son 50, 75, 110, 300, 600, 1200, y 2400. La mayor&iacute;a de
los m&oacute;dems r&aacute;pidos van a 2400 baudios. Debido a limitaciones del ancho de
banda en las l&iacute;neas telef&oacute;nicas de voz, las velocidades superiores a 2400
baudios son dif&iacute;ciles de alcanzar, y s&oacute;lo funcionan en l&iacute;neas telef&oacute;nicas
de alta calidad.  Se pueden codificar varios bits por baudio, para
conseguir velocidades que excedan la velocidad del baudio. Se llama
``baudio'' en honor a Emile Baudot, inventor de la impresora as&iacute;ncrona del
tel&eacute;grafo (teletipo). </P>

<DT><B>bps</B><DD><P>La velocidad en bps es una medida de cuantos bits por segundo
son transmitidos. Las velocidades en bps de los m&oacute;dem normales son 50, 75,
110, 300, 1200, 2400, 9600, ... 115200. Usando m&oacute;dems con compresi&oacute;n
V.42bis (compresi&oacute;n m&aacute;xima 4:1), son posibles velocidades
<EM>te&oacute;ricas</EM> de hasta 115200 bps. Esto es lo que la mayor&iacute;a de la
gente quiere decir cuando mal usan la palabra ``baudios''. </P>
</DL>
        </P>
<P>As&iacute;, si m&oacute;dems de alta velocidad est&aacute;n funcionando a 2400 baudios, ¿c&oacute;mo
pueden enviar 14400 bps?. Los m&oacute;dems alcanzan una velocidad en bps mayor
que la velocidad en baudios codificando varios bits en cada cambio de
se&ntilde;al, o cambio de fase. De este modo, cuando 2 o m&aacute;s bits son codificados
por baudio, la velocidad en bps supera a la velocidad en baudios. Si su
m&oacute;dem se conecta a 14400 bps, estar&aacute; enviando 6 bits en cada cambio de
fase, a 2400 baudios. </P>
<P>¿C&oacute;mo empez&oacute; esta confusi&oacute;n?. Bien, volviendo a cuando los m&oacute;dems lentos
eran m&oacute;dems de alta velocidad, la velocidad en bps realmente era igual a
la velocidad en baudios. Un bit pod&iacute;a ser codificado por cambio de fase.
La gente pod&iacute;a usa bps y baudios intercambi&aacute;ndolos, porque eran el mismo
n&uacute;mero. Por ejemplo, un m&oacute;dem de 300 bps tambi&eacute;n ten&iacute;a una velocidad de
300 baudios. Todo esto cambi&oacute; cuando llegaron los m&oacute;dems m&aacute;s r&aacute;pidos, y la
velocidad en bits super&oacute; a la velocidad en baudios. </P>


<H2><A NAME="uart"></A> <A NAME="ss12.3">12.3 ¿Qu&eacute; son las UARTs? ¿C&oacute;mo afectan al rendimiento?</A></H2>


<P>Las UARTs (<B>U</B>niversal <B>A</B>syncronous <B>R</B>eceiver <B>T</B>ransmitter)
son circuitos integrados de la placa serie del PC.  Su prop&oacute;sito es
convertir los datos a bits, enviarlos a la l&iacute;nea serie, y despu&eacute;s
reconstruir los datos en el otro terminal. Las UARTs tratan los datos en
bloques del tama&ntilde;o de un byte, que adem&aacute;s es, convenientemente, el tama&ntilde;o
de los caracteres ASCII. </P>
<P>Digamos que tiene un terminal conectado a su PC. Cuando escriba un
car&aacute;cter, el terminal da el car&aacute;cter a su transmisor (tambi&eacute;n una UART).
El transmisor env&iacute;a ese byte a la l&iacute;nea serie, un bit cada vez, a una
determinada velocidad. En el otro PC, la UART que recibe, coge todos los
bits, reconstruye el byte y lo coloca en el b&uacute;fer. </P>
<P>Existen dos tipos diferentes de UARTs. Probablemente ha o&iacute;do algo sobre
las UARTs no inteligentes - la 8250 y 16450, y las UARTs FIFO - la 16550A.
Para entender las diferencias, examinemos primero qu&eacute; ocurre cuando una
UART ha enviado o recibido un byte. </P>
<P>La UART no puede hacer nada con los datos por s&iacute; misma, s&oacute;lo los env&iacute;a y
los recibe. La CPU recibe una interrupci&oacute;n del dispositivo serie cada vez
que se recibe o env&iacute;a un byte. Entonces la CPU mueve el byte recibido
desde el b&uacute;fer de la UART a alg&uacute;n lugar de la memoria, o le da a la UART
otro byte a enviar. Las UARTs 8250 y 16450 s&oacute;lo tienen un b&uacute;fer de 1 byte.
Esto significa, que cada vez que se env&iacute;a o recibe 1 byte, se interrumpe a
la CPU.  A velocidades bajas, est&aacute; bien. Pero, a velocidades de
transferencia alta, la CPU est&aacute; demasiado ocupada tratando con la UART, y
no le deja tiempo de atender otras tareas. En algunos casos, la CPU no
puede atender la interrupci&oacute;n a tiempo, y se sobreescribe el byte, debido
a que llegan demasiado r&aacute;pido. </P>
<P>Ah&iacute; es cuando son &uacute;tiles las UARTs 16550A. Estos integrados tienen un
b&uacute;fer FIFO de 16 bytes. Esto significa que pueden recibir o transmitir
hasta 16 bytes antes de tener que interrumpir a la CPU.  La CPU no s&oacute;lo
puede esperar, sino que puede entonces transferir los 16 bytes de una sola
vez. Aunque es raro que el umbral de interrupci&oacute;n est&eacute; a 16, esto es una
ventaja significante frente a las otras UARTs, que s&oacute;lo tienen un b&uacute;fer de
1 byte. La CPU recibe menos interrupciones, y est&aacute; libre para hacer otras
cosas. No se pierden datos, y todo el mundo es feliz. (Tambi&eacute;n existe una
UART 16550, pero es tratada como un 16450 ya que no funciona bien.) </P>
<P>En general, las UARTs 8250 y 16450 deben valer para velocidades de hasta
38400 bps. A velocidades mayores que 38400 bps, puede empezar a tener
p&eacute;rdida de datos. Otros sistemas operativos de PC (definici&oacute;n usada aqu&iacute;
vagamente) como DOS no son multitarea, por eso deben ser capaces de
hab&eacute;rselas mejor con 8250 &oacute; 16450. Por eso es por lo que algunas personas
no sufren p&eacute;rdidas de datos, hasta que cambian a Linux. </P>
<P>Las placas sin UART y las multipuerto inteligentes usan integrados DSP
para hacer las tareas de b&uacute;fer y control adicional, esto libera mucho m&aacute;s
la CPU. Por ejemplo, las placas Cyclades Cyclom y Stallion EasyIO usan una
UART Cirrus Logic CD1400, y muchas placas usan CPUs 80186 o incluso CPUS
RISC especiales, para controlar la E/S serie. </P>
<P>Tenga en mente que este tipo de UART no inteligentes no son malas,
simplemente no son buenas para velocidades altas. No debe tener problemas
conectando un terminal, o un rat&oacute;n a estas UARTs. Pero, para un m&oacute;dem de
alta velocidad, la 16550A es imprescindible. </P>
<P>Puede comprar placas serie con la UART 16550A por un poco m&aacute;s de dinero,
solamente pregunte al vendedor que tipo de UART tiene la placa. O si
quiere actualizar su placa, simplemente compre el chip 16550A y
reempl&aacute;celo por su UART 16450. Son compatibles patilla a patilla. Algunas
placas traen la UART en z&oacute;calo para este prop&oacute;sito, si no, puede soldarlo.
N&oacute;tese que probablemente se ahorrar&aacute; un mont&oacute;n de problemas consiguiendo
una placa nueva, si tiene el dinero, cuestan menos de 5000 ptas. </P>


<H2><A NAME="ss12.4">12.4 ¿Cu&aacute;l es la diferencia real entre los dispositivos</A><CODE>/dev/cua</CODE><EM>N</EM> Y <CODE>/dev/ttyS</CODE><EM>N</EM>? </H2>


<P>La &uacute;nica diferencia es el modo en que se abren los dispositivos. Los
dispositivos para recibir llamadas <CODE>/dev/ttyS</CODE><EM>N</EM> se abren en
modo bloqueante, hasta que se haya detectado la portadora (CD)  (esto es,
alguien conecta). As&iacute;, cuando alguien quiere usar el dispositivo
<CODE>/dev/cua</CODE><EM>N</EM>, no hay conflictos con un programa que est&eacute;
vigilando el dispositivo <CODE>/dev/ttyS</CODE><EM>N</EM> (a menos que alguien
est&eacute; conectado, por supuesto). </P>
<P>Las m&uacute;ltiples entradas <CODE>/dev</CODE>, permiten operaciones sobre el mismo
dispositivo f&iacute;sico con diferentes caracter&iacute;sticas de operaci&oacute;n.  Tambi&eacute;n
permite a los programas <CODE>getty</CODE> est&aacute;ndar coexistir con cualquier otro
programa serie, sin que <CODE>getty</CODE> tenga que ser reajustado con bloqueos
de ning&uacute;n tipo. Es especialmente &uacute;til ya que los ficheros de bloqueo de
los n&uacute;cleos Unix est&aacute;ndar, y los bloqueos de UUCP son de aviso y no de
obligatoriedad. </P>


<HR>
<A HREF="Serie-Como-11.html">Anterior</A>
<A HREF="Serie-Como-13.html">Siguiente</A>
<A HREF="Serie-Como.html#toc12">Indice</A>
</BODY>
</HTML>
