<HTML>
<HEAD>
<TITLE>Serie COMO de Linux: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Serie-Como-2.html">Siguiente</A>
<A HREF="Serie-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>Este es el Serie COMO de Linux. Todo sobre c&oacute;mo configurar m&oacute;dems y
terminales bajo Linux, algunos trucos de serie, y soluciones a problemas.
Este COMO est&aacute; dirigido a Linux funcionando bajo un hardware basado en un
x86, aunque debe funcionar en otras arquitecturas. </P>

<H2><A NAME="ss1.1">1.1 Copyright</A></H2>


<P>El Serial HOWTO de Linux es copyright (C) 1993 - 1997 de Greg Hankins. 
Los documentos HOWTO de Linux pueden ser reproducidos y distribuidos total
o parcialmente, en cualquier medio f&iacute;sico o electr&oacute;nico, con tal que esta
nota de copyright est&eacute; en todas las copias. La redistribuci&oacute;n comercial es
permitida y se anima a ello; de cualquier modo, al autor le <EM>gustar&iacute;a</EM>
que se le notificase este tipo de distribuciones. </P>
<P>Todas las traducciones, trabajos derivados, o trabajos agregados
incorporando cualquier documento HOWTO de Linux deben estar bajo las
condiciones de esta nota de copyright. Es decir, no puede producir un
trabajo derivado de un HOWTO e imponer restricciones adicionales en su
distribuci&oacute;n. Excepciones a estas reglas pueden ser garantizadas bajo
ciertas condiciones; por favor, contacte con el coordinador de los HOWTOs
de Linux en la direcci&oacute;n que se da despu&eacute;s. </P>
<P>En breve, queremos promover la diseminaci&oacute;n de esta informaci&oacute;n a trav&eacute;s
de todos los canales posibles. De todas maneras, deseamos retener el
copyright de los HOWTOs, y nos <EM>gustar&iacute;a</EM> que se nos notificase
cualquier plan de redistribuci&oacute;n de los HOWTOs. </P>
<P>Para cualquier consulta, por favor, contacte con Greg Hankins, el
coordinador de los HOWTOs de Linux, en <CODE>
<A HREF="mailto:gregh@sunsite.unc.edu">gregh@sunsite.unc.edu</A></CODE> a
trav&eacute;s del correo electr&oacute;nico. </P>


<H2><A NAME="ss1.2">1.2 Nuevas versiones de este documento</A></H2>


<P>Las nuevas versiones de Serial HOWTO (versi&oacute;n en ingl&eacute;s
<SL>Ver secci&oacute;n 
<A HREF="Serie-Como-16.html#Grupos">Grupos Linuxeros en Espa&ntilde;a</A> para las traducciones 
al Castellano</SL>
) 
se pueden conseguir en</P>
<P>
<UL>
<LI><CODE>
<A HREF="ftp://sunsite.unc.edu:/pub/Linux/docs/HOWTO/Serial-HOWTO">ftp://sunsite.unc.edu:/pub/Linux/docs/HOWTO/Serial-HOWTO</A></CODE></LI>
</UL>
</P>
<P>y servidores espejo (<I>mirror sites</I>). Existen otros formatos, as&iacute; como
PostScript y DVI en el directorio <CODE>other-formats</CODE>. El Serial-HOWTO
tambi&eacute;n est&aacute; disponible en</P>
<P>
<UL>
<LI><CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/Serial-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/Serial-HOWTO.html</A></CODE></LI>
</UL>
</P>
<P>y se enviar&aacute; a <CODE>
<A HREF="news:comp.os.linux.answers">comp.os.linux.answers</A></CODE> mensualmente. </P>


<H2><A NAME="ss1.3">1.3 Realimentaci&oacute;n</A></H2>


<P>Por favor, env&iacute;eme cualquier pregunta, comentario, sugerencia, o material
adicional. Siempre estoy ansioso de o&iacute;r lo que opinan sobre el HOWTO.
¡Tambi&eacute;n estoy atento a mejoras!. D&iacute;game exactamente qu&eacute; es lo que no
entiende, o que debe aclararse. Puede contactar conmigo en <CODE>
<A HREF="mailto:greg.hankins@cc.gatech.edu">greg.hankins@cc.gatech.edu</A></CODE> v&iacute;a email. Todas las cartas ser&aacute;n
contestadas, aunque puede llevarme una semana o as&iacute;, dependiendo de lo
ocupado que est&eacute;. Tengo muchas cartas de <CODE>root</CODE> y sitios
desconfigurados. Por favor, env&iacute;eme el correo como una persona real, y
aseg&uacute;rese de que su sistema de correo funcione, as&iacute; podr&eacute; contestarle. Si
no le respondo en dos semanas, por favor, vuelva a enviarme la carta de
nuevo. </P>
<P>Tambi&eacute;n puede contactar conmigo en:  Greg Hankins<BR> College of
Computing<BR> 801 Atlantic Drive<BR> Atlanta, GA
30332-0280<BR> a trav&eacute;s del correo lento, y en <CODE>
<A HREF="http://www.cc.gatech.edu/staff/h/Greg.Hankins">http://www.cc.gatech.edu/staff/h/Greg.Hankins</A></CODE></P>
<P>Por favor, incluya el n&uacute;mero de versi&oacute;n de el Serial HOWTO cuando escriba,
esta es la versi&oacute;n 1.9. </P>


<H2><A NAME="ss1.4">1.4 Renuncia de responsabilidad</A></H2>


<P>Los resultados pueden variar. Las respuestas dadas puede que no funcionen
en todos los sistemas y con todas las configuraciones posibles. </P>


<HR>
Anterior
<A HREF="Serie-Como-2.html">Siguiente</A>
<A HREF="Serie-Como.html#toc1">Indice</A>
</BODY>
</HTML>
