<html>
<meta name="editor" value="/usr/bin/vi">
<head><title>Preguntas frecuentes de VI - Aprender vi</title>
</head><body>
<center>
<h2><b><u>2.0 - Aprender vi.</u></b></h2>
<A HREF="http://www.abast.es/~avalle/vi.html"><IMG BORDER=0 SRC="vipower.gif"><BR></A>
</center>
<hr>
<h2><b>2.0 - Aprender vi.</b></h2>
<p>
Estos son algunos consejos para el usuario "novato" de vi. Primero, ten cerca
de ti una buena chuleta con los comandos. Un poco m&aacutes adelante en este
mismo documento encontrar&aacutes un peque&ntildeo manual de referencia 
r&aacutepida. Segundo, cons&iacuteguete un buen libro sobre el vi (bueno...
Si no un libro, en la red hay varios buenos documentos que lo cubren.). Este 
documento no es la mejor forma de aprender vi, porque no trata el tema de una 
forma "pedag&oacutegica", sino que simplemente sirve para resolver problemas.
Si vas a comprar un libro, ten cuidado a la hora de escogerlo, y comprueba 
previamente que contenga ejercicios que puedas utilizar para ir probando
lo que vas aprendiendo.
<p> Tambi&eacuten puedes tratar de conseguir <a href="http://sdphln.ucsd.edu/pcf/vilearn/index.html">vilearn</A> o vitutor, 
que est&aacuten dise&ntildeados para ense&ntildear los conceptos b&aacutesicos
del vi.
<p>
<a name="21">
<h3><b>2.1 - Qu&eacute juegos me servir&aacuten para aprender?</b></h3>

<p> Bueno... Podr&aacute parecer un poco tonto, pero hay algunos juegos
basados en UNIX que nos podr&aacuten ayudar para aprender vi. La clave
est&aacute en que estos juegos suelen utilizar un juego de teclas muy
similar al juego de teclas utilizado por el editor para realizar las
tareas b&aacutesicas. Las teclas principales que nos ense&ntildear&aacuten
son las de movimoento de cursor: <b>hjkl</b>. NetHack, rouge, moria, omega
worm y snake son ejemplos v&aacutelidos de este tipo de juegos.<p>

<a name="22">
<h3><b>2.2 - Cu&aacutel es la diferencia entre los modos Comando y Edici&oacuten?</b></h3>
<p>El vi diferencia entre dos modos de trabajo diferentes: El modo Comando y
el modo Edici&oacuten. Esta diferenciaci&oacuten ha sido alabada y criticada
a la vez, ya que es una de las principales causas de errores a la hora de
escribir, y es una de las principales ventajas que tiene a la hora de acelerar
nuestro trabajo. Comprender esta diferencia y acostumbrarse a ella es VITAL 
para aprender y trabajar con este editor.
<p> Cuando comenzamos a trabajar, el vi est&aacute en modo Comando. En este
modo, casi cualquier pulsaci&oacuten de tecla que realicemos se 
interpretar&aacute como un comando, y tendr&aacute el consiguiente efecto
sobre nuestro texto. De esta forma, podremos movernos por el texto, borrar,
remplazar, cortar, pegar, etc... El modo Edici&oacute es aquel en el que
editamos realmente nuestro texto, y cualquier pulsaci&oacuten de tecla se 
convertir&aacute en texto que hemos a&ntildeadido al documento.
<p>Los comandos que nos ponen en modo Edici&oacuten son <tt>a, i, c, C, O, o</tt> y otros.
<p><tt>&lt;Esc&gt;</tt> o <tt>^C</tt> nos sacar&aacute del modo Edici&oacuten y nos volver&aacuten a llevar a modo Comando.
<p> Acost&uacutembrate a esta diferencia, ya que es la que hace al vi totalmente
diferente al resto de los editores convencionales. Tambi&eacuten es lo que hace 
que podamos realizar la gran mayoria de las tareas sin necesidad de retirar
las manos del teclado (Ideal para los que saben mecanograf&iacutea).<p>

<a name="23">
<h3><b>2.3 - Hey! Un momento! Mi teclado no tiene la tecla &lt;Esc&gt;!  Qu&eacute debo hacer?</b></h3>

<p>Prueba a pulsar <tt>^[</tt> .  Si tu teclado tiene una tecla &lt;Meta&gt; , 
prueba con ella. Si no te funciona ninguna de estas, entonces prueba con 
<tt>^3</tt>.<p>

<a name="24">
<h3><b>2.4 - Qu&eacute son todas esas tildes (~)?</b></h3>

<p>Esas tildes est&aacute;n para indicarte que las l&iacute;neas que hay al
final del fichero no pertenecen realmente al texto, que est&aacute;n ah&iacute; 
s&oacute;lo para "rellenar" hasta el final de la pantalla. Desde el final del
documento hasta el final de la pantalla ver&aacute;s que aparecen estas tildes.<p>

<a name="25"> 
<h3><b>2.5 - No me consigo acostumbrar a hjkl. Alguna sugerencia?</b></h3>

<p>Primero que nada, si tu terminal est&aacute; configurado correctamente, 
deber&iacute;as poder utilizar las teclas de cursor (si las tienes). De todas 
formas, si vas a utilizar mucho el vi, deber&iacute;as aprenderte las 
pulsaciones hjkl, ya que son m&aacute;s r&aacute;pidas de escribir. Adem&aacute;s, si utilizas la Korn-Shell, son necesarias para editar las l&iacute;neas de
comando. <p>
<p> De todas formas, y siempre estando en modo comando, podr&aacute;s utilizar
las teclas &lt;Del&gt; y &ltespacio&gt; para moverte a la izquierda y a la
derecha respectivamente.<p>

<a name="26">
<h3><b>2.6 - C&oacute;mo puedo salir sin grabar?</b></h3>

<p> Tienes que utilizar el comando <tt>:q!</tt> . Si el vi parece que se te 
ha "quedado colgado", puede ser que hayas pulsado <tt>^S</tt> por error. 
La pulsaci&oacute;n de <tt>^S</tt> suele significar XOFF, lo que le indica 
al UNIX que tu terminal no puede recibir m&aacute;s informaci&oacute;n. 
El UNIX entonces no te enviar&aacute; m&aacute;s texto hasta que se le 
env&iacute;e un XON (que se corresponde con el car&aacute;cter <tt>^Q</tt>).<p>

<a name="27">
<h3><b>2.7 - C&oacute;mo puedo insertar un fichero?</b></h3>

  <p><tt>:r &lt;Fichero&gt;</tt>

  <p>Por ejemplo, para insertar el fichero <tt>/etc/motd</tt>, escribe:  <tt>:r /etc/motd</tt>

<p>Esto inserta&aacute; el fichero en la posici&oacute;n actual del cursor.
Si especificas un n&uacute;mero antes de la r insertar&aacute; el fichero
en la l&iacute;nea especificada.<p>

<a name="28">
<h3><b>2.8 - C&oacute;mo se realizan b&uacute;squedas de texto?</b></h3>

<p><tt>/&lt;texto&gt;</tt> Busca hacia adelante.  <tt>?&lt;text&gt;</tt> 
Busca hacia atr&aacute;s. <tt>??</tt> o <tt>//</tt> repiten la &uacute;ltima 
b&uacute;squeda. Adem&ntilde;as, podr&aacute;s utilizar los comandos <tt>n</tt>
y <tt>N</tt> para repetir la b&uacute;squeda hacia adelante y hacia 
atr&aacute;s respectivamente. Cuando especificamos el texto que buscamos 
podremos utilizar las expresiones regulares ( puedes encontrar 
informaci&oacute;n sobre esto en <tt>regexp(5)</tt>).<p>

<a name="29">
<h3><b>2.9 - Y c&oacute;mo busco una secuencia de escape?</b></h3>

  <p><tt>/^V^&lt;seq&gt;</tt>

<p><tt>^V</tt> le indica al vi que tome el siguiente car&aacute;cter 
literalmente, y que no lo interprete como un comando.<p>

<a name="210">
<h3><b>2.10 - C&oacute;mo formateo el texto?</b></h3>

<p>Si tu ordenador tiene el comando <tt>fmti</tt>, todo lo que has de hacer 
es picar <tt>!}fmt</tt> desde el modo Edici&oacute;n. Esto rejustificar&aacute;
 el texto desde la posici&oacute;n actual hasta el final del p&aacute;rrafo. 
De todas formas, ten cuidado: Al menos en HP-UX el comando <tt>fmt</tt> sirve 
para formatear un array de discos, y no para formatear texto! :-). En el 
caso de que no tengas el comando <tt>fmt</tt>, entonces tenr&aacute;s que 
buscar un programa similar.<p> 

<a name="211">
<h3><b>2.11 - C&oacute;mo se copia texto?</b></h3>

<p>Bueno... esto es un poco complicado de explicar, pero espero que seguro
que lo podremos conseguir. 
  <p>El comando <tt>"&lt;letra&gt;yy<p></tt> copia una l&iacute;nea de texto en el 
registro &lt;letra&gt;.  (Un registro es un buffer donde el vi guarda 
informaci&oacute;n que se ha cortado o copiado) El valor de &lt;letra&gt; 
debe estar entre "a" y "z".El comando <tt>"&lt;letra&gt;dd</tt> borra una 
l&iacute;nea y la pone en el registro &lt;letra&gt;. Tambi&eacute;n podremos 
utilizar un n&uacute;mero anter de los comandos <tt>yy</tt> y i<tt>dd</tt>, 
para especificar cu&aacute;ntas l&iacute;neas queremos cortar o copiar en el 
registro. Si utilizamos <tt>YY</tt> o <tt>DD</tt> (en may&uacute;sculas), 
entonces no sustituiremos el contenido del registro, sino que dejaremos con 
el contenido original.

<p>Los comandos <tt>"&lt;letter&gt;p</tt> y <tt>"&lt;letter&gt;P</tt>  pegan 
el contenido del registro &lt;letra&gt; antes y despu&eacute;s de la 
posici&oacute;n actual del cursor respectivamente. Si el registro contiene 
un principio o un final de l&iacute;nea, el texto se pegar&aacute; en otra 
l&iacute;nea seg&uacute;n sea necesario.  Normalmente utilizaremos el 
comando <tt>y</tt> (de yank) seguido de cualquier comando de movimiento, lo 
que indicar&aacute; poner en el registro indicado por la letra (o en el 
registro por defecto si no especificamos ninguna) el texto situado entre 
el cursor y el final del comando de movimiento. As&iacute;, el comando 
<tt>y$</tt> pondr&aacute; en el registro por defecto todo el texto
situado desde el cursor hasta el final de l&iacute;nea; el comando <tt>yH</tt> 
copiar&aacute; desde el cursor hasta el principio del fichero, y as&iacute; 
sucesivamente. Hay que tener en cuenta que cuando utilizamos el registro
o buffer por defecto, cualquier otro comando de borrado (<tt>dd, dw, x</tt>,
 etc...) borrar&aacute; tambi&eacute;n el contenido de este registro. Mas 
exactamente, el registro por defecto es el que se utiliza para implementar 
el comando <tt>u</tt> (de Undo, deshacer).<p>

<p>Por ejemplo, para mover el p&aacute;rrafo anterior tendr&iacute;amos que 
posicionarnos en el principio del p&aacute;rrafo y teclear <tt>"a16dd</tt>. A 
continuaci&oacute;n nos posicionar&iacute;amos donde lo queramos pegar y
pulsar&iacute;amos <tt>"ap</tt>, con lo que pegar&iacute;amos las 16 
l&iacute;neas que contiene el registro a en la l&iacute;nea inferior.

<p>Si lo que necesitas es cortar y pegar &aacute;reas de texto que no 
est&aacute;n acabadas en un principio o final de l&iacute;nea, lo que has
de hacer es marcar una de las posiciones (origen o final del movimiento)
utilizando el comando <tt>m&lt;letra&gt;</tt>, que te marca la posici&oacute;n 
actual del cursor. Luego, podremos expresar este comando de movimiento 
(seg&uacute;n lo que pone en el p&aacute;rrafo anterior) utilizando el 
car&aacute;cter <tt>`</tt> seguido de la letra que hemos utilizado para 
marcar la posici&oacute;n. As&iacute; para marcar una posici&oacute;n con el 
nombre z pulsaremos <tt>mz</tt> y luego, para copiar al buffer a todo el 
texto comprendido entre la posici&oacute;n del cursor y la marca z, picaremos 
<tt>"ay`z</tt> . Luego, para pegar este texto en otro sitio, nos desplazaremos 
y picaremos <tt>"ap</tt> .<p> 

Una nota para los editores en castellano y otras lenguas "de 8 bits". El 
car&aacute;cter <tt>`</tt> es el que se utiliza para indicar graves o acentos 
abiertos, as&iacute; que si utilizamos una marca cuyo nombre sea una vocal 
no podremos recuperar esa posici&oacute;n posteriormente (siempre y cuando 
nuestro entorno de trabajo est&eacute; correctamente configurado y soporte 
letras como &agrave;&egrave;&igrave;&ograve;&ugrave;).

<a name=212">
<h3><b>2.12 - Arrrg!!!  He picado <tt>dG</tt> y he perdido todo el texto! 
Qu&eacute; puedo hacer? (O si no, qu&eacute; debo hacer cuando me equivoco?</b></h3>

<p>El comando <tt>u</tt> deshace el &uacute;ltimo comando ejecutado. El 
comando <tt>U</tt> (en may&uacute;sculas) deshace los cambios realizados en 
la l&iacute;nea actual, siempre y cuando no hayamos cambiado de l&iacute;nea. 
El comando <tt>:e!</tt> lee de nuevo el fichero que estamos editando, sin 
grabar ninguna modificaci&oacute;n. Adem&aacute;s, el texto borrado se almacena
en los registros del 1 al 9, con
lo que <tt>"&lt;n&gt;p</tt> pega el texto borrado en la posici&oacute;n &lt;n&gt;.
Podremos encontrar r&aacute;pidamente el texto borrado si pulsamos <tt>"1pi
</tt> , luego pulsamos <tt>u</tt> (para deshacer la inserci&oacute;n) y 
probamos con el siguiente. A fin de facilitar esta tarea, el comando <tt>.</tt>
 en este caso en lugar de repetir el &uacute;ltimo comando, lo har&aacute; 
con el siguiente registro.  De esta forma, tendremos que picar <tt>"1p u . u 
. u ...</tt> hasta encontrar y deshacer la operaci&oacute;n de borrado que 
busc&aacute;bamos.<p>

<a name="213"> 
<h3><b>2.13 - Acabo de terminar mi documento y me dicen que tengo que entregar
cada secci&oacute;n en un fichero diferente. Qu&eacute; hago?</b></h3>

<p>El comando <tt>:[m],[n]w &lt;fichero&gt;</tt> graba las l&iacute;neas de 
la m a la n en &lt;fichero&gt;.
Este mecanismo de utilizar numeraci&oacute;n de l&iacute;neas funciona con
casi todos los comandos del modo Ex (los que comienzan por :) Si utilizas
<tt>:[m],[n]w &gt;&gt; &lt;fichero&gt;</tt> se a&ntilde;adir&aacute; el texto al final del fichero.<p>

<a name="214">
<h3><b>2.14 - Qu&eacute; hay de esos comandos que comienzan con :?</b></h3>
<p>Los comandos que empiezan por : son comandos del editor ex. Nos proporcionan
una gran flexibilidad, como buscar y remplazar con opciones avanzadas.<p>
<hr>

<a href="index.html">[Indice]</a><a href="vi30.html">[Siguiente]</a><a href="vi10.html">[Anterior]</a><br>
Esta versi&oacuten de las Faq de vi ha sido recopilada por:<a href="mailto:baruch@macom.co.il">Baruch Promislow</a> de <a href="http://www.macom.co.il/">Macom Networking LTD.</a><br>
La versi&oacuten en castellano ha sido realizada por: <a href="mailto:avalle@abast.es">Antonio Valle</A>, de <a href="http://www.abast.es/">Abast Systems, S.A.</A>
<p>
<b>(C)opyright, <a href="mailto:ellidz@midway.uchicago.edu">E. Larry Lidz</a>, 1994, 1995.  All Rights Reserved.<br>
<b>(C)opyright, <a href="mailto:avalle@abast.es">Antonio Valle</A>, 1996. Todos los Derechos Reservados.
<b><p>
<hr>
</body></html>

