<HTML>
<HEAD>
<TITLE>Trucos y consejos para Linux: Ayudas Detalladas</TITLE>
</HEAD>
<BODY>
<A HREF="Linux-Tips-Como-2.html">Anterior</A>
<A HREF="Linux-Tips-Como-4.html">Siguiente</A>
<A HREF="Linux-Tips-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Ayudas Detalladas</A></H2>



<H2><A NAME="ss3.1">3.1 Compartiendo particiones de swap entre Linux y Windows. Tony Acero,</A><CODE>ace3@midway.uchicago.edu</CODE></H2>


<P>
<OL>
<LI>Formatea la partici&oacute;n como una partici&oacute;n dos, y crea el fichero de
swap del Windows en ella, pero no ejecutes windows todav&iacute;a. (Hay que
mantener el fichero de swap completamente vac&iacute;o de momento, para poder
comprimirlo bien). 
</LI>
<LI>Arranca linux y graba la partici&oacute;n en un fichero.  Por ejemplo, si
la partici&oacute;n es <CODE>/dev/hda8</CODE>: 

<BLOCKQUOTE><CODE>
<PRE>
dd if=/dev/hda8 of=/etc/dosswap
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Comprime el fichero de swap del dos; como es virtualmente todo
ceros, se comprimir&aacute; muy bien

<BLOCKQUOTE><CODE>
<PRE>
gzip -9 /etc/dosswap
</PRE>
</CODE></BLOCKQUOTE>

  </LI>
<LI>A&ntilde;ade lo siguiente al fichero <CODE>/etc/rc</CODE> para preparar e
instalar el espacio de swap sobre Linux : 

XXXXX es el numero de bloques en la particion de swap

<BLOCKQUOTE><CODE>
<PRE>
mkswap /dev/hda8 XXXXX
swapon -av
</PRE>
</CODE></BLOCKQUOTE>


Aseg&uacute;rate de a&ntilde;adir una entrada para la partici&oacute;n de swap en el fichero
<CODE>/etc/fstab</CODE>

</LI>
<LI>Si tu paquete <CODE>init/reboot</CODE> soporta <CODE>/etc/brc</CODE> o
<CODE>/sbin/brc</CODE> a&ntilde;ade lo siguiente a <CODE>/etc/brc</CODE>, si no, haz lo
mismo a mano cuando quieras arrancar dos u os/2 y quieras convertir la
partici&oacute;n de swap a la versi&oacute;n dos/windows: 

<BLOCKQUOTE><CODE>
<PRE>
swapoff -av
zcat /etc/dosswap.gz | dd of=/dev/hda8 bs=1k count=100
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</OL>
</P>
<P>Ten en cuenta que esto s&oacute;lo escribe los 100 primeros bloques en la
partici&oacute;n. He averiguado emp&iacute;ricamente que esto es suficiente. </P>
<P><EM>¿Cu&aacute;les son las ventajas y las desventajas de hacer esto?</EM> </P>
<P><EM>Ventajas</EM>: Ahorras una substancial cantidad de espacio en el disco.</P>
<P><EM>Desventajas</EM>: Si el paso 5 no es autom&aacute;tico, tienes que hacerlo a
mano, y enlentece el proceso de rearrancar unos nanosegundos :-) </P>



<H2><A NAME="ss3.2">3.2 C&oacute;mo configurar xdm's chooser para seleccionar host. Arrigo Triculzi, <CODE>a.triulzi@ic.ac.uk</CODE></A></H2>


<P>
<OL>
<LI>Edita el fichero que arranca xdm, (lo mas probable
<CODE>/etc/rc/rc.6</CODE> o <CODE>/etc/rc.local</CODE>) para que contenga las
siguientes l&iacute;neas en la secci&oacute;n de <CODE>startup</CODE>: 

<BLOCKQUOTE><CODE>
<PRE>
/usr/bin/X11/xdm
exec /usr/bin/X11/X -indirect hostname
</PRE>
</CODE></BLOCKQUOTE>


</LI>
<LI>Edita <CODE>/usr/lib/X11/xdm/Xservers</CODE> y comenta la l&iacute;nea que
arranca el servidor en el terminal. p.ej, que comienza por <CODE>0:</CODE>
</LI>
<LI>Rearranca la m&aacute;quina y ya est&aacute; todo.
</LI>
</OL>
</P>
<P>He a&ntilde;adido &eacute;ste porque cuando estuve, desesperadamente, intentando
configurarlo para mi propia subnet, me llev&oacute; sobre una semana solventar
todos los problemas. </P>
<P>Advertencia: con viejas SLS (1.1.1) por alguna raz&oacute;n puedes dejar un
<CODE>-nodaemon</CODE> despu&eacute;s de la l&iacute;nea de xdm. esto NO funciona para versiones
posteriores. </P>


<HR>
<A HREF="Linux-Tips-Como-2.html">Anterior</A>
<A HREF="Linux-Tips-Como-4.html">Siguiente</A>
<A HREF="Linux-Tips-Como.html#toc3">Indice</A>
</BODY>
</HTML>
