<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="A. Ismael Olea González">
   <meta name="GENERATOR" content="Mozilla/4.5 [es] (Win95; I) [Netscape]">
   <meta name="Description" content="Guion para la charla que impartió el autor a la Asociación de Técnicos de Informática (A.T.I.)">
   <meta name="KeyWords" content="Linux, GNU, ATI, conferencia, uso empresarial, uso técnico">
   <title>Linux, presente y futuro</title>
</head>
<body>

<h1>
Linux, presente y futuro (guion)</h1>
Por Ismael Olea (<a href="mailto:olea@iname.com">olea@iname.com</a>)
<br>Para la asociaci&oacute;n ATI, 28/1/99
<h2>
Intro:</h2>

<ul>
<li>
Presentaci&oacute;n.</li>

<li>
Falsos mitos:</li>

<ul>
<li>
<b>Linux</b> no es un sistema operativo;</li>

<li>
<b>Linux</b> no ha sido creado por aficionados;</li>

<li>
<b>Linux</b> no es <b>Unix</b>;</li>

<li>
<b>Linux</b> no es el &uacute;nico n&uacute;cleo <i>libre</i>: <b>FreeBDS</b>,
<b>Hurd</b>,
etc<i>.</i></li>
</ul>

<li>
<b>GNU/Linux</b>:</li>

<ul>
<li>
N&uacute;cleo <b>Linux</b>;</li>

<li>
Familia de aplicaciones <b>GNU</b> + <b>BSD</b> + <b>XFree86</b> + otro
software libre-</li>
</ul>
</ul>

<h2>
Puntos fuertes de la filosof&iacute;a GNU/Linux:</h2>

<ul>
<li>
Licencia <b>GPL</b> -> <i>Software Libre</i></li>

<li>
Nuevo modelo de desarrollo -> los desarrolladores son la propia comunidad
de usuarios:</li>

<ul>
<li>
&nbsp;rapidez de desarrollo: son decenas, cientos y a veces miles las personas
que colaboran en determinadas fases del desarrollo.</li>

<li>
&nbsp;robustez: las extensivas pruebas de funcionamiento entre los usuarios
realimentan a los desarrolladores en ciclos increiblemente cortos.</li>

<li>
&nbsp;extensibilidad: cualquiera puede desarrollar nuevas funcionalidades.
La calidad de su desarrollo y su aceptaci&oacute;n por parte de los usuarios
valida la incorporaci&oacute;n del nuevo c&oacute;digo a la distribuci&oacute;n
oficial.</li>

<li>
soporte t&eacute;cnico:</li>

<ul>
<li>
<b>GNU/Linux</b> cuenta con el mayor soporte t&eacute;cnico del&nbsp; Mundo.
La comunidad de usuarios, que va desde meros aficionados y estudiantes
a curtid&iacute;simos&nbsp; profesionales y consultores del mundo <b>*IX</b>,
tiene una predisposici&oacute;n a la colaboraci&oacute;n, especialmente
a trav&eacute;s de los diferentes medios que ofrece <b>Internet</b>, que
permite obtener tiempos de respuesta a cuestiones de tipo <i>servicio t&eacute;cnico</i>
muy superiores a los servicios convencionales;</li>

<li>
soporte t&eacute;cnico a trav&eacute;s de canales comerciales en&nbsp;
crecimiento explosivo: aut&oacute;nomos, pymes y grandes empresas del entorno
<b>GNU/Linux</b>
y &uacute;ltimamente compa&ntilde;&iacute;as como <b>Compaq</b> (y tal
vez <b>IBM</b>) inician en los <b>EE.UU.</b> programas de servicio t&eacute;cnico
24h, 365 d&iacute;as al a&ntilde;o.</li>

<li>
La disposici&oacute;n del c&oacute;digo fuente permite a la empresa atacar
los hipot&eacute;ticos problemas con sus propios recursos, bien sea solucionando
'bugs' o bien a&ntilde;adiendo o extendiendo funcionalidades de las aplicaciones.
Esto no es posible en entornos comerciales sin una penalizaci&oacute;n
temporal o econ&oacute;mica, o a&uacute;n ambos, normalmente inabordable.</li>
</ul>
</ul>
</ul>

<h2>
Caracter&iacute;sticas t&eacute;cnicas de GNU/Linux:</h2>

<ul>
<li>
&nbsp;Cl&oacute;nico <b>Unix</b>, cumple 'de facto' las normas <b>POSIX</b>
e incorpora funcionalidades de la familia <b>System V</b> y de <b>BSD</b>.</li>

<li>
&nbsp;Portabilidad:</li>

<ul>
<li>
&nbsp;versiones estables: Alpha, i386, M68*, MIPS, PowerPC, Sparc.</li>

<li>
&nbsp;versiones en desarrollo: adem&aacute;s ARM, UltraSparc, PA-RISC,&nbsp;
VAX, API 1000+, CL-PS7110 e incluso 80286 y 8086.</li>

<li>
compatibilidad a nivel de c&oacute;digo fuente ANSI C, C++,&nbsp; Fortran77,
ADA, Pascal, etc.</li>
</ul>

<li>
&nbsp;Compatibilidad:</li>

<ul>
<li>
&nbsp;compatible ELF a nivel binario en plataformas i386;</li>

<li>
&nbsp;compatibilidad binaria con SCO (iBCS);</li>
</ul>

<li>
&nbsp;Conectividad:</li>

<ul>
<li>
&nbsp;sistemas de archivos extfs2, fat16, fat32, vfat, aafs, hpfs, ntfs,
ufs, ISO-9660, ncp, SMB, SysV, ufs, romfs, Xenix, Minix.</li>

<li>
&nbsp;protocolos de red: TCP/IP, IPX/SPX, Frame Relay, RDSI, NetBEUI, AppleTalk,
Midi, AX25, ArcNet, Token Ring.</li>

<li>
&nbsp;Funcionalidades TCP/IP: encaminador, cortafuegos, servidor de t&uacute;neles,
enmascaramiento, proxy,</li>

<li>
&nbsp;perif&eacute;ricos: IDE, ATAPI, SCSI, Zip, Jazz, scanners, tarjetas
multipuerto, Ethernet, ratones, unidades de cinta, tarjetas gr&aacute;ficas
y en general casi todos los perif&eacute;ricos m&aacute;s consumidos del
mercado.</li>
</ul>

<li>
&nbsp; Otras funcionalidades:</li>

<ul>
<li>
32 y 64 bits de longitud de palabra, memoria virtual, multitarea, multiusuario,
multihilo, n&uacute;cleo modular;</li>

<li>
en avanzado estado de desarrollo, por ejemplo: SMP, clustering, RAID, replicado
(mirroring), vol&uacute;menes, sistema de ficheros jer&aacute;rquicos,
ejecuci&oacute;n de aplicaciones DOS y&nbsp; Win16/32 a trav&eacute;s de
aplicaciones externas, etc.</li>
</ul>

<li>
&nbsp;entorno de desarrollo compuesto principalmente por el conjunto de
aplicaciones GNU, que es el m&aacute;s potente y portado del mundo (forma
parte del kit de pruebas de rendimiento SPEC): GCC, G++, GDB, Glibc,&nbsp;
Gnat, Emacs, etc.</li>

<ul>
<li>
&nbsp;lenguajes de desarrollo: ANSI C, ANSI C++, Java, Ada95, Fortran77,
Lisp, Tcl/tk, Perl, Python, Pascal, Objetive C, Scheme, Dylan, Modula 2-3,
Oberon, sh, csh, ksh, bash, tcsh, ensamblador, etc...</li>

<li>
&nbsp;gran cantidad de documentaci&oacute;n:</li>

<ul>
<li>
biblograf&iacute;a cl&aacute;sica sobre <b>Unix</b> y <i>sistemas abiertos</i>;</li>

<li>
est&aacute;ndares oficiales;</li>

<li>
est&aacute;ndares industriales bajo licencia;</li>

<li>
est&aacute;ndares industriales abiertos (<i>RFCs</i>, etc);</li>

<li>
proyecto de documentaci&oacute;n internacional (libre disposici&oacute;n):</li>

<ul>
<li>
p&aacute;ginas de manual, faq's, gu&iacute;as r&aacute;pidas y manuales
completos;</li>

<li>
gran cantidad de documentaci&oacute;n en ingl&eacute;s y en otra decena
de idiomas; entre todos, el espa&ntilde;ol ocupa un cuarto lugar en cuanto
a material publicado;</li>
</ul>
</ul>
</ul>

<li>
Motores gr&aacute;ficos:</li>

<ul>
<li>
<b>SVGAlib</b></li>

<li>
<b>XFree86</b>:</li>

<ul>
<li>
implementaci&oacute;n libre del protocolo <b>X</b> ;</li>

<li>
multiplataforma;</li>

<li>
<i>cliente/servidor</i>;</li>

<li>
plena operatividad en red;</li>

<li>
extremadamente flexible ;</li>

<li>
kit de desarrollo;</li>

<li>
libertad de elecci&oacute;n de gestores de ventanas y de interfaces de
usuario:</li>

<ul>
<li>
gestores de ventanas: <b>twm</b>, <b>fvwm</b>, <b>AfterStep</b>, <b>Enlightmen</b>;</li>

<li>
entornos de usuario: <b>OpenLook</b>, <b>Motif</b>, <b>GNUStep</b>, <b>CDE</b>,
<b>KDE</b>,
<b>Gnome</b>.</li>
</ul>
</ul>
</ul>
</ul>

<h2>
Aplicaciones disponibles:</h2>

<ul>
<li>
Otras aplicaciones <b>GNU</b>.</li>

<li>
Aplicaciones <b>BSD</b>.</li>

<li>
Otras aplicaciones <b>Unix</b>/<i>internet</i> <i>cliente/servidor</i>.</li>

<li>
En general, casi todo el software libre <b>*IX</b> ha sido portado a Linux
con importantes aportaciones desde el mundo universitario: herramientas
documentales, IA, ingenier&iacute;a, bases de datos, CASE, fotocomposici&oacute;n,
visualizadores y editores gr&aacute;ficos.</li>

<li>
Desde que estuvo lista la compatibilidad <b>ELF</b> e iBCS est&aacute;
disponible toda la oferta comercial de productos <b>*IX</b> para la plataforma
<b>Intel</b>.</li>
</ul>
Llegado un punto se ha creado una masa cr&iacute;tica de aplicaciones y
usuarios que abre nuevas perspectivas con las siguientes consecuencias:
<ul>
<li>
nuevas aplicaciones libres para nuevas soluciones: retoque fotogr&aacute;fico,
edici&oacute;n de sonido, herramientas multimedia, aplicaciones de gesti&oacute;n
y un extens&iacute;simo etc&eacute;tera de aplicaciones de usuario final
(frente a las cl&aacute;sicas aplicaciones de sistema);</li>

<li>
nuevos entornos gr&aacute;ficos de usuario que homogeneizan el desarrollo
de nuevas aplicaciones a&ntilde;adiendoles funcionalidades de interoperaci&oacute;n
(<b>CORBA</b>, por ejemplo): <b>GNUStep</b>, <b>KDE</b> y <b>Gnome</b>;</li>

<li>
nuevas versiones nativas de aplicaciones y backends existentes en la plataforma
<b>ELF</b>/<b>iBCS</b>
y resto de unixes: desde el <b>Wordperfect</b> de
<b>Corel</b> hasta los
<i>SGBD
relacionales&nbsp;</i> <b>Interbase</b>,
<b>Sybase</b>, <b>Adabas</b>,
<b>DB/2</b>,
<b>Informix</b> y <b>Oracle</b> pasando por <b>Lotus Notes</b>;</li>

<li>
aparici&oacute;n de nuevas suites de oficina de alta calidad: <b>ApplixWare</b>
y <b>StarOffice</b> con el anuncio de la <b>Wordperfect Suite</b> al completo.</li>
</ul>

<h2>
GNU/Linux hoy d&iacute;a</h2>

<h3>
Contras:</h3>

<ul>
<li>
A pesar de su eficacia, <b>GNU/Linux</b> no es lo &uacute;ltimo en tecnolog&iacute;a.</li>

<li>
No cuenta con herramientas, o se encuentran en un estado inicial de su
desarrollo, de <i>Misi&oacute;n Cr&iacute;tica</i> y otras funcionalidades
de muy alta tecnolog&iacute;a t&iacute;picas de grandes servidores.</li>

<li>
La base de aplicaciones de oficina y productividad a&uacute;n no es grande.</li>

<li>
La base de aplicaciones de gesti&oacute;n tampoco es muy grande.</li>

<li>
En Espa&ntilde;a todav&iacute;a la empresa se resiste a hacer p&uacute;blico
que para sus soluciones hace uso de <b>GNU/Linux</b> por entender que va
en contra de la imagen corporativa.</li>

<li>
En Espa&ntilde;a la base de desarrolladores ha sido mediatizada por la
mercadotecnia de <b>Microsoft</b> o ha realizado grand&iacute;simas inversiones
en la plataforma <b>Win32</b>/<b>WinNT</b>.</li>

<li>
En Espa&ntilde;a a&uacute;n no se entienden completamente o siquiera se
conocen los conceptos que respaldan el movimiento del software libre ni
las ventajas ni oportunidades que ofrecen.</li>

<li>
No funciona en un mainframe (aunque algo est&aacute;n preparando :-)</li>
</ul>

<h3>
Pros:</h3>

<ul>
<li>
A pesar de que no es lo &uacute;ltimo en tecnolog&iacute;a, <b>GNU/Linux</b>
es eficac&iacute;simo.</li>

<li>
<b>GNU/Linux</b> es una potent&iacute;sima plataforma que opera con un
rendimiento igual o superior a otras alternativas sobre mismas plataformas.</li>

<li>
Es escalable, desde viejos i386 (o incluso 8086 y 80286 empotrados) hasta
sistemas multinodo compuestos por cientos de CPU.</li>

<li>
Recorta gastos:</li>

<ul>
<li>
es econ&oacute;mico aun adquiri&eacute;ndolo comercialmente;</li>

<li>
funciona con hardware muy barato (<i>PC compatible</i>);</li>

<li>
por su estabilidad el coste de operaci&oacute;n es menor;</li>

<li>
reutiliza eficazmente equipos que de otra forma ser&iacute;an obsoletos
(<b>PCs</b> antiguos, viejas estaciones <b>Sparc</b>, etc).</li>
</ul>

<li>
Es adecuado a diferentes &aacute;mbitos de aplicaci&oacute;n: estaciones
de trabajo, network computers, servidores en redes heterog&eacute;neas,
servidores <i>internet</i>, servidores de bases de datos, granjas de servidores
para s&iacute;ntesis de im&aacute;genes o c&aacute;lculo matem&aacute;tico,
etc.</li>

<li>
Es lo suficientemente seguro como para asumir algunas aplicaciones cr&iacute;ticas
(hospitales, bancos, vigilancia, etc).</li>

<li>
Es la &uacute;nica plataforma <b>*IX</b> cuya presencia en el mercado ha
aumentado en los a&ntilde;os 97 y 98.</li>

<li>
Es el &uacute;nico sistema operativo, junto con <b>Windows NT</b>, cuya
presencia en el mercado ha aumentado en los dos &uacute;ltimos a&ntilde;os.</li>

<li>
Tiene una base de usuarios, contabilizada, de m&aacute;s de siete millones
en todo el mundo. Este dato merece ciertas consideraciones:</li>

<ul>
<li>
en el c&oacute;mputo s&oacute;lo se contemplaron las ventas de cdrom, dada
la disposici&oacute;n en <b>Internet</b> y a la cantidad de distribuciones
<b>GNU/Linux</b>
que no son comerciales, esta cifra se considera claramente a la baja;</li>

<li>
al ser usado principalmente como servidor este dato debe ser comparado
dentro de esa gama, donde la cifra adquiere mucha m&aacute;s importancia;</li>

<li>
por ejemplo, el 20% de los servidores conectados a <b>Internet</b> son
<b>GNU/Linux</b>.</li>
</ul>

<li>
Cuenta con una cantidad aplicaciones y servicios comerciales que crece
d&iacute;a a d&iacute;a (y no es una exageraci&oacute;n) y cada vez son
menos las grandes empresas de la inform&aacute;tica que a&uacute;n no han
inaugurado su cat&aacute;logo <b>GNU/Linux</b>.</li>
</ul>

<h2>
El mercado de GNU/Linux</h2>

<ul>
<li>
La comunidad de usuarios ya existente que, con crecimientos anuales entre
el 100% y el 200% seg&uacute;n consultores externos y nada comprometidos,
est&aacute; formada por usuarios que la prefieren por motivos objetivos
o puramente subjetivos.</li>

<li>
Migraci&oacute;n de aplicaciones obsoletas (<i>Euro</i>, <i>Y2K</i>, <i>Internet</i>,<i>
C/S</i>) basadas en redes y servidores no <b>Windows</b> (<b>Novell</b>,
<b>SCO</b>/<b>XENIX</b>,
<b>Theos</b>,
etc).</li>

<li>
Aplicaciones verticales.</li>

<li>
Cajas negras.</li>

<li>
Aplicaciones donde <b>Windows NT</b> no opera satisfactoriamente:</li>

<ul>
<li>
servidores conectados a redes heterog&eacute;neas;</li>

<li>
servidores <i>Internet</i>;</li>

<li>
servidores de red (<b>Novell</b>, <b>SMB</b>, <b>NFS</b>, etc);</li>

<li>
servidores de bases de datos.</li>
</ul>
</ul>

<h2>
GNU/Linux en el futuro m&aacute;s cercano</h2>

<ul>
<li>
&nbsp;Los analistas ven en <b>GNU/Linux</b> a la &uacute;nica plataforma
capaz de&nbsp; hacer frente a la hegemon&iacute;a de <b>Windows NT</b>
en los pr&oacute;ximos 5 a&ntilde;os.</li>

<li>
&nbsp;La mayor&iacute;a de las compa&ntilde;&iacute;as <b>Fortune 500</b>
abandona sus prejuicios y&nbsp; har&aacute; un uso creciente de la plataforma
siempre que lo encuentre&nbsp; adecuado.</li>

<li>
&nbsp;Casi todas las grandes compa&ntilde;&iacute;as de soft/hard <b>Unix</b>
(y otras como <b>Apple</b>) promocionar&aacute;n <b>GNU/Linux</b> por los
siguientes motivos:</li>

<ul>
<li>
diversificaci&oacute;n de la oferta de ss.oo. para sus plataformas (<b>Sun</b>,
<b>Apple</b>,
<b>Digital/Compaq</b>);</li>

<li>
ofrecer escalabilidad <b>Unix</b> hacia abajo complementando sus propios
equipos con <b>PC</b> con <b>GNU/Linux</b> (<b>Sun</b>, <b>SGI</b>, <b>Digital/Compaq</b>);</li>

<li>
difusi&oacute;n de la filosof&iacute;a <b>Unix</b>, aumento de las aplicaciones
<b>Unix</b>
susceptibles de ser portadas a sus plataformas, formaci&oacute;n de profesionales
<b>Unix</b>
que puedan optar por sus plataformas para aplicaciones con grandes requerimientos.</li>
</ul>

<li>
<b>Sun</b> adem&aacute;s ve en <b>GNU/Linux</b> una plataforma adecuada
para la difusi&oacute;n de <b>Java</b>.</li>

<li>
<b>Intel</b> apoyar&aacute; <b>GNU/Linux</b> como una forma de diversificar
la oferta de ss.oo. par su plataforma, como apoyo a la futura plataforma
<b>Merced</b>
y de distanciarse un tanto de sus alianzas con <b>Microsoft</b>, especialmente
con vistas a los posibles procesos anti-trust.</li>

<li>
Compa&ntilde;&iacute;as como <b>Corel</b> apuestan su viabilidad futura
en un mercado virgen. Otras grandes compa&ntilde;&iacute;as aumentar&aacute;n
sus cat&aacute;logos completando las ofertas que inician con sus productos
estrella.</li>

<li>
Una vez desarrolladas aplicaciones o servicios sobre <b>GNU/Linux</b>&nbsp;
ser&aacute; f&aacute;cil portar a otras plataformas <b>*IX</b> (nuevos
mercados, escalando los actuales servicios) o al menos m&aacute;s f&aacute;cil
que migrar aplicaciones que se han quedado grandes desde plataformas <b>WinNT</b>
a otras m&aacute;s potentes.</li>
</ul>

<h2>
GNU/Linux a muy largo plazo</h2>
Es imposible predecir con exactitud c&oacute;mo habr&aacute; evolucionado
la plataforma <b>GNU/Linux</b> en m&aacute;s de diez a&ntilde;os. Por deporte
podr&iacute;amos postular varias posibilidades:
<ul>
<li>
segunda juventud del mundo <b>Unix</b>, liderada por <b>GNU/Linux</b> y
segundada por los principales <b>*IX</b> (o los supervivientes), con una
pl&eacute;tora de usuarios y aplicaciones (comerciales y no comerciales)
frente a la plataforma <b>NT</b>;</li>

<li>
evoluci&oacute;n del n&uacute;cleo con la incorporaci&oacute;n de tecnolog&iacute;a
de misi&oacute;n cr&iacute;tica apta para granjas de servidores;</li>

<li>
evoluci&oacute;n de los actuales entornos de usuario hasta una integraci&oacute;n
completa apta para estaciones de trabajo de usuario final y de altas prestaciones;</li>

<li>
adaptaci&oacute;n de todo el soft de aplicaci&oacute;n, e incorporaci&oacute;n
de funcionalidades del propio n&uacute;cleo, a un n&uacute;cleo de nueva
generaci&oacute;n descendiente de la filosof&iacute;a</li>
</ul>

<h2>
Enlaces importantes:</h2>

<ul>
<li>
<a href="http://www.linux.org">www.linux.org</a></li>

<li>
<a href="http://www.kernel.org">www.kernel.org</a></li>

<li>
<a href="http://metalab.unc.edu/LDP/">metalab.unc.edu/LDP/</a></li>

<li>
<a href="http://www.linuxhq.com">www.linuxhq.com</a></li>

<li>
<a href="http://www.slashdot.org">www.slashdot.org</a></li>

<li>
<a href="http://www.freshmeat.net">www.freshmeat.net</a></li>

<li>
<a href="http://www.hispalinux.es">www.hispalinux.es</a></li>

<li>
<a href="http://lucas.hispalinux.es">lucas.hispalinux.es</a></li>

<li>
<a href="http://www.insflug.org">www.insflug.org</a></li>

<li>
<a href="http://slug.hispalinux.es">slug.hispalinux.es</a></li>
</ul>

</body>
</html>
