<HTML>
<HEAD>
<TITLE>Terminales Serie COMO: Configuraci&oacute;n del software</TITLE>
</HEAD>
<BODY>
<A HREF="Terminales-Como-3.html">Anterior</A>
<A HREF="Terminales-Como-5.html">Siguiente</A>
<A HREF="Terminales-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Configuraci&oacute;n del software</A></H2>



<H2><A NAME="ss4.1">4.1 Linux</A></H2>


<P>Entra como superusuario y modifica el <CODE>/etc/inittab</CODE> de la
siguiente manera: </P>
<P>
<UL>
<LI>Tienes que buscar la secci&oacute;n <CODE>#Serial lines</CODE> y a&ntilde;adir
una l&iacute;nea como la siguiente: 

<BLOCKQUOTE><CODE>
<PRE>
s2:45:respawn:/sbin/agetty -L 38400 ttyS1
</PRE>
</CODE></BLOCKQUOTE>


En la que habr&aacute; que cambiar algunas cosas dependiendo del puerto serie del
PC-<B>Linux</B> en donde tengas el terminal conectado: 

<DL>
<DT><B>Si tienes el terminal en el COM1:</B><DD><P><CODE>s1:45:respawn:/sbin/agetty -L 9600 ttyS0</CODE></P>

<DT><B>Si tienes el terminal en el COM2:</B><DD><P><CODE>s2:45:respawn:/sbin/agetty -L 9600 ttyS1</CODE></P>

<DT><B>Si tienes el terminal en el COM3:</B><DD><P><CODE>s3:45:respawn:/sbin/agetty -L 9600 ttyS2</CODE></P>

<DT><B>Si tienes el terminal en COM4:</B><DD><P><CODE>s4:45:respawn:/sbin/agetty -L 9600 ttyS3</CODE></P>
</DL>

</LI>
<LI>Una vez insertada esa l&iacute;nea en <CODE>/etc/inittab</CODE>, hay que hacer
que el proceso <CODE>init</CODE> relea el fichero <CODE>inittab</CODE>; para ello
ejecutaremos la orden: 

<BLOCKQUOTE><CODE>
<PRE>
init q
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>


<H2><A NAME="ss4.2">4.2 El terminal.</A></H2>


<P>Cargar el MSDOS y entrar en el programa de emulaci&oacute;n de terminales. </P>
<P>Debes elegir el tipo de terminal ANSI o, VT100, VT102, VT220, VT52.  </P>
<P>Cualquiera de ellos deber&iacute;a funcionar como m&iacute;nimo para comprobar que la
l&iacute;nea funciona. </P>
<P>Los par&aacute;metros del puerto serie deben ser 9600,N,8,1. </P>
<P>Apretando un par de <I>ENTER</I>s deber&iacute;a salir en la pantalla del terminal
el texto de LOGIN. </P>
<P>Si eso no funciona, algo est&aacute; pasando en las l&iacute;neas serie.</P>


<H2><A NAME="ss4.3">4.3 Afinando Linux para la conexi&oacute;n</A></H2>


<P>Espero que hay&aacute;is llegado hasta aqu&iacute; sin mucha dificultad.</P>

<H3>Explicaci&oacute;n de la l&iacute;nea del <CODE>inittab</CODE></H3>


<P>Aqu&iacute; voy a explicar esa l&iacute;nea que hay que a&ntilde;adir al <CODE>inittab</CODE>.</P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>&emsp; <BR></P>
<P>Qu&eacute; significa cada cosa:
<BLOCKQUOTE><CODE>
<PRE>
s2:45:respawn:/sbin/agetty -L 9600 ttyS1  
^  ^     ^             ^      ^      ^ 
|  |     |             |      |      |
|  |     |             |      |      `---- /dev/ttyS1 es decir COM2:
|  |     |             |      |            es el dispositivo que soporta
|  |     |             |      |            la conexion. Se puede cambiar
|  |     |             |      |            por ttyS0, ttyS2 o ttyS3.
|  |     |             |      |
|  |     |             |      |
|  |     |             |      `------- Baudios a los que se efectua la 
|  |     |             |               conexion: puede ser uno de los
|  |     |             |               siguientes: 300, 600, 1200, 2400
|  |     |             |               9600, 19200, 38400, 57600, 115200
|  |     |             |               Si tienes una UART tipo 8250 o 
|  |     |             |               16450 mejor que no pases de 9600
|  |     |             |               so pena de freir el PC a interrup-
|  |     |             |               ciones. En el terminal da igual
|  |     |             |               porque no tiene que hacer nada mas,
|  |     |             |               pero en el PC-Linux importa no 
|  |     |             |               pasarse so pena de perder potencia
|  |     |             |               de multiproceso.
|  |     |             |               Recomiendo 19200 baudios.
|  |     |             |
|  |     |             |
|  |     |             `-- Programa que va a controlar la comunicacion por
|  |     |                 la parte Linux. Existen el controlador 
|  |     |                 agetty, otro es el uugetty. Tambien esta el getty
|  |     |                 Aqui hay que jugar un poco. Yo uso agetty, que no
|  |     |                 quiere decir que sea el mejor, pero funciona.
|  |     |
|  |     |
|  |     `----- No puedo asegurar que eso sea cierto, pero me parece que 
|  |            sirve para que el proceso agetty se auto-restaure cuando
|  |            por alguna razon muera.
|  |
|  |
|  `----- No puedo asegurar que sea cierto, pero me parece que son los
|         runlevels validos para que funcione ese terminal.
|
`----- Identificacion. Cuando por ejemplo se hace 'top' salen los procesos
       que estan funcionando en la maquina. Una de las columnas del top 
       es la del terminal donde se estan ejecutando. En los procesos
       ejecutados desde este terminal va a salir el 's2' o lo que se
       escriba aqui.
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Par&aacute;metros de <CODE>agetty</CODE></H3>


<P>Fij&aacute;os que en la l&iacute;nea que estamos estudiando, le paso el par&aacute;metro
<CODE>-L</CODE> a <CODE>agetty</CODE>. Si hac&eacute;is <CODE>man agetty</CODE> podr&eacute;is comprobar porqu&eacute;
hago eso: estoy forzando a que la l&iacute;nea sea local, es decir, que no se
haga la la comprobaci&oacute;n del pin de <CODE>CD</CODE> (<I>Carrier Detect</I>). Ese pin
deber&iacute;a estar conectado en el cable, pero no lo hago para mantener la
compatibilidad con el INTERLNK/INTERSVR de Microsoft MSDOS. Una vez m&aacute;s el
<B>Linux</B> se adapta a las necesidades del usuario. (¿¡Me suena esa frase
a WIN95!?) </P>
<P>Tambi&eacute;n pod&eacute;is activar el protocolo de hardware <B>RTS/CTS</B>, que
acelerar&aacute; un poco la comunicaci&oacute;n. Para hacer eso necesit&aacute;is que el cable
os soporte esa funci&oacute;n; adem&aacute;s deber&eacute;is configurar el terminal o mejor
dicho, El software de terminal para que lo haga. Yo no lo tengo
habilitado.  Para activar el protocolo por hardware <B>CTS/RTS</B>
pasadle el par&aacute;metro '<CODE>-h</CODE>' a <CODE>agetty</CODE>, por ejemplo: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
s2:45:respawn:/sbin/agetty -hL 9600 ttyS1  
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss4.4">4.4 Afinando el terminal</A></H2>


<P>Aqu&iacute; m&aacute;s que un afinamiento os voy a explicar c&oacute;mo instalar el
Telix 3.22 para DOS para que haga de terminal.</P>
<P>
<UL>
<LI> Primero ten&eacute;is que conseguir los archivos v&iacute;a FTP o v&iacute;a
alg&uacute;n cdrom de Shareware
<SL>N. del R. <BR> O de cualquier
BBS</SL>
. Yo voy a explicar la versi&oacute;n 3.22, que no es la &uacute;ltima,
pero tampoco es vieja. 

Los archivos se llaman: 

<UL>
<LI><CODE>tlx322-1.zip</CODE></LI>
<LI><CODE>tlx322-2.zip</CODE></LI>
<LI><CODE>tlx322-3.zip</CODE></LI>
<LI><CODE>tlx322-4.zip</CODE></LI>
</UL>
 

De los cuales s&oacute;lo vais a necesitar los dos primeros.
</LI>
<LI> Descomprimid los ZIPs <CODE>tlx322-1.zip</CODE> y <CODE>tlx322-1.zip</CODE> en un
directorio. Una vez descomprimidos, ejecutad '<CODE>MODEMCFG.EXE</CODE>' y escoged
alguno de los de 1200 baudios (para que no quiera grabar la RAM del
m&oacute;dem). Seleccionas el puerto correspondiente y sales del programa. 
</LI>
<LI> Si te falta espacio (o quieres tener el Telix en un disquete
porque no tienes disco duro o por comodidad) puedes cargarte el
<CODE>CS.EXE</CODE> y el <CODE>CSS.EXE</CODE>.

Yo tengo Telix322 + MSDOS6.2 + <CODE>KERMIT.EXE</CODE> en 1 disco de 720K.
</LI>
<LI>Ejecutar <CODE>TELIX.EXE</CODE> y una vez haya intentado sin resultado
inicializar el m&oacute;dem, pulsas <I>ALT-O</I> (opciones).
</LI>
<LI>Te vas a <I>Modem and dialing</I> y en el m&oacute;dem <I>init string</I> le
pones un par de <I>control-M</I> (se hace poniendo un acento circunflejo ^ y
una M).
</LI>
<LI>Te vas al <I>Terminal options</I> y pones lo pertinente en la opci&oacute;n
A: por ejemplo COM2, 19200, None, 8, 1. 
</LI>
<LI>El el mismo men&uacute; de <I>Terminal Options</I>, la opci&oacute;n <I>C</I> deber&iacute;a
estar en ANSI o en VT102.
</LI>
<LI>En el mismo men&uacute; de <I>Terminal Options</I>, la opci&oacute;n <I>I</I> deber&iacute;a
estar en: <I>Backspace key sends DEL</I>.
</LI>
<LI>En el mismo men&uacute; de <I>Terminal Options</I>, vas a encontrar la
opci&oacute;n <I>K</I> que sirve para controlar el flujo por hardware. (<CODE>agetty
-h</CODE>).
</LI>
<LI>Finalmente te vas a <I>Write Setup to Disk</I>.
</LI>
<LI>Sales del Telix: <I>ALT-X</I>
</LI>
<LI>Vuelves a entrar. Te deber&iacute;a salir el login en la pantalla.</LI>
</UL>
</P>


<H2><A NAME="ss4.5">4.5 Soluci&oacute;n a posibles problemas</A></H2>


<P>Siempre se pueden tener problemas, aunque conozco a bastante gente que ha
montado este cable y le ha funcionado. </P>
<P>Qu&eacute; hacer si no funciona: </P>

<H3>Comprobaci&oacute;n del cable</H3>


<P>Para probar el cable, coges los 2 PCs, les pones en marcha un Telix y
pulsas en ambos <I>ALT-P</I>. </P>
<P>Configura ambos PCs a una velocidad de 1200 baudios, N, 8,1.</P>
<P>Configura en cada PC el COM correspondiente.</P>
<P>Escribe desde un PC y tendr&aacute;s que ver el texto en la pantalla del otro.</P>
<P>Prueba desde ambos PCs. Puede ser que la comunicaci&oacute;n s&oacute;lo sea
mono-direccional por alg&uacute;n defecto del cable o del hardware.</P>
<P>Si el cable est&aacute; bien construido y el hardware no falla eso deber&iacute;a ir
bien. </P>

<H3>El cable funciona pero Linux no.</H3>


<P>¿Qu&eacute; velocidad escogiste? Prueba desde 9600 baudios a ver qu&eacute; tal. </P>
<P>Puede ser que tengas problemas de velocidad. Ejecuta MSD en ambos
ordenadores para ver qu&eacute; UARTs tienen. Seguramente el PC viejo tendr&aacute; una
8250, por lo que no es recomendable pasar de 9600, aunque he probado a
19200 y suele funcionar.</P>
<P>Nuestro terminal en <CODE>hades.udg.es</CODE> es un 286-12 con UART 8250 y le
podemos sacar 38400, aunque a veces falla.</P>
<P>¿Las velocidades son las mismas? </P>
<P>La velocidad que escojas en el Telix o el programa que utilices para
emular un terminal tiene que ser la misma que configures en la l&iacute;nea del
<CODE>/etc/inittab</CODE>.</P>
<P>¿Habilitaste alg&uacute;n protocolo por hardware? </P>
<P>Algunos puertos serie no llevan todas las l&iacute;neas, as&iacute; que aunque el cable
las tenga, no llegan hasta el <B>Linux</B> o el programa de terminal. 
Prueba deshabilitando el protocolo por hardware, es decir, quitando el
par&aacute;metro '<CODE>-h</CODE>' del <CODE>agetty</CODE> en <CODE>/etc/inittab</CODE>, y
habilitando el protocolo <B>XON/XOFF</B> por software en el programa de
comunicaciones.</P>
<P>¿Est&aacute;s seguro que pusiste <CODE>ttyS0</CODE> para COM1, <CODE>ttyS1</CODE> para COM2,
<CODE>ttyS2</CODE> para COM3 y <CODE>ttyS3</CODE> para COM4? Es muy f&aacute;cil colarse, el
<CODE>ttySx</CODE> es siempre uno menos que el COMx. </P>
<P>Puede que tengas alg&uacute;n problema de IRQs. ¿Est&aacute;s compartiendo IRQ
con alg&uacute;n otro dispositivo?</P>
<P>Haz pruebas con el <CODE>minicom</CODE> (cl&oacute;nico del Telix para <B>Linux</B>) para
saber si los datos al menos llegan.</P>
<P>Comprueba los <I>majors</I> y los <I>minors</I> de los puertos de
comunicaciones: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
/dev/ttyS0: crw-rw-rw-   X  USER GROUP  4,  64  xxx xx xx:xx ttyS0
/dev/ttyS1: crw-rw-rw-   X  USER GROUP  4,  65  xxx xx xx:xx ttyS1
/dev/ttyS2: crw-rw-rw-   X  USER GROUP  4,  66  xxx xx xx:xx ttyS2
/dev/ttyS3: crw-rw-rw-   X  USER GROUP  4,  67  xxx xx xx:xx ttyS3
                                        ^    ^
                                        |    |
                                        |    |
                                        |    `------MINOR
                                        `-----------MAJOR
</PRE>
</CODE></BLOCKQUOTE>
</P>


<HR>
<A HREF="Terminales-Como-3.html">Anterior</A>
<A HREF="Terminales-Como-5.html">Siguiente</A>
<A HREF="Terminales-Como.html#toc4">Indice</A>
</BODY>
</HTML>
