<HTML>
<HEAD>
<TITLE>Terminales Serie COMO: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Terminales-Como-2.html">Siguiente</A>
<A HREF="Terminales-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>Creo que conectar un terminal a un <B>Linux</B> es una de las experiencias
m&aacute;s bonitas que se pueden hacer para ver c&oacute;mo tu PC monousuario se
convierte en una aut&eacute;ntica estaci&oacute;n de trabajo multiusuario, adem&aacute;s de
poder aprovechar tu viejo PC-XT o PC-AT para terminal. </P>
<P>Lo que hace falta es un PC con <B>Linux</B>, que supongo que ya ten&eacute;is, que
disponga de un puerto serie libre. <I>Cuidad&iacute;n cuidad&iacute;n</I> con esas
m&aacute;quinas con COM3 y COM4 que suelen compartir IRQ con COM1 y COM2, de
forma que suelen traer problemas cuando se usa por ejemplo COM1 y COM3 o
COM2 y COM4.</P>
<P>Tambi&eacute;n hace falta un terminal, que debe disponer de un puerto serie. Lo
mismo dicho antes para los COM3 y los COM4, es tambi&eacute;n aplicable aqu&iacute; si
ese terminal va a ser vuestro viejo PC-XT o cualquier otro PC.</P>
<P>Igualmente le va a hacer falta un software de emulaci&oacute;n de terminal para
poder cumplir su misi&oacute;n. Ese software puede ser el mismo software que se
usa para llamar por el m&oacute;dem, por ejemplo el TELIX, el PROCOMM+, o el
<I>Terminal</I> del <EM>Ventanucos</EM>. Si el terminal es realmente un
terminal, por ejemplo un DEC VT220 o similar, va a ser m&aacute;s f&aacute;cil, aunque
no todo el mundo tiene un terminal en su casa, es m&aacute;s frecuente encontrar
un viejo 8088. </P>
<P>Para poder transmitir los datos hace falta un cable de los llamados
<I>null-m&oacute;dem</I> o de <I>l&iacute;neas cruzadas</I>, habi&eacute;ndolos de muchos tipos. El
que yo tengo montado es el mismo que el que recomienda el MSDOS para usar
el INTERLNK/INTERSVR, que adem&aacute;s funciona de maravilla en <B>Linux</B>.</P>
<P>Por &uacute;ltimo, hacen falta unas pocas ganas de hacer pruebas.</P>

<HR>
Anterior
<A HREF="Terminales-Como-2.html">Siguiente</A>
<A HREF="Terminales-Como.html#toc1">Indice</A>
</BODY>
</HTML>
