<HTML>
<HEAD>
<TITLE>Sistema de Archivos Criptogr&aacute;fico bajo Linux (CFS) COMO: Copyright</TITLE>
</HEAD>
<BODY>
<A HREF="SAC-Como-1.html">Anterior</A>
<A HREF="SAC-Como-3.html">Siguiente</A>
<A HREF="SAC-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Copyright</A></H2>


<P>La siguiente nota de copyright, copiada directamente de CFS 1.12 describe
las restricciones sobre el uso de CFS:</P>
<P>El autor de este software es Matt Blaze.  Copyright (c) 1992, 1993,
1994 por AT&amp;T. Se permite usar, copiar, y modificar este software sin
necesidad de permiso expreso, con la condici&oacute;n que este aviso sea incluido
&iacute;ntegramente en todas las copias del software tal y como est&aacute; en todas las
copias o modificaciones de este software, as&iacute; como en todas las copias de
la documentaci&oacute;n de soporte para dicho software. </P>
<P>Este software est&aacute; sujeto a los controles de exportaci&oacute;n de los Estados
Unidos. No est&aacute; permitido exportarlo, en su totalidad o en parte, por
cualquier motivo o permitir cualquier exportaci&oacute;n, por medio de acto u
omisi&oacute;n, sin previa autorizaci&oacute;n de parte del gobierno de los Estados
Unidos y permiso escrito de AT&amp;T. </P>
<P>En particular, usted no debe hacer disponible cualquier parte de este
software para distribuci&oacute;n general o no restringida a otros, o no deber&iacute;a
usted revelar este software a personas diferentes a los ciudadanos y
residentes permanentes de los Estados Unidos y Canad&aacute;. </P>
<P>ESTE SOFTWARE SE PROVEE "TAL CUAL", SIN NINGUNA GARANT&Iuml;A EXPRESA O
IMPLICADA. EN PARTICULAR, NI LOS AUTORES NI AT&amp;T HACEN NINGUNA
REPRESENTACION O GARANT&Iacute;A DE NING&Uacute;N TIPO CONCERTANDO LA MERCANTILIDAD DE
ESTE SOFTWARE O SUS PROP&Oacute;SITOS PARA ALG&Uacute;N PROP&Oacute;SITO EN PARTICULAR. </P>
<P>A pesar que la informaci&oacute;n en este documento es considerada como correcta,
ni el Autor ni los Laboratorios CIS, o la Universidad Temple da ninguna
clase de GARANT&Iacute;AS y no es o se hace responsable de lo que pueda pasar si
usted sigue esta gu&iacute;a.  La informaci&oacute;n en este documento se proporciona
TAL CUAL!. </P>

<HR>
<A HREF="SAC-Como-1.html">Anterior</A>
<A HREF="SAC-Como-3.html">Siguiente</A>
<A HREF="SAC-Como.html#toc2">Indice</A>
</BODY>
</HTML>
