<HTML>
<HEAD>
<TITLE>Sistema de Archivos Criptogr&aacute;fico bajo Linux (CFS) COMO: Creaci&oacute;n del directorio CFS.</TITLE>
</HEAD>
<BODY>
<A HREF="SAC-Como-4.html">Anterior</A>
<A HREF="SAC-Como-6.html">Siguiente</A>
<A HREF="SAC-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Creaci&oacute;n del directorio CFS.</A></H2>


<P>Para crear un directorio CFS protegido llamado <CODE>secreto</CODE> use el comando</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cmkdir secreto
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Le pedir&aacute; que la frase de paso y que la verifique. Si sale bien, un nuevo
directorio llamado <CODE>secreto</CODE> aparecer&aacute; en el directorio actual.  Este
directorio contendr&aacute; informaci&oacute;n encriptada la cual no ser&aacute; accesible,
s&oacute;lo lo ser&aacute; en el caso de que &eacute;ste est&eacute; a&ntilde;adido al &aacute;rbol del CFS. </P>
<P>Para ordenar que el directorio <CODE>secreto</CODE> se a&ntilde;ada a la lista de
directorios administrados por CFS, este ha de ser a&ntilde;adido a el &aacute;rbol CFS
usando la instrucci&oacute;n: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
cattach secreto Gran-Secreto
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>CFS requerir&aacute; que escriba la frase de paso para el acceso. Si &eacute;sta
coincide con la frase de paso proporcionada a la instrucci&oacute;n <CODE>cmkdir</CODE>
que cre&oacute; el directorio originalmente, la informaci&oacute;n en el directorio
secreto ser&aacute; accesible de forma no encriptada bajo
<CODE>/securefs/Gran-Secreto</CODE> al usuario que proporcion&oacute; la frase de
paso correcta. Note que usualmente toma cerca de un minuto a&ntilde;adir el
directorio protegido al &aacute;rbol del CFS. Cuando el usuario ha terminado de
manipular la informaci&oacute;n debe utilizar la instrucci&oacute;n: </P>

<P>
<BLOCKQUOTE><CODE>
<PRE>
cdetach Gran-Secreto
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para destruir la llave de acceso. Esta instrucci&oacute;n elimina el directorio
<CODE>secreto</CODE> de la lista de directorios administrados por CFS haciendo
imposible acceder a la informaci&oacute;n en forma de texto plano en este
directorio hasta que nuevamente sea a&ntilde;adido usando la instrucci&oacute;n
<CODE>cattach</CODE>.</P>

<HR>
<A HREF="SAC-Como-4.html">Anterior</A>
<A HREF="SAC-Como-6.html">Siguiente</A>
<A HREF="SAC-Como.html#toc5">Indice</A>
</BODY>
</HTML>
