<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PCMCIA COMO : Informaci&oacute;n general y requerimientos de hardware </TITLE>
 <LINK HREF="PCMCIA-Como-2.html" REL=next>

 <LINK HREF="PCMCIA-Como.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="PCMCIA-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="PCMCIA-Como.html#toc1">Índice general</A>
<HR>
<H2><A NAME="general"></A> <A NAME="s1">1. Informaci&oacute;n general y requerimientos de hardware </A></H2>

<P>
<P>
<H2><A NAME="introduccion"></A> <A NAME="ss1.1">1.1 Introducci&oacute;n </A>
</H2>

<P>
<P>Los Servicios de Tarjeta para Linux son un paquete de soporte completo
para PCMCIA o <I>PC Card</I>. Incluye un conjunto de m&oacute;dulos cargables en el
kernel que implementan una versi&oacute;n de la interface del programa de
aplicaci&oacute;n de Servicios de Tarjetas, un conjunto de controladores de
clientes para tarjetas espec&iacute;ficas, y un demonio controlador de tarjetas
que responde a los eventos de inserci&oacute;n y extracci&oacute;n de tarjetas, el cual
carga y descarga los controladores seg&uacute;n sea necesario. Soporta
«extracci&oacute;n en caliente» de la mayor&iacute;a de tarjetas, por lo que pueden ser
insertadas y extra&iacute;das de forma segura en cualquier momento.
<P>Este software est&aacute; en continuo desarrollo. Probablemente contenga
<I>bugs</I>, y debe ser usado con precauci&oacute;n. Har&eacute; lo que est&eacute; en mi mano
para resolver los problemas que me son comunicados, pero si no me los
dice, nunca lo sabr&eacute;. Si usa este c&oacute;digo, espero que me env&iacute;e sus
experiencias, ¡buenas o malas!
<P>Si tiene sugerencias de c&oacute;mo puede mejorarse este documento, por favor
h&aacute;gamelo saber (<CODE>
<A HREF="mailto:dhinds@hyper.stanford.edu">dhinds@hyper.stanford.edu</A></CODE>).
<P>
<H2><A NAME="licencia"></A> <A NAME="ss1.2">1.2 Licencia y renuncia de responsabilidad </A>
</H2>

<P>
<P>Derechos Reservados &copy; 1998 David A. Hinds 
<P>Este documento puede ser reproducido o distribuido en cualquier forma sin
mi permiso previo. Las versiones modificadas de este documento, incluyendo
traducciones a otros idiomas, pueden ser distribuidos libremente, si son
claramente identificados como tales, y siempre que este copyright se
incluya intacto.
<P>Este documento puede ser inclu&iacute;do en distribuciones comerciales sin mi
previo consentimiento. Aunque no suponga requisito, me gustar&iacute;a estar
informado de su uso. Si pretende incorporar este documento en un trabajo
para ser publicado, por favor contacte conmigo para asegurarme que tiene
la &uacute;ltima versi&oacute;n disponible. 
<P>Este documento se proporciona «TAL CUAL», sin garant&iacute;as expresas o
impl&iacute;citas. Utilice la informaci&oacute;n en este documento bajo su propio
riesgo. 
<P>
<H2><A NAME="ultima"></A> <A NAME="ss1.3">1.3 ¿Cu&aacute;l es la &uacute;ltima versi&oacute;n, y d&oacute;nde puedo obtenerla? </A>
</H2>

<P>
<P>La versi&oacute;n actual de los Servicios de Tarjetas es la <CODE>3.0</CODE>, y las
actualizaciones menores o reparaciones de <I>bugs</I> se numeran <CODE>3.0.1</CODE>,
<CODE>3.0.2</CODE>, y as&iacute; sucesivamente.
<P>El c&oacute;digo fuente de la &uacute;ltima versi&oacute;n est&aacute; disponible en <CODE>
<A HREF="ftp://hyper.stanford.edu">ftp://hyper.stanford.edu</A></CODE> en
el directorio <CODE>/pub/pcmcia</CODE> como <CODE>pcmcia-cs-3.0.?.tar.gz.</CODE>
Habr&aacute; usualmente varias versiones ah&iacute;.  Por lo general, solo conservo la
&uacute;ltima versi&oacute;n menor para dar origen a una versi&oacute;n mayor. 
<P>Las nuevas versiones pueden contener c&oacute;digo relativamente sin probar, as&iacute;
que tambi&eacute;n conservo la &uacute;ltima versi&oacute;n de la &uacute;ltima mayor como «colch&oacute;n»
relativamente estable; el retraso actual es <CODE>2.9.12</CODE>. Vd. decide qu&eacute;
versi&oacute;n es m&aacute;s apropiada, el archivo <CODE>CHANGES</CODE> mostrar&aacute; las diferencias
m&aacute;s importantes. 
<P><CODE>
<A HREF="ftp://hyper.stanford.edu">ftp://hyper.stanford.edu</A></CODE> es replicado en <CODE>
<A HREF="ftp://sunsite.unc.edu">ftp://sunsite.unc.edu</A></CODE> (y todos
los servidores r&eacute;plica de <I>Sunsite</I>) en
<CODE>/pub/Linux/kernel/pcmcia</CODE>. 
<P>Si no se siente Vd. a gusto compilando controladores, hay controladores
precompilados incluidos con las versiones actuales de la mayor&iacute;a de las
distribuciones principales de Linux, incluyendo <I>Slackware</I>,
<I>Debian</I>, <I>Red Hat</I>, <I>Caldera</I>, <I>SuSE</I>, e <I>Yggdrasil</I>,
entre otros. 
<P>
<H2><A NAME="sistemas"></A> <A NAME="ss1.4">1.4 ¿Qu&eacute; sistemas est&aacute;n soportados? </A>
</H2>

<P>
<P>Este paquete deber&iacute;a correr en la mayor&iacute;a de port&aacute;tiles basados en Intel y
que sean «Linuxizables». Tambi&eacute;n corre en plataformas basadas en Alpha
(<I>DEC Multia</I>, por ejemplo). Se programa para hacer al paquete
completamente <I>dual-endian</I>, as&iacute; que tambi&eacute;n soporta plataformas
basadas en <I>PowerPC</I> (<I>Apple Powerbooks</I>, por ejemplo). Los
controladores de <I>sockets</I> m&aacute;s comunes est&aacute;n soportados. Las bah&iacute;as de
tarjetas PCMCIA para sistemas de escritorio deben funcionar si usan un
controlador soportado, y se conectan directamente al bus ISA o PCI, lo
opuesto a los adaptadores SCSI-a-PCMCIA o IDE-a-PCMCIA.
<P>Est&aacute;n soportados los siguientes controladores:
<P>
<UL>
<LI>Cirrus Logic PD6710, PD6720, PD6722, PD6729, PD6730, PD6732, PD6832
</LI>
<LI>Intel i82365sl B, C, y secuencias DF, 82092AA
</LI>
<LI>O2Micro OZ6729, OZ6730, OZ6832, OZ6833, OZ6836, OZ6860
</LI>
<LI>Omega Micro 82C092G
</LI>
<LI>Ricoh RF5C296, RF5C396, RL5C465, RL5C466, RL5C475, RL5C476, RL5C478
</LI>
<LI>SMC 34C90
</LI>
<LI>Texas Instruments PCI1130, PCI1131, PCI1210, PCI1220, PCI1221,
PCI1250A, PCI1251A, PCI1251B, PCI1450
</LI>
<LI>Toshiba ToPIC95, ToPIC97 (experimental)
</LI>
<LI>Vadem VG465, VG468, VG469
</LI>
<LI>VLSI Technologies 82C146, VCF94365
</LI>
<LI>VIA VT83C469
</LI>
<LI>Databook DB86082, DB86082A, DB86084, DB86084A, DB86072, DB86082B
</LI>
</UL>
<P>Otros controladores que est&aacute;n registrados como compatibles con el Intel
<I>i82365sl</I>, funcionar&aacute;n tambi&eacute;n como norma general.
<P>El soporte para tarjetas <I>CardBus</I> de 32 bits es todav&iacute;a experimental. 
Los manejadores previos a la versi&oacute;n <CODE>3.0</CODE> s&oacute;lo soportan tarjetas de 16
bits en sockets <I>CardBus</I>. Debido al paso tan r&aacute;pido en el cambio de la
tecnolog&iacute;a para el hardware de port&aacute;tiles, aparecen nuevos controladores
frecuentemente, y puede producirse cierto estancamiento entre el momento
en que aparece un nuevo modelo en el mercado, y el que haya soporte para
ese controlador.
<P>Toshiba ha dispuesto parcialmente documentaci&oacute;n sobre sus chipsets
<I>ToPIC95</I> y <I>ToPIC97</I>, sin embargo, la informaci&oacute;n que han liberado
no ha sido la realmente adecuada. A pesar de los informes de conflictos,
Toshiba no ha hecho alg&uacute;n esfuerzo efectivo para remediar esta situaci&oacute;n. 
Hay problemas serios en el soporte de Linux para los chipsets ToPIC, que
no pueden ser resueltos hasta que est&eacute; disponible una documentaci&oacute;n mejor,
o la ayuda adecuada por parte de Toshiba. No recomiendo el uso de
port&aacute;tiles Toshiba por el momento. Para el uso de tarjetas de 16 bits,
recomiendo establecer el modo de puente a <I>PCIC</I> en la configuraci&oacute;n de
la BIOS; para tarjetas <I>CardBus</I>, la decisi&oacute;n es suya. 
<P>El controlador Motorola <I>6AHC05GA</I> usado en port&aacute;tiles Hyundai, no
est&aacute; soportado. El controlador en la <I>HP Omnibook 600</I> tampoco. 
<P>
<H2><A NAME="tarjetas"></A> <A NAME="ss1.5">1.5 ¿Qu&eacute; tarjetas est&aacute;n soportadas? </A>
</H2>

<P>
<P>La versi&oacute;n actual incluye controladores para una variedad de tarjetas
ethernet, para tarjetas m&oacute;dem y puertos serie, varios controladores para
adaptadores SCSI, un controlador para tarjetas de unidades ATA/IDE, y
controladores para tarjetas de memoria que s&oacute;lo soportan la mayor&iacute;a de
tarjetas SRAM y algunas tarjetas flash. El archivo <CODE>SUPPORTED.CARDS</CODE>
inclu&iacute;do en cada versi&oacute;n de Servicios de Tarjetas lista todas las tarjetas
que se sabe que funcionan al menos en un sistema. 
<P>La probabilidad de que funcione una tarjeta que no est&aacute; en la lista de
soportados depende del tipo. Esencialmente todos los m&oacute;dems deber&iacute;an
funcionar con el controlador provisto. Algunas tarjetas de red pueden
funcionar si hay versiones OEM de las tarjetas soportadas. Otro tipo de
tarjetas de E/S (<I>frame buffers</I>, tarjetas de sonido, etc) no
funcionar&aacute;n hasta que alguien escriba los controladores apropiados. 
<P>
<H2><A NAME="cuando"></A> <A NAME="ss1.6">1.6 ¿Cu&aacute;ndo estar&aacute; soportada mi tarjeta favorita (no soportada)? </A>
</H2>

<P>
<P>Desafortunadamente, no me pagan por escribir controladores para
dispositivos, as&iacute; que si quiere tener un controlador para su tarjeta
favorita, probablemente tendr&aacute; trabajar un poco.  Idealmente, me gustar&iacute;a
trabajar hacia un modelo como el del kernel de Linux, donde yo sea el
responsable principalmente del c&oacute;digo del n&uacute;cleo y otros autores puedan
contribuir y mantener los controladores para tarjetas espec&iacute;ficas. El
archivo <CODE>SUPPORTED.CARDS</CODE> menciona algunas tarjetas para las cuales
los controladores est&aacute;n actualmente en progreso. Tratar&eacute; de ayudar donde
pueda, pero tenga en cuenta que depurar controladores de dispositivo del
kernel por email no es particularmente efectivo.
<P>Los fabricantes interesados en ayudar a proveer soporte Linux para sus
productos pueden contactar conmigo a fin de acordar consultor&iacute;as.
<P>
<H2><A NAME="listas"></A> <A NAME="ss1.7">1.7 Listas de correo y otras fuentes de informaci&oacute;n </A>
</H2>

<P>
<P>Sol&iacute;a mantener una base de datos y una lista de correo de usuarios de
Linux PCMCIA. Recientemente he convertido mi p&aacute;gina web para informaci&oacute;n
de Linux PCMCIA en un sitio <I>HyperNews</I>, con un conjunto de listas de
mensajes de temas de Linux PCMCIA. Hay listas para instalaci&oacute;n y
configuraci&oacute;n, para diferentes tipos de tarjetas, para programar y
depurar. La p&aacute;gina de informaci&oacute;n de Linux PCMCIA est&aacute; en <CODE>
<A HREF="http://hyper.stanford.edu/HyperNews/get/pcmcia/home.html">http://hyper.stanford.edu/HyperNews/get/pcmcia/home.html</A></CODE>. Los
usuarios pueden solicitar otificaci&oacute;n por email de nuevas respuestas a
preguntas particulares, o notificaci&oacute;n para todos los mensajes nuevos en
una categor&iacute;a dada. Espero que esto sea un repositorio &uacute;til de
informaci&oacute;n, para cuestiones que van m&aacute;s all&aacute; del enfoque del COMO.
<P>Hay una lista de Linux dedicada a asuntos de port&aacute;tiles, la lista
<CODE>linux-laptop</CODE>. Para m&aacute;s informaci&oacute;n, env&iacute;e un mensaje con la palabra
<CODE>help</CODE> a <CODE>
<A HREF="mailto:majordomo@vger.rutgers.edu?subject=help">majordomo@vger.rutgers.edu</A></CODE>. Para suscribirse, env&iacute;e un email
que contenga el mensaje <CODE>subscribe linux-laptop</CODE> a la misma direcci&oacute;n.
Esta lista de correo puede ser un buen foro de discusi&oacute;n de asuntos de
Linux PCMCIA. 
<P>La p&aacute;gina de Linux Laptop est&aacute; en <CODE>
<A HREF="http://www.cs.utexas.edu/users/kharker/linux-laptop">http://www.cs.utexas.edu/users/kharker/linux-laptop</A></CODE> tiene
enlaces a muchos sitios que tienen informaci&oacute;n acerca de la configuraci&oacute;n
de tipos espec&iacute;ficos de port&aacute;tiles para Linux. Hay tambi&eacute;n una base de
datos para buscar informaci&oacute;n acerca de configuraci&oacute;n de sistemas. 
<P>
<H2><A NAME="porqueno"></A> <A NAME="ss1.8">1.8 ¿Por qu&eacute; no distribuyen binarios? </A>
</H2>

<P>
<P>Para mi, distribuir los binarios puede suponer una molestia importante.
Esto es complicado porque algunas caracter&iacute;sticas solo pueden ser
seleccionadas al momento de compilar, y porque los m&oacute;dulos dependen mucho
de contar con una configuraci&oacute;n «correcta» del kernel. As&iacute;, probablemente
necesite distribuir m&oacute;dulos precompilados junto con los kernels
correspondientes.  M&aacute;s que esto, la necesidad m&aacute;s grande de los m&oacute;dulos
precompilados es cuando se instala Linux en un sistema limpio. Esto
t&iacute;picamente requiere configurar los controladores para que puedan ser
utilizados en el proceso de instalaci&oacute;n, para una distribuci&oacute;n de Linux en
particular. Cada distribuci&oacute;n de Linux tiene su propia idiosincrasia, y no
me resulta factible el proveer discos <CODE>boot</CODE> y <CODE>root</CODE> para cada una
de las combinaciones de controladores y distribuciones. 
<P>PCMCIA forma parte ahora de las principales distribuciones de Linux,
incluyendo <I>RedHat</I>, <I>Caldera</I>, <I>Slackware</I>, <I>Yggdrasil</I>,
<I>Craftworks</I> y <I>Nascent Technology</I>. 
<P>
<P>
<H2><A NAME="tangrande"></A> <A NAME="ss1.9">1.9 ¿Por qu&eacute; el paquete es tan grande? </A>
</H2>

<P>
<P>Bueno, no es realmente tan grande al fin y al cabo. Todos los m&oacute;dulos
controladores ocupan alrededor de 500K de espacio en disco. Los programas
de utilidades a&ntilde;aden unos 70K, y los scripts en <CODE>/etc/pcmcia</CODE> son
de 50K. Los controladores principales ocupan unos 55K de la memoria del
sistema. El demonio <CODE>cardmgr</CODE> ser&aacute; generalmente intercambiado excepto
cuando cuando las tarjetas sean insertadas o extra&iacute;das. El tama&ntilde;o total
del paquete es comparable a las implementaciones de servicios de tarjetas
de DOS/Windows.
<P>
<P>
<HR>
<A HREF="PCMCIA-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="PCMCIA-Como.html#toc1">Índice general</A>
</BODY>
</HTML>
