<HTML>
<HEAD>
<TITLE>DNS COMO: Introducci&oacute;n.</TITLE>
</HEAD>
<BODY>
<A HREF="DNS-Como-1.html">Anterior</A>
<A HREF="DNS-Como-3.html">Siguiente</A>
<A HREF="DNS-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Introducci&oacute;n.</A></H2>


<P>Lo que es esto y lo que no es.</P>
<P>Para los que comienzan, <B>DNS</B> es el <B>Domain Name System (Sistema
de Nombres de Dominio)</B>, las reglas de nomenclatura de las m&aacute;quinas y
el software que mapea los nombres a n&uacute;meros IP. Este documento COMO trata
de c&oacute;mo definir tales conversiones usando un sistema <B>Linux</B>. Una
conversi&oacute;n es simplemente una asociaci&oacute;n entre dos cosas, en este caso un
nombre de m&aacute;quina, como <CODE>ftp.linux.org</CODE> y el n&uacute;mero IP de la
m&aacute;quina, <CODE>199.249.150.4</CODE>.</P>
<P>El DNS es, para los no iniciados (Vd. <CODE>;-)</CODE>, una de las &aacute;reas mas
opacas de la administraci&oacute;n de una red. Este COMO tratar&aacute; de aclarar
algunas cosas. </P>
<P>Este documento describe c&oacute;mo configurar un servidor de nombres DNS simple. 
Comenzaremos con un servidor <I>caching only
server</I>
<SL>Servidor que se limita a guardar en una cach&eacute; las IPs
de los nombres de m&aacute;quina m&aacute;s solicitados, obteni&eacute;ndolas de servidores
externos.</SL>
, y continuaremos con la configuraci&oacute;n de un servidor
DNS primario para un dominio. Para configuraciones m&aacute;s complejas puede
consultar la secci&oacute;n de PUF (
<A HREF="DNS-Como-8.html#PUF">PUF</A>) de este documento. Si lo que
busca no est&aacute; descrito all&iacute;, necesitar&aacute; <I>Documentaci&oacute;n Real</I>.
Volveremos a lo que es la <I>Documentaci&oacute;n Real</I> en el &uacute;ltimo cap&iacute;tulo. </P>
<P><B>Antes de empezar</B>, debe configurar su sistema convenientemente, de
forma que pueda hacer <CODE>telnet</CODE> desde y hacia su m&aacute;quina, efectuando
satisfactoriamente toda clase de conexiones de red, especialmente
<CODE>telnet 127.0.0.1</CODE> entrando en su propia m&aacute;quina (compru&eacute;belo
ahora). Tambi&eacute;n necesita que los archivos <CODE>/etc/host.conf</CODE> (o
<CODE>/etc/nsswitch.conf</CODE>), <CODE>/etc/resolv.conf</CODE> y
<CODE>/etc/hosts</CODE> sean correctos como punto de partida, ya que no
explicar&eacute; sus funciones aqu&iacute;.  Si NO tiene aun esta configuraci&oacute;n y no
funciona en red, el <I>NET-2 HOWTO</I> explica como hacerlo. L&eacute;alo. </P>
<P>Si est&aacute; usando SLIP o PPP necesitar&aacute; que funcionen correctamente. Lea el
<I>PPP-COMO</I> si no es as&iacute;. </P>
<P>Cuando digo <I>``su m&aacute;quina''</I> quiero decir la m&aacute;quina en la que est&aacute;
intentando configurar DNS. No cualquier otra m&aacute;quina que pueda tener en su
red. </P>
<P>Supongo que <B>no est&aacute; detr&aacute;s de cualquier clase de cortafuegos</B>
(<I>firewall</I>) que bloquee peticiones de nombres. Si necesita una
configuraci&oacute;n especial, vea la secci&oacute;n PUF (
<A HREF="DNS-Como-8.html#PUF">PUF</A>). </P>
<P>El servicio de nombres en Unix es llevado a cabo por un programa, llamado
<CODE>named</CODE>.</P>
<P>&Eacute;ste forma parte del paquete <CODE>bind</CODE>, que es coordinado por Paul Vixie
para <I>The Internet Software Consortium</I>. <CODE>named</CODE> est&aacute; incluido
en la mayor&iacute;a de las distribuciones de Linux y generalmente se instala
como <CODE>/usr/sbin/named</CODE>. Si tiene el fichero <CODE>named</CODE>
probablemente pueda usarlo; si no lo tiene, puede obtener el binario en un
ftp de Linux, o conseguir los &uacute;ltimos y m&aacute;s voluminosos fuentes en
<CODE>
<A HREF="ftp://ftp.vix.com/pub/bind">ftp://ftp.vix.com/pub/bind</A></CODE>, bien de los subdirectorios de
versi&oacute;n actual, o de prueba, lo que mejor se adapte a su estilo de vida. </P>
<P><B>DNS es una base de datos cuyo &aacute;mbito es la Red</B>. Tenga cuidado con
lo que pone en ella. Si pone incongruencias, Vd. y los dem&aacute;s obtendr&aacute;n
incongruencias de ella. Mantenga su DNS limpia y consistente y conseguir&aacute;
un buen servicio de ella. Aprenda a usarla, administrarla, depurarla y
ser&aacute; otro buen administrador, salvando a la red de caer sobre sus rodillas
sobrecargada por falta de mantenimiento. </P>
<P>En este documento expongo de forma llana varias cosas que no son
completamente verdad (son al menos medias verdades). Todo esto lo hago en
aras de la simplicidad. Todas funcionar&aacute;n (probablemente <CODE>;-)</CODE> si cree
en lo que digo.</P>
<P>
<DL>
<DT><B>Aviso:</B><DD><P>Haga una copia de seguridad de todos los archivos que le
indico que cambie si ya los tiene, y as&iacute; si despu&eacute;s si no funciona podr&aacute;
volver al principio. </P>
</DL>
</P>

<HR>
<A HREF="DNS-Como-1.html">Anterior</A>
<A HREF="DNS-Como-3.html">Siguiente</A>
<A HREF="DNS-Como.html#toc2">Indice</A>
</BODY>
</HTML>
