<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Applications">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges Tarbouriech
 =LF=CAT___: Applications
 =LF=TITLE_: Cantando bajo la web
 =LF=NUMBER: 207
 =LF=ANAME_: article207.shtml
 -->
 <TITLE>lf207, Applications: Cantando bajo la web</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="[Photo of the Author]" HEIGHT=124 WIDTH=115>
<BR>por  Georges Tarbouriech <br> <small>&lt;georges.t(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Georges es un usuario viejo de Unix. Como esta hasta las narices de estos
navegadores "enormes", le interesan mucho m&aacute;s los peque&ntilde;os.
</P>
<!-- TRANSLATED TO es -->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#207lfindex0">La Jungla de los navegadores</A></LI>
  <LI><A HREF="#207lfindex1">Obtener Opera</A></LI>
  <LI><A HREF="#207lfindex2">Usar Opera</A></LI>
  <LI><A HREF="#207lfindex3">Futuro</A></LI>
  <LI><A HREF="#207lfindex4">F&iacute;n</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=207&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Cantando bajo la web</H2>
 <IMG SRC="../../common/images/article207/illustration207.gif" HSPACE=10 width="60" height="60" alt="[illustration]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<p>
En un art&iacute;culo anterior, dije que el navegador Opera a&uacute;n no me
hab&iacute;a convencido. La nueva versi&oacute;n 5.0 para Linux fue un
progreso, y cambi&eacute; un poco de opini&oacute;n. Aqui tienen una breve revisi&oacute;n de uno
de los navegadores m&aacute;s "ligeros" para Linux. Pueden obtener una copia
gratuita de Opera 5.0 desde
<a href="http://www.opera.com">http://www.opera.com</a></p></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="207lfindex0">&nbsp;</A>
<H2>La Jungla de los navegadores</H2>

<p>
Casi hace 10 a&ntilde;os apareci&oacute; el primero navegador gr&aacute;fico
de alta multiplicidad: se llamaba Mosaic. Fu&eacute; una revoluci&oacute;n, casi,
puesto que era una manera nueva de navegar en la web. Era muy diferente de las
herramientas que us&aacute;bamos en esa &eacute;poca para conectar a los BBS.
Este software ten&iacute;a un tama&ntilde;o bastante peque&ntilde;o y sin
embargo se pod&iacute;a visualizar im&aacute;genes, texto... con colores. Un poco
m&aacute;s tarde lleg&oacute; su "hijo" llamado Netscape. Claro, ya ten&iacute;a
un tama&ntilde;o algo m&aacute;s importante. Este &uacute;ltimo volvi&oacute;
una referencia para la navegaci&oacute;n en la web bajo muchos sistemas Unix.
Entonces, apareci&oacute; la versi&oacute;n Windows, lo que di&oacute; la "idea" a
M$ de crear su propio navegador. Esto fue el nacimiento del s&oacute;lo y
&uacute;nico Internet Exploder. Asi empez&oacute; la guerra entre Netscape e IE.
Al mismo tiempo, los desarrolladores creaban navegadores gr&aacute;ficos para otros
SO tales como AmigaOS, NeXTstep (de hecho, el primero de todos funcionaba bajo
NeXTstep y se llamaba WorldWideWeb), y un poco m&aacute;s tarde BeOS. Lograron
ofrecer navegadores de peque&ntilde;o tama&ntilde;o y sin embargo tan buenos
como los dos pesos pesados. Podemos mencionar algunos:
AWeb, IBrowse, Voyager para Amiga OS, OmniWeb para NeXTstep o NetPositive para
BeOS. Hay otro navegador muy bueno llamado Voyager distribuido con QNX 4 RTOS.
Claro, no podemos mencionarlos todos.
Si quieren conocer la historia completa de los navegadores, echen un vistazo a
<a href="http://www.w3.org/History.html">http://www.w3.org/History.html</a>.

<p>
Con el pasar del tiempo, los procesadores se volv&iacute;an m&aacute;s potentes
proporcionando m&aacute;s recursos. La cantidad de RAM tambi&eacute;n creci&oacute; y
el tama&ntilde;o de los discos duros tambi&eacute;n. Esto fue el principio de las
f&aacute;bricas que conocemos hoy, a las que seguimos llamando navegadores.
No hablaremos del resultado de la guerra entre Netscape e IE. El punto es: hoy,
un navegador pesa alrededor de 15 MB, sin hablar de las librer&iacute;as, de los
plugins... &iexcl;Aut&eacute;nticos monstruos!
&iquest;Y qu&eacute; alternativas tenemos? Bueno, muy pocas, puesto que la mayor&iacute;a
depende de las librer&iacute;as de Netscape (o Mozilla). Esto significa que, incluso
si el navegador es bastante ligero, necesita estas librer&iacute;as y se vuelve
tan "gordo" como los "modelos". &iquest;Significar&aacute; que estos navegadores
son mejores que los m&aacute;s peque&ntilde;os? Depiende de su
opini&oacute;n. Pero mucha gente todav&iacute;a usa "peque&ntilde;as"
configuraciones, y abrir estas herramientas con CPU de 200 Mhz y 32 MB de RAM es
una pena. Aqu&iacute; es donde llega Opera para Linux.
</p>

<A NAME="207lfindex1">&nbsp;</A>
<H2>Obtener Opera</H2>

<p>
Opera es una compan&iacute;a escandinava basada en Noruega. A menudo esta gente
escandinava es muy novadora y les debemos software muy buenos. Por ejemplo,
podemos mecionar <a href="http://www.ssh.com">ssh, (la versi&oacute;n
comercial)</a> de Finlandia, o uno de los mejores softwares nunca vistos,
<a href="http://www.scala.com">Scala</a>, una herramienta multimedia elaborada en
Noruega alrededor de 1987. Este &uacute;ltimo permit&iacute;a a la plataforma
Amiga hacer presentaciones multimedia incre&iacute;bles o bonitos sistemas de
visualizaci&oacute;n muchos a&ntilde;os antes que otros SO. &iexcl;Esto ten&iacute;a
que ser dicho! Si visitan
<a href="http://www.opera.com">http://www.opera.com</a>, pueden bajar la
versi&oacute;n 5.0 para Linux de este navegador. Lo pueden obtener
en forma de paquetes rpm, deb o como arca tar.gz.
Puesto que depende de Qt, pueden elegir binarios enlazados de manera
est&aacute;tica o din&aacute;mica. Si seleccionan el &uacute;ltimo, necesitan Qt
2.2.4 en su m&aacute;quina. No hablaremos de la instalaci&oacute;n de Opera,
que resulta evidente.
</p>

<p>
Opera es un producto comercial. Una de las diferencias m&aacute;s importante al
comparar con versiones anteriores es que pueden obtener Opera gratuitamente.
No m&aacute;s tiempo de prueba limitado a 30 d&iacute;as. El inconveniente es
que tienen banners publicitarios de manera permanente en la parte superior del
navegador. Si les molestan demasiado pueden registrarse por 39$. Como
informaci&oacute;n, diremos que Opera tambi&eacute;n existe para Windos, BeOS, Mac y EPOC, con
una versi&oacute;n para OS2 en desarrollo. Respecto a Linux, hay versiones
para i386, SPARC y PPC. Claro que nos concentraremos en la versi&oacute;n Linux.
De hecho no hemos probado las versiones para BeOS o Windos.
</p>

<A NAME="207lfindex2">&nbsp;</A>
<H2>Usar Opera</H2>

<p>
Como todos los navegadores gr&aacute;ficos, Opera es muy f&aacute;cil de usar.
No necesitar&aacute;n mucho tiempo para acostumbrarse. Las Preferencias
son muy "ricas" y pueden hacer mucho con ellas.
<table align="right">
<tr><td>
<img src="../../common/images/article207/prefs.gif" width="243" height="193" alt="[Preferences]">
</td></tr>
<tr><td>
Ventana de preferencias en opera 5.0
</td></tr>
</table>
Son tan ricas, que tal vez tarden un poco en obtener lo que quieren.
Por ejemplo, la gesti&oacute;n del formato de letras es un poco "pesada",
pero eso s&oacute;lo es mi opini&oacute;n.
</p>

<p>
Hablando de caracter&iacute;sticas, Opera innova con el "drop-down history":
una peque&ntilde;a flecha aparece al lado de los botones anterior y
posterior. Pinchando estas flechas se visualiza la lista de las p&aacute;ginas ya visitadas
durante una sesi&oacute;n. Existe en Netscape desde hace tiempo... pero con las
flechas en la parte superior :-). Claro, que esto no significa que ya no tengan
los otros modos de hist&oacute;rico. A&uacute;n pueden alcanzar las p&aacute;ginas ya visitadas
desde el hist&oacute;rico de ls URL o desde el men&uacute; "history". &iexcl;No es una mala idea!
</p>

<p>
Tambi&eacute;n es muy buena la posibilidad de elegir en cualquier momento si se cargan
o no las im&aacute;genes o no, con un bot&oacute;n muy pr&aacute;ctico situadado en la barra de
progreso al lado de donde se escribe la URL. Netscape tiene algo similar, pero
se necesitaba ir m&aacute;s profundo en los menus de configuraci&oacute;n. Al
contrario que con Netscape, cargar las im&aacute;genes con retraso siempre
funciona.
Esta caracter&iacute;stica accelera la navegaci&oacute;n: pinchen entre las
p&aacute;ginas hasta que encuentren la que quieren y entonces pueden decidir cargar
las im&aacute;genes. La navegaci&oacute;n es mucho m&aacute;s r&aacute;pida puesto que
no tienen que esperar que las im&aacute;genes se cargen en todas las p&aacute;ginas.
<br>
 <TABLE align="right">
      <TR>
        <TD><IMG src=
        "../../common/images/article207/bookmarksearch.gif" width="195"
        height="170" alt="[Find bookmarks]"> </TD>
      </TR>

      <TR>
        <TD><I>Encontrar bookmarks</I> </TD>
      </TR>
    </TABLE>
</p>

<p>
Una buena idea es la funci&oacute;n "Find bookmarks", que permite buscar entre
los bookmarks usando <I>"wildcards"</I>.
Otra funcionalidad interesante es la validaci&oacute;n HTML. Pinchar con
el bot&oacute;n derecho del rat&oacute;n en un documento HTML les lleva al World
Wide Web Consortium. El servicio de validaci&oacute;n le dice entonces si su
c&oacute;digo HTML es v&aacute;lido o no. Es una manera muy pr&aacute;ctica de controlar el
c&oacute;digo cuando se desarrolla un sitio web. Podr&iacute;a ser el fin de los
sitios inaccessibles... &iexcl;&iexcl;&iexcl;si los otros editores proveen la misma funcionalidad!!!
</p>

<p>
Esto merece una peque&ntilde;a disgresi&oacute;n, incluso aunque parezca fuera del
asunto. M&aacute;s y m&aacute;s sitios web estan "construidos" con software
propietario, no siguiendo las recomendaciones del w3c. A&uacute;n
peor, algunos navegadores funcionan de manera diferente. El resultado es que
seg&uacute;n el navegador utilizado pueden conectar a un sitio web o no.
Est&uacute;pido, &iquest;verdad?
Entonces, por favor, "profesionales" del Internet, paren de usar software
propietario para construir sus sitios web. Dejen de usar Java para todo,
particularmente cuando no se necesita. Dejen de usar estas m...aravillas de
software para "escribir" el c&oacute;digo HTML. &iexcl;&iexcl;&iexcl;eso no es HTML!!!
Pueden tirar el 50% de lo que fue "autom&aacute;ticamente" generado. (Por una vez,
no dar&eacute; ning&uacute;n apellido, pero creo que se puede adivinar de quien
hablo...). Pero esa es s&oacute;lo es la primera parte del problema.
<br>
La segunda parte viene de los editores de navegadores. Por ejemplo, &iquest;por qu&eacute;
Netscape 6.0 para Linux entiende un c&oacute;digo diferente de las otras
versiones de Netscape? Y eso no tiene que ver s&oacute;lo con Netscape, puesto que
se puede tener el mismo problema con muchos navegadores. Y mejor no hablar
del Exploder. Lo que quiero decir aqu&iacute; es que un c&oacute;digo
HTML funcionando con Netscape 6.0 no funcionar&aacute; con otros navegadores:
&iexcl;lo que se obtiene no tiene nada que ver con lo que se esperaba!
Otro problema muy conocido con Netscape 6.0 para Linux viene de su
comportamiento con un servidor local http Apache sin DNS activo: necesita mucho
tiempo para encontrar el servidor. No se "congela" como sus hermanos,
s&oacute;lo espera. Con Opera nunca encontr&eacute; tal situaci&oacute;n
"congelada". Y tampoco tuve que esperar que encuentre el servidor http.
<br>
De hecho, hay muchos SO y muchos navegadores, lo que significa que no todo
el mundo usa Netscape o Exploder. Si hay un Consortium tiene que se por
buenas razonas, y si la mayor&iacute;a de los editores no cumple con las
recomendaciones del w3c, muy pronto
no podremos ni conectar a la mayor&iacute;a de los sitios
web. &iquest;Ser&aacute; hecho intencionalmente o no?.
Bueno, la respuesta es cosa tuya...
<br>
S&eacute; que ya escrib&iacute; algo as&iacute;, pero es para insistir un poco
m&aacute;s. Aqu&iacute; en Linux<font color="#FF0000">Focus</font> hacemos muchas pruebas para controlar si
cada navegador puede alcanzarnos. Cada uno tendr&iacute;a que hacer lo mismo.
Bueno, s&oacute;lo es mi opini&oacute;n.
Perd&oacute;n por la digresi&oacute;n: ya s&eacute; que es una costumbre en mis
art&iacute;culos: pero es para mantenerte despierto y para ver si sigues :-).
Volvamos a Opera.
</p>

<p>
Opera 5.0 para Linux puede alcanzar sitios web inacessibles con Netscape 4.77
para Linux (por ejemplo). Qu&eacute; sorpresa, &iquest;no? Buena cosa, de todo modos.
Por otro lado, puede tener problemas con, por ejemplo, scripts CGI con los que
Netscape u otros funcionan muy bien. Esto demuestra que cada navegador
reacciona a su propia manera. Para separar encodaje de formularios de datos
"multipart", Netscape e IE usan algo as&iacute;:
<PRE>-----------------------------2564311134412</PRE>
con un n&uacute;mero cualqiera. Un script CGI escrito esperando este tipo de datos,
no funcionar&aacute; con Opera. Esto es porque Opera no usa la sintaxis de
otros navegadores. En vez de eso usa su propios separadores:
<PRE>--_OPERAB__-tRjeTHZvhMcr8tfsjpfOeE</PRE>
Esto ser&aacute; posiblemente conforme al standard, pero es una variante que
no es necesaria y hace las cosas m&aacute;s complicadas. Aqu&iacute; Opera no
provee nueva funcionalidad, sino que propone algo diferente. Podr&iacute;amos
decir que el problema viene de un script mal escrito, pero no es verdad en
todos los casos. Por ejemplo, Opera no sabe mandar formularios de datos
multipart "gordos". Tal vez se trate de un "bug". Se para en el medio de los
datos transferidos y el usuario siempre espera que se termine. Algo m&aacute;s:
el mismo navegador funciona de manera diferente seg&uacute;n el SO.
Todo esto es evidente, sin embargo mucha gente parece olvidarlo. Opera puede
identificarse como IE o Mozilla, pero esto no resuelve el problema mencionado
</p>

<p>
Para hablar un poco m&aacute;s "tecnico", Opera cumple con HTML 4.01, XML 1.0 y
XHTML 1.0. Tambi&eacute;n soporta CSS (Cascading Style Sheet) nivel 1 y 2. &iexcl;No es tan
malo! Desafortunadamente, no basta. No es culpa de Opera puesto que muchos
navegadores soportan lo mismo y tambi&eacute;n tienen problemas.
La visualizaci&oacute;n en Opera parece un poco a la de OmniWeb para MacOS&nbsp;X
(para los que lo conocen). Necesita un poquito m&aacute;s de tiempo para una
visualizaci&oacute;n perfecta: tiene que rectificar despu&eacute;s de cargar como
hacen todos los navegadores pero parece un poco m&aacute;s lento que otros, por
lo menos con m&aacute;quinas modestas. Si no, es bastante r&aacute;pido. No dir&iacute;a
que es el m&aacute;s r&aacute;pido de los navegadores (no trabajo para
Opera), pero s&iacute; que es muy r&aacute;pido.
<BR>
&iquest;A qu&eacute; parece Opera? Aqu&iacute; lo tienen:
    <TABLE align="right">
      <TR>
        <TD><A href="../../common/images/article207/main.gif"><IMG src=
        "../../common/images/article207/main_t.gif" width="262" height=
        "276" alt="[main opera window]"></A> </TD>
      </TR>
    </TABLE>
    <BR>
    <BR>
Como pueden ver, nada particular, pero pueden cambiar muchas cosas respecto
a su apariencia. Por ejemplo, pueden tener una ventana "HotList" a la
izquierda. Pueden elegir si quieren una barra de ventanas, una barra de
bookmarks... Se puede personalizar f&aacute;cilmente.
</p>

<p>
A prop&oacute;sito, leyendo los logs de un servidor http local, pueden ver que
Opera abre m&uacute;ltiples conexiones, como se har&iacute;a usando
varias instancias de otro navegador. Esto tambi&eacute;n puede explicar el tiempo de
rectificaci&oacute;n mencionado m&aacute;s arriba: es decir, Opera carga todo
al mismo tiempo y despu&eacute;s arregla la visualizaci&oacute;n. Gracias a Floris para
llamar mi atenci&oacute;n en el asunto.
Incluso si es muy subjetivo, Opera parece muy r&aacute;pido para preguntar bases
de datos. Es una impresi&oacute;n puesto que nunca control&eacute; el tiempo de
respuesta. De nuevo, esto se puede notar con peque&ntilde;as configuraciones.
Usar m&aacute;quinas r&aacute;pidas hace las cosas menos evidentes.
</p>

<p>
Tambi&eacute;n Opera proporciona una lista de bookmarks enorme. Pueden hacer con ella
lo que quieran. Quiero decir, mi primer trabajo con un navegador consiste en quitar
los bookmarks propuestos... ¡pero soy un poco extra&ntilde;o!
Hay otra cosa positiva: la ayuda en linea. Es bastante completa y bien
organizada... y no lleva al sitio web del editor.
Unas palabras relativas a los menus. Aqu&iacute; tambi&eacute;n tenemos unas
funcionalidades agradables: por ejemplo tienen una previsualizaci&oacute;n de
impresi&oacute;n. Pueden tambi&eacute;n cargar de nuevo una p&aacute;gina cada x
minutos: seleccionen la opci&oacute;n del menu y definan el tiempo antes de
cargar de nuevo.
Opera tiene muchas peque&ntilde;as mejoras de este tipo. A menudo es simple pero
muy pr&aacute;ctico.
</p>

<p>
Otra funcionalidad es la ventana de traslado. Cuando se descarga un
fichero, pinchar en el bot&oacute;n de acci&oacute;n (icono del fichero) abre un
menu contextual con muchas opciones. Pueden reempezar la bajada, cancelarla...
Otra vez, es muy pr&aacute;ctico.
Podr&iacute;amos decir mucho m&aacute;s alrededor de Opera pero ser&iacute;a un
art&iacute;culo muy largo. ¡La mejor manera de descubrirlo es probarlo!
</p>

<A NAME="207lfindex3">&nbsp;</A>
<H2>Futuro</H2>


<p>
El enfoque de Opera es muy interesante puesto que propone navegar en
la web con herramientas de tama&ntilde;o bastante peque&ntilde;o. No necesitan
40 MB de librer&iacute;as, ejecutables... Es la primera cosa. Muy pocos editores
han entendido eso. A prop&oacute;sito, esto es cierto para la mayor&iacute;a del
software, no s&oacute;lo para navegadores.
Sin embargo, ¿ser&aacute; suficiente para cambiar las cosas en un futuro
cercano?
No me gusta mucho la futurolog&iacute;a, pero ¿cuanto tiempo vamos a usar
navegadores de la forma que lo hacemos hoy?
Por ejemplo, echen un vistazo al trabajo de <A href="http://www.rebol.com">Rebol.</A>
Si no conocen esta linea de productos pueden leer
<A href="../September2000/article169.shtml">esto</A>.
Pero desde este art&iacute;culo, Rebol ha evolucionado hacia aplicaciones
ligeras distribuidas. ¿No ser&aacute; eso la pr&oacute;xima manera de trabajar en
Internet? Rebol ya ha demostrado que no necesitamos navegadores, y la
inform&aacute;tica distribuida podr&iacute;a ser la etapa siguiente.
Esto no significa que los navegadores vayan a desaparecer ma&ntilde;ana, pero creo que
tendr&iacute;an que seguir una dieta...
</p>

<p>
Podemos pensar que Opera va por la carretera buena. Opera se acaba de
aliar con Symbian para los perifericos moviles de Internet, por ejemplo.
Esto significa que teniendo un tama&ntilde;o peque&ntilde;o, un navegador puede
ser utilizado por muchas cosas diferentes...
</P>

<A NAME="207lfindex4">&nbsp;</A>
<H2>F&iacute;n</H2>


<P>
Nadie es perfecto... y tampoco lo es Opera. Sin embargo su enfoque es muy
interesante. Que les guste o no, depende de lo que busquen. Cuando alguien
esta acostumbrado a algo no le gusta mucho cambiar. Sin embargo tendr&iacute;an
que probar Opera. Bajo Linux los navegadores gr&aacute;ficos no son tan
numerosos (o m&aacute;s exactamente, vienen del mismo "coraz&oacute;n"). Ahora
que pueden tener uno realmente diferente, denle una oportunidad.
</p>

<p>
A&uacute;n m&aacute;s, la gente de Opera ha demostrado que pod&iacute;a mejorar
rapidamente su producto. As&iacute; podemos esperar un producto a&uacute;n mejor
en un futuro muy cercano.
Entonces, si como a m&iacute;, no les gustan mucho las factor&iacute;as con bugs, visiten
<A href=
"http://www.opera.com">http://www.opera.com</A> y bajen la versi&oacute;n
5.0 para Linux de este navegador.
</p>

<p>
¿A qu&eacute; vivimos una &eacute;poca estupenda?
</P>





<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=207&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article207.shtml" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Georges Tarbouriech <small>&lt;georges.t(at)linuxfocus.org&gt;</small></font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-04-02, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
