<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.17">
 <META NAME="LFCATEGORY" CONTENT="Kernel Corner">
<!-- this is used be a number of tools:
 =LF=AUTHOR: Mark Nielsen
 =LF=CAT___: Kernel Corner
 =LF=TITLE_: Usos (y abusos) de Raid, /dev/ram, y ramfs
 =LF=NUMBER: 210
 =LF=ANAME_: article210.html
 -->
 <TITLE>lf210, Kernel Corner: Usos (y abusos) de Raid, /dev/ram, y ramfs</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD><FONT color="#FFFFFF">|</FONT> </TD>
           <TD><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD><FONT color="#FFFFFF">|</FONT> </TD>
           <TD><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD><FONT color="#FFFFFF">|</FONT> </TD>
           <TD><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Mark-Nielsen.jpg" alt="[Photo of the Author]" height="159" width="110">
<BR>por  <A href="http://www.tcu-inc.com/mark">Mark Nielsen</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Mark trabaja como consultor independiente, dedicando su tiempo
a causas como GNUJobs.com, escribiendo articulos, programando
software libre, y trabajando como voluntario en <A href="http://www.eastmont.net">eastmont.net</A>.
</P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#210lfindex0">Introducci&oacute;n a RamDisk</A></LI>
  <LI><A HREF="#210lfindex1">C&oacute;mo utilizar un ramdisk al viejo modo</A></LI>
  <LI><A HREF="#210lfindex2">C&oacute;mo usar ramdisk con ramfs para el n&uacute;cleo  2.4</A></LI>
  <LI><A HREF="#210lfindex3">Cambiar el tama&ntilde;o de los ramdisk y otras opciones.</A></LI>
  <LI><A HREF="#210lfindex4">Ejecutar servicios en un ramdisk</A></LI>
  <LI><A HREF="#210lfindex5">Ramdisk y Raid</A></LI>
  <LI><A HREF="#210lfindex6">Comentarios</A></LI>
  <LI><A HREF="#210lfindex7">Recursos</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=210&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Usos (y abusos) de Raid, /dev/ram, y ramfs</H2>
 <IMG src="../../common/images/illustration210.jpg" hspace="30" width="166" height="87" alt="[illustration]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>RamFs es un sencillo sistema de ficheros con interesantes
caracter&iacute;sticas. Es una de las novedades de los n&uacute;cleos 2.4.
</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="210lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n a RamDisk</H2>

    Puede ver mi art&iacute;culo original sobre el antiguo ramdisk. Se encuentra
    en: <A href= "../November1999/article124.html">Linuxfocus:C&oacute;mo usar un
ramdisk bajo Linux.</A>

En el presente art&iacute;culo no entrar&eacute; en detalles sobre el antiguo estilo de
ramdisk.

    <P>&iquest;Qu&eacute; es un ramdisk? Un ramdisk (o disco RAM) es una parte de la
memoria que
se puede     asignar para usarla como si fuese una partici&oacute;n. O, en otras
palabras, se toma     parte de la memoria y se simula un disco duro que se
puede
formatear,     montar, en &eacute;l se puede guardar ficheros, etc.
    </P>

    <P>Hablaremos de dos tipos de ramdisk. El primero es un ramdisk que se
    puede formatear y montar. El segundo es un ramdisk que no se puede
formatear,
    pero que tiene excelentes propiedades. Ve&aacute;moslo en detalle:
    </P>

    <P>La antigua propuesta /dev/ram1 :</P>

    <OL>
      <LI>MALO: El tama&ntilde;o del ramdisk est&aacute; fijado desde el arranque.
      </LI>

      <LI>BUENO: Puede formatear el ramdisk tantas veces como quiera.
      </LI>

      <LI>MALO: Una vez formateado (no creo que haya que montarlo), ocupa
      una parte de la memoria y no estoy seguro de c&oacute;mo se puede
recuperar.</LI>

      <LI>BUENO: Puede tener m&aacute;s de un ramdisk a la vez.</LI>
    </OL>
    El nuevo ramdisk "ramfs":

    <OL>
      <LI>MALO: No he conseguido formatearlo m&aacute;s que seg&uacute;n sus caracter&iacute;sticas
      predefinidas. Est&aacute; en la capa VFS, sea lo que sea.
       </LI>

      <LI>BUENO: Puede tener m&aacute;s de uno.</LI>

      <LI>BUENO: Puede cambiar su tama&ntilde;o m&aacute;ximo en l&iacute;nea de
      comandos.</LI>

      <LI>MUY BUENO: S&oacute;lo usa la memoria que necesita. Es decir, puede
      tener asignadas 64 megas de ram, pero si no hay m&aacute;s que un fichero
      de 2k en el ramdisk, s&oacute;lo utilizar&aacute; 2k de memoria. Y en cuanto
      borre un fichero tendr&aacute; inmediatamente m&aacute;s memoria para su
ordenador.</LI>

      <LI>MALO: Bueno, realmente no es culpa suya. No caiga en la trampa
      de llenar dos ramdisk ramfs o se quedar&aacute; sin memoria disponible.</LI>
    </OL>
    <HR>
    <A name="HowOld"></A>

    <A NAME="210lfindex1">&nbsp;</A>
<H2>C&oacute;mo utilizar un ramdisk al viejo modo</H2>

    Por favor, lea este art&iacute;culo:
    <A href= "../November1999/article124.html">Linuxfocus:C&oacute;mo usar un
ramdisk bajo Linux.</A>

    <P>Para usar ramdisk con los n&uacute;cleos 2.0 y 2.2, s&oacute;lo tiene que teclear
tres
    comandos:</P>
<PRE>
mkfs -t ext2 /dev/ram1
mkdir -p /RAM1
mount /dev/ram1 /RAM1
</PRE>
    como root, y ya est&aacute;. En la mayor&iacute;a de los sistemas el tama&ntilde;o
    est&aacute; limitado a 4 megas. Esto se puede cambiar en el arranque
    o recompilando el n&uacute;cleo, lea mi anterior art&iacute;culo para
    hacerlo. Puede a&ntilde;adir otro ramdisk as&iacute;:
<PRE>
mkfs -t ext2 /dev/ram2
mkdir -p /RAM2
mount /dev/ram2 /RAM2
</PRE>
    <HR>
    <A name="HowNew"></A>

    <A NAME="210lfindex2">&nbsp;</A>
<H2>C&oacute;mo usar ramdisk con ramfs para el n&uacute;cleo  2.4</H2>

    Antes que nada, supongo que usted tiene un n&uacute;cleo 2.4 con
    ramfs compilado. La mayor&iacute;a de las distribuciones que utilizan
    el n&uacute;cleo 2.4 lo traen compilado por defecto. Para este art&iacute;culo
    he utilizado RedHat 7.1.

    <P>Es muy f&aacute;cil. Cree un directorio y monte ramfs en &eacute;l:</P>
<PRE>
mkdir -p /RAM1
mount -t ramfs none /RAM1
</PRE>
    Si quiere otro, es sencillo. Cree otro directorio y monte ramfs all&iacute;.
<PRE>
mkdir -p /RAM2
mount -t ramfs none /RAM2
</PRE>
    <HR>
    <A name="Change"></A>

    <A NAME="210lfindex3">&nbsp;</A>
<H2>Cambiar el tama&ntilde;o de los ramdisk y otras opciones.</H2>


    <P>&Eacute;ste es un ejemplo de c&oacute;mo crear un ramdisk de 10 megas.</P>
<PRE>
mkdir -p /RAM1
mount -t ramfs none /RAM1 -o maxsize=10000
</PRE>
    Tomado directamente de

http://www.linuxhq.com/kernel/v2.4/patch/patch-2.4.3-ac2/linux.ac_Documentation_filesystems_ramfs.txt.html

<PRE>
+       ramfs - Un sistema de ficheros de tama&ntilde;o ajustable alojado en memoria
+
+
+  Ramfs es un sistema de ficheros que mantiene todo en RAM. Permite accesos
+  de lectura y escritura. En contraste con los discos RAM, que tienen
asignado
+  un tama&ntilde;o fijo de RAM, ramfs crece y disminuye para adaptarse a los
ficheros
+  que contiene.
+
+  Puede montar ramfs con:
+      mount -t ramfs none /mnt/wherever
+
+  No hay m&aacute;s que crearlo y usar los ficheros. Cuando el sistema de ficheros
se
+  desmonta, todo su contenido se pierde.
+
+  &iexcl;NOTA! Posiblemente este sistema de ficheros sea m&aacute;s &uacute;til, no como un
sistema
+  de ficheros real, sino como un ejemplo de c&oacute;mo se pueden escribir sistemas
de
+  ficheros virtuales.
+
+L&iacute;mite de recursos:
+
+Por defecto un ramfs estar&aacute; limitado a usar la mitad de la memoria (f&iacute;sica)
+para almacenar el contenido de los ficheros, y un poco m&aacute;s cuando los
metadatos
+se incluyan. Se puede controlar la limitaci&oacute;n del uso de recursos por ramfs
con
+las siguientes opciones al montarlo:
+
+       maxsize=NNN
+               Establece el tama&ntilde;o m&aacute;ximo de memoria asignado para el
sistema de
+ficheros a NNN kilobytes. Esta cifra se redondear&aacute; por abajo a un m&uacute;ltiplo
+del tama&ntilde;o de p&aacute;gina. Por defecto, es la mitad de la memoria f&iacute;sica. NB. a
+diferencia de la mayor&iacute;a de los otros l&iacute;mites, establecerlo a cero *no*
+significa que no haya l&iacute;mite, sino que limitar&aacute; realmente el tama&ntilde;o de
+los datos del sistema de ficheros a cero p&aacute;ginas. Puede haber una raz&oacute;n
+para esto en alguna situaci&oacute;n espec&iacute;fica.
+
+       maxfilesize=NNN
+               Establece el tama&ntilde;o m&aacute;ximo de cada fichero a NNN kilobytes.
+Esta cifra se redondear&aacute; por abajo a un m&uacute;ltiplo del tama&ntilde;o de p&aacute;gina.
+Si NNN=0 no habr&aacute; l&iacute;mite. Por defecto, no hay l&iacute;mite.
+
+       maxdentries=NNN
+               Establece el n&uacute;mero m&aacute;ximio de entradas de directorio (enlaces
+duros) en el sistema de ficheros a NNN. Si NNN=0 no habr&aacute; l&iacute;mite. Por
defecto,
+est&aacute; establecido a maxsize/4.
+
+       maxinodes=NNN
+               Establece el n&uacute;mero m&aacute;ximo de &iacute;nodos (i.e. ficheros distintos)
+en el sistema de ficheros a NNN. Si NNN=0 no habr&aacute; l&iacute;mite. Por defecto
+no hay l&iacute;mite (pero nunca puede haber m&aacute;s &iacute;nodos que entradas).
</PRE>
    <HR>
    <A name="Example"></A>

    <A NAME="210lfindex4">&nbsp;</A>
<H2>Ejecutar servicios en un ramdisk</H2>

    He pensado una cosa. Escuche atentamente. &iquest;No ser&iacute;a fant&aacute;stico si
    pudiese ejecutar sus servicios (como un servidor web, un servidor de
    base de datos o un servidor DNS) en un ramdisk? Normalmente, un servidor
    web no tiene muchos archivos de gran tama&ntilde;o. Habitualmente, un servidor
    DNS no contiene demasiados ficheros. Podr&iacute;a, incluso, poner un servidor
    de base de datos en memoria si lo &uacute;nico que necesita es almacenar datos
    temporales.

    <P>Hoy en d&iacute;a la memoria RAM es barata. Hace poco consegu&iacute; 128 megas
    de ram por 120$, e imagino que el precio seguir&aacute; cayendo. Con 128 megas de
    ram, puedo fijar cualquiera de mis servidores web en memoria. Si el
servidor
    web tuviera ficheros de gran tama&ntilde;o, podr&iacute;a configurar httpd.conf para
buscar
    en otro directorio que no est&eacute; en el disco ram. Mi servidor DNS es muy
    peque&ntilde;o. Mi mayor servidor de base de datos es s&oacute;lo de 28 megas.
Considerando
    el hecho de que hoy se pueden tener ordenadores con 1 giga de memoria muy
    baratos, creo que estar&iacute;a bien ejecutar todo lo que tengo en ram. La &uacute;nica
parte delicada con el servidor de base de datos es que primero habr&iacute;a que
guardar todos los datos en un servidor de base de datos aparte, antes de
escribir en el servidor de base de datos en ram. Esto es lento, pero teniendo
en cuenta que la mayor parte del tiempo se est&aacute; leyendo y no escribiendo en la
base de datos, se mejorar&iacute;a el funcionamiento. Posiblemente, podr&iacute;amos tener
    un espejo del disco ram en un disco duro.</P>

    <P>Ya he explicado esto en mi otro art&iacute;culo, lo puede leer
    aqu&iacute;: <A href=

"http://www.gnujobs.com/mark/articles/Ramdisk.html#Example">http://www.gnujobs.com/mark/articles/Ramdisk.html#Example</A>.
    Tan s&oacute;lo cambie los siguientes comandos</P>
<PRE>
        ### Crear las particiones ramdisk
/sbin/mkfs -t ext2 /dev/ram0
/sbin/mkfs -t ext2 /dev/ram1
/sbin/mkfs -t ext2 /dev/ram2

        ### Montar los ramdisks donde corresponde
mount /dev/ram0 /home/httpd/cgi-bin
mount /dev/ram1 /home/httpd/icons
mount /dev/ram2 /home/httpd/html

</PRE>
    por estos otros (incremente el n&uacute;mero si 10MB no son
    suficientes):
<PRE>
mount -t ramfs none /home/httpd/cgi-bin -o maxsize=10000
mount -t ramfs none /home/httpd/icons -o maxsize=10000
mount -t ramfs none /home/httpd/html -o maxsize=10000
</PRE>
    <HR>
    <A name="raid"></A>

    <A NAME="210lfindex5">&nbsp;</A>
<H2>Ramdisk y Raid</H2>

    &iquest;Por qu&eacute; querr&iacute;a usted combinar una partici&oacute;n de un disco duro y un
    ramdisk en una partici&oacute;n raid? No lo s&eacute;. Pero podr&iacute;a tener un uso
    a la larga. Los sistemas operativos inteligentes no proveen algo as&iacute;
    porque no hay ning&uacute;n beneficio inmediato. Es por esto que muchos
    sistemas operativos comerciales dejan de ser populares y porqu&eacute;
    las aplicaciones libres est&aacute;n reemplazando aplicaciones escritas
    por idiotas que s&oacute;lo est&aacute;n interesados por el dinero y no por la
    tecnolog&iacute;a.

    <P>Hay tres problemas para combinar un ramdisk con una partici&oacute;n de
    un disco duro.</P>

    <OL>
      <LI>Desconozco c&oacute;mo hacerlo con ramfs, pero lo he conseguido con
      /dev/ram. Quiz&aacute;s, si se pudiese formatear una partici&oacute;n de un disco
      duro con el sistema de ficheros que utiliza ramfs, se podr&iacute;a hacer.
      No tengo ni idea de lo que es la capa VFS, as&iacute; que intentar&eacute;
      estudiar m&aacute;s sobre esto.</LI>

      <LI>Si el espejo raid se ejecuta exactamente en paralelo, entonces
      la velocidad extra de la memoria no servir&aacute; de nada. No s&eacute; si es
      posible crear un espejo raid que s&oacute;lo haga lecturas desde el disco
      ram, en cuyo caso, si esto fuera posible, ser&iacute;a de utilidad.</LI>

      <LI>En el arranque, hay que reconstruir el ramdisk.</LI>
    </OL>
    Para inicializar el  raid, he configurado mi /etc/raidtab como sigue.

<PRE>
  raiddev /dev/md3
          raid-level      1
          nr-raid-disks   2
          nr-spare-disks  0
          chunk-size     4
          persistent-superblock 1
          device          /dev/hdb6
          raid-disk       1
          device          /dev/ram3
          raid-disk       0
</PRE>
    Despu&eacute;s he ejecutado,
<PRE>
mkraid /dev/md3
mkfs -t ext2 /dev/md3
mkdir -p /RAID1
mount /dev/md3 /RAID1
</PRE>
    El problema es que, en el arranque, el ramdisk se echar&aacute; a perder.
Entonces, despu&eacute;s de arrancar el sistema
<PRE>
raidstart /dev/md3
raidhotadd /dev/md3 /dev/ram3
mount /dev/md3 /RAID1
</PRE>
    Ahora recuerde, si no reconfigura el ramdisk para tener m&aacute;s de
    4 megas, no servir&aacute; de nada que la partici&oacute;n de su disco duro
    sea mayor de 4 megas.

    <P>Estar&iacute;a genial tener un raid con 3 particiones. 1 con
    el ramdisk y 2 con particiones del disco duro y consiguiendo
    que el ramdisk est&eacute; activo solamente para los ciclos de lectura.
    No s&eacute; si es posible aislar las lecturas a una &uacute;nica de las particiones
    en un raid,  pero ser&iacute;a fant&aacute;stico conseguirlo.</P>
    <HR>
    <A name="Comments"></A>

    <A NAME="210lfindex6">&nbsp;</A>
<H2>Comentarios</H2>

    Posiblemente &eacute;sta sea la secci&oacute;n m&aacute;s importante del art&iacute;culo. Amo
    Linux porque te permite meterte en l&iacute;os. No hay que preocuparse,
    es el modo de aprender.

    <OL>
      <LI>Por defecto, ramfs utiliza la mitad de la memoria f&iacute;sica (sin swap).
      Por tanto, si crea dos ramfs y las llena, su ordenador se quedar&aacute; sin
      memoria y se colgar&aacute;, como me ha pasado a m&iacute;. POR FAVOR, especifique
      el tama&ntilde;o m&aacute;ximo de memoria dedicado al ramdisk, como se ha descrito
      anteriormente.</LI>

      <LI>Creo que ramfs utiliza su propio sistema de ficheros en lugar
      de ext2, por tanto, si copia ficheros de una parte a otra utilizando
rsync
      o tar, no espere que los ficheros sean id&eacute;nticos y tengan el mismo
      tama&ntilde;o. No ver&aacute; ninguna diferencia al usarlos, pero como no es ext2
      sus propiedades podr&iacute;an ser distintas en alg&uacute;n caso.</LI>

      <LI>He le&iacute;do la documentaci&oacute;n para ramfs en el n&uacute;cleo y no parece
      que ramfs se haya implementado realmente para un uso extenso, pero
      no veo porqu&eacute;. Funciona de la forma que esperaba.</LI>
    </OL>
    Hay cosas que todav&iacute;a no he hecho con los ramdisk.

    <OL>
      <LI>Quiero ver si puedo crear un raid con un ramfs y un disco duro.</LI>

      <LI>Si puedo hacerlo, entonces la lectura en el raid podr&iacute;a
      limitarse a una de las particiones.</LI>

      <LI>
        Poner un servicio, como un servidor web, en un ramdisk con raid.
        El truco aqu&iacute; es usar raid, de forma que si hay alg&uacute;n cambio, no
        se pierda. Es por lo que raid es tan importante para m&iacute; ---- Podr&iacute;a
        poner servicios en memoria DE FORMA SEGURA y aumentando la velocidad
        de funcionamiento, aprovechando la mayor velocidad de la memoria
sobre el
disco duro, asumiendo:

        <UL>
          <LI>Que puedo conseguir un raid que lea s&oacute;lo de la partici&oacute;n
          ramdisk y no de las otras.</LI>

          <LI>La lectura de ficheros de un disco duro est&aacute; en cach&eacute; en
          la memoria. S&oacute;lo si cambian, o desaparecen de la cach&eacute;, se notar&iacute;a
          una diferencia de velocidad. Adem&aacute;s, el arranque inicial es m&aacute;s
          r&aacute;pido la primera vez que se lee un fichero.</LI>

          <LI>Se puede utilizar el servidor web incorporado en los nuevos
          n&uacute;cleos. Deber&iacute;a funcionar tambi&eacute;n muy r&aacute;pido. &iquest;Se podr&iacute;a
          combinar el servidor web incorporado con un ramdisk?</LI>
        </UL>
      </LI>

      <LI>Configurar un ordenador para arrancar desde un cdrom, iniciar
      un servicio y recuperar los cambios a trav&eacute;s la red. No se necesita
      disco duro. Estar&iacute;a muy bien. Usted podr&iacute;a tener un servidor web (o
      cualquier otra cosa) ejecut&aacute;ndose en un ordenador sin disco duro y
      con s&oacute;lo un cdrom y memoria. Si ampl&iacute;a la memoria a 1 giga, no veo
      porqu&eacute; no podr&iacute;a tener su sistema ejecut&aacute;ndose enteramente sobre
      el cdrom. Ser&iacute;a excelente por cuestiones de seguridad. Simplemente,
      reiniciar el sistema, cargar cualquier cambio desde un recurso seguro,
      despu&eacute;s iniciar los servicios, y su ordenador estar&aacute; perfecto, limpio
      y libre de intrusiones. El servidor web no guardar&iacute;a nunca nada
      en el ordenador local, sino que guardar&iacute;a logs e informaci&oacute;n en
      un ordenador separado conectado de forma segura mediante una red
interna.
      Anteriormente he hecho cdroms arrancables en red con discos ram. Ser&iacute;a
      estupendo combinar esto con mi anterior proyecto.</LI>
    </OL>

    <A NAME="210lfindex7">&nbsp;</A>
<H2>Recursos</H2>


    <OL>
      <LI><A href=

"../../common/src/article210/linux.ac_Documentation_filesystems_ramfs.txt.html">

kernel/v2.4/patch/patch-2.4.3-ac2/linux.ac_Documentation_filesystems_ramfs.txt.html</A></LI>

      <LI><A href=

"http://genericbooks.com/LDP/HOWTO/Software-RAID-HOWTO.html">http://genericbooks.com/LDP/HOWTO/Software-RAID-HOWTO.html</A></LI>

      <LI><A href="../November1999/article125.html">Acelerando peque&ntilde;as
bases de datos en linux</A></LI>

      <LI><A href="../November1999/article124.html">C&oacute;mo usar un
      ramdisk bajo linux</A></LI>

      <LI>Si este art&iacute;culo cambiara estar&iacute;a disponible aqu&iacute;: <A href=

"http://www.gnujobs.com/Articles/21/Ramdisk2.html">http://www.gnujobs.com/Articles/21/Ramdisk2.html</A></LI>
    </OL>

    <P>&iexcl;Gracias a Katja por toda su ayuda!</P>

  





<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=210&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Mark Nielsen, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article210.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="http://www.tcu-inc.com/mark"><FONT COLOR="#FFFFFF">Mark Nielsen</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:rhernando&#64;mundofree.com"><FONT COLOR="#FFFFFF">Roberto Hernando</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-07-16, generated by lfparser version 2.17</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
