<HTML>
<HEAD>
<TITLE>Samba COMO: Instalaci&oacute;n</TITLE>
</HEAD>
<BODY>
<A HREF="Samba-Como-2.html">Anterior</A>
<A HREF="Samba-Como-4.html">Siguiente</A>
<A HREF="Samba-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Instalaci&oacute;n</A></H2>


<P>La &uacute;ltima versi&oacute;n del c&oacute;digo de <I>Samba</I> est&aacute; disponible en:</P>
<P><CODE>
<A HREF="ftp://nimbus.anu.edu.au/pub/tridge/samba/">ftp://nimbus.anu.edu.au/pub/tridge/samba/</A></CODE></P>
<P>De todas maneras, si has instalado la distribuci&oacute;n <I>RedHat</I> de Linux, tienes la 
opci&oacute;n de instalarlo como paquete. Algunas otras distribuciones tambi&eacute;n incluyen
los ejecutables de <I>Samba</I>.</P>
<P>Se requieren los dos demonios siguientes para el paquete <I>Samba</I>. Se suelen instalar en <CODE>/usr/sbin</CODE> y se pueden ejecutar tanto desde los scripts de 
arranque del sistema como desde <CODE>inetd</CODE>. Algunos scripts de ejemplo los 
puedes ver en 
<A HREF="Samba-Como-4.html#sec-daemons">Ejecutando los demonios</A>.</P>
<P>
<UL>
<LI><CODE>smbd</CODE> (El demonio de SMB)</LI>
<LI><CODE>nmbd</CODE> (Provee un nameserver de NetBIOS para soporte de clientes)</LI>
</UL>
</P>
<P>Habitualmente, se instalan en <CODE>/usr/bin</CODE> los siguientes ejecutables de 
<I>Samba</I>, aunque la localizaci&oacute;n (como de costumbre) es opcional.</P>
<P>
<UL>
<LI><CODE>smbclient</CODE>       (Un cliente SMB para maquinas UNIX)</LI>
<LI><CODE>smbprint</CODE>        (Un script para imprimir a una impresora en un servidor SMB)</LI>
<LI><CODE>smbprint.sysv</CODE>   (Como el de encima, pero para m&aacute;quinas UNIX SVR4)</LI>
<LI><CODE>smbstatus</CODE>       (Lista de las conexiones SMB en marcha en el servidor local)</LI>
<LI><CODE>smbrun</CODE>          (Un script 'cola' para facilitar la ejecuci&oacute;n de 
aplicaciones en servidores )</LI>
</UL>
</P>
<P>Adicionalmente, se incluye en este COMO un script llamado '<CODE>print</CODE>', que 
sirve como un &uacute;til <I>front end</I> para el script <CODE>smbprint</CODE>.</P>
<P>El paquete <I>Samba</I> es sencillo de instalar. Simplemente consigue el c&oacute;digo fuente
del servidor que nombramos antes, y lee el fichero <CODE>README</CODE> de la distribuci&oacute;n.
Hay tambi&eacute;n un fichero llamado <CODE>docs/INSTALL.txt</CODE> en la distribuci&oacute;n 
que te da un sencillo conjunto de instrucciones paso a paso.</P>
<P>Siguiendo con la instalaci&oacute;n, pon los demonios en <CODE>/usr/sbin</CODE> y los 
ejecutables en <CODE>/usr/bin</CODE>. Instala las p&aacute;ginas del manual en <CODE>/usr/local/man</CODE>.</P>
<P>Cuando compiles el paquete <I>Samba</I>, deber&iacute;as especificar en el <CODE>Makefile</CODE> la 
localizaci&oacute;n del fichero de configuraci&oacute;n, <CODE>smb.conf</CODE>. Generalmente deber&iacute;a 
estar en <CODE>/etc</CODE>, pero puedes ponerlo donde quieras. A estas alturas, 
presumimos que especificaste la localizaci&oacute;n del fichero de configuraci&oacute;n 
como <CODE>/etc/smb.conf</CODE>, el fichero de registro como <CODE>/var/log/samba-log.%m</CODE> y el directorio de bloqueo como <CODE>/var/lock/samba</CODE></P>
<P>Instala el fichero de configuraci&oacute;n, <CODE>smb.conf</CODE>. Ve al directorio donde se 
compil&oacute; el <I>Samba</I>. Mira en el directorio <CODE>examples/simple</CODE> y lee el 
fichero <CODE>README</CODE>. En ese directorio encontrar&aacute;s el fichero <CODE>smb.conf</CODE>. 
C&oacute;pialo en <CODE>/etc</CODE>. ¡TEN CUIDADO! Si tienes una distribuci&oacute;n de Linux que
tiene el <I>Samba</I> instalado ya, puede que ya tengas un fichero de configuraci&oacute;n en
<CODE>/etc</CODE>. Probablemente deber&iacute;as usar el antiguo.</P>
<P>Si no quieres que tu configuraci&oacute;n est&eacute; en <CODE>/etc</CODE>, ponla donde quieras 
y luego pon un enlace simb&oacute;lico en <CODE>/etc</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        ln -s /path/to/smb.conf /etc/smb.conf
</PRE>
</CODE></BLOCKQUOTE>
</P>

<HR>
<A HREF="Samba-Como-2.html">Anterior</A>
<A HREF="Samba-Como-4.html">Siguiente</A>
<A HREF="Samba-Como.html#toc3">Indice</A>
</BODY>
</HTML>
