<HTML>
<HEAD>
<TITLE>Samba COMO: Configuraci&oacute;n General (/etc/smb.conf)</TITLE>
</HEAD>
<BODY>
<A HREF="Samba-Como-4.html">Anterior</A>
<A HREF="Samba-Como-6.html">Siguiente</A>
<A HREF="Samba-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Configuraci&oacute;n General (<CODE>/etc/smb.conf</CODE>)</A></H2>


<P>La configuraci&oacute;n de <I>Samba</I> en un Linux (u otra m&aacute;quina UNIX) es controlada por un
solo fichero, <CODE>/etc/smb.conf</CODE>. Este fichero determina qu&eacute; recursos del 
sistema quieres compartir con el mundo exterior y que restricciones deseas poner
en ellos.</P>
<P>Como las siguientes secciones 'direccionar&aacute;n' la compartici&oacute;n de unidades e 
impresoras de Linux con m&aacute;quinas Windows, el fichero <CODE>smb.conf</CODE> mostrado en 
esta secci&oacute;n es lo m&aacute;s simple posible, solo para prop&oacute;sitos introductorios.</P>
<P>No te preocupes por los detalles, a&uacute;n. Otras secciones m&aacute;s adelante introducir&aacute;n
los conceptos m&aacute;s importantes.</P>
<P>Cada secci&oacute;n del fichero empieza con una cabecera como <CODE>[global], [impresoras]</CODE>, etc.</P>
<P>La secci&oacute;n <CODE>[global]</CODE> define unas pocas variables que <I>Samba</I> usar&aacute; para 
definir la compartici&oacute;n de todos los recursos.</P>
<P>La secci&oacute;n <CODE>[homes]</CODE> permite a los usuarios remotos acceder a sus 
respectivos directorios principales en la m&aacute;quina Linux local (cada uno al suyo 
nada m&aacute;s). Esto es, si un usuario de Windows intenta conectar a este recurso 
desde su m&aacute;quina Windows, ser&aacute; conectado a su directorio personal. A tener en cuenta que para hacer esto, tiene que tener una cuenta en la m&aacute;quina Linux. ;-)</P>
<P>El fichero <CODE>smb.conf</CODE> que viene debajo como ejemplo permite a los usuarios
remotos acceder a su directorio principal en la m&aacute;quina local y escribir en un
directorio temporal. Para que un usuario de Windows vea estos recursos, la 
m&aacute;quina Linux debe estar en la red local. Entonces el usuario simplemente 
conecta una unidad de red desde el <I>Explorador de Windows</I> o el <I>Windows File Manager</I>.</P>
<P>F&iacute;jate que en las siguientes secciones, se dar&aacute;n entradas adicionales a este 
fichero para permitir la compartici&oacute;n de m&aacute;s recursos.</P>
<P>
<BLOCKQUOTE><CODE>
<HR>
<PRE>

; /etc/smb.conf
;
; Reinicia el servidor cada vez que hagas cambios a este fichero, ej:
; /etc/rc.d/init.d/smb parar
; /etc/rc.d/init.d/smb empezar

[global]
; Quita el comentario a la siguiente linea si quieres cuentas de invitado
; guest account = nobody
   log file = /var/log/samba-log.%m
   lock directory = /var/lock/samba
   share modes = yes

[homes]
   comment = Directorios principales
   browseable = no
   read only = no
   create mode = 0750

[tmp]
   comment = Espacio de ficheros temporales
   path = /tmp
   read only = no
   public = yes

</PRE>
<HR>
</CODE></BLOCKQUOTE>
</P>


<HR>
<A HREF="Samba-Como-4.html">Anterior</A>
<A HREF="Samba-Como-6.html">Siguiente</A>
<A HREF="Samba-Como.html#toc5">Indice</A>
</BODY>
</HTML>
