<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>BTTV Mini-Como : Configuraci&oacute;n del sistema</TITLE>
 <LINK HREF="BTTV-Mini-COMO-5.html" REL=next>
 <LINK HREF="BTTV-Mini-COMO-3.html" REL=previous>
 <LINK HREF="BTTV-Mini-COMO.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="BTTV-Mini-COMO-5.html">Página siguiente</A>
<A HREF="BTTV-Mini-COMO-3.html">Página anterior</A>
<A HREF="BTTV-Mini-COMO.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4. Configuraci&oacute;n del sistema</A></H2>

<P>
<H2><A NAME="ss4.1">4.1 Instalaci&oacute;n del Hardware</A>
</H2>

<P><EM>(Gracias a William Burrow por esta secci&oacute;n.)</EM>
<P>Si tiene miedo de abrir la carcasa de su ordenador, lea primero este
documento completo y anota las caracter&iacute;sticas de su tarjeta, tales
como sintonizador, n&uacute;mero de sus circuitos integrados, la frecuencia
de sintonizaci&oacute;n y datos similares.
<P>
<P>En otro caso, abra su ordenador e instale la tarjeta en una ranura
libre. Elija una que soporte la transferencia del bus PCI y el PCI Bus
Mastering; si no sabe si su placa base tiene todas estas
caracter&iacute;sticas, m&iacute;relo en su manual. Le har&aacute;n falta para el modo
Overlay.
<P>
<P>Con respecto al sonido hay dos formas diferentes de conectar su
tarjeta capturadora y la de sonido. Una es internamente. Conecte su
cable de audio digital del lector CD-ROM a la entrada de sonido de la
tarjeta de v&iacute;deo y la salida a la entrada de la de sonido, donde iba
el cable del CD-ROM. Otra forma es conectar el conector «jack» externo
de sonido de 3.5 mm. de la tarjeta de v&iacute;deo con la entrada de l&iacute;nea de
la tarjeta de sonido. Tambi&eacute;n puede, simplemente, conectar unos
altavoces amplificados a la salida de la tarjeta de v&iacute;deo, si no tiene
una de sonido o no le apetece pasarlo a trav&eacute;s de ella. (Algunas
tarjetas nuevas Bt878 no tienen ning&uacute;n conector de sonido, ya que
env&iacute;an la se&ntilde;al digital de audio a trav&eacute;s del bus PCI. No hay soporte
para esto en el momento de escribirlo).
<P>
<P>Tambi&eacute;n es recomendable una fuente de v&iacute;deo para determinar si la
tarjeta est&aacute; funcionando o no. Algunas tarjetas manejan v&iacute;deo
compuesto, S-Video y si tienen sintonizador entrada RF (N. del T.: La
entrada de antena habitual). Hay un conector separado para cada
entrada.
<P>
<P>
<P>
<H2><A NAME="ss4.2">4.2 Configuraci&oacute;n del N&uacute;cleo </A>
</H2>

<P>Su n&uacute;cleo necesitar&aacute; estar configurado para soportar su tarjeta.  La
mayor&iacute;a de las nuevas distribuciones de Linux vienen con los m&oacute;dulos
necesarios ya compilados, as&iacute; podr&aacute; encontrar <CODE>videodev.o</CODE>,
<CODE>bttv.o</CODE>, y <CODE>tuner.o</CODE> en
<CODE>/lib/modules/2.x.x/misc</CODE>, y ya tendr&iacute;a que estar todo
dispuesto.
<P>
<P>
<P>En otro caso, necesitar&aacute; recompilar su n&uacute;cleo con  
<P><CODE>CONFIG_VIDEO_DEV</CODE>
<P>y 
<P><CODE>CONFIG_VIDEO_BT848</CODE>
<P>activados, preferiblemente como m&oacute;dulos para cargar. Mire en el Linux Kernel
HOWTO (
<A HREF="http://www.linuxdoc.org/HOWTO/Kernel-HOWTO.html">http://www.linuxdoc.org/HOWTO/Kernel-HOWTO.html</A>) (o su 
traducci&oacute;n espa&ntilde;ola, disponible en 
<A HREF="http://www.insflug.org">http://www.insflug.org</A>) para 
m&aacute;s detalles acerca de la recompilaci&oacute;n del n&uacute;cleo.
<P>
<P>
<H2><A NAME="ss4.3">4.3 Usar los paquetes 0.6.x actualizados</A>
</H2>

<P>Si desea usar los paquetes 0.6.x actualizados, debe obtener primero el 
archivo de uno de los sitios mencionados arriba. Descompr&iacute;malo con la orden: 
<P> 
<CODE>tar -xvzf bttv-0.6.x.tar.gz</CODE>
<P>y c&aacute;mbiese al reci&eacute;n creado directorio con permisos de superusuario, y escriba
<P><CODE>make</CODE>
<P>en el directorio principal para crear los controladores de
dispositivo. (Puede ignorar tranquilamente la informaci&oacute;n del fichero
<CODE>INSTALL</CODE> con respecto a editar los makefiles ya que pasaremos esta
informaci&oacute;n al controlador de dispositivo, en forma de par&aacute;metros de
los m&oacute;dulos.) Entonces 
teclee:
<P><CODE>make install</CODE>
<P>para instalarlos y finalmente ejecute
<P><CODE>/sbin/depmod -a</CODE>
<P>para actualizar las informaci&oacute;n sobre dependencias de los m&oacute;dulos.
<P>
<H2><A NAME="ss4.4">4.4 Ficheros especiales en <CODE>/dev</CODE></A>
</H2>

<P>Despu&eacute;s necesitar&aacute; crear los fichero especiales de car&aacute;cter en el
directorio <CODE>/dev</CODE>. Teclee <CODE>ls /dev/video*; ls
/dev/radio*</CODE> para ver si ya existen. Si no existen necesitaremos
crearlos. Todos los ficheros tendr&aacute;n como major device number 81, y el
minor device number depender&aacute; del dispositivo espec&iacute;fico (v&iacute;deo,
radio, etc.) as&iacute; como m&uacute;ltiples instancias de estos ficheros.
<P>Mire en la API de Video4Linux (
<A HREF="http://roadrunner.swansea.uk.linux.org/v4lapi.shtml">http://roadrunner.swansea.uk.linux.org/v4lapi.shtml</A>) para los
detalles relativos a la programaci&oacute;n.
<P>
<P>
<P>
<P>Hay un gui&oacute;n del int&eacute;rprete de &oacute;rdenes (script de shell) llamado
<CODE>MAKEDEV</CODE> en el directorio <CODE>driver</CODE> del paquete de los
controladores de dispositivo bttv, que crear&aacute; por Usted cuatro
dispositivos de v&iacute;deo.  Tambi&eacute;n puede hacerlo f&aacute;cilmente Usted
mismo, si s&oacute;lo dispone de una tarjeta de v&iacute;deo.  Como root, teclee:
<P><CODE>mknod /dev/video0 c 81 0</CODE>
<P><CODE>chmod 666 /dev/video0</CODE>
<P><CODE>ln -s /dev/video0 /dev/video</CODE>
<P>
<P><CODE>mknod /dev/radio0 c 81 64</CODE>
<P><CODE>chmod 666 /dev/radio0</CODE>
<P><CODE>ln -s /dev/radio0 /dev/radio</CODE>
<P>
<P>
<P>Hay tambi&eacute;n dispositivos de teletexto y VBI que pueden crearse si tiene
alguna aplicaci&oacute;n que los necesite (Actualmente son pocas). Teclee:
<P><CODE>mknod /dev/vtx0 c 81 192</CODE>
<P><CODE>chmod 666 /dev/vtx0</CODE>
<P><CODE>ln -s /dev/vtx0 /dev/vtx</CODE>
<P>
<P><CODE>mknod /dev/vbi0 c 81 224</CODE>
<P><CODE>chmod 666 /dev/vbi0</CODE>
<P><CODE>ln -s /dev/vbi0 /dev/vbi</CODE>
<P>
<P>
<P>
<H2><A NAME="ss4.5">4.5 Carga de los m&oacute;dulos </A>
</H2>

<P>
<P>El controlador de dispositivo bttv proporciona varios m&oacute;dulos
diferentes, con distintas opciones, que se describen en el ap&eacute;ndice de
este documento. Con tantos m&oacute;dulos y opciones, puede desear hacerlo
todo a mano hasta tenerlo funcionando.  En el caso de que esto pudiese
ocasionar un bloqueo en el ordenador, no ser&aacute; perjudicial escribir:
<P><CODE>sync; sleep 1; sync</CODE>
<P>para vaciar los <EM>buffers</EM> antes de proceder. Entonces, usando
la orden <CODE>insmod</CODE> como el usuario root, intente cargar estos
m&oacute;dulos. Los dos primeros son f&aacute;ciles, ya que generalmente no
necesitan ninguna opci&oacute;n:
<P><CODE>insmod videodev</CODE>
<P><CODE>insmod i2c</CODE>
<P>Ahora est&aacute; preparado para cargar el propio m&oacute;dulo bttv:
<P><CODE>modprobe -v bttv</CODE>
<P>Por defecto el m&oacute;dulo <CODE>bttv</CODE> intenta autodetectar su tipo de
tarjeta.  Observe <CODE>/var/log/messages</CODE> para ver lo que
encuentra. Si no lo autodetecta correctamente, puede Usted a&ntilde;adir la
opci&oacute;n <CODE>card=<EM>n</EM></CODE> al final de la orden anterior para forzar
un tipo de tarjeta, con <CODE><EM>n</EM></CODE> elegido de de la siguiente
lista. (Se dan los tipos de 0 hasta 19, en los controladores de
dispositivo del n&uacute;cleo bttv-0.6.4h se incluye soporte para los tipos
desde el 20 hasta el 27).  Puede tambi&eacute;n a&ntilde;adir la opci&oacute;n
<CODE>radio=1</CODE> si su tarjeta tiene sintonizador de FM.
<P>
<HR>
<PRE>
card=n  card type
                        0:  Autodetectar
                        1:  Miro
                        2:  Hauppauge (viejas tarjetas bt848)
                        3:  STB
                        4:  Intel
                        5:  Diamond
                        6:  AVerMedia
                        7:  MATRIX Vision MV-Delta
                        8:  FlyVideo
                        9:  TurboTV
                        10: Hauppauge (nuevas trajetas bt878)
                        11: MIRO PCTV pro
                        12: Terratec/Vobis TV-Boostar
                        13: Nueva Hauppauge WinCam (bt878)
                        14: MAXI TV Video PCI2
                        15: Terratec TerraTV+
                        16: Aimslab VHX
                        17: PXC200
                        18: AVermedia98
                        19: FlyVideo98 (nuevas FlyVideo cards)
                        20: Zoltrix TV-Max
                        21: iProTV
                        22: ADS Technologies Channel Surfer TV
                        23: Pixelview PlayTV (bt878)
                        24: Leadtek WinView 601
                        25: AVEC Intercapture
                        26: LifeView FlyKit sin sintonizador
                        27: Intel Create and Share PCI

</PRE>
<HR>
<P>Despu&eacute;s, cargue el m&oacute;dulo del sintonizador con: 
<P><CODE>modprobe tuner type=<EM>n</EM></CODE>
<P>Probablemente necesite mirar en la tarjeta cu&aacute;l es el que
tiene. Algunas tarjetas (Miro y Hauppauge) permiten detectar
autom&aacute;ticamente el sintonizador detectado, pero puede que necesite
especificarlo. El sintonizador tendr&iacute;a que tener la marca y
especificar si es NTSC o PAL. Para los PAL, est&aacute; marcado con 28.xxxMHz
(donde xxx son tres d&iacute;gitos). Para NTSC, la chapa deber&aacute; rezar 
35.xxxMHz.  Una vez que lo tenga identificado, selecciona el valor de
<CODE><EM>n</EM></CODE> de la lista siguiente (los tipos 8 y 9 est&aacute;n s&oacute;lo
incluidos en bttv-0.6.4h):
<P>
<HR>
<PRE>
type=n          tipo del chip sintonizador, n entre los siguientes:
                0: sintonizador Temic PAL 
                1: sintonizador Philips PAL_I 
                2: sintonizador Philips NTSC 
                3: sintonizador Philips SECAM
                4: sin sintonizador
                5: sintonizador Philips PAL
                6: sintonizador Temic NTSC
                7: sintonizador Temic PAL 
                8: sintonizador Alps TSBH1 NTSC
                9: sintonizador Alps TSBE1 PAL
</PRE>
<HR>
<P>
<P>
<BLOCKQUOTE>(N. del T. En Espa&ntilde;a ese utiliza el sistema PAL, como en la
mayor&iacute;a del continente europeo, exceptuando Francia, que usa SECAM. En
Am&eacute;rica y Jap&oacute;n lo habitual es NTSC. Adem&aacute;s los sintonizadores m&aacute;s
corrientes son el Philips y el Temic, por lo que lo habitual en su
tarjeta, suponiendo que est&eacute; en Espa&ntilde;a, ser&aacute; 0 &oacute; 5.)</BLOCKQUOTE>
<P>Finalmente, inserte los m&oacute;dulos de sonido que necesite. De nuevo
necesitar&aacute; mirar detenidamente la tarjeta para saber lo que
tiene. Tenga en cuenta que los controladores de dispositivo para los
chips TEA6300, TDA8425, TDA9855 y DPL3518 s&oacute;lo est&aacute;n incluidos en los
controladores de dispositivo de la serie 0.6.4h y no lo est&aacute;n en los
actuales (2.2.14) controladores de dispositivo del n&uacute;cleo.
<P>
<P><CODE>modprobe msp3400</CODE> o <CODE>tea3600</CODE> o <CODE>tda8425</CODE> o
<CODE>tda9855</CODE> o <CODE>dpl3518</CODE> (consulte el ap&eacute;ndice para m&aacute;s detalles y 
opciones)
<P>
<P>Ponga en marcha tu programa favorito de video4linux y compruebe si
funciona. Si no puede cambiar de canal, aseg&uacute;rese de haber insertado
el m&oacute;dulo con el sintonizador correcto. Si no escucha nada, compruebe
el m&oacute;dulo del sonido, y que el canal no est&eacute; silenciado, si mete el
audio a trav&eacute;s de la tarjeta de sonido.
<P>
<H2><A NAME="ss4.6">4.6 Automatizaci&oacute;n del proceso </A>
</H2>

<P>Despu&eacute;s de conocer qu&eacute; m&oacute;dulos y opciones necesitas, puede automatizar
el proceso poniendo la informaci&oacute;n en
<CODE>/etc/conf.modules</CODE>. Entonces, al ejecutar una aplicaci&oacute;n que
necesite el controlador de dispositivo, se cargar&aacute; autom&aacute;ticamente.
Nosotros utilizamos los siguientes:
<P>
<HR>
<PRE>
# TV
alias   char-major-81   bttv
pre-install bttv        modprobe -k tuner; modprobe -k msp3400
options bttv            radio=1 card=3
options tuner           type=2
</PRE>
<HR>
<P>Aseg&uacute;rese de cambiarlo para reflejar los m&oacute;dulos y opciones
correspondientes a su tarjeta. (Ejecute <CODE>/sbin/depmod -a</CODE> para
asegurarse de que toda la informaci&oacute;n de dependencias de m&oacute;dulos est&aacute;
actualizada).
<P>
<P>
<BLOCKQUOTE>(N. del T.: En nuestro caso tuvimos que a&ntilde;adir pll=1 al
driver bttv. El tipo de tarjeta es el 6 y el sintonizador el
5. Utilizamos una Avermedia Capture 98)</BLOCKQUOTE>
<P>
<HR>
<A HREF="BTTV-Mini-COMO-5.html">Página siguiente</A>
<A HREF="BTTV-Mini-COMO-3.html">Página anterior</A>
<A HREF="BTTV-Mini-COMO.html#toc4">Índice general</A>
</BODY>
</HTML>
