<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf242, Applications: Empezando a conocer el XML</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Floris Lambrechts
 =LF=CAT___: Applications
 =LF=TITLE_: Empezando a conocer el XML
 =LF=NUMBER: 242
 =LF=ANAME_: article242.html
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img SRC="../../common/images/Floris_Lambrechts.png" ALT="[Floris Lambrechts]" height=150 width=138>
<BR>por  Floris Lambrechts <br> <small>&lt;floris(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->

Durante a&ntilde;os he sido eI editor de LinuxFocus en los Pa&iacute;ses
Bajos. Estoy estudiando ingenier&iacute;a industrial por la rama de electr&oacute;nica
en Lovaina, B&eacute;lgica, y "pierdo" el tiempo enredando en Linux, PHP,
XML y LinuxFocus, a la vez que leo libros como los de Stephen Hawking y
(en este momento) <i>The Humane Interface</i>, de Jef Raskin.


<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Javier Fdez. Retenaga <small>&lt;inignaga(at)teleline.es&gt;</small>
<br>
<!--
 =LF=TRANSTO=es: Javier Fdez. Retenaga
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#242lfindex0">
Introducci&oacute;n</A></LI>
  <LI><A HREF="#242lfindex1">
Qu&eacute; es el XML</A></LI>
  <LI><A HREF="#242lfindex2">
El DTD</A></LI>
  <LI><A HREF="#242lfindex3">
DTDs disponibles</A></LI>
  <LI><A HREF="#242lfindex4">
Enlaces</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=242">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Empezando a conocer el XML</H2>
 <img SRC="../../common/images/illustration242.png" ALT="[Illustration: xml]" HSPACE=10 height=52 width=110>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->

Esta es una bastante breve introducci&oacute;n al XML. Conocer&aacute;
a Micif&uacute; el meta-gato, las normas sint&aacute;cticas del XML y algunos
DTDs. No se preocupe, nos explicaremos ;-)


<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


<A NAME="242lfindex0">&nbsp;</A>
<H2>
Introducci&oacute;n</H2>

En el verano de 2001, algunos de los editores de LF nos juntamos en Burdeos
durante el <a href="http://lsm.abul.org/">LSM</a>. Muchas conversaciones
y discusiones del grupo del LSM particularmente interesado en la documentaci&oacute;n
resultaron girar en torno al mismo asunto: el XML. Se dedic&oacute; largas
(y entretenidas) horas a explicar qu&eacute; es exactamente el XML, para
qu&eacute; es bueno y c&oacute;mo puede utilizarse. Si est&aacute; interesado,
eso es precisamente lo que este art&iacute;culo tratar&aacute; de discutir.
<p>Quisiera dar las gracias a Egon Willighagen y a Jaime Villate por introducirme
al XML. Este art&iacute;culo se basa de alguna manera en la informaci&oacute;n
contenida en los art&iacute;culos de Jaime, que puede encontrar m&aacute;s
abajo en los enlaces.
<A NAME="242lfindex1">&nbsp;</A>
<H2>
Qu&eacute; es el XML</H2>

Todos los que nos ocupamos de la documentaci&oacute;n sab&iacute;amos,
m&aacute;s o menos, de qu&eacute; iba el XML. A fin de cuentas, su sintaxis
es muy similar a la del HTML y no es m&aacute;s que otro lenguaje de marcas,
como el SGML y (de nuevo) el HTML, &iquest;no es eso? As&iacute; es. Pero
hay m&aacute;s.
<br>El XML tiene algunas propiedades que hacen de &eacute;l un formato
de datos &uacute;til para casi todo. Parece que pueda describir las cosas
m&aacute;s complejas y continuar siendo f&aacute;cil de leer para los humanos
y f&aacute;cil de analizar por los programas. &iquest;C&oacute;mo puede
ser eso? Investiguemos este curioso lenguaje.
<h4>
Micif&uacute;, el meta-gato</h4>
Antes que nada, el XML es un <i>lenguaje de marcas</i>. Los documentos
escritos en un lenguaje de marcas<u> </u>contienen b&aacute;sicamente dos
cosas: <i>datos</i> y <i>metadatos</i>. Si usted sabe qu&eacute; son exactamente
los datos, por favor h&aacute;gamelo saber, pero hasta ese momento hablemos
de los metadatos ;). Dicho de una manera sencilla: los metadatos son informaci&oacute;n
extra que a&ntilde;ade un contexto o un sentido a los datos mismos. Un
ejemplo sencillo: tomemos la frase <i>'Mi gato se llama Micif&uacute;'</i>.
Un humano como usted sabe que <i>'gato'</i> es el nombre de una especie
animal y que <i>'Micif&uacute;'</i> es su nombre propio. Los programas
inform&aacute;ticos, sin embargo, no son humanos y no saben nada de eso.
De ah&iacute; que utilicemos los metadatos para a&ntilde;adir un sentido
a los datos (&iexcl;con sintaxis XML, por supuesto!):

<p class="code">&nbsp;&lt;frase>
<br>&nbsp;&nbsp; <b>Mi</b> &lt;animal><b>gato</b>&lt;/animal> <b>se llama</b>
&lt;nombre><b>Micif&uacute;</b>&lt;/nombre><b>.</b>
<br>&nbsp;&lt;/frase>
<p>Ahora un programa inform&aacute;tico por tonto que sea puede decir que
'gato' es una especie y que 'Micif&uacute;' es un nombre. Si queremos producir
un documento en el que todos los nombres se impriman en <font color="#0000FF">azul</font>
y todas las especies en <font color="#FF0000">rojo</font>, el XML nos lo
pone muy f&aacute;cil. S&oacute;lo por el gusto de hacerlo, esto es lo
que obtendr&iacute;amos:

<p class="code">&nbsp;Mi <font color="#FF0000">gato</font> se llama <font color="#0000FF">Micif&uacute;</font>.
<p>Ahora, te&oacute;ricamente, podemos poner toda la informaci&oacute;n
relativa al dise&ntilde;o (los colores, en este caso) en un archivo aparte,
en una as&iacute; llamada hoja de estilo. Cuando hacemos esto, en realidad
estamos separando la informaci&oacute;n relativa al dise&ntilde;o del contenido,
lo que algunos consideran el Santo Grial del dise&ntilde;o de p&aacute;ginas
<i>web</i><sup>TM</sup>.
Hasta aqu&iacute; no hemos hecho nada de especial: a&ntilde;adir metadatos
es para lo que est&aacute;n dise&ntilde;ados los lenguajes de marcas. Entonces,
&iquest;qu&eacute; hace tan especial al XML?
<h4>
La polic&iacute;a sint&aacute;ctica</h4>
Ante todo, el XML tiene una sintaxis muy estricta. Por ejemplo, en XML
cada&nbsp;<span class="mark">&lt;etiqueta></span> ha de tener una&nbsp;<span class="mark">&lt;/etiqueta></span>
de cierre. [Nota: puesto que es un poco tonto escribir&nbsp;<span class="mark">&lt;etiqueta>&lt;/etiqueta></span>
cuando no hay nada en medio, puede tambi&eacute;n escribir&nbsp;<span class=
    "mark">&lt;etiqueta
/></span> y ahorrarse quiz&aacute;s un par de minutos de su vida].
<br>Otra regla es que no puede 'mezclar' etiquetas. Tiene que cerrar las
etiquetas en el orden inverso al que las abri&oacute;. Algo como lo siguiente
no es v&aacute;lido:

<p class="code">&lt;B> <b>Texto en negrilla</b> &lt;I><b><i>Texto en negrilla
y cursiva</i></b> &lt;/B> <i>Texto en cursiva</i> &lt;/I>
<br>Las reglas sint&aacute;cticas dicen que ha de cerrar la etiqueta&nbsp;<span class=
    "mark">&lt;/I></span>
antes de cerrar&nbsp;<span class=
    "mark">&lt;/B></span>
<br>Y, est&eacute; atento, <i>todos</i> los elementos de un documento XML
han de estar contenidos en etiquetas (salvo, naturalmente, las etiquetas
inicial y final). Esta es la raz&oacute;n de que en el ejemplo de arriba
hayamos escrito las etiquetas&nbsp;<span class=
    "mark">&lt;frase></span>
alrededor de la frase. Sin ellas, algunas de las palabras de la frase no
estar&iacute;an incluidas entre etiquetas, y eso, como tantas cosas, pone
loca a la polic&iacute;a sint&aacute;ctica.
<br><img SRC="../../common/images/article242/mozilla-screenshot.png" ALT="Mozilla screenshot" valign="top" height=283 width=640 align=CENTER>
<center><b>La polic&iacute;a sint&aacute;ctica de Mozilla en marcha...</b></center>
Pero una polic&iacute;a fuerte tambi&eacute;n tiene sus ventajas: procura
orden. Puesto que el XML sigue reglas sint&aacute;cticas tan estrictas,
es muy f&aacute;cil de leer por los programas. Adem&aacute;s, los datos
de sus documentos en XML est&aacute;n muy estructurados, lo que los hace
f&aacute;ciles de leer y de escribir para los humanos.
<br>Pero dese cuenta de que las posibilidades 'te&oacute;ricas' del XML
no siempre son realizables en la pr&aacute;ctica. Por ejemplo, los analizadores
sint&aacute;cticos de XML m&aacute;s habituales est&aacute;n lejos de ser
r&aacute;pidos, y a menudo son realmente grandes. Parece as&iacute; que
el XML no es en absoluto f&aacute;cil de leer por los programas. Digamos
que ciertamente no es una buena idea hacerlo <i>todo</i> en XML, s&oacute;lo
porque es posible. Para aplicaciones en las que precise hacer muchas b&uacute;squedas
en un documento, o cuando se trate de documentos muy grandes, a menudo
el XML no es la elecci&oacute;n m&aacute;s acertada. Pero esto no significa
que sea imposible utilizarlo para esos prop&oacute;sitos.
<br>Un buen ejemplo de la potencia del XML, pero tambi&eacute;n de su lentitud,
es el hecho de que con &eacute;l puede escribir bases de datos (&iexcl;intente
hacerlo en HTML! :p). Eso es exactamente lo que Egon Willighagen ha hecho
para la secci&oacute;n holandesa de LinuxFocus (en un enlace al final de
la p&aacute;gina puede encontrar el art&iacute;culo en que explica el procedimiento
seguido). En este caso se prefiri&oacute; la flexibilidad y extensibilidad
de un formato artesanal antes que la pura velocidad (digamos, mySQL).
<br>En lo relativo a la estricta sintaxis del XML: si consigue hacer buenas
migas con los verificadores sint&aacute;cticos, puede haber algunas maneras
de hacer que la polic&iacute;a haga parte de su trabajo. Si quiere que
as&iacute; sea, tendr&aacute; que usar inteligentemente un DTD...
<A NAME="242lfindex2">&nbsp;</A>
<H2>
El DTD</H2>

En nuestro peque&ntilde;o ejemplo de antes, 'Micif&uacute; el meta-gato',
hemos inventado nuestras propias etiquetas XML. Por supuesto, la polic&iacute;a
no permite actos creativos as&iacute;. Los 'hombres de azul' quieren saber
qu&eacute; est&aacute; usted haciendo, c&oacute;mo y (si es posible) por
qu&eacute;. Bien, no hay problema, puede explicarlo todo con el DTD...
<p>Un DTD le permite &iacute;nventar' nuevas etiquetas. De hecho, le permite
inventar lenguajes completamente nuevos, simpre que respeten la sintaxis
del XML.
<br>El DTD (<b><i>Document Type Definition</i></b>) es un archivo que contiene
una descripci&oacute;n de un lenguaje XML. Se trata en realidad de un listado
de todas las etiquetas posibles, sus posibles atributos y sus combinaciones
posibles. El DTD describe lo que es posible en su lenguaje XML y lo que
no lo es. As&iacute;, cuando hablamos de un 'lenguaje XML' estamos hablando
en realidad de un DTD espec&iacute;fico.
<h4>
Ponga a la polic&iacute;a a trabajar</h4>
En ocasiones el DTD lo <i>forzar&aacute; </i>a hacer algo en un lugar espec&iacute;fico.
Por ejemplo, el DTD puede forzarlo a incluir una etiqueta que contenga
el t&iacute;tulo del documento. Lo bueno de esto es que ya existe software&nbsp;
(p. e., un m&oacute;dulo de emacs) capaz de escribir autom&aacute;ticamente
las etiquetas requeridas.
<br>De ese modo, algunas partes de la estructura de su documento se rellenan
autom&aacute;ticamente. Como la sintaxis es tan estricta y bien definida,
el DTD puede guiarle durante el proceso de escritura de un documento. Y
cuando cometa errores tales como olvidarse de poner una etiqueta al final,
la polic&iacute;a le informar&aacute;. As&iacute;, despu&eacute;s de todo
los polis no est&aacute;n tan 'locos'; donde los polic&iacute;as del mundo
real dicen 'Tiene derecho a guardar silencio', la polic&iacute;a del XML
le habla con toda amabilidad de un 'Syntax error @ line xx : '... :)
<br>Y mientras la polic&iacute;a hace todo ese trabajo por usted, por supuesto
<i>usted</i>
puede continuar y centrarse en el contenido.
<h4>
El mezclado</h4>
Una &uacute;ltima gran caracter&iacute;stica del XML es la posibilidad
de utilizar varios DTDs a la vez. Esto significa que puede utilizar a la
vez diferentes tipos de datos en un mismo documento.
<p>Esta 'mezcla' se hace con espacios de nombres xml. Por ejemplo, usted
puede incluir el DTD Docbook en su documento .xml (para el <i>prefijo</i>
'dbk' en este ejemplo).
<br>Todas las etiquetas de Docbook estar&aacute;n entonces listas para
ser utilizadas en su documento de la siguiente manera. Digamos que hay
una etiqueta de Docbook<span class=
    "mark">&lt;una _etiqueta></span>:

<p class="code">&nbsp;&lt;dbk:una_etiqueta> unas palabras &lt;/dbk:una_etiqueta>
<br>Empleando el sistema de espacios de nombres puede utilizar cualquier
etiqueta y cualquier atributo de cualquier DTD xml. Esto le abre un mundo
de posibilidades, como puede ver en el siguiente apartado...
<A NAME="242lfindex3">&nbsp;</A>
<H2>
DTDs disponibles</H2>

Este es un peque&ntilde;o conjunto de DTDs que est&aacute;n ya (parcialmente)
en uso.
<ul>
<li>
<b>Docbook-XML</b></li>

<br>Docbook es un lenguaje para escribir documentos estructurados, por
ejemplo, libros y art&iacute;culos. Pero tambi&eacute;n se utiliza para
tareas muy diferentes. Docbook es en realidad un DTD de SGML&nbsp; (SGML
es un lenguaje de marcas est&aacute;ndar), pero existe tambi&eacute;n una
-popular- versi&oacute;n del mismo en XML. Este es uno de los DTDs de XML
m&aacute;s populares.
<br>&nbsp;
<li>
<b>MathML</b></li>

<br>MathML es el <i>Mathematical Markup Language</i> (Lenguaje de Marcas
Matem&aacute;tico),<i> </i>que se utiliza para describir expresiones y
f&oacute;rmulas matem&aacute;ticas. Es una herramienta verdaderamente pulcra
para la gente del mundo de las matem&aacute;ticas. Los qu&iacute;micos,
por su parte, no tienen por qu&eacute; estar celosos de sus colegas los
matem&aacute;ticos; para ellos existe algo como el CML, o <i>Chemical Markup
Language</i>. F&iacute;jese en que Mozilla 1.0 est&aacute; por defecto
preparado para el MathML.
<br>&nbsp;
<li>
<b>RDF</b></li>

<br>RDF es el <i>Resource Description Framework</i> (Marco Descriptivo
de Recursos). Est&aacute; dise&ntilde;ado para ayudar a codificar y reutilizar
metadatos; en la pr&aacute;ctica a menudo es utilizado en las p&aacute;ginas
<i>web</i>
para comunicar a otras p&aacute;ginas qu&eacute; novedades est&aacute;n
exponiendo. Por ejemplo, la p&aacute;gina holandesa <a href="http://linuxdot.nl.linux.org/">linuxdot.nl.linux.org</a>
utiliza el archivo RDF de otras p&aacute;ginas para exponer las novedades
de estas. Las p&aacute;ginas de noticias m&aacute;s populares (como, por
ejemplo, Slashdot) tienen un archivo RDF a disposici&oacute;n, de tal forma
que usted puede copiar las cabeceras de las noticias en, por ejemplo, un
marco lateral de su p&aacute;gina personal.
<br>&nbsp;
<li>
<b>SOAP</b></li>

<br>SOAP son las siglas de <i>Simple Object Access Protocol</i>. Es un
lenguaje utilizado por procesos para comunicarse unos con otros (intercambiar
datos y realizar llamadas a procedimientos remotos). Con SOAP, los procesos
pueden comunicarse unos con otros a distancia, por ejemplo mediante un
protocolo http (internet). Creo que Atif, aqu&iacute; en LF, puede decirle
m&aacute;s acerca de esto; vea los enlaces :-)
<br>&nbsp;
<li>
<b>SVG</b></li>

<br><i>Scalable Vector Graphics</i>. Se supone que el tr&iacute;o PNG,
JPEG2000 y SVG englobar&aacute; el futuro de las im&aacute;genes en la
<i>web</i>.
El PNG ocupar&aacute; el lugar del GIF (mapas de bits con transparencia,
comprimidos sin p&eacute;rdidas), y el JPEG2000 podr&iacute;a alg&uacute;n
d&iacute;a suceder al .jpg de hoy (mapas de bits con un grado configurable
de compresi&oacute;n con p&eacute;rdidas). El SVG no es un formato de im&aacute;genes
basado en mapas de bits, sino en vectores, lo que significa que las im&aacute;genes
no se representan mediante p&iacute;xeles, sino mediante formas matem&aacute;ticas
(l&iacute;neas, cuadrados...). El SVG tiene tambi&eacute;n funciones para
cosas tales como la escritura y la animaci&oacute;n, lo que lo hace comparable
al Flash de Macromedia. Puede emplear JavaScript en los archivos .svg,
y utilizando ese JavaScript puede a su vez escribir c&oacute;digo .svg.
Bien flexible, &iquest;eh?
<br>Pero el svg es relativamente nuevo; por el momento s&oacute;lo hay
disponible un accesorio de alta calidad de SVG para navegadores (es de
Adobe, para plataformas Windows y Mac). Mozilla est&aacute; trabajando
en un visor incorporado de SVG, pero todav&iacute;a no est&aacute; terminado
y para poder utilizarlo hay que bajarse una versi&oacute;n del navegador
compilada al efecto.
<br><i>NOTA:</i> Los archivos .svg pueden hacerse bastante grandes, por
lo que a menudo se encontrar&aacute; con archivos .svgz. Estas son versiones
comprimidas haciendo uso del algoritmo gzip.
<br>&nbsp;
<li>
<b>XHTML</b></li>

<br>XHTML es la variante XML del HTML version 4.01. Debido a la estricta
sintaxis del XML, hay alg&uacute;n cambio: hay algunas cosas que se pueden
hacer en HTML que no son v&aacute;lidas en XHTML. Pero, por contra, una
p&aacute;gina en XHTML es al mismo tiempo una p&aacute;gina de HTML v&aacute;lida.
Recuerde que el programa <u>HTML tidy</u> puede convertir sus actuales
p&aacute;ginas HTML en XML.
<br>&nbsp;
<li>
<b>Los otros</b></li>

<br>Hay otros muchos formatos de archivo nuevos que emplean el XML, a menudo
en combinaci&oacute;n con compresiones .gz or .zip. S&oacute;lo un ejemplo:
los formatos de archivo de KOffice son DTDs de XML. Esto es muy &uacute;til,
pues permite al usuario combinar la funcionalidad de diferentes aplicaciones
dentro de un documento. P. e., usted puede escribir un documento de KWord
con una hoja de c&aacute;lculo KChart dentro de &eacute;l.</ul>

<A NAME="242lfindex4">&nbsp;</A>
<H3>
Enlaces</H3>

El W3C, o <i>World Wide Web Consortium</i>
<br>Tienen informaci&oacute;n sobre XML, MathML, CML, RDF, SVG, SOAP, XHTML,
espacios de nombres...
<br><a href="http://www.w3.org/">www.w3.org</a>
<p>Alg&uacute;n material de Jaime Villate:
<br><a href="http://www.laespiral.org/xml/curso.html">Introducci&oacute;n
al XML</a>
<br><a href="http://www.laespiral.org/documentacion/articulos/articulos-COMO/articulos-COMO.html">Creaci&oacute;n
de art&iacute;culos y p&aacute;ginas web usando XML en Linux</a>
<br><a href="http://www.laespiral.org/documentacion/articulos/lsm2-slides/">LSM-slides</a>
<p>HTML tidy, el programa:
<br><a href="http://www.w3.org/People/Raggett/tidy/">www.w3.org/People/Raggett/tidy</a>
<p>Docbook
<br><a href="http://www.docbook.org/">www.docbook.org</a>
<p>Proyecto SVG de Mozilla.org
<br><a href="http://www.mozilla.org/projects/svg">www.mozilla.org/projects/svg</a>
<p>Art&iacute;culos relevantes de LinuxFocus:
<br><a href="../September2001/article206.shtml">Empleo de XML y XSLT para
desarrollar LinuxFocus.org (/Holanda)</a>
<br><a href="../May2000/article152.shtml">Crear documentos PDF con DocBook</a>



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=242"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Floris Lambrechts, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Floris Lambrechts <small>&lt;floris(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Javier Fdez. Retenaga &lt;inignaga(at)teleline.es&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-12-02, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
