<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Applications">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges     Tarbouriech
 =LF=CAT___: Applications
 =LF=TITLE_: GNUMail.app, la evidencia de la portabilidad
 =LF=NUMBER: 241
 =LF=ANAME_: article241.html
 -->
 <TITLE>lf241, Applications: GNUMail.app, la evidencia de la portabilidad</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Georges-Tarbouriech.jpg" width=
    "115" height="124" alt="Georges Tarbouriech">
<BR>por  Georges Tarbouriech <br> <small>&lt;georges.t(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Georges es un viejo usuario de Unix. Es un amante de NeXTSTEP, es
partidario de estos proyectos libres que ofrecen el aspecto y sensaci&oacute;n (y
mucho m&aacute;s) de &eacute;ste gran sistema.
    </P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Leo Trujillo Gomez <small>&lt;aleogom(at)att.net.mx&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#241lfindex0">&Eacute;rase una vez...</A></LI>
  <LI><A HREF="#241lfindex1">&iquest; Qu&eacute; es GNUMail.app ?</A></LI>
  <LI><A HREF="#241lfindex2">Compilando e instalando GNUMail.app</A></LI>
  <LI><A HREF="#241lfindex3">Configuarando GNUMail.app</A></LI>
  <LI><A HREF="#241lfindex4">Usando GNUMail.app</A></LI>
  <LI><A HREF="#241lfindex5">&iquest;Qu&eacute; sigue?</A></LI>
  <LI><A HREF="#241lfindex6">Enlaces</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=241&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>GNUMail.app, la evidencia de la portabilidad</H2>
 <IMG src="../../common/images/article241/GNUMail.gif"  width="45"
height="67" alt="GNUMail.app" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>GNUMail.app es un clon de  NeXT Mail.app corriendo bajo GNUstep y
MacOS X. El mismo c&oacute;digo fuente permite usar esta gran pieza de software en




diversas plataformas.
     Como consecuencia, es absolutamente evidente la portabilidad de
software entre GNUstep y MacOS X.
    </P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="241lfindex0">&nbsp;</A>
<H2>&Eacute;rase una vez...</H2>

    <P>
    A finales de los a&ntilde;os 80,  aparecia un nuevo sistema operativo, llamado
NeXTSTEP. Este SO ofrec&iacute;a algo que nunca hab&iacute;amos visto antes.
Entre muchas otras "cosas", proporcion&oacute; a los usuarios el primer cliente
gr&aacute;fico de correo, Mail.app.
No solo era gr&aacute;fico, sino que pod&iacute;a manejar cualquier tipo de datos:
im&aacute;genes, sonidos, etc.
    <br>
    Algunos a&ntilde;os m&aacute;s tarde, NeXT decidi&oacute; portar NeXTSTEP a otras
plataformas:
OpenStep hab&iacute;a nacido.<br>
De all&iacute;, alguna gente comenz&oacute; a trabajar en los proyectos del software
libre que ofrec&iacute;an la misma filosof&iacute;a.  El proyecto m&aacute;s grande es por
supuesto
      <a href=
    "http://www.gnustep.org">GNUstep</a>, cuya meta es proveernos
una implementaci&oacute;n libre de OpenStep.  La gente en GNUstep hace un
estupendo trabajo si se toma en cuenta
la cantidad de trabajo que representa tal proyecto.
    <br>
    Otro gran trabajo es <a href=
    "http://www.windowmaker.org">Window Maker</a>. Este manejador de
ventanas es
parte del proyecto GNUstep. Visitando ambos sitios web, descubrir&aacute; todo lo
relacionado
con estos estupendos productos libres. Tambi&eacute;n puede darles una revisi&oacute;n a
estos "viejos"
art&iacute;culos de LinuxFocus: <A href=
    "../January2000/article128.shtml">Window Maker, el esp&iacute;ritu de
NeXTStep</a>
    y <A href=
    "../March2001/article195.shtml">GNUstep, el OpenStep open source</a>.
    (ea, ustedes gente  "integrista", este t&iacute;tulo se interpretar&iacute;a solo en
relaci&oacute;n con la palabra "open": &iexcl;Todos sabemos que GNUstep es software
libre!).
    <br>
Para terminar con este cap&iacute;tulo de la historia, a&ntilde;adiremos que el fundador
de NeXTSTEP
nunca se olvid&oacute; qu&eacute; tan adelantado estaba su "hijo".  &Eacute;l lo vendi&oacute; a Apple
(que &eacute;l habia co-fundado...), regreso a "casa", y se hizo jefe "temporal"
de Apple.
Esto nos trajo MacOS X, que es NeXTSTEP en un sabor de Apple.
Y ac&aacute; estamos:  GNUstep y MacOS X tienen muchas cosas en com&uacute;n.  Por lo
tanto, se puede
esperar la compatibilidad entre aplicaciones y c&oacute;digo fuente.
 Puesto que GNUstep puede funcionar bajo muchas plataformas (en forma m&aacute;s o
menos estable),
 esto hace que la portabilidad sea completamente abierta. Para su
informaci&oacute;n, GNUstep puede
 trabajar en la mayor&iacute;a de los BSD's, la mayor&iacute;a de las distribuciones
Linux, Solaris, Irix... y a&uacute;n  en Windows.
<br> M&aacute;s proyectos se est&aacute;n desarrollando:  el port de Darwin (el coraz&oacute;n
de OS X)
para la arquitectura x86.  Revise
 <a href=
"http://gnu-darwin.sourceforge.net/">http://gnu-darwin.sourceforge.net/</a>.
    <br>
    Puede tambi&eacute;n revisar <a href=
    "http://www.linuxstep.org">http://www.linuxstep.org</a>. El nombre lo
dice todo.
    <br>
    Tambi&eacute;n tenemos Simply GNUstep de <a href=
"http://simplygnustep.sourceforge.net/">http://simplygnustep.sourceforge.net/</a>
que es una completa imagen ISO que  usted puede iniciar desde un CD:
en otras palabras, no necesita instalar las cosas por completo.
</p>
<b>NOTA:</b>
    &iexcl; NO necesita GNUstep o el sistema  X Window en MacOS X ! Esto
se puede
ver obvio, pero puesto que alguna gente me pregunta, prefiero insistir ;-)


<br>
Este es un punto importante: la portabilidad bajo X es algo que  puede
apreciar cotidianamente cuando usa distintos sabores de Unix. Es decir,
puede
compilar y usar aplicaciones independientemente del Unix que utilice:
libre, propietario, BSD, SystemV... Todos tienen algo en com&uacute;n:  El sistema
X Window. Pese
a su nombre, MacOS X (X significa 10, no sistema X Window) no tiene el
sistema X Window
: Tiene m&aacute;s bien una hermosa GUI llamada Aqua (basada en Quartz, OpenGL y
QuickTime). Consecuentemente, esto que es obvio mientras  esta usando X, se
hace mucho m&aacute;s complicado cuando involucramos a sistemas operativos con
diferente subsistema gr&aacute;fico.
<br>
A prop&oacute;sito, si Ud quiere el Sistema X Window bajo MacOS X, sea consciente
de que
 est&aacute; disponible
: por ejemplo, puede descargarlo del sitio web de Apple (<a href=
"http://www.apple.com/downloads/macosx/unix_apps_utilities/">http://www.apple.com/downloads/macosx/unix_apps_utilities/</a>.
<br>
    Como consecuencia, si hay un solo punto a recordar cuando hablamos de
GNUstep, lo llamaremos "portabilidad". Y, cuando menos, alcanzamos el
coraz&oacute;n del tema: GNUMail.app. Si usted necesita una evidencia, esta es
   </p>
   <A NAME="241lfindex1">&nbsp;</A>
<H2>&iquest; Qu&eacute; es GNUMail.app ?</H2>

   <p>
   GNUMail.app es el trabajo de Ludovic Marcotte (y amigos) y est&aacute; liberado
 bajo GPL. La parte art&iacute;stica (iconos) es el trabajo de Andrew Lindesay.
Desde el website de GNUstep puede observar los preciosos iconos creados por
Andrew para GNUstep (en la secci&oacute;n de User Apps).
   <br>
  Como ya mencionamos, GNUMail.app es un cliente de correo, el clon de
   NeXT Mail.app (o hasta hoy, clon de Apple MacOS X Mail.app). Aqu&iacute; est&aacute;
la familia
entera: de derecha a izquierda, el padre, el hijo... y los
sobrinos.<br><br>
   <A HREF="../../common/images/article241/nextm.jpg"><IMG
SRC="../../common/images/article241/nextm_th.jpg" ALT="NeXTmail" width="188" height="140"></A></TD>
<A HREF="../../common/images/article241/macm.jpg"><IMG
SRC="../../common/images/article241/macm_th.jpg" ALT="MacOS X mail" width="175" height="140"></A></TD>
<A HREF="../../common/images/article241/gnum.jpg"><IMG
SRC="../../common/images/article241/gnum_th.jpg" ALT="GNUstep GNUMail" width="186" height="140"></A></TD>
<A HREF="../../common/images/article241/macgm.jpg"><IMG
SRC="../../common/images/article241/macgm_th.jpg" ALT="MacOS X GNUMail" width="175" height="140"></A></TD>
<br><br>
   GNUMail.app tiene el aspecto y sensacion de NeXT Mail.app. Naturalmente,
ha habido con &eacute;l
 otros clientes de correo  con el aspecto y sensaci&oacute;n de NeXTSTEP,
especialmente para trabajar bajo Window Maker.
  Mencionemos a Postilion en <a href=
    "http://www.postilion.org/">http://www.postilion.org/</a> o Aileron en
<a href=
"http://ucsu.colorado.edu/~nwanua/Aileron/">http://ucsu.colorado.edu/~nwanua/Aileron/</a>.
    <br>
   Vd. puede considerarlos como proyectos detenidos: ambos autores creen
que GNUMail.app es el PROXIMO paso (NeXT Step = Juego de palabras).<br>
   GNUMail.app es algo m&aacute;s: est&aacute; escrito en objective C, usa herramientas de
desarrolladores de Apple (NeXT) tales como InterfaceBuilder y
ProjectBuilder del lado de Mac, y pronto se tuvo la capacidad de usar Gorm
o ProjectCenter del lado de GNUstep (ambos est&aacute;n
 disponibles en el sitio web de gnustep en la secci&oacute;n Developer apps). Sin
embargo,
lo    m&aacute;s importante es  que Ud. puede usar el mismo c&oacute;digo fuente para
compilarlo,
ya sea en MacOS X o GNUstep. La versi&oacute;n actual es la 1.0.0 en el momento de
que escribo esto. Se requiere una biblioteca llamada Pantomime, la cual es
un marco para manipular
 conexiones de correo (SMTP, POP, IMAP...). La versi&oacute;n actual es 1.0.2, y
una vez m&aacute;s... es lo mismo para MacOS X o para GNUstep. Ambos archivos
pueden ser descargados de <a href=
"http://www.collaboration-world.com/gnumail/">http://www.collaboration-world.com/gnumail/</a>
<br><br>
<b>Caracter&iacute;sticas</b>
<p>
 Ya que no inventar&eacute; de nuevo la rueda, aqu&iacute; est&aacute; lo que puede leer en el
sitio web de
GNUMail.app:
<br>
- Multiples cuentas POP3 (soporte APOP)  con el soporte de cache local
(para dejar mensajes en el servidor);
<br>
- Agentes de entrega m&uacute;ltiples (SMTP o programa de correo local);
<br>
- Archivo de soporte para recepci&oacute;n, Mail spool;
<br>
- Excelente soporte IMAP con almacenamiento local;
<br>
- Amplio soporte para RFC822 y RFC2822;
<br>
- Lectura, redacci&oacute;n, rechazo, respuesta y reenvio de correo;
<br>
- Administraci&oacute;n del buz&oacute;n (crear, borrar, chequeo y transferencia de
mensajes) usando
 el formato Berkeley mbox;
<br>
- Administraci&oacute;n de preferencias personales;
<br>
- Soporte MIME (codificaci&oacute;n y decodificaci&oacute;n);
<br>
- Un manejador completo de tipos MIME;
<br>
- Citas imprimibles y soporte BASE64;
<br>
- Libro de direcciones con soporte de grupos;
<br>
- Panel de b&uacute;squeda con soporte de expresiones regulares;
<br>
- Traer su correo de manera manual o autom&aacute;tica (a elecci&oacute;n del usuario);
<br>
- Filtros poderosos que soportan expresiones regulares;
<br>
Ludovic espera a&ntilde;adir muy pronto m&aacute;s caracter&iacute;sticas, as&iacute; como un nuevo
panel de Preferencias o soporte GPG. &iexcl; Y usted puede confiar en &eacute;l cuando
vea lo r&aacute;pido que trabaja !
<br><br>
 Esto seguramente deber&iacute;a hacerle sentir la necesidad de visitar el sitio
web de GNUMail.app  ;-)


</p>
<A NAME="241lfindex2">&nbsp;</A>
<H2>Compilando e instalando GNUMail.app</H2>

<p>
GNUMail.app est&aacute; disponible como c&oacute;digo fuente para MacOS X y Linux, as&iacute;
como
Pantomime (recuerde, necesita ambos). Dicho sea que Linux es m&aacute;s bien
restrictivo: esto
concierne a la mayor parte de
los sistemas operativos capaces de correr GNUstep. Por ejemplo, GNUMail.app
puede correr bajo
FreeBSD, NetBSD...
<br>
Usted puede obtener versiones binarias para MacOS X si siente que no le
gusta compilar. Hay paquetes para Debian y tambi&eacute;n "ports" (migraciones)
para FreeBSD. Sin embargo, no hablaremos de ellos.
<br>
Para ser capaz de compilar y usar GNUMail.app, tendr&aacute; que cumplir algunos
requerimientos.
<br>
Bajo MacOS X, obviamente necesita las herramientas de Desarrollador
(Developer tools). Bajo GNUstep, necesita... GNUstep. C&oacute;mo instalar GNUstep
est&aacute; fuera del alcance de este art&iacute;culo,
pero  puede encontrar todo lo que necesita en el sitio web de GNUstep. Sin
embargo, vamos a
recomendarle gcc versi&oacute;n 3.0 y se evitar&aacute; algunos problemas de compilaci&oacute;n.
Ud. tambi&eacute;n necesita las versiones "Inestable" GNUstep de make (1.3.0),
base (1.3.0), gui (0.7.6) y
xgps (0.7.6). No se preocupe, son llamados "inestables" pero trabajan
muy bien.
</p>
<b>MacOS X</b>
<p>
Primero que nada, si usted no lee la FAQ, sea consciente de que deber&iacute;a
descomprimir
los archivos usando la linea de comandos con algo como <i>tar zxvf
archivo.tar.gz</i>. Usando herramientas autom&aacute;ticas tales como Stuff-it
cambiar&aacute;n algunos archivos del archivo mencionado y usted tendr&aacute; que
renombrarlos.<br>
El archivo README en el directorio docs le dir&aacute; c&oacute;mo compilar e instalar
Pantomime y
GNUMail.app usando ProjectBuilder (Pantomime debe ser compilado primero).
Siguiendo los distintos pasos conseguir&aacute; un nuevo  GNUMail
ejecutable.
<br>
Si prefiere la l&iacute;nea de comandos, puede usar <i>pbxbuild</i> y <i>pbxbuild
install</i>. Si no conoce pbxbuild, la ayuda en l&iacute;nea de ProjectBuilder le
dir&aacute; todo acerca de esta herramienta.
<br>
Como un breve resumen, vamos a mencionar que usted no puede instalar un
destino a partir de ProjectBuilder:
 debe usar en su lugar <i>pbxbuild install</i>. Es decir, el ejecutable que
obtiene de
ProjectBuilder es enlazado al directorio donde compil&oacute; la aplicaci&oacute;n. Si
mueve el ejecutable a otra parte y quita este directorio, la aplicaci&oacute;n no
trabajar&aacute; correctamente. Si quiere quitar el directorio de c&oacute;digo fuente
(de donde compil&oacute;) y mantener una aplicaci&oacute;n trabajando, utilizar
<i>pbxbuild install</i> es obligatorio.
<br>
Cuando usted ha concluido, basta correr el ejecutable de GNUMail haciendo clic
en su icono.
</p>
<b>GNUstep</b>
<p>
Una vez que GNUstep est&eacute; funcionando, descomprima los archivos con el mismo
comando
ya mencionado. Despu&eacute;s, escriba make y make install en la l&iacute;nea de comandos
y eso es todo (por supuesto, debe compilar Pantomime antes que
GNUMail.app). Corra el comando
<i>openapp GNUMail.app</i> y ver&aacute; la magia: un cliente de correo muy
agradable en su pantalla.
<br>
Si quiere tener las cosas actualizadas, puede conseguir las versiones CVS
de
GNUMail.app (y Pantomime). Ludovic y sus amigos trabajan duro y le proveen
de nuevo material casi todos los d&iacute;as. Esto, por supuesto, implica que
usted conserva el c&oacute;digo fuente usado para compilar su primera versi&oacute;n.
Esto tambi&eacute;n puede requerir una actualizaci&oacute;n de GNUstep (tambi&eacute;n por CVS)
o una actualizaci&oacute;n de Developer tools de Apple si las hay. Para esto
&uacute;ltimo, usted debe  ser registrado como un desarrollador (&iexcl; no se preocupe,
es gratuito !).
<br>
Ahora tiene una aplicaci&oacute;n agradable, y probablemente se sentir&aacute; bien
usandola.
</p>
<A NAME="241lfindex3">&nbsp;</A>
<H2>Configuarando GNUMail.app</H2>

<p>
GNUMail.app le proporciona un panel de preferencias muy agradable, haciendo
el proceso de configuraci&oacute;n bastante f&aacute;cil. Este panel esta  dividido en
diferentes secciones
: personal, revisi&oacute;n, env&iacute;o, recepci&oacute;n, creaci&oacute;n, fuentes, MIME y  filtros.
<br>
Como su nombre dice, la secci&oacute;n personal le permite dar su informaci&oacute;n
personal a GNUMail.app: nombre, direcci&oacute;n de correo, firma.
<br><br>
   <A HREF="../../common/images/article241/perso.jpg"><IMG
SRC="../../common/images/article241/perso_th.jpg" ALT="personal" width="186" height="216"></A></td>
<A HREF="../../common/images/article241/persom.jpg"><IMG
SRC="../../common/images/article241/persom_th.jpg" ALT="personal" width="175" height="216"></A></td>

<br><br>
En la secci&oacute;n de revisi&oacute;n intenta definir  los encabezados, si
usted desea ser
mostrado en los mensajes o poner de relieve los urls presentes en el cuerpo
del mensaje.
<br><br>
   <A HREF="../../common/images/article241/view.jpg"><IMG
SRC="../../common/images/article241/view_th.jpg" ALT="viewing" width="186" height="216"></A></td>
<A HREF="../../common/images/article241/viewm.jpg"><IMG
SRC="../../common/images/article241/viewm_th.jpg" ALT="viewing" width="174" height="216"></A></td>

<br><br>
La secci&oacute;n env&iacute;o concierne a... los m&eacute;todos de entrega. All&iacute; usted
define el m&eacute;todo de transporte, su nombre de usuario, contrase&ntilde;a, etc.
<br><br>
   <A HREF="../../common/images/article241/send.jpg"><IMG
SRC="../../common/images/article241/send_th.jpg" ALT="sending" width="186" height="216"></A></td>
<A HREF="../../common/images/article241/sendm.jpg"><IMG
SRC="../../common/images/article241/sendm_th.jpg" ALT="sending" width="175" height="216"></A></td>

<br><br>
La secci&oacute;n recepci&oacute;n define c&oacute;mo... recibe el correo. All&iacute; usted
especifica el(los) servidor(es) de correo entrante.
<br><br>
   <A HREF="../../common/images/article241/rec.jpg"><IMG
SRC="../../common/images/article241/rec_th.jpg" ALT="receiving" width="186" height="216"></A></td>
<A HREF="../../common/images/article241/recm.jpg"><IMG
SRC="../../common/images/article241/recm_th.jpg" ALT="receiving" width="175" height="216"></A></td>

<br><br>
El panel de composici&oacute;n define la posici&oacute;n de la firma, el n&uacute;mero de
caracteres antes de
ajustar l&iacute;neas.
<br><br>
   <A HREF="../../common/images/article241/comp.jpg"><IMG
SRC="../../common/images/article241/comp_th.jpg" ALT="compose" width="186" height="216"></A></td>
<A HREF="../../common/images/article241/compm.jpg"><IMG
SRC="../../common/images/article241/compm_th.jpg" ALT="compose" width="175" height="216"></A></td>

<br><br>
En el panel de fuentes puede seleccionar las fuentes usadas cuando se
muestra un mensaje.
<br><br>
  <A HREF="../../common/images/article241/font.jpg"><IMG
SRC="../../common/images/article241/font.jpg" ALT="fonts" width="186" height="216"></A></td>
<A HREF="../../common/images/article241/fontm.jpg"><IMG
SRC="../../common/images/article241/fontm.jpg" ALT="fonts" width="175" height="216"></A></td>

<br><br>
El panel MIME permite definir los datos que usted desea ver como adjuntos
(im&aacute;genes, documentos como PDF...)
<br><br>
   <A HREF="../../common/images/article241/mime.jpg"><IMG
SRC="../../common/images/article241/mime.jpg" ALT="mime" width="186" height="216"></A></td>
<A HREF="../../common/images/article241/mimem.jpg"><IMG
SRC="../../common/images/article241/mimem.jpg" ALT="mime" width="175" height="216"></A></td>

<br><br>
Por &uacute;ltimo, pero no menos importante, el panel de filtros es el lugar
donde se definen las reglas de filtrado.
<br><br>
   <A HREF="../../common/images/article241/filt.jpg"><IMG
SRC="../../common/images/article241/filt.jpg" ALT="filters" width="186" height="216"></A></td>
<A HREF="../../common/images/article241/filtm.jpg"><IMG
SRC="../../common/images/article241/filtm.jpg" ALT="filters" width="174" height="216"></A></td>

<br><br>
Como puede notar, el proceso de configuraci&oacute;n es bastante f&aacute;cil y amigable
al usuario.
La meta fue, naturalmente, mostrarle que esto es parecido bajo GNUstep y
MacOS X.
</p>
<A NAME="241lfindex4">&nbsp;</A>
<H2>Usando GNUMail.app</H2>

<p>
El uso GNUMail.app es tan obvio que no deber&iacute;a necesitar un cap&iacute;tulo
especial.
Bajo MacOS X, s&oacute;lo de clic en el icono de GNUMail.app desde el Finder y
all&iacute; lo tiene. Usted,
por supuesto, obtendr&aacute; un nuevo icono en el dock donde puede conservarlo,
si as&iacute; lo desea.
Cuando la aplicaci&oacute;n est&eacute; funcionando, basta con hacer click en los iconos
de la parte superior del buz&oacute;n de correo (por defecto en el Inbox) para
borrar el mensaje, revisar o enviar su correo, abrir buzones diferentes,
redactar un nuevo mensaje, responder o reenviar un mensaje, abrir el libro
de direcciones o hacer una b&uacute;squeda en sus buzones de correo.
<br>
El men&uacute; principal le proporciona las mismas caracter&iacute;sticas y algunas
otras nuevas. Las opciones m&aacute;s importantes tienen teclas de acceso r&aacute;pido.
Este men&uacute; tambi&eacute;n trabaja como un men&uacute; emergente.
<br>
Bajo GNUstep, la &uacute;nica diferencia est&aacute; en la forma que corre la aplicaci&oacute;n
por
vez primera. Si est&aacute; usando GNUstep, sabe que debe escribir <i>openapp</i>
y la ruta de la aplicaci&oacute;n. Si tiene Window Maker como su administrador de
ventanas preferido (&iexcl; recomendado !), deber&aacute; conseguir un appicon: basta
con arrastrarlo al dock... y no tendr&aacute; que escribir m&aacute;s en su l&iacute;nea de
comandos para iniciar GNUMail.app.
<br>
Parece ser que GNUMail.app se ha hecho bastante estable. Hay una mejora
considerable
cuando se compara con versiones anteriores, especialmente bajo GNUstep.
Despu&eacute;s de unas semanas de uso, no he tenido una "colisi&oacute;n" en absoluto.
GNUMail.app es ahora perfectamente usable como su MailUserAgent diario.
<br>
Bajo MacOS X, ha sido bastante estable incluso antes de la versi&oacute;n 1.0.
</p>
<A NAME="241lfindex5">&nbsp;</A>
<H2>&iquest;Qu&eacute; sigue?</H2>

<p>
Podr&iacute;amos considerar GNUMail.app como un experimento de portabilidad. &iexcl;Pero
este es un experimento que trabaja! Naturalmente, muchos otros clientes de correo
tienen m&aacute;s
caracter&iacute;sticas. Sin embargo, GNUMail.app es la primera aplicaci&oacute;n
verdaderamente capaz de correr en ambientes tan diferentes como MacOS X y
GNUstep con absolutamente el mismo c&oacute;digo fuente. Ludovic est&aacute; trabajando
en otro proyecto y si &eacute;ste es menos avanzado que GNUMail.app es tambi&eacute;n de
mucho inter&eacute;s.
<br>
Lo llaman Affiche, y es una implementaci&oacute;n de "post-it", otra vez para
ambos
MacOS X y GNUstep. El sitio web tambien hospeda EastDiff, un diff gr&aacute;fico
de Pierre.Yves Rivaille, solamente corre bajo GNUstep, al menos por el
momento.
<br>
Si muchas personas fueron esc&eacute;pticas sobre la portabilidad entre MacOS X y
GNUstep, Ludovic proporciona la evidencia. Por supuesto, hay un largo
camino antes del &eacute;xito de GNUstep, sin embargo, la mejora es constante.
Debemos felicitar a toda la gente dedicada a GNUstep. La raz&oacute;n principal es
la enorme cantidad de trabajo requerida en el proyecto y la segunda es
porque hay muy pocas personas involucradas en esto. Muchas gracias a Adam
Fedor y amigos por esta gran pieza de software.
<br>
Una vez m&aacute;s, es obvio que cada desarrollo confiar&aacute; en el progreso de
GNUstep.
en este momento, hay muchass aplicaciones trabajando, aunque la mayor parte
de ellas
apenas inician. Otra forma de acelerar el proceso: la mayor parte
del
trabajo est&aacute; hecho bajo GNUstep, pero podemos esperar m&aacute;s desarrollo bajo
MacOS X
con la portabilidad en mente. Y, esto ser&iacute;a un gran punto de inicio para
aplicaciones multi-plataforma.
<br>
En un tiempo en que la "clonaci&oacute;n" Windows parece ser la regla,  es una
suerte  tener una alternativa. Si la "novedad" de hoy es la palabra
<i>open</i>, entonces GNUstep
es el modelo.
<br>
Una parte de la comunidad de Linux espera que su sistema se extienda en los
escritorios... o para alcanzar a &iexcl;&iexcl;&iexcl; "dominar al mundo" !!! entrar en
decadencia: un monopolio, sea libre o no, mantener un monopolio... y entre
otras cosas, el monopolio mata a la creaci&oacute;n.
La diversidad es mucho m&aacute;s importante ya que &eacute;sta crea imitaci&oacute;n, que no
significa "clonaci&oacute;n" de un pseudo est&aacute;ndar (y sus aplicaciones), como si su
editor poseyera
la verdad y se considerara una referencia absoluta.
<br>
Apr&oacute;ximadamente hace 15 a&ntilde;os, NeXTSTEP iniciaba una revoluci&oacute;n en el mundo
Unix: &iexcl;permitiendo a la gente usar Unix sin saber nada al respecto! Ahora
eso hace MacOS X. Y, en realidad, Linux est&aacute; lejos de este punto, a&uacute;n
clonando la referencia "incorrecta".
Usted podr&aacute; notar que GNUstep no es un clon Windows (&iexcl; al menos, lo dije !).
Es una implementaci&oacute;n libre del "hijo" (OpenStep) de uno de los, alguna
vez, m&aacute;s innovadores
 sistemas operativos (NeXTSTEP).
<br>
Para evitar la confusi&oacute;n, GNUstep es todo un marco de aplicaciones y llega
a ser un ambiente de escritorio (de peso ligero) tan pronto como a&ntilde;ade
aplicaciones... tales como GNUMail.app.
<br>
A&uacute;n m&aacute;s importante, GNUstep no est&aacute; limitado a Linux.
<br>
A mediados de los 80's, hab&iacute;a muchos y diferentes sistemas operativos.
Ahora, la alternativa
es Unix o Windows: es una pena. Sin embargo, yo preferir&iacute;a un mundo en el
que pudieramos escoger entre muchos sistemas: el mejor de los mejores.

<br>
Al menos, tenemos suerte: &iexcl; tenemos muchos Unixes diferentes, y la mayor&iacute;a
de &eacute;stos
son capaces de correr GNUstep !
<br>
Esta fue la habitual secci&oacute;n off topic, y solo representa mi opini&oacute;n.
<br>
Regreso a GNUMail.app, Podemos esperar obtener ideas de muchos
desarrolladores. Los usuarios Mac OS X tienen una gran oportunidad llamada
InterfaceBuilder (y ProjectBuilder).
El descubrimiento de estas herramientas cambiar&aacute; su vida. En un futuro ya
pr&oacute;ximo, podremos
esperar a Gorm y ProjectCenter para hacer lo mismo que sus modelos, de esta
manera hacer a GNUstep como debe ser.
<br>
Muchas gracias Ludovic por ense&ntilde;ar el camino.
<br>
&iexcl; Cuando se lo narr&eacute; a usted, nosotros viv&iacute;amos una &eacute;poca maravillosa !
</p>
<A NAME="241lfindex6">&nbsp;</A>
<H2>Enlaces</H2>

<p>
El sitio de GNUMail.app: <a href=
 "http://www.collaboration-world.com/gnumail/">http://www.collaboration-world.com/gnumail/</a>
<br>
Todo sobre GNUstep: <a href=
    "http://www.gnustep.org">http://www.gnustep.org</a>
<br>
A&uacute;n m&aacute;s acerca de GNUstep: <a href=
    "http://www.gnustep.net">http://www.gnustep.net</a>
<br>
Aplicaciones, tutoriales, HOWTOs por Nicola Pero y Pierre-Yves Rivaille:
<a
href="http://www.gnustep.it">http://www.gnustep.it</a>
<br>
Apple MacOS X Herramientas de desarrollo: <a
href="http://developer.apple.com/tools/macosxtools.html">http://developer.apple.com/tools/macosxtools.html</a>
</p>
<!-- vim: set sw=2 ts=2 et: -->
  


<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=241&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges     Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article241.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Georges Tarbouriech <small>&lt;georges.t(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Leo Trujillo Gomez &lt;aleogom(at)att.net.mx&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-05-07, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
