<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Applications">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Lorne     Bailey
 =LF=CAT___: Applications
 =LF=TITLE_: Probando KDE3
 =LF=NUMBER: 246
 =LF=ANAME_: article246.html
 -->
 <TITLE>lf246, Applications: Probando KDE3</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/LorneBailey.gif" width="178"
    height="200" alt="[Lorne Bailey]">
<BR>por  Lorne Bailey <br> <small>&lt;lorne(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<p>Lorne vive en Chicago y trabaja como consultor inform&aacute;tico
    especializado en transferencia de datos a y desde bases de datos Oracle.
    Desde que eligi&oacute; programar exclusivamente en un entorno *nix, Lorne
    ha evitado completamente el "infierno DLL". Actualmente est&aacute; trabajando
    en su tesis en Inform&aacute;tica. </p>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Roberto Hernando (<a href="http://rhernando.ya.st"><font size="1">homepage</font></a>)
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#246lfindex0">&iquest;Qu&eacute; es KDE3?</A></LI>
  <LI><A HREF="#246lfindex1">C&oacute;mo probarlo</A></LI>
  <LI><A HREF="#246lfindex2">&iquest;Cu&aacute;les son los riesgos?</A></LI>
  <LI><A HREF="#246lfindex3">&iquest;Qu&eacute; es lo bueno?</A></LI>
  <LI><A HREF="#246lfindex4">&iquest;Qu&eacute; hay que mejorar?</A></LI>
  <LI><A HREF="#246lfindex5">&iquest;Es m&aacute;s r&aacute;pido?</A></LI>
  <LI><A HREF="#246lfindex6">&iquest;Qu&eacute; hay del uso de memoria?</A></LI>
  <LI><A HREF="#246lfindex7">&iquest;Merece la pena?</A></LI>
  <LI><A HREF="#246lfindex8">Enlaces</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=246&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Probando KDE3</H2>
 <img src="../../common/images/article246/klogo.gif" width="181"
    height="122" alt="[kde]" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

    KDE acaba de publicar su &uacute;ltima versi&oacute;n, la 3. Este art&iacute;culo le ayudar&aacute;
    a saber si a usted mismo le gustar&iacute;a probarlo.
    Aunque el art&iacute;culo se basa en SuSE 7.3 hay disponibles binarios para
    casi todas las distribuciones.

    </P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="246lfindex0">&nbsp;</A>
<H2>&iquest;Qu&eacute; es KDE3?</H2>

    <a href="http://kde.org/whatiskde/index.html">KDE</a> es el escritorio
    por defecto para la mayor&iacute;a de las distribuciones linux como
    <a href="http://www.suse.com">SuSE</a> y <a href=
    "http://www.turbolinux.com/">Turbolinux</a>.
    Est&aacute; escrito en un lenguaje orientado a objetos llamado C++. Es una
    gran elecci&oacute;n para un interfaz de usuario gr&aacute;fico porque permite al
programador
    tomar muy f&aacute;cilmente peque&ntilde;as piezas de c&oacute;digo que sabe que funcionan
    y juntarlas en una aplicaci&oacute;n que funciona. KDE utiliza una librer&iacute;a
    llamada <a href=
    "http://www.trolltech.com/products/qt/index.html">QT</a>
    y KDE ha publicado <a href=
    "http://kde.org/announcements/announce-3.0.html">KDE3</a> para
    aprovecharse de las ventajas de la nov&iacute;sima versi&oacute;n de su librer&iacute;a de
base,
    QT3. Han hecho un gran trabajo y ahora utilizo KDE3 como mi escritorio
    a diario. <br>
    <a href="../../common/images/article246/snapshot_big.png"><img
    src="../../common/images/article246/snapshot_small.gif" width=
    "357" height="270" alt="[KDE3]" align="middle"></a> <br>


    <A NAME="246lfindex1">&nbsp;</A>
<H2>C&oacute;mo probarlo</H2>


    <p>Lo bueno de KDE3 es que puede probarlo y seguir usando KDE2
    si quiere. Si todav&iacute;a utiliza KDE1, &iexcl;tendr&iacute;a que actualizar su
distribuci&oacute;n
    inmediatamente!</p>

    <p>El problema para los usuarios de KDE1 es que la versi&oacute;n de KDE3
    empaquetada en los rpm usa el directorio ~/.kde, por lo que puede
    entrar en conflicto con KDE1. Puede remediarlo, con algo de esfuerzo. KDE
    se inicia en el directorio definido en la variable de entorno
        'KDEHOME', por lo que si la define antes de iniciar KDE deber&iacute;a
funcionarle.</p>

    <p>Puede descargar los ficheros para su distribuci&oacute;n desde el mirror
    que tenga m&aacute;s cercano de los recomendados por KDE:</p>

    <ul>
      <li><a href=
    "ftp://ftp.kde.org/pub/kde/stable/3.0">Europa</a></li>

      <li><a href=

"ftp://ibiblio.org/pub/packages/desktops/kde/stable/3.0/">Am&eacute;rica</a></li>

      <li><a href=
      "ftp://download.au.kde.org/pub/kde/stable/3.0">Australia</a></li>
    </ul>

    Uso SuSE 7.3, pero aqu&iacute; hay binarios para la mayor&iacute;a de las
distribuciones. <br>
    <br>

    <p>&iquest;Qu&eacute; impide a KDE3 interferir con las versiones anteriores? Los
    programas y librer&iacute;as van en sus propios directorios por lo que no se
    puede estropear nada cuando se intala. No es como con otros sistemas
    operativos que ponen todo en un loco `registro' que nadie comprende y
    que vuelve su m&aacute;quina inutilizable cuando se  <a
    href=
    "http://www.computerworld.com/storyba/0,4125,NAV47_STO65533,00.html">
    corrompe</a>, por ejemplo, recompilando c&oacute;digo. Esto supone un grave
problema
    cuando se vive de desarrollar software  y se est&aacute; recompilando
constantemente.
    En SuSE las librer&iacute;as de KDE3 van en /opt/kde3 y qt3 va en /usr/lib/qt3.
    Deber&iacute;a comprobar que no hay ning&uacute;n conflicto de dos formas: haciendo
    `rpm -qpl &lt;nombre-del-paquete.rpm&gt;` y viendo la lista de los
ficheros
    que contiene el paquete. Tambi&eacute;n, rpm deber&iacute;a darle un aviso antes de
    instalar cualquier cosa. </p>

    <p>Lo puede instalar muy f&aacute;cilmente utilizando rpm. Yo pongo todos
    los ficheros rpm que quiero instalar en un directorio aparte y escribo
    'rpm --install *.rpm'. Si hay un aviso de dependencias, instalo los
    paquetes necesarios y pruebo de nuevo. He obtenido un error de un
    fichero con conflictos entre KDE2 y KDE3. Cuando he verificado las
    diferencias, se trataba de dos caracteres en una l&iacute;nea de un script.
    No he pensado que fuese muy grave, por lo que he usado 'rpm
    --install --force *.rpm' y no he vuelto a tener un solo problema.</p>

    <p>Despu&eacute;s debe cambiar el administrador de acceso kdm. Vaya al Centro de
    Control KDE-&gt;Sistema-&gt;Administrador de acceso y a&ntilde;ada una sesi&oacute;n
    llamada kde3. Esto llamar&aacute; a /usr/X11R6/bin/kde3 que es un enlace al
    script de KDE que configura todo para que KDE3 se ejecute correctamente.
    KDE le preguntar&aacute; si quiere importar sus configuraciones de KDE2. Lo he
hecho
    un par de veces, y no ha importado el men&uacute; correctamente. No es un gran
    problema, pero es un inconveniente. Le recomendar&iacute;a que no utilizase su
    configuraci&oacute;n anterior y en su lugar elija la configuraci&oacute;n est&aacute;ndar.
Puede
    cambiarlo despu&eacute;s en el `editor de men&uacute;s` si quiere </p>

    <p>Esto deber&iacute;a funcionar.</p>

    <A NAME="246lfindex2">&nbsp;</A>
<H2>&iquest;Cu&aacute;les son los riesgos?</H2>

    En cualquier caso creo que es una buena idea hacer una copia peri&oacute;dica de
    todos los ficheros importantes. Afortunadamente, uno mueve los ficheros
    fuera de la m&aacute;quina - como quemando un CD, si es posible. Usted lo hace,
    &iquest;verdad? Sino, deber&iacute;a ser una tarea prioritaria tanto si va a probar KDE
como
    si no. <br>
    <br>

    <p>La forma realmente segura es esperar a que su distribuci&oacute;n
    incluya una actualizaci&oacute;n comprobada en un CD y seguir ese proceso.
    Realmente probar cosas nuevas no es algo para todo el mundo y s&oacute;lo
    porque yo no haya tenido problemas no quiere decir que usted no los
    vaya a tener. Veo el riesgo actual como muy peque&ntilde;o. He actualizado
    tres m&aacute;quinas diferentes y no habr&iacute;a corrido el riesgo de enfadar a sus
    due&ntilde;os si hubiera pensado que KDE3 podr&iacute;a arruinar sus m&aacute;quinas. Una vez
    dicho esto, como he mencionado anteriormente usted podr&iacute;a tener que
    forzar la instalaci&oacute;n en un conflicto de script. Si esto le pone
nervioso, deber&iacute;a
    hacer una copia de esos ficheros y restaurarlos en caso de tener
problemas.
    Probar la actualizaci&oacute;n supone algunos conocimientos b&aacute;sicos del sistema
que
    pueden ser intimidatorios. No a todo el mundo le gusta jugar con nuevo
software,
    lo que quieren es que las cosas funcionen.</p>

    <A NAME="246lfindex3">&nbsp;</A>
<H2>&iquest;Qu&eacute; es lo bueno?</H2>


    <ul>
      <li>Las reglas de Konsole. Tienen much&iacute;simas opciones
      que facilitan el no tener que usar el rat&oacute;n. Trabajo mucho
      con Konsole, por lo que es una gran ventaja para m&iacute;.</li>

      <li>El anti-aliasing de las fuentes funciona realmente bien,
      incluso para Konsole. KDE3 tiene muy buena
       <a href="../../common/images/article246/snapshot_big.png">pinta</a>.
       Parece bueno, tambi&eacute;n. Puede hacer men&uacute;s transparentes en el Centro
       de Control/LookNfeel/Estilo/Efectos Activar Efectos Gr&aacute;ficos, aunque
aparentemente
       es necesario reiniciar KDE3. Puede cambiar la apariencia de Konsole con
       muchos esquemas incluidos. Hay algunos tem&aacute;s m&aacute;s, tambi&eacute;n.</li>

      <li>KDE ahora tiene un paginador, Kpage. Puede arrastar y soltar
aplicaciones
      de un escritorio a otro.</li>

      <li>Puede pasar directamente de una ventana a otra mediante Alt-Tab
      y escribir directamente en la ventana activa sin tener que pulsar en el
&aacute;rea
      de texto.</li>

      <li>La secci&oacute;n &Eacute;dutainment' trae algunos grandes programas como KTouch
      que es un programa que le permite practica ejercicios de escritura a
m&aacute;quina.
      Realmente necesito mejorar algo en esto (como quiz&aacute;s ha apreciado en
este
      art&iacute;culo), y esto me ha ayudado mucho. Tiene un peque&ntilde;o planetario
llamado
      KStarts que es estupendo y no hay que olvidar el programa de geometr&iacute;a
KGeo.</li>

      <li>No hay que aprender nada nuevo porque funciona como KDE2, s&oacute;lo que
mejor.</li>
    </ul>

    <A NAME="246lfindex4">&nbsp;</A>
<H2>&iquest;Qu&eacute; hay que mejorar?</H2>

    No he encontrado ning&uacute;n error grave ni he sufrido ning&uacute;n tipo de p&eacute;rdida
    de datos. S&oacute;lo puedo mencionar unas pocas cosas que encuentro molestias
    menores, seguro que debidas parcialmente a mi propia ignorancia.

    <ul>
      <li>A veces el cierre de sesi&oacute;n dura una eternidad. Esto siempre
      hab&iacute;a sido lo que m&aacute;s me molestaba con KDE y parece que ha reaparecido.
      Me gustar&iacute;a al menos ver oscurecerse la pantalla con lo que sabr&iacute;a que
      est&aacute; trabajando en ello. Tambien, KDE3 se vuelve muy confuso cuando
      el paginador Kpager est&aacute; abierto - debe cerrar la sesi&oacute;n de nuevo.</li>

      <li>No he conseguido que kdm abra un escritorio correctamente.
      Presenta la pantalla de conexi&oacute;n correctamente, pero s&oacute;lo me muestra
      el fondo gris de X Windows. Debe ser un problema de configuraci&oacute;n, pero
      no doy con ello. Sigo usando el viejo kdm sin problemas.</li>

      <li>No funciona la importaci&oacute;n de Men&uacute; desde KDE2, pierde
      los comandos espec&iacute;ficos de la distribuci&oacute;n, como el yast2 de SuSE.
      Cuando KDE3 venga precompilado en las distribuciones estoy  seguro
      de que todo esto volver&aacute; a funcionar.</li>

      <li>A veces usando el foco de ventana KDE s&oacute;lo puede cambiar entre dos
      ventanas a un tiempo mediante Alt-Tab. Esto me molesta porque
      trabajo editando muchos ficheros usando Konsole, Konqueror y gvim.
      S&oacute;lo puedo cambiar entre las dos &uacute;ltimas ventanas que he usado.
      Pero sin embargo, esto funciona bien en otras sesiones, lo que es un
poco
      mosqueante. Puede elegir el estilo CDE, con lo que no todo est&aacute;
perdido.</li>

      <li>Algunos se quejan de la velocidad y del tama&ntilde;o. Esto no es un
      problema para m&iacute;, por lo que no me quejo. Sin embargo, si sus recursos
      son limitados entonces deber&iacute;a usar un escritorio menos elaborado.
Presento
      algunas cifras un poco despu&eacute;s.</li>
    </ul>

    <A NAME="246lfindex5">&nbsp;</A>
<H2>&iquest;Es m&aacute;s r&aacute;pido?</H2>

    A lo que se refiere la gente cuando preguntan sobre la velocidad
    es a su percepci&oacute;n de la velocidad. Cada uno tiene sus propias (y, a
veces,
    en&eacute;rgicas) ideas sobre la velocidad y sobre el mejor gestor de ventanas/
    editor de texto. No estoy interesado en discusiones sin sentido. Ah&iacute; est&aacute;n
    mis mejores estimaciones del tiempo despu&eacute;s de muchas pruebas. Su
    experiencia puede ser diferente. S&eacute; que existen montones de gestores
    de ventanas ah&iacute; fuera, pero he pensado que comprobando estos ya se podr&iacute;a
    dar una idea general. He encontrado KDE suficientemente r&aacute;pido, pero
    me he dado cuenta de que algunos gestores de ventanas lanzan las
    aplicaciones incluso m&aacute;s r&aacute;pido. Comencemos con los tiempos de
    inicio.
    <br>
    <br>

    <table align="center" border="1">
      <caption>
        Velocidad de Inicio
      </caption>

      <tr>
        <td>Aplicaci&oacute;n</td>

        <td>Enlightenment</td>

        <td>Gnome</td>

        <td align="center">KDE2</td>

        <td>KDE3</td>
      </tr>

      <tr>
        <td>Inicio desde consola</td>

        <td>7</td>

        <td>12</td>

        <td>16</td>

        <td>18</td>
      </tr>

      <tr>
        <td>Inicio desde kdm</td>

        <td>3</td>

        <td>10</td>

        <td>10</td>

        <td>12</td>
      </tr>

      <tr>
        <td>Navegador</td>

        <td>*</td>

        <td>X</td>

        <td>2.5</td>

        <td>2.5</td>
      </tr>

      <tr>
        <td>Terminal</td>

        <td>&lt;1</td>

        <td>1</td>

        <td>1.5</td>

        <td>1.5</td>
      </tr>

      <tr>
        <td>Cliente de Correo</td>

        <td>*</td>

        <td>5</td>

        <td>2</td>

        <td>2.5</td>
      </tr>

      <tr>
        <td>Media Player</td>

        <td>1</td>

        <td>1</td>

        <td>2.5</td>

        <td>3</td>
      </tr>

      <tr>
        <td colspan="5">X - No me funciona porque lo he alterado.
        * - No Aplicable.</td>
      </tr>
    </table>

    <p>Para Gnome he usado Evolution como cliente de correo. Tiene
    muchas funcionalidades, por lo que esperaba que arrancara lentamente.
    Adem&aacute;s, desde que actualic&eacute; Mozilla, Galeon dej&oacute; de funcionarme.</p>



    <p>No me importa esperar ese segundo extra cuando lanzo una aplicaci&oacute;n
    porque es sencillo utilizar KDE de la forma que yo quiero usarlo. Aqu&iacute; es
    donde intervienen sus preferencias y necesidades personales. Me gusta
    Konsole m&aacute;s que eterm. Despu&eacute;s de que he iniciado un pu&ntilde;ado de
aplicaciones
    y llevo horas us&aacute;ndolas el tiempo de arranque no tiene ninguna importancia
    para m&iacute;.</p>

    <A NAME="246lfindex6">&nbsp;</A>
<H2>&iquest;Qu&eacute; hay del uso de memoria?</H2>

    Lo he comprobado un poco usando Ksysguard y aqu&iacute; est&aacute;n las mediciones:

    <table align="center" border="1">
      <caption>
        Tama&ntilde;o de memoria
      </caption>

      <tr>
        <td>Aplicaci&oacute;n</td>

        <td colspan="2" align="center">KDE2</td>

        <td align="center" colspan="2">KDE3</td>
      </tr>

      <tr>
        <td>Konqueror</td>

        <td>29,358</td>

        <td>19,128</td>

        <td>35,968</td>

        <td>24,944</td>
      </tr>

      <tr>
        <td>Kicker</td>

        <td>24,340</td>

        <td>13,820</td>

        <td>26,708</td>

        <td>15,644</td>
      </tr>

      <tr>
        <td>KDesktop</td>

        <td>23,608</td>

        <td>13,156</td>

        <td>28,580</td>

        <td>17,972</td>
      </tr>

      <tr>
        <td>Klipper</td>

        <td>22,848</td>

        <td>11,096</td>

        <td>24,672</td>

        <td>13,224</td>
      </tr>

      <tr>
        <td>Kwin</td>

        <td>21,976</td>

        <td>11,200</td>

        <td>22,920</td>

        <td>11,064</td>
      </tr>
    </table>
    Como puede ver, toma mucha m&aacute;s memoria que KDE2. Si est&aacute; justo
    de memoria, una actualizaci&oacute;n no le va a ayudar. Sin embargo, ya que
    la memoria RAM es barata no es un gran problema para mucha gente.
    Creo que si tiene 128 MB deber&iacute;a irle bien.

    <A NAME="246lfindex7">&nbsp;</A>
<H2>&iquest;Merece la pena?</H2>

    He intentado darle suficiente informaci&oacute;n para que decida si
    satisface KDE3 sus necesidades particulares. Lo he probado en 3
    m&aacute;quinas diferentes y no he encontrado todav&iacute;a un problema importante.
    Si es el tipo de persona que no le importa hacer algo de trabajo de
Administrador
    del Sistema y le gusta experimentar con aplicaciones nuevas, creo que
    le gustar&aacute; KDE3. Si est&aacute; buscando un mantenimiento muy reducido del
    estilo `s&oacute;lo quiero ocuparme de mi trabajo` entonces s&oacute;lo har&iacute;a
actualizaciones
    por motivos de seguridad y no me preocupar&iacute;a por esto. Personalmente
    uso KDE3 como mi escritorio a diario <i>(N.T. yo tambi&eacute;n :)</i> porque
    me hace la vida m&aacute;s f&aacute;cil. Es lo que espero de mi escritorio. Creo que
debe
    probarlo para darse cuenta de si es lo que necesita.

    <A NAME="246lfindex8">&nbsp;</A>
<H2>Enlaces</H2>


    <ul>
      <li><a href="http://kde.org">KDE</a></li>

      <li><a href="http://kde.org/ftpmirrors.html">Mirrors FTP KDE</a></li>

      <li><a href=
      "http://www.trolltech.com/products/qt/index.html">Trolltech -
      QT</a></li>
    </ul>
  






<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=246&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Lorne     Bailey, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article246.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Lorne Bailey <small>&lt;lorne(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Roberto Hernando (<a href="http://rhernando.ya.st"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-06-04, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
