<HTML>
<HEAD>
<TITLE>Linux COMO Servidor de Intranets: Nota del Traductor.</TITLE>
</HEAD>
<BODY>
<A HREF="Servidor-Intranet-Como-8.html">Anterior</A>
<A HREF="Servidor-Intranet-Como-10.html">Siguiente</A>
<A HREF="Servidor-Intranet-Como.html#toc9">Indice</A>
<HR>
<H2><A NAME="s9">9. Nota del Traductor.</A></H2>


<P>Mi nombre es Salvador Fern&aacute;ndez Barqu&iacute;n, formo parte del proyecto
LUCAS/INSFLUG. Este documento es mi aportaci&oacute;n al terreno de uso de Linux
como Servidor de Intranet.</P>
<P>Linux es el sistema operativo del presente y del futuro, su permanencia
esta garantizada por cientos de programadores de todo el mundo que, en un
esfuerzo sin precedentes se han dedicado a construir una plataforma de
trabajo estable, libre y completa. Ese futuro est&aacute; garantizado por su
licencia GNU que asegura que el programa binario venga acompa&ntilde;ado de sus
fuentes; de esta forma, los programas nunca quedar&aacute;n en el olvido y
siempre habr&aacute; alguien en el mundo que los pueda corregir, ampliar o darles
mantenimiento.</P>
<P>Este documento es mi aportaci&oacute;n para que el proyecto Linux sea cada vez
m&aacute;s grande y conocido entre nosotros los que hablamos la lengua de
Cervantes, y ahora que la integraci&oacute;n de Servidores Intranet en las
Universidades, Tecnol&oacute;gicos, Empresas y Corporaciones es una realidad
palpable, Linux es una soluci&oacute;n real y tangible. </P>
<P>Particularmente espero que este documento sea de ayuda e inter&eacute;s a todos
aquellos que deseen implementar una Intranet Educacional, Institucional o
Corporativa con Linux. </P>
<P>Hay mucho por traducir, y tambi&eacute;n hay muchos documentos traducidos, visite
<CODE>
<A HREF="http://lucas.ctv.es">http://lucas.ctv.es</A></CODE> o el INSFLUG, <CODE>
<A HREF="www.insflug.org">www.insflug.org</A></CODE> (secci&oacute;n 
<A HREF="Servidor-Intranet-Como-10.html#Grupos">Grupos</A>)
o los m&uacute;ltiples
servidores r&eacute;plica para conocer m&aacute;s sobre este proyecto u obtener otros
documentos en castellano.</P>
<P>No esta de m&aacute;s decir que he intentado ajustarme lo mayor posible al
original de Pramod Karnad y he revisado la traducci&oacute;n un par de veces. No
obstante a&uacute;n puede quedar algo por pulir o se me ha podido colar alguna
errata, de cuya responsabilidad me hago cargo, pero jam&aacute;s del buen o mal
uso que pueda derivar la lectura de este documento. </P>
<P>Para cualquier comentario, errata o consulta sobre la traducci&oacute;n, m&aacute;ndeme
un correo electr&oacute;nico a: <CODE>
<A HREF="mailto:sferbar@internetica.net.mx">sferbar@internetica.net.mx</A></CODE></P>
<P>Un saludo,</P>
<P><I>Salvador Fern&aacute;ndez Barqu&iacute;n</I>.</P>
<P>Nota: En los mensajes de los sistemas operativos que se conjugan con Linux
como clientes en este documento, me he basado en las versiones en
castellano que circulan en Espa&ntilde;a e Iberoam&eacute;rica. </P>

<HR>
<A HREF="Servidor-Intranet-Como-8.html">Anterior</A>
<A HREF="Servidor-Intranet-Como-10.html">Siguiente</A>
<A HREF="Servidor-Intranet-Como.html#toc9">Indice</A>
</BODY>
</HTML>
