<HTML>
<HEAD>
<TITLE>EL C&Oacute;MO DEL UMSDOS: Instalaci&oacute;n/Desinstalaci&oacute;n y algunos truquillos</TITLE>
</HEAD>
<BODY>
<A HREF="Umsdos-Como-5.html">Anterior</A>
<A HREF="Umsdos-Como-7.html">Siguiente</A>
<A HREF="Umsdos-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Instalaci&oacute;n/Desinstalaci&oacute;n y algunos truquillos</A></H2>

<P>La instalaci&oacute;n de un sistema basado en <CODE>umsdos</CODE> no difiere
gran cosa de la instalaci&oacute;n de un sistema <EM>Linux</EM>
ordinario (basado en <EM>Ext2</EM>).</P>
<P>Hay dos diferencias fundamentales.</P>

<H2><A NAME="ss6.1">6.1 La pseudorra&iacute;z <CODE>/mnt/linux</CODE></A></H2>

<P>Los pasos normales de una instalaci&oacute;n son</P>
<P>
<OL>
<LI>Hacer una partici&oacute;n con <CODE>fdisk</CODE> y formatearla.</LI>
<LI>Montarla en el directorio <CODE>/mnt</CODE> de nuestro disco ra&iacute;z de
instalaci&oacute;n.</LI>
<LI>Copiar todos los paquetes en <CODE>/mnt</CODE>.</LI>
</OL>
</P>
<P>El paso 1 no es necesario con <CODE>umsdos</CODE> (¿acaso no era el objetivo
de <CODE>umsdos</CODE> no tener que reformatear?).</P>
<P>Es posible instalar un sistema <CODE>umsdos</CODE> simplemente copiando
todos los paquetes en <CODE>/mnt</CODE>. Funcionar&iacute;a, pero crear&iacute;a
una ristra de subdirectorios en el directorio ra&iacute;z del <EM>DOS</EM>
(<CODE>C:</CODE>) y no ser&iacute;a agradable. Esa es la raz&oacute;n por la que todas
las instalaciones con <CODE>umsdos</CODE> usan la pseudorra&iacute;z. Y es la
gran diferencia entre una instalaci&oacute;n normal con <EM>Ext2</EM> y una
con <CODE>umsdos</CODE>: Los ficheros se copian en <CODE>/mnt/linux</CODE>.</P>


<H2><A NAME="ss6.2">6.2 Preparar <CODE>/mnt/linux</CODE></A></H2>

<P><CODE>/mnt/linux</CODE> no es un directorio ordinario. Tiene que ser
promovido para que maneje correctamente los nombres largos
de <EM>Linux</EM> y los ficheros especiales (enlaces, dispositivos).
Los pasos requeridos para poner a punto <CODE>/mnt/linux</CODE> son:</P>
<P>
<OL>
<LI><CODE>mkdir /mnt/linux</CODE></LI>
<LI><CODE>umssync /mnt/linux</CODE></LI>
</OL>
</P>
<P>¡Y ya est&aacute;!</P>


<H2><A NAME="ss6.3">6.3 Asegurarse de que <CODE>/mnt/linux/</CODE> est&aacute; correctamente configurado.</A></H2>

<P>A pesar de que la puesta a punto de <CODE>/mnt/linux</CODE> es muy
sencilla, hay circulando por ah&iacute; muchos paquetes de instalaci&oacute;n
que lo hacen mal. ¿C&oacute;mo es posible?</P>
<P>El problema de instalaci&oacute;n m&aacute;s importante suele provenir
del uso de versiones incompatibles del programa <CODE>umssync</CODE>.
<CODE>umsdos</CODE> fue actualizado en Linux 1.1.88
(No lo recuerdo con exactitud) y qued&oacute; un fallo
en <CODE>umssync</CODE>. Para evitar confusi&oacute;n entre la
comunidad de <EM>Linux</EM>, se decidi&oacute; incrementar el
nivel de compatibilidad requerido para todas las
herramientas de <CODE>umsdos</CODE>. Las antiguas versiones
de las utilidades fueron simplemente rechazadas.</P>
<P>Parece que muchas distribuciones no han actualizado
el <CODE>umssync</CODE> de sus disquetes de instalaci&oacute;n.
</P>
<P>Todav&iacute;a hay muchas distribuciones en ese estado por ah&iacute;. El
resultado de hecho es que el directorio <CODE>/mnt/linux</CODE> no
se promueve y se truncan todos los nombres largos de fichero y
se rechazan todos los ficheros especiales.</P>
<P>Es posible comprobar si algo ha ido mal en los primeros momentos
de la instalaci&oacute;n. Gracias al mecanismo de pseudoconsolas de
<EM>Linux</EM> se puede hacer sin salir del programa de instalaci&oacute;n.
Hay que seguir los siguientes pasos:</P>
<P>
<OL>
<LI>Pulsar <CODE>Alt-F2</CODE> (la tecla <CODE>Alt</CODE> al mismo tiempo
que la tecla <CODE>F2</CODE>).</LI>
<LI>entrar como superusuario (<CODE>root</CODE>).</LI>
<LI><CODE>cd /mnt/linux</CODE>

Si eso falla, es que se est&aacute; haciendo demasiado pronto.
Al terminar la selecci&oacute;n de paquetes es un buen momento
para hacerlo.</LI>
<LI><CODE>>TOTO</CODE></LI>
<LI><CODE>ls -l</CODE>

Deber&iacute;a aparecer un fichero vac&iacute;o llamado <CODE>TOTO</CODE> en letras
may&uacute;sculas. Si aparece en min&uacute;sculas algo ha ido mal.
Intentaremos ejecutar <CODE>umssync</CODE> de nuevo.
<CODE>umssync</CODE> puede usarse una y otra vez sin ning&uacute;n problema.

<CODE>umssync .</CODE> <BR>(el punto es parte de la orden) <BR>Si no aparece ning&uacute;n mensaje de error, volveremos a hacer
la comprobaci&oacute;n del <CODE>TOTO</CODE>. Si aparece <CODE>TOTO</CODE>
correctamente todo est&aacute; bien. La instalaci&oacute;n tiene algo
extra&ntilde;o, pero lo hemos solucionado.
</LI>
<LI>Pulsar <CODE>Alt-F1</CODE> para volver a la pantalla de instalaci&oacute;n.</LI>
</OL>
</P>
<P>Si la comprobaci&oacute;n falla, la mejor soluci&oacute;n es hacerse con
un disco de instalaci&oacute;n m&aacute;s moderno. Normalmente se puede
arreglar el disco ra&iacute;z de instalaci&oacute;n poni&eacute;ndole una
versi&oacute;n m&aacute;s moderna de <CODE>umssync</CODE>. No es dif&iacute;cil, pero
se requiere un sistema <EM>Linux</EM> en funcionamiento. Simplemente
hay que montar el disco ra&iacute;z y reemplazar el <CODE>umssync</CODE>
problem&aacute;tico por uno nuevo.
</P>


<H2><A NAME="ss6.4">6.4 <CODE>Oops releasing pseudo root ...</CODE></A></H2>

<P>La mayor parte de las instalaciones <CODE>umsdos</CODE> que fallan
lo hacen mostrando ese curioso mensaje. Por muy extra&ntilde;o que
parezca el mensaje, no se trata de un bug (<EM>error</EM>) en
<CODE>umsdos</CODE>. Estas son las causas conocidas:</P>
<P>
<UL>
<LI>La m&aacute;s com&uacute;n

La instalaci&oacute;n de <EM>Slackware</EM> trata de configurar un
fichero de intercambio (<EM>swap</EM>) en los primeros momentos
de la instalaci&oacute;n.  Para hacerlo, pide que se seleccione
una partici&oacute;n (un disco del DOS), entonces lo monta y
configura el fichero de intercambio.

Cuando se instala un sistema <EM>Slackware</EM>, se debe
configurar la partici&oacute;n receptora antes de instalar nada.
Esto normalmente significa que se monta la partici&oacute;n 
<EM>DOS</EM> en <CODE>/mnt</CODE>, se crea el directorio
<CODE>/mnt/linux</CODE>, y se le aplica <CODE>umssync</CODE>.

De ah&iacute; es de donde viene la mayor parte de los problemas.
La mayor&iacute;a de los usuarios olvidan el paso de 
"configuraci&oacute;n de la partici&oacute;n receptora" (<EM>"setup target
partition"</EM>) y pasan sin m&aacute;s al resto de la instalaci&oacute;n.
Como <CODE>/mnt</CODE> est&aacute; ya montado, este error pasa
desapercibido.
Eso significa que <CODE>/mnt/linux</CODE> no ha sido creado
adecuadamente (No ha sido promovido). Ning&uacute;n fichero 
especial, ni enlace, ni fichero con nombre largo se 
podr&aacute; crear correctamente.
</LI>
<LI>Programa <CODE>umssync</CODE> no v&aacute;lido

No se ha creado <CODE>/mnt/linux</CODE> correctamente. Esto est&aacute;
generalmente causado por un programa <CODE>umssync</CODE>
inadecuado en el disco de instalaci&oacute;n ra&iacute;z.
</LI>
<LI>Un antiguo error en <CODE>umsdos</CODE>
<P>Hab&iacute;a un error en <CODE>umsdos</CODE> previo a <EM>Linux 1.2.2</EM>.
El modo pseudo-root no se activaba adecuadamente si no
exist&iacute;a el fichero <CODE>/etc/init</CODE>. Ahora <CODE>init</CODE>
se ubica en <CODE>/sbin</CODE>. Se puede solucionar esto
haci&eacute;ndose con un nuevo n&uacute;cleo. Eso es lo recomendado
puesto que hab&iacute;a otro error que se solucion&oacute; en la
versi&oacute;n 1.2.2.</P>
<P>Si no es posible la actualizaci&oacute;n, habr&aacute; que hacer lo
siguiente</P>
<P>
<OL>
<LI>Arrancar con el disquete de instalaci&oacute;n.</LI>
<LI>Entrar como superusuario.</LI>
<LI><CODE>mount -t umsdos /dev/hdXX /mnt</CODE>

Donde <CODE>/dev/hdXX</CODE> es la partici&oacute;n <EM>DOS</EM>.</LI>
<LI><CODE>cd /mnt/linux/etc</CODE></LI>
<LI><CODE>ln -s ../sbin/init init</CODE></LI>
<LI><CODE>cd /</CODE></LI>
<LI><CODE>Ctrl-Alt-Del</CODE></LI>
<LI>Arrancar el sistema <CODE>umsdos</CODE> normalmente.</LI>
</OL>
</P>
</LI>
</UL>
</P>
<P>Por desgracia, los dos primeros problemas de instalaci&oacute;n producen
una instalaci&oacute;n completamente inservible. Se debe desinstalar
(V&eacute;ase la secci&oacute;n siguiente) y volver a instalar.</P>


<H2><A NAME="ss6.5">6.5 C&oacute;mo DESinstalar un sistema <CODE>umsdos</CODE></A></H2>

<P>Una cosa que sorprende agradablemente de <CODE>umsdos</CODE> y su
mecanismo de pseudorra&iacute;z es que se puede DESinstalar sin
problemas. Simplemente hay que arrancar en <EM>DOS</EM> y borrar
recursivamente el directorio <CODE>linux</CODE>. Eso es todo. <CODE>umsdos</CODE>
no requiere ning&uacute;n controlador especial en el config.sys, ni
crea nada extra&ntilde;o fuera del directorio <CODE>linux</CODE>.</P>



<H2><A NAME="ss6.6">6.6 Mover un sistema <CODE>umsdos</CODE> a otro disco <EM>DOS</EM></A></H2>

<P>Se puede hacer desde <EM>Linux</EM> o desde <EM>DOS</EM>.  S&oacute;lamente hay
que copiar recursivamente el directorio <CODE>linux</CODE> de un disco al
otro. Despu&eacute;s hay que ajustar el sistema de arranque (generalmente
el programa loadlin) y el fichero <CODE>/etc/fstab</CODE>.</P>
<P><CODE>umsdos</CODE> puede vivir en cualquier disco <EM>DOS</EM>. No hay necesidad
de instalarlo en el disco <CODE>C:</CODE>, ni en el primer disco duro.
No importa en absoluto.</P>
<P>De hecho, se puede decidir tener varias instalaciones <CODE>umsdos</CODE>
en distintos discos simplemente para experimentar.</P>


<H2><A NAME="ss6.7">6.7 C&oacute;mo instalar 50 sistemas con <CODE>umsdos</CODE></A></H2>

<P>¿Y si instalamos un mont&oacute;n de sistemas <EM>Linux</EM> en un santiam&eacute;n?</P>
<P>Los sistemas <CODE>umsdos</CODE> viven en un mundo <EM>DOS</EM>. Se puede
sacar provecho de esto si se quiere instalar <EM>Linux</EM> f&aacute;cilmente.</P>
<P>Se puede instalar y configurar un sistema con <CODE>umsdos</CODE> en
un ordenador, y, cuando se est&aacute; satisfecho con la configuraci&oacute;n
y los distintos paquetes seleccionados, arrancar en <EM>DOS</EM> y
copiar el directorio <CODE>linux</CODE> completo al servidor de ficheros
de <EM>DOS</EM> (en caso de que exista, claro. Tal vez un 
PC-NFS). Entonces se va a otro ordenador con <EM>DOS</EM> y simplemente
se copian los ficheros del disco de red al disco duro local.
Eso es todo. S&oacute;lamente habr&aacute; que ajustar el fichero .bat de
arranque (<EM>Loadlinx</EM>) y ya.</P>
<P>Con unos ajustes m&iacute;nimos (nombre de la m&aacute;quina, direcci&oacute;n IP),
cualquiera puede instalar un sistema <EM>Linux</EM> en un minuto.</P>
<P>Los lectores interesados apuntar&aacute;n que instalar un sistema
<EM>Linux</EM> copiando un sistema en funcionamiento tambi&eacute;n 
sirve para cualquier otro tipo de sistema <EM>Linux</EM>, incluyendo
los basados en <EM>Ext2</EM>.</P>
<P>Una de las bellezas de <EM>Linux</EM> es que no hay fichero ocultos
que tengan que ser instalados por un m&aacute;gico programa de instalaci&oacute;n.</P>


<HR>
<A HREF="Umsdos-Como-5.html">Anterior</A>
<A HREF="Umsdos-Como-7.html">Siguiente</A>
<A HREF="Umsdos-Como.html#toc6">Indice</A>
</BODY>
</HTML>
