<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>mini-COMO: La abogac&iacute;a por Linux : Promoci&oacute;n del uso de Linux</TITLE>
 <LINK HREF="Abogacia-Por-Linux-Como-6.html" REL=next>
 <LINK HREF="Abogacia-Por-Linux-Como-4.html" REL=previous>
 <LINK HREF="Abogacia-Por-Linux-Como.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="Abogacia-Por-Linux-Como-6.html">Página siguiente</A>
<A HREF="Abogacia-Por-Linux-Como-4.html">Página anterior</A>
<A HREF="Abogacia-Por-Linux-Como.html#toc5">Índice general</A>
<HR>
<H2><A NAME="s5">5. Promoci&oacute;n del uso de Linux</A></H2>

<P>
<P>
<UL>
<LI>Comparta sus experiencias personales (buenas o malas) con Linux. 
Todo el mundo sabe que el software tiene errores y limitaciones y si s&oacute;lo
tenemos comentarios resplandecientes acerca de Linux, no estar&iacute;amos siendo
honestos. A m&iacute; me encanta comentarle a la gente acerca de mis cuatro
reinicializadas (de tres programadas) del sistema en tres a&ntilde;os.
</LI>
<LI>Si alguien tiene un problema que Linux puede resolver, ofr&eacute;zcase
para proporcionarle referencias a la informaci&oacute;n apropiada (p&aacute;ginas web,
art&iacute;culos de revistas, libros, consultores, etc....). Si no ha llevado a
cabo la soluci&oacute;n propuesta, expr&eacute;sese en tal sentido. 
</LI>
<LI>Si se encuentra disponible para hacer presentaciones acerca de Linux
reg&iacute;strese en <CODE>
<A HREF="http://www.ssc.com/linux/lsb.html">http://www.ssc.com/linux/lsb.html</A></CODE>. 
</LI>
<LI>Ofrezca su ayuda a quien est&eacute; comenzando a usar Linux. H&aacute;gale un
seguimiento para asegurarse que pudo usar el sistema de manera efectiva.
</LI>
<LI>Algunas personas todav&iacute;a creen que Linux y sistemas similares operan
&uacute;nicamente en modo texto. H&aacute;galos conscientes de la disponibilidad de
aplicaciones gr&aacute;ficas como <CODE>Gimp</CODE>, <CODE>
<A HREF="http://www.gimp.org/">http://www.gimp.org/</A></CODE>. 
</LI>
<LI>Trate de responder a alg&uacute;n novato de las listas de noticias. Busque
las preguntas dif&iacute;ciles, puede ser el &uacute;nico que responda, aprendiendo
mucho en el proceso. Sin embargo, si no se tiene la confianza de poder
responder con la soluci&oacute;n correcta, busque a alguien m&aacute;s que s&iacute; pueda. 
</LI>
<LI>Busque peque&ntilde;as firmas desarrolladoras de software y ofr&eacute;zcales
realizar una presentaci&oacute;n acerca de Linux. 
</LI>
<LI>Si la oportunidad se presenta, haga una presentaci&oacute;n al grupo de
Inform&aacute;tica de su empleador.
</LI>
<LI>Si necesita una aplicaci&oacute;n que no est&eacute; soportada por Linux, contacte
con el vendedor y p&iacute;dale una versi&oacute;n nativa de Linux. 
</LI>
<LI>Participe en eventos de la comunidad como el <I>NetDay96</I>
<CODE>
<A HREF="http://www.netday96.com">http://www.netday96.com</A></CODE>. Manteniendo como prioridad la de
contribuir con el &eacute;xito del evento, use la oportunidad para permitir que
otros conozcan lo que Linux puede hacer por ellos. 
</LI>
<LI>Considere siempre los puntos de vista de la persona a quien le est&eacute;
«vendiendo» Linux. Soporte, fiabilidad, interoperabilidad y costo son
factores que un tomador de decisiones debe tener en cuenta. De los
anteriores puntos, el coste es generalmente la parte menos importante de
la ecuaci&oacute;n. 
</LI>
<LI>La disponibilidad de soporte es, frecuentemente mencionada, una
preocupaci&oacute;n cuando se considera la adopci&oacute;n de Linux.  Compa&ntilde;&iacute;as tales
como 

<UL>
<LI><I>Caldera</I>, <CODE>
<A HREF="http://www.caldera.com/">http://www.caldera.com/</A></CODE>
</LI>
<LI><I>Cygnus Solutions</I>, <CODE>
<A HREF="http://www.cygnus.com/">http://www.cygnus.com/</A></CODE>
</LI>
<LI><I>Red Hat</I>, <CODE>
<A HREF="http://www.redhat.com/">http://www.redhat.com/</A></CODE>
</LI>
<LI><I>S.u.S.E</I>, <CODE>
<A HREF="http://www.suse.com/">http://www.suse.com/</A></CODE></LI>
</UL>


ofrecen soporte para algunos o todos los componentes de una distribuci&oacute;n
t&iacute;pica de Linux. Adicionalmente, el COMO <I>Linux Consultants HOWTO</I>,
<CODE>
<A HREF="http://sunsite.unc.edu/LDP/HOWTO/Consultants-HOWTO.html">http://sunsite.unc.edu/LDP/HOWTO/Consultants-HOWTO.html</A></CODE>
incluye un listado de compa&ntilde;&iacute;as proveedoras de soporte relacionado con
Linux. Por supuesto, algunos de los mejores soportes se encuentran en el
grupo de noticias <CODE>
<A HREF="news:comp.os.linux">news:comp.os.linux</A></CODE> y en los grupos de noticias que contienen
la palabra <CODE>linux</CODE>. 
</LI>
<LI>Haga notar que la producci&oacute;n de software de c&oacute;digo abierto tiene
lugar en un ambiente de colaboraci&oacute;n abierta entre ingenieros de sistemas,
programadores, escritores, probadores alfa y beta y usuarios finales, lo
cual frecuentemente da como resultado productos robustos y bien
documentados tales como Apache, <CODE>
<A HREF="http://www.apache.org/">http://www.apache.org/</A></CODE>, GNU Emacs, <CODE>
<A HREF="http://www.gnu.org/">http://www.gnu.org/</A></CODE>, Perl,
<CODE>
<A HREF="http://www.perl.com/">http://www.perl.com/</A></CODE>
o el n&uacute;cleo de linux, <CODE>
<A HREF="http://www.linuxhq.com/">http://www.linuxhq.com/</A></CODE>.
</LI>
<LI>P&oacute;ngase de pie y d&eacute;jese contar! Reg&iacute;strese en el <I>Contador de
Linux</I>: <CODE>
<A HREF="http://counter.li.org/">http://counter.li.org/</A></CODE>. 
</LI>
<LI>Comunique los esfuerzos exitosos en la promoci&oacute;n de Linux a
<I>Linux International</I> (<CODE>
<A HREF="mailto:li@li.org">li@li.org</A></CODE>) y organizaciones similares. 
</LI>
<LI>Busque un nuevo hogar para los CD-ROMs y libros de Linux que ya no
necesite.  D&oacute;nelos a alguien interesado en Linux, una biblioteca p&uacute;blica o
un club escolar de computaci&oacute;n. Un libro y su CD-ROM ser&iacute;a muy apropiado
para una biblioteca. En todo caso, por favor aseg&uacute;rese de no violar
derechos de autor al hacer p&uacute;blico el CD-ROM. Informe tambi&eacute;n a las
directivas de la biblioteca que el material en CD-ROM es distribuible de
forma gratuita. Haga un seguimiento para asegurarse de que quede
disponible en los armarios. 
</LI>
<LI>Cuando compre libros acerca de programas distribuidos con Linux,
dele preferencia a los libros escritos por el autor del programa. Los
beneficios que los autores reciben de las ventas de los libros pueden ser
la &uacute;nica retribuci&oacute;n econ&oacute;mica que ellos reciban a cambio de sus
esfuerzos. 
</LI>
<LI>Aliente a los sitios basados en Linux a que registren su sitio en la
p&aacute;gina de <I>Powered by Linux</I> <CODE>
<A HREF="http://sunsite.unc.edu/LDP/powered.html">http://sunsite.unc.edu/LDP/powered.html</A></CODE> y sugi&eacute;rales que
avisos relativos a Linux (<CODE>
<A HREF="http://www.cse.unsw.edu.au/~conradp/banners/">http://www.cse.unsw.edu.au/~conradp/banners/</A></CODE>), Apache, 
<CODE>
<A HREF="http://www.apache.org/">http://www.apache.org/</A></CODE>, GNU <CODE>
<A HREF="http://www.gnu.org/">http://www.gnu.org/</A></CODE>, o perl,
<CODE>
<A HREF="http://www.perl.com/">http://www.perl.com/</A></CODE>,
etc... sean presentados en estos sitios. 
</LI>
<LI>Participe! Si usted se ha beneficiado del Software de fuentes
abiertas, <CODE>
<A HREF="http://www.opensource.org/">http://www.opensource.org/</A></CODE>, por favor considere la
posibilidad de ayudar a la comunidad del software libre por medio de
algunas de estas acciones: 

<UL>
<LI>Informando detalladamente de fallos en el programa
</LI>
<LI>escribiendo documentaci&oacute;n
</LI>
<LI>creando trabajo art&iacute;stico
</LI>
<LI>suministrando asesor&iacute;a como administrador
</LI>
<LI>sugeriendo mejoras
</LI>
<LI>proporcionando soporte t&eacute;cnico
</LI>
<LI>contribuyendo con programas
</LI>
<LI>donando equipo
</LI>
<LI>dando apoyo financiero.
</LI>
</UL>

</LI>
</UL>
<P>
<HR>
<A HREF="Abogacia-Por-Linux-Como-6.html">Página siguiente</A>
<A HREF="Abogacia-Por-Linux-Como-4.html">Página anterior</A>
<A HREF="Abogacia-Por-Linux-Como.html#toc5">Índice general</A>
</BODY>
</HTML>
