<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>mini-COMO: La abogac&iacute;a por Linux : Normas de Conducta</TITLE>
 <LINK HREF="Abogacia-Por-Linux-Como-7.html" REL=next>
 <LINK HREF="Abogacia-Por-Linux-Como-5.html" REL=previous>
 <LINK HREF="Abogacia-Por-Linux-Como.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="Abogacia-Por-Linux-Como-7.html">Página siguiente</A>
<A HREF="Abogacia-Por-Linux-Como-5.html">Página anterior</A>
<A HREF="Abogacia-Por-Linux-Como.html#toc6">Índice general</A>
<HR>
<H2><A NAME="s6">6. Normas de Conducta</A></H2>

<P>
<P>
<UL>
<LI>Como representante de la comunidad de Linux, participe en las listas
de distribuci&oacute;n de correo y las discusiones de los grupos de noticias con
actitud profesional. Huya del uso de lenguaje vulgar y las ofensas
personales. Consid&eacute;rese a s&iacute; mismo como miembro virtual de la corporaci&oacute;n,
teniendo al Sr. Torvalds como director de la misma. Sus palabras podr&aacute;n
tanto enaltecer como degradar la imagen que el lector se forme de la
comunidad Linux.
</LI>
<LI>Evite las exageraciones y las pretensiones sin fundamento a toda
costa. No es profesional y generar&aacute; discusiones improductivas. 
</LI>
<LI>Una respuesta meditada y bien razonada no s&oacute;lo proveer&aacute; conocimiento
profundo a los lectores; tambi&eacute;n incrementar&aacute; el respeto por su
conocimiento y sus habilidades. 
</LI>
<LI>No muerda el anzuelo si lo incitan a la guerra verbal. Muchas veces
esto degenera en argumentos del tipo «Mi sistema operativo es mejor que el
suyo». Describamos en forma precisa las capacidades de Linux y dej&eacute;moslo
ah&iacute;.
</LI>
<LI>Recuerde siempre que si insulta o le falta el respeto a alguien, su
experiencia negativa puede llegar a ser compartida por muchos otros. Si
llega a ofender a alguien, por favor trate de reparar su acci&oacute;n.
</LI>
<LI>C&eacute;ntrese en lo que Linux tiene para ofrecer. No hay necesidad de
vejar a la competencia. Contamos con un producto bueno y s&oacute;lido que se
sostiene por s&iacute; mismo.
</LI>
<LI>Respete el uso de otros sistemas operativos. Es cierto que Linux es
una plataforma maravillosa, pero no satisface necesariamente las
necesidades de todo el mundo. 
</LI>
<LI>Refi&eacute;rase a cualquier otro producto por su propio nombre. No se gana
nada intentando ridiculizar una compa&ntilde;&iacute;a o sus productos usando
«ortograf&iacute;as creativas». Si esperamos respeto por Linux, entonces debemos
respetar los dem&aacute;s productos. 
</LI>
<LI>D&eacute; cr&eacute;dito a quien es debido. Linux es tan s&oacute;lo el n&uacute;cleo. Sin los
esfuerzos del proyecto <I>GNU</I>, <I>MIT</I>, Berkeley y muchos otros muy
numerosos para ser mencionados, el n&uacute;cleo de Linux no ser&iacute;a &uacute;til para la
mayor&iacute;a.
</LI>
<LI>No insista en que Linux es la &uacute;nica respuesta para una aplicaci&oacute;n
particular. As&iacute; como la comunidad de Linux venera la libertad que Linux
les provee, las soluciones &uacute;nicas basadas en Linux coartar&iacute;a a otros su
libertad. 
  </LI>
<LI>Habr&aacute; casos en los que Linux no es la respuesta. Sea el primero en
reconocerlo y ofrezca otra soluci&oacute;n.
</LI>
</UL>
<P>
<HR>
<A HREF="Abogacia-Por-Linux-Como-7.html">Página siguiente</A>
<A HREF="Abogacia-Por-Linux-Como-5.html">Página anterior</A>
<A HREF="Abogacia-Por-Linux-Como.html#toc6">Índice general</A>
</BODY>
</HTML>
