<HTML>
<HEAD>
<TITLE>COMO Usar el sistema de Impresi&oacute;n en Linux: Elementos miscel&aacute;neos</TITLE>
</HEAD>
<BODY>
<A HREF="Uso-Impresion-Como-2.html">Anterior</A>
<A HREF="Uso-Impresion-Como-4.html">Siguiente</A>
<A HREF="Uso-Impresion-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Elementos miscel&aacute;neos</A></H2>


<P>Esta secci&oacute;n comenta algunos de las cosas de utilidad general que puedes querer saber sobre imprimir bajo Linux.</P>

<H2><A NAME="ss3.1">3.1 Formateado</A></H2>


<P>Como la mayor&iacute;a de los ficheros ASCII no est&aacute;n formateados para la impresi&oacute;n, es
&uacute;til formatearlos de alguna manera antes de que sean realmente impresos. Esto 
puede incluir poner un t&iacute;tulo y n&uacute;mero en cada p&aacute;gina, poner m&aacute;rgenes, espaciado
doble, sangr&iacute;a, o imprimir el fichero en m&uacute;ltiples columnas. Una forma com&uacute;n de hacer esto es usar un preprocesador de impresi&oacute;n como <CODE>pr</CODE>.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ pr +4 -d -h&quot;Ph.D. Thesis, 2nd Draft&quot; -l60 tesis.txt | lpr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En el ejemplo de antes, <CODE>pr</CODE> tomar&aacute; el fichero <CODE>tesis.txt</CODE> y saltar&iacute;a las
primeras tres p&aacute;ginas (<CODE>+4</CODE>), pondr&iacute;a la longitud de p&aacute;gina en 60 l&iacute;neas 
(<CODE>-l60</CODE>), doble espacio de la salida (<CODE>-d</CODE>), y a&ntilde;adir&iacute;a la frase 
"<I>Ph.D. Thesis, 2nd Draft</I>" al principio de cada p&aacute;gina (<CODE>-h</CODE>). <CODE>lpr</CODE> 
imprimir&iacute;a entonces la salida de <CODE>pr</CODE>. Mira la p&aacute;gina del manual para
m&aacute;s informaci&oacute;n acerca de c&oacute;mo usar <CODE>pr</CODE>.</P>


<H2><A NAME="ss3.2">3.2 Las variables de entorno <CODE>PRINTER</CODE> </A></H2>


<P>Todos los comandos del sistema de impresi&oacute;n de Linux aceptan la opci&oacute;n <CODE>-P</CODE>.
Esta opci&oacute;n permite que el usuario especifique que impresora usar como salida.
Si un usuario no especifica la impresora a usar, entonces se asumir&aacute; que la 
impresora por defecto es el dispositivo de salida.</P>
<P>En lugar de tener que especificar la impresora a usar cada vez que imprimes, 
puedes poner en la variable de entorno <CODE>PRINTER</CODE> el nombre de la impresora 
que quieres usar. Esto se hace de diferentes maneras por cada <I>shell</I>. Para 
el <CODE>bash</CODE> puedes hacerlo con</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ PRINTER=&quot;nombre_de_impresora&quot;; export PRINTER
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>en <CODE>csh</CODE>, lo puedes hacer con</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% setenv PRINTER &quot;nombre_de_impresora&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Estos comandos pueden ser situados en tus scripts de login (<CODE>.profile</CODE> o <CODE>.cshrc</CODE>), o enviados en la l&iacute;nea de comandos. (Leer <CODE>bash(1)</CODE> y <CODE>csh(1)</CODE> 
para m&aacute;s informaci&oacute;n sobre las variables de entorno.)</P>


<H2><A NAME="ss3.3">3.3 Imprimiendo ficheros PostScript</A></H2>


<P>Imprimir ficheros PostScript en una impresora que tiene un int&eacute;rprete PostScript 
es sencillo; simplemente usa <CODE>lpr</CODE>, y la impresora se ocupar&aacute; de todos los 
detalles por ti. Para aquellos de vosotros que no tienen impresoras con 
capacidades PostScript, nos veremos obligados a usar otros medios. Por suerte, hay programas disponibles que pueden entender el PostScript, y traducirlo a un 
lenguaje que la mayor&iacute;a de las impresoras pueden comprender. Probablemente el 
m&aacute;s conocido de estos es <I>Ghostscript</I>.</P>
<P>La responsabilidad de <I>Ghostscript</I> es convertir todas las descripciones de 
un fichero PostScript a los comandos que la impresora entienda. Para imprimir 
un fichero PostScript usando Ghostscript, podr&iacute;as hacer algo como</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ gs -dNOPAUSE -sDEVICE=deskjet -sOutputFile=|lpr tesis.ps
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Date cuenta que en el ejemplo anterior hemos enviado la salida de Ghostscript hacia el comando <CODE>lpr</CODE> usando la opci&oacute;n <CODE>-sOutputFile</CODE>.</P>
<P>Ghostview es un interface de Ghostscript para el Sistema <I>X Window</I>. Te permite 
previsualizar un fichero PostScript antes de que lo imprimas. Ghostview y 
Ghostscript pueden ser bajados desde <CODE>
<A HREF="ftp://prep.ai.mit.edu/pub/gnu/">ftp://prep.ai.mit.edu/pub/gnu/</A></CODE></P>



<H2><A NAME="ss3.4">3.4 Imprimiendo ficheros TeX</A></H2>


<P>Una de las maneras m&aacute;s f&aacute;ciles de imprimir los ficheros TeX es convertirlos a 
PostScript y entonces imprimirlos usando Ghostscript. Para hacerlo, primero 
necesitas convertirlos de TeX a un formato conocido como DVI (siglas de <I>DeVice-Independent</I>, independiente del dispositivo). Puedes hacerlo con el comando <CODE>tex(1)</CODE>. Entonces necesitas convertir el dispositivo DVI a PostScript usando
<CODE>dvips</CODE>. Todo esto deber&iacute;a ser de la siguiente manera cuando lo escribas.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ tex tesis.tex
$ dvips tesis.dvi
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ahora ya est&aacute;s preparado para imprimir los ficheros PostScript resultantes tal 
como se describe anteriormente.</P>


<H2><A NAME="ss3.5">3.5 Imprimir ficheros formateados con <CODE>troff</CODE></A></H2>


<P>
<BLOCKQUOTE><CODE>
<PRE>
$ groff -Tascii tesis.tr | lpr
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>o, si lo prefieres,</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ groff tesis.tr &gt; tesis.ps
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Y entonces imprimir el fichero PostScript como se describi&oacute; anteriormente.</P>


<HR>
<A HREF="Uso-Impresion-Como-2.html">Anterior</A>
<A HREF="Uso-Impresion-Como-4.html">Siguiente</A>
<A HREF="Uso-Impresion-Como.html#toc3">Indice</A>
</BODY>
</HTML>
