<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Diald Como: Conexi&oacute;n mediante m&oacute;dem y PPP de un puesto aislado a un ISP</TITLE>
 <LINK HREF="Diald-Como-7.html" REL=next>
 <LINK HREF="Diald-Como-5.html" REL=previous>
 <LINK HREF="Diald-Como.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="Diald-Como-7.html">Página siguiente</A>
<A HREF="Diald-Como-5.html">Página anterior</A>
<A HREF="Diald-Como.html#toc6">Índice general</A>
<HR>
<H2><A NAME="s6">6. Conexi&oacute;n mediante m&oacute;dem y PPP de un puesto aislado a un ISP</A></H2>

<P>
<P>De forma esquem&aacute;tica, ser&aacute;n necesarios los siguientes pasos previos:
<UL>
<LI>Tener montado el paquete <EM>Diald</EM>. Lo m&aacute;s r&aacute;pido ser&aacute; montar
el que la distribuci&oacute;n de Linux que usemos incluya.</LI>
<LI>Configurar la resoluci&oacute;n de nombres DNS (fichero
<CODE>/etc/resolv.conf</CODE>).</LI>
<LI>Comprobar que es posible establecer una conexi&oacute;n con el ISP. Si la
distribuci&oacute;n incluye utilidades para configurar una conexi&oacute;n, ser&aacute; m&aacute;s
r&aacute;pido usarlas (pppconfig en Debian, kppp si usas KDE, etc). Si tiene
problemas para establecer la conexi&oacute;n, los documentos PPP-Howto
(<CODE>
<A HREF="http://www.linuxdoc.org/HOWTO/PPP-HOWTO.html">http://www.linuxdoc.org/HOWTO/PPP-HOWTO.html</A></CODE>), Modem-Howto
(<CODE>
<A HREF="http://www.linuxdoc.org/HOWTO/Modem-HOWTO.html">http://www.linuxdoc.org/HOWTO/Modem-HOWTO.html</A></CODE>) y
Serial-Howto (<CODE>
<A HREF="http://www.linuxdoc.org/HOWTO/Serial-HOWTO.html">http://www.linuxdoc.org/HOWTO/Serial-HOWTO.html</A></CODE>) pueden
resultar de ayuda. Ver secci&oacute;n 
<A HREF="Diald-Como-10.html#masinfo">M&aacute;s informaci&oacute;n</A> si
busca traducciones de dichos documentos.
</LI>
<LI>Establecer los nombres de usuario y contrase&ntilde;a en los ficheros
<CODE>/etc/ppp/pap-secrets</CODE> y <CODE>/etc/ppp/chap-secrets</CODE>, como se
coment&oacute; anteriormente.</LI>
</UL>
<P>Y ya entrando definitivamente en <EM>Diald</EM>:
<P>
<UL>
<LI>Preparar el fichero de configuraci&oacute;n de <EM>Diald</EM>
(<CODE>/etc/diald/diald.options</CODE> para la versi&oacute;n 0.16.5 de
<EM>Diald</EM> y <CODE>/etc/diald/diald.conf</CODE> para las dem&aacute;s).</LI>
<LI>Preparar el fichero de filtros <CODE>/etc/diald/standard.filter</CODE>,
o mejor, dejar ese como est&aacute; y modificar una copia suya que podemos llamar
<CODE>/etc/diald/personal.filter</CODE>.</LI>
<LI>Preparar archivo de comandos para realizar la llamada
(<CODE>/etc/diald/diald.connect</CODE> con permiso de ejecuci&oacute;n) y fichero de
instrucciones para <CODE>chat</CODE> (<CODE>/etc/chatscripts/provider</CODE>), que
ser&aacute; utilizado por el anterior.</LI>
<LI>Preparar los archivos de comandos <CODE>/etc/diald/ip-up</CODE> y
<CODE>/etc/diald/ip-down</CODE> si se quieren utilizar (deben tener permiso de
ejecuci&oacute;n).</LI>
<LI>Preparar los archivos de establecimiento de rutas
<CODE>/etc/diald/addroute</CODE> y <CODE>/etc/diald/delroute</CODE> si se quieren
utilizar (deben tener permiso de ejecuci&oacute;n). Este paso no suele ser
necesario cuando solo se usa una instancia de <EM>Diald</EM>.</LI>
<LI>Finalmente, lanzar el demonio <CODE>diald</CODE>
(«<CODE>/etc/init.d/diald start</CODE>» para Debian,
«<CODE>/etc/rc.d/init.d/diald start</CODE>» en RedHat).
Normalmente, la instalaci&oacute;n del paquete <EM>Diald</EM> habr&aacute; generado los
scripts necesarios para que arranque cuando se enciende el equipo en los
directorios /etc/rcX.d que corresponda.</LI>
</UL>
<P>Si se realiza alg&uacute;n cambio en el fichero de configuraci&oacute;n de <EM>Diald</EM>
posteriormente a su lanzamiento, deber&aacute; ser relanzado
(«<CODE>/etc/init.d/diald restart</CODE>» en Debian,
«<CODE>/etc/rc.d/init.d/diald restart</CODE>» en RedHat).
<P>
<H2><A NAME="ss6.1">6.1 Fichero <CODE>/etc/diald/diald.options</CODE> o <CODE>diald.conf</CODE></A>
</H2>

<P>
<P>En este fichero de ejemplo que se muestra hay que revisar:
<UL>
<LI>Puerto en donde se encuentra conectado el m&oacute;dem. Opci&oacute;n <CODE>device</CODE>.</LI>
<LI>Velocidad del m&oacute;dem. Opci&oacute;n <CODE>speed</CODE>.</LI>
<LI>Nombre del usuario para la conexi&oacute;n ppp. Opci&oacute;n <CODE>pppd-options</CODE>.</LI>
<LI>Temporizadores de reintentos.</LI>
<LI>Horario de conexi&oacute;n habilitada. Opciones <CODE>restrict</CODE>.</LI>
<LI>Decidir si se usan los archivos de comandos <CODE>ip-up</CODE> e
<CODE>ip-down</CODE>. Opciones <CODE>ip-up</CODE> e <CODE>ip-down</CODE>.</LI>
<LI>Decidir si se usan los archivos de comandos <CODE>addroute</CODE> y
<CODE>delroute</CODE>. Opciones <CODE>addroute</CODE> y <CODE>delroute</CODE>. Normalmente solo se
usan para configuraciones de enrutamiento complejas o varias instancias de
<EM>Diald</EM> en ejecuci&oacute;n simultanea.</LI>
<LI>Decidir si se usan los filtros est&aacute;ndar o personales. Opciones
<CODE>include</CODE>.</LI>
</UL>
<P>
<BLOCKQUOTE><CODE>
<PRE>
##########################
# /etc/diald/diald.options

# Dispositivo donde esta conectado el m&oacute;dem
device /dev/ttyS0

# Archivo de log de diald
accounting-log /var/log/diald.log

# Cola de monitorizaci&oacute;n de diald
#fifo /var/run/diald/diald.fifo

# Depuraci&oacute;n activada al m&aacute;ximo
# Activar la depuraci&oacute;n disminuye el rendimiento
#debug 31

# Usamos PPP sobre la linea de transmisi&oacute;n
mode ppp

# Direcciona IP de mi equipo (al conectar se modifica autom&aacute;ticamente con
# la IP asignada por el ISP)
local 127.0.0.5

# Direccion IP del equipo remoto (al conectar se modifica autom&aacute;ticamente
# con la IP del equipo que recibe nuestra llamada)
remote 127.0.0.4

# Mascara de subred
netmask 255.255.255.0

# Indica que las direcciones IP ser&aacute;n asignadas en el momento del
# establecimiento de la conexi&oacute;n
dynamic 

# Si la conexi&oacute;n se cae, restablecerla solo si hay trafico de salida
two-way

# Cuando la conexi&oacute;n esta establecida, cambiar las rutas para que apunten
# al interface real, en vez de al interface proxy. No hacer esto implica
# una perdida de rendimiento de un 20 por ciento. Hay kernels antiguos que
# no soportan reroute. Ver el manual de diald para mas informaci&oacute;n
reroute

# Diald deber&aacute; establecer la ruta por defecto al interface SLIP usado como
# proxy
defaultroute

# Script para establecer rutas personalizadas
#addroute "/etc/diald/addroute"
#delroute "/etc/diald/delroute"

# Scripts para ejecutar cuando el enlace se activa o se desactiva.
# En las versiones 0.9x de Diald hay una opci&oacute;n llamada ip-goingdown para
# ser lanzado al finalizar pero cuando todav&iacute;a est&aacute; activo el enlace.
ip-up /etc/diald/ip-up
#ip-down /etc/diald/ip-down

# Scripts usados para establecer la comunicaci&oacute;n y pararla
connect "/etc/diald/diald.connect"
#disconnect "/etc/diald/diald.disconnect"

# Usar bloqueo UUCP
#lock

# Conectamos a trav&eacute;s de m&oacute;dem. ATENCI&Oacute;N: No especificar estas opciones
# en las opciones para PPP, ya que entrar&iacute;an en conflicto. Para ver las
# opciones de PPP que no se pueden usar en pppd-options ver la pagina
# de manual de diald y buscar pppd-options
modem
crtscts
speed 115200

# Algunos temporizadores
# para informaci&oacute;n detallada, ver manual de Diald
connect-timeout 120
redial-timeout 60
start-pppd-timeout 120
died-retry-count 0
redial-backoff-start 4
redial-backoff-limit 300
dial-fail-limit 10

# Opciones para pasar a pppd
# Estas opciones tambi&eacute;n se pueden poner en /etc/ppp/options, que son las
# opciones por defecto de pppd, pero si es necesario tener diferentes
# configuraciones de diald es necesario ponerlas aqu&iacute;
# noauth - no autentificar al destino de la llamada.
#          "Infov&iacute;a Plus" (Espa&ntilde;a) no se identifica frente a nuestro
#          equipo.
# user - poner aqu&iacute; el usuario y el isp separados por la arroba (@).
pppd-options noauth user usuario@isp

# Restricciones de horario de uso.
# Esta secci&oacute;n debe estar antes de los filtros.
# El comando restrict es experimental y puede cambiar en futuras versiones
# de diald (esta sintaxis es para la versi&oacute;n 0.16)
# Solo usar en horario nocturno para plan
# Bononet Noche (Espa&ntilde;a-Telef&oacute;nica)
# Lunes a Viernes de 0 a 8 y de 18 a 24
# Domingos de 0 a 24
restrict 8:00:00 18:00:00 1-5 * *
down
restrict * * * * *

# Sin condiciones especiales de tarificaci&oacute;n
# (primeros segundos cobrados de una vez, unidad de tarificaci&oacute;n en
# segundos, tiempo en segundos para comprobar desconexi&oacute;n)
#impulse 0,0,0
# Bononet Noche (Espa&ntilde;a-Telef&oacute;nica) tarifica por segundos a partir del 160
impulse 160,0,0
# si se tarificase por minutos y cobrasen los 10 primeros de una vez:
#impulse 600,60,10

# Filtros est&aacute;ndar
#include /etc/diald/standard.filter
# o Filtros personales
include /etc/diald/personal.filter
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss6.2">6.2 Fichero de filtros personal</A>
</H2>

<P>
<P>La manipulaci&oacute;n de este fichero debe ser realizada de forma muy cuidadosa.
Es en este fichero en el que se decide cu&aacute;ndo y porqu&eacute; se trata de
levantar el enlace, mantenerlo, tirarlo o ignorarlo, dependiendo del tipo
de tr&aacute;fico.
<P>En general, el fichero de filtros standard de <EM>Diald</EM> es suficiente
para la mayor&iacute;a de los casos, aunque quiz&aacute; sea poco restrictivo en
determinados entornos. El <CODE>personal.filter</CODE> que se muestra a
continuaci&oacute;n tiene algunas correcciones sobre el original de la versi&oacute;n
0.16.
<P>En sucesivas versiones de este documento se presentar&aacute;n otros ejemplos m&aacute;s
restrictivos comentados.
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/diald/personal.filter
# Las reglas de filtrado a continuaci&oacute;n son las mismas que las de
# standard.filter con las siguientes correcciones:
#
# Cambio de 10 minutos por 4 en "cualquier otra conexi&oacute;n TCP".
# A&ntilde;adido para ignorar los FIN ACK con "ignore tcp tcp.fin".
# Ignorar paquetes icmp (con ping y traceroute no se realizar&aacute; llamada).
#

# This is a pretty complicated set of filter rules.
# (These are the rules I use myself.)
#
# I've divided the rules up into four sections.
# TCP packets, UDP packets, ICMP packets and a general catch all rule
# at the end.

ignore icmp any

#------------------------------------------------------------------------------
# Rules for TCP packets.
#------------------------------------------------------------------------------
# General comments on the rule set:
#
# In general we would like to treat only data on a TCP link as significant
# for timeouts. Therefore, we try to ignore packets with no data.
# Since the shortest possible set of headers in a TCP/IP packet is 40 bytes,
# any packet with length 40 must have no data riding in it.
# We may miss some empty packets this way (optional routing information
# and other extras may be present in the IP header), but we should get
# most of them. Note that we don't want to filter out packets with
# tcp.live clear, since we use them later to speedup disconnects
# on some TCP links.
#
# We also want to make sure WWW packets live even if the TCP socket
# is shut down. We do this because WWW doesn't keep connections open
# once the data has been transfered, and it would be annoying to have the link
# keep bouncing up and down every time you get a document.
#
# Outside of WWW the most common use of TCP is for long lived connections,
# that once they are gone mean we no longer need the network connection.
# We don't neccessarily want to wait 10 minutes for the connection
# to go down when we don't have any telnet's or rlogin's running,
# so we want to speed up the timeout on TCP connections that have
# shutdown. We do this by catching packets that do not have the live flag set.

# --- start of rule set proper ---

# When initiating a connection we only give the link 15 seconds initially.
# The idea here is to deal with possibility that the network on the opposite
# end of the connection is unreachable. In this case you don't really
# want to give the link 10 minutes up time. With the rule below
# we only give the link 15 seconds initially. If the network is reachable
# then we will normally get a response that actually contains some
# data within 15 seconds. If this causes problems because you have a slow
# response time at some site you want to regularly access, you can either
# increase the timeout or remove this rule.
accept tcp 15 tcp.syn

# Keep named xfers from holding the link up
ignore tcp tcp.dest=tcp.domain
ignore tcp tcp.source=tcp.domain

# (Ack! SCO telnet starts by sending empty SYNs and only opens the
# connection if it gets a response. Sheesh..)
accept tcp 5 ip.tot_len=40,tcp.syn

# keep empty packets from holding the link up (other than empty SYN packets)
ignore tcp ip.tot_len=40,tcp.live

# Modificacion de Andres Seco. Ignorar los FIN ACK.
ignore tcp tcp.fin

# make sure http transfers hold the link for 2 minutes, even after they end.
# NOTE: Your /etc/services may not define the tcp service www, in which
# case you should comment out the following two lines or get a more
# up to date /etc/services file. See the FAQ for information on obtaining
# a new /etc/services file.
accept tcp 120 tcp.dest=tcp.www
accept tcp 120 tcp.source=tcp.www
# Same for https
accept tcp 120 tcp.dest=tcp.443
accept tcp 120 tcp.source=tcp.443

# Once the link is no longer live, we try to shut down the connection
# quickly. Note that if the link is already down, a state change
# will not bring it back up.
keepup tcp 5 !tcp.live
ignore tcp !tcp.live

# an ftp-data or ftp connection can be expected to show reasonably frequent
# traffic.
accept tcp 120 tcp.dest=tcp.ftp
accept tcp 120 tcp.source=tcp.ftp

#NOTE: ftp-data is not defined in the /etc/services file provided with
# the latest versions of NETKIT, so I've got this commented out here.
# If you want to define it add the following line to your /etc/services:
# ftp-data        20/tcp
# and uncomment the following two rules.
#accept tcp 120 tcp.dest=tcp.ftp-data
#accept tcp 120 tcp.source=tcp.ftp-data

# If we don't catch it above, give the link 10 minutes up time.
#accept tcp 600 any
# Modificacion de Andres Seco. Solo dejar 4 minutos mas.
accept tcp 240 any

# Rules for UDP packets
#
# We time out domain requests right away, we just want them to bring
# the link up, not keep it around for very long.
# This is because the network will usually come up on a call
# from the resolver library (unless you have all your commonly
# used addresses in /etc/hosts, in which case you will discover
# other problems.)
# Note that you should not make the timeout shorter than the time you
# might expect your DNS server to take to respond. Otherwise
# when the initial link gets established there might be a delay
# greater than this between the initial series of packets before
# any packets that keep the link up longer pass over the link.

# Don't bring the link up for rwho.
ignore udp udp.dest=udp.who
ignore udp udp.source=udp.who
# Don't bring the link up for RIP.
ignore udp udp.dest=udp.route
ignore udp udp.source=udp.route
# Don't bring the link up for NTP or timed.
ignore udp udp.dest=udp.ntp
ignore udp udp.source=udp.ntp
ignore udp udp.dest=udp.timed
ignore udp udp.source=udp.timed
# Don't bring up on domain name requests between two running nameds.
ignore udp udp.dest=udp.domain,udp.source=udp.domain
# Bring up the network whenever we make a domain request from someplace
# other than named.
accept udp 30 udp.dest=udp.domain 
accept udp 30 udp.source=udp.domain
# Do the same for netbios-ns broadcasts
# NOTE: your /etc/services file may not define the netbios-ns service
# in which case you should comment out the next three lines.
ignore udp udp.source=udp.netbios-ns,udp.dest=udp.netbios-ns
accept udp 30 udp.dest=udp.netbios-ns
accept udp 30 udp.source=udp.netbios-ns
# keep routed and gated transfers from holding the link up
ignore udp tcp.dest=udp.route
ignore udp tcp.source=udp.route
# Anything else gest 2 minutes.
accept udp 120 any

# Catch any packets that we didn't catch above and give the connection
# 30 seconds of live time.
accept any 30 any
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss6.3">6.3 Realizaci&oacute;n de la llamada</A>
</H2>

<P>
<P>Fichero <CODE>/etc/diald/diald.connect</CODE> (debe tener permiso de
ejecuci&oacute;n):
<P>
<BLOCKQUOTE><CODE>
<PRE>
/usr/sbin/chat -f /etc/chatscripts/provider
</PRE>
</CODE></BLOCKQUOTE>
<P>Fichero <CODE>/etc/chatscripts/provider</CODE>. En este fichero de ejemplo que
se muestra hay que revisar el numero de tel&eacute;fono:
<P>
<BLOCKQUOTE><CODE>
<PRE>
ABORT BUSY
ABORT "NO CARRIER"
ABORT VOICE
ABORT "NO DIALTONE" 
ABORT "NO ANSWER"
"" ATZ
OK ATDT123456789
CONNECT \d\c
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss6.4">6.4 Archivo de comandos de inicio de la conexi&oacute;n</A>
</H2>

<P>
<P>Debe tener permiso de ejecuci&oacute;n.
<P>Este archivo puede ser usado para multiples tareas (sincronizar la hora
del equipo, lanzar la entrega de la cola de impresi&oacute;n, la recuperaci&oacute;n de
los mensajes desde la oficina de correos externa, etc.).
<P>En el ejemplo, se envia un mensaje a <CODE>root</CODE> con los parametros que se le
pasan al archivo de comandos (interface, mascara de subred, direcci&oacute;n IP
local, direcci&oacute;n IP remota y prioridad en la tabla de rutas):
<P>
<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh

iface=$1
netmask=$2
localip=$3
remoteip=$4
metric=$5

# Set the time and date
# netdate ntp.server.somecountry

# Run the mail queue
# runq

echo `date` $1 $2 $3 $4 $5 | mail -s "diald - conectado" root@localhost
</PRE>
</CODE></BLOCKQUOTE>
<P>
<HR>
<A HREF="Diald-Como-7.html">Página siguiente</A>
<A HREF="Diald-Como-5.html">Página anterior</A>
<A HREF="Diald-Como.html#toc6">Índice general</A>
</BODY>
</HTML>
