<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Applications">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges Tarbouriech
 =LF=CAT___: Applications
 =LF=TITLE_: IOS, la otra REBOLuci&oacute;n
 =LF=NUMBER: 230
 =LF=ANAME_: article230.html
 -->
 <TITLE>lf230, Applications: IOS, la otra REBOLuci&oacute;n</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Georges-Tarbouriech.jpg" width=
    "115" height="124" alt="Georges Tarbouriech">
<BR>por  Georges Tarbouriech <br> <small>&lt;georges.t(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Georges es un viejo usuario de Unix. Gusta de esos productos
realmente innovadores que permiten cambiar nuestra actual forma de
trabajar.
    </P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Leo Trujillo Gomez <small>&lt;aleogom(at)att.net.mx&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#230lfindex0">El Concepto</A></LI>
  <LI><A HREF="#230lfindex1">Los hechos</A></LI>
  <LI><A HREF="#230lfindex2">La REBOLuci&oacute;n</A></LI>
  <LI><A HREF="#230lfindex3">La prueba</A></LI>
  <LI><A HREF="#230lfindex4">Del lado de la Seguridad</A></LI>
  <LI><A HREF="#230lfindex5">La parte "commercial" </A></LI>
  <LI><A HREF="#230lfindex6">De vuelta al futuro</A></LI>
  <LI><A HREF="#230lfindex7">Por &uacute;ltimo</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=230&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>IOS, la otra REBOLuci&oacute;n</H2>
 <IMG src="../../common/images/article230/link.jpg"  width="87"
 height="87"
    alt="IOS" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>IOS significa Sistema Operativo de Internet (Internet Operating System).
Es un producto comercial que intenta facilitar el trabajo en
colaboraci&oacute;n. <a href=
"http://www.rebol.com">Rebol</a> es quien ha concebido
esta gran pieza de software. LinuxFocus ha tenido la
oportunidad de probar una versi&oacute;n de evaluaci&oacute;n con periodo
de 30 d&iacute;as. Este art&iacute;culo intenta de presentar esta
REBOLuci&oacute;n. </P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="230lfindex0">&nbsp;</A>
<H2>El Concepto</H2>

    <P>
    Entre otras cosas, <b>REBOL</b> tiene una propiedad
&uacute;nica: el tama&ntilde;o extremadamente peque&ntilde;o de las
aplicaciones que usted desarrolla con el lenguaje. Usted
puede ver algo de esto en <A href=
"../September2000/article169.shtml">este "viejo"
articulo</a> para descubrir lo poderoso que puede ser y que
tan f&aacute;cil puede desarrollar aplicaciones que trabajan en
cerca de 40 plataformas distintas. Rebol/View, por
ejemplo, es de 587 KB y le permite desarrollar casi
todo lo que usted necesita. Puede descargarlo libre de
cargo del <a href=
"http://www.rebol.com">sitio web de Rebol</a>. Tambi&eacute;n
puede  descargar cerca de 300 scripts de ejemplo que le
ense&ntilde;aran a usted todo.<br>

Nunca encontrar&aacute; otra manera de crear aplicaciones
tan peque&ntilde;as en tama&ntilde;o con alg&uacute;n otro lenguaje de
programaci&oacute;n. IOS naci&oacute; con la misma filosof&iacute;a. Es decir,
un servidor dedicado que le proporciona todo lo que necesita, y,
como un cliente, usted consigue muchas aplicaciones distribuidas
en  un de escritorio muy ligero, funcionando  bajo cerca de 25
diversos Sistemas Operativos.  Por supuesto, usted puede desarrollar sus
propias aplicaciones seg&uacute;n sus necesidades.  Sin embargo, esto es un resumen
muy corto, puesto que el IOS es mucho m&aacute;s que eso.

</p> <A NAME="230lfindex1">&nbsp;</A>
<H2>Los hechos</H2>

<p>
Mucha gente joven (y m&aacute;s vieja) puede preguntarse:  &iquest; De qu&eacute; esta
hablando este individuo ?  &iquest; Porqu&eacute; nos preocupamos acerca del tama&ntilde;o ?
Nosotros tenemos hoy discos duros de 20 o 40 GB, mucha memoria RAM,
CPUs "veloces", &iquest; Por qu&eacute; debemos mantener las cosas
peque&ntilde;as ?  Es como decirme:  &iexcl; vamos, viejo hombre,
las cosas ha cambiado !  Absolutamente correcto...  PERO, &iquest; Qu&eacute; pasa con
Internet ?
<br>
Usted probablemente ha notado que m&aacute;s y m&aacute;s gente utiliza Internet.
Mucha de ella usa m&oacute;dems para conectarse con los sitios web, para
enviar y recibir su correo, etc. Y, obviamente, esto consume mucha
banda ancha.  Eso significa, que aun con un enlace de cable o DSL
las conexiones que se consiguen son lentas y m&aacute;s lentas.
<br>
Lo s&eacute;, &iexcl; nadie se preocupa !  &iquest; Qui&eacute;n hace el "esfuerzo" de enviar
texto o HTML en vez esos @#%*$ documentos de  Excel o Word,
o qui&eacute;n cuida de enviar im&aacute;genes JPEG en vez de los BMP ?
&iexcl;&iexcl;&iexcl; Muy pocos !!!  No hablemos de los sitios web que "ofrecen" sonido,
v&iacute;deo, im&aacute;genes enormes, etc.  Por consiguiente, trabajar
remotamente, se vuelve peor cada dia.

<br>
Sin embargo, m&aacute;s y m&aacute;s gente trabaja remotamente.  Las grandes firmas
comerciales mundiales, las organizaciones del mundo, etc, y no
nos olvidamos de la comunidad del software libre (para
el desarrollo de software, documentaci&oacute;n, etc&eacute;tera).
Es decir, ellos tienen gente trabajando alrededor del mundo que
necesita comunicarse, preferiblemente en tiempo real.  Esto es ya
verdad... sin Rebol.  &iquest; Y entoces ?

</p> <A NAME="230lfindex2">&nbsp;</A>
<H2>La REBOLuci&oacute;n</H2>

<p>
Hoy, para trabajar remotamente, cada uno utiliza las herramientas bien
conocidas: navegadores de 50MB, lectores de correo de 20MB,
software para conferencias de 10MB, software de mensajer&iacute;a de 10MB,
1 GB de software de base de datos...
para intercambiar cualquier tipo de datos. Preferiblemente,
datos muy grandes (&iexcl; v&eacute;ase arriba !). &iquest; Cu&aacute;l es la nueva oferta
de Rebol ? &iexcl; Nada !  Mis compa&ntilde;eros me dijeron:  el mensajero permite enviar
mensajes, el lector de correos enviar  correo, el administrador de tareas
maneja tareas...

<br>
Una vez m&aacute;s, &iexcl; esto es verdad !  Excepto eso que el lector de correos es de
2915 Bytes (&iexcl;no es ning&uacute;n error de escritura!),  el
mensajero es de 14.5 KB, que son 7372 Bytes, el software para conferencias
de  14.41 KB, etc&eacute;tera!  Todas estas herramientas est&aacute;n
disponibles en su escritorio con un ejecutable de 610 KB para
conectar con el servidor. &Eacute;ste es el tama&ntilde;o para el cliente Linux;
casi es lo mismo para cada plataforma disponible: 25 a la
hora de escribir esto. < Br > aqu&iacute; est&aacute; como se ve:

<br><br> <P><center><A
HREF="../../common/images/article230/desk.jpg"><IMG
SRC="../../common/images/article230/deskth.jpg"
ALT="desk"></A></center>

<br><br>
Para entender el concepto completo usted debe saber que REBOL le provee
de un rango de productos que permiten casi todo.  Mencionamos ya
Rebol/View (libre de cargo o como versi&oacute;n mejorada por un
peque&ntilde;o honorario), pero usted puede agregar Rebol/Core
(descarga libre de cargo), Rebol/Command (comercial, es decir, no es
gratuito) que es un producto que se usa conjuntamente con RDBMS
 o manejar los scripts cgi, por ejemplo.
 Por supuesto, todos estos productos se pueden utilizar dentro
de IOS.  Esto hace una muy grande "caja de herramientas":
un lenguaje de programaci&oacute;n impresionante (de mensajer&iacute;a),
la capacidad de interconectar sus programas (llamados
reblets) con las bases de datos o los servidores existentes del Web o lo
que sea.  Seg&uacute;n lo dicho ya en el art&iacute;culo anterior:  el
&uacute;nico l&iacute;mite viene est&aacute; en su imaginaci&oacute;n. Un ejemplo deber&iacute;a  hacer las
cosas un poco m&aacute;s comprensibles.

</p>
<A NAME="230lfindex3">&nbsp;</A>
<H2>La prueba</H2>


<p>
Nosotros solicitamos Rebol para una evaluaci&oacute;n de la versi&oacute;n IOS
 y han sido tan buenos en aceptarlo. Entonces hemos sido capaces de
obtener 3 cuentas de clientes en el
servidor de Rebol.  Obviamente, no pod&iacute;amos probar del lado del
servidor: m&aacute;s de esto despu&eacute;s.  Dado que es una prueba de
LinuxFocus, utilizamos... al cliente de Linux.


<br>
Todo lo que tuvimos que hacer fue descargar un peque&ntilde;o ejecutable
 y correrlo (s&iacute;, odio los ejecutables, pero en este caso, dir&eacute; que yo
conf&iacute;o en Rebol).  Esto instala al cliente en su m&aacute;quina:  &iexcl; toma menos de 1
minuto!


<br>
Si Rebol/View, por ejemplo, est&aacute; instalado en su m&aacute;quina,
no tiene que configurar al cliente puesto que ya existe la
informaci&oacute;n que necesita.  &Eacute;sa es la direcci&oacute;n de correo, las direcciones
del servidor pop y smtp...  Sin embargo, usted debe proporcionar al
nombre de usuario y la contrase&ntilde;a que Rebol le dio.
Eso es todo: &iexcl;usted esta listo! <br>
Puede utilizar cada herramienta presente en el escritorio:  el mensajero,
el correo, el software de conferencias, etc.  A prop&oacute;sito,
los nuevos reblets se agregan con frecuencia.  Las utilidades
son tambi&eacute;n proporcionadas, por ejemplo una
calculadora, un clipboard, un panel de Informaci&oacute;n,etc. Aqu&iacute; est&aacute;:

<br><br> <P><center><A
HREF="../../common/images/article230/deskutil.jpg"><IMG
SRC="../../common/images/article230/deskutilth.jpg"
ALT="deskutil"></A></center>

<br><br>
Los diversos botones en el escritorio permiten  tener
acceso a cada &aacute;rea proporcionada para las aplicaciones, la
documentaci&oacute;n, etc.  El bot&oacute;n de usuarios es bueno puesto que puede crear
sus propios folder(s) en este espacio de trabajo.  Puede especificar  los
usuarios que tienen permisos de acceso a esta carpeta, apenas
nombr&aacute;ndolos en los campos correctos. Luego  poner en esta
carpeta lo que considere.  Pueden ser aplicaciones, im&aacute;genes,
documentos... Podr&iacute;a considerar esta carpeta como un NFS "mundial"
(Network File System)... &iexcl; sin sus defectos de seguridad !  Es decir, los
usuarios con permisos pueden leer y escribir a esta carpeta seg&uacute;n
los permisos que usted los dio.  Por supuesto, todas esas cosas est&aacute;n
presentes en su disco duro.  En otras palabras usted puede usarlo sin
estar conectado.

<br>
&iquest;Qu&eacute; es lo que almacenamos es esto?
<br>

Una peque&ntilde;a aplicaci&oacute;n permite conectarse a la &uacute;ltima publicaci&oacute;n de
LinuxFocus.

Es la misma  que ha visto ya en el art&iacute;culo anterior sobre
Rebol, excepto que es dirigida para una edici&oacute;n distinta de LinuxFocus.
&iquest; Por qu&eacute; escrib&iacute; la misma aplicaci&oacute;n ?  Porque la
sintaxis ha cambiado levemente desde el art&iacute;culo anterior.  Aqu&iacute; est&aacute; el nuevo
<a href="../../common/src/article230/lfissue.txt">c&oacute;dog fuente</a>
<br><br>
&iquest; C&oacute;mo se ve ?
<br><br>
<P><center><A
HREF="../../common/images/article230/lfissue.jpg"><IMG
SRC="../../common/images/article230/lfissueth.jpg"
ALT="lfissue"></A></center>

<br><br>
Este programa tiene 2182 Bytes, aunque podemos decir que solamente
contiene texto, botones, URLs e im&aacute;genes de fondo... y no mucho c&oacute;digo.
No es algo muy significativo, &iquest;O si?

<br>
Intent&eacute;mos algo un poco m&aacute;s elaborado.

<br>
De nuevo, tomaremos a LinuxFocus como ejemplo.  Sin embargo y siempre,
haremos una base de datos muy simple.  Concebida para
proveer a los usuarios con permisos, derechos de consultas,
creaci&oacute;n, y borrado de registros.  Por supuesto, puesto que es un
ejemplo muy simple, usted no podr&aacute; hacer consultas,
puede seleccionar solamente un registro a la vez.
Los registros de guardan en un archivo de texto
llamado articles.r.

<br> El programa se llama lfdb.r y 5983 Bytes de "anchura".

<br>
Se pidi&oacute; prestado a Carl Sassenrath (fundador de Rebol) rebodex.r,
el cual es parte de los ejemplos proporcionados y mencionados m&aacute;s
arriba. Aqu&iacute; est&aacute; el
<a href="../../common/src/article230/lfdb.txt">c&oacute;digo fuente</a><br><br>

Veamos c&oacute;mo trabaja:
<br><br> <P><center><A
HREF="../../common/images/article230/deskdb.jpg"><IMG
SRC="../../common/images/article230/deskdbth.jpg"
ALT="deskdb"></A></center>

<br><br>

Como usted puede ver, nada extraordinario, pero funciona y es muy peque&ntilde;o en
tama&ntilde;o. Es decir, su trabajo remoto es muy r&aacute;pido, cualquiera que sea su
tipo de conexi&oacute;n.

<br>
Esto para decir que usted puede crear todo lo que quiera  en un lapso
de tiempo muy corto y hacerlo usable para la gente en el otro extremo del
mundo como si estuvieran en la oficina contigua.  Recuerde, ellos
puede tambi&eacute;n usar su "creaci&oacute;n" una vez desconectados,
puesto que tienen las cosas en su disco duro.

<br>
Obviamente, este es un ejemplo muy simple, pero otra vez, no hay
l&iacute;mite a lo que usted puede hacer con IOS.  Por ejemplo, puesto
que estamos hablando de bases de datos, usted podr&iacute;a utilizar
Rebol/Command para conectar con un servidor RDBMS.

<br>
Esto es solamente una manera de usar IOS, existen muchas m&aacute;s.
S&oacute;lo piense sobre las  muy sofisticadas aplicaciones que usted
podr&iacute;a crear con &eacute;l.

<br>
Y ahora, lo m&aacute;s importante :
el triste lado de la seguridad.

</p>

<A NAME="230lfindex4">&nbsp;</A>
<H2>Del lado de la Seguridad</H2>


<p>

Tan pronto como la comunicaci&oacute;n por internet se halla efectuado,
el riesgo de seguridad es muy alto.  &iquest; C&oacute;mo administra Rebol
este gran "asunto" ?

<br>
Como es usual, ellos mantienen las cosas simples, f&aacute;ciles y confiables.
</p>

<b>El Servidor</b>

<p>
Seg&uacute;n lo mencionado, no hemos podido probar el servidor de IOS.
Pero una gu&iacute;a del administrador est&aacute; disponible desde la documentaci&oacute;n del
escritorio de IOS. Adem&aacute;s, la gente en Rebol es tan
agradable para responder a sus preguntas:  &eacute;sto no es
muy frecuente y tenia que ser dicho.  A&uacute;n m&aacute;s interesante,
contestan a su pregunta en tiempo real usando la aplicaci&oacute;n de mensajero
de IOS.  Nada malo, &iquest;verdad?  (a prop&oacute;sito, &iquest; Cuando dormiran,
puesto que la diferencia de tiempo entre ellos y yo son casi 9 horas ?

<br>
Primero que nada, el servidor puede ejecutar muchos Sistemas Operativos
diversos. La mayor&iacute;a de los servidores Unix o Windos pueden hacer
el trabajo.  La seguridad de IOS se maneja desde adentro e integra en su
red existente sin cambios en su infraestructura. Esperemos que su red
est&eacute; realmente protegida ya con un cortafuego, proxy, NIDS (sistema
para la detecci&oacute;n de intrusi&oacute;n  en la red), hacer un t&uacute;nel, etc.

<br>
IOS funciona encima del servidor web, usando el protocolo  HTTP
con una t&eacute;cnica de hacer un t&uacute;nel.  Este servidor web se utiliza
como Gateway para conectar con el servidor de IOS.  Un programa  cgi
act&uacute;a como un proxy para redireccionar los datos del servidor web
al servidor de IOS.  Cada comunicaci&oacute;n est&aacute; encriptada.
El servidor de IOS guarda los datos. Otro proceso sincroniza
los datos entre el servidor y el cliente. Es decir, los nuevos datos se
descargan autom&aacute;ticamente a su disco duro.

<br>
Por &uacute;ltimo, pero no menos importante, tomar&aacute; cerca de 5 minutos para
instalar el servidor si ya tiene corriendo el servidor web. <br>
Naturalmente, esta es una explicaci&oacute;n muy breve, pero muestra que la
filosof&iacute;a de Rebol ha sido aplicada tambi&eacute;n aqu&iacute;.
Agregamos que Rebol le provee a usted con Reblets para hacer la
administraci&oacute;n a&uacute;n m&aacute;s sencilla. </p>

<b>El Cliente</b>
<p>

Ya decribimos lo f&aacute;cil de la instalaci&oacute;n del cliente.
No hay mucho que agregar, ya que esto toma menos de un minuto.
<br>
Como cliente, usted se conecta con el servidor con claves &uacute;nicas de
sesi&oacute;n, as&iacute; la autentificaci&oacute;n est&aacute; garantizada.  Todo que circula
a trav&eacute;s de la red esta encriptado.  Las conexiones se pueden
restringir a direcciones IP espec&iacute;ficas, para especificar puertos
(entrante, saliente).  Entonces se convierte como una
conexi&oacute;n punto a punto.

<br>
Concerniente a los archivos y directorios, los
permisos se pueden manejar de una manera muy f&aacute;cil.  Los accesos se limitan
a un &aacute;rea local espec&iacute;fica.  Es decir, un usuario puede tener
acceso solamente a su propia &aacute;rea.  Etc&eacute;tera.

<br>
Hay mucho m&aacute;s que decir sobre el esquema de seguridad de IOS, pero
necesitar&iacute;amos varios art&iacute;culos para cubrir todo.

<br>
Resumiendo, la seguridad de IOS esta muy bien pensada. Prob&eacute; la circulaci&oacute;n
 de  datos con tcpdump y no
vi nada sino la conexi&oacute;n misma. Explor&eacute; el servidor con nmap y no
consegu&iacute; ninguna respuesta en nada.  Por supuesto, esto no significa
que no hay vulnerabilidades:  todos sabemos que la seguridad nunca
se logra al 100%, no obstante Rebol hizo otro gran trabajo.

</p>
<A NAME="230lfindex5">&nbsp;</A>
<H2>La parte "commercial" </H2>


<p>
De acuerdo, Rebol provee software
propietario.  Naturalmente, tiene que vender para vivir, incluso
si usted puede conseguir muchos productos libres de cargo.  Sin
embargo, el IOS por ejemplo se vende de diversas maneras: aqu&iacute; est&aacute; el rango
de los productos  IOS.

<br>
IOS Express es para grandes y medianas empresas.<br>
IOS Lite es para peque&ntilde;as empresas.<br>
IOS Host es para hospedaje de negocios : Rebol
hospeda en sus sevidores.
<br>
IOS Alliance es un programa de soporte para desarrolladores comerciales.
<br>
Obviamente, seg&uacute;n la opci&oacute;n, el precio a pagar ser&aacute; diferente.  La
tasa al por menor introductoria se fija en $2000 para el servidor
y 10 clientes.  Los clientes adicionales son $100 cada uno.  Para
una gran cantidad de clientes, un descuento puede ser negociado.

<br>
Esto es para informaci&oacute;n y podr&iacute;a cambiar en el futuro,
de acuerdo al numero de aplicaciones proporcionadas con IOS.

</p>

<A NAME="230lfindex6">&nbsp;</A>
<H2>De vuelta al futuro</H2>

<p>
IOS es adelantado, mientras mantiene las cosas simples,
que llega a ser dif&iacute;cil explicar todas sus ventajas.  En la medida que la
gente usa diferentes productos en su trabajo de cada d&iacute;a, no
pueden a&uacute;n notar que esos productos no los m&aacute;s son adecuados. O se
pegan a ellos o no son bastante curiosos para intentar algo m&aacute;s. A veces,
incluso no tienen opci&oacute;n. Sin embargo, los productos tales como IOS son
una  verdadera revoluci&oacute;n cuando son comparados a los que
utilizamos hoy. Para esta gran pieza de software, Rebol no tiene
ning&uacute;n competidor. El problema es que siendo demasiado adelantado, significa
que otros competidores se pueden beneficiar muy pronto.  El
mundo de la computaci&oacute;n est&aacute; lleno de ejemplos tristes.

<br>
Vayamos a la usual "&aacute;rea" off-topic.
<br>
El Fundador de Rebol, Carl Sassenrath, ha usado para trabajar
Commodore, un fabricante muy grande, para aquellos que no lo sab&iacute;an.
La computadora Amiga era uno de sus producto.  El Sistema Operativo
Amiga era uno de los sistemas m&aacute;s avanzados en aquella &eacute;poca:
La primer computadora personal multitarea, la primer computadora
realmente multimedia, la primera usando chips multiples, etc.
Commodore  no fue capaz de venderlo como ameritaba.  Tom&oacute; a&ntilde;os para
que otros fabricantes o editores alcancaran el mismo nivel t&eacute;cnico... pero
&eacute;stos "otros" tuvieron &eacute;xito en la venta de sus productos, a veces
 "forzando" a la gente a comprarlos.
<br>
Carl estuvo involucrado en este gran trabajo en el Sistema Operativo
Amiga.
<br>
Despu&eacute;s, a&uacute;n para Commodore, Carl trabajo en el CDTV, digamos es el padre de
las cajas set-top. Una vez m&aacute;s, Commodore no ha podido venderla.
Sin embargo, algunos meses despu&eacute;s de la liberaci&oacute;n de la CDTV, otro
fabricante grande libero un equivalente... y tuvo &eacute;xito en la
venta de &eacute;l. Todo esto para decir que Carl ha estado siempre por delante,
pero puede estar demasiado adelante.  Lo que debio haber sido una ventaja se
convirti&oacute; en una (clase de) desventaja.  Su trabajo fue, m&aacute;s delante, el
beneficio de otros.

<br> <br>
Otro ejemplo podr&iacute;a ser NeXT y su Sistema Operativo, NeXTSTEP.  M&aacute;s de
diez a&ntilde;os despu&eacute;s, la gente descubre MacOS X, a menudo sin saber
que es un viejo sistema... llamado NeXTSTEP.  Este es un
poco diferente, puesto que el mismo hombre est&aacute; detr&aacute;s de
ambos sistemas.

<br>

Pero otra vez, parece que ser demasiado adelantado puede
producir un resultado negativo.  Una sentencia resume la manera "correcta"
 de trabajar:  "nosotros no copiamos (plagiar), solamente intentamos no
incurrir en las mismas equivocaciones que los que abrieron el camino"
(la verdadera frase puede ser un poco diferente).
&iquest; Adivinen quien dijo eso ? &iquest; Alguna idea ?

<br>
<br>
Esta digresi&oacute;n nos conduce a una pregunta: &iquest;Una vez m&aacute;s Carl y  amigos
trabajan para beneficiar a otros?  Bien, mucha gente no se da cuenta
lo avanzado que son IOS y el rango de productos Rebol. Sin embargo esto
pod&iacute;a "dar" ideas a algunos editores. Pero, hay una cosa que no podr&aacute;n
 "copiar":
el tama&ntilde;o de las aplicaciones  y del lenguaje para crearlos.
Puesto que realmente no creo que la velocidad de la comunicaci&oacute;n a trav&eacute;s
 del Internet va a mejorar ma&ntilde;ana, mantengo el pensamiento de que
Rebol es el &uacute;nico que entiende el problema. Estoy enterado de
la alta velocidad alcanzada ya en Internet, pero cuando usted piense
esto &iquest; Estar&aacute; disponible para todos ? No hablamos siquiera del coste.


<br>
Definitivamente, las conexiones por cable y DSL mejoran las cosas un
poco comparado con las conexiones por m&oacute;dem o ISDN
(por lo menos, a veces, especialmente con la conexi&oacute;n de cable). De
todas formas, a&uacute;n con alta velocidad, las aplicaciones peque&ntilde;as en tama&ntilde;o
ser&aacute;n siempre m&aacute;s r&aacute;pidas que las m&aacute;s grandes. Para una compa&ntilde;&iacute;a es algo
absolutamente importante:  significa menos coste (las comunicaciones son m&aacute;s
cortas), hay m&aacute;s eficacia (la gente puede trabajar desconectado y sin
necesidad de  descargar los MBs de datos), m&aacute;s seguridad (puesto que muchos
servidores alrededor del mundo son como cribas), etc&eacute;tera.

<br>
<br>
Por &uacute;ltimo, pero no menos importante, gran parte de la
seguridad es manejada desde el servidor IOS y no requiere el
conocimiento necesario para asegurar una red.  Es decir, si su red es
como las cribas arriba mencionadas, usted tendr&aacute; una
seguridad aceptable cuando instale apropiadamante el servidor IOS...
&iexcl; incluso si yo no recomiendo esto !
</p>
<A NAME="230lfindex7">&nbsp;</A>
<H2>Por &uacute;ltimo</H2>

<p>
El trabajo de colaboraci&oacute;n remoto esta diseminado cada vez m&aacute;s.
Muchas soluciones bien conocidas existen, pero son a menudo
absolutamente costosas y dif&iacute;ciles de implementar.  Rebol
nos provee de una nueva manera de trabajar, de pensar: aplicaciones
distribuidas ligeras.  La aproximaci&oacute;n conciernente a aplicaciones
distribuidas no es absolutamente nueva, pero cuando usted toma en cuenta
el "peso ligero", asi resulta.
<br>
Los productos tales como IOS y amigos representan realmente una
nueva aproximaci&oacute;n.  Como de costumbre, "hay m&aacute;s que una forma
de hacerlo", pero Rebol es apenas incre&iacute;ble.  No estoy diciendo
que usted debe librarse de los otros lenguajes o software.
Por ejemplo yo "amo" Perl o MySQL.  Pero IOS
es algo m&aacute;s:  usado conjuntamente con Rebol/Core, Rebol/View,
Rebol/Command, se convierte en lo &uacute;ltimo de herramientas
para el trabajo de colaboraci&oacute;n remoto.
<br>

Por supuesto, usted esta leyendo LinuxFocus y hablamos
generalmente de software libre.  Sin embargo, el software
propietario, cuando realmente es innovador, no se puede dejar
 a un lado, especialmente cuando puede ejecutarse bajo la mayor&iacute;a de los
Sistemas Operativos disponibles.

<br>
Rechazar este hecho evidente parecer&iacute;a integrismo.

<br>
Adem&aacute;s, la gente en Rebol, no s&oacute;lo son agradables y serviciales
sino tambi&eacute;n de mente muy abierta, lo cu&aacute;l no es siempre
verdad para otros, incluyendo alguna gente en la comunidad del software
libre hoy d&iacute;a. &iexcl; Lo siento, pero esta es otra verdad !
<br>

Sugerencia:  pruebe los productos de Rebol  y como Apple
dice "piense diferente".  Olv&iacute;dese de lo que ha usado  y
haga algunas pruebas con diferente software de Rebol.  Estoy
seguro que no lamentar&aacute; el tiempo pasado.  Para un buen comienzo, vaya
y visite el
<a href= "http://www.rebol.com">Sitio web de Rebol</a>.
Descargue Rebol/View y los scripts de ejemplo: entender&aacute; todo acerca de
la REBOLuci&oacute;n.
<br>

Puede tambi&eacute;n leer el libro "Rebol" de mi colega Olivier Auverlot de la
revista francesa "Login".
Este libro fue escrito en Franc&eacute;s, pero una traducci&oacute;n en Ingl&eacute;s est&aacute;
en camino y deber&iacute;a liberarse muy pronto (si no es que ya est&aacute; publicada
 a la hora de escribir esto).
<br>
Si desea saber m&aacute;s acerca de IOS, encontrar&aacute; mucha informaci&oacute;n en el
sitio web de Rebol. El
<a href=
"http://www.rebol.com/ios-scenario">escenario IOS</a>
es lectura recomendada ya que proporciona un ejemplo de lo que una compa&ntilde;&iacute;a
mediana puede hacer con IOS.    <br>     &iexcl; Que lo
disfrute ! <br> &iquest;No vivimos una &eacute;poca maravillosa ?
</p>
 


<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=230&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article230.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Georges Tarbouriech <small>&lt;georges.t(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Leo Trujillo Gomez &lt;aleogom(at)att.net.mx&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-03-04, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
