<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <TITLE>lf206, Applications: Empleo de XML y XSLT para desarrollar LinuxFocus.org (Holanda)</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://www.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://www.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/EgonWillighagen.jpg" alt="[Photo of the Author]" height="102" width="79">
<BR>por  <A href="mailto:egonw@linuxfocus.org">Egon Willighagen</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P> Recibir&aacute; este a&ntilde;o  su t&iacute;tulo de doctor en Qu&iacute;mica. Juega al baloncesto y participa en LinuxFocus y Linux en general.

    
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">La Definici&oacute;n del Tipo de DocumentoThe Document Type (DTD)</A></LI>
  <LI><A HREF="#lfindex2">&lt;database&gt;</A></LI>
  <LI><A HREF="#lfindex3">&lt;themes&gt;</A></LI>
  <LI><A HREF="#lfindex4">&lt;issues&gt;</A></LI>
  <LI><A HREF="#lfindex5">&lt;persons&gt;</A></LI>
  <LI><A HREF="#lfindex6">&lt;articles&gt;</A></LI>
  <LI><A HREF="#lfindex7">Generaci&oacute;n autom&aacute;tica de p&aacute;ginas Web</A></LI>
  <LI><A HREF="#lfindex8">Localizando</A></LI>
  <LI><A HREF="#lfindex9">Planes futuros</A></LI>
  <LI><A HREF="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=206&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Empleo de XML y XSLT para desarrollar LinuxFocus.org (Holanda)</H2>
 <IMG src="../../common/images/illustration206.jpg" alt="[Illustration]" hspace="10" width="102" height="38">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>

      Este art&iacute;culo contiene la presentaci&oacute;n hecha en el Encuentro de Software Libre en Burdeos en Julio. Explica la base de datos en XML  utilizada para la generaci&oacute;n autom&aacute;tica del sitio Web LinuxFocus.org (Holanda)

    </P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


    <A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>


    <p>Hasta hace poco, el sistema utilizado para documentar el proceso de traducci&oacute;n en LinuxFocus consiste en un conjunto de ficheros ASCII, incluyendo      <i>resdb.txt</i>, <i>issuedb.txt</i> y <i>maindb.txt</i>.
      Estos ficheros tienen un formato fijo y son utilizados para generar las paginas web. Sin embargo, son dificiles de ampliar, y la diferente naturaleza de los datos hacen dificil el control de la informaci&oacute;n disponible en un art&iacute;culo.
    </p>

    <p>
      	LinuxFocus no generaba autom&aacute;ticamente demasiado contenido web cuando se instaur&oacute; la nueva base de datos. Como editor web en el Equipo Holand&eacute;s, yo estaba muy interesado en tener los ficheros index.html del sitio web generados din&aacute;micamente.

	Editar bastantes ficheros HTML cada vez que un art&iacute;culo iba a ser traducido, supon&iacute;a un gran esfuerzo y provocaba errores en los links a otras p&aacute;ginas. Por tanto, decid&iacute; crear un sistema donde pudiera a&ntilde;adir informaci&oacute;n facilmente y donde pudiera generar los indices de las p&aacute;ginas del sitio web de una forma c&oacute;moda y sencilla. Comenc&eacute; a trabajar en ello en el verano del 2000.
    </p>

    <p>La elecci&oacute;n de XML fue un poco arbitar&iacute;a. Me sugirieron utilizar una base de datos relacional, pero yo ten&iacute;a bastante experiencia en XML y prefer&iacute; un sistema basado en ficheros de texto. Ide&eacute; un nuevo sistema de estructuraci&oacute;n de la base de datos porque as&iacute; podr&iacute;a usar un tipo de identificador en vez de los 2 o 3 esquemas que ten&iacute;a hasta entonces. Guido Socher hizo todo el renombramiento con un gran esfuerzo (muchas gracias!!!)
    </p>

    <p>La Definici&oacute;n de tipo de Documento (DTD) todav&iacute;a est&aacute; en desarrollo y una peque&ntilde;a cantidad de contenido estaba en la base de datos con prop&oacute;sito de hacer pruebas. Despu&eacute;s de haber a&ntilde;adido unos 20 art&iacute;culos esto se convirti&oacute; claramente en un gran proyecto. Escribimos scripts para poder usar los antiguos ficheros pero no toda la informaci&oacute;n de la base de datos nueva estaba disponible y, como hemos explicado, la informaci&oacute;n que estaba disponible estaba sobre bastantes ficheros. Afortunadamente, Floris Lambrechts se involucr&oacute; en el proyecto, y he de agradecerle profundamente por a&ntilde;adir la mayor&iacute;a del contenido a la base de datos. Sin su ayuda, el sistema todav&iacute;a no estar&iacute;a disponible en estos momentos.

    </p>

    <p>Junto con el nuevo formato vino la posibilidad de a&ntilde;adir nueva informaci&oacute;n. Y el a&ntilde;o pasado fueron a&ntilde;adidas nuevas clases de datos a la base de datos. Se a&ntilde;adieron la tabla de autores, traductores, editores y otra gente involucrada en LinuxFocus, adem&aacute;s de la localizaci&oacute;n de los ficheros. La raz&oacute;n de a&ntilde;adirlos fue que desde el principio de LinuxFocus hab&iacute;a bastantes esquemas de nombramiento de ficheros. Durante el reformateo de la base de datos, fue reducido a dos esquemas. Algunos ficheros usaban el lado del servidor y usaban la extensi&oacute;n .shtml y los art&iacute;culos antiguos utilizaban extensiones .html. La etiqueta <file> puede ser usada para sobreescribir un fichero por defecto. (el actual por defecto utiliza "articulo"+n&uacute;mero de art&iacute;culo + ".shtml". Esto podr&iacute;a incluir un ".meta" opcional en caso de que se encontrase en el metaformato de LinuxFocus)

    <p>Una vez la base de datos hubo alcanzado un tama&ntilde;o considerable, comenc&eacute; a hacer pruebas de rendimiento sobre los programas que el software que hab&iacute;a escrito. El actual XSLT y hojas de estilo no son la primera implementaci&oacute;n. Estan precedidas por c&oacute;digo en Perl. Pero con el aumento de tama&ntilde;o de la base de datos, el rendimiento se hizo bastante importante. El primer intento no fue bastante bueno. Sin embargo antes de explicar las herramientas, explicar&eacute; el formato de la base de datos.
    </p>

    <A NAME="lfindex1">&nbsp;</A>
<H2>La Definici&oacute;n del Tipo de DocumentoThe Document Type (DTD)</H2>


    <p>XML, lo primero de todo, es un lenguaje de especifaci&oacute;n para lenguajes de marcado. La sintaxis define la secuencia de caracteres permitidos en un documento XML "bien formado" . Este dice que un documento es un elemento raiz y que un elemento consiste en una etiqueta inicial, contenido (texto, elementos hijos &oacute; ambos) y una etiqueta final. Estas etiquetas consisten en un caracter "&lt;" seguido por un nombre y al final un caracter "&gt;". Una etiqueta final debe contener un "/" justo antes del nombre. Las etiquetas (como &lt;br&gt; en HTML) toma un "/" despu&eacute;s del nombre. Una etiqueta de comienzo debe contener atributos y estos tambi&eacute;n deben tener una sintaxis concreta.

	Ejemplos de etiquetas XML son:
    </p>

<pre>
&lt;greeting&gt;Hello, world!&lt;/greeting&gt;
</pre>
o para una etiqueta vac&iacute;a
<pre>
&lt;br/&gt;
</pre>

    <p>Adem&aacute;s de una sintaxis, el lenguaje tambi&eacute;n define la sem&aacute;ntica. Esta describe como se asocian unos elementos con otros. Por ejemplo, la semantica en HTML dice que la etiqueta &lt;body&gt; deber&iacute;a ser contenida por el elemento &lt;html&gt;( y no hay otra posibilidad de interpretarla). La sem&aacute;ntica describe tambi&eacute;n que el elemento &lt;img&gt; es vacio como ocurre con  &lt;br&gt;.

      Si esa fuera la sem&aacute;ntica dada en una notaci&oacute;n formal, las etiquetas podr&iacute;an ser analizadas con un programa y usadas para <i>validar</i> el documento usando dicha sem&aacute;ntica. Una de esas notaciones es la conocida como Definici&oacute;n del tipo de Documento (Document Type Definition), &oacute; de forma abreviada, DTD. Si un documento pasa el proceso de validaci&oacute;n se le conoce como <i>valido</i>. Se Debe ser muy cuidadoso con la validaci&oacute;n, pues XML es muy estricto.

    </p>

    <p>Ahora que conocemos lo que es una DTD , vamos a ver la DTD de la base de datos de LinuxFocus. Vamos a trabajar siempre sobre el mismo ejemplo. Examinando este ejemplo podr&aacute;s hacerte una idea de la informaci&oacute;n que nuestra base de datos contiene (
      <a href="../../common/src/article206/xml/dtd/lfdb.dtd">DTD de la base de Datos de LinuxFocus</a>).
    </p>

    <A NAME="lfindex2">&nbsp;</A>
<H2>&lt;database&gt;</H2>


    <p>El elemento ra&iacute;z en la base de datos, &oacute; una de sus extensiones/localizaciones es el elemento &lt;database&gt; .
    </p>

    <pre>
&lt;!ELEMENT database    (themes?, persons?, issues?, articles?)&gt;
    </pre>

    <p>Observese que la "?" significa que el elemento hijo podr&iacute;a aparecer cero &oacute; una vez. Por tanto, la base de datos podr&iacute;a contener informaci&oacute;n acerca de temas (themes), personas (persons),asuntos (issues) y art&iacute;culos (articles). Ya que este ejemplo es demasiado trivial vamos a ver un ejemplo m&aacute;s interesante.

    </p>

    <A NAME="lfindex3">&nbsp;</A>
<H2>&lt;themes&gt;</H2>


    <p>Los temas est&aacute;n contenidos dentro del elemento &lt;themes&gt; que es un elemento hijo de &lt;database&gt;. Cada tema tiene un &uacute;nico Identificador y un t&iacute;tulo, y opcinalmente un resumen (desc) y una imagen (img).
        </p>

    <pre>
&lt;!ELEMENT themes      (theme+)&gt;
  &lt;!ELEMENT theme       (title*, desc?, img?)&gt;
    &lt;!ELEMENT title       (#PCDATA)&gt;
    &lt;!ELEMENT desc       (#PCDATA)&gt;
    &lt;!ELEMENT img         (EMPTY)&gt;
    </pre>

    <p>Algunos de estos elementos pueden tener atributos. Los atributos tambi&eacute;n son definidos en el DTD. Cualquier contenido puede ser atribuido con el elemento xml:lang que indica el lenguaje en el que se describe ese elemento. El valor del atributo debe ser cualquier token de acuerdo con la
       <a href="http://www.everything2.org/index.pl?node_id=781276">ISO 3166 standard</a> para los c&oacute;digos de cada pais.
      Ejemplos son:
      "en", "fr" and "nl". En todos, el identificador y los atributos xml:lang son especificados en la especificaci&oacute;n original de XML y son parte de la sintaxis XML
    </p>

    <pre>
&lt;!ATTLIST theme       id            ID            #REQUIRED&gt;
&lt;!ATTLIST title       xml:lang      NMTOKEN       #REQUIRED&gt;
&lt;!ATTLIST desc        xml:lang      NMTOKEN       #REQUIRED&gt;
&lt;!ATTLIST img         src           CDATA         #REQUIRED&gt;
    </pre>

    <p>Un ejemplo de base de datos podr&iacute;a ser la siguiente:
    </p>

    <pre>
&lt;database&gt;
  &lt;themes&gt;
    &lt;theme id="hw"&gt;
      &lt;title xml:lang="en"&gt;Hardware&lt;/title&gt;
      &lt;img src="Hardware.jpg"/&gt;
    &lt;theme&gt;
  &lt;themes&gt;
&lt;/database&gt;
    </pre>

    <A NAME="lfindex4">&nbsp;</A>
<H2>&lt;issues&gt;</H2>


    <p>Los Asuntos est&aacute;n contenidos en el elemento &lt;issues&gt; . Como ocurr&iacute;a en los temas, cada asunto tiene un &uacute;nico identificador.
    </p>

    <pre>
&lt;!ELEMENT issues      (issue+)&gt;
  &lt;!ELEMENT issue       (title+, published?, file*)&gt;
    &lt;!ELEMENT title       (#PCDATA)&gt;
    &lt;!ELEMENT published   (EMPTY)&gt;
    &lt;!ELEMENT file        (#PCDATA)&gt;
    </pre>

    <p>El elemento &lt;published&gt; indica los asuntos publicados. El siguiente asunto y algunos "pseudoasuntos" traducidos de alg&uacute;n lenguaje a ingl&eacute;s, no tienen ese elemento. El elemento tiene tambi&eacute;n el atributo  @xml:lang. El elemento &lt;file&gt; indica el fichero el cual el asunto ser&aacute; almacenado. No <i>deber&iacute;a</i> ser un puntero al index.html, porque &eacute;ste es el utilizado para determinar la localizaci&oacute;n de los ficheros.

	<p>Un ejemplo (notese que usamos el atributos @code para acortar):

<pre>
    &lt;issue id="ToBeWritten" code="999996"&gt;
      &lt;title xml:lang="en"&gt;Not yet written articles&lt;/title&gt;
    &lt;/issue&gt;
    &lt;issue id="September2001" code="200109"&gt;
      &lt;title xml:lang="en"&gt;September2001&lt;/title&gt;
    &lt;/issue&gt;
</pre>

    <A NAME="lfindex5">&nbsp;</A>
<H2>&lt;persons&gt;</H2>


    <p>La informaci&oacute;n acerca de los autores y traductores est&aacute; almacenada en el elemento
    &lt;person&gt;.  Cada "person" tiene un &uacute;nico identificador.

    <pre>
&lt;!ELEMENT persons (person+)&gt;
&lt;!ELEMENT person
              ((name|email)*,(homepage|nickname|desc|team)*)&gt;
&lt;!ELEMENT email (#PCDATA)&gt;
&lt;!ELEMENT name (#PCDATA)&gt;
&lt;!ELEMENT homepage (#PCDATA)&gt;
&lt;!ELEMENT nickname (#PCDATA)&gt;
&lt;!ELEMENT desc (#PCDATA|%html-els;)*&gt;
&lt;!ELEMENT team EMPTY&gt;
    </pre>

    <p>Una "person" tiene la siguiente informaci&oacute;n: un nombre, una direcci&oacute;n de email (&oacute; m&aacute;s), p&aacute;gina(s) web y un nick. Si la persona tambi&eacute;n forma parte del equipo de traducci&oacute;n, se a&ntilde;ade el elemento &lt;team&gt;. Por ejemplo, la siguiente linea en el elemento &lt;person&gt; significa que Floris pertenece al grupo holand&eacute;s (Dutch team) &lt;xml:lang="nl"/&gt;.
    Por &uacute;ltimo, cada persona tiene una descripci&oacute;n que puede contener enlaces a p&aacute;ginas.

    <p>Un ejemplo ser&iacute;a:

<pre>
    &lt;person id="nl-ew"&gt;
      &lt;name&gt;Egon Willighagen&lt;/name&gt;
      &lt;email&gt;egonw@linuxfocus.org&lt;/email&gt;
      &lt;team xml:lang="nl"/&gt;
    &lt;/person&gt;
</pre>

    <A NAME="lfindex6">&nbsp;</A>
<H2>&lt;articles&gt;</H2>


    <p>Los art&iacute;culos son, por supuesto, la parte m&aacute;s interesante de la base de datos.

    <pre>
  &lt;!ELEMENT articles    (article+)&gt;
    &lt;!ELEMENT article     (title+,
        (file|personref|abstract|issueref|themeref|
         nometa|nohtml|translation|proofread)*)&gt;
      &lt;!ELEMENT abstract    (#PCDATA)&gt;
      &lt;!ELEMENT nohtml      EMPTY&gt;
      &lt;!ELEMENT nometa      EMPTY&gt;
      &lt;!ELEMENT translation
                   (personref*, (reserved|finished|proofread)*)&gt;
      &lt;!ELEMENT reserved    (#PCDATA)&gt;
      &lt;!ELEMENT finished    (#PCDATA)&gt;
      &lt;!ELEMENT proofread   (personref*, (reserved|finished)*)&gt;
&lt;!ATTLIST article     id            ID            #REQUIRED
                      xml:lang      NMTOKEN       #IMPLIED
                      type          (article|coverpage)
                                                  "article"
                      next          IDREF         #IMPLIED
                      prev          IDREF         #IMPLIED&gt;
&lt;!ATTLIST file        xml:lang      NMTOKEN       #REQUIRED
                      type          (target|meta) "target"&gt;
&lt;!ATTLIST translation from          NMTOKEN       #REQUIRED
                      to            NMTOKEN       #REQUIRED&gt;

    </pre>

    <p>Cada art&iacute;culo tiene al menos un t&iacute;tulo, uno para cada lenguaje. El elemento
    &lt;file&gt; puede ser usado para dar la localizaci&oacute;n del fichero del art&iacute;culo, tanto para el formato META y la versi&oacute;n HTML (ver el ejemplo de abajo). En los casos donde la versi&oacute;n META &oacute; la HTML no est&eacute;n disponibles, los elementos opcionales
    &lt;nohtml/&gt; y &lt;nometa/&gt; deber&iacute;an ser usados.
    Cada art&iacute;culo tiene un resumen (abstract). Este resumen es el que se utilizada dentro de la base de datos para crear los &iacute;ndice de las p&aacute;ginas web.
     <p>El elemento &lt;article&gt; tiene 5 atributos: el siempre requerido @ID, un atributo opcional xml:lang para determinar el lenguaje en el que fue originalmente escrito, un atributo @type usado para el comienzo de las p&aacute;ginas, que es usado en las  traducciones  (tambien tratadas como art&iacute;culos). Por &uacute;ltimo, hay dos atributos ocpionales,@next y @prev, los cuales son usados para enlazar art&iacute;culos con otros de naturaleza similar.
    <p>Un art&iacute;culo es asociado a un asunto(issue) y a un tema (theme) con los elementos
    &lt;issueref&gt; y &lt;themeref&gt;. Ambos tienen un atributo @href
    .El valor de este atributo debe ser el identificador asociado al asunto &oacute; al tema.
    <p>Por ejemplo:

<pre>
&lt;article id="article206" xml:lang="en"&gt;
  &lt;title xml:lang="en"&gt;Using XML and XSLT to build
    LinuxFocus.org(/Nederlands)&lt;/title&gt;
  &lt;personref href="nl-ew"/&gt;
  &lt;issueref href="ToBeWritten"/&gt;
  &lt;themeref href="appl"/&gt;
  &lt;abstract xml:lang="en"&gt;
This article shows you how parts of the Dutch web site of LinuxFocus is
generated with XSLT tools from the XML database. It compares this with
the (very) much slower DOM tools in Perl.
  &lt;/abstract&gt;
&lt;/article&gt;
</pre>

    <p>Un elemento &lt;article&gt; ser&iacute;a:

<pre>
&lt;article id="52"&gt;
  &lt;title xml:lang="nl"&gt;Enlightenment&lt;/title&gt;
  &lt;file xml:lang="nl"&gt;Nederlands/July1998/article52.html&lt;/file&gt;
  &lt;translation from="en" to="nl"&gt;
    &lt;personref href="nl-tu"/&gt;
    &lt;reserved&gt;2000-09-06&lt;/reserved&gt;
    &lt;finished&gt;2000-10-04&lt;/finished&gt;
    &lt;proofread&gt;
      &lt;personref href="nl-fl"/&gt;
      &lt;reserved&gt;2000-10-04&lt;/reserved&gt;
      &lt;finished&gt;2000-10-04&lt;/finished&gt;
    &lt;/proofread&gt;
  &lt;/translation&gt;
  &lt;abstract xml:lang="nl"&gt;
Enlightenment is een Linux window-manager met
uitgebreide mogelijkheden.  Dit artikel bespreekt
ze, samen met de installatie en de instelling
van E.  Dit alles is niet voor beginners daar
E op het moment nog in beta-stadium
verkeert.
  &lt;/abstract&gt;
&lt;/article&gt;
</pre>

    <p>Dese cuenta de que esta traducci&oacute;n  (planificada en un determinado tiempo) est&aacute; hecha; y tambi&eacute;n la revisi&oacute;n de esta. En cualquier caso, la persona que hizo el trabajo est&aacute; enlazada con los elementos &lt;personref&gt;.

    <p>Para todos estos elementos, el mejor tutorial es la propia base de datos:
    <ul>
      <li><a href="../../common/src/article206/xml/db/lfdb.en.xml">Base de datos en Ingl&eacute;s</a>
      <li><a href="../../common/src/article206/xml/db/lfdb.nl.xml">Base de datos en Holand&eacute;s</a>
    </ul>

  <A NAME="lfindex7">&nbsp;</A>
<H2>Generaci&oacute;n autom&aacute;tica de p&aacute;ginas Web</H2>


  <p>Una de las razones por la que se cre&oacute; este nuevo formato era la automatizaci&oacute;n en la creaci&oacute;n de los &iacute;ndices. Vamos a ver como este formato nos va a permitir la generaci&oacute;n de estas p&aacute;ginas web.

  <p>Primero, un poco de historia: La primera implementaci&oacute;n usaba m&oacute;dulos en Perl para acceder a la base de datos. La interactuaci&oacute;n era bastante aceptable, sin emargo la imbplemetaci&oacute;n era muy lenta. La informaci&oacute;n estaba contenida en un contenedor XML llamado  Document Object Model (DOM). La mayor&iacute;a de las implementaciones para DOM, eran bastante lentas &oacute;, al menos, mucho m&aacute;s lentas que la alternativa: Simple Application interface for XML (SAX).

  <p>Pero la tarea de generar una p&aacute;gina web ten&iacute;a una tercera alternativa mucho mejor: <a href="http://www.w3.org/TR/xslt">XSLT</a>. Esta es un transformaci&oacute;n basada en XML. Existen  actualmente muchos procesadores XSLT son soportados por la mayor&iacute;a de los lengaujes . Hace tiempo apareci&oacute; un art&iacute;culo en LinuxFocus sobre <a href="../July2000/article156.shtml">XML::XSLT,
  una implementaci&oacute;n de XSLT para Perl</a>. Desde la publicaci&oacute;n de este art&iacute;culo, han aparecido muchas m&aacute;s implementaciones. Aqu&iacute; hay algunas que recomiendo:
  <ul>
    <li><a href="http://www.gingerall.com/">Sablotron</a>
    <li><a href="http://jakarta.apache.org/">Xalan</a>
    <li><a href="http://xmlsoft.org/XSLT/">Xsltproc</a>
  </ul>
   Los ejemplos en el resto del art&iacute;culo usar&aacute;n Sablotron.

  <p>Un procesador XSLT toma dos ficheros como entrada: Uno es el fichero XML fuente utilizado para la transformaci&oacute;n. El otro es una hoja de estilo XSL que define la transformaci&oacute;n. Para la generaci&oacute;n de p&aacute;ginas Web hay disponbiles las siguientes hojas de estilo XSLT:
  <ul>
    <li><a href="../../common/src/article206/xml/stylesheets/issues.xslt">issues.xslt</a><br>
      Esta hoja de estilo genera una lista de asuntos (issues), con sus respectivos art&iacute;culos.
    <li><a href="../../common/src/article206/xml/stylesheets/issuetoc.xslt">issuetoc.xsl</a><br>
      Genera una tabla de contenidos para un cierto asunto (issue).
    <li><a href="../../common/src/article206/xml/stylesheets/issuetoc_full.xslt">issuetoc_full.xslt</a><br>
      Como el anterior, pero con m&aacute;s informaci&oacute;n.
    <li><a href="../../common/src/article206/xml/stylesheets/mainindex.xslt">mainindex.xslt</a><br>
      Genera una lista de art&iacute;culos con informaci&oacute;n acerca del estado de la traducci&oacute;n.
    <li><a href="../../common/src/article206/xml/stylesheets/previssues.xslt">previssues.xslt</a><br>
      Genera una lista de todos los asuntos que est&aacute;n siendo publicados.
    <li><a href="../../common/src/article206/xml/stylesheets/recently_translated.xslt">recently_translated.xslt</a><br>
      Los 10 art&iacute;culos traducidos recientemente.
    <li><a href="../../common/src/article206/xml/stylesheets/rss.xslt">rss.xslt</a><br>
      Genera un fichero RSS con los art&iacute;culos traducidos recientemente.
    <li><a href="../../common/src/article206/xml/stylesheets/theme.xslt">theme.xslt</a><br>
      Genera un p&aacute;gina web con los &iacute;ndices de un cierto tema.
    <li><a href="../../common/src/article206/xml/stylesheets/themes_index.xslt">themes_index.xslt</a><br>
      Genera un &iacute;ndice con todos los temas.
    <li><a href="../../common/src/article206/xml/stylesheets/vertaald.xslt">vertaald.xslt</a><br>
      Muestra todos los art&iacute;culos traducidos para un cierto lenguaje.
  </ul>
  Estas hojas de estilo no son las &uacute;ltimas versiones. Contacte conmigo &oacute; con uno de nuestros editores en el equipo de traducci&oacute;n de Holanda para obtener la versiones m&aacute;s recientes.

  <p>Para generar el mainindex.html, por ejemplo, el grupo holand&eacute;s ejecuta:

<pre>
sabcmd stylesheets/mainindex.xslt db/lfdb.nl.xml > ../mainindex.html
</pre>

  <p>Las hojas de estilo conocen donde est&aacute; la base de datos ra&iacute;z inglesa, y necesitan de conocer la base de datos como una entrada XML. Algunas hojas necesitan tambi&eacute;n par&aacute;metros adicionales:

<pre>
sabcmd stylesheets/theme.xslt db/lfdb.nl.xml '$theme=appl' > ../Themes/appl.html
</pre>

  <p>El &iacute;ndice Holand&eacute;s <a href="../../Nederlands/index.html">index.html</a> es tambi&eacute;n generado desde la base de datos, pero utiliza una configuraci&oacute;n un poco m&aacute;s compleja. El index.html est&aacute; hecho desde el  <a href="http://main.linuxfocus.org/~guido/dev/#lfpagecomposer">lfpagecomposer</a> de por Guid Socher desde un conjunto de ficheros de entrada preprocesados.
  Y estos ficheros de entrada preprocesados son generados desde un conjunto de ficheros con extensi&oacute;n .pre, tales como:
<pre>
&lt;H2>Vorige nummers&lt;/H2>

&lt;p>Dit zijn de uitgaven van LinuxFocus in het Nederlands:
&lt;ul>
&lt;!-- macro xslt previssues -->
&lt;/ul>
</pre>

<pre>
&lt;H2&gt;Recent vertaalde artikelen&lt;/H2&gt;
&lt; macro xslt recently_translated --&gt;
<!-- macro xslt recently_translated -->
</pre>

  Estos ficheros son simplemente fragmentos de c&oacute;digo HTML que, como una macro, aplican una hoja de estilo a la base de datos. El procesamiento est&aacute; hecho con un programa llamado
  <a href="../../common/src/article206/xml/bin/apply_stylesheets.pl">apply_stylesheets.pl</a>
  que busca comandos &lt;!-- macro xslt [stylesheet] --&gt; y analiza la base de datos con el comando. Dese cuenta de que la extensi&oacute;n .xslt est&aacute; omitida. Nuestro
  <a href="../../Nederlands/WorkSpace/Index/Makefile">Makefile</a> contiene:

<pre>
%.shtml: %.pre
        @echo "Making $*..."
        @../../xml/bin/apply_stylesheets.pl $*.pre
</pre>

  <p>Los ficheros *.shtml resultantes son usados por el script lfpagecomposer. Las hojas de estilo que son usadas para generar el index.html son:
  issuetoc.xslt, previssues.xslt y recently_translated.xslt.

  <A NAME="lfindex8">&nbsp;</A>
<H2>Localizando</H2>


  <p>Para usar este sistema para otros lenguajes, necesitas hacer lo siguiente:
  <ol>
    <li>Localizar la base de datos XML (por ejemplo lfdb.nl.xml)
    <li>Localizar las hojas de estilo
  </ol>

  <p>El siguiente paso es un poco deplorable. En un principio, solo el texto de salida necesita ser localizado, pero las hojas de estilo no tienen una propiedad de localizaci&oacute;n todav&iacute;a. Esto es posible e intentar&eacute; ver como se implementa.

  <p>Recomiendo dise&ntilde;ar una DTD usando un editor XML conocido. En Emnacs, por ejemplo, usa el modo principal
  <a href="http://www.lysator.liu.se/projects/about_psgml.html">psgml</a>
    Este te proporcionar&aacute; la posibilidad de validar el documento (con <a href="http://www.jclark.com/sp/nsgmls.htm">nsgmls</a>).
  Esto ayudar&aacute; a eliminar bastantes errores. En Emacs tambi&eacute;n puedes usar el bot&oacute;n derecho del rat&oacute;n para ver los elementos y atributos que puedes insertar en un  determinado lugar de la especificaci&oacute;n del fichero XML. (Gracias a Jaime Villate por su excelente charla en la LSM conferenia en Burdeos este a&ntilde;o.)

  <p>Otra gran ayuda es la localizaci&oacute;n Holandesa de la base de datos XML. Si tienes problemas ejecut&aacute;ndola puedes consultar este fichero. Debes tener en cuenta que el aunque el contenido est&aacute; la mayor&iacute;a en Holand&eacute;s, puedes ver como est&aacute;n organizados los elementos dentro de la base de datos. Si, a&uacute;n as&iacute;, tienes dudas, tambi&eacute;n puedes
  <a href="mailto:egonw@linuxfocus.org">enviarme un email</a>.

  <p>Localizar las hojas de estilo es probablemetne un poco delicado. El texto est&aacute; entremezclado con los comandos XSLT. No debes tocarlo ( a no ser que tu sepas de verdad lo que est&aacute;s haciendo). Planeo en un futuro localizar la shojas de estilo de forma que solo necesites editar un fichero que contenga las traducciones de los comandos XSLT, pero esto todav&iacute;a no est&aacute; hecho.

  <A NAME="lfindex9">&nbsp;</A>
<H2>Planes futuros</H2>


  <p>El documento anterior ayudarte para comenzar en el tema. La mayor&iacute;a de las cosas se pueden copiar/pegar desde los ficheros Holandeses. Todos los ficheros est&aacute;n bajo licencia FDL y GPL. En el a&ntilde;o pr&oacute;ximo estos son mis planes para el sistema:
  <ul>
    <li>Localizar las hojas de estilo
    <li>A&ntilde;adir nuvas hojas de estilo (para top_authors.html, top_translateres.html y otras cosas que me gustar&iacute;a ver como p&aacute;ginas web)
    <li>Posiblemente un interface para controlar una base de datos relacional como MySQL.
    <li>Integrar el sistema con otras herramientas de LinuxFocus (como getticket etc...)
  </ul>

  


<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://www.linuxfocus.org/cgi-bin/lftalkback?anum=206&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Egon Willighagen, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://www.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article206.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:egonw@linuxfocus.org"><FONT COLOR="#FFFFFF">Egon Willighagen</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>en</font></td>
    <td><font size=2><a href="mailto:sherm_pbody@yahoo.com"><FONT COLOR="#FFFFFF">Lorne Bailey</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:supermoises@terra.es"><FONT COLOR="#FFFFFF">Mois&eacute;s Gonz&aacute;lez </FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-10-09, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
