<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Redes en Linux Como (Previamente Net-3 Como): Informaci&oacute;n gen&eacute;rica sobre la configuraci&oacute;n de redes.</TITLE>
 <LINK HREF="Redes-En-Linux-Como-6.html" REL=next>
 <LINK HREF="Redes-En-Linux-Como-4.html" REL=previous>
 <LINK HREF="Redes-En-Linux-Como.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="Redes-En-Linux-Como-6.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-4.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc5">Índice general</A>
<HR>
<H2><A NAME="s5">5. Informaci&oacute;n gen&eacute;rica sobre la configuraci&oacute;n de redes.</A></H2>

<P>
<P>Las siguientes subsecciones las necesitar&aacute; para saber y comprender
ciertas cosas antes de que intente configurar la red. Son principios
fundamentales que se aplican independientemente de la naturaleza exacta
de la red que desee organizar.
<P>
<H2><A NAME="ss5.1">5.1 ¿Qu&eacute; necesito para comenzar?</A>
</H2>

<P>
<P>Antes de que empiece a construir o configurar la red necesita saber
algunas cosas. Las m&aacute;s importantes son:
<P>
<H3>C&oacute;digo fuente del n&uacute;cleo.</H3>

<P>
<P>Antes que nada:
<P>La mayor&iacute;a de las distribuciones vienen por defecto con el soporte de red
activado, por lo cual no habr&aacute; que recompilar el n&uacute;cleo. Si tiene
hardware com&uacute;n, deber&iacute;a irle bien. Por ejemplo, tarjetas de red  3COM,
NE2000, o Intel.  Sin embargo proporcionamos la siguiente informaci&oacute;n por
si necesita actualizar el n&uacute;cleo.
<P>Como puede ser que el n&uacute;cleo que est&aacute; ejecutando no est&eacute; preparado para
los tipos de red o tarjetas que desee usar, probablemente necesitar&aacute; las
fuentes del n&uacute;cleo para recompilarlo con las opciones apropiadas.
<P>Siempre puede obtener la &uacute;ltima versi&oacute;n de CDROM.com <BR> <CODE>
<A HREF="ftp://ftp.cdrom.com/pub/linux/sunsite/kernel.org/pub/linux/kernel">ftp://ftp.cdrom.com/pub/linux/sunsite/kernel.org/pub/linux/kernel</A></CODE>.  Este no es el sitio oficial, pero tiene un GRAN ancho de banda y
permite que MUCHOS usuarios conecten simult&aacute;neamente. El sitio oficial es
<CODE>kernel.org</CODE>, pero use el anterior si tiene la posibilidad. Por favor,
recuerde que <CODE>ftp.kernel.org</CODE> est&aacute; seriamente sobrecargado. Use un
servidor r&eacute;plica.
<P>Normalmente las fuentes del n&uacute;cleo se instalar&aacute;n en el directorio
<CODE>/usr/src/linux</CODE>. Para m&aacute;s informaci&oacute;n sobre c&oacute;mo aplicar parches
y construir el n&uacute;cleo deber&iacute;a leer el <CODE>
<A HREF="Kernel-Como.html">Kernel Como</A></CODE>. Para m&aacute;s informaci&oacute;n sobre c&oacute;mo configurar
m&oacute;dulos del n&uacute;cleo deber&iacute;a leer el <I>Modules mini-Howto</I>. Adem&aacute;s, el
fichero <CODE>README</CODE> que hay en las fuentes del n&uacute;cleo y el directorio
<CODE>Documentation</CODE> son muy ilustrativos para el lector intr&eacute;pido.
<P>A menos que se diga espec&iacute;ficamente lo contrario, recomiendo que empiece
con la versi&oacute;n est&aacute;ndar del n&uacute;cleo (la que tenga un n&uacute;mero par como
segundo d&iacute;gito del n&uacute;mero de versi&oacute;n). Las versiones de desarrollo del
n&uacute;cleo (las que tienen el segundo d&iacute;gito impar) podr&iacute;an tener algunos
cambios estructurales u otros que podr&iacute;an causar problemas con otro
software en su sistema. Si no est&aacute; seguro de que pueda resolver ese tipo
de problemas sumado al potencial de que haya otros errores de software,
no los use.
<P>Por otro lado, algunas de las capacidades aqu&iacute; descritas han sido
introducidas durante el desarrollo de los n&uacute;cleos <CODE>2.1</CODE>, por lo que
tendr&aacute; que tomar una decisi&oacute;n: puede mantenerse en <CODE>2.0</CODE> mientras
espera por el <CODE>2.2</CODE> y por una distribuci&oacute;n con cada herramienta
actualizada, o puede coger un <CODE>2.1</CODE> y buscar los diversos programas
necesarios para explotar las nuevas capacidades.  En el momento de
escribir este Como, en Agosto de 1998, el n&uacute;cleo disponible es el
<CODE>2.1.115</CODE> y se espera que el <CODE>2.2</CODE> aparezca pronto.
<P><CODE>Nota del Traductor</CODE>: En el momento en que acab&oacute; la traducci&oacute;n de
este Como, en septiembre de 1999, las versiones disponibles del n&uacute;cleo
son la <CODE>2.2.12</CODE> (estable) y la <CODE>2.3.16</CODE> (desarrollo). Adem&aacute;s, las
principales distribuciones han puesto al d&iacute;a sus herramientas para tratar
las capacidades de la serie <CODE>2.1</CODE> y superiores.
<P>
<H3>Herramientas de red actualizadas.</H3>

<P>
<P>Las herramientas de red son los programas que usted usa para configurar
los dispositivos de red de linux. Estas herramientas permiten asignar
direcciones a dispositivos y configurar rutas, por ejemplo.
<P>La mayor&iacute;a de distribuciones modernas de Linux est&aacute;n dotadas con las
herramientas de red, por lo que si ha instalado Linux a partir de una
distribuci&oacute;n y no ha instalado las herramientas de red, deber&iacute;a hacerlo.
<P>Si no ha instalado a partir de una distribuci&oacute;n entonces necesitar&aacute; las
fuentes para compilar las herramientas usted mismo. No es dif&iacute;cil.
<P>Las herramientas de red las mantiene ahora Bernd Eckenfelds y est&aacute;n
disponibles en:
<P><CODE>
<A HREF="ftp://ftp.inka.de/pub/comp/Linux/networking/NetTools/">ftp://ftp.inka.de/pub/comp/Linux/networking/NetTools/</A></CODE> y est&aacute;n
replicadas en: <CODE>
<A HREF="ftp://ftp.uk.linux.org/pub/linux/Networking/base/">ftp://ftp.uk.linux.org/pub/linux/Networking/base/</A></CODE>.
<P>Tambi&eacute;n puede encontrar los &uacute;ltimos paquetes de RedHat en <CODE>
<A HREF="ftp://ftp.cdrom.com/pub/linux/redhat/redhat-6.0/i386/base/">ftp://ftp.cdrom.com/pub/linux/redhat/redhat-6.0/i386/base/net-tools-1.51-3.i386.rpm</A></CODE>.
<P>Para Debian, los paquetes que traen las principales herramientas son los
paquetes <CODE>hostname</CODE>, <CODE>netbase</CODE> y <CODE>netstd</CODE>, que
encontrar&aacute; en <CODE>
<A HREF="ftp://ftp.debian.org/debian/dists/stable/main/binary-i386/base/">ftp://ftp.debian.org/debian/dists/stable/main/binary-i386/base/</A></CODE>.
<P>Aseg&uacute;rese de que elige la versi&oacute;n que m&aacute;s se ajuste al n&uacute;cleo que
desee usar y siga las instrucciones del paquete para instalarlo.
<P>Para instalar y configurar la versi&oacute;n actual, ---en el momento de
traducirse esto--- esto necesitar&aacute; hacer lo siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
usuario% cd /usr/src
usuario% tar xvfz net-tools-x.xx.tar.gz
usuario% cd net-tools-x.xx
usuario% make config
usuario% make
root# make install
</PRE>
</CODE></BLOCKQUOTE>
<P>O si no, use los paquetes de su distribuci&oacute;n. Por ejemplo, con RedHat:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# rpm -U net-tools-x.xx-y.i386.rpm
</PRE>
</CODE></BLOCKQUOTE>
<P>y con Debian:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# dpkg -i hostname_x.xx-y.yy.deb
root# dpkg -i netbase_x.xx-y.yy.deb
root# dpkg -i netstd_x.xx-y.yy.deb
</PRE>
</CODE></BLOCKQUOTE>
<P>En los anteriores ejemplos, <CODE>x.xx</CODE> se refiere a la versi&oacute;n de las
herramientas, e <CODE>y.yy</CODE> a la revisi&oacute;n de los correspondientes
paquetes.
<P>Si adem&aacute;s va a configurar un cortafuegos o a usar la caracter&iacute;stica de IP
Masquerade, necesitar&aacute; <CODE>ipfwadm</CODE>.  La &uacute;ltima versi&oacute;n la puede
obtener en: <CODE>
<A HREF="ftp:/ftp.xos.nl/pub/linux/ipfwadm">ftp:/ftp.xos.nl/pub/linux/ipfwadm</A></CODE>.  De nuevo se encontrar&aacute;
con m&aacute;s de una versi&oacute;n disponible. Aseg&uacute;rese de coger la versi&oacute;n que m&aacute;s
se ajuste a su n&uacute;cleo. Tenga en cuenta que las capacidades de cortafuegos
de Linux cambiaron durante el desarrollo <CODE>2.1</CODE> y <CODE>ipfwadm</CODE> ha
sido sustituida por <CODE>ipchains</CODE> en la versi&oacute;n <CODE>2.2</CODE> del n&uacute;cleo.
<CODE>ipfwadm</CODE> s&oacute;lo vale para la versi&oacute;n <CODE>2.0</CODE> del n&uacute;cleo. Se sabe
de estas distribuciones que se ajustan a versiones <CODE>2.0</CODE> o anteriores
del n&uacute;cleo:
<P>
<UL>
<LI>Redhat 5.2 o anteriores</LI>
<LI>Caldera antes de la versi&oacute;n 2.2</LI>
<LI>Slackware antes de las versiones 4.x</LI>
<LI>Debian antes de las versiones 2.x</LI>
</UL>
<P>Para instalar y configurar la versi&oacute;n actual en el momento de escribir
esto necesita leer el <I>IPChains Howto</I>, disponible en el Proyecto de
Documentaci&oacute;n de Linux <CODE>
<A HREF="http://www.linuxdoc.org/">http://www.linuxdoc.org</A></CODE>
<P>Tenga en cuenta que si tiene una versi&oacute;n <CODE>2.2</CODE> (o <CODE>2.1</CODE> de las
&uacute;ltimas) del n&uacute;cleo, <CODE>ipfwadm</CODE> no es la herramienta correcta para
configurar un cortafuegos. Esta versi&oacute;n del <I>NET-3-HOWTO</I> todav&iacute;a no
trata con la nueva configuraci&oacute;n de cortafuegos. Si necesita informaci&oacute;n
m&aacute;s detallada sobre <CODE>ipchains</CODE>, por favor, dir&iacute;jase al documento
mencionado anteriormente.  
<P>
<P>
<H3>Aplicaciones de red.</H3>

<P>
<P>Las aplicaciones de red son programas como <CODE>telnet</CODE> y <CODE>ftp</CODE>
y sus respectivos programas servidores. David Holland estuvo manteniendo
una distribuci&oacute;n de las m&aacute;s comunes de la que ahora se ocupa 
<A HREF="mailto:netbug@ftp.uk.linux.org">:netbug@ftp.uk.linux.org</A>.
Puede obtenerlas en: <CODE>
<A HREF="ftp://ftp.uk.linux.org/pub/linux/Networking/base">ftp://ftp.uk.linux.org/pub/linux/Networking/base</A></CODE>.
<P>
<H3>Introducci&oacute;n a las direcciones IP.</H3>

<P>
<P>Las direcciones del Protocolo Internet (IP) est&aacute;n compuestas por cuatro
bytes. La convenci&oacute;n es escribir estas direcciones en la denominada
«notaci&oacute;n decimal puntuada» (<I>dotted decimal notation</I>). De esta forma
cada byte es convertido en un n&uacute;mero decimal (0-255), despreciando los
ceros a la izquierda a menos que el n&uacute;mero en s&iacute; sea cero.  Por
convenci&oacute;n, cada interfaz de una m&aacute;quina o encaminador tiene una
direcci&oacute;n IP. Es v&aacute;lido usar la misma IP para cada interfaz de una sola
m&aacute;quina en algunas circunstancias, pero normalmente cada interfaz tiene
su propia direcci&oacute;n.
<P>Las Redes basadas en <I>Internet Procotol</I> son secuencias contiguas de
direcciones IP.  Todas las direcciones dentro de una red tienen un n&uacute;mero
de d&iacute;gitos de en com&uacute;n. A la porci&oacute;n de la red que es com&uacute;n a todas las
direcciones llama la «porci&oacute;n de la red». Los d&iacute;gitos restantes son
llamados «porci&oacute;n de la m&aacute;quina». Al n&uacute;mero de bits que comparten todas
las direcciones de una red se le llama m&aacute;scara de red (<I>netmask</I>), y
su papel es determinar qu&eacute; direcciones pertenecen a la red y cu&aacute;les no.
Consideremos el siguiente ejemplo:
<P>
<BLOCKQUOTE><CODE>
<PRE>
---------------------  ---------------
Direcci&oacute;n Host         192.168.110.23
M&aacute;scara de red         255.255.255.0
Porci&oacute;n de red         192.168.110.
Porci&oacute;n de Host        .23
---------------------  ---------------
Direcci&oacute;n de Red       192.168.110.0
Direcci&oacute;n de Difusi&oacute;n  192.168.110.255
---------------------  ---------------
</PRE>
</CODE></BLOCKQUOTE>
<P>Cualquier direcci&oacute;n a la que se aplique una operaci&oacute;n <I>and</I> de bits
con su m&aacute;scara de red, revelar&aacute; la direcci&oacute;n de la red a la que
pertenece. La direcci&oacute;n de red es por tanto siempre el menor n&uacute;mero de
direcci&oacute;n dentro de el rango de la red y siempre tiene la porci&oacute;n de
m&aacute;quina codificada toda con ceros.
<P>La direcci&oacute;n «de difusi&oacute;n» (<I>broadcast</I>) es una especial a la que
escucha cada m&aacute;quina en la red adem&aacute;s de a la suya propia. Esta direcci&oacute;n
es a la que se env&iacute;an los datagramas si se supone que todas las m&aacute;quinas
de la red lo deben recibir. Ciertos tipos de datos, como la informaci&oacute;n
de encaminamiento y los mensajes de aviso son transmitidos a la direcci&oacute;n
de difusi&oacute;n para que cada estaci&oacute;n en la red pueda recibirlo
simult&aacute;neamente. Hay dos est&aacute;ndares usados com&uacute;nmente al respecto de la
direcci&oacute;n de difusi&oacute;n. El m&aacute;s ampliamente aceptado es el de usar la
direcci&oacute;n m&aacute;s alta posible en la red. En el ejemplo anterior ser&iacute;a
<CODE>192.168.110.255</CODE>. Por alguna raz&oacute;n, otras estaciones han adoptado
la convenci&oacute;n de usar las direcciones de red como direcciones de
difusi&oacute;n. En la pr&aacute;ctica no importa mucho cual use, pero aseg&uacute;rese de que
cada m&aacute;quina en la red est&aacute; configurada con la misma.
<P>Por razones administrativas, durante el desarrollo inicial del protocolo
IP se formaron, de forma arbitraria, algunos grupos de direcciones como
redes, y estas redes se agruparon en las llamadas «clases».  Estas clases
proporcionan un cierto n&uacute;mero de redes de tama&ntilde;o est&aacute;ndar que pueden ser
reservadas. Los rangos reservados son:
<P>
<BLOCKQUOTE><CODE>
<PRE>
----------------------------------------------------------
| Clase   | M&aacute;scara de    | Direcciones de red           |
| de red  | red           |                              |
----------------------------------------------------------
|    A    | 255.0.0.0     | 0.0.0.0    - 127.255.255.255 |
|    B    | 255.255.0.0   | 128.0.0.0  - 191.255.255.255 |
|    C    | 255.255.255.0 | 192.0.0.0  - 223.255.255.255 |
|Multicast| 240.0.0.0     | 224.0.0.0  - 239.255.255.255 |
----------------------------------------------------------
</PRE>
</CODE></BLOCKQUOTE>
<P>Las direcciones que deber&aacute; usar dependen de lo que vaya a hacer
exactamente. Puede que tenga que realizar varias de las siguientes
actividades para obtener las direcciones que necesite:
<P>
<DL>
<P>
<DT><B>Instalar una m&aacute;quina Linux en una red IP existente</B><DD><P>Si
desea instalar una m&aacute;quina Linux en una red IP existente entonces
deber&iacute;a contactar con los administradores de la red y preguntarles por
la siguiente informaci&oacute;n:
<P>
<UL>
<LI>Direcci&oacute;n IP del Host</LI>
<LI>Direcci&oacute;n IP de la red</LI>
<LI>Direcci&oacute;n IP de broadcast</LI>
<LI>M&aacute;scara de red IP</LI>
<LI>Direcci&oacute;n del encaminador (router)</LI>
<LI>Direcci&oacute;n del Servidor de Nombre de Dominio (DNS)</LI>
</UL>
<P>Deber&iacute;a configurar entonces el dispositivo de red Linux con esos
detalles. No puede inventarlos y esperar que la configuraci&oacute;n funcione.
<P>
<DT><B>Construir una nueva red propia que nunca conectar&aacute; con
Internet</B><DD><P>Si est&aacute; construyendo una red privada y no tiene intenci&oacute;n
de conectar nunca esa red a Internet entonces puede elegir las
direcciones que quiera. De todas maneras, por razones de seguridad y
consistencia, se han reservado algunas direcciones IP de red
espec&iacute;ficamente para este prop&oacute;sito. Est&aacute;n descritas en el RFC1597 y son
las que siguen:
<P>
<BLOCKQUOTE><CODE>
<PRE>
-----------------------------------------------------------
|      DIRECCIONES RESERVADAS PARA REDES PRIVADAS         |
-----------------------------------------------------------
| Clase   | M&aacute;scara de    | Direcciones de red            |
| de red  | red           |                               |
-----------------------------------------------------------
|    A    | 255.0.0.0     | 10.0.0.0    - 10.255.255.255  |
|    B    | 255.255.0.0   | 172.16.0.0  - 172.31.255.255  |
|    C    | 255.255.255.0 | 192.168.0.0 - 192.168.255.255 |
-----------------------------------------------------------
</PRE>
</CODE></BLOCKQUOTE>
<P>Primero deber&iacute;a decidir cu&aacute;n grande quiere que sea su red para entonces
elegir tantas direcciones como necesite.
<P>
</DL>
<P>
<H2><A NAME="ss5.2">5.2 ¿D&oacute;nde deber&iacute;a poner las &oacute;rdenes de configuraci&oacute;n?</A>
</H2>

<P>
<P>Hay unas pocas opciones a elegir para el procedimiento de arranque del
sistema Linux. Despu&eacute;s de que carga el n&uacute;cleo, siempre ejecuta un
programa llamado <CODE>init</CODE>. El programa <CODE>init</CODE> lee entonces el fichero
de configuraci&oacute;n llamado <CODE>/etc/inittab</CODE> y comienza el proceso de
arranque. Hay unos pocos <CODE>init</CODE> diferentes, aunque todo el mundo est&aacute;
ahora convergiendo al modelo <I>SystemV</I>, desarrollado por Miguel van
Smoorenburg.
<P>A pesar de que el programa <CODE>init</CODE> sea el mismo, la configuraci&oacute;n del
arranque del sistema est&aacute; organizada de manera diferente en cada
distribuci&oacute;n.
<P>Normalmente el fichero <CODE>/etc/inittab</CODE> contiene una entrada que
dice algo como:
<P>
<BLOCKQUOTE><CODE>
<PRE>
si::sysinit:/etc/init.d/boot
</PRE>
</CODE></BLOCKQUOTE>
<P>Esta l&iacute;nea especifica el nombre del fichero de gui&oacute;n de ejecuci&oacute;n
(script) que controla la secuencia de carga. Este fichero es algo as&iacute;
como el <CODE>AUTOEXEC.BAT</CODE> en MS-DOS.
<P>El gui&oacute;n de arranque suele llamar a otros, y a menudo la red se configura
dentro de alguno de &eacute;stos.
<P>La siguiente tabla puede ser usada como gu&iacute;a para su sistema:
<P>
<BLOCKQUOTE><CODE>
<PRE>
----------------------------------------------------------------------
Distrib. |Interfaz Configuraci&oacute;n/Encaminado  |Iniciaci&oacute;n del Servidor
----------------------------------------------------------------------
Debian   | /etc/init.d/network               | /etc/rc2.d/*
----------------------------------------------------------------------
Slackware| /etc/rc.d/rc.inet1                | /etc/rc.d/rc.inet2
----------------------------------------------------------------------
RedHat   | /etc/rc.d/init.d/network          | /etc/rc.d/rc3.d/*
----------------------------------------------------------------------
</PRE>
</CODE></BLOCKQUOTE>
<P>F&iacute;jese en que Debian y Red Hat usan un directorio entero de guiones que
«levantan» los servicios del sistema (y normalmente la informaci&oacute;n no se
encuentra en esos archivos; por ejemplo, el sistema de Red Hat almacena
toda la configuraci&oacute;n del sistema en ficheros dentro de
<CODE>/etc/sysconfig</CODE>, de donde es le&iacute;da por los guiones de carga). Si
quiere comprender los detalles del proceso de arranque del sistema, le
sugiero que examine <CODE>/etc/inittab</CODE> y la documentaci&oacute;n que acompa&ntilde;a
a <CODE>init</CODE>. Linux Journal va a publicar (o lo ha hecho ya) un
art&iacute;culo tratando la iniciaci&oacute;n del sistema, y este documento mantendr&aacute;
una referencia a &eacute;l tan pronto como est&eacute; disponible en la red.
<P>La mayor&iacute;a de distribuciones modernas incluyen alg&uacute;n programa que le
permita configurar la mayor&iacute;a de interfaces de red. Si tiene una de &eacute;stas
entonces deber&iacute;a ver si hace lo que usted quiere antes de acudir a la
configuraci&oacute;n manual.
<P>
<BLOCKQUOTE><CODE>
<PRE>
--------------------------------------------
Distrib.  | Programa de configuraci&oacute;n de red
--------------------------------------------
RedHat    | /sbin/netcfg
Slackware | /sbin/netconfig
--------------------------------------------
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss5.3">5.3 Creaci&oacute;n de las interfaces de red.</A>
</H2>

<P>
<P>En muchos sistemas operativos Unix los dispositivos de red tienen
correspondencias en el directorio <CODE>/dev</CODE>. Esto <B>no</B> pasa en
Linux.  Los dispositivos de red se crean de forma din&aacute;mica y por tanto no
requieren de la presencia de ficheros de dispositivo.
<P>En la mayor&iacute;a de los casos los dispositivos de red son creados
autom&aacute;ticamente por el controlador de dispositivos mientras se inicia y
localiza el hardware. Por ejemplo, el controlador Ethernet crea interfaces
<CODE>eth[0..n]</CODE> secuencialmente seg&uacute;n va encontrado tarjetas Ethernet. La
primera tarjeta que encuentra es <CODE>eth0</CODE>, la segunda <CODE>eth1</CODE>, etc.
<P>Sin embargo, en algunos casos, de los que <CODE>slip</CODE> y <CODE>ppp</CODE> son
ejemplos notables, los dispositivos de red son creados por la acci&oacute;n de
alg&uacute;n programa de usuario. Se aplica la misma numeraci&oacute;n secuencial de
dispositivos, pero no se crean al arrancar. La raz&oacute;n es que al contrario
que con los dispositivos Ethernet, el n&uacute;mero de dispositivos <CODE>ppp</CODE> o
<CODE>slip</CODE> puede variar durante la actividad de la m&aacute;quina. Estos casos
ser&aacute;n cubiertos con m&aacute;s detalle en secciones posteriores.
<P>
<H2><A NAME="Ethernet"></A> <A NAME="ss5.4">5.4 Configuraci&oacute;n de una interfaz de red.</A>
</H2>

<P>
<P>Cuando tenga todos los programas necesarios y su direcci&oacute;n e informaci&oacute;n
de red, puede configurar la interfaz de red. Cuando hablamos de
configurar una interfaz de red nos referimos al proceso de asignar
direcciones apropiadas a un dispositivo y asignar valores adecuados a
otros par&aacute;metros configurables.  El programa usado m&aacute;s com&uacute;nmente para
hacer esto es la orden <CODE>ifconfig</CODE> (<B>i</B>nter<B>f</B>ace
<B>config</B>ure).
<P>Lo normal ser&aacute; usar una orden similar a la siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# ifconfig eth0 192.168.0.1 netmask 255.255.255.0 up
</PRE>
</CODE></BLOCKQUOTE>
<P>En este caso estoy configurando la interfaz Ethernet <CODE>eth0</CODE>, con
direcci&oacute;n IP <CODE>192.168.0.1</CODE> y m&aacute;scara de red <CODE>255.255.255.0</CODE>. El
`<CODE>up</CODE> del final de la orden le dice al interfaz que deber&iacute;a activarse,
pero normalmente se puede omitir, ya que es el valor por defecto. Para
desactivar una interfaz, simplemente tiene que ejecutar <CODE>ifconfig eth0
down</CODE>.
<P>El n&uacute;cleo asume ciertas cosas cuando configura interfaces. Por ejemplo,
puede especificar la direcci&oacute;n de red y difusi&oacute;n de una interfaz, pero
si usted no lo hace, como en mi ejemplo anterior, entonces el n&uacute;cleo har&aacute;
una suposici&oacute;n razonable de cu&aacute;les deber&iacute;an ser, bas&aacute;ndose en la m&aacute;scara
que se le proporciona; si tampoco indica la m&aacute;scara, entonces partir&aacute;
de la clase de la direcci&oacute;n IP configurada. En mi ejemplo, el n&uacute;cleo
asumir&aacute; que se va a configurar una red clase C en la interfaz y establece
una direcci&oacute;n de red <CODE>192.168.0.0</CODE> y una direcci&oacute;n de difusi&oacute;n
<CODE>192.168.0.255</CODE>.  Hay otras muchas opciones para la orden <CODE>ifconfig</CODE>.
Las mas importantes son:
<P>
<DL>
<P>
<DT><B>up</B><DD><P>esta opci&oacute;n activa una interfaz (y es la opci&oacute;n por defecto).
<P>
<DT><B>down</B><DD><P>esta opci&oacute;n desactiva una interfaz.
<P>
<DT><B>[-]arp</B><DD><P>esta opci&oacute;n activa o desactiva el uso del protocolo
de resoluci&oacute;n de direcci&oacute;n (<B>a</B>ddress <B>r</B>esolution <B>p</B>rotocol) sobre
la interfaz
<P>
<DT><B>[-]allmulti</B><DD><P>esta opci&oacute;n activa o desactiva la recepci&oacute;n de
todos los paquetes multicast por hardware. El multicast por hardware
permite que varios grupos de interfaces reciban paquetes remitidos a
destinos especiales. Esto puede ser de importancia si est&aacute; usando
aplicaciones como videoconferencia, pero normalmente no se usa.
<P>
<DT><B>mtu N</B><DD><P>este par&aacute;metro le permite especificar la MTU del dispositivo.
<P>
<DT><B>netmask &lt;direc></B><DD><P>este par&aacute;metro le permite asignar la m&aacute;scara de
la red a la que pertenece el dispositivo.
<P>
<DT><B>irq &lt;direc></B><DD><P>este par&aacute;metro s&oacute;lo trabaja con ciertos tipos de
hardware, y permite especificar la IRQ del dispositivo.
<P>
<DT><B>[-]broadcast [direc]</B><DD><P>este par&aacute;metro le permite activar y
asignar la acepci&oacute;n de datagramas destinados a la direcci&oacute;n de difusi&oacute;n,
o desactivarla por completo.
<P>
<DT><B>[-]pointopoint [direc]</B><DD><P>este par&aacute;metro le permite asignar
la direcci&oacute;n de la m&aacute;quina en el otro extremo de un enlace punto a punto,
como en SLIP o PPP.
<P>
<DT><B>hw &lt;tipo> &lt;direc></B><DD><P>este par&aacute;metro le permite asignar la
direcci&oacute;n del hardware de ciertos tipos de dispositivos de red. Esto no
suele ser &uacute;til para Ethernet, pero lo es para otras redes como AX.25.
<P>
</DL>
<P>Puede usar la orden <CODE>ifconfig</CODE> sobre cualquier dispositivo de red.
Algunos programas de usuario, como <CODE>pppd</CODE> y <CODE>dip</CODE> configuran
autom&aacute;ticamente los dispositivos de red al crearlos, por lo que es innecesario
el uso de <CODE>ifconfig</CODE> con ellos.
<P>
<H2><A NAME="Resolucion de Nombres"></A> <A NAME="ss5.5">5.5 Configuraci&oacute;n del sistema de resoluci&oacute;n de nombres (<I>Name</A>
Resolver</I>) </H2>

<P>
<P>El sistema de <I>resoluci&oacute;n de nombres</I> es una parte de la biblioteca est&aacute;ndar
de Linux.  Su funci&oacute;n principal es proporcionar un servicio para convertir las
denominaciones «amistosas con el hombre» de las m&aacute;quinas como <CODE>ftp.funet.fi</CODE>
a direcciones IP «amigables para la m&aacute;quina» como <CODE>128.214.248.6</CODE>.
<P>
<H3>¿Qu&eacute; hay en un nombre?</H3>

<P>
<P>Posiblemente est&eacute; familiarizado con la apariencia de los nombres de m&aacute;quina de
Internet, pero puede que no entienda como se construyen, o como se
«desconstruyen». Los nombres de dominio de Internet son jer&aacute;rquicos por
naturaleza; esto es, tienen una estructura en &aacute;rbol. Un <EM>dominio</EM> es una
familia, o grupo de nombres. Un <EM>dominio</EM> puede ser fragmentado en
<EM>subdominios</EM>. Un «dominio de nivel superior» (<I>toplevel domain</I>) es un
dominio que NO es un subdominio. Los Dominios de Nivel Superior est&aacute;n
especificados en el <I>RFC-920</I>. Algunos ejemplos de los m&aacute;s comunes son:
<P>
<P>
<DL>
<DT><B>COM</B><DD><P>Organizaciones Comerciales
<DT><B>EDU</B><DD><P>Organizaciones Educativas
<DT><B>GOV</B><DD><P>Organizaciones Gubernamentales
<DT><B>MIL</B><DD><P>Organizaciones Militares
<DT><B>ORG</B><DD><P>Otras organizaciones
<DT><B>NET</B><DD><P>Organizaciones relacionadas con InterNet
<DT><B>Designador de Pa&iacute;s</B><DD><P>&eacute;stos son c&oacute;digos de dos letras que representan a un
pa&iacute;s en particular.
</DL>
<P>Por razones hist&oacute;ricas, la mayor&iacute;a de los dominios pertenecientes a uno de los
de nivel superior que no basados en un nombre de pa&iacute;s, son de organizaciones
dentro de los Estados Unidos, aunque los Estados Unidos tienen tambi&eacute;n su
propio c&oacute;digo de pa&iacute;s <CODE>.us</CODE>. Esto ha dejado de ser cierto para los dominios
<CODE>.com</CODE> y <CODE>.org</CODE>, que son usados de forma com&uacute;n por compa&ntilde;&iacute;as de fuera de
los Estados Unidos de Am&eacute;rica.
<P>Cada uno de estos dominios de nivel superior tiene subdominios. Los dominios de
nivel superior basados en el nombre de un pa&iacute;s suelen estar divididos en
subdominios basados en <CODE>com</CODE>, <CODE>edu</CODE>, <CODE>gov</CODE>, <CODE>mil</CODE> y <CODE>org</CODE>. Por
ejemplo, encontrar&aacute; cosas como <CODE>com.au</CODE> y <CODE>gov.au</CODE>, las organizaciones
comerciales y gubernamentales en Australia.
<P>El siguiente nivel de divisi&oacute;n suele representar el nombre de la organizaci&oacute;n.
Los siguientes subdominios var&iacute;an, a menudo basando el siguiente nivel en la
estructura departamental de la organizaci&oacute;n a la que pertenecen, pero pueden
estarlo en cualquier criterio considerado razonable y con significado claro
para los administradores de la red de la organizaci&oacute;n.
<P>La parte m&aacute;s a la izquierda de un nombre siempre es el nombre &uacute;nico asignado a
la m&aacute;quina, y es llamada <EM>hostname</EM>, la porci&oacute;n del nombre a la derecha del
nombre de la m&aacute;quina es el <EM>domainname</EM> (nombre de dominio), y el nombre
completo es llamado <EM>Fully Qualified Domain Name</EM> (Nombre de Dominio
Completamente Cualificado).
<P>Si usamos el ordenador de Terry como ejemplo, el nombre completamente
cualificado es <CODE>perf.no.itg.telstra.com.au</CODE>. Esto significa que el nombre de
la m&aacute;quina es <CODE>perf</CODE> y el nombre de dominio el <CODE>no.itg.telstra.com.au</CODE>.
El nombre de dominio est&aacute; basado en un dominio de nivel superior basado en su
pa&iacute;s, Australia, y como su direcci&oacute;n de correo pertenece a una organizaci&oacute;n
comercial tenemos <CODE>.com</CODE> como siguiente nivel de dominio.  El nombre de la
compa&ntilde;&iacute;a es (era) <CODE>telstra</CODE>, y la estructura interna de su nombre est&aacute;
basada en una estructura organizacional. En su caso, la m&aacute;quina pertenece al
Grupo de Tecnolog&iacute;a de la Informaci&oacute;n (Information Technology Group), secci&oacute;n
de Operaciones de Red (Network Operations).
<P>Los nombres son, por norma, bastante m&aacute;s cortos; por ejemplo, mi PSI se llama
<CODE>systemy.it</CODE> y mi organizaci&oacute;n sin &aacute;nimo de lucro se llama <CODE>linux.it</CODE>,
sin subdominio <CODE>com</CODE> ni <CODE>org</CODE>, por lo que mi propia m&aacute;quina se llama
<CODE>morgana.systemy.it</CODE> y <CODE>rubini@linux.it</CODE> es una direcci&oacute;n de correo
electr&oacute;nico v&aacute;lida. Sepa que el due&ntilde;o de un dominio tiene derecho tanto para
registrar una m&aacute;quina como para registrar subdominios; por ejemplo, el GUL
(Grupo de Usuarios de Linux) al que pertenezco usa el dominio
<CODE>pluto.linux.it</CODE>, porque los due&ntilde;os de <CODE>linux.it</CODE> convinieron en abrir un
subdominio para el GUL. 
<P>
<H3>Qu&eacute; informaci&oacute;n necesitar&aacute;</H3>

<P>
<P>Necesitar&aacute; saber a qu&eacute; dominio pertenecen sus m&aacute;quinas. El software de
resoluci&oacute;n de nombres proporciona el servicio de traducci&oacute;n
haciendo consultas a un <EM>Servidor de Nombres de Dominio</EM>
(<I>Domain Name Server</I>), por lo que deber&aacute; saber la direcci&oacute;n IP del servidor
de nombres (<I>nameserver</I>) local que vaya a usar.
<P>Hay tres ficheros que es necesario editar. Los comentar&eacute; uno a uno.
<P>
<H3><CODE>/etc/resolv.conf</CODE></H3>

<P>
<P><CODE>/etc/resolv.conf</CODE> es el fichero de configuraci&oacute;n principal del c&oacute;digo
de resoluci&oacute;n de nombres. Su formato es bastante simple. Es un fichero de texto
con una palabra clave por l&iacute;nea. Hay tres palabras clave de uso frecuente, que
son:
<P>
<DL>
<DT><B>domain</B><DD><P>esta palabra clave especifica el nombre de dominio local.
<P>
<DT><B>search</B><DD><P>&eacute;sta especifica una lista de dominios alternativos para completar
el nombre de una m&aacute;quina.
<P>
<DT><B>nameserver</B><DD><P>&eacute;sta, que puede utilizarse varias veces, especifica una
direcci&oacute;n IP de un servidor de nombres de dominio para consultarlo cuando se
resuelvan nombres.
</DL>
<P>Su <CODE>/etc/resolv.conf</CODE> podr&iacute;a parecerse a &eacute;ste:
<P>
<BLOCKQUOTE><CODE>
<PRE>
domain maths.wu.edu.au
search maths.wu.edu.au wu.edu.au
nameserver 192.168.10.1
nameserver 192.168.12.1
</PRE>
</CODE></BLOCKQUOTE>
<P>Este ejemplo especifica que el nombre de dominio por defecto para
a&ntilde;adir a los nombres no cualificados (esto es, nombres de m&aacute;quinas
suministrados sin dominio) es <CODE>maths.wu.edu.au</CODE>, y que si no se encuentra la
m&aacute;quina en este dominio intentemos tambi&eacute;n el dominio <CODE>wu.edu.au</CODE>
directamente.  Se proporcionan dos entradas de servidor de nombres, cada uno de
los cuales puede ser llamado por el c&oacute;digo de resoluci&oacute;n de nombres para
traducir el nombre.
<P>
<H3><CODE>/etc/host.conf</CODE></H3>

<P>
<P>El fichero <CODE>/etc/host.conf</CODE> es el lugar donde se configuran algunos
elementos que gobiernan el comportamiento del c&oacute;digo de resoluci&oacute;n de nombres.
El formato de este fichero est&aacute; descrito en detalle en la p&aacute;gina de manual
<CODE>resolv+</CODE>. El ejemplo siguiente funcionar&aacute; en casi todas las
circunstancias:
<P>
<BLOCKQUOTE><CODE>
<PRE>
order hosts,bind
multi on
</PRE>
</CODE></BLOCKQUOTE>
<P>Esta configuraci&oacute;n le dice al resolutor de nombres que examine el fichero
<CODE>/etc/hosts</CODE> antes de intentar consultar a un servidor de nombres, y que
devuelva todas las direcciones v&aacute;lidas de una m&aacute;quina que encuentre en el
fichero <CODE>/etc/hosts</CODE>, en lugar de s&oacute;lo el primero.
<P>
<H3><CODE>/etc/hosts</CODE></H3>

<P>
<P>El fichero <CODE>/etc/hosts</CODE> es donde se pone el nombre y direcci&oacute;n IP de las
m&aacute;quinas locales. Si usted inserta un nombre en este fichero, entonces su
ordenador no consultar&aacute; a un servidor de dominio para obtener la direcci&oacute;n IP.
La desventaja de este m&eacute;todo es que usted mismo tendr&aacute; que poner el fichero al
d&iacute;a si la direcci&oacute;n de alguna m&aacute;quina cambia. En un sistema bien administrado,
las &uacute;nicas entradas que suelen aparecer son la interfaz de loopback (prueba en
bucle) y el nombre de la m&aacute;quina local.
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/hosts
127.0.0.1      localhost loopback
192.168.0.1    this.host.name
</PRE>
</CODE></BLOCKQUOTE>
<P>Se puede especificar m&aacute;s de un nombre de m&aacute;quina por l&iacute;nea, como se
demuestra en la primera entrada, que es la forma est&aacute;ndar para la interfaz
de prueba (loopback).
<P>
<H3>Ejecutar un servidor de nombres</H3>

<P>
<P>Si quiere tener un servidor de nombres local, le resultar&aacute; sencillo.  Por
favor, lea el DNS Como, <CODE>
<A HREF="http://www.insflug.org/documentos/DNS-Como/">http://www.insflug.org/documentos/DNS-Como/</A></CODE> y la documentaci&oacute;n
incluida en su copia de <CODE>BIND</CODE> (<I>Berkeley Internet Name Domain</I>).
<P>
<H2><A NAME="ss5.6">5.6 Configuraci&oacute;n de la interfaz <CODE>loopback</CODE></A>
</H2>

<P>
<P>La interfaz <I>loopback</I>' es un tipo especial de interfaz que le
permite hacer conexiones consigo mismo. Hay varias razones por las que
podr&iacute;a querer esto. Por ejemplo, puede que desee probar alg&uacute;n tipo de
programa sin interferir con alguien m&aacute;s en su red. Por convenci&oacute;n,
la direcci&oacute;n de red IP <CODE>127.0.0.1</CODE> ha sido asignada espec&iacute;ficamente
para el dispositivo de pruebas. Por lo que da igual lo que haga su m&aacute;quina,
que si abre una conexi&oacute;n de telnet a <CODE>127.0.0.1</CODE>, siempre llegar&aacute; a la
interfaz interna.
<P>Configurar la interfaz <CODE>loopback</CODE> es simple y deber&iacute;a asegurarse de
hacerlo.
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# ifconfig lo 127.0.0.1
root# route add -host 127.0.0.1 lo
</PRE>
</CODE></BLOCKQUOTE>
<P>Hablaremos m&aacute;s de la orden <CODE>route</CODE> en la siguiente secci&oacute;n.
<P>
<H2><A NAME="ss5.7">5.7 Encaminamiento (<I>Routing</I>).</A>
</H2>

<P>
<P>El encaminamiento es un tema amplio. Ser&iacute;a f&aacute;cil llenar varios vol&uacute;menes
hablando de &eacute;l. La mayor&iacute;a de ustedes tendr&aacute;n requisitos de encaminamiento
relativamente simples, pero algunos no. Cubrir&eacute; solamente algunos de los
fundamentos b&aacute;sicos. Si est&aacute; interesado en informaci&oacute;n m&aacute;s detallada, entonces
sugiero que se remita a las referencias propuestas al principio del documento.
<P>Comencemos con una definici&oacute;n. ¿Qu&eacute; es el encaminamiento IP? Esta es
la que yo suelo aplicar:
<P>
<BLOCKQUOTE>
El Encaminamiento IP es el proceso por el que una m&aacute;quina con m&uacute;ltiples
conexiones de red decide por d&oacute;nde dirigir un datagrama IP que haya recibido.
</BLOCKQUOTE>
<P>Ser&iacute;a &uacute;til ilustrar esto con un ejemplo. Imagine una oficina con el
encaminamiento t&iacute;pico, que podr&iacute;a constar de un enlace PPP con Internet,
varios segmentos Ethernet alimentando las estaciones de trabajo, y un
enlace PPP hacia otra oficina. Cuando el encaminador recibe un datagrama en
cualquiera de sus conexiones de red, el mecanismo que usa para determinar
qu&eacute; interfaz deber&iacute;a enviar el datagrama, es el encaminamiento. Las
estaciones sencillas tambi&eacute;n necesitan encaminar. Todas las estaciones en
Internet tienen dos dispositivos de red: uno es la interfaz de pruebas
descrita anteriormente, y la otra es la que usa para comunicarse con el
resto de la red, quiz&aacute; una Ethernet, quiz&aacute; una interfaz serie PPP o SLIP.
<P>Bien... Por tanto, ¿c&oacute;mo funciona el encaminado? Cada m&aacute;quina tiene una
lista de reglas, llamada tabla de encaminamiento. Esta tabla contiene
columnas que suelen contener al menos tres campos: el primero es una
direcci&oacute;n de destino, el segundo es el nombre de la interfaz a la que se
va a encaminar el datagrama, y el tercero es (opcionalmente) la direcci&oacute;n
IP de otra m&aacute;quina que coger&aacute; el datagrama en su siguiente paso a trav&eacute;s
de la red. En Linux puede ver esta tabla usando la siguiente orden:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# cat /proc/net/route
</PRE>
</CODE></BLOCKQUOTE>
<P>o con cualquiera de estas otras:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# /sbin/route -n
root# /bin/netstat -r
</PRE>
</CODE></BLOCKQUOTE>
<P>El proceso de encaminado es relativamente simple: se recibe un datagrama
que llega, se examina la direcci&oacute;n de destino (para qui&eacute;n es) y se compara
con cada entrada en la lista. Se selecciona la entrada que m&aacute;s se parezca
y se reenv&iacute;a el datagrama a la interfaz especificada. Si el campo de
pasarela (gateway) est&aacute; descrito, el datagrama se reenv&iacute;a a esa m&aacute;quina
mediante la interfaz especificada, y si no, se asume que la direcci&oacute;n de
destino est&aacute; en la red a la que se accede mediante la interfaz
correspondiente.
<P>Para manipular esta tabla se usa una orden especial. Esta instrucci&oacute;n toma
sus argumentos en l&iacute;nea de &oacute;rdenes y los convierte en llamadas al sistema
del n&uacute;cleo, que le piden que a&ntilde;ada, borre o modifique entradas en la tabla
de encaminamiento. Dicha orden se llama <CODE>route</CODE>.
<P>Un ejemplo sencillo. Imagine que tiene una red Ethernet. Le han dicho que
pertenece a una red clase C con direcci&oacute;n <CODE>192.168.1.0</CODE>. Le han dado la
direcci&oacute;n IP <CODE>192.168.1.10</CODE> para su uso y tambi&eacute;n que <CODE>192.168.1.1</CODE>
es un encaminador conectado a Internet.
<P>El primer paso es configurar la interfaz como se describi&oacute; anteriormente. 
Puede usar una orden como:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# ifconfig eth0 192.168.1.10 netmask 255.255.255.0 up
</PRE>
</CODE></BLOCKQUOTE>
<P>Ahora necesita a&ntilde;adir una entrada en la tabla de rutas para decirle al
n&uacute;cleo que los datagramas destinados a todas las m&aacute;quinas con direcciones
que se ajusten a <CODE>192.168.1.*</CODE>, deber&aacute;n ser enviados al dispositivo
Ethernet. Deber&iacute;a usar una orden similar a:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# route add -net 192.168.1.0 netmask 255.255.255.0 eth0
</PRE>
</CODE></BLOCKQUOTE>
<P>F&iacute;jese en el uso del par&aacute;metro <CODE>-net</CODE> para especificar al programa
<CODE>route</CODE> que esta entrada es una regla para una red completa. Otra opci&oacute;n es
<CODE>-host</CODE>, que indica una v&iacute;a espec&iacute;fica a una direcci&oacute;n IP en particular.
<P>Esta ruta le permitir&aacute; establecer conexiones IP con todas las estaciones
de su segmento Ethernet. Pero ¿qu&eacute; pasa con todas las m&aacute;quinas con direcci&oacute;n IP
que no est&aacute;n en su segmento Ethernet?
<P>Ser&iacute;a bastante engorroso, por no decir imposible, tener que a&ntilde;adir caminos
para cada red de destino posible, por lo que existe un truco que se usa
para simplificar la tarea. A este truco se le llama camino <I>por defecto</I>. El
camino <I>por defecto</I> se ajusta a todo destino posible, pero con prioridad
m&iacute;nima, por lo que si existe cualquier otra entrada que se ajuste a la
direcci&oacute;n requerida, ser&aacute; la que se use en lugar del camino <I>por defecto</I>.
La idea del camino <I>por defecto</I> es simplemente permitirle decir: «y todo lo
dem&aacute;s deber&iacute;a ir por aqu&iacute;». En el ejemplo que me he inventado podr&iacute;a usar una
orden como:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# route add default gw 192.168.1.1 eth0
</PRE>
</CODE></BLOCKQUOTE>
<P>El par&aacute;metro <CODE>gw</CODE> le dice a la orden <CODE>route</CODE> que lo que le sigue es la
direcci&oacute;n IP, o nombre, de una pasarela u otra m&aacute;quina encaminadora a la que se
deber&iacute;an enviar todos los datagramas que se ajusten a esta entrada para futuro
encaminamiento.
<P>Por lo tanto, la configuraci&oacute;n completa deber&iacute;a parecerse a:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# ifconfig eth0 192.168.1.10 netmask 255.255.255.0 up
root# route add -net 192.168.1.0 netmask 255.255.255.0 eth0
root# route add default gw 192.168.1.1 eth0
</PRE>
</CODE></BLOCKQUOTE>
<P>Si echa una mirada a los ficheros <CODE>rc</CODE> de red de su m&aacute;quina, encontrar&aacute; que
al menos uno de ellos se parece mucho a esto. Es una configuraci&oacute;n muy com&uacute;n.
<P>Veamos ahora una configuraci&oacute;n de encaminamiento un poco m&aacute;s complicada. 
Imaginemos que estamos configurando el encaminador de antes, el que
soportaba el enlace PPP a Internet y los segmentos LAN alimentando las
estaciones de trabajo en la oficina. Imaginemos que el encaminador tiene
tres segmentos Ethernet y un enlace PPP. Nuestra configuraci&oacute;n de
encaminamiento deber&iacute;a parecerse a esto:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# route add -net 192.168.1.0 netmask 255.255.255.0 eth0
root# route add -net 192.168.2.0 netmask 255.255.255.0 eth1
root# route add -net 192.168.3.0 netmask 255.255.255.0 eth2
root# route add default ppp0
</PRE>
</CODE></BLOCKQUOTE>
<P>Cada una de las estaciones deber&iacute;a usar la forma simple que presentamos
anteriormente. S&oacute;lo el encaminador necesita especificar cada uno de los
caminos de red de forma separada, porque para las estaciones el mecanismo de
encaminamiento <CODE>por defecto</CODE> enviar&aacute; todos los paquetes al encaminador,
dej&aacute;ndole el problema de repartirlos. Puede estar pregunt&aacute;ndose por qu&eacute;
el encaminador por defecto presentado no especifica un <CODE>gw</CODE>. La
raz&oacute;n es simple: los protocolos de enlace serie como PPP y SLIP s&oacute;lo
tienen dos terminales en su red, uno en cada extremo. Especificar el host
al otro extremo como pasarela no tiene sentido y es redundante, ya que no
hay otra elecci&oacute;n, por lo que no se necesita especificar una pasarela para
este tipo de conexi&oacute;n de red.  Otros tipos como Ethernet, arcnet o token
ring necesitan que se especifique la pasarela, ya que se puede acceder a
un gran n&uacute;mero de terminales al mismo tiempo.
<P>
<H3>Entonces ¿qu&eacute; hace el programa <CODE>routed</CODE>?</H3>

<P>
<P>La configuraci&oacute;n de encaminamiento descrita anteriormente se ajusta a
necesidades de red simples, donde los posibles caminos hacia los destinos
son sencillos. Cuando se tienen necesidades de red m&aacute;s complejas, las cosas
se vuelven un poco m&aacute;s complicadas. Afortunadamente la mayor&iacute;a de ustedes
no tendr&aacute; este problema.
<P>El gran problema con el «encaminamiento manual» o «encaminamiento
est&aacute;tico» que aqu&iacute; se ha descrito, es que si una m&aacute;quina o enlace falla en la
red, entonces la &uacute;nica manera en que podr&aacute; dirigir sus datagramas por otra
direcci&oacute;n, si es que existe, es interviniendo manualmente y ejecutando las
&oacute;rdenes apropiadas. Naturalmente esto es poco elegante, lento, nada pr&aacute;ctico y
peligroso. Se han desarrollado varias t&eacute;cnicas para ajustar autom&aacute;ticamente las
tablas de encaminamiento en el caso de fallos en la red donde hubiera caminos
alternativos. Todas estas t&eacute;cnicas se agrupan de manera no muy oficial bajo la
definici&oacute;n «protocolos de encaminamiento din&aacute;mico».
<P>Puede que haya o&iacute;do de alguno de los protocolos m&aacute;s comunes. Es probable
que RIP (<I>Routing Information Protocol</I>) y OSPF (<I>Open Shortest Path
First Protocol</I>) sean los m&aacute;s comunes. El Routing Information Protocol es muy
com&uacute;n en redes peque&ntilde;as, como las redes corporativas peque&ntilde;as y medianas o en
las redes de edificios. El OSPF es m&aacute;s moderno y m&aacute;s capaz de gestionar grandes
configuraciones de red, y est&aacute; mejor preparado para entornos donde haya un gran
n&uacute;mero de caminos posibles a trav&eacute;s de la red.  Las implementaciones habituales
de estos protocolos son: <CODE>routed</CODE> (RIP) y <CODE>gated</CODE> (RIP, OSPF y otros). El
programa <CODE>routed</CODE> suele venir incluido en las distribuciones de Linux, y si
no, estar&aacute; incluido en el paquete <I>NetKit</I>, detallado m&aacute;s adelante.
<P>Un ejemplo de d&oacute;nde y c&oacute;mo deber&iacute;a usar un protocolo de encaminamiento din&aacute;mico
vendr&iacute;a a ser algo como lo siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
      192.168.1.0 /                         192.168.2.0 /
         255.255.255.0                         255.255.255.0
       -                                     -
       |                                     |
       |   /-----\                 /-----\   |
       |   |     |ppp0   //    ppp0|     |   |
  eth0 |---|  A  |------//---------|  B  |---| eth0
       |   |     |     //          |     |   |
       |   \-----/                 \-----/   |
       |      \ ppp1             ppp1 /      |
       -       \                     /       -
                \                   /
                 \                 /
                  \               /
                   \             /
                    \           /
                     \         /
                      \       /
                       \     /
                    ppp0\   /ppp1
                       /-----\
                       |     |
                       |  C  |
                       |     |
                       \-----/
                          |eth0
                          |
                     |---------|
                     192.168.3.0 /
                        255.255.255.0
</PRE>
</CODE></BLOCKQUOTE>
<P>Tenemos tres encaminadores <CODE>A</CODE>, <CODE>B</CODE> y <CODE>C</CODE>. Cada uno da servicio a un
segmento Ethernet con una red IP de clase C (m&aacute;scara de red
<CODE>255.255.255.0</CODE>). Cada encaminador tiene tambi&eacute;n un enlace PPP a cada uno de
los otros encaminadores. La red forma un tri&aacute;ngulo.
<P>Deber&iacute;a estar claro que la tabla de encaminamiento del encaminador <CODE>A</CODE>
podr&iacute;a ser algo como:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# route add -net 192.168.1.0 netmask 255.255.255.0 eth0
root# route add -net 192.168.2.0 netmask 255.255.255.0 ppp0
root# route add -net 192.168.3.0 netmask 255.255.255.0 ppp1
</PRE>
</CODE></BLOCKQUOTE>
<P>Esto funcionar&iacute;a bien hasta que el enlace entre los encaminadores <CODE>A</CODE> y
<CODE>B</CODE> falle. Si falla ese enlace, entonces con la entrada de encaminamiento
mostrada anteriormente, las m&aacute;quinas del segmento Ethernet de <CODE>A</CODE> no podr&aacute;n
alcanzar a las del segmento Ethernet en <CODE>B</CODE> porque sus datagramas
ser&aacute;n dirigidos al enlace <CODE>ppp0</CODE> de <CODE>A</CODE> que est&aacute; mal. Podr&iacute;an seguir
comunic&aacute;ndose todav&iacute;a con las m&aacute;quinas del segmento Ethernet de <CODE>C</CODE>, y las
del segmento Ethernet de <CODE>C</CODE> con las del segmento Ethernet de <CODE>B</CODE>, porque
el enlace entre <CODE>B</CODE> y <CODE>C</CODE> a&uacute;n est&aacute; intacto.
<P>Pero espere un momento. Si <CODE>A</CODE> puede hablar con <CODE>C</CODE> y <CODE>C</CODE> puede a&uacute;n
hablar con <CODE>B</CODE>, ¿por qu&eacute; no puede <CODE>A</CODE> encaminar sus datagramas para
<CODE>B</CODE> a trav&eacute;s de <CODE>C</CODE> y dejar que <CODE>C</CODE> se los mande a <CODE>B</CODE>? Este es
exactamente el tipo de problema para el que fueron dise&ntilde;ados los protocolos de
encaminamiento din&aacute;mico como RIP. Si cada uno de los encaminadores <CODE>A</CODE>,
<CODE>B</CODE> y <CODE>C</CODE> est&aacute; ejecutando el demonio de encaminamiento, entonces sus
tablas deber&iacute;an ser ajustadas autom&aacute;ticamente para reflejar el nuevo estado de
la red si alguno de los enlaces falla. Configurar tal red es sencillo. En cada
encaminador s&oacute;lo necesita hacer dos cosas. En este caso, para el Encaminador
<CODE>A</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# route add -net 192.168.1.0 netmask 255.255.255.0 eth0
root# /usr/sbin/routed
</PRE>
</CODE></BLOCKQUOTE>
<P>El demonio de encaminamiento <CODE>routed</CODE> encuentra autom&aacute;ticamente todos
los puertos de red activos cuando comienza y busca mensajes en cada uno de
los dispositivos de red para poder determinar y poner al d&iacute;a la tabla de
encaminamiento en el host.
<P>&Eacute;sta ha sido una explicaci&oacute;n muy concisa del encaminamiento din&aacute;mico y de
d&oacute;nde podr&iacute;a usarlo. Si quiere m&aacute;s informaci&oacute;n, tendr&aacute; que
acudir a las referencias listadas al principio del documento.
<P>Los puntos importantes relacionados con el encaminamiento din&aacute;mico son:
<P>
<OL>
<LI>S&oacute;lo necesita ejecutar un protocolo de encaminamiento din&aacute;mico cuando su
m&aacute;quina Linux tenga la posibilidad de elegir entre m&uacute;ltiples caminos para
llegar a un destino.
</LI>
<LI>El demonio de encaminamiento din&aacute;mico modificar&aacute; autom&aacute;ticamente la tabla
de encaminamiento para ajustarla a los cambios en la red.
</LI>
<LI>RIP es adecuado para redes de tama&ntilde;o peque&ntilde;o y medio.
</LI>
</OL>
<P>
<H2><A NAME="ss5.8">5.8 Configuraci&oacute;n de los servidores de red y los servicios.</A>
</H2>

<P>
<P>Los servidores de red y los servicios son aquellos programas que permiten a un
usuario remoto hacer uso de su m&aacute;quina Linux. Los programas servidores escuchan
en los puertos de red. Los puertos de red son el medio de llegar a un servicio
en particular en una m&aacute;quina en particular, y es as&iacute; como un servidor conoce la
diferencia entre una conexi&oacute;n telnet y otra de FTP que le lleguen. El usuario
remoto establece una conexi&oacute;n de red con la m&aacute;quina, y el programa servidor, el
demonio de red que est&eacute; escuchando en ese puerto, aceptar&aacute; la conexi&oacute;n y se
ejecutar&aacute;. Hay dos modos de operaci&oacute;n para los demonios de red. Ambos se usan
por igual en la pr&aacute;ctica. Las dos maneras son:
<P>
<DL>
<P>
<DT><B>aut&oacute;nomo (standalone)</B><DD><P>el programa demonio de red escucha en el puerto
de red asignado y, cuando llega una conexi&oacute;n, se ocupa &eacute;l mismo de dar el
servicio de red.
<P>
<DT><B>esclavo del servidor <CODE>inetd</CODE></B><DD><P>el servidor inetd es un demonio
de red especial que se especializa en controlar las conexiones entrantes. Tiene
un fichero de configuraci&oacute;n que le dice qu&eacute; programa debe ser ejecutado cuando
se reciba una conexi&oacute;n. Cualquier puerto de servicio puede ser configurado
tanto para el protocolo tcp como para udp. Los puertos son descritos en otro
fichero del que hablaremos dentro de poco.
<P>
</DL>
<P>Hay dos ficheros importantes que necesitamos configurar. Son el fichero
<CODE>/etc/services</CODE> que asigna nombres a los n&uacute;meros de puerto y el
fichero <CODE>/etc/inetd.conf</CODE> que es el fichero de configuraci&oacute;n del
demonio de red <CODE>inetd</CODE>.
<P>
<H3><CODE>/etc/services</CODE></H3>

<P>
<P>El fichero <CODE>/etc/services</CODE> es una base de datos sencilla, que asocia un
nombre que nosotros podamos entender, con un puerto de servicio de la m&aacute;quina.
Su formato es bastante simple. Es un fichero de texto en el que cada l&iacute;nea
representa una entrada a la base de datos. Cada entrada comprende tres campos
separados por cualquier n&uacute;mero de espacios en blanco (espacio o tabulador). Los
campos son:
<P>
<BLOCKQUOTE><CODE>
<PRE>
nombre      puerto/protocolo        sobrenombres     # comentario
</PRE>
</CODE></BLOCKQUOTE>
<P>
<DL>
<P>
<DT><B>nombre</B><DD><P>una sola palabra que representa el servicio descrito.
<P>
<DT><B>puerto/protocolo</B><DD><P>este campo est&aacute; dividido en dos subcampos.
<P>
<DT><B>puerto</B><DD><P>un n&uacute;mero que especifica el n&uacute;mero de puerto del servicio que
estar&aacute; disponible. La mayor&iacute;a de los servicios comunes tienen asignados n&uacute;meros
de servicio, y est&aacute;n descritos en el <I>RFC-1340</I>.
<P>
<DT><B>protocolo</B><DD><P>este subcampo debe tener como valor <CODE>tcp</CODE> o
<CODE>udp</CODE>.
<P>Es importante que tenga en cuenta que el servicio <CODE>18/tcp</CODE> es muy
diferente del <CODE>18/udp</CODE> y que no hay raz&oacute;n t&eacute;cnica por la cual deban
existir ambos.  Normalmente prevalece el sentido com&uacute;n, y s&oacute;lo ver&aacute; una entrada
<CODE>tcp</CODE> y otra <CODE>udp</CODE> para el mismo servicio si es que est&aacute;
disponible para ambos.
<P>
<DT><B>sobrenombres</B><DD><P>(o alias) otros nombres que pueden usarse para referirse
a esta entrada de servicio.
<P>
</DL>
<P>Cualquier texto que aparezca en una l&iacute;nea despu&eacute;s de un caracter <CODE>#</CODE> es
ignorado y se trata como un comentario.
<P>
<H3>Un ejemplo de fichero <CODE>/etc/services</CODE>.</H3>

<P>
<P>Todas las distribuciones modernas de Linux tienen un buen fichero
<CODE>/etc/services</CODE>. Para el caso de que est&eacute; montando una m&aacute;quina desde
cero, aqu&iacute; tiene una copia del fichero <CODE>/etc/services</CODE> proporcionado por
una antigua la distribuci&oacute;n Debian <CODE>
<A HREF="http://www.debian.org/">http://www.debian.org</A></CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/services:
# $Id: services,v 1.3 1996/05/06 21:42:37 tobias Exp $
#
# Network services, Internet style
#
# Note that it is presently the policy of IANA to assign a single well-known
# port number for both TCP and UDP; hence, most entries here have two entries
# even if the protocol doesn't support UDP operations.
# Updated from RFC 1340, «Assigned Numbers» (July 1992).  Not all ports
# are included, only the more common ones.

tcpmux          1/tcp                           # TCP port service multiplexer
echo            7/tcp
echo            7/udp
discard         9/tcp           sink null
discard         9/udp           sink null
systat          11/tcp          users
daytime         13/tcp
daytime         13/udp
netstat         15/tcp
qotd            17/tcp          quote
msp             18/tcp                          # message send protocol
msp             18/udp                          # message send protocol
chargen         19/tcp          ttytst source
chargen         19/udp          ttytst source
ftp-data        20/tcp
ftp             21/tcp
ssh             22/tcp                          # SSH Remote Login Protocol
ssh             22/udp                          # SSH Remote Login Protocol
telnet          23/tcp
# 24 - private
smtp            25/tcp          mail
# 26 - unassigned
time            37/tcp          timserver
time            37/udp          timserver
rlp             39/udp          resource        # resource location
nameserver      42/tcp          name            # IEN 116
whois           43/tcp          nicname
re-mail-ck      50/tcp                          # Remote Mail Checking Protocol
re-mail-ck      50/udp                          # Remote Mail Checking Protocol
domain          53/tcp          nameserver      # name-domain server
domain          53/udp          nameserver
mtp             57/tcp                          # deprecated
bootps          67/tcp                          # BOOTP server
bootps          67/udp
bootpc          68/tcp                          # BOOTP client
bootpc          68/udp
tftp            69/udp
gopher          70/tcp                          # Internet Gopher
gopher          70/udp
rje             77/tcp          netrjs
finger          79/tcp
www             80/tcp          http            # WorldWideWeb HTTP
www             80/udp                          # HyperText Transfer Protocol
link            87/tcp          ttylink
kerberos        88/tcp          kerberos5 krb5  # Kerberos v5
kerberos        88/udp          kerberos5 krb5  # Kerberos v5
supdup          95/tcp
# 100 - reserved
hostnames       101/tcp         hostname        # usually from sri-nic
iso-tsap        102/tcp         tsap            # part of ISODE.
csnet-ns        105/tcp         cso-ns          # also used by CSO name server
csnet-ns        105/udp         cso-ns
rtelnet         107/tcp                         # Remote Telnet
rtelnet         107/udp
pop-2           109/tcp         postoffice      # POP version 2
pop-2           109/udp
pop-3           110/tcp                         # POP version 3
pop-3           110/udp
sunrpc          111/tcp         portmapper      # RPC 4.0 portmapper TCP
sunrpc          111/udp         portmapper      # RPC 4.0 portmapper UDP
auth            113/tcp         authentication tap ident
sftp            115/tcp
uucp-path       117/tcp
nntp            119/tcp         readnews untp   # USENET News Transfer Protocol
ntp             123/tcp
ntp             123/udp                         # Network Time Protocol
netbios-ns      137/tcp                         # NETBIOS Name Service
netbios-ns      137/udp
netbios-dgm     138/tcp                         # NETBIOS Datagram Service
netbios-dgm     138/udp
netbios-ssn     139/tcp                         # NETBIOS session service
netbios-ssn     139/udp
imap2           143/tcp                         # Interim Mail Access Proto v2
imap2           143/udp
snmp            161/udp                         # Simple Net Mgmt Proto
snmp-trap       162/udp         snmptrap        # Traps for SNMP
cmip-man        163/tcp                         # ISO mgmt over IP (CMOT)
cmip-man        163/udp
cmip-agent      164/tcp
cmip-agent      164/udp
xdmcp           177/tcp                         # X Display Mgr. Control Proto
xdmcp           177/udp
nextstep        178/tcp         NeXTStep NextStep       # NeXTStep window
nextstep        178/udp         NeXTStep NextStep       # server
bgp             179/tcp                         # Border Gateway Proto.
bgp             179/udp
prospero        191/tcp                         # Cliff Neuman's Prospero
prospero        191/udp
irc             194/tcp                         # Internet Relay Chat
irc             194/udp
smux            199/tcp                         # SNMP Unix Multiplexer
smux            199/udp
at-rtmp         201/tcp                         # AppleTalk routing
at-rtmp         201/udp
at-nbp          202/tcp                         # AppleTalk name binding
at-nbp          202/udp
at-echo         204/tcp                         # AppleTalk echo
at-echo         204/udp
at-zis          206/tcp                         # AppleTalk zone information
at-zis          206/udp
z3950           210/tcp         wais            # NISO Z39.50 database
z3950           210/udp         wais
ipx             213/tcp                         # IPX
ipx             213/udp
imap3           220/tcp                         # Interactive Mail Access
imap3           220/udp                         # Protocol v3
ulistserv       372/tcp                         # UNIX Listserv
ulistserv       372/udp
#
# UNIX specific services
#
exec            512/tcp
biff            512/udp         comsat
login           513/tcp
who             513/udp         whod
shell           514/tcp         cmd             # no passwords used
syslog          514/udp
printer         515/tcp         spooler         # line printer spooler
talk            517/udp
ntalk           518/udp
route           520/udp         router routed   # RIP
timed           525/udp         timeserver
tempo           526/tcp         newdate
courier         530/tcp         rpc
conference      531/tcp         chat
netnews         532/tcp         readnews
netwall         533/udp                         # -for emergency broadcasts
uucp            540/tcp         uucpd           # uucp daemon
remotefs        556/tcp         rfs_server rfs  # Brunhoff remote filesystem
klogin          543/tcp                         # Kerberized `rlogin' (v5)
kshell          544/tcp         krcmd           # Kerberized `rsh' (v5)
kerberos-adm    749/tcp                         # Kerberos `kadmin' (v5)
#
webster         765/tcp                         # Network dictionary
webster         765/udp
#
# From «Assigned Numbers»:
#
#> The Registered Ports are not controlled by the IANA and on most systems
#> can be used by ordinary user processes or programs executed by ordinary
#> users.
#
#> Ports are used in the TCP [45,106] to name the ends of logical
#> connections which carry long term conversations.  For the purpose of
#> providing services to unknown callers, a service contact port is
#> defined.  This list specifies the port used by the server process as its
#> contact port.  While the IANA can not control use of these ports it
#> does register or list use of these ports as a convienence to the
#> community.
#
ingreslock      1524/tcp
ingreslock      1524/udp
prospero-np     1525/tcp                # Prospero non-privileged
prospero-np     1525/udp
rfe             5002/tcp                # Radio Free Ethernet
rfe             5002/udp                # Actually use UDP only
bbs             7000/tcp                # BBS service
#
#
# Kerberos (Project Athena/MIT) services
# Note that these are for Kerberos v4 and are unofficial.  Sites running
# v4 should uncomment these and comment out the v5 entries above.
#
kerberos4       750/udp         kdc     # Kerberos (server) udp
kerberos4       750/tcp         kdc     # Kerberos (server) tcp
kerberos_master 751/udp                 # Kerberos authentication
kerberos_master 751/tcp                 # Kerberos authentication
passwd_server   752/udp                 # Kerberos passwd server
krb_prop        754/tcp                 # Kerberos slave propagation
krbupdate       760/tcp         kreg    # Kerberos registration
kpasswd         761/tcp         kpwd    # Kerberos "passwd"
kpop            1109/tcp                # Pop with Kerberos
knetd           2053/tcp                # Kerberos de-multiplexor
zephyr-srv      2102/udp                # Zephyr server
zephyr-clt      2103/udp                # Zephyr serv-hm connection
zephyr-hm       2104/udp                # Zephyr hostmanager
eklogin         2105/tcp                # Kerberos encrypted rlogin
#
# Unofficial but necessary (for NetBSD) services
#
supfilesrv      871/tcp                 # SUP server
supfiledbg      1127/tcp                # SUP debugging
#
# Datagram Delivery Protocol services
#
rtmp            1/ddp                   # Routing Table Maintenance Protocol
nbp             2/ddp                   # Name Binding Protocol
echo            4/ddp                   # AppleTalk Echo Protocol
zip             6/ddp                   # Zone Information Protocol
#
# Debian GNU/Linux services
rmtcfg          1236/tcp                # Gracilis Packeten remote config server
xtel            1313/tcp                # french minitel
cfinger         2003/tcp                # GNU Finger
postgres        4321/tcp                # POSTGRES
mandelspawn     9359/udp        mandelbrot      # network mandelbrot

# Local services
</PRE>
</CODE></BLOCKQUOTE>
<P>En el d&iacute;a a d&iacute;a, este fichero se encuentra en proceso de continuo crecimiento
seg&uacute;n se van creando nuevos servicios. Si piensa que su copia es incompleta, le
sugiero que haga una copia del <CODE>/etc/services</CODE> de una distribuci&oacute;n
reciente.
<P>
<H3><CODE>/etc/inetd.conf</CODE></H3>

<P>
<P><CODE>/etc/inetd.conf</CODE> es el fichero de configuraci&oacute;n para el demonio
servidor <CODE>inetd</CODE>. Su funci&oacute;n es la de almacenar la informaci&oacute;n relativa a lo
que <CODE>inetd</CODE> debe hacer cuando recibe una petici&oacute;n de conexi&oacute;n a un servicio
en particular. Para cada servicio que desee que acepte conexiones deber&aacute;
decirle a <CODE>inetd</CODE> qu&eacute; demonio servidor de red ejecutar, y c&oacute;mo ha de
hacerlo.
<P>Su formato tambi&eacute;n es relativamente sencillo. Es un fichero de texto en el
que cada l&iacute;nea describe un servicio que desee proporcionar. Cualquier
texto en una l&iacute;nea que siga a <CODE>#</CODE> es ignorado y se considera un
comentario.  Cada l&iacute;nea contiene siete campos separados por cualquier n&uacute;mero de
espacios en blanco (espacio o tabulador). El formato general es el siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
servicio  tipo_socket  proto  flags  usuario  servidor  argumentos 
</PRE>
</CODE></BLOCKQUOTE>
<P>
<DL>
<P>
<DT><B>servicio</B><DD><P>es el servicio correspondiente a esta configuraci&oacute;n, tomado
del fichero <CODE>/etc/services</CODE>.
<P>
<DT><B>tipo_socket</B><DD><P>describe el tipo de socket que esta entrada considerar&aacute;
relevante. Los valores permitidos son: <CODE>stream</CODE>, <CODE>dgram</CODE>, <CODE>raw</CODE>,
<CODE>rdm</CODE> o <CODE>seqpacket</CODE>.  Es un poco t&eacute;cnico por naturaleza, pero por regla
general casi todos los servicios basados en <CODE>tcp</CODE> usan <CODE>stream</CODE>, y casi
todos los basados en <CODE>udp</CODE> usan <CODE>dgram</CODE>. S&oacute;lo algunos demonios servidores
muy particulares usar&aacute;n otros valores.
<P>
<DT><B>proto</B><DD><P>el protocolo considerado v&aacute;lido para este servicio. Deber&iacute;a
corresponder con la entrada apropiada en el fichero <CODE>/etc/services</CODE> y
suele ser <CODE>tcp</CODE> o <CODE>udp</CODE>.  Los servidores basados en Sun RPC (<I>Remote
Procedure Call</I>) usar&aacute;n <CODE>rpc/tcp</CODE> o <CODE>rpc/udp</CODE>.
<P>
<DT><B>flags</B><DD><P>s&oacute;lo hay dos valores posibles. Este campo le dice a <EM>inetd</EM>
si el programa servidor de red libera el socket despu&eacute;s de comenzar la
ejecuci&oacute;n, y si por tanto <CODE>inetd</CODE> podr&aacute; ejecutar otro servidor para la
siguiente petici&oacute;n de conexi&oacute;n, o si <CODE>inetd</CODE> deber&aacute; esperar y asumir que el
demonio servidor que est&eacute; ejecut&aacute;ndose controlar&aacute; las nuevas peticiones de
conexi&oacute;n. Esto tiene su dificultad, pero por norma general todos los servidores
<CODE>tcp</CODE> deber&iacute;an tener esta entrada con el valor <CODE>nowait</CODE> y la mayor&iacute;a de
servidores <CODE>udp</CODE> deber&iacute;an tener <CODE>wait</CODE>.  De todas maneras hay algunas
excepciones notables, por lo que deber&iacute;a leer la gu&iacute;a de ejemplo si no est&aacute;
seguro.
<P>
<DT><B>usuario</B><DD><P>este campo indica qu&eacute; cuenta de usuario de
<CODE>/etc/passwd</CODE> ser&aacute; asignada como due&ntilde;a del demonio de red cuando se
ejecute. Esto es a menudo &uacute;til si quiere protegerse ante riesgos de seguridad.
Puede asignar el usuario <CODE>nobody</CODE> a una entrada, por lo que si la seguridad
del servidor de red es traspasada el posible da&ntilde;o queda minimizado.
Habitualmente, sin embargo, este campo est&aacute; asignado a <CODE>root</CODE>, porque muchos
servidores requieren privilegios de administrador para funcionar correctamente.
<P>
<DT><B>servidor</B><DD><P>este campo es el camino completo hasta el programa servidor
a ejecutar para esta entrada.
<P>
<DT><B>argumentos</B><DD><P>este campo comprende el resto de la l&iacute;nea de &oacute;rdenes y es
opcional. Es en donde se pone cualquier argumento de l&iacute;nea de &oacute;rdenes que desee
pasar al programa demonio servidor cuando es ejecutado.
<P>
</DL>
<P>
<H3>Un ejemplo de <CODE>/etc/inetd.conf</CODE></H3>

<P>
<P>Al igual que pasa con el <CODE>/etc/services</CODE>, todas las distribuciones
modernas incluir&aacute;n un buen fichero <CODE>/etc/inetd.conf</CODE> para trabajar con
&eacute;l.  Aqu&iacute; incluyo, como ejemplo, el fichero <CODE>/etc/inetd.conf</CODE> de la
distribuci&oacute;n Debian <CODE>
<A HREF="http://www.debian.org/">http://www.debian.org</A></CODE>.
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/inetd.conf:  see inetd(8) for further informations.
#
# Internet server configuration database
#
#
# Modified for Debian by Peter Tobias &lt;tobias@et-inf.fho-emden.de>
#
# &lt;service_name> &lt;sock_type> &lt;proto> &lt;flags> &lt;user> &lt;server_path> &lt;args>
#
# Internal services
#
#echo           stream  tcp     nowait  root    internal
#echo           dgram   udp     wait    root    internal
discard         stream  tcp     nowait  root    internal
discard         dgram   udp     wait    root    internal
daytime         stream  tcp     nowait  root    internal
daytime         dgram   udp     wait    root    internal
#chargen        stream  tcp     nowait  root    internal
#chargen        dgram   udp     wait    root    internal
time            stream  tcp     nowait  root    internal
time            dgram   udp     wait    root    internal
#
# These are standard services.
#
telnet  stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.telnetd
ftp     stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.ftpd
#fsp    dgram   udp     wait    root    /usr/sbin/tcpd  /usr/sbin/in.fspd
#
# Shell, login, exec and talk are BSD protocols.
#
shell   stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.rshd
login   stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.rlogind
#exec   stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.rexecd
talk    dgram   udp     wait    root    /usr/sbin/tcpd  /usr/sbin/in.talkd
ntalk   dgram   udp     wait    root    /usr/sbin/tcpd  /usr/sbin/in.ntalkd
#
# Mail, news and uucp services.
#
smtp    stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.smtpd
#nntp   stream  tcp     nowait  news    /usr/sbin/tcpd  /usr/sbin/in.nntpd
#uucp   stream  tcp     nowait  uucp    /usr/sbin/tcpd  /usr/lib/uucp/uucico
#comsat dgram   udp     wait    root    /usr/sbin/tcpd  /usr/sbin/in.comsat
#
# Pop et al
#
#pop-2  stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.pop2d
#pop-3  stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.pop3d
#
# `cfinger' is for the GNU finger server available for Debian.  (NOTE: The
# current implementation of the `finger' daemon allows it to be run as `root'.)
#
#cfinger stream tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.cfingerd
#finger stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.fingerd
#netstat        stream  tcp     nowait  nobody  /usr/sbin/tcpd  /bin/netstat
#systat stream  tcp     nowait  nobody  /usr/sbin/tcpd  /bin/ps -auwwx
#
# Tftp service is provided primarily for booting.  Most sites
# run this only on machines acting as "boot servers."
#
#tftp   dgram   udp     wait    nobody  /usr/sbin/tcpd  /usr/sbin/in.tftpd
#tftp   dgram   udp     wait    nobody  /usr/sbin/tcpd  /usr/sbin/in.tftpd /boot
#bootps dgram   udp     wait    root    /usr/sbin/bootpd        bootpd -i -t 120
#
# Kerberos authenticated services (these probably need to be corrected)
#
#klogin         stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.rlogind -k
#eklogin        stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.rlogind -k -x
#kshell         stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/in.rshd -k
#
# Services run ONLY on the Kerberos server (these probably need to be corrected)
#
#krbupdate      stream tcp      nowait  root    /usr/sbin/tcpd  /usr/sbin/registerd
#kpasswd        stream  tcp     nowait  root    /usr/sbin/tcpd  /usr/sbin/kpasswdd
#
# RPC based services
#
#mountd/1       dgram   rpc/udp wait    root    /usr/sbin/tcpd  /usr/sbin/rpc.mountd
#rstatd/1-3     dgram   rpc/udp wait    root    /usr/sbin/tcpd  /usr/sbin/rpc.rstatd
#rusersd/2-3    dgram   rpc/udp wait    root    /usr/sbin/tcpd  /usr/sbin/rpc.rusersd
#walld/1        dgram   rpc/udp wait    root    /usr/sbin/tcpd  /usr/sbin/rpc.rwalld
#
# End of inetd.conf.
ident           stream  tcp     nowait  nobody  /usr/sbin/identd        identd -i
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss5.9">5.9 Otros ficheros de configuraci&oacute;n relacionados con la red</A>
</H2>

<P>
<P>Hay varios ficheros miscel&aacute;neos relacionados con la configuraci&oacute;n de la red en
Linux por los que podr&iacute;a estar interesado. Nunca deber&iacute;a tener que modificar
estos ficheros, pero merece la pena describirlos para que sepa lo que contienen
y para qu&eacute; son.
<P>
<H3><CODE>/etc/protocols</CODE></H3>

<P>
<P>El fichero <CODE>/etc/protocols</CODE> es una base de datos que correlaciona
n&uacute;meros de identificaci&oacute;n de protocolos con sus nombres. Esto lo usan los
programadores para especificar protocolos por su nombre en sus programas y
tambi&eacute;n por programas como <CODE>tcpdump</CODE> para mostrar nombres en lugar de
n&uacute;meros en su salida. En general la sintaxis del fichero es:
<P>
<BLOCKQUOTE><CODE>
<PRE>
nombredelprotocolo  n&uacute;mero  sobrenombres
</PRE>
</CODE></BLOCKQUOTE>
<P>El fichero <CODE>/etc/protocols</CODE> proporcionado con la distribuci&oacute;n Debian
<CODE>
<A HREF="http://www.debian.org/">http://www.debian.org</A></CODE> es
como sigue:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/protocols:
# $Id: protocols,v 1.1 1995/02/24 01:09:41 imurdock Exp $
#
# Internet (IP) protocols
#
#       from: @(#)protocols     5.1 (Berkeley) 4/17/89
#
# Updated for NetBSD based on RFC 1340, Assigned Numbers (July 1992).

ip      0       IP              # internet protocol, pseudo protocol number
icmp    1       ICMP            # internet control message protocol
igmp    2       IGMP            # Internet Group Management
ggp     3       GGP             # gateway-gateway protocol
ipencap 4       IP-ENCAP        # IP encapsulated in IP (officially «IP»)
st      5       ST              # ST datagram mode
tcp     6       TCP             # transmission control protocol
egp     8       EGP             # exterior gateway protocol
pup     12      PUP             # PARC universal packet protocol
udp     17      UDP             # user datagram protocol
hmp     20      HMP             # host monitoring protocol
xns-idp 22      XNS-IDP         # Xerox NS IDP
rdp     27      RDP             # "reliable datagram" protocol
iso-tp4 29      ISO-TP4         # ISO Transport Protocol class 4
xtp     36      XTP             # Xpress Tranfer Protocol
ddp     37      DDP             # Datagram Delivery Protocol
idpr-cmtp       39      IDPR-CMTP       # IDPR Control Message Transport
rspf    73      RSPF            # Radio Shortest Path First.
vmtp    81      VMTP            # Versatile Message Transport
ospf    89      OSPFIGP         # Open Shortest Path First IGP
ipip    94      IPIP            # Yet Another IP encapsulation
encap   98      ENCAP           # Yet Another IP encapsulation
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H3><CODE>/etc/networks</CODE></H3>

<P>
<P>El fichero <CODE>/etc/networks</CODE> tiene una funci&oacute;n similar a la del fichero
<CODE>/etc/hosts</CODE>. Proporciona una base de datos sencilla de nombres de red y
direcciones de red. Su formato difiere en que s&oacute;lo puede haber dos campos por
l&iacute;nea y los campos est&aacute;n codificados as&iacute;:
<P>
<BLOCKQUOTE><CODE>
<PRE>
nombredelared direcci&oacute;ndered
</PRE>
</CODE></BLOCKQUOTE>
<P>Un ejemplo podr&iacute;a ser:
<P>
<BLOCKQUOTE><CODE>
<PRE>
loopnet    127.0.0.0
localnet   192.168.0.0
amprnet    44.0.0.0
</PRE>
</CODE></BLOCKQUOTE>
<P>Cuando use &oacute;rdenes como <CODE>route</CODE>, si un destino es una red y la red tiene una
entrada en el fichero /etc/networks entonces route mostrar&aacute; el nombre de la red
en lugar de su direcci&oacute;n.
<P>
<H2><A NAME="ss5.10">5.10 Seguridad en la red y control de acceso.</A>
</H2>

<P>
<P>D&eacute;jeme empezar esta secci&oacute;n advirtiendo que la seguridad de su m&aacute;quina y red
ante ataques maliciosos es un arte complejo. No me considero un experto en este
campo y aunque los mecanismos que voy a describir puedan ayudar, si quiere
tomarse en serio la seguridad entonces le recomiendo que investigue un poco en
el tema. Hay algunas buenas referencias en Internet relacionadas con la
seguridad, incluido el <I>Security HOWTO</I> (Dispone de una  traducci&oacute;n en
<CODE>
<A HREF="http://www.insflug.org/documentos/Seguridad-Como/">http://www.insflug.org/documentos/Seguridad-Como/</A></CODE>.
<P>Una regla general importante es: <B>No ejecute servicios que no tenga
intenci&oacute;n de usar</B>'.  Muchas distribuciones vienen configuradas con todo
tipo de servicios que se inician autom&aacute;ticamente. Para asegurar un nivel m&iacute;nimo
de seguridad deber&iacute;a examinar el fichero <CODE>/etc/inetd.conf</CODE> y comentar
(<EM>poner un <CODE>#</CODE> al inicio de la l&iacute;nea</EM>) de toda declaraci&oacute;n de
servicio que no vaya a usar. Buenos candidatos son: <CODE>shell</CODE>, <CODE>exec</CODE>,
<CODE>uucp</CODE>, <CODE>ftp</CODE> y servicios de informaci&oacute;n como <CODE>finger</CODE>, <CODE>netstat</CODE> y
<CODE>systat</CODE>.
<P>Hay todo tipo de mecanismos de seguridad y control de acceso, describir&eacute;
los m&aacute;s elementales.
<P>
<H3><CODE>/etc/ftpusers</CODE></H3>

<P>
<P>El fichero <CODE>/etc/ftpusers</CODE> es un mecanismo sencillo que le permite
denegar la entrada a ciertos usuarios mediante FTP. El fichero
<CODE>/etc/ftpusers</CODE> lo lee el programa demonio de FTP (<CODE>ftpd</CODE>) cuando se
recibe una conexi&oacute;n FTP. El fichero es una simple lista de aquellos usuarios
que no tienen permitido el acceso. Puede parecerse a esto:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/ftpusers - users not allowed to login via ftp
root
uucp
bin
mail
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H3><CODE>/etc/securetty</CODE></H3>

<P>
<P>El fichero <CODE>/etc/securetty</CODE> permite especificar qu&eacute; dispositivos
<CODE>tty</CODE> puede usar <CODE>root</CODE> para identificarse en el sistema. El fichero
<CODE>/etc/securetty</CODE> es le&iacute;do por el programa de acceso (normalmente
<CODE>/etc/login</CODE>). Su formato es una lista de los nombres de dispositivos
<CODE>tty</CODE> permitidos, en todos los dem&aacute;s <CODE>root</CODE> tiene prohibida la entrada:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/securetty - tty's on which root is allowed to login
tty1
tty2
tty3
tty4
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H3>El mecanismo de control de acceso <I>hosts</I> de <CODE>tcpd</CODE></H3>

<P>
<P>El programa <CODE>tcpd</CODE> que ha visto listado en el fichero
<CODE>/etc/inetd.conf</CODE> proporciona mecanismos de control de registro y acceso
a los servicios que haya de proteger.
<P>Cuando es invocado por el programa <CODE>inetd</CODE> lee dos ficheros que
contienen reglas de acceso y que permiten o deniegan acceso al servidor que
est&aacute; protegiendo.
<P>Mirar&aacute; en los ficheros de reglas hasta que encuentre la primera
correspondencia. Si no se encuentran correspondencias asume que el acceso
deber&iacute;a estar permitido para todo el mundo. La secuencia de archivos que revisa
es: <CODE>/etc/hosts.allow</CODE>, <CODE>/etc/hosts.deny</CODE>. Describir&eacute; cada uno de
estos en seguida. Para una descripci&oacute;n completa de este servicio deber&iacute;a
referirse a las p&aacute;ginas del manual apropiadas (<CODE>hosts_access</CODE> (5) es un buen
punto de partida).
<P>
<H3><CODE>/etc/hosts.allow</CODE></H3>

<P>
<P>El <CODE>/etc/hosts.allow</CODE> es un fichero de configuraci&oacute;n del programa
<CODE>/usr/sbin/tcpd</CODE>. El fichero <CODE>hosts.allow</CODE> contiene reglas que
describen qu&eacute; m&aacute;quinas tienen permiso para acceder a un servicio en la suya.
<P>El formato del fichero es bastante sencillo:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/hosts.allow
#
# &lt;lista de servicios>: &lt;lista de hosts> [: orden]
</PRE>
</CODE></BLOCKQUOTE>
<P>
<DL>
<P>
<DT><B><CODE>lista de servicios</CODE> </B><DD><P>es una lista delimitada por comas de nombres
de servidores a los que se aplica esta regla.  Ejemplos de nombre de servicio
son: <CODE>ftpd</CODE>, <CODE>telnetd</CODE> y <CODE>fingerd</CODE>.
<P>
<DT><B><CODE>lista de hosts</CODE> </B><DD><P>es una lista de nombres de m&aacute;quinas, delimitada
por comas. Aqu&iacute; tambi&eacute;n puede usar direcciones IP. De forma adicional, puede
especificar nombres de m&aacute;quinas o direcciones usando caracteres comod&iacute;n para
corresponder con grupos de m&aacute;quinas. Por ejemplo: <CODE>gw.vk2ktj.ampr.org</CODE> para
una m&aacute;quina espec&iacute;fica, <CODE>.uts.edu.au</CODE> para cualquier nombre de m&aacute;quina que
acabe en esa cadena, <CODE>44.</CODE> para cualquier direcci&oacute;n IP que comience con esos
d&iacute;gitos. Hay algunas palabras especiales para simplificar la configuraci&oacute;n,
algunas de las cuales son:
<P>
<UL>
<LI><CODE>ALL</CODE>, que se corresponde con cualquier host. 
</LI>
<LI><CODE>LOCAL</CODE> se corresponde con cualquier nombre de host que no contenga un
<CODE>.</CODE> o sea que est&eacute; en el mismo dominio que su m&aacute;quina;
</LI>
<LI><CODE>PARANOID</CODE> se corresponde con cualquier nombre que no se corresponda
con esta direcci&oacute;n (name spoofing). Hay una &uacute;ltima palabra que tambi&eacute;n es &uacute;til.
La palabra 
</LI>
<LI><CODE>EXCEPT</CODE> permite proporcionar una lista con excepciones. Esto lo
cubriremos en un cap&iacute;tulo posterior.</LI>
</UL>
<P>
<DT><B><CODE>orden</CODE></B><DD><P>es un par&aacute;metro opcional. Este par&aacute;metro es el camino
completo hasta una orden que deber&iacute;a ser ejecutada cada vez que se cumpla esta
regla. Podr&iacute;a por ejemplo ejecutar una instrucci&oacute;n que intentase identificar
qui&eacute;n est&aacute; autenticado en el host que conecta, o generar un mensaje de correo u
otro tipo de alerta a un administrador de sistema avisando de que alguien
intenta conectar. Hay cierto n&uacute;mero de expansiones que podr&iacute;amos incluir,
algunos ejemplos comunes son: <CODE>%h</CODE> se expande al nombre de la m&aacute;quina
que se conecta o a su direcci&oacute;n si no tiene un nombre, <CODE>%d</CODE> es el
demonio que est&aacute; siendo llamado.
<P>
</DL>
<P>Un ejemplo:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/hosts.allow
#
# Permitir correo a todo el mundo
in.smtpd: ALL
# Todo telnet y FTP s&oacute;lo a hosts dentro de mi dominio y el host que tengo
# en caso
telnetd, ftpd: LOCAL, myhost.athome.org.au
# Permitir finger a cualquiera pero mantener un registro de qui&eacute;n es.
fingerd: ALL: (finger @%h | mail -s "finger desde %h" root)
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H3><CODE>/etc/hosts.deny</CODE></H3>

<P>
<P>El fichero <CODE>/etc/hosts.deny</CODE> es un fichero de configuraci&oacute;n del
programa <CODE>/usr/sbin/tcpd</CODE>. El fichero <CODE>hosts.deny</CODE> contiene
reglas que describen qu&eacute; m&aacute;quinas tienen <EM>prohibido</EM> el acceso a
un servicio en su m&aacute;quina.
<P>Un ejemplo simple podr&iacute;a parecerse a esto:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# /etc/hosts.deny
#
# Desautorizar a todos los host con nombre sospechoso
ALL: PARANOID
#
# Desautorizar a todos los host.
ALL: ALL
</PRE>
</CODE></BLOCKQUOTE>
<P>La entrada <CODE>PARANOID</CODE> es redundante porque la otra entrada abarca todo
en cualquier caso. Ambas entradas ser&iacute;an razonables por defecto dependiendo de
sus requisitos particulares.
<P>La configuraci&oacute;n m&aacute;s segura es tener <CODE>ALL: ALL</CODE> por defecto en 
<CODE>/etc/hosts.deny</CODE> para despu&eacute;s dar permiso espec&iacute;ficamente a aquellos
servicios y hosts que se desee en <CODE>/etc/hosts.allow</CODE>.
<P>
<H3><CODE>/etc/hosts.equiv</CODE></H3>

<P>
<P>El fichero <CODE>hosts.equiv</CODE> se usa para garantizar a ciertos hosts y
usuarios derechos de acceso a cuentas en su m&aacute;quina sin que tenga que
proporcionar una clave. Esto es &uacute;til en un entorno seguro donde controle todas
las m&aacute;quinas, pero en otro caso es un peligro para la seguridad. Su m&aacute;quina es
s&oacute;lo tan segura como la menos segura de aquellas en las que conf&iacute;e.  Para
maximizar la seguridad, no use este mecanismo, y anime a sus usuarios para que
tampoco usen ficheros <CODE>.rhost</CODE>.
<P>
<H3>Configure su demonio de ftp adecuadamente.</H3>

<P>
<P>Muchos servidores estar&aacute;n interesados en ejecutar un demonio de <EM>FTP</EM>
an&oacute;nimo para permitir a otras personas que subir y descargar ficheros sin
necesidad de un <I>userid</I> espec&iacute;fico. Si decide ofrecer este servicio
aseg&uacute;rese de que configura el demonio de <EM>ftp</EM> apropiadamente para acceso
an&oacute;nimo. La mayor&iacute;a de las p&aacute;ginas de <CODE>ftpd(8)</CODE> describen c&oacute;mo hacerlo.
Deber&iacute;a asegurarse siempre de que sigue estas instrucciones. Una cosa
importante es no usar una copia de su fichero <CODE>/etc/passwd</CODE> habitual en
el directorio <CODE>/etc</CODE> de la cuenta an&oacute;nima; aseg&uacute;rese de que elimina
todos los detalles sobre las cuentas excepto aquellos que deba tener, ya que en
otro caso ser&aacute; vulnerable a las t&eacute;cnicas de adquisici&oacute;n de claves por fuerza
bruta.
<P>
<H3>Cortafuegos para redes.</H3>

<P>
<P>Un excelente medio de seguridad es no permitir que los datagramas lleguen
siquiera a su m&aacute;quina o servidores. Esto lo cubre en profundidad el
<CODE>
<A HREF="http://www.insflug.org/documentos/Cortafuegos-Como/">http://www.insflug.org/documentos/Cortafuegos-Como/</A></CODE> y, m&aacute;s
concisamente, la &uacute;ltima secci&oacute;n de este documento.
<P>
<H3>Otras sugerencias.</H3>

<P>
<P>Hay otras sugerencias, que deber&iacute;a considerar, pero que realmente son
cuesti&oacute;n de cada uno.
<P>
<DL>
<P>
<DT><B>sendmail</B><DD><P>a pesar de su popularidad, el demonio <EM>sendmail</EM> aparece
con preocupante regularidad en los anuncios de alerta de seguridad. Usted
decides, pero yo elijo no ejecutarlo.
<P>
<DT><B>NFS y otros servicios Sun RPC</B><DD><P>tenga cuidado con estos. Hay todo tipo
de posibles formas de explotar estos servicios. Es dif&iacute;cil de encontrar una
opci&oacute;n a los servicios NFS, y si decide usarlos, aseg&uacute;rese de que es cuidadoso
con los permisos que da al configurarlo.
<P>
</DL>
<P>
<HR>
<A HREF="Redes-En-Linux-Como-6.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-4.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc5">Índice general</A>
</BODY>
</HTML>
