<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Redes en Linux Como (Previamente Net-3 Como): Informaci&oacute;n general sobre las redes en Linux.</TITLE>
 <LINK HREF="Redes-En-Linux-Como-5.html" REL=next>
 <LINK HREF="Redes-En-Linux-Como-3.html" REL=previous>
 <LINK HREF="Redes-En-Linux-Como.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="Redes-En-Linux-Como-5.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-3.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4. Informaci&oacute;n general sobre las redes en Linux.</A></H2>

<P>
<P>
<H2><A NAME="ss4.1">4.1 Breve historia del desarrollo del <I>Linux Networking Kernel</I>.</A>
</H2>

<P>
<P>Desarrollar una nueva implementaci&oacute;n n&uacute;cleo de la pila para el protocolo
tcp/ip que rinda tan bien como las implementaciones existentes no es una
tarea f&aacute;cil. La decisi&oacute;n de no portar una de las implementaciones
existentes se tom&oacute; en un tiempo en que hab&iacute;a cierta incertidumbre al
respecto de si las implementaciones existentes ser&iacute;an lastradas con
copyrights restrictivos por el precedente sentado por U.S.L.  y en que
hab&iacute;a un gran entusiasmo por hacerlo diferente y quiz&aacute;s incluso mejor de
lo que se hab&iacute;a hecho.
<P>El voluntario original para liderar el desarrollo del n&uacute;cleo del c&oacute;digo
de red fue Ross Biro, <CODE>
<A HREF="mailto:biro@yggdrasil.com">biro@yggdrasil.com</A></CODE>. Ross produjo una implementaci&oacute;n simple e
incompleta pero aprovechable en su mayor parte de rutinas que fueron
completadas con un controlador de Ethernet para la interfaz de red WD-8003.
Esto era suficiente para tener a mucha gente probando y experimentando
con el software y algunas personas incluso intentaron conectar m&aacute;quinas
con esta configuraci&oacute;n a conexiones reales en Internet. La presi&oacute;n dentro
de la comunidad de Linux conduciendo el desarrollo de la implementaci&oacute;n
de la red estaba creciendo y, al final, el coste de una combinaci&oacute;n de
cierta presi&oacute;n aplicada sobre Ross y sus propios compromisos personales
le sobrecargaron y se descolg&oacute; del puesto de desarrollador jefe. Los
esfuerzos de Ross por iniciar el proyecto y la aceptaci&oacute;n de la
responsabilidad de producir realmente algo &uacute;til en tan controvertidas
circunstancias fue lo que cataliz&oacute; todo el trabajo futuro y por lo tanto
supone un componente esencial en el &eacute;xito del producto actual.
<P>Orest Zborowski, <CODE>
<A HREF="mailto:obz@Kodak.COM">obz@Kodak.COM</A></CODE>, produjo la interfaz original de programaci&oacute;n
de sockets BSD para el n&uacute;cleo de Linux. Fue un gran paso adelante ya que
permiti&oacute; portar a Linux muchas de las aplicaciones de red existentes sin
modificaciones serias.
<P>Por aquel momento, Laurence Culhane, <CODE>
<A HREF="mailto:loz@holmes.demon.co.uk">loz@holmes.demon.co.uk</A></CODE>
desarroll&oacute; los primeros controladores de dispositivo para la implementaci&oacute;n del
protocolo SLIP en Linux. Esto permiti&oacute; a mucha gente que no ten&iacute;a acceso a
redes Ethernet experimentar con el nuevo software de red. De nuevo, hubo gente
que cogi&oacute; este controlador y lo puso en servicio para conectarse a Internet.
Esto dio a mucha gente una idea de las posibilidades que podr&iacute;an hacerse
realidad si Linux tuviera un soporte total de red y creciera el n&uacute;mero de
usuarios usando y experimentando de forma activa el software de red que
exist&iacute;a.
<P>Una de las personas que tambi&eacute;n hab&iacute;a estado trabajando activamente en la
tarea de construir la implementaci&oacute;n de red era Fred vam Kempen,
<CODE>
<A HREF="mailto:waltje@uwalt.nl.mugnet.org">waltje@uwalt.nl.mugnet.org</A></CODE>.  Despu&eacute;s de un periodo de
incertidumbre tras la renuncia de Ross al cargo de desarrollador jefe,
Fred ofreci&oacute; su tiempo y esfuerzos y acept&oacute; el papel esencialmente sin
oposici&oacute;n.  Fred ten&iacute;a planes ambiciosos sobre la direcci&oacute;n que quer&iacute;a
que siguiese el software de red de Linux y orient&oacute; el progreso hacia esos
objetivos. Fred desarroll&oacute; varias versiones del c&oacute;digo de red llamado el
n&uacute;cleo de c&oacute;digo <I>NET-2</I> (el c&oacute;digo <I>NET</I> era el de Ross) que mucha
gente pudo usar de manera m&aacute;s &uacute;til. Fred puso formalmente algunas
innovaciones en la agenda de desarrollo, como la interfaz din&aacute;mica de
dispositivo, la implementaci&oacute;n del protocolo <I>Amateur Radio AX.25</I> y
una interfaz de red dise&ntilde;ada m&aacute;s modularmente.  El c&oacute;digo <I>NET-2</I> de
Fred fue usado por un gran n&uacute;mero de entusiastas, que crec&iacute;a
continuamente seg&uacute;n se iba corriendo la voz de que el software
funcionaba.  El software de red en esos momentos a&uacute;n estaba constituido
por un gran n&uacute;mero de parches a la versi&oacute;n est&aacute;ndar del n&uacute;cleo y no
estaba incluido en la versi&oacute;n normal. El <I>NET-FAQ</I> y el subsecuente
<I>NET-2-HOWTO</I> describ&iacute;an el por entonces relativamente complejo
procedimiento de ponerlo todo en marcha. Fred se concentraba en
desarrollar innovaciones frente a las implementaciones est&aacute;ndar de red y
eso estaba llevando tiempo.  La comunidad de usuarios estaba
impacient&aacute;ndose por algo que funcionase eficazmente y satisficiera al 80%
de usuarios y, como con Ross, la presi&oacute;n sobre Fred como desarrollador en
jefe creci&oacute;.
<P>Alan Cox, <CODE>
<A HREF="mailto:iialan@www.uk.linux.org">iialan@www.uk.linux.org</A></CODE> propuso una soluci&oacute;n al problema
dise&ntilde;ada para resolver la situaci&oacute;n. Propuso que &eacute;l podr&iacute;a coger el
c&oacute;digo <I>NET-2</I> de Fred para quitar fallos, haci&eacute;ndolo eficaz y estable
para que satisficiera al impaciente usuario de base al tiempo que
retiraba esa presi&oacute;n de Fred permiti&eacute;ndole continuar con su trabajo. Alan
se puso a ello, obteniendo buenos resultados y su primera versi&oacute;n del
c&oacute;digo de red de Linux fue llamada it/Net-2D(ebugged)/. El c&oacute;digo
funcionaba bien en muchas configuraciones t&iacute;picas y el usuario de base
estaba feliz. Alan puso claramente sus propias ideas y habilidad para
contribuir al proyecto y como consecuencia comenzaron a aparecer muchas
discusiones relativas a la direcci&oacute;n del c&oacute;digo <I>NET-2</I>.  Esto
desarroll&oacute; dos tendencias distintas dentro de la comunidad de red de
Linux, una que ten&iacute;a la filosof&iacute;a «hazlo funcionar primero, y luego hazlo
mejor» y la otra «hazlo mejor primero».  Linus termin&oacute; arbitrando y
ofreciendo su apoyo a los esfuerzos de desarrollo de Alan e incluy&oacute; el
c&oacute;digo de Alan en la distribuci&oacute;n est&aacute;ndar de las fuentes del n&uacute;cleo.
Esto puso a Fred en una posici&oacute;n dif&iacute;cil.  Cualquier desarrollo
continuado podr&iacute;a debilitar la gran base de usuarios usando y probando
activamente el c&oacute;digo y eso significar&iacute;a que los progresos ser&iacute;an lentos
y dif&iacute;ciles. Fred continu&oacute; trabajando un tiempo y a la larga acab&oacute;
dej&aacute;ndolo y Alan se convirti&oacute; en el nuevo jefe del esfuerzo de desarrollo
de red para Linux.
<P>Donald Becker, <CODE>
<A HREF="mailto:becker@cesdis.gsfc.nasa.gov">becker@cesdis.gsfc.nasa.gov</A></CODE> revel&oacute; pronto su talento para
los aspectos de bajo nivel de las redes y produjo un amplio abanico de
controladores de red. Casi todos los incluidos en los n&uacute;cleos actuales
fueron desarrollados por &eacute;l. Hay m&aacute;s gente que ha hecho contribuciones
significativas, pero el trabajo de Donald es prol&iacute;fico y eso le garantiza
una menci&oacute;n especial.
<P>Alan continu&oacute; refinando el c&oacute;digo <I>NET-2-Debugged</I> durante un tiempo
mientras trabajaba en solucionar algunos de los problemas que quedaban
sin mirar en la lista <CODE>PORHACER</CODE>. Por la &eacute;poca en que al c&oacute;digo fuente
<CODE>1.3.*</CODE> del n&uacute;cleo les estaban creciendo los dientes, el c&oacute;digo de red
hab&iacute;a migrado a la entrega <I>NET-3</I> que es en la que las versiones
actuales est&aacute;n basadas.  Alan trabaj&oacute; en muchos aspectos diferentes del
c&oacute;digo de red y con la asistencia de mucha otra gente con talento de la
comunidad de red de Linux hizo crecer el c&oacute;digo en todas direcciones.
Alan produjo dispositivos de red din&aacute;micos y las primeras
implementaciones de los est&aacute;ndares AX.25 e IPX. Alan ha continuado
jugueteando con el c&oacute;digo, estructur&aacute;ndolo y mejor&aacute;ndolo lentamente hasta
el estado en que se encuentra hoy d&iacute;a.
<P>Michael Callahan, <CODE>
<A HREF="mailto:callahan@maths.ox.ac.uk">callahan@maths.ox.ac.uk</A></CODE> y Al Longyear <CODE>
<A HREF="mailto:longyear@netcom.com">longyear@netcom.com</A></CODE>
aportaron la implementaci&oacute;n del protocolo PPP, lo cual fue cr&iacute;tico para
incrementar el n&uacute;mero de gente que usaba activamente Linux para trabajar
en red.
<P>Jonathon Naylor, <CODE>
<A HREF="mailto:jsn@cs.nott.ac.uk">sn@cs.nott.ac.uk</A></CODE> ha contribuido mejorando significativamente
el c&oacute;digo de AX.25 de Alan, a&ntilde;adiendo los protocolos NetRom y Rose. La
implementaci&oacute;n de AX.25/NetRom/Rose es en s&iacute; misma bastante
significativa, porque ning&uacute;n otro sistema operativo puede enorgullecerse
de trabajar de forma nativa con estos protocolos aparte de Linux.
<P>Por supuesto, ha habido centenares de otras personas que han hecho
contribuciones significativas al desarrollo del software de red de Linux.
A algunas de estas personas las encontrar&aacute; m&aacute;s adelante en la secci&oacute;n de
tecnolog&iacute;as espec&iacute;ficas; otras personas han contribuido con m&oacute;dulos,
controladores, correcciones de errores, sugerencias, informes de pruebas y
apoyo moral. En cada caso, cada uno puede decir que ha puesto su granito
de arena y que ofreci&oacute; lo que pudo. El c&oacute;digo de red del n&uacute;cleo de Linux
es un excelente ejemplo de los resultados que se pueden obtener del
an&aacute;rquico estilo de desarrollo de Linux. Si a&uacute;n no se ha sorprendido, lo
har&aacute; pronto. El desarrollo no se ha detenido.
<P>
<H2><A NAME="recursos"></A> <A NAME="ss4.2">4.2 Recursos referentes al tratamiento de redes con Linux.</A>
</H2>

<P>
<P>Hay varios sitios en los que puede encontrar informaci&oacute;n acerca de la
implementaci&oacute;n de red de Linux.
<P>Tiene a su disposici&oacute;n un mont&oacute;n de asesores. Podr&aacute; encontrar un listado
en la <I>LinuxPorts Consultants Database</I>, <CODE>
<A HREF="http://www.linuxports.com/">http://www.linuxports.com</A></CODE>
<P>Alan Cox, quien en estos momentos se encarga de mantener el c&oacute;digo de red del
n&uacute;cleo de Linux tiene una p&aacute;gina WWW con los &uacute;ltimos titulares y eventos
de inter&eacute;s relativos al estado de desarrollo de las funcionalidades presentes y
futuras en cuanto al c&oacute;digo de red linux en: <CODE>
<A HREF="http://www.uk.linux.org/NetNews.html">www.uk.linux.org</A></CODE>.
<P>Otro buen sitio es un libro escrito por Olaf Kirch titulado la <CODE>Gu&iacute;a para
Administradores de Redes</CODE>. Es parte del Proyecto de Documentaci&oacute;n de Linux
<CODE>
<A HREF="http://www.linuxdoc.org/">http://www.linuxdoc.org</A></CODE> y puede leerlo de forma interactiva en su
versi&oacute;n HTML <CODE>
<A HREF="http://metalab.unc.edu/LDP/LDP/nag/nag.html">http://metalab.unc.edu/LDP/LDP/nag/nag.html</A></CODE>, u obtenerlo en varios
formatos mediante FTP (y en castellano) desde el archivo del proyecto LuCAS
<CODE>
<A HREF="ftp://lucas.hispalinux.es/pub/LuCAS/Manuales-LuCAS/GARL">ftp://lucas.hispalinux.es/pub/LuCAS/Manuales-LuCAS/GARL</A></CODE>.  El libro
de Olaf es bastante extenso y procura una buena iniciaci&oacute;n de alto nivel a la
configuraci&oacute;n de redes en Linux.
<P>Hay un grupo de noticias en la jerarqu&iacute;a de noticias de Linux dedicado a
las redes y a materias relacionadas: <CODE>
<A HREF="news:comp.os.linux.networking">comp.os.linux.networking</A></CODE>
<P>Hay una lista de correo a la que se puede suscribir, donde hacer
preguntas relacionadas al trabajo en redes con Linux. Para suscribirse
debe mandar un mensaje:
<P>
<BLOCKQUOTE><CODE>
<PRE>
A: majordomo@vger.rutgers.edu
Asunto: cualquier cosa
Mensaje:

subscribe linux-net
</PRE>
</CODE></BLOCKQUOTE>
<P>En las diferentes redes de IRC suele haber canales <CODE>#linux</CODE> en los
que suele haber gente que responde preguntas sobre linux y redes.
<P>Por favor, cuando vaya a informar de cualquier problema, recuerde incluir
todos los detalles que pueda relevantes al respecto.  Deber&iacute;a informar,
espec&iacute;ficamente, de las versiones de los programas que est&eacute; usando, sobre
todo la versi&oacute;n del n&uacute;cleo, la versi&oacute;n de herramientas como <CODE>pppd</CODE> o
<CODE>dip</CODE> y la naturaleza exacta del problema que est&aacute; experimentando.
Esto significa tomar nota de la sintaxis exacta de cualquier mensaje de
error que reciba y de cualquier orden que est&eacute; ejecutando.
<P>
<H2><A NAME="ss4.3">4.3 D&oacute;nde conseguir informaci&oacute;n sobre redes no espec&iacute;fica de</A>
Linux.</H2>

<P>
<P>Si est&aacute; buscando informaci&oacute;n b&aacute;sica de aprendizaje sobre redes tcp/ip
en general, entonces le recomiendo que eche un vistazo a los siguientes
documentos:
<P>
<DL>
<P>
<DT><B>TCP/IP Introduction</B><DD><P>este documento est&aacute; tanto en versi&oacute;n texto
<CODE>
<A HREF="ftp://athos.rutgers.edu/runet/tcp-ip-intro.doc">ftp://athos.rutgers.edu/runet/tcp-ip-intro.doc</A></CODE> como en
versi&oacute;n PostScript <CODE>
<A HREF="ftp://athos.rutgers.edu/runet/tcp-ip-intro.ps">ftp://athos.rutgers.edu/runet/tcp-ip-intro.ps</A></CODE>.
<P>
<DT><B>TCP/IP Administration </B><DD><P>este documento est&aacute; tanto en versi&oacute;n
texto <CODE>
<A HREF="ftp://athos.rutgers.edu/runet/tcp-ip-admin.doc">ftp://athos.rutgers.edu/runet/tcp-ip-admin.doc</A></CODE> como en
versi&oacute;n PostScript <CODE>
<A HREF="ftp://athos.rutgers.edu/runet/tcp-ip-admin.ps">ftp://athos.rutgers.edu/runet/tcp-ip-admin.ps</A></CODE>.
<P>
</DL>
<P>Si busca informaci&oacute;n algo m&aacute;s detallada sobre redes tcp/ip entonces le
recomiendo:
<P>
<BLOCKQUOTE>
<EM>Internetworking with TCP/IP, Volume 1: principles, protocols and
architecture</EM>, de Douglas E. Comer, ISBN 0-13-227836-7, Prentice Hall
publications, Tercera edici&oacute;n, 1995.
</BLOCKQUOTE>
<P>Si quiere aprender a escribir aplicaciones de red en entornos
compatibles Unix entonces tambi&eacute;n le recomiendo:
<P>
<BLOCKQUOTE>
<EM>Unix Network Programming</EM>, by W. Richard Stevens, ISBN 0-13-949876-1,
Prentice Hall publications, 1990.
</BLOCKQUOTE>
<P>Tambi&eacute;n deber&iacute;a probar el grupo de noticias <CODE>
<A HREF="news:comp.protocols.tcp-ip">comp.protocols.tcp-ip</A></CODE>.
Otra fuente importante de informaci&oacute;n t&eacute;cnica espec&iacute;fica relativa a la
Internet y al conjunto de protocolos tcp/ip son los RFC. RFC es un
acr&oacute;nimo de <I>Request For Comments</I> y es el medio est&aacute;ndar de enviar y
documentar los protocolos est&aacute;ndar de Internet. Hay muchos sitios de
donde tomar los RFC. Muchos de estos sitios son de FTP y otros
proporcionan acceso por World Wide Web con un buscador asociado que le
permite buscar palabras clave en la base de datos de RFC.
<P>Un posible lugar donde encontrar lo RFC es la base de datos de Nexor
<CODE>
<A HREF="http://pubweb.nexor.co.uk/public/rfc/index/rfc.html">http://pubweb.nexor.co.uk/public/rfc/index/rfc.html</A></CODE>.
<P>
<HR>
<A HREF="Redes-En-Linux-Como-5.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-3.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc4">Índice general</A>
</BODY>
</HTML>
