<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Redes en Linux Como (Previamente Net-3 Como): Glosario de T&eacute;rminos usados en este documento</TITLE>
 <LINK HREF="Redes-En-Linux-Como-11.html" REL=next>
 <LINK HREF="Redes-En-Linux-Como-9.html" REL=previous>
 <LINK HREF="Redes-En-Linux-Como.html#toc10" REL=contents>
</HEAD>
<BODY>
<A HREF="Redes-En-Linux-Como-11.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-9.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc10">Índice general</A>
<HR>
<H2><A NAME="s10">10. Glosario de T&eacute;rminos usados en este documento</A></H2>

<P>
<P>La siguiente lista contiene algunos de los t&eacute;rminos m&aacute;s importantes usados
en este documento.
<P>
<DL>
<P>
<DT><B>ARP</B><DD><P>Es un acr&oacute;nimo para del <EM>Protocolo de Resoluci&oacute;n de
Direcciones</EM> (Address Resolution Protocol) y es la manera en que
asocia una m&aacute;quina de red una direcci&oacute;n IP con una direcci&oacute;n hardware.
<P>
<DT><B>ATM</B><DD><P>Es un acr&oacute;nimo de <EM>Modo As&iacute;ncrono de Transferencia</EM>
(Asynchronous Transfer Mode). Una red ATM empaqueta los datos en bloques
de tama&ntilde;o est&aacute;ndar que puede transportar eficientemente de un punto a
otro. ATM es una tecnolog&iacute;a de red basada en circuitos de paquetes
conmutados.
<P>
<DT><B>cliente</B><DD><P>Suele ser la parte de un programa que se encuentra en el
lado del usuario. Hay ciertas excepciones, por ejemplo, en el sistema de
ventanas X11 es el servidor el que est&aacute; con el usuario, y el cliente puede
estar ejecut&aacute;ndose en una m&aacute;quina remota. El cliente es el programa o
terminal de un sistema que est&aacute; recibiendo el servicio proporcionado por
el servidor. En el caso de sistema <EM>de igual a igual</EM> (peer to peer),
como <CODE>slip</CODE> o <CODE>ppp</CODE>, se dice que el cliente es el extremo que inicia
la conexi&oacute;n y el extremo remoto, que ha sido llamado, es el servidor.
<P>
<DT><B>datagrama</B><DD><P>Un datagrama es un paquete discreto de datos y
cabeceras que contiene direcciones, que es la unidad b&aacute;sica de transmisi&oacute;n
a trav&eacute;s de una red IP. Puede que lo haya o&iacute;do llamar «paquete».
<P>
<DT><B>Direcci&oacute;n hardware</B><DD><P>Es un n&uacute;mero que identifica de forma un&iacute;voca
una m&aacute;quina en una red f&iacute;sica en la capa de acceso al medio. Algunos
ejemplos son las <EM>Direcciones Ethernet</EM> y las <EM>Direcciones
AX.25</EM>.
<P>
<DT><B>Direcci&oacute;n IP</B><DD><P>Es un n&uacute;mero que identifica un&iacute;vocamente una m&aacute;quina
TCP/IP en la red. La direcci&oacute;n es de 4 bytes de longitud y normalmente se la
representa en <I>notaci&oacute;n decimal puntuada</I>, donde cada byte es representado
en decimal con puntos «<CODE>.</CODE>» entre ellos.
<P>
<DT><B>DLCI</B><DD><P>DLCI viene de <I>Data Link Connection Identifier</I> y se usa para
identificar una conexi&oacute;n virtual punto a punto en particular a trav&eacute;s de una
red de Retransmisi&oacute;n de Tramas. Los DLCI los suele asignar el proveedor de red
de Retransmisi&oacute;n de Tramas.
<P>
<DT><B>ISP</B><DD><P>V&eacute;ase PSI.
<P>
<DT><B>MSS</B><DD><P>El Tama&ntilde;o M&aacute;ximo de Segmento (<EM>Maximum Segment Size</EM>)
es la mayor cantidad de datos que pueden ser transmitidos a la vez. Si
quiere prevenir la fragmentaci&oacute;n, el MSS deber&iacute;a ser igual al MTU de la
cabecera IP.
<P>
<DT><B>MTU</B><DD><P>La M&aacute;xima Unidad de Transmisi&oacute;n (<EM>Maximum Transmission
Unit</EM>) es un par&aacute;metro que determina el mayor datagrama que puede ser
transmitido por una interfaz IP sin necesidad de dividirlo en unidades m&aacute;s
peque&ntilde;as. La MTU deber&iacute;a ser m&aacute;s grande que el mayor datagrama que desee
transmitir sin fragmentar. F&iacute;jese que esto s&oacute;lo previene la fragmentaci&oacute;n
de manera local, algunos otros enlaces por el camino pueden tener una MTU
m&aacute;s peque&ntilde;a y el datagrama ser&aacute; fragmentado all&iacute;. Los valores normales son
1500 bytes para una interfaz Ethernet, o 576 bytes para una interfaz SLIP.
<P>
<DT><B>PSI</B><DD><P>Es un acr&oacute;nimo de Proveedor de Servicios de Internet (ISP -
Internet Service Provider). Son organizaciones y compa&ntilde;&iacute;as que
proporcionan conectividad con Internet.
<P>
<DT><B>RDSI</B><DD><P>Es un acr&oacute;nimo de <EM>Red Digital de Servicios
Integrados</EM> (ISDN en ingl&eacute;s). La RDSI proporciona medios
estandarizados por los cuales las compa&ntilde;&iacute;as de Telecomunicaciones pueden
llevar informaci&oacute;n tanto de voz como de datos seg&uacute;n las premisas de los
abonados. T&eacute;cnicamente la RDSI es una red de circuitos de paquetes
conmutados.
<P>
<DT><B>Retransmisi&oacute;n de tramas</B><DD><P>La retransmisi&oacute;n de tramas (o Frame
Relay) es una tecnolog&iacute;a de red idealmente preparada para transportar
tr&aacute;fico que es de naturaleza espor&aacute;dica o a r&aacute;fagas. Los costes de red se
reducen compartiendo varios abonados a la retransmisi&oacute;n de tramas la
misma capacidad de red y dej&aacute;ndoles a ellos el deseo de usar la red en
momentos ligeramente diferentes.
<P>
<DT><B>ruta</B><DD><P>La <EM>ruta</EM> es el camino que siguen los datagramas a
trav&eacute;s de la red para alcanzar su destino.
<P>
<DT><B>servidor</B><DD><P>Normalmente es la parte del programa o terminal de un
sistema remoto con respecto al usuario. El servidor proporciona alg&uacute;n
servicio a uno o varios clientes. Los ejemplos de servidores incluyen
<EM>ftp</EM>, <EM>Network File System</EM> o <EM>Domain Name Server</EM>. En el caso
de sistemas de <EM>igual a igual</EM> (peer to peer) tales como <CODE>slip</CODE> o
<CODE>ppp</CODE>. Se dice que es el servidor el extremo del enlace que recibe la
llamada y el otro extremo es el cliente.
<P>
<DT><B>ventana</B><DD><P>La <EM>ventana</EM> es la mayor cantidad de datos que el
extremo receptor puede aceptar en un momento dado.
</DL>
<P>
<HR>
<A HREF="Redes-En-Linux-Como-11.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-9.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc10">Índice general</A>
</BODY>
</HTML>
