<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Redes en Linux Como (Previamente Net-3 Como): Uso de hardware com&uacute;n en los PC</TITLE>
 <LINK HREF="Redes-En-Linux-Como-8.html" REL=next>
 <LINK HREF="Redes-En-Linux-Como-6.html" REL=previous>
 <LINK HREF="Redes-En-Linux-Como.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="Redes-En-Linux-Como-8.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-6.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc7">Índice general</A>
<HR>
<H2><A NAME="s7">7. Uso de hardware com&uacute;n en los PC</A></H2>

<P>
<P>
<H2><A NAME="ss7.1">7.1 RDSI</A>
</H2>

<P>
<P>La Red Digital de Servicios Integrados (RDSI) es una serie de est&aacute;ndares
que especifican una red digital conmutada de prop&oacute;sito general. Una
llamada RDSI crea un servicio de datos as&iacute;ncrono punto a punto hacia el
destino. RDSI suele distribuirse con un enlace de gran velocidad que se
divide en varios canales discretos. Hay dos tipos de canales diferentes,
los <I>Canales B</I> que son los que realmente transportan los datos del
usuario y un s&oacute;lo canal llamado <I>canal D</I> que se usa para enviar
informaci&oacute;n de control a la RDSI para establecer llamadas y otras
funciones. En Australia, por ejemplo, RDSI se distribuye con un enlace
de 2Mbps que se divide en 30 canales discretos B de 64kbps con un canal D
de 64kbps.  Se pueden usar cualquier n&uacute;mero de canales en cualquier
momento y en cualquier combinaci&oacute;n. Usted podr&iacute;a, por ejemplo, establecer
30 llamadas separadas a 30 destinos diferentes a 64kbps cada uno, o
15 llamadas a 15 destinos diferentes a 128kbps cada uno (dos canales por
llamada), o sencillamente un peque&ntilde;o n&uacute;mero de llamadas y dejar el resto
de los canales sin usar. Se puede usar un canal tanto para llamadas
entrantes como salientes. La intenci&oacute;n original de la RDSI fue permitir a
las compa&ntilde;&iacute;as de telecomunicaciones proporcionar un s&oacute;lo servicio de datos
que pudiera transmitir tanto tel&eacute;fono (mediante voz digitalizada) como
servicios de datos a su casa o negocio sin que tuviera que hacer ning&uacute;n cambio
especial de configuraci&oacute;n.
<P>Hay unas pocas maneras diferentes de conectar su ordenador a un servicio
RDSI. Una manera es usar un dispositivo llamado <I>Adaptador Terminal</I> que se
enchufa a la Unidad Terminadora de Red que su compa&ntilde;&iacute;a local de
telecomunicaciones tuvo que instalar al proporcionarle el servicio RDSI y que
presenta unas cuantas interfaces serie. Uno de estos interfaces se
usa para introducir instrucciones de establecimiento de llamadas y la
configuraci&oacute;n y los otros son los que realmente se conectan a los
dispositivos de red que usar&aacute;n los circuitos de datos cuando se hayan
establecido. Linux trabajar&aacute; con este tipo de configuraci&oacute;n sin
modificaci&oacute;n alguna, simplemente tiene que tratar el puerto del Adaptador
Terminal como tratar&iacute;a cualquier otro dispositivo serie.  Otra manera,
que es para la que est&aacute; dise&ntilde;ado el soporte de RDSI del n&uacute;cleo permite instalar
una tarjeta RDSI en su m&aacute;quina Linux y dejar entonces que sea el propio Linux
quien maneje los protocolos y haga las llamadas.
<P><B>Opciones de Compilaci&oacute;n del N&uacute;cleo</B>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
    ISDN subsystem  --->
        &lt;*> ISDN support
        [ ] Support synchronous PPP
        [ ] Support audio via ISDN
        &lt; > ICN 2B and 4B support
        &lt; > PCBIT-D support
        &lt; > Teles/NICCY1016PC/Creatix support
 
</PRE>
</CODE></BLOCKQUOTE>
<P>La implementaci&oacute;n del n&uacute;cleo de Linux de la RDSI soporta varios tipos
diferentes de tarjetas RDSI. Son las que vienen listadas en las opciones de
configuraci&oacute;n del n&uacute;cleo.
<P>
<UL>
<LI>ICN 2B and 4B</LI>
<LI>Octal PCBIT-D</LI>
<LI>Tarjetas Teles ISDN y compatibles</LI>
</UL>
<P>Algunas de estas tarjetas requieren que se les carguen ciertos programas
antes de funcionar. Hay una utilidad aparte que hace esto.
<P>Hay disponibles m&aacute;s detalles de c&oacute;mo configurar el soporte RDSI de Linux
en el directorio <CODE>/usr/src/linux/Documentation/isdn/</CODE> y tambi&eacute;n un
listado <I>PUF</I> (Pregutas de Uso Frecuente) dedicado a <CODE>isdn4linux</CODE> en
<CODE>
<A HREF="http://www.lrz-muenchen.de/~ui161ab/www/isdn/">http://www.lrz-muenchen.de/~ui161ab/www/isdn</A></CODE>.  (Puede pulsar sobre
la bandera inglesa para la versi&oacute;n en ingl&eacute;s).
<P><B>Una nota al respecto de PPP</B>. El conjunto de protocolos PPP operar&aacute;
tanto sobre lineas serie s&iacute;ncronas como as&iacute;ncronas. El demonio PPP
(<CODE>pppd</CODE>) que se suele distribuir para Linux s&oacute;lo soporta el modo
as&iacute;ncrono. Si desea ejecutar los protocolos PPP sobre el servicio RDSI,
necesitar&aacute; una versi&oacute;n especial modificada. En la documentaci&oacute;n
anteriormente mencionada encontrar&aacute; detalles de c&oacute;mo encontrarlo.
<P>En <CODE>
<A HREF="http://www.insflug.org/documentos/RDSI-Como/">http://www.insflug.org/documentos/RDSI-Como/</A></CODE> tiene a su
disposici&oacute;n un documento con detalles espec&iacute;ficos de la configuraci&oacute;n en
Espa&ntilde;a.
<P>
<H2><A NAME="ss7.2">7.2 PLIP en Linux-2.0</A>
</H2>

<P>
<P>Los nombres de los dispositivos PLIP son `<CODE>plip0</CODE>', `<CODE>plip1</CODE>' y
`<CODE>plip2</CODE>'.
<P><B>Opciones de Compilaci&oacute;n del N&uacute;cleo</B>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
    Network device support  --->
        &lt;*> PLIP (parallel port) support
</PRE>
</CODE></BLOCKQUOTE>
<P><EM>plip</EM> (Parallel Line IP), se parece a SLIP en que se usa para
proporcionar conexiones <EM>punto a punto</EM> entre dos m&aacute;quinas, excepto en
que est&aacute; dise&ntilde;ado para usar los puertos paralelos de impresora de la
m&aacute;quina en lugar de los puertos serie (se incluye un diagrama de cableado
en la secci&oacute;n de diagramas de cableado m&aacute;s adelante). Como es posible
transmitir m&aacute;s de un bit a la vez con un puerto paralelo, es posible
obtener mayores velocidades con la interfaz <EM>plip</EM> que con los
dispositivos serie est&aacute;ndar.  Adem&aacute;s, puede aprovecharse incluso el m&aacute;s
sencillo de los puertos paralelos, el puerto de impresora, en lugar de
tener que comprar una UART 16550AFN, comparativamente m&aacute;s cara, para los
puertos serie. PLIP usa mucha CPU si lo comparamos con un enlace serie y
casi seguro que no ser&aacute; una buena opci&oacute;n si puede obtener algunas tarjetas
Ethernet baratas, pero funcionar&aacute; cuando no est&eacute; disponible nada m&aacute;s y
adem&aacute;s lo har&aacute; bastante bien.  Se puede esperar una tasa de transferencia
de alrededor de 20 kilobytes por segundo cuando el enlace est&aacute; funcionando
correctamente.
<P>Los controladores de dispositivo de PLIP compiten con el controlador de
dispositivo paralelo por el hardware del puerto paralelo. Si desea usar ambos
controladores deber&aacute; compilar los dos como m&oacute;dulos para asegurarse de que es
capaz de elegir qu&eacute; puerto quiere que use PLIP y qu&eacute; puertos usar&aacute; como
dispositivos para la impresora. Lea el <I>Modules mini-Howto</I> para obtener m&aacute;s
informaci&oacute;n sobre la configuraci&oacute;n de los m&oacute;dulos en el n&uacute;cleo.
<P>Por favor tenga en cuenta que algunos port&aacute;tiles usan circuiter&iacute;a que no
funcionar&aacute; con PLIP porque no permiten algunas combinaciones de se&ntilde;ales en las
que se basa PLIP, que las impresoras no usan.
<P>El interfaz <CODE>plip</CODE> de Linux es compatible con el <EM>Crynwyr Packet Driver
PLIP</EM> y esto significa que puede conectar su m&aacute;quina Linux a una m&aacute;quina DOS
que est&eacute; ejecutando cualquier clase de programas tcp/ip mediante <CODE>plip</CODE>.
<P>En la serie de n&uacute;cleos 2.0.* los dispositivos PLIP est&aacute;n asignados a
puertos e IRQ como sigue
<P>
<BLOCKQUOTE><CODE>
<PRE>
    dispositivo  i/o    IRQ
    ----------- -----   ---
    plip0       0x3bc   5
    plip1       0x378   7
    plip2       0x278   2
</PRE>
</CODE></BLOCKQUOTE>
<P>Si sus puertos paralelos no se ajustan a alguna de las combinaciones de encima
entonces tendr&aacute; que cambiar la IRQ de un puerto usando el par&aacute;metro <CODE>irq</CODE> de
la orden <CODE>ifconfig</CODE>. Aseg&uacute;rese de que activa las IRQ de los puertos de
impresora en la ROM BIOS antes, si es que dispone de esa opci&oacute;n. Como
alternativa, puede especificar las opciones <CODE>io=</CODE> e <CODE>irq=</CODE> como
argumentos a <CODE>insmod</CODE>, si usa m&oacute;dulos. Por ejemplo:
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# insmod plip.o io=0x288 irq=5
</PRE>
</CODE></BLOCKQUOTE>
<P>La operaci&oacute;n PLIP se controla con dos retardos, cuyos valores por defecto
suelen ser correctos. Posiblemente necesite incrementarlos si tiene una
m&aacute;quina un tanto lenta, en cuyo caso los temporizadores a incrementar
est&aacute;n en la <B>otra</B> m&aacute;quina. Hay un programa llamado <CODE>plipconfig</CODE> que
permite cambiar la configuraci&oacute;n de los temporizadores sin recompilar el
n&uacute;cleo. Viene con muchas distribuciones Linux.
<P>Para configurar una interfaz <EM>plip</EM>, necesitar&aacute; invocar las siguientes
&oacute;rdenes (o <B>a&ntilde;adirlas</B> a su gui&oacute;n de iniciaci&oacute;n del sistema):
<P>
<BLOCKQUOTE><CODE>
<PRE>
root# /sbin/ifconfig plip1 pliplocal pointopoint plipremota
root# /sbin/route add plipremota plip1
</PRE>
</CODE></BLOCKQUOTE>
<P>Aqu&iacute;, el puerto usado es el que est&aacute; en la direcci&oacute;n E/S <CODE>0x378</CODE>;
<CODE>pliplocal</CODE> y <CODE>plipremota</CODE> son los nombres o direcciones IP usadas para
los extremos del cable PLIP. Personalmente, prefiero tenerlas en mi base de
datos <CODE>/etc/hosts</CODE>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# entradas plip
192.168.3.1   pliplocal
192.168.3.2   plipremota
</PRE>
</CODE></BLOCKQUOTE>
<P>El par&aacute;metro <CODE>pointopoint</CODE> tiene el mismo significado que para SLIP, en el
que especifica la direcci&oacute;n de la m&aacute;quina en el otro extremo del enlace.
<P>En casi todos los aspectos, se puede tratar una interfaz <CODE>plip</CODE> como si
fuese una interfaz <CODE>SLIP</CODE>, excepto que no se puede (ni se necesita)
usar <CODE>dip</CODE> ni <CODE>slattach</CODE>.
<P>Para obtener m&aacute;s informaci&oacute;n al respecto de PLIP, acuda al <I>PLIP
mini-Howto</I>. 
<P>
<H2><A NAME="ss7.3">7.3 PLIP en Linux-2.2</A>
</H2>

<P>
<P>Durante el desarrollo de las versiones 2.1 del n&uacute;cleo, se cambi&oacute; la
implementaci&oacute;n del puerto paralelo, hacia una configuraci&oacute;n mejor.
<P><B>Opciones de compilaci&oacute;n del n&uacute;cleo</B>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
    General setup  --->
        [*] Parallel port support
    Network device support  --->
        &lt;*> PLIP (parallel port) support
</PRE>
</CODE></BLOCKQUOTE>
<P>El nuevo c&oacute;digo de PLIP se comporta como el anterior (se usan las mismas
&oacute;rdenes <CODE>ifconfig</CODE> y <CODE>route</CODE> que en la secci&oacute;n anterior, pero la
iniciaci&oacute;n del dispositivo es diferente debido a la avanzada implementaci&oacute;n del
manejo del puerto paralelo).
<P>El «primer» dispositivo PLIP siempre es denominado <CODE>plip0</CODE>, siendo
&eacute;ste el que primero detecta el sistema, de manera similar a lo que ocurre
con los dispositivos Ethernet. El verdadero puerto paralelo que se va a
usar es uno de los que est&eacute;n disponibles, tal como se muestra en
<CODE>/proc/parport</CODE>. Por ejemplo, si s&oacute;lo tiene un puerto paralelo,
s&oacute;lo tendr&aacute; un directorio llamado <CODE>/proc/parport/0</CODE>.
<P>Si el n&uacute;cleo no detecta la IRQ usada por el puerto, <CODE>insmod plip</CODE>
fallar&aacute;; en este caso simplemente tendr&aacute; que escribir el n&uacute;mero correcto en
<CODE>/proc/parport/0/irq</CODE> y reinvocar <CODE>insmod</CODE>.
<P>Hay disponible informaci&oacute;n completa al respecto del puerto paralelo en el
archivo <CODE>Documentation/parport.txt</CODE>, parte de las fuentes de su
n&uacute;cleo.
<P>
<H2><A NAME="ss7.4">7.4 PPP</A>
</H2>

<P>
<P>Los nombres de los dispositivos PPP son <CODE>ppp0</CODE>, <CODE>ppp1</CODE>, etc. Los
dispositivos est&aacute;n numerados de forma secuencial de manera que el primer
dispositivo configurado recibe el <CODE>0</CODE>.
<P><B>Opciones de compilaci&oacute;n del N&uacute;cleo</B>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
    Networking options  --->
        &lt;*> PPP (point-to-point) support
</PRE>
</CODE></BLOCKQUOTE>
<P>La configuraci&oacute;n del PPP est&aacute; cubierta en detalle en el PPP-Como, <CODE>
<A HREF="http://www.insflug.org/documentos/PPP-Como/">http://www.insflug.org/documentos/PPP-Como/</A></CODE>.
<P>
<H3>Mantener una conexi&oacute;n permanente a la red usando <CODE>pppd</CODE>.</H3>

<P>
<P>Si es tan afortunado como para tener una conexi&oacute;n semi-permanente a la red y
quiere hacer que su m&aacute;quina establezca autom&aacute;ticamente la conexi&oacute;n PPP si se
pierde, existe un truco sencillo para hacerlo.
<P>Configure el PPP de tal manera que pueda ser iniciado por el usuario
<CODE>root</CODE> ejecutando la orden:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# pppd
</PRE>
</CODE></BLOCKQUOTE>
<P><B>Aseg&uacute;rese</B> de que tiene configurada la opci&oacute;n <CODE>-detach</CODE> en el fichero
<CODE>/etc/ppp/options</CODE>. Entonces, inserte la siguiente l&iacute;nea en el fichero
<CODE>/etc/inittab</CODE>, bajo las definiciones de <CODE>getty</CODE>.
<P>
<BLOCKQUOTE><CODE>
<PRE>
pd:23:respawn:/usr/sbin/pppd
</PRE>
</CODE></BLOCKQUOTE>
<P>Esto har&aacute; que el programa <CODE>init</CODE> ejecute y monitorice el programa <CODE>pppd</CODE>
y que lo reinicie autom&aacute;ticamente si muere.
<P>
<H2><A NAME="ss7.5">7.5 Cliente SLIP</A>
</H2>

<P>
<P>Los nombres de los dispositivos SLIP son <CODE>sl0</CODE>, <CODE>sl1</CODE>, etc.  siendo
asignado el <CODE>0</CODE> al primer dispositivo configurado y el resto incrementando
secuencialmente seg&uacute;n van siendo configurados.
<P><B>Opciones de compilaci&oacute;n del n&uacute;cleo</B>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
    Network device support  --->
        [*] Network device support
        &lt;*> SLIP (serial line) support
        [ ]  CSLIP compressed headers
        [ ]  Keepalive and linefill
        [ ]  Six bit SLIP encapsulation
</PRE>
</CODE></BLOCKQUOTE>
<P>El SLIP (<I>Serial Line Internet Protocol</I>) le permite usar tcp/ip sobre una
l&iacute;nea serie, sea una l&iacute;nea de tel&eacute;fono con un m&oacute;dem, o una l&iacute;nea dedicada.  Por
supuesto para usar SLIP necesitar&aacute; tener acceso a un <EM>servidor SLIP</EM> de
alg&uacute;n tipo. Muchas universidades y empresas de todo el mundo proporcionan
acceso mediante SLIP.
<P>Slip usa los puertos serie de su m&aacute;quina para transportar datagramas IP.
Para hacerlo debe tomar el control del dispositivo serie. Los dispositivos
SLIP se denominan <CODE>sl0</CODE>, <CODE>sl1</CODE>, etc. ¿C&oacute;mo se corresponden a sus
dispositivos serie? El c&oacute;digo de red usa lo que denominados una llamada
<EM>ioctl</EM> (i/o control - control de e/s) para convertir los dispositivos
serie en dispositivos SLIP. Se le proporcionan dos programas
que pueden hacer esto, y se llaman <CODE>dip</CODE> y <CODE>slattach</CODE>.
<P>
<H3>dip</H3>

<P>
<P><CODE>dip</CODE> (Dialup IP) es un sofisticado programa capaz de programar la
velocidad del dispositivo serie, ordenar a su m&oacute;dem que llame al otro extremo
del enlace, identificarle autom&aacute;ticamente en el servidor remoto, examinar los
mensajes que le env&iacute;a el servidor y obtener informaci&oacute;n tal como su direcci&oacute;n
IP y ejecutar las <EM>ioctl</EM> necesarias para conmutar su puerto serie al
modo SLIP. <CODE>dip</CODE> tiene una gran capacidad para ejecutar guiones
(scripts) y esto lo puede explotar para automatizar el procedimiento de
autenticaci&oacute;n.
<P>Puede encontrarlo en: <CODE>
<A HREF="ftp://metalab.unc.edu/pub/Linux/system/Network/serial/dip/dip337o-uri.tgz">ftp://metalab.unc.edu/pub/Linux/system/Network/serial/dip/dip337o-uri.tgz</A></CODE>.
<P>Para instalarlo, intente lo siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
    usuario% cd /usr/src
    usuario% gzip -dc dip337o-uri.tgz | tar xvf -
    usuario% cd dip-3.3.7o
    root# make install
</PRE>
</CODE></BLOCKQUOTE>
<P>El <CODE>Makefile</CODE> asume la existencia de un grupo denominado <CODE>uucp</CODE>,
pero puede que usted quiera cambiarlo a <CODE>dip</CODE> o <CODE>SLIP</CODE>
dependiendo de su configuraci&oacute;n.
<P>
<H3>slattach</H3>

<P>
<P><CODE>slattach</CODE> es un programa muy sencillo comparado con <CODE>dip</CODE>, muy
f&aacute;cil de usar, pero no tiene la sofisticaci&oacute;n de <CODE>dip</CODE>. No tiene
capacidad para ejecutar guiones, todo lo que hace es configurar su dispositivo
serie como dispositivo SLIP. Asume que tiene toda la informaci&oacute;n que necesita
y la l&iacute;nea serie se establece antes de que lo invoque. <CODE>slattach</CODE> es
ideal para usarlo donde necesite una conexi&oacute;n permanente al servidor, como un
cable f&iacute;sico o una l&iacute;nea dedicada.
<P>
<H3>¿Cu&aacute;ndo usar cada uno?</H3>

<P>
<P>Deber&iacute;a usar <CODE>dip</CODE> cuando su enlace a la m&aacute;quina servidora de SLIP es un
m&oacute;dem, o alg&uacute;n otro enlace temporal. Deber&iacute;a usar <CODE>slattach</CODE> cuando
disponga de una l&iacute;nea dedicada, quiz&aacute; un cable, entre su m&aacute;quina y el servidor,
y no se necesita ejecutar ninguna acci&oacute;n especial para hacer que el enlace
funcione. Mire la secci&oacute;n 
<A HREF="#Conexion Permanente con Slip">Conexi&oacute;n Permanente con Slip</A> para m&aacute;s informaci&oacute;n.
<P>configurar SLIP se parece mucho a configurar una interfaz Ethernet (lea la
secci&oacute;n 
<A HREF="Redes-En-Linux-Como-5.html#Ethernet">Configuraci&oacute;n de un dispositivo Ethernet</A> m&aacute;s atr&aacute;s).  Sin embargo, hay unas pocas
diferencias clave.
<P>Antes que nada, los enlaces SLIP son diferentes a las redes Ethernet en
que s&oacute;lo hay dos m&aacute;quinas en la red, una en cada extremo del enlace. Al
contrario que con Ethernet que est&aacute; disponible para su uso nada m&aacute;s que
termine de cablear, con SLIP, dependiendo del tipo de enlace que tenga,
puede que tenga que iniciar la conexi&oacute;n de red de alguna manera especial.
<P>Si est&aacute; usando <CODE>dip</CODE> entonces esto no deber&iacute;a hacerlo en el momento de
arrancar, sino algo m&aacute;s adelante, cuando est&eacute; preparado para usar el enlace. Es
posible automatizar este procedimiento.  Si est&aacute; usando <CODE>slattach</CODE>
entonces probablemente quieras a&ntilde;adir una secci&oacute;n a su fichero
<CODE>rc.*</CODE> correspondiente. Esto lo describiremos pronto.
<P>Hay dos tipos principales e servidores SLIP: servidores de direcciones IP
din&aacute;micas y servidores de direcciones IP est&aacute;ticas. Casi cualquier
servidor SLIP le pedir&aacute; al conectar una identificaci&oacute;n y una contrase&ntilde;a.
<CODE>dip</CODE> puede proporcionar estos datos autom&aacute;ticamente.
<P>
<H3>Servidor SLIP est&aacute;tico con l&iacute;nea por llamada y DIP.</H3>

<P>
<P>Un servidor est&aacute;tico de SLIP es aqu&eacute;l en el que se le ha dado una direcci&oacute;n IP
que es exclusivamente suya. Cada vez que conecte al servidor, tendr&aacute; que
configurar su puerto SLIP con esa direcci&oacute;n. El servidor est&aacute;tico de SLIP
contestar&aacute; a la llamada del m&oacute;dem, posiblemente le pregunte su nombre de
usuario y contrase&ntilde;a, y entonces encaminar&aacute; cualquier datagrama destinado a su
direcci&oacute;n mediante esa conexi&oacute;n. Si tiene un servidor est&aacute;tico, entonces puede
que quiera a&ntilde;adir una entrada con su direcci&oacute;n IP y el nombre de su m&aacute;quina (ya
que sabe cuales ser&aacute;n) en <CODE>/etc/hosts</CODE>. Tambi&eacute;n deber&iacute;a configurar
algunos otros ficheros como: <CODE>rc.*</CODE>, <CODE>host.conf</CODE>,
<CODE>resolv.conf</CODE>, <CODE>/etc/HOSTNAME</CODE> y <CODE>rc.local</CODE>. Recuerde que
cuando configure <CODE>rc.*</CODE>, no necesita a&ntilde;adir ninguna orden especial para
la conexi&oacute;n SLIP ya que es <CODE>dip</CODE> el que hace todo el trabajo duro al
configurar la interfaz. Necesitar&aacute; proporcionarle a <CODE>dip</CODE> la informaci&oacute;n
apropiada de manera que configure la interfaz por usted despu&eacute;s de ordenarle al
m&oacute;dem que establezca la llamada y de darle de alta en el servidor SLIP.
<P>Si esta es la manera de trabajar de su servidor SLIP entonces puede pasar
a la secci&oacute;n 
<A HREF="#Uso de Dip">Uso de Dip</A> para aprender a configurar
<CODE>dip</CODE> de forma apropiada.
<P>
<H3>Servidor SLIP din&aacute;mico con l&iacute;nea por llamada y DIP.</H3>

<P>
<P>Un servidor <EM>din&aacute;mico</EM> de SLIP es aqu&eacute;l que le asigna una direcci&oacute;n IP
al azar, a partir de una reserva de direcciones, cada vez que se registra. Eso
significa que no hay garant&iacute;as de que tenga una direcci&oacute;n en particular cada
vez, y esa direcci&oacute;n puede ser usada por otra persona despu&eacute;s de que usted haya
desconectado. El administrador de red que configur&oacute; el servidor SLIP habr&aacute;
asignado un rango de direcciones para que el servidor SLIP las use, cuando el
servidor recibe una nueva llamada entrante, localiza la primera direcci&oacute;n sin
asignar, gu&iacute;a a quien llama a trav&eacute;s del procedimiento de registro y entonces
imprime un mensaje de bienvenida que contiene la direcci&oacute;n IP que se le ha
asignado, para entonces proceder a usar esa direcci&oacute;n IP durante toda la
llamada.
<P>La configuraci&oacute;n para este tipo de servidor es similar a la configuraci&oacute;n
para un servidor est&aacute;tico, excepto en que debe a&ntilde;adir un paso en el que obtiene
la direcci&oacute;n IP que el servidor le ha asignado y configura su dispositivo SLIP
con ella.
<P>De nuevo, <CODE>dip</CODE> hace el trabajo duro y las nuevas versiones son
suficientemente sofisticadas no s&oacute;lo como para registrarle, sino tambi&eacute;n como
para leer autom&aacute;ticamente la direcci&oacute;n IP impresa en el mensaje de bienvenida y
almacenarla de manera que pueda configurar el dispositivo SLIP con ella.
<P>Si esta es la manera de trabajar de su servidor SLIP, entonces puede pasar a la
secci&oacute;n 
<A HREF="#Uso de Dip">Uso de Dip</A> para aprender a configurar
<CODE>dip</CODE> de forma apropiada.
<P>
<H3><A NAME="Uso de Dip"></A> Uso de Dip.</H3>

<P>
<P>Como se explic&oacute; anteriormente, <CODE>dip</CODE> es un programa potente que puede
simplificar y automatizar el proceso de llamada a el servidor SLIP, registro,
inicio de la conexi&oacute;n y configuraci&oacute;n de tus dispositivos SLIP con las &oacute;rdenes
<CODE>ifconfig</CODE> y <CODE>route</CODE> apropiadas.
<P>Esencialmente, para usar <CODE>dip</CODE> escribiremos un «gui&oacute;n dip», que es
b&aacute;sicamente una lista de &oacute;rdenes que <CODE>dip</CODE> comprende y que le dicen
c&oacute;mo debe realizar cada una de las acciones que usted quiere que haga.  Eche un
vistazo al fichero <CODE>sample.dip</CODE> que viene con <CODE>dip</CODE> para hacerse
una idea de c&oacute;mo funciona. <CODE>dip</CODE> es un programa bastante potente, con
muchas opciones. No las va a encontrar todas aqu&iacute;, y tendr&aacute; que mirar la
correspondiente p&aacute;gina <CODE>man</CODE>, el <CODE>README</CODE> y los ficheros de ejemplo que
vendr&aacute;n con su versi&oacute;n de <CODE>dip</CODE>.
<P>F&iacute;jese en que el gui&oacute;n <CODE>sample.dip</CODE> asume que est&aacute; accediendo a un
servidor SLIP est&aacute;tico, por lo que su IP ya se conoce de antemano. Las nuevas
versiones de <CODE>dip</CODE> incluyen, para los servidores SLIP din&aacute;micos, una
orden que puede usarse para leer y configurar autom&aacute;ticamente el dispositivo
SLIP con la direcci&oacute;n IP que el servidor din&aacute;mico le asigna. El ejemplo
siguiente es una versi&oacute;n modificada y traducida del <CODE>sample.dip</CODE> que
viene con <CODE>dip337j-uri.tgz</CODE> y probablemente sea un buen punto de
partida. Puede que quiera grabarlo como <CODE>/etc/guiondip</CODE> y editarlo para
que se ajuste a su configuraci&oacute;n.
<P>
<BLOCKQUOTE><CODE>
<PRE>
#
# sample.dip    Programa de soporte de conexi&oacute;n para Dialup IP
#
#               Este fichero (deber&iacute;a mostrar) muestra el uso de DIP
#       Este fichero deber&iacute;a funcionar para los servidores din&aacute;micos
#       de tipo Annex, si usted usa un servidor est&aacute;tico entonces utilice
#       el fichero sample.dip que viene en el paquete dip337-uri.tgz
#
#
# Versi&oacute;n:      @(#)sample.dip  1.40    20/07/93
#
# Autor:        Fred N. van Kempen, &lt;waltje@uWalt.NL.Mugnet.ORG>
#

main:
# Lo siguiente es configurar el nombre y direcci&oacute;n del otro extremo
# La m&aacute;quina a la que llamo se llama 'xs4all.hacktic.nl'
# (== 193.78.33.42)
get $remote xs4all.hacktic.nl
# Asignar 255.255.255.0 como m&aacute;scara de red de sl0
netmask 255.255.255.0
# Asignar el puerto serie y velocidad deseados
port cua02
speed 38400

# Reiniciar el m&oacute;dem y la l&iacute;nea terminal
# ¡Esto parece darle problemas a algunas personas!
reset

# ¡Nota! Valores "est&aacute;ndar" predefinidos de "errlevel"
#  0 - OK
#  1 - CONNECT
#  2 - ERROR
#
# Puede cambiarlos buscando "addchat()" en *.c...

# Nos preparamos para llamar.
send ATQ0V1E1X4\r
wait OK 2
if $errlvl != 0 goto problema_con_modem
dial 555-1234567
if $errlvl != 1 goto problema_con_modem

# Estamos conectados. Registrarse en el sistema.
login:
sleep 2
wait ogin: 20
if $errlvl != 0 goto problema_al_registrarse
send MILOGIN\n
wait ord: 20
if $errlvl != 0 goto clave_erronea
send MIPASSWD\n
loggedin:

# Ahora estamos registrados.
wait SOMEPROMPT 30
if $errlvl != 0 goto error_de_prompt

# Ordenamos al servidor que entre en modo SLIP
send SLIP\n
wait SLIP 30
if $errlvl != 0 goto error_de_prompt

# Obtenemos nuestra direcci&oacute;n IP del servidor y la asignamos
#   Aqu&iacute; asumiremos que tras ordenar al servidor SLIP que entre
#   en modo SLIP, nos imprime nuestra direcci&oacute;n IP.
get $local remote 30
if $errlvl != 0 goto prompt_error

# Configurar los par&aacute;metros operativos de SLIP
get $mtu 296
# Aseguramos que se ejecuta "route add -net default xs4all.hacktic.nl"
default

# ¡Decimos hola y arrancamos!
done:
print CONNECTED $local ---> $rmtip
mode CSLIP
goto salir

error_de_prompt:
print Se produjo un TIME-OUT esperando a que arrancara sliplogin
goto error

problema_al_registrarse:
print Hubo un problema esperando por el mensaje Login:...
goto error

clave_erronea:
print Hubo un problema esperando por el mensaje Password:...
goto error

problema_con_modem:
print Hubo un problema con el m&oacute;dem...
error:
print FALL&Oacute; LA CONEXI&Oacute;N a $remote
quit

salir:
exit
</PRE>
</CODE></BLOCKQUOTE>
<P>El ejemplo anterior asume que estamos llamando a un servidor SLIP
<EM>din&aacute;mico</EM>. Si est&aacute; llamando a un servidor SLIP <EM>est&aacute;tico</EM>,
entonces deber&iacute;a funcionarle el fichero <CODE>sample.dip</CODE> que viene con
<CODE>dip-337-uri.tgz</CODE>.
<P>Cuando se le da a <CODE>dip</CODE> la orden <CODE>get $local</CODE>, busca en el
texto que viene del otro extremo una cadena que se parezca a una direcci&oacute;n IP,
osea una cadena de n&uacute;meros separados por caracteres «.». Esta modificaci&oacute;n se
hizo espec&iacute;ficamente pensando en los servidores SLIP <EM>din&aacute;micos</EM>, para
que el proceso de leer la direcci&oacute;n IP pudiera ser automatizado.
<P>El ejemplo anterior crear&aacute; autom&aacute;ticamente una ruta por defecto a trav&eacute;s del
enlace SLIP. Si no es lo que deseaba, a lo mejor porque tiene una conexi&oacute;n
Ethernet que deber&iacute;a ser la ruta por defecto, entonces elimine la orden
<CODE>default</CODE> del gui&oacute;n. Despu&eacute;s de que haya acabado de ejecutarse el gui&oacute;n,
si ejecuta la orden <CODE>ifconfig</CODE>, ver&aacute; que hay un dispositivo
<CODE>sl0</CODE>. Este es el dispositivo SLIP. Si fuese necesario, podr&iacute;a modificar
su configuraci&oacute;n a mano, despu&eacute;s de que la orden <CODE>dip</CODE> haya acabado,
usando las &oacute;rdenes <CODE>ifconfig</CODE> y <CODE>route</CODE>.
<P>Por favor, observe que <CODE>dip</CODE> le permite elegir varios protocolos
diferentes en la orden <CODE>mode</CODE>. El ejemplo m&aacute;s com&uacute;n es <EM>cSLIP</EM>
que es SLIP con compresi&oacute;n. Por favor, tenga en cuenta que ambos extremos del
enlace deben concordar, por lo que debe asegurarse de que elija lo que elija,
sea la mismo que lo que tenga el servidor.
<P>El ejemplo anterior es bastante robusto y deber&iacute;a copar con la mayor&iacute;a de los
errores. Para obtener m&aacute;s informaci&oacute;n, haga el favor de dirigirse a las p&aacute;ginas
man de <CODE>dip</CODE>. Naturalmente podr&iacute;a, por ejemplo, codificar un gui&oacute;n para
que haga cosas como llamar de nuevo al servidor si no consigue conectarse tras
un periodo de tiempo determinado, o incluso hacer intentos con varios
servidores si tiene acceso a m&aacute;s de uno.
<P>
<H3><A NAME="Conexion Permanente con Slip"></A> Conexi&oacute;n SLIP permanente usando una l&iacute;nea dedicada y slattach </H3>

<P>
<P>Si lo que tiene es un cable entre dos m&aacute;quinas, o es tan afortunado como para
tener una l&iacute;nea dedicada, o alg&uacute;n otro tipo de conexi&oacute;n en serie permanente
entre su m&aacute;quina y otra, entonces no necesita la complejidad de usar
<CODE>dip</CODE> para establecer un enlace serie. <CODE>slattach</CODE> es una utilidad
muy sencilla de usar, que le permite suficiente funcionalidad como para
configurar una conexi&oacute;n.
<P>Como la conexi&oacute;n ser&aacute; permanente, querr&aacute; a&ntilde;adir algunas &oacute;rdenes al fichero
<CODE>rc</CODE> pertinente. En esencia, todo lo que necesita hacer para tener una
conexi&oacute;n permanente es asegurarse de que configura el dispositivo serie a la
velocidad correcta y que lo pasa a modo SLIP. <CODE>slattach</CODE> permite hacer
esto con una sola orden. A&ntilde;ade lo siguiente al fichero <CODE>rc</CODE> pertinente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
#
# Activar una conexi&oacute;n SLIP est&aacute;tica por l&iacute;nea dedicada
#
#  configuramos /dev/cua0 para 19.2kbps y cslip
/sbin/slattach -p cslip -s 19200 /dev/cua0 &amp;
/sbin/ifconfig sl0 IPA.IPA.IPA.IPA pointopoint IPR.IPR.IPR.IPR up
#
# Fin de SLIP est&aacute;tico
</PRE>
</CODE></BLOCKQUOTE>
<P><B>Nota del traductor</B>: A fecha de la traducci&oacute;n, la serie estable del
n&uacute;cleo era la <CODE>2.2</CODE>. En la serie <CODE>2.2</CODE>, los dispositivos
<CODE>/dev/cuaX</CODE> han sido completamente eliminados, unific&aacute;ndolos a los
<CODE>/dev/ttySX</CODE>.
<P>Donde:
<P>
<DL>
<DT><B>IPA.IPA.IPA.IPA</B><DD><P>representa su direcci&oacute;n IP.
<DT><B>IPR.IPR.IPR.IPR</B><DD><P>representa la direcci&oacute;n IP del extremo remoto.
</DL>
<P><CODE>slattach</CODE> asigna el primer dispositivo SLIP sin asignar al dispositivo
serie especificado. <CODE>slattach</CODE> comienza por <CODE>sl0</CODE>. Por lo tanto
la primera orden <CODE>slattach</CODE> asocia el dispositivo SLIP <CODE>sl0</CODE> al
dispositivo serie especificado y <CODE>sl1</CODE> la siguiente vez, etc.
<P><CODE>slattach</CODE> le permite configurar varios protocolos diferentes con el
argumento <CODE>-p</CODE>. En su caso podr&aacute; usar tanto <CODE>SLIP</CODE> como
<CODE>cSLIP</CODE> dependiendo de si quiere o no usar compresi&oacute;n. Nota: ambos
extremos deben estar de acuerdo sobre si usar compresi&oacute;n o no.
<P>
<H2><A NAME="Servidor SLIP"></A> <A NAME="ss7.6">7.6 Servidor SLIP.</A>
</H2>

<P>
<P>Si tiene una m&aacute;quina, quiz&aacute; conectada a una red, a la que le gustar&iacute;a que otra
m&aacute;quina pudiese llamar y proporcionar servicios de red, entonces necesita
configurarla como servidor. Si quiere usar SLIP como protocolo de l&iacute;nea serie,
entonces tiene tres opciones para configurar su m&aacute;quina Linux como servidor
SLIP. Yo preferir&iacute;a usar la primera presentada, <CODE>sliplogin</CODE>, ya que
parece la m&aacute;s sencilla de configurar y entender, pero presentar&eacute; un sumario de
cada una, para que pueda tomar su propia decisi&oacute;n.
<P>
<H3><A NAME="Servidor slip usando sliplogin"></A> Servidor slip usando <CODE>sliplogin</CODE>.</H3>

<P>
<P><CODE>sliplogin</CODE> es un programa, que puede asignar a los usuarios de SLIP en
lugar de un «shell» normal, que convierte una l&iacute;nea terminal en una l&iacute;nea SLIP.
Esto le permite configurar una m&aacute;quina Linux tanto como <EM>servidor de
direcciones est&aacute;ticas</EM>, obteniendo los usuarios la misma direcci&oacute;n cada vez que
llaman, o como <EM>servidor de direcciones din&aacute;micas</EM>, donde los usuarios
obtienen una direcci&oacute;n que no tiene que ser necesariamente la misma que la
&uacute;ltima vez que llamaron.
<P>El que llama se registrar&aacute; igual que en un proceso est&aacute;ndar de <CODE>login</CODE>,
introduciendo su nombre de usuario y contrase&ntilde;a, pero en lugar de presentarle
un int&eacute;rprete de &oacute;rdenes normal tras el registro, se ejecuta <CODE>sliplogin</CODE>, el
cual busca en su fichero de configuraci&oacute;n (<CODE>/etc/slip.hosts</CODE>) una
entrada con el nombre de usuario que corresponda a la persona que llam&oacute;. Si lo
encuentra, entonces configura la l&iacute;nea como «clean» y de 8 bit, y hace una
llamada <EM>ioctl</EM> para convertir la disciplina de la l&iacute;nea a SLIP. Cuando se
completa este proceso, toma lugar la &uacute;ltima parte de la configuraci&oacute;n, en la
cual <CODE>sliplogin</CODE> invoca un gui&oacute;n de int&eacute;rprete de &oacute;rdenes que configura la
interfaz SLIP con la direcci&oacute;n ip y m&aacute;scara de red relevantes, y asigna
las rutas apropiadas. Este gui&oacute;n suele llamarse <CODE>/etc/slip.login</CODE>
pero, de forma parecida a <CODE>getty</CODE>, si ciertos usuarios requieren una
iniciaci&oacute;n especial, entonces puede crear guiones de configuraci&oacute;n llamados
<CODE>/etc/slip.login.nombreusuario</CODE> que ser&aacute;n ejecutados espec&iacute;ficamente
para ellos en lugar del que hay por defecto.
<P>Tambi&eacute;n hay tres o cuatro ficheros que necesitar&aacute; configurar para tener
<CODE>sliplogin</CODE> en funcionamiento. Detallar&eacute; c&oacute;mo y d&oacute;nde obtener los programas
y c&oacute;mo se configura cada uno. Los ficheros son:
<P>
<UL>
<LI><CODE>/etc/passwd</CODE>, para las cuentas de los usuarios que llaman.
</LI>
<LI><CODE>/etc/slip.hosts</CODE>, para almacenar la informaci&oacute;n &uacute;nica a cada
usuario que llama.
</LI>
<LI><CODE>/etc/slip.login</CODE>, que lleva la configuraci&oacute;n del encaminamiento
que necesite hacerse para el usuario.
</LI>
<LI><CODE>/etc/slip.tty</CODE>, que ser&aacute; necesario s&oacute;lo si est&aacute; configurando el
servidor para asignar direcciones din&aacute;micas y contiene una tabla de direcciones
a asignar.
</LI>
<LI><CODE>/etc/slip.logout</CODE>, que contiene las &oacute;rdenes necesarias para dejar
las cosas a punto una vez el usuario cuelgue o cierre la conexi&oacute;n.
</LI>
</UL>
<P>
<H3>D&oacute;nde obtener <CODE>sliplogin</CODE></H3>

<P>
<P>Puede que ya tenga el paquete <CODE>sliplogin</CODE> instalado como parte de su
distribuci&oacute;n; si no es as&iacute; entonces podr&aacute; obtenerlo de: <CODE>
<A HREF="ftp://metalab.unc.edu/pub/linux/system/Network/serial/sliplogin-2.1.1.tar.gz">ftp://metalab.unc.edu/pub/linux/system/Network/serial/sliplogin-2.1.1.tar.gz</A></CODE>.
El fichero tar contiene tanto las fuentes, como los programas ya compilados y
una p&aacute;gina <EM>man</EM>.
<P>para asegurar que s&oacute;lo son capaces de ejecutar <CODE>sliplogin</CODE> los usuarios
autorizados, deber&iacute;a a&ntilde;adir una entrada al fichero <CODE>/etc/group</CODE> similar
a la siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
 ..
slip::13:radio,fred
 ..
</PRE>
</CODE></BLOCKQUOTE>
<P>Cuando instale el paquete <CODE>sliplogin</CODE>, el <CODE>Makefile</CODE> cambiar&aacute; el grupo al
que pertenece el programa <CODE>sliplogin</CODE> por <CODE>slip</CODE>, y esto significa que
s&oacute;lo los usuarios que pertenezcan a ese grupo ser&aacute;n capaces de ejecutarlo. El
ejemplo anterior autorizar&aacute; ejecutar <CODE>sliplogin</CODE> s&oacute;lo a los usuarios
<CODE>radio</CODE> y <CODE>fred</CODE>.
<P>Para instalar los ejecutables en el directorio <CODE>/sbin</CODE> y la p&aacute;gina de
<EM>man</EM> en la secci&oacute;n 8, haga lo siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# cd /usr/src
# gzip -dc .../sliplogin-2.1.1.tar.gz | tar xvf -
# cd sliplogin-2.1.1
# &lt;..edite el Makefile si no usa shadow password..>
# make install
</PRE>
</CODE></BLOCKQUOTE>
<P>Si quiere recompilar los ejecutables tras la instalaci&oacute;n, a&ntilde;ada un <CODE>make
clean</CODE> antes de <CODE>make install</CODE>. Si quiere instalar los ejecutables en
cualquier otro lado, necesitar&aacute; editar la regla <CODE>install</CODE> en el
<CODE>Makefile</CODE>.
<P>Por favor, lea los ficheros <CODE>README</CODE> que vienen con el paquete si quiere
obtener m&aacute;s informaci&oacute;n.
<P>
<H3>Configuraci&oacute;n de <CODE>/etc/passwd</CODE> para m&aacute;quinas que usan Slip.</H3>

<P>
<P>Lo normal es que cree algunos <I>login</I> especiales en el fichero
<CODE>/etc/passwd</CODE> para la gente que llama con Slip. Una convenci&oacute;n
com&uacute;nmente aceptada es usar el nombre de la m&aacute;quina que llaman prefij&aacute;ndole una
letra «S» may&uacute;scula. Por tanto, por ejemplo, si la m&aacute;quina que llama se
denomina <CODE>radio</CODE>, entonces podr&iacute;as crear una entrada en <CODE>/etc/passwd</CODE>
que se pareciese a:
<P>
<BLOCKQUOTE><CODE>
<PRE>
Sradio:FvKurok73:1427:1:radio SLIP login:/tmp:/sbin/sliplogin
</PRE>
</CODE></BLOCKQUOTE>
<P>Realmente no importa c&oacute;mo se llame la cuenta, siempre y cuando tenga alg&uacute;n
significado para usted.
<P>Nota: el que llama no necesita ning&uacute;n directorio personal, ya que no se le
presentar&aacute; ning&uacute;n int&eacute;rprete de &oacute;rdenes, por tanto <CODE>/tmp</CODE> es una buena
elecci&oacute;n. Observe tambi&eacute;n que se usa <CODE>sliplogin</CODE> en lugar de un int&eacute;rprete
de &oacute;rdenes normal.
<P>
<H3>Configuraci&oacute;n de <CODE>/etc/slip.hosts</CODE></H3>

<P>
<P>El fichero <CODE>/etc/slip.hosts</CODE> es el fichero en el que <EM>sliplogin</EM>
busca las entradas que se correspondan al nombre de login que de las que
obtiene los detalles de configuraci&oacute;n para esa persona. Es aqu&iacute; donde
se especifica la direcci&oacute;n ip y la m&aacute;scara de red que se le asignar&aacute; al que
llama y que ser&aacute;n configuradas para su uso.  Las entradas para dos m&aacute;quinas,
una con configuraci&oacute;n est&aacute;tica para <CODE>radio</CODE> y otra, con configuraci&oacute;n
din&aacute;mica, para la m&aacute;quina <CODE>albert</CODE>, deber&iacute;an parecerse a lo siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
#
Sradio   44.136.8.99   44.136.8.100  255.255.255.0  normal      -1
Salbert  44.136.8.99   DYNAMIC       255.255.255.0  compressed  60
#
</PRE>
</CODE></BLOCKQUOTE>
<P>Las entradas del fichero <CODE>/etc/slip.hosts</CODE> son
<P>
<OL>
<LI>el nombre de login del que llama.</LI>
<LI>la direcci&oacute;n ip de la m&aacute;quina servidor, osea esta m&aacute;quina.
</LI>
<LI>la direcci&oacute;n IP que se asignar&aacute; al que llama. Si este campo se rellena
con <CODE>DYNAMIC</CODE> entonces se asignar&aacute; una direcci&oacute;n ip basada en la informaci&oacute;n
contenida en el fichero <CODE>/etc/slip.tty</CODE> del que se habl&oacute; antes.
<B>Nota:</B> deber&aacute; usar al menos la versi&oacute;n <CODE>1.3</CODE> de sliplogin para que esto
funcione.
</LI>
<LI>la m&aacute;scara de red asignada a la m&aacute;quina que llama en notaci&oacute;n decimal
punteada, por ejemplo <CODE>255.255.255.0</CODE> para una m&aacute;scara de red para una clase
C.
</LI>
<LI>las opciones del modo slip, que le permiten activar o desactivar la
compresi&oacute;n y otras caracter&iacute;sticas de slip. Los valores permitidos aqu&iacute;
son <CODE>normal</CODE> y <CODE>compressed</CODE>.
</LI>
<LI>un par&aacute;metro de <I>timeout</I> que especifica cu&aacute;nto tiempo puede estar
ociosa la l&iacute;nea (sin recibir datagramas) antes de que se desconecte la l&iacute;nea.
Un valor negativo desactivar&aacute; esta caracter&iacute;stica.
</LI>
<LI>argumentos opcionales.</LI>
</OL>
<P>Nota: Para los campos 2 y 3 puede usar tanto el nombre de la m&aacute;quina como su
direcci&oacute;n IP en notaci&oacute;n decimal. Si usted usa nombres entonces tendr&aacute;n que ser
resueltos, esto es, su m&aacute;quina deber&aacute; ser capaz de localizar la direcci&oacute;n ip de
esos nombres o en caso contrario el gui&oacute;n fallar&aacute; cuando sea ejecutado. Puede
probarlo intentando hacer telnet hacia esos nombres, y si obtiene el mensaje
<CODE>Trying nnn.nnn.nnn...</CODE> entonces es que su m&aacute;quina ha sido capaz de
encontrar una direcci&oacute;n ip para ese nombre. Si obtiene el mensaje <CODE>Unknown
host</CODE>, entonces no lo consigui&oacute;. En este caso, use una direcci&oacute;n ip en notaci&oacute;n
decimal o ponga a punto la configuraci&oacute;n de su resolutor de nombres. (Ver
secci&oacute;n 
<A HREF="Redes-En-Linux-Como-5.html#Resolucion de Nombres">Resoluci&oacute;n de Nombres</A>).
<P>Los modos slip m&aacute;s comunes son:
<P>
<DL>
<DT><B>normal</B><DD><P>para habilitar el SLIP normal sin compresi&oacute;n.
<DT><B>compressed</B><DD><P>para habilitar la compresi&oacute;n de cabeceras de
van Jacobsen (cSLIP)
</DL>
<P>Por supuesto, son mutuamente exclusivos. Puede usar uno o el otro, pero no
ambos. Para obtener m&aacute;s informaci&oacute;n sobre las otras opciones disponibles, ve a
las p&aacute;ginas de <CODE>man</CODE>.
<P>
<H3>Configuraci&oacute;n del fichero <CODE>/etc/slip.login</CODE>.</H3>

<P>
<P>Despu&eacute;s de que sliplogin haya examinado el <CODE>/etc/slip.hosts</CODE> y
encontrado una entrada que concuerde, intentar&aacute; ejecutar el fichero
<CODE>/etc/slip.login</CODE> para configurar la interfaz SLIP con su direcci&oacute;n ip y
su m&aacute;scara.
<P>El fichero de ejemplo <CODE>/etc/slip.login</CODE> proporcionado con el paquete
<CODE>sliplogin</CODE> se parece a esto:
<P>
<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh -
#
#       @(#)slip.login  5.1 (Berkeley) 7/1/90
#
# fichero de login gen&eacute;rico para una l&iacute;nea SLIP. sliplogin
# lo invoca con los par&aacute;metros:
#     $1       $2       $3    $4, $5, $6 ...
# unidadSLIP veloctty   pid   los argumentos de la entrada en slip.host
#
/sbin/ifconfig $1 $5 pointopoint $6 mtu 1500 -trailers up
/sbin/route add $6
arp -s $6 &lt;hw_addr> pub
exit 0
#
</PRE>
</CODE></BLOCKQUOTE>
<P>Podr&aacute; comprobar que este gui&oacute;n se limita a usar las &oacute;rdenes <CODE>ifconfig</CODE> y
<CODE>route</CODE> para configurar el dispositivo SLIP con su direcci&oacute;n ip,
direcci&oacute;n ip remota y m&aacute;scara de red y crea una ruta hasta la direcci&oacute;n remota
a trav&eacute;s del dispositivo SLIP. Exactamente lo mismo que har&iacute;a si estuviera
usando la orden <CODE>slattach</CODE>.
<P>Advierta tambi&eacute;n el uso de <I>Proxy ARP</I> para asegurar que otras
m&aacute;quinas en la misma Ethernet que la m&aacute;quina servidora sabr&aacute;n c&oacute;mo llegar
a la m&aacute;quina que llama. El campo <CODE>&lt;hw_addr&gt;</CODE> (direcci&oacute;n hardware)
deber&iacute;a ser la direcci&oacute;n hardware de la tarjeta Ethernet de la m&aacute;quina. Si su
m&aacute;quina servidora no est&aacute; en una red Ethernet, entonces puede eliminar
completamente esa l&iacute;nea.
<P>
<H3>Configuraci&oacute;n del fichero <CODE>/etc/slip.logout</CODE>.</H3>

<P>
<P>Cuando la llamada se corta, querr&aacute; asegurarse de que se restaura el estado
normal del dispositivo serie para que otras personas sean capaces m&aacute;s adelante
de registrarse correctamente. Esto se lleva a cabo mediante el uso del fichero
<CODE>/etc/slip.logout</CODE>. Es de formato bastante sencillo y se le llama con
los mismos argumentos que al fichero <CODE>/etc/slip.login</CODE>.
<P>
<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh -
#
#               slip.logout
#
/sbin/ifconfig $1 down
arp -d $6
exit 0
#
</PRE>
</CODE></BLOCKQUOTE>
<P>Todo lo que hace es desactivar (down) la interfaz, lo que borrar&aacute; la ruta que
se cre&oacute; anteriormente. Tambi&eacute;n usa la orden <CODE>arp</CODE> para borrar cualquier
proxy que se estableciese. De nuevo, no necesita la orden <CODE>arp</CODE> en el
gui&oacute;n si su m&aacute;quina servidora no tiene un puerto ethernet.
<P>
<H3>Configuraci&oacute;n del fichero <CODE>/etc/slip.tty.</CODE></H3>

<P>
<P>Si est&aacute; usando asignaci&oacute;n din&aacute;mica de direcciones ip (tiene configurada
cualquier m&aacute;quina con la palabra clave <CODE>DYNAMIC</CODE> en el fichero
<CODE>/etc/slip.hosts</CODE>, entonces deber&aacute; configurar el fichero
<CODE>etc/slip.tty</CODE> para que tenga una lista de las direcciones que se
asignar&aacute;n a qu&eacute; puerto. S&oacute;lo necesita este fichero si desea que su servidor
asigne de manera din&aacute;mica las direcciones a los usuarios.
<P>El fichero es una tabla que lista los dispositivos <CODE>tty</CODE> que dar&aacute;n
soporte a las conexiones SLIP y las direcciones ip que deber&iacute;an asignarse
a los usuarios que llaman a ese puerto.
<P>Su formato es como sigue:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# slip.tty    tty -> correspondencias IP para SLIP din&aacute;mico
# formato: /dev/tty?? xxx.xxx.xxx.xxx
#
/dev/ttyS0      192.168.0.100
/dev/ttyS1      192.168.0.101
#
</PRE>
</CODE></BLOCKQUOTE>
<P>Lo que dice esta tabla es que a la gente que llame al puerto
<CODE>/dev/ttyS0</CODE> y que tengan la palabra <CODE>DYNAMIC</CODE> en su campo de
direcci&oacute;n remota en el fichero <CODE>/etc/slip.hosts</CODE> les ser&aacute; asignada una
direcci&oacute;n de <CODE>192.168.0.100</CODE>.
<P>De esta manera s&oacute;lo necesita asignar una direcci&oacute;n por puerto para todos los
usuarios que no requieran una direcci&oacute;n dedicada para ellos. Esto le ayuda a
mantener bajo m&iacute;nimos los n&uacute;meros de direcci&oacute;n para evitar su escasez.
<P>
<H3><A NAME="Servidor Slip usando dip"></A> Servidor Slip usando <CODE>dip</CODE>.</H3>

<P>
<P>D&eacute;jeme empezar diciendo que parte de la informaci&oacute;n que sigue viene de las
p&aacute;ginas de manual de <CODE>dip</CODE>, donde se documenta brevemente la manera de
usar Linux como servidor SLIP. por favor, preste atenci&oacute;n, puesto que lo
siguiente est&aacute; basado en el paquete <CODE>dip337o-uri.tgz</CODE> y probablemente no
ses aplicable a otrs versiones de <CODE>dip</CODE>.
<P><CODE>dip</CODE> tiene un modo de operaci&oacute;n de entrada, en el cual asigna
autom&aacute;ticamente una entrada para el usuario que lo invoque y configura la l&iacute;nea
serie como enlace SLIP de acuerdo con la informaci&oacute;n que encuentre en el
fichero <CODE>/etc/dipshosts</CODE>. Este modo de operaci&oacute;n de entrada se activa
invocando a <CODE>dip</CODE> como <CODE>diplogin</CODE>. Es as&iacute; por tanto la manera de
usar <CODE>dip</CODE> como servidor SLIP, creando cuentas especiales donde se usa
<CODE>diplogin</CODE> como <I>login shell</I>.
<P>Lo primero que necesita hacer es un enlace simb&oacute;lico como sigue:
<P>
<BLOCKQUOTE><CODE>
<PRE>
# ln -sf /usr/sbin/dip /usr/sbin/diplogin
</PRE>
</CODE></BLOCKQUOTE>
<P>Despu&eacute;s necesitar&aacute; a&ntilde;adir entradas tanto al fichero <CODE>/etc/passwd</CODE> como
al <CODE>/etc/diphosts</CODE>. Las entradas que necesita hacer tienen el formato
que sigue:
<P>Para configurar Linux como servidor SLIP con <CODE>dip</CODE>, se necesita crear
algunas cuentas SLIP especiales para los usuarios, en las que se usa
<CODE>dip</CODE> (en modo entrada) como <I>login shell</I>. Se sugiere la convenci&oacute;n
de comenzar los nombres de las cuentas SLIP con una <CODE>S</CODE> may&uacute;scula, como por
ejemplo <CODE>Sfredm</CODE>.
<P>Una entrada en <CODE>/etc/passwd</CODE> para un usuario SLIP se parece a:
<P>
<BLOCKQUOTE><CODE>
<PRE>
Sfredm:ij/SMxiTlGVCo:1004:10:Fred:/tmp:/usr/sbin/diplogin
^^         ^^        ^^  ^^   ^^   ^^   ^^
|          |         |   |    |    |    \__ diplogin como login shell
|          |         |   |    |    \_______ Directorio `home'
|          |         |   |    \____________ Nombre completo del usuario
|          |         |   \_________________ ID de grupo del usuario
|          |         \_____________________ ID del usuario
|          \_______________________________ Contrase&ntilde;a cifrada
\__________________________________________ Nombre de Login del Usuario SLIP
</PRE>
</CODE></BLOCKQUOTE>
<P>Despu&eacute;s de que el usuario se registre, el programa <CODE>login</CODE>, si encuentra
y autentica al usuario, ejecutar&aacute; la orden <CODE>diplogin</CODE>.  <CODE>dip</CODE>,
cuando es invocado como <CODE>diplogin</CODE>, sabe que debe asumir autom&aacute;ticamente
que va a ser usado como int&eacute;rprete de &oacute;rdenes de <I>login</I>. Cuando comienza
como <CODE>diplogin</CODE>, la primera cosa que hace es usar la funci&oacute;n
<CODE>getuid()</CODE> para tomar el userid de quien fuera que lo invoc&oacute;. Entonces
busca en el fichero <CODE>/etc/diphosts</CODE> la primera entrada que se
corresponda bien con el userid, bien con el dispositivo <CODE>tty</CODE> por el que
entr&oacute; la llamada y se configura apropiadamente. Por razones de sentido com&uacute;n,
para que se pueda dar a un usuario una entrada en el fichero <CODE>diphosts</CODE>,
o bien para que se le d&eacute; la configuraci&oacute;n por defecto, es posible montar el
servidor de tal manera que se pueda tener una mezcla de usuarios a los que se
asigne la direcci&oacute;n de forma est&aacute;tica o din&aacute;mica.
<P><CODE>dip</CODE> a&ntilde;adir&aacute; autom&aacute;ticamente una entrada <I>Proxy-ARP</I> si se le invoca
en modo entrada, por lo que no tendr&aacute; que preocuparse de hacerlo manualmente.
<P>
<H3>Configuraci&oacute;n del fichero /etc/diphosts</H3>

<P>
<P><CODE>/etc/diphosts</CODE> lo usa <CODE>dip</CODE> para buscar configuraciones ya
establecidas para m&aacute;quinas remotas. Estas m&aacute;quinas remotas pueden ser usuarios
que llaman a la m&aacute;quina Linux, o pueden ser m&aacute;quinas a las que usted llamas
desde su m&aacute;quina.
<P>El formato general para <CODE>/etc/diphosts</CODE> es como sigue:
<P>
<BLOCKQUOTE><CODE>
<PRE>
 ..
Suwalt::145.71.34.1:145.71.34.2:255.255.255.0:SLIP uwalt:CSLIP,1006
ttyS1::145.71.34.3:145.71.34.2:255.255.255.0:Dynamic ttyS1:CSLIP,296
 ..
</PRE>
</CODE></BLOCKQUOTE>
<P>Los campos son:
<P>
<OL>
<LI><CODE>nombre de login</CODE>: el que devuelve <CODE>getpwuid(getuid())</CODE> o el
nombre de la tty.
</LI>
<LI><CODE>sin uso</CODE>: para compatibilidad con <CODE>passwd</CODE>
</LI>
<LI><CODE>Direcci&oacute;n Remota</CODE>: direcci&oacute;n IP de la m&aacute;quina que llama, puede
ser tanto la num&eacute;rica como el nombre.
</LI>
<LI><CODE>Direcci&oacute;n Local</CODE>: direcci&oacute;n IP de esta m&aacute;quina, en n&uacute;mero o por
nombre.
</LI>
<LI><CODE>M&aacute;scara de red</CODE>: en notaci&oacute;n decimal puntuada.</LI>
<LI><CODE>Campo de comentario</CODE>: ponga aqu&iacute; lo que quiera.</LI>
<LI><CODE>protocolo</CODE>: Slip, cSLIP, etc.</LI>
<LI><CODE>MTU</CODE>: n&uacute;mero decimal.
</LI>
</OL>
<P>Un ejemplo de entrada en <CODE>/etc/net/diphosts</CODE> para un usuario SLIP
remoto podr&iacute;a ser:
<P>
<BLOCKQUOTE><CODE>
<PRE>
Sfredm::145.71.34.1:145.71.34.2:255.255.255.0:SLIP uwalt:SLIP,296
</PRE>
</CODE></BLOCKQUOTE>
<P>lo que especifica un enlace SLIP con direcci&oacute;n remota <CODE>145.71.34.1</CODE> y MTU de
<CODE>296</CODE>, o:
<P>
<BLOCKQUOTE><CODE>
<PRE>
Sfredm::145.71.34.1:145.71.34.2:255.255.255.0:SLIP uwalt:CSLIP,1006
</PRE>
</CODE></BLOCKQUOTE>
<P>que especifica un enlace capaz de usar cSLIP con direcci&oacute;n remota
<CODE>145.71.34.1</CODE> y MTU de <CODE>1006</CODE>.
<P>Por tanto, todos los usuarios que desee que tengan asignado un acceso de
llamada con IP est&aacute;tica deber&iacute;an tener una entrada en <CODE>/etc/diphosts</CODE>.
Si quiere que los usuarios que llaman a un puerto en particular y, que los
detalles sean asignados din&aacute;micamente, deber&aacute; tener entonces una entrada para
el dispositivo <CODE>tty</CODE> y no una basada en el usuario. Deber&iacute;a configurar
al menos una entrada para cada dispositivo <CODE>tty</CODE> que usen los usuarios
para asegurar que hay disponible para ellos una configuraci&oacute;n adecuada
independientemente al m&oacute;dem al que llamen.
<P>Cuando un usuario se registra recibir&aacute; las preguntas normales sobre su
cuenta y contrase&ntilde;a en las que deber&iacute;a introducir su userid o contrase&ntilde;a
de SLIP-login. Si se verifican, entonces el usuario no ver&aacute; mensajes
especiales y s&oacute;lo tendr&aacute; que cambiar el modo SLIP en su extremo. El
usuario deber&iacute;a ser capaz de conectar y quedar configurado con los
par&aacute;metros relevantes del fichero <CODE>diphosts</CODE>.
<P>
<H3><A NAME="Servidor SLIP usando el paquete dSLIP"></A> Servidor SLIP usando el paquete <CODE>dSLIP</CODE>.</H3>

<P>
<P>Matt Dillon, <CODE>
<A HREF="mailto:dillon@apollo.west.oic.com">dillon@apollo.west.oic.com</A></CODE> ha escrito un paquete que no s&oacute;lo hace
llamadas SLIP entrantes sino tambi&eacute;n llamadas salientes.  El paquete de Matt es
una combinaci&oacute;n de peque&ntilde;os programas y guiones que coordinan las conexiones
por usted. Necesitar&aacute; tener instalado <CODE>tcsh</CODE> ya que al menos uno de los
guiones lo necesita. Matt proporciona una copia ejecutable de la utilidad
<CODE>expect</CODE> ya que la necesita otro de los guiones. Adem&aacute;s necesitar&aacute; tener
algo de experiencia con <CODE>expect</CODE> para hacer que este paquete funcione a
su gusto, pero no deje que eso le desanime.
<P>Matt ha escrito unas instrucciones de instalaci&oacute;n muy buenas en el fichero
<CODE>README</CODE>, por lo que no pienso repetirlas.
<P>Puede obtener el paquete dSLIP de su sitio de origen:
<P><CODE>
<A HREF="ftp://apollo.west.oic.com/pub/linux/dillon_src/dSLIP203.tgz">ftp://apollo.west.oic.com/pub/linux/dillon_src/dSLIP203.tgz</A></CODE>
<P>o desde:
<P><CODE>
<A HREF="ftp://metalab.unc.edu/pub/Linux/system/Network/serial/dSLIP203.tgz">ftp://metalab.unc.edu/pub/Linux/system/Network/serial/dSLIP203.tgz</A></CODE>
<P>L&eacute;ase el fichero <CODE>README</CODE> y cree las entradas en <CODE>/etc/passwd</CODE> y
<CODE>/etc/group</CODE> antes de hacer <CODE>make install</CODE>.
<P>
<HR>
<A HREF="Redes-En-Linux-Como-8.html">Página siguiente</A>
<A HREF="Redes-En-Linux-Como-6.html">Página anterior</A>
<A HREF="Redes-En-Linux-Como.html#toc7">Índice general</A>
</BODY>
</HTML>
