<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Mp3-Como para Linux: Configuraci&oacute;n de su sistema.</TITLE>
 <LINK HREF="MP3-Como-9.html" REL=next>
 <LINK HREF="MP3-Como-7.html" REL=previous>
 <LINK HREF="MP3-Como.html#toc8" REL=contents>
</HEAD>
<BODY>
<A HREF="MP3-Como-9.html">Página siguiente</A>
<A HREF="MP3-Como-7.html">Página anterior</A>
<A HREF="MP3-Como.html#toc8">Índice general</A>
<HR>
<H2><A NAME="s8">8. Configuraci&oacute;n de su sistema.</A></H2>

<P>
<P>Esta secci&oacute;n, describir&aacute; los conceptos b&aacute;sicos para preparar un sistema Linux,
para grabar sonido desde la entrada correspondiente, o desde el lector de
CD-ROM.
<P>Basar&eacute; esta descripci&oacute;n en mi sistema Linux Intel, corriendo RedHat 5.2, pero
el asunto de la distribuci&oacute;n que se use, no hace diferencia.  Trabajar&eacute; en
breve, sobre la versi&oacute;n para plataformas Sparc. (Si tiene &eacute;xito con este COMO,
h&aacute;gamelo saber).
<P>Desde luego que un requisito razonable, a esta altura, es una tarjeta de sonido
funcionando. Insisto nuevamente en la lectura del <I>Sound-HOWTO</I>
(<I>Sonido-COMO</I>, <CODE>
<A HREF="http://www.insflug.org/documentos/Sonido-Como">http://www.insflug.org/documentos/Sonido-Como</A></CODE>) de Jeff Tranter, para
una buena lectura posterior del <I>Sound-Playing-HOWTO</I>, (<CODE>
<A HREF="http://www.insflug.org/documentos/Reproduccion-De-Sonido-Como">http://www.insflug.org/documentos/Reproduccion-De-Sonido-Como</A></CODE> de Yoo.
C. Chung.
<P>Los COMOs que menciono, cubrir&aacute;n el tema de hacer funcionar la tarjeta de
sonido, mucho mejor de lo que podr&iacute;a hacerlo yo aqu&iacute;.
<P>
<H2><A NAME="setupanlg"></A> <A NAME="ss8.1">8.1 Configuraci&oacute;n para la captura anal&oacute;gica de audio.</A>
</H2>

<P>
<P>Primeramente, configure su fuente de sonido. Hay muchas maneras de enviar audio
a su PC Linux, y algunas de las mas comunes son:
<P>De <I>Line Out</I> a <I>Line In</I>. (Salida de L&iacute;nea. a Entrada de L&iacute;nea). La
mayor&iacute;a de los sistemas de audio, posee un conector de salida de l&iacute;nea. El
nivel de los conectores de l&iacute;nea, es un est&aacute;ndar que especifica el voltaje y la
corriente que puede emitir un dispositivo. Si mal no recuerdo, se trata de
500mA para sistemas dom&eacute;sticos y semi-profesionales, y 750mA, para
equipamientos profesionales. Supongo que el est&aacute;ndar en tarjetas de sonido,
ronda los 500mA, pero las tarjetas m&aacute;s nuevas, puede que se adhieran al segundo
est&aacute;ndar. No habr&aacute; mucha diferencia a menos que trabaje con niveles de se&ntilde;al
muy altos.
<P>Los niveles de L&iacute;nea, normalmente se usan para conectar entre s&iacute; equipos
Hi-Fi y amplificadores, as&iacute; que aparatos como Platinas de cinta (<I>Decks</I>),
Sintonizadores de Radio, Reproductores de discos compactos, DAT
y MiniDisc, deber&iacute;an poder conectarse sin problemas. 
<P>Los tocadiscos (giradiscos) o bandejas, debido a que poseen un nivel de salida
distinto (<I>Phono</I>) pueden tener alg&uacute;n tipo de problema. Lea m&aacute;s adelante
para obtener mas informaci&oacute;n.
<P>Tambi&eacute;n podr&iacute;a capturar audio de un VCR. Casi todos los equipos de este
tipo, poseen un conector para la salida de sonido, o bien es posible
obtener una salida de linea del conector SCART, si tuviera uno.
<P><I>Salida de grabaci&oacute;n a Ent. de L&iacute;nea</I>, <I>Salida de Linea a Entrada de
Cinta</I> del amplificador de potencia. Esta configuraci&oacute;n reemplaza la grabadora
de cinta convencional que se conecta al equipo de potencia, por su PC con
Linux. La salida de Linea a la entrada de Cinta, permite monitorear el nivel de
se&ntilde;al.
<P>Micr&oacute;fonos en la entrada de Micr&oacute;fono. Los voltajes generados por los
micr&oacute;fonos, suelen ser mucho menores que los de l&iacute;nea, as&iacute; que si planea
conectar su Micro a la entrada de l&iacute;nea, puede que jam&aacute;s grabe nada en
absoluto.
<P><B>¡¡ATENCI&Oacute;N, hacer las cosas al rev&eacute;s, es decir, conectar se&ntilde;ales con nivel
de L&iacute;nea en la entrada de Mic., puede da&ntilde;ar seriamente su tarjeta de sonido!!</B>
<P>Los tocadiscos o giradiscos (Espa&ntilde;a), bandejas o tornamesas (Latino-Am&eacute;rica)
proporcionan un tipo de se&ntilde;al de salida denominada <I>Phono</I>, y la diferencia
de este tipo de se&ntilde;al no radica s&oacute;lo en en nivel de la misma, sino en su
impedancia y en un tipo especial de ecualizaci&oacute;n posterior necesaria
(<I>RIAA</I>). Si conecta un tocadiscos directamente a una toma de l&iacute;nea, no s&oacute;lo
puede da&ntilde;ar el sistema, sino que la grabaci&oacute;n ser&aacute; p&eacute;sima. Si desea digitalizar
discos de vinilo, tiene 3 opciones:
<P>
<UL>
<LI>Conectar el tocadiscos a la entrada de <I>Phono</I> de su amplificador, y la
salida <I>Rec Out</I> del amplificador a la <I>L&iacute;nea In</I> de su tarjeta de
sonido:

<BLOCKQUOTE><CODE>
<PRE>
  Tocadiscos                Amplificador                       PC
+------------+       +--------------------+          +-----------+
|   Out      |       |  Phono    Rec Out  |          |  Line In  |
|    R (·)------------->(·) R     R (·)----------------->(·) R   |
|            |       |                    |          |           |
|    L (·)------------->(·) L     L (·)----------------->(·) L   | 
|            |       |                    |          |           |
+------------+       +--------------------+          +-----------+  
</PRE>
</CODE></BLOCKQUOTE>


o alternativamente, si tiene entrada/salida Tape/DAT/MiniDisc, y un conmutador
de selecci&oacute;n de fuente de grabaci&oacute;n: conecte la toma <I>Tape Out</I> en lugar de
<I>Rec out</I> a la entrada de l&iacute;nea del PC, y la salida (<I>line out</I> del PC a
la toma Tape In; de este modo podr&aacute; escuchar el PC en el equipo, y direccionar
al PC la fuente que quiera usando el conmutador de fuente de grabaci&oacute;n (<I>rec
out selector</I>).
</LI>
<LI>Si no tiene amplificador con entrada Phono, puede utilizar una peque&ntilde;a
mesa de mezclas, que tenga entrada Phono, y llevar la salida maestra a la
entrada de l&iacute;nea del PC. No obstante, la calidad de la preecualizaci&oacute;n RIAA de
las mismas, as&iacute; como su relaci&oacute;n se&ntilde;al ruido suele dejar bastante que desear.
</LI>
<LI>Existen preamplificadores con ecualizaci&oacute;n RIAA, que proporcionan se&ntilde;al
de linea a partir de una de Phono.
</LI>
</UL>
<P>As&iacute; mismo cuanto mejor sea la calidad de la c&aacute;psula/aguja (<I>stylus</I>) que
ponga en su tocadiscos, mejor sonido obtendr&aacute;. Stanton es una marca aceptable
bastante popular y no muy cara.
<P>Para utilizar &Oacute;rganos y sintetizadores, se conectan a la entrada de l&iacute;nea
<I>(Line In)</I>. Las guitarras van por L&iacute;nea, pasando por una Caja de Inyecci&oacute;n,
usada para elevar la se&ntilde;al a nivel de Linea).
<P>Antes de conectar nada a su tarjeta de sonido, cerci&oacute;rese de que los
niveles de volumen de todo, est&eacute;n al m&iacute;nimo, y si se tratase de micr&oacute;fonos,
que est&eacute;n apagados, o bien, lejos de los parlantes/altavoces.
<P>
<H2><A NAME="setupcd"></A> <A NAME="ss8.2">8.2 Configuraci&oacute;n del CD-ROM para la captura de audio.</A>
</H2>

<P>
<P>Preparar el sistema para extraer el audio de sus CDs, es en realidad un
procedimiento bastante f&aacute;cil.
<P>Si puede o&iacute;r los CDs que reproduce, a trav&eacute;s de los parlantes/altavoces y/o el
amplificador que conecta a su tarjeta de sonido, es muy posible que pueda
tambi&eacute;n grabar de ellos.
<P>
<H2><A NAME="setupxtra"></A> <A NAME="ss8.3">8.3 Configuraciones adicionales.</A>
</H2>

<P>
<P>Debe entrar en su sistema como lo hace siempre, y usando un programa de mezcla,
ajustar los niveles adecuados de sonido para que la grabaci&oacute;n suene bastante
fuerte, pero sin saturar. Yo utilizo mi o&iacute;do. Con el tiempo, sabr&aacute; cu&aacute;les son
los niveles &oacute;ptimos para su equipo en particular.
<P>Insisto en que debe usted deshabilitar cualquier servicio innecesario, o
incluso iniciar el sistema en modo monousuario, en especial cuando codifique a
MP3 desde una fuente de audio. Esto es para asegurar que los servicios activos
ser&aacute;n los menos, y tambi&eacute;n los retrasos del sistema, a la hora de grabar.
<P>Yo consegu&iacute; un disco SCSI separado, exclusivamente para hacer mis grabaciones
en &eacute;l; lo referir&eacute; como <CODE>/mnt/mp3</CODE>. Hice esto, fundamentalmente por el
rendimiento que se gana, al usar dispositivos SCSI. Por otro lado, grabando en
un disco dedicado, se asegura que las cabezas no saltar&aacute;n de repente a otro
punto del disco mientras grabe.
<P>Si precisa informaci&oacute;n respecto a c&oacute;mo conectar m&uacute;ltiples discos en un sistema
Linux, s&iacute;rvase leer el <I>Multi-Disk-HOWTO</I>, de Stein GJoen. Puede ayudarle.
<P>
<HR>
<A HREF="MP3-Como-9.html">Página siguiente</A>
<A HREF="MP3-Como-7.html">Página anterior</A>
<A HREF="MP3-Como.html#toc8">Índice general</A>
</BODY>
</HTML>
