<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Mp3-Como para Linux: Requisitos de hardware en cuanto a rendimiento.</TITLE>
 <LINK HREF="MP3-Como-7.html" REL=next>
 <LINK HREF="MP3-Como-5.html" REL=previous>
 <LINK HREF="MP3-Como.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="MP3-Como-7.html">Página siguiente</A>
<A HREF="MP3-Como-5.html">Página anterior</A>
<A HREF="MP3-Como.html#toc6">Índice general</A>
<HR>
<H2><A NAME="hardware"></A> <A NAME="s6">6. Requisitos de hardware en cuanto a rendimiento.</A></H2>

<P>
<P>El procesamiento digital de Audio, es una tarea que absorbe mucho de
los recursos del sistema, y de sus capacidades de E/S. Recomiendo como
m&iacute;nimo, una m&aacute;quina con procesador de tipo Pentium.
<P>Si est&aacute; usted por codificar audio desde una fuente anal&oacute;gica, una
tarjeta de sonido PCI, le dar&aacute; los mejores resultados. La diferencia
en el rendimiento de E/S entre placas ISA y PCI, es muy significativa,
mas de 132 Mbits/seg en el caso de tarjetas PCI (valor tomado del
<I>PCI-HOWTO</I>). Naturalmente, mientras mejor sea la calidad de la placa
sonido en cuanto a su relaci&oacute;n se&ntilde;al-ruido, mejor ser&aacute; la calidad de
los archivos MP3 que se obtenga. He estado usando una SoundBlaster
PCI128, y la cambi&eacute; por una SoundBlaster Live Value; ambas tienen
excelente desempe&ntilde;o, pero la Live tiene una relaci&oacute;n S/R bastante
superior, suficiente para un trabajo semi-profesional. Recuerde la
vieja m&aacute;xima del procesamiento de datos: «¡Si entra basura, sale
basura!».
<P>Cuando grabe se&ntilde;ales anal&oacute;gicas de audio a su disco duro,
procedimiento conocido como d2d o <I>Direct-To-Disk</I> (Directamente al
disco), el rendimiento de su disco e interface ser&aacute;n cr&iacute;ticos. Si
utiliza un sistema basado en tecnolog&iacute;a IDE, modo 4 o Ultra-DMA,
procure que sean tan veloces como pueda en su tasa de transferencia.
<P>La soluci&oacute;n ideal ser&iacute;a emplear un sistema basado en SCSI, puesto que
sus interfaces y discos obtienen de lejos, mejores rendimientos,
cercanos en trabajo constante a valores de entre 5mbits/sec para
SCSI I hasta 80mbits/sec para SCSI Ultra2 Wide. Los discos IDE podr&aacute;n
alcanzar velocidades de 8.3 MB/s a 33 MB/s para Ultra-ATA, pero
recuerde que esos son s&oacute;lo valores de pico. Los valores promedio son
bastante menores. Si puede hacerse con un disco SCSI AV, h&aacute;galo. Los
discos AV tienen el sistema de cabezas de lecto-escritura optimizado
para la trasferencia constante de datos. Los otros discos, tanto IDE
como SCSI, no pueden soportar la transferencia constante de datos,
debido al calentamiento.
<P>Claro que un disco que posee cach&eacute;, dar&aacute; mejores resultados que otro
que no lo tenga, actuando como b&uacute;fer para los casos en que el
desempe&ntilde;o de las cabezas se vea excedido por las necesidades de
transferencia.
<P>Si su disco no cumple con las especificaciones de arriba, su grabaci&oacute;n
estar&aacute; plagada de ruidos y saltos, en las partes en que el disco no
haya podido escribir la se&ntilde;al digitalizada. Si piensa dedicarse a
grabar sucesos irrepetibles, como recitales en vivo, ser&aacute; mejor que
invierta en tecnolog&iacute;a SCSI.
<P>Otra causa de fallos en la escritura directa al disco, es un sistema
sobrecargado. Las tareas corriendo en segundo plano pueden frenar
moment&aacute;neamente al sistema. Se recomienda correr tan pocas tareas en
segundo plano como se pueda, en particular servicios basados en redes.
Para m&aacute;s informaci&oacute;n acerca de la configuraci&oacute;n de los servicios de
red, as&iacute; como scripts de inicio, refi&eacute;rase a las gu&iacute;as del
<I>Administrador de Redes</I> y <I>Administrador del Sistema</I>.
<P>El trabajo de la memoria de intercambio puede enlentecer tambi&eacute;n el
sistema, as&iacute; que lo mejor ser&aacute; que instale tanta memoria RAM como pueda; 
le recomiendo 32Mb como m&iacute;nimo, pero de seguro le vendr&iacute;a bien un poco m&aacute;s.
<P>Para los que quieren obtener lo m&aacute;ximo de sus sistemas, optimizar el
kernel probablemente no sea una mala idea.
<P>Si bien las especificaciones de hardware de m&aacute;s arriba, le dejar&aacute;n
ante un equipo m&iacute;nimamente decente para sus trabajos de codificar
informaci&oacute;n de audio, no dude experimentar con equipos m&aacute;s viejos/m&aacute;s
peque&ntilde;os, si no tiene nada mejor a mano.
<P>Es un buen desaf&iacute;o para un <I>sysadmin</I>, lograr resultados satisfactorios
de un equipo m&aacute;s peque&ntilde;o.
<P>Otro factor importante es el cableado de audio. Los cables y
conectores baratos, de baja calidad, producir&aacute;n como resultado,
grabaciones de calidad pobre. Si su tarjeta admite el uso de
conectores RCA, prefi&eacute;ralos. Usar conectores dorados, y mantener los
cables de audio apartados de los de alimentaci&oacute;n o datos, ayudar&aacute; a evitar
interferencias y elevar la calidad (si no tiene m&aacute;s remedio, cr&uacute;celos a 90
grados).
<P>Pero tenga en cuenta que la fortuna que gaste en el mejor de los
cableados, se perder&aacute; si el resto del equipo no ha sido optimizado.
<P>Para extraer la informaci&oacute;n de audio desde la unidad de CD-ROM, la
velocidad ser&aacute; factor determinante del tiempo que tome la lectura de los datos
desde los discos. Una lectora de simple velocidad, ser&aacute; demasiado lenta, a
menos que se arme Vd. de mucha paciencia.
<P>Si su CD no tiene capacidad de extracci&oacute;n de audio por el bus de datos, no
est&aacute; todo perdido; la unidad de CD-ROM se puede conectar a la tarjeta de
sonido, bien sea utilizando el conector interno, o uniendo la salida de
auriculares de la lectora, con la entrada de l&iacute;nea de la placa de audio. Regule
el volumen de los auriculares hasta que no note distorsi&oacute;n. 
<P>Aunque ni los niveles de salida ni la impedancia de la toma de auriculares son
iguales a los de l&iacute;nea, estos se compensan, y se pueden obtener resultados
aceptables, y esto aplica  para cualquier otro dispositivo con salida de
auriculares, como por ejemplo, walkmans, sintonizadores de radio port&aacute;tiles.
minidiscs port&aacute;tiles, etc. De todos modos, s&oacute;lo debe ser utilizado como &uacute;ltimo
recurso, cuando no haya otro medio.
<P>Para obtener informaci&oacute;n detallada acerca de c&oacute;mo configurar su placa de
sonido, ser&iacute;a muy aconsejable la lectura del <I>Sound-HOWTO</I> (Su traducci&oacute;n,
<I>Sonido-COMO</I> est&aacute; disponible en <CODE>
<A HREF="http://www.insflug.org/documentos/Sonido-Como">http://www.insflug.org/documentos/Sonido-Como</A></CODE>).
<P>
<HR>
<A HREF="MP3-Como-7.html">Página siguiente</A>
<A HREF="MP3-Como-5.html">Página anterior</A>
<A HREF="MP3-Como.html#toc6">Índice general</A>
</BODY>
</HTML>
