<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.7.4">
 <TITLE>COMO de Compatibilidad de Hardware con Linux: Glosario</TITLE>
 <LINK HREF="Compatibilidad-Hardware-Como-30.html" REL=previous>
 <LINK HREF="Compatibilidad-Hardware-Como.html#toc31" REL=contents>
</HEAD>
<BODY>
Página siguiente
<A HREF="Compatibilidad-Hardware-Como-30.html">Página anterior</A>
<A HREF="Compatibilidad-Hardware-Como.html#toc31">Índice general</A>
<HR>
<H2><A NAME="s31">31.</A> <A HREF="Compatibilidad-Hardware-Como.html#toc31">Glosario</A></H2>

<P>
<DL>
<DT><B>AGP</B><DD><P>Accelerated Graphics Port (Puerto de Gr&aacute;ficos Acelerado). Un mecanismo para interconexi&oacute;n de buses dise&ntilde;ado para mejorar el rendimiento de las aplicaciones con gr&aacute;ficos 3D. AGP es un bus dedicado que va desde el subsistema gr&aacute;fico al chipset de l&oacute;gica fundamental. <CODE>
<A HREF="http://www.euro.dell.com/intl/euro/r+d/r+dnews/vectors/vect_2-1/v2-1_agp.htm">http://www.euro.dell.com/intl/euro/r+d/r+dnews/vectors/vect_2-1/v2-1_agp.htm</A></CODE></P>
<DT><B>ATAPI</B><DD><P>AT Attachment Packet Interface. Un nuevo protocolo para controlo dispositivos de almacentamiento masivo de datos similar al protocolo SCSI. Se construye sobre la interfaz ATA (AT Attachment), el nombre oficial que da el Est&aacute;ndar ANSI a las interfaces IDE desarrolladas para los discos duros. ATAPI es normalmente usado para discos duros, lectores CD-ROM, dispositivos de cinta y otros.  </P>
<DT><B>ATM</B><DD><P>Asynchronous Transfer Mode (Modo de Transferencia As&iacute;ncrona)</P>
<DT><B>CDDA</B><DD><P>Compact Disk Digital Audio (Audio Digital de Discos Compactos). La capacidad de CD-ROM/Grabadora para leer las pistas de audio.</P>
<DT><B>DMA</B><DD><P>Direct Memory Access (Acceso Directo a Memoria)</P>
<DT><B>EGA</B><DD><P>Enhanced Graphics Adapter (Adaptador Gr&aacute;fico Mejorado)</P>
<DT><B>EIDE</B><DD><P>Enhanced IDE (IDE Mejorado)</P>
<DT><B>EISA</B><DD><P>Extended Industry System Architecture (Arquitectura de Sistema Industrial Mejorado)</P>
<DT><B>FDDI</B><DD><P>Fiber Distributed Data Interface (Interface de Datos Distribuidos por Fibra). Red de &aacute;rea local en anillo de alta velocidad.</P>
<DT><B>IDE</B><DD><P>Integrated Drive Electronics (Dispositivo Electr&oacute;nico Integrado). Cada dispositivo tiene su controldor integrado.</P>
<DT><B>ISA</B><DD><P>Industry System Architecture (Arquitectura de Sistema Industrial)</P>
<DT><B>ISDN</B><DD><P>Integrated Services Digital Network (RDSI - Red Digital de Servicios Integrados)</P>
<DT><B>MCA</B><DD><P>MicroChannel Architecture (Arquitectura MicroCanal)</P>
<DT><B>MFM</B><DD><P>Modified Frequency Modulation (Modulaci&oacute;n de Frecuencias Modificada)</P>
<DT><B>MMX</B><DD><P>Multimedia Extensions (Extensi&oacute;n Multimedia). A&ntilde;adido a las nuevas generaciones del Procesador Intel Pentium. Ofrece nuevas instrucciones para el proceso del audio y del video</P>
<DT><B>PCI</B><DD><P>Pheripheral Component Interconnect (Interconexi&oacute;n de Componentes Perif&eacute;ricos). Un bus de 32-bit dise&ntilde;ado por Intel. La informaci&oacute;n puede ser encontrada en <CODE>
<A HREF="http://www.pcisig.com">http://www.pcisig.com</A></CODE> and <CODE>
<A HREF="http://infoserver.ee.siue.edu/~jbutter/EE580_1.html">http://infoserver.ee.siue.edu/~jbutter/EE580_1.html</A></CODE>.</P>
<DT><B>RAID</B><DD><P>Redudant Arrays of Inexpensive Disks (Formaci&oacute;n Redundante de Discos Baratos). La idea b&aacute;sica del RAID es la combinaci&oacute;n de muchos discos peque&ntilde;os y baratos que funcionando conjuntamente consiguen un rendimiento que por s&iacute; solo no se conseguir&iacute;a con un &uacute;nico disco grande y caro. Hay cinco tipos de Arquitecturas en formaci&oacute;n redundante; desde RAID-1 hasta RAID-5. Una formaci&oacute;n de discos no redundante es conocida como RAID-0. Algunas sistemas RAID pueden tener formatos mixtos.<BR>
<CODE>
<A HREF="http://www.uni-mainz.de/~neuffer/scsi/what_is_raid.html">http://www.uni-mainz.de/~neuffer/scsi/what_is_raid.html</A></CODE></P>
<DT><B>PPA</B><DD><P>Printing Performance Architecture (Arquitectura Mejorada de Impresi&oacute;n). Protocolo desarrollado por Hewlett Packard para sus series de impresoras Deskjet. En esencia, el protocolo mueve un bajo nivel del proceso de los datos de la impresora al ordenador. Esto permite a impresoras de bajo coste con poca memoria y poco procesador, junto a un driver flexible, realizar trabajos que normalmente no podr&iacute;an. Sin embargo, el precio de todo esto es la compatibilidad. La decisi&oacute;n de HP fue la de desarrollar s&oacute;lo drivers para Windows 95 en estas impresoras.</P>
<DT><B>RLL</B><DD><P>Run Length Limited (Longitud de Ejecuci&oacute;n Limitada)</P>
<DT><B>SCSI</B><DD><P>Small Computer Systems Interface (Interface para Sistemas de Ordenadores Peque&ntilde;os). Una interfaz est&aacute;ndar definida para todos los dispositivos de un ordenador. Posibilita el uso de un simple adaptador para todos los dispositivos.<BR>
<CODE>
<A HREF="http://www.uni-mainz.de/~neuffer/scsi/what_is_scsi.html">http://www.uni-mainz.de/~neuffer/scsi/what_is_scsi.html</A></CODE></P>
<DT><B>SVGA</B><DD><P>Super Video Graphics Adapter (Adaptador Gr&aacute;fico de Super Video)</P>
<DT><B>UART</B><DD><P>Universal Asynchronous Receiver Transmitter (Transmisor Receptor As&iacute;ncrono Universal)</P>
<DT><B>USB</B><DD><P>Universal Serial Bus (Bus de Serie Universal)</P>
<DT><B>VGA</B><DD><P>Video Graphics Adapter (Adaptador Gr&aacute;fico de Video)</P>
<DT><B>VLB</B><DD><P>VESA Local Bus (Bus Local VESA). Usado en algunos PCs con 486.</P>
<DT><B>WORM</B><DD><P>Write Once Read Many (Escribe Una vez, Lee Muchas)</P>
</DL>
</P>

<HR>
Página siguiente
<A HREF="Compatibilidad-Hardware-Como-30.html">Página anterior</A>
<A HREF="Compatibilidad-Hardware-Como.html#toc31">Índice general</A>
</BODY>
</HTML>
