<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.7.4">
 <TITLE>COMO de Compatibilidad de Hardware con Linux: Ordenadores/Placas madre/BIOS</TITLE>
 <LINK HREF="Compatibilidad-Hardware-Como-3.html" REL=next>
 <LINK HREF="Compatibilidad-Hardware-Como-1.html" REL=previous>
 <LINK HREF="Compatibilidad-Hardware-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Compatibilidad-Hardware-Como-3.html">Página siguiente</A>
<A HREF="Compatibilidad-Hardware-Como-1.html">Página anterior</A>
<A HREF="Compatibilidad-Hardware-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2.</A> <A HREF="Compatibilidad-Hardware-Como.html#toc2">Ordenadores/Placas madre/BIOS</A></H2>

<P>Los buses ISA, VLB, EISA y PCI est&aacute;n todos soportados.</P>


<H2><A NAME="ss2.1">2.1 Sistemas espec&iacute;ficos/placa madre/BIOS</A>
</H2>

<P>
<UL>
<LI>Sistemas MCA de IBM PS/2<BR>
Soportados desde la versi&oacute;n de n&uacute;cleo 2.0.7, pero s&oacute;lo para las versiones estables del n&uacute;cleo. Para m&aacute;s informaci&oacute;n puede  mirar en la p&aacute;gina web Micro Channel Linux Home Page (<CODE>
<A HREF="http://www.dgmicro.com/default.htm">http://www.dgmicro.com/default.htm</A></CODE>). El software para los sistemas MCA puede ser encontrado en <CODE>
<A HREF="ftp://ftp.dgmicro.com/pub/linuxmca">ftp://ftp.dgmicro.com/pub/linuxmca</A></CODE>. Informaci&oacute;n sobre los subsistemas SCSI MCA puede ser encontrada en <CODE>
<A HREF="http://www.uni-mainz.de/~langm000/linux.html">http://www.uni-mainz.de/~langm000/linux.html</A></CODE>.</LI>
<LI>La placa madre EFA E5TX-AT tiene un problema solventable con RedHat Linux 5.0 y posiblemente con otras versiones de Linux. Espont&aacute;meamente reinica mientras est&aacute; verificando el hardware. Para resolverlo, actualiza la BIOS a la versi&oacute;n 1.01. Obtenga la actualizaci&oacute;n de la BIOS en <CODE>
<A HREF="http://www.efacorp.com/download/bios/e5tx103.exe">http://www.efacorp.com/download/bios/e5tx103.exe</A></CODE>.</LI>
<LI>Las placas madre Edom MP080 necesita ser flasheada para que Linux funcione. Sin esto Linux reiniciar&aacute; durante la b&uacute;squeda de hardware. Para el flash de la BIOS chequee <CODE>
<A HREF="http://www.edom.com/tech/tech.htm">http://www.edom.com/tech/tech.htm</A></CODE> y <CODE>
<A HREF="http://www.edom.com/download">http://www.edom.com/download</A></CODE></LI>
<LI>La placa madre Zida 6MLX con chips PII Intel LX se sabe que s&oacute;lo funciona con Linux cuando el cach&eacute; del PII est&aacute; deshabilitado en la BIOS. Actualizar la BIOS no resuelve el problema. El s&iacute;ntoma consiste en que se reinicia aleatoriamente durante o al poco tiempo de que el sistema arranca.</LI>
</UL>
</P>
<P>Muchas tarjetas nuevas PCI est&aacute;n causando un mont&oacute;n de mensajes de fallos durante el arranque en "Probing PCI Hardware". El procedimiento presente el siguiente mensaje</P>
<P>
<PRE>
    Warning : Unknown PCI device (8086:7100).  Please read include/linux/pci.h
    Aviso: Desconocido dispositivo PCI (8086:7100).  Por favor lea include/linux/pci.h
</PRE>
</P>
<P>Le est&aacute; diciendo que lea el fichero pci.h. De este fichero es el siguiente extracto:</P>
<P>
<PRE>
         PROCEDURE TO REPORT NEW PCI DEVICES
    We are trying to collect information on new PCI devices, using
    the standard PCI identification procedure. If some warning is
    displayed at boot time, please report 
         - /proc/pci
         - your exact hardware description. Try to find out
           which device is unknown. It may be you mainboard chipset.
           PCI-CPU bridge or PCI-ISA bridge.
         - If you can't find the actual information in your hardware
           booklet, try to read the references of the chip on the board.
         - Send all that to linux-pcisupport@cao-vlsi.ibp.fr,
           and I'll add your device to the list as soon as possible

    BEFORE you send a mail, please check the latest linux releases
    to be sure it has not been recently added.

           Thanks
                 Frederic Potter.


         PROCEDIMIENTO PARA INFORMAR DE NUEVOS DISPOSITIVO PCI
    Estamos intentado coger informaci&oacute;n de los nuevos dispositivos PCI, usando
    el procedimiento de identificaci&oacute;n PCI est&aacute;ndar. Si le aparece alg&uacute;n aviso
    en el arranque, por favor, m&aacute;ndenos su
         - /proc/pci
         - Su descripci&oacute;n exacta del hardware. Intente identificar
           cual es el dispositivo desconocido. Podr&iacute;a estar en el chipset de su
           placa madre. El puente PCI-CPU o el puente PCI-ISA.
         - Si no puede encontrar esta informaci&oacute;n en su libro de hardware, 
           intente leer las referencias del chip sobre la placa.
         - Env&iacute;e todo eso a linux-pcisupport@cao-vlsi.ibp.fr,
           y a&ntilde;adiremos su dispositivo a la lista lo m&aacute;s pronto posible

    ANTES de que nos envie el correo, por favor chequee la &uacute;ltima versi&oacute;n de linux
    para asegurarse que no se haya a&ntilde;adido recientemente.

           Gracias
                 Frederic Potter.
</PRE>
</P>
<P>Normalmente su placa madre y el dispositivo PCI desconocido funcionar&aacute;n corr&eacute;ctamente.</P>

<H2><A NAME="ss2.2">2.2 No soportado</A>
</H2>

<P>
<UL>
<LI>Supermicro P5MMA con versiones de BIOS 1.36, 1.37 y 1.4. Linux no arrancar&aacute; en esta placa madre. Hay una nueva versi&oacute;n (beta) de la BIOS que hace que Linux arranque, est&aacute; disponible en <CODE>
<A HREF="ftp://ftp.supermicro.com/mma9051.zip">ftp.supermicro.com/mma9051.zip</A></CODE></LI>
<LI>Supermicro P5MMA98. Linux no arrancar&aacute; en esta placa base. Existe una nueva versi&oacute;n (beta) de la BIOS que hace que Linux arranque, est&aacute; disponible en <CODE>
<A HREF="ftp://ftp.supermicro.com/a98905.zip">ftp.supermicro.com/a98905.zip</A></CODE>?</LI>
<LI>Placa madre DataExpert Corp. ExpertColor TX531 V1.0 con chipset ACER M1531 (Fecha: 9729, TS6) y ACER M1543 (Fecha: 9732 TS6) parece que presenta fallos de violaci&oacute;n de segmento no reproducibles, kernel oops y cuelgues de kernel bajo carga pesada y acceso a cinta. Parece un problema con el bus PCI, relacionado con el chipset de ACER.</LI>
</UL>
</P>

<HR>
<A HREF="Compatibilidad-Hardware-Como-3.html">Página siguiente</A>
<A HREF="Compatibilidad-Hardware-Como-1.html">Página anterior</A>
<A HREF="Compatibilidad-Hardware-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
