<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.7.4">
 <TITLE>COMO de Compatibilidad de Hardware con Linux: Introducci&oacute;n</TITLE>
 <LINK HREF="Compatibilidad-Hardware-Como-2.html" REL=next>

 <LINK HREF="Compatibilidad-Hardware-Como.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Compatibilidad-Hardware-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Compatibilidad-Hardware-Como.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1.</A> <A HREF="Compatibilidad-Hardware-Como.html#toc1">Introducci&oacute;n</A></H2>


<P><B>NOTE</B>: USB todav&iacute;a no est&aacute; soportado por Linux (N.T. esto es obsoleto)</P>

<H2><A NAME="ss1.1">1.1 Bienvenido</A>
</H2>

<P>Bienvenido al COMO de Compatibilidad de Hardware con Linux. Este documento lista la mayor&iacute;a de los componentes de hardware (no marcas de ordenadores) soportados por Linux, as&iacute; que leyendo este documento usted puede elegir los componentes para su ordenador con Linux. Como la lista de componentes soportados por Linux est&aacute; creciendo r&aacute;pidamente, este documento nunca ser&aacute; completado. As&iacute; que, cuando cuando un componente no sea mencionado en este COMO, la &uacute;nica raz&oacute;n para ello es que no s&eacute; si est&aacute; soportado. Simplemente no he encontrado soporte para el componente y/o nadie me lo ha mencionado.</P>
<P>Las subsecciones tituladas 'Controladores Alfa, Beta' listan hardware con controladores en alpha o en beta con grados de "usabilidad" variables. Tenga en cuenta que algunos controladores s&oacute;lo existen en n&uacute;cleos alpha, as&iacute; que si usted ve algo listado como soportado pero no es en su versi&oacute;n de n&uacute;cleo de Linux, actual&iacute;zelo.</P>
<P>Algunos dispositivos tienen soporte v&iacute;a m&oacute;dulos del tipo solo-binarios; ev&iacute;telos cuando pueda. Los m&oacute;dulos del tipo solo-binarios son m&oacute;dulos que est&aacute;n compilados para UNA versi&oacute;n de n&uacute;cleo. El c&oacute;digo fuente de estos m&oacute;dulos NO EST&Aacute; disponible. Esto podr&iacute;a dificultar la actualizaci&oacute;n o el mantenimiento de su sistema.<BR>
Linus Torvalds dijo "Permitir&eacute; modulos del tipo solo-binarios, pero quiero que la gente sepa que _solo_ deben esperar que funcionen con la versi&oacute;n del kernel con la que fueron compilados"<BR>
Ver <CODE>
<A HREF="http://www.kt.opensrc.org/kt19990211_5.html#10">http://www.kt.opensrc.org/kt19990211_5.html#10</A></CODE> para m&aacute;s informaci&oacute;n del c&oacute;digo fuente disponible para componentes. </P>
<P>La &uacute;ltima versi&oacute;n de este documento puede ser encontrada en <CODE>
<A HREF="http://users.bart.nl/~patrickr/hardware-howto/Hardware-HOWTO.html">http://users.bart.nl/~patrickr/hardware-howto/Hardware-HOWTO.html</A></CODE>, SunSite y en todos los mirrors habituales. Traducciones de &eacute;ste y otros COMOs de Linux pueden ser encontradas en <CODE>
<A HREF="http://metalab.unc.edu/pub/Linux/docs/HOWTO/translations">http://metalab.unc.edu/pub/Linux/docs/HOWTO/translations</A></CODE> y en <CODE>
<A HREF="ftp://metalab.unc.edu/pub/Linux/docs/HOWTO/translations">ftp://metalab.unc.edu/pub/Linux/docs/HOWTO/translations</A></CODE>.</P>
<P>Si sabe de alguna (in)compatibilidad de hardware en Linux no listada aqu&iacute;, por favor, h&aacute;gamelo saber envi&aacute;ndome un correo. </P>
<P>¿Todav&iacute;a sigue necesitando ayuda para elegir componentes despu&eacute;s de leer este documento? Compruebe "Build Your Own PC" en <CODE>
<A HREF="http://www.verinet.com/pc/">http://www.verinet.com/pc/</A></CODE>.</P>
<P>¿Quiere tener un sistema Linux preconfigurado? Heche un vistazo a <CODE>
<A HREF="http://www.linuxresources.com/web/">http://www.linuxresources.com/web/</A></CODE>.</P>

<H2><A NAME="ss1.2">1.2 Copyright</A>
</H2>

<P>Copyright 1997, 1998, 1999 Patrick Reijnen</P>
<P>Este COMO es documentaci&oacute;n libre; usted podr&aacute; redistribuirla y/o modificarla bajo los t&eacute;rminos de la GNU General Public License tal como es publicada por la Free software Foundation; a partir de la versi&oacute;n 2 de la licencia, o (a su opci&oacute;n) versi&oacute;n posterior.</P>
<P>Este documento es distribuido con la esperanza de que sea &uacute;til, pero sin ning&uacute;n tipo de garant&iacute;a; sin incluso las garant&iacute;as implicadas derivadas de la comercializaci&oacute;n o lucro para un prop&oacute;sito particular. Ver la GNU General Public License para m&aacute;s detalles.
Puede obtener una copia de la GNU General Public License escribiendo a la Free Software Foundation,, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.</P>
<P>Si usa este o cualquier otro COMO de Linux en una distribuci&oacute;n comercial, ser&iacute;a un detalle enviar a los autores una copia complementaria de su producto.</P>

<H2><A NAME="ss1.3">1.3 Arquitecturas de sistemas</A>
</H2>

<P>Este documente s&oacute;lo trata de Linux con plataformas Intel, para otras plataformas chequee las siguientes direcciones:
<UL>
<LI>ARM Linux<BR>
<CODE>
<A HREF="http://www.arm.uk.linux.org/">http://www.arm.uk.linux.org/</A></CODE></LI>
<LI>Linux/68k<BR>
<CODE>
<A HREF="http://www.clark.net/pub/lawrencc/linux/index.html">http://www.clark.net/pub/lawrencc/linux/index.html</A></CODE></LI>
<LI>Linux/8086 (The Embeddable Linux Kernel Subset)<BR>
<CODE>
<A HREF="http://www.linux.org.uk/ELKS-Home/index.html">http://www.linux.org.uk/ELKS-Home/index.html</A></CODE></LI>
<LI>Linux/Alpha<BR>
<CODE>
<A HREF="http://www.azstarnet.com/~axplinux/">http://www.azstarnet.com/~axplinux/</A></CODE></LI>
<LI>Linux/MIPS<BR>
<CODE>
<A HREF="http://www.linux.sgi.com">http://www.linux.sgi.com</A></CODE></LI>
<LI>Linux/PowerPC<BR>
<CODE>
<A HREF="http://www.linuxppc.org/">http://www.linuxppc.org/</A></CODE></LI>
<LI>Linux para Acorn<BR>
<CODE>
<A HREF="http://www.ph.kcl.ac.uk/~amb/linux.html">http://www.ph.kcl.ac.uk/~amb/linux.html</A></CODE></LI>
<LI>Linux para PowerMac<BR>
<CODE>
<A HREF="http://ftp.sunet.se/pub/os/Linux/mklinux/mkarchive/info/index.html">http://ftp.sunet.se/pub/os/Linux/mklinux/mkarchive/info/index.html</A></CODE></LI>
</UL>
</P>

<HR>
<A HREF="Compatibilidad-Hardware-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Compatibilidad-Hardware-Como.html#toc1">Índice general</A>
</BODY>
</HTML>
