<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Ap&eacute;ndices.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-13.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-11.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc12" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-13.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-11.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc12">Índice general</A>
<HR>
<H2><A NAME="s12">12. Ap&eacute;ndices.</A></H2>

<P>
<P>
<H2><A NAME="ss12.1">12.1 Referencias bibliogr&aacute;ficas.</A>
</H2>

<P>
<DL>
<DT><B>Joint Ventures, Alianzas, Transferencias tecnol&oacute;gicas, Know How.</B><DD><P>
<PRE>
        Eduardo Paz.
        "C&oacute;mo hacer negocios en Internet".
        Ed. Gesti&oacute;n 2000.
        ISBN 84-8088-283-2.
</PRE>

Muestra las t&eacute;cnicas de cooperaci&oacute;n que utilizan las
empresas que tienen Internet como medio de trabajo.
<P>
<DT><B>T&eacute;cnicas de gesti&oacute;n de empresas orientadas al comercio en Internet.</B><DD><P>
<PRE>
        Vince Emery.
        "Negocios en Internet, expansi&oacute;n y crecimiento".
        Anaya Multimedia. Colecci&oacute;n V&iacute;a Internet.
        ISBN 84-415-0408-3.
</PRE>

<PRE>
        Enrique de la Rica.
        "Marketing en Internet".
        Anaya multimedia.
        ISBN 84-415-0186-6.
</PRE>

Existen multitud de libros de los que &eacute;stos dos son una muestra: 
Analizan la actitud de la empresa ante la red. Describen 
metodolog&iacute;as "Internet-Oriented", as&iacute; como detallan el proceso 
por el que una empresa se debe abrir a Internet, y c&oacute;mo adaptar 
su modelo de trabajo al nuevo entorno.
<P>
<DT><B>Pol&iacute;tica europea sobre la red. Aspectos legales del Software.</B><DD><P>
<PRE>
        Juan Viesca.
        "La uni&oacute;n Europea en Internet".
        Anaya Multimedia.
        ISBN 84-415-0586-1.
</PRE>

Aunque no trata espec&iacute;ficamente sobre los modelos de cooperaci&oacute;n,
analiza la problem&aacute;tica del comercio en Europa, la dependencia
tecnol&oacute;gica, la pol&iacute;tica de ayudas a la empresa. Contiene adem&aacute;s
un directorio de recursos para la empresa europea en la Red.
<PRE>
        Carlos Barriuso Ru&iacute;z.
        "Interacci&oacute;n del derecho y la Inform&aacute;tica".
        Ed. Dykinson.
        ISBN 84-8155-148-1.
</PRE>

Un recorrido completo desde la introducci&oacute;n a la inform&aacute;tica para
expertos en derecho, tratamiento inform&aacute;tico de informaci&oacute;n jur&iacute;dica
y descripci&oacute;n de la legislaci&oacute;n aplicable a la inform&aacute;tica, indicando
leyes y directivas europeas.
<P>
<DT><B>Modelos empresariales de gesti&oacute;n.</B><DD><P>
<PRE>
        Jose Mar&iacute;a Oirtiz Ibarz.
        "La hora de la &eacute;tica empresarial".
        Mc Graw Hill.
        ISBN 84-481-0320-3.
</PRE>

Analiza la problem&aacute;tica de las t&eacute;cnicas empresariales actuales,
los problemas del uso y abuso de situaciones de monopolio. Plantea
estrategias de cooperaci&oacute;n como modelo alternativo.
<PRE>
        Demetrio S&aacute;ez y Jos&eacute; Cabanelas.
        "Cooperar para competir con &eacute;xito".
        Ed. Pir&aacute;mide.
        ISBN 84-368-1090.
</PRE>

Describe los riesgos y beneficios de la cooperaci&oacute;n empresarial,
modelos de trabajo entre empresas, y t&eacute;cnicas para conjuntar
intereses comunes, y allanar diferencias, manteniendo la identidad
empresarial.
<PRE>
        Franc&eacute;s Cairncross.
        "La muerte de la distancia".
        Paid&oacute;s empresa.
        ISBN 84-493-0626-4.
</PRE>

Plantea los problemas de la globalizaci&oacute;n, de la sociedad de la
informaci&oacute;n, y de las t&aacute;cticas empresariales en la Aldea Global.
<P>
<DT><B>Bases sociol&oacute;gicas y filos&oacute;ficas.</B><DD><P>
<PRE>
        Loirdes Munduate Jaca.
        "Psicolog&iacute;a social de la organizaci&oacute;n".
        Ed. Pir&aacute;mide.
        ISBN 84-368-1055-4.
</PRE>

Plantea las bases sociol&oacute;gicas de la organizaci&oacute;n empresarial, la
figura del l&iacute;der, y los modelos de relaci&oacute;n entre los componentes
de la cadena de producci&oacute;n.
<PRE>
        Fernando Savater.
        "Etica como amor propio".
        Ed. Grijalbo-Mondadori.
        ISBN 84-397-0259-0.
</PRE>

Sienta las bases filos&oacute;ficas y sociol&oacute;gicas de los modelos de
cooperaci&oacute;n ego&iacute;sta, as&iacute; como la formalizaci&oacute;n de la "Etica de lo
&uacute;til". Un texto de lectura dif&iacute;cil para las personas educadas en
los valores del humanismo cristiano, pero de plena aplicaci&oacute;n en 
la sociedad de valores capitalista actual.
<PRE>
        William Poundstone.
        "El dilema del prisionero".
        Alianza Editorial.
        ISBN 84-206-0747-9.
</PRE>

Mucho m&aacute;s que la exposici&oacute;n del juego del dilema del preso. Contiene
multitud de rese&ntilde;as hist&oacute;ricas, estudios basados en la realidad, y 
muestra los resultados previsibles a trav&eacute;s de la teor&iacute;a de juegos
compar&aacute;ndolos con los hechos tal y como ocurrieron.
<P>
<DT><B>Modelos matem&aacute;ticos.</B><DD><P>
<PRE>
        John Von Newman.
        "The theory of Games and Economic behavior".
        Princeton University Press, 1953.
</PRE>

El primer texto publicado sobre el tema, y base de todos los 
desarrollos y estudios posteriores.
<PRE>
        Morton D. Davis.
        "Introducci&oacute;n a la Teor&iacute;a de Juegos".
        Alianza Editorial. Col. Ciencia y Tecnolog&iacute;a.
        ISBN 84-206-7905-4.
</PRE>

Texto orientado a los profanos, con multitud de ejemplos y ejercicios
de aplicaciones de situaciones concretas, acompa&ntilde;ados de su 
correspondiente modelizaci&oacute;n y estudio.
<P>
<DT><B>Otros.</B><DD><P>No puedo por menos que citar las inapreciables dotes de humor y
sentido com&uacute;n que aparecen en el libro "El principio de Dilbert"
de Scott Adams. Si la mitad de las empresas siguieran su doctrina
el mundo empresarial no ser&iacute;a lo que es hoy ¿o s&iacute;?.
<P>Del mismo modo no puedo sino rendir homenaje p&oacute;stumo a Isaac Asimov
por sus series de Robots y de la Fundaci&oacute;n. Fue leyendo "Fundaci&oacute;n
e imperio", donde le&iacute; mis primeras referencias a la &eacute;tica de lo
&uacute;til", y donde aprend&iacute; el concepto de los modelos de desarrollo a 
corto y largo plazo. Tal vez una lectura no demasiado filos&oacute;fica, 
pero que consigui&oacute; interesarme por el tema. Bastantes a&ntilde;os despu&eacute;s
tengo que agradecer a todos estos libros -a pesar de mi educaci&oacute;n 
t&eacute;cnica- mi creciente inter&eacute;s por la sociolog&iacute;a. 
</DL>
<P>
<H2><A NAME="ss12.2">12.2 Publicaciones.</A>
</H2>

<P>
<P>[ JAMC: a&ntilde;adir URLs a las referencias ]
<P>
<DL>
<DT><B>El dilema del preso.</B><DD><P>En la revista "Investigaci&oacute;n y Ciencia", la secci&oacute;n
de "juegos de Ordenador", ha dedicado multitud de n&uacute;meros al
juego del Dilema del preso. El lector tiene acceso a c&oacute;digo fuente
de algoritmos, simulaciones, resultados de torneos computerizados, y
modelos gen&eacute;ticos de dicho juego.
Adem&aacute;s, existen en la misma revista multitud de art&iacute;culos 
sobre modelos de cooperaci&oacute;n ego&iacute;sta en el mundo animal.
<P>
<DT><B>La catedral y el bazar.</B><DD><P>Un cl&aacute;sico del mundo del software libre. Eric S. Raymond, 
escribi&oacute;, junto con este diversos ensayos y art&iacute;culos sobre dicho
modelo de desarrollo, estudiando el papel de cada uno de los 
intervinientes, y explicando las fases del desarrollo. Como lecturas
auxiliares podemos citar "Knowing the Knoosphere", y "How to become
a hacker".
<P>
<DT><B>El derecho a leer.</B><DD><P>Cuando Richard Stallman, escribi&oacute; este peque&ntilde;o cuento, se 
inici&oacute; una nueva &eacute;poca en el mundo software: el de la lucha por la
libertad de informaci&oacute;n y divulgaci&oacute;n. A&ntilde;os despu&eacute;s, en pleno
auge del mundo del software libre, este texto sigue siendo un aviso
ante la presi&oacute;n de los intereses pol&iacute;ticos y econ&oacute;micos por 
restringir la informaci&oacute;n en aras del mantenimiento del poder.
<P>
<DT><B>El manifiesto hacker.</B><DD><P>El 14 de Agosto de 1989, durante la Galactic Hacker Party
Lee Felstein propuso -y fue aprobado por unanimidad- lo que constituye
una declaraci&oacute;n de principios acerca de lo que debe ser la actitud 
y el estilo de trabajo del programador en el mundo libre.
<P>
<DT><B>El documento "halloween".</B><DD><P>Microsoft public&oacute; este documento como un memor&aacute;ndum interno
acerca de cu&aacute;l deb&iacute;a ser su pol&iacute;tica empresarial ante la expansi&oacute;n
del software libre. Plantea estrategias t&iacute;picas de empresa con
actitud monopol&iacute;stica: personalizaci&oacute;n de protocolos, compra de 
empresas, chantaje a los fabricantes de hardware. Todo un ejemplo
de "buen hacer" empresarial.
</DL>
<P>
<H2><A NAME="ss12.3">12.3 Art&iacute;culos de prensa y documentos en Internet.</A>
</H2>

<P>
<P>Dado lo actual del tema, existen multitud de art&iacute;culos tanto
en prensa electr&oacute;nica como impresa. Es imposible citarlos todos, e
indicar referencias. A t&iacute;tulo de ejemplo, cito los que han llegado
a mis manos:
<P>
<UL>
<LI>"Un pueblo barcelon&eacute;s, pionero en instalar Linux en organismos 
oficiales" <BR> CiberPa&iacute;s ( 25-Marzo-1999 ).
</LI>
<LI>"Why Open Source is the optimun Economic paradigm for Software"<BR>
 Dan Kaminsky ( 2-Marzo-1999 ) <BR>
<CODE>
<A HREF="http://doxpara.netpedia.net/core.html">http://doxpara.netpedia.net/core.html</A></CODE>
</LI>
<LI>"Is your software in danger of Termination?" <BR>
Bruce Perens ( 15-Marzo-1999 ).
        </LI>
<LI>"To be OSS, or not to be OSS, that is the question." <BR>
Paul Ferris (32bits online Marzo 1999).
</LI>
<LI>"Trampa en el Ciberespacio" <BR>
Traducci&oacute;n de Roberto Di Cosmo 9-Oct-1998 del documento original
del mismo nombre de Nikos Drakos.
</LI>
<LI>"Linux, Presente y Futuro" <BR>
Ismael Olea ( 28-Enero-1999 ).
</LI>
<LI>"Where does Linux want to go Today?" <BR>
Eric CaldWell ( 32bits online, 24-Marzo-1999 ).
</LI>
<LI>"Take my job please!" <BR>
Eric S. Raymond ( 29-Marzo-1999 ).
</LI>
<LI>"Apuntes sobre software libre" <BR>
Jes&uacute;s M. Gonz&aacute;lez Barahona ( 18-Marzo-1999 ).
</LI>
<LI>"Linux, Nacido libre" <BR>
Revista "Ciencia y Vida", Diciembre 1998.
</LI>
<LI>"Golpe con efecto" <BR>
Revista "Planeta Humano", Diciembre 1998.</LI>
</UL>
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-13.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-11.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc12">Índice general</A>
</BODY>
</HTML>
