<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Ep&iacute;logo. Agradecimientos.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-12.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc13" REL=contents>
</HEAD>
<BODY>
Página siguiente
<A HREF="La_empresa_ante_el_software_libre-12.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc13">Índice general</A>
<HR>
<H2><A NAME="epilogo"></A> <A NAME="s13">13. Ep&iacute;logo. Agradecimientos.</A></H2>

<P>
<P><EM><B>"Use the Source, Luke".</B></EM>
<P>A lo largo de este ensayo he intentado acercar al lector al
software libre, desde un enfoque distinto al tradicional: considerar
software libre como un producto de mercado, que proporciona beneficios
<P>Si el lector considera acertado o err&oacute;neo dicho planteamiento, o
cree que se le podr&iacute;a dar otro enfoque, estar&eacute; encantado de recibir
sugerencias para futuras ediciones del texto. En cualquier caso, considerar&eacute;
que he cumplido mis objetivos si despu&eacute;s de la lectura de este ensayo el
lector considera que el software libre ya no es una curiosidad de "unos locos"
sino que es un modelo de econom&iacute;a serio, y posiblemente viable.
<P>No quiero despedirme sin dar las gracias a todos los que directa o
indirectamente han apoyado la escritura de este texto:
<P>
<UL>
<LI> A Ismael Olea y a la gente de Hispalinux, por su trabajo en pro del
software libre, as&iacute; como su oferta de inclusi&oacute;n de este ensayo en las
publicaciones del proyecto LuCas.</LI>
<LI> A Jes&uacute;s Gonz&aacute;lez Barahona, por sus comentarios y sugerencias acerca de
la licencia del texto.</LI>
<LI> A la asociaci&oacute;n de estudiantes Eurielec, por los buenos ratos, la
amistad y la distribuci&oacute;n en castellano Eurielec Linux.</LI>
<LI> A Pablo Ortiz, y Eduardo Toribio, que me dieron la oportunidad de volver
a escribir en revistas de inform&aacute;tica, siendo un perfecto desconocido.</LI>
<LI> Al Departamento de Ingenier&iacute;a de Sistemas Telem&aacute;ticos, de la U.P.M. de
Madrid por permitirme el trabajo con software libre.</LI>
<LI> A todas las personas que a trav&eacute;s del correo y los grupos de
noticias han enviado comentarios al ensayo.</LI>
<LI> Y por supuesto: al hecho de la existencia del software libre, gracias
al cual me estoy pagando la hipoteca... ;-D ( para que luego digan que esto
no da dinero ).</LI>
</UL>
<P>Este documento puede ser obtenido en su formato SGML-LinuxDoc 
original de <BR>
<CODE>
<A HREF="ftp://drake.lab.dit.upm.es/pub/docs/freesoft/empresa.sgml">ftp://drake.lab.dit.upm.es/pub/docs/freesoft/empresa.sgml</A></CODE>
<P>Del mismo modo puede ser consultado en la World Wide Web en: <BR>
<CODE>
<A HREF="http://drake.lab.dit.upm.es/~jantonio/articulos/empresa.html">http://drake.lab.dit.upm.es/~jantonio/articulos/empresa.html</A></CODE>
<P>El documento ha sido editado &iacute;ntegramente en formato SGML-LinuxDoc
en un ordenador Pentium-166 ejecutando Eurielec Linux 2.1 con n&uacute;cleo del
sistema operativo Linux 2.2.4. Para su desarrollo se han utilizado 
herramientas de software libre, sin intervenci&oacute;n directa o indirecta de
ning&uacute;n tipo de software propietario
<P>Juan Antonio Mart&iacute;nez Casta&ntilde;o <BR>
Madrid, 12 de Abril de 1999
<HR>
Página siguiente
<A HREF="La_empresa_ante_el_software_libre-12.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc13">Índice general</A>
</BODY>
</HTML>
