<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Motivaciones del software libre.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-6.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-4.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-6.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-4.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc5">Índice general</A>
<HR>
<H2><A NAME="motivaciones"></A> <A NAME="s5">5. Motivaciones del software libre.</A></H2>

<P>
<H2><A NAME="ss5.1">5.1 Resumen del cap&iacute;tulo.</A>
        </H2>

<P>
<UL>
<LI> Nadie regala nada.</LI>
<LI> Un poco de psicolog&iacute;a y filosof&iacute;a.</LI>
<LI> Motivaciones personales.</LI>
<LI> El software libre como potenciador del ego.</LI>
<LI> Un modelo "sectario".</LI>
<LI> Nichos ecol&oacute;gicos. </LI>
<LI> Competencia en el mundo del software libre.</LI>
<LI> El software libre en entornos no empresariales.</LI>
<LI> Perfil psicol&oacute;gico del voluntario.</LI>
</UL>
<P>
<H2><A NAME="ss5.2">5.2 A la b&uacute;squeda de un motivo para el software libre.</A>
</H2>

<P>
<P>Vamos a hacer una parada para analizar desde un punto de vista &eacute;tico y
filos&oacute;fico la realidad del software libre y sus implicaciones. A la hora
de abordar este tema, he querido tener en mente una pregunta: ¿cu&aacute;l es
el motivo de la existencia de este modelo?. No quiero establecer juicios
de valor ni comparaciones. Es tradicional en el mundo del software libre 
la existencia de consideraciones "&eacute;ticas" y morales. En un terreno de
competici&oacute;n constante, como es el mundo empresarial, palabras como
solidaridad, altruismo, o trabajo desinteresado carecen de sentido. Por
eso, cuando una empresa adopta el modelo del software libre es que hay
razones econ&oacute;micas o estrat&eacute;gicas en ello.
<P>Para esto, nada mejor que partir de alg&uacute;n modelo sociol&oacute;gico que
pueda explicar el &eacute;xito del software libre, y especialmente su aplicaci&oacute;n
en el entorno comercial. Si bien, como hemos visto anteriormente, el
movimiento del software libre naci&oacute; como una defensa ante el acoso a los
usuarios del software, y como proclama por la libertad de expresi&oacute;n y de
informaci&oacute;n, no es menos cierto que estos &uacute;ltimos a&ntilde;os se ha producido un
cambio estrat&eacute;gico: la energ&iacute;a que mueve el software libre est&aacute; poco a 
poco tomando matices econ&oacute;micos, de estrategia de empresas. Lo que hace
unos a&ntilde;os era una bonita aventura, ahora se ha convertido en modelo
empresarial. No afirmo la bondad ni la maldad de este hecho, s&oacute;lo lo
constato, e intento mostrar una explicaci&oacute;n a tal efecto. 
Hay, creo, una explicaci&oacute;n a tal situaci&oacute;n: en sociolog&iacute;a, existe
un modelo de comportamiento muy conocido y estudiado, que hasta hace unos
a&ntilde;os era una curiosidad matem&aacute;tica de la teor&iacute;a de juegos, y que s&oacute;lo
ten&iacute;a aplicaci&oacute;n al estudio de determinados comportamientos animales. 
Estamos hablando de los modelos de cooperaci&oacute;n ego&iacute;sta, en los cuales
los participantes colaboran entre s&iacute; para obtener un beneficio particular.
<P>Diversos fil&oacute;sofos han intentado explicar dicho modelo en base a la
naturaleza de los seres vivos. A continuaci&oacute;n hago un breve resumen de
dicha teor&iacute;a, conocida como "&eacute;tica de lo &uacute;til". Aunque no necesariamente 
comparto dicha teor&iacute;a, creo que puede explicar adecuadamente la actitud 
del mundo empresarial ante el software libre.
<P>
<H2><A NAME="ss5.3">5.3 La &eacute;tica de lo &uacute;til.</A>
  </H2>

<P>
<P>Nadie regala nada. Todo en la vida tiene su precio y su coste. Cuando el
individuo establece una relaci&oacute;n con su entorno, inevitablemente est&aacute; 
intercambiando con dicho entorno diversos aspectos de su existencia. 
Dicha interactuaci&oacute;n est&aacute; marcada y motivada por la b&uacute;squeda de un
resultado.
<DL>
<DT><B>Un poco de psicolog&iacute;a y filosof&iacute;a.</B><DD><P>Podemos buscar explicaciones a este comportamiento desde la filosof&iacute;a
y la sociolog&iacute;a, as&iacute; como establecer s&iacute;miles con comportamientos y
actitudes de otras especies animales. Muchos autores sostienen que la
raz&oacute;n de la existencia es el af&aacute;n de sobrevivir a uno mismo, bien
a trav&eacute;s de la reproducci&oacute;n, bien a trav&eacute;s de las obras, o bien
mediante la sublimaci&oacute;n del "yo" a un ente superior. Esta supervivencia
se consigue a trav&eacute;s de la interactuaci&oacute;n con el entorno. Desde
este punto de vista, el hombre es un ser social en cuanto necesita
de los dem&aacute;s para realizarse a si mismo.
<P>Por consiguiente, las actuaciones personales responden al deseo del
individuo de su propia pervivencia. Este deseo no es exclusivo del
hombre, sino que abarca a toda la escala evolutiva, desde el virus
hasta la mayor empresa u organizaci&oacute;n imaginable. La moralidad de los
actos queda definida no por su "bondad", sino por su "utilidad".
La sociedad tiende -no sin raz&oacute;n- a rebelarse con esta moral
utilitarista, pero ser&iacute;a de necios negar el hecho de que en el mundo 
empresarial este planteamiento, la obtenci&oacute;n de beneficios y la
perdurabilidad de la empresa, son los que gu&iacute;an sus actuaciones.
<P>Incluso a nivel particular se puede aplicar el concepto de
utilitarismo a la hora de establecer motivaciones. Afortunadamente
el libre albedr&iacute;o de la persona, y la existencia de m&uacute;ltiples
valores en su modelo de actuaci&oacute;n, hacen que sea m&aacute;s dif&iacute;cil -si
no imposible- hablar de un utilitarismo en la moral individual. No
obstante, como veremos, ese altruismo individual puede ser -y de
hecho es utilizado- por empresas u otros individuos sin tantos
condicionamientos &eacute;ticos.
<P>Desde la &eacute;tica de lo &uacute;til, pues, se deduce que en la b&uacute;squeda de la
supervivencia del individuo, o del colectivo, haya que obtener
resultados. Estos resultados se miden en dos t&eacute;rminos: beneficio y
efectividad. Por beneficio entendemos las relaci&oacute;n coste/prestaci&oacute;n
obtenida de la interrelaci&oacute;n social. Por efectividad entendemos el
grado de perdurabilidad y rendimiento a medio y largo plazo de una
serie de interrelaciones. Una relaci&oacute;n beneficiosa no tiene por qu&eacute;
ser efectiva, y al contrario, una relaci&oacute;n efectiva tiene un
beneficio pr&oacute;ximo a la unidad. Esto no quiere decir que no se obtenga
beneficio, sino que ambas partes obtienen recompensas equiparables
entre si.
<P>Esta moral de lo "&uacute;til" tiene pues, dos vertientes de desarrollo y 
evoluci&oacute;n: aquellos modelos basados en la b&uacute;squeda de beneficio 
personal, y los basados en la b&uacute;squeda de beneficio mutuo. Ambos 
modelos buscan beneficio, pero desde un enfoque distinto. El primero
tiende a ignorar al otro, mientras que el segundo colabora con el
otro para obtener un beneficio com&uacute;n. No es dif&iacute;cil establecer
paralelismos con modelos pol&iacute;ticos: tenemos desde el modelo comunista
en el que el individuo delega la responsabilidad de su supervivencia
en un "ente" conocido como estado, hasta el modelo ultra nacionalista
en que el individuo ignora cualquier realidad y objetivos que no
sean los suyos. 
<P>
<DT><B>Motivaciones personales.</B><DD><P>Visto pues el origen de la actuaci&oacute;n social de la persona, vamos
a bajar al terreno del software libre, ¿cu&aacute;l es la motivaci&oacute;n que
impulsa a una comunidad de individuos a colaborar desinteresadamente
en un proyecto de desarrollo software? 
Existen multitud de razones para ello: el af&aacute;n de superaci&oacute;n,
la necesidad de reconocimiento, la mejora de curr&iacute;culum, 
adquisici&oacute;n de conocimiento... Eric Raymond comenta en su famoso
art&iacute;culo "La catedral y el bazar" el hecho de que este af&aacute;n del
colaborador puede ser aprovechado -y de hecho lo es- de modo
inmisericorde por parte del coordinador del proyecto, y por 
supuesto por su empresa.
<P>
<DT><B>El software libre como potenciador del ego.</B><DD><P>Porque a poco que el coordinador tenga un poco de tacto social, la
interrelaci&oacute;n con el voluntario evoluciona hasta un grado tal que
que podemos hablar de sumisi&oacute;n e identificaci&oacute;n con la causa. El
colaborador, observa que su trabajo es reconocido, que aparece su
nombre en Internet, que su curr&iacute;culum empieza a crecer... incluso
que puede ganar dinero con esa colaboraci&oacute;n. El objetivo de b&uacute;squeda
de la pervivencia personal se ve tan recompensado que se establecen
hasta relaciones afectivas con el proyecto en que se colabora.
<P>
<DT><B>Un modelo "sectario".</B><DD><P>Es dif&iacute;cil que el colaborador detecte esta situaci&oacute;n: el est&aacute;
colaborando en una buena causa, comparte informaci&oacute;n, trabaja en
grupo... objetivos loables y pol&iacute;ticamente correctos; cumple
a rajatabla con su escala de valores, con su deseo de colaborar,
de ser &uacute;til. En aplicaci&oacute;n estricta de la moral utilitarista
est&aacute; satisfaciendo su deseo de pervivencia de una manera total
y gratificante.
Esta identificaci&oacute;n con el objetivo hace que la efectividad de 
las transacciones sociales en este modelo de desarrollo sea 
incre&iacute;blemente alta. Podr&iacute;amos hablar de un modelo de "secta" en el
que el sectario da su vida por el "l&iacute;der". No hablo en sentido
figurado: conozco personalmente gente que ha dejado hasta de comer
por conseguir tener enmarcado en su casa una contestaci&oacute;n por
correo electr&oacute;nico de su &iacute;dolo Linus Torvalds.
<P>Evidentemente no todo es as&iacute;. Este tipo de relaci&oacute;n de sumisi&oacute;n
no dura en el tiempo, dejando paso a una relaci&oacute;n, si no entre
iguales, si entre dos partes que conocen y asumen su papel: el de
producirse mutuo beneficio. En este punto el colaborador pasa a
tener un papel activo en la relaci&oacute;n y obtiene algo m&aacute;s que 
compensaciones morales. Podr&iacute;amos hablar de una madurez en el
voluntario del software libre, en la que comprende y asume su
papel, lo encaja en su escala de valores, y deja de ser un 
espectador pasivo para convertirse en actor.
<P>Tenemos finalmente un proyecto de software libre, con una empresa, 
un coordinador, varios responsables de &aacute;rea, muchos -idealmente
toda la Internet- voluntarios, y por supuesto, clientes. Cada uno
en su puesto, con sus funciones, objetivos y motivaciones. Ahora 
vamos a ver c&oacute;mo se hace un proyecto empresarial de software libre.
</DL>
<P>
<H2><A NAME="ss5.4">5.4 Otros modelos sociol&oacute;gicos.</A>
</H2>

<P>             
Como muchos lectores no dejar&aacute;n de hacer notar, hay modelos 
alternativos a la moral utilitarista que pueden explicar ciertos aspectos 
del software libre que no son -salvo mediante una mitificaci&oacute;n extrema del 
modelo- explicables mediante una teor&iacute;a de lo "eficaz". Este es el caso de
las organizaciones o movimientos no empresariales en torno al software libre.
Ejemplos como la Free Software Foundation, o el proyecto Debian, aunque 
podr&iacute;a decirse que son el resultado de la auto-organizaci&oacute;n de intereses
individuales, no es sencillo seguir dicha l&iacute;nea de pensamiento, hasta explicar
su situaci&oacute;n actual. Aqu&iacute; la ganancia econ&oacute;mica es una ventaja a&ntilde;adida, 
aunque no constituye el objetivo principal. 
<P>En este caso podemos hablar de "organizaciones de voluntariado
inform&aacute;tico", cuyos objetivos son el garantizar a la comunidad diversos
valores como:
<UL>
<LI> La defensa del derecho de informaci&oacute;n.</LI>
<LI> La independencia ante poderes econ&oacute;micos e intereses comerciales.</LI>
<LI> La b&uacute;squeda de metodolog&iacute;as alternativas a los desarrollos
tradicionales.</LI>
</UL>

La auto organizaci&oacute;n es pues una consecuencia, no de los intereses 
particulares de los cooperantes, sino de la necesidad de presentar un frente 
com&uacute;n ante la reacci&oacute;n mas habitual en la econom&iacute;a de mercado: la b&uacute;squeda 
de beneficios en detrimento de la eficacia.
<P>Est&aacute; claro que estas organizaciones poseen un componente econ&oacute;mico
nada desde&ntilde;able: se necesitan fuentes de financiaci&oacute;n para mantener una
estructura organizativa m&iacute;nima, para la asesor&iacute;a legal, etc. Frecuentemente
se crean al amparo de Fundaciones, centros de investigaci&oacute;n, universidades,
y se nutren de donaciones, subvenciones y -para qu&eacute; negarlo- de contribuciones
de las empresas que hacen negocio alrededor de sus proyectos. Este punto
ilustra una caracter&iacute;stica importante de la empresa de software libre, que la 
diferencia de una fundaci&oacute;n: mientras esta &uacute;ltima trabaja en los componentes
esenciales del software, la empresa suele dedicar su actividad en los
servicios a&ntilde;adidos al software generado por la primera. El reparto de 
"nichos ecol&oacute;gicos" vuelve a aparecer.
<P>[JAMC: a&ntilde;adir perfil psicol&oacute;gico del voluntario]
<P>
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-6.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-4.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc5">Índice general</A>
</BODY>
</HTML>
