<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Un modelo matem&aacute;tico: El dilema del preso.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-9.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-7.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc8" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-9.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-7.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc8">Índice general</A>
<HR>
<H2><A NAME="dilema"></A> <A NAME="s8">8. Un modelo matem&aacute;tico: El dilema del preso.</A></H2>

<P>
<H2><A NAME="ss8.1">8.1 Resumen del cap&iacute;tulo.</A>
</H2>

<P>
<UL>
<LI>Descripci&oacute;n.</LI>
<LI>Estrategias del juego.</LI>
<LI>Resultados experimentales.</LI>
<LI>Exportando el modelo a la vida real.</LI>
</UL>
<P>
<P>
<H2><A NAME="ss8.2">8.2 Descripci&oacute;n.</A>
</H2>

<P>En el campo de la teor&iacute;a de juegos existe un cl&aacute;sico de la literatura,
conocido por sus implicaciones y aplicaci&oacute;n a las relaciones sociales: el
"Dilema del Preso".
<P>En su versi&oacute;n b&aacute;sica plantea un problema simple de toma de decisiones:
<P>Dos atracadores han sido detenidos, estando cada uno aislado del otro en sendas
salas de interrogatorio. El fiscal propone a cada uno de los presos un pacto:
si delata a su compa&ntilde;ero se librar&aacute; de la c&aacute;rcel.... siempre y cuando el
compa&ntilde;ero no le delate a &eacute;l. Si ambos optan por permanecer callados la pena
ser&aacute; de un a&ntilde;o de prisi&oacute;n. En el caso de condena, la pena ser&aacute; de tres a&ntilde;os.
<P>En el modelo sencillo tenemos las siguientes combinaciones:
<BLOCKQUOTE><CODE>
<PRE>
Preso A         Preso B         Resultado A     Resultado B
-----------------------------------------------------------
calla           calla           1 a&ntilde;o            1 a&ntilde;o
calla           delata          3 a&ntilde;os           libertad
delata          calla           libertad        3 a&ntilde;os
delata          delata          3 a&ntilde;os           3 a&ntilde;os
</PRE>
</CODE></BLOCKQUOTE>
<P>Tanto A como B razonan que en el caso de permanecer callados no
tienen posibilidad de librarse de la c&aacute;rcel, luego la soluci&oacute;n ideal es
delatar al compa&ntilde;ero... salvo que el compa&ntilde;ero puede seguir el mismo 
razonamiento, ¿c&uacute;al es pues la decisi&oacute;n correcta?.
<P>La segunda variante del dilema del preso nos introduce de lleno
en los modelos de cooperaci&oacute;n:
<P>Tenemos de nuevo dos atracadores, esta vez en libertad, que se
dedican a la compraventa de productos robados. Los atracadores han 
pactado que uno de ellos deje la mercanc&iacute;a en un lugar determinado, 
mientras que el otro deja el dinero en otro lugar. Ambos atracadores
se dirigen a recoger posteriormente el paquete destinado a cada uno...
<P>Est&aacute; claro que si uno de ellos deja un paquete vac&iacute;o, y recoge
a cambio un paquete lleno, ha obtenido un beneficio neto en la transacci&oacute;n.
Por consiguiente ambos dejan sendos paquetes vac&iacute;os... y recogen paquetes
vac&iacute;os. Pero, ¿y si en lugar de un &uacute;nico intercambio se realizan una serie
de intercambios espaciados en el tiempo?. Si un ladr&oacute;n traiciona al otro,
es casi seguro que ser&aacute; traicionado en la siguiente transacci&oacute;n. ¿Cu&aacute;l es
la estrategia ganadora?.
<P>Para complicar m&aacute;s las cosas, vamos a suponer que en lugar de dos
atracadores tenemos n atracadores, interaccionando entre ellos por parejas:
a cada turno el atracador m debe decidir qu&eacute; es lo que va a hacer con cada
uno de los dem&aacute;s atracadores, colaborar o traicionar.
<P>Vamos a modelar el juego: Tenemos n agentes y un &aacute;rbitro. A cada turno
el &aacute;rbitro indica a cada agente con que otro agente va a interactuar, debiendo
decidir si entrega como resultado un 1 ( colabora ) o un 0 ( traiciona )
Gana el agente que al cabo de X turnos consigue la mejor relaci&oacute;n entre
colaboraciones e inversiones.
<P>La analog&iacute;a con el modelo empresarial es evidente: el &aacute;rbitro es el
mercado, y los ladrones son todos aquellos que intervienen en transacciones
comerciales ( habr&aacute; alguien que opine que la analog&iacute;a deber&iacute;a ser a la 
inversa, pero eso ya son temas pol&iacute;ticos... ).
<P>Definimos <EM>beneficio</EM> en un turno de transacciones como:
<BLOCKQUOTE><CODE>
<PRE>
        ( 1 / numero_jugadores ) * ( total obtenido - total invertido )
</PRE>
</CODE></BLOCKQUOTE>
<P>donde el resultado est&aacute; en el intervalo (-1,1).
<P>El beneficio total ser&aacute; el resultado del sumatorio de los beneficios parciales.
<P>Aparentemente, el jugador que escoja una estrategia ego&iacute;sta tiene
las de ganar, pues su beneficio nunca ser&aacute; negativo. Del mismo modo, los
colaboradores sistem&aacute;ticos tienen las de perder, por pardillos....
<P>Por ello, vamos a definir un nuevo concepto: el de <EM>efectividad</EM>,
entendida como el cociente entre el total obtenido y el n&uacute;mero de
jugadores. La efectividad total, ser&aacute; la media aritm&eacute;tica de las efectividades
parciales. Experimentalmente, se observa que el algoritmo "ego&iacute;sta" tiende
r&aacute;pidamente a una efectividad nula conforme el n&uacute;mero de transacciones crece.
<P>Cuando se simula mediante ordenador este juego se obtiene un resultado
sorprendente: la mayor efectividad se corresponde con un beneficio nulo... que
no es sino el resultado de una igualdad entre el coste y el resultado. El
algoritmo que cumple con este requisito no es sino el conocido "ojo por ojo y
diente por diente" de la tradici&oacute;n judeocristiana. Codificarlo es muy simple:
<UL>
<LI> En la primera jugada el agente colabora ( devuelve un 1 ).</LI>
<LI> En las siguientes jugadas se limita a repetir el movimiento 
anterior de su oponente.</LI>
</UL>
<P>Las implicaciones son sorprendentes, aunque un m&iacute;nimo de sentido
com&uacute;n las explica: en un entorno competitivo, se tiende a potenciar aquellas
operaciones que dan un resultado positivo. Del mismo modo se aisla a aquellos
de quienes no se espera resultado alguno. Al aumentar el n&uacute;mero de operaciones
el "universo" se divide r&aacute;pidamente en dos modelos: los aislacionistas y los
colaboracionistas. En el primer grupo, el beneficio a corto plazo es elevado,
pero su eficacia disminuye progresivamente con el tiempo. En el segundo modelo,
si bien los beneficios suelen ser menores ( o incluso nulos ) la efectividad a
largo plazo se incrementa debido a que toda inversi&oacute;n acaba resultando en un
beneficio.
<P>El que el beneficio neto sea nulo tiene una explicaci&oacute;n obvia: en 
una relaci&oacute;n proveedor-cliente, ambos tienen que ganar. Si se produce un
desequilibrio hacia uno u otro lado, la relaci&oacute;n tiende a deteriorarse 
r&aacute;pidamente. El "abusar del cliente" s&oacute;lo puede ser beneficioso a corto
plazo o bien si se dispone de un n&uacute;mero suficientemente grande de clientes.
Como dice el refr&aacute;n: "A algunas personas se las puede enga&ntilde;ar siempre, y a 
veces es posible enga&ntilde;ar a todo el mundo. Pero no se puede enga&ntilde;ar siempre
a todo el mundo".
<P>La experimentaci&oacute;n -y el contraste con la realidad- han
demostrado que el "ojo por ojo" no es el procedimiento m&aacute;s eficaz. Diversos
experimentos con algoritmos gen&eacute;ticos modelados para jugar al "Dilema del
preso", muestran que existe un modelo, que si bien tiene una efectividad 
similar, aumenta el beneficio neto. Es el denominado "machaca pardillos". 
En esencia es un "ojo por ojo" modificado, de tal suerte que tras un 
n&uacute;mero aleatorio de secuencias iguales, el agente cambia durante un ciclo
el resultado de su salida, volviendo inmediatamente al "ojo por ojo" en la
siguiente jugada.
<P>El por qu&eacute; de dicho resultado se descubre enseguida: el principal
problema del "ojo por ojo" es que es un sistema "con memoria", de tal suerte
que ante un oponente que comete un desliz, acaba f&aacute;cilmente ensartado en una
secuencia de ceros, con la consiguiente perdida de efectividad. Por otro lado
adolece del defecto de ser "demasiado generoso" con aquellos algoritmos que
son colaboradores por sistema. El hecho de insertar un 1 en una secuencia 
de ceros, puede "reconvertir" a un traidor, y de la misma forma, insertar 
un 0 en una secuencia de unos, puede hacerle aprovecharse de los pardillos 
colaboradores sistem&aacute;ticos.
<P>La similitud con el modelo de desarrollo de software abierto es 
evidente: es un modelo que est&aacute; basado en la colaboraci&oacute;n mutua, que
realimenta r&aacute;pidamente a los agentes que colaboran, que se aprovecha de
los pardillos de manera inmisericorde... y que relega r&aacute;pidamente al olvido
a los no colaboradores.
<P>La analog&iacute;a es incompleta: el problema del dilema del preso adjudica
un coste binario a cada transacci&oacute;n ( 0 &oacute; 1 ). Esto, como hemos visto, no es
exactamente cierto: el coste real es inversamente proporcional al n&uacute;mero de
agentes que intervienen en cada turno de transacciones: pi&eacute;nsese que desde
el lado de la empresa se est&aacute; compartiendo el coste de poner el c&oacute;digo al
p&uacute;blico entre n potenciales proveedores de soluciones o mejoras, y que al
aumentar el n&uacute;mero de usuarios, el beneficio potencial se dispara. No 
obstante nos sirve para demostrar que un sistema que potencie las
transacciones con el mayor n&uacute;mero posible de agentes, consigue la mayor
efectividad conforme el n&uacute;mero de intercambios aumenta.
<P>En las referencias y ap&eacute;ndices el lector encontrar&aacute; direcciones
de Internet donde se trata el tema, as&iacute; como diverso software de emulaci&oacute;n
del juego del dilema del preso. Es interesante observar la evoluci&oacute;n de 
cada partida en funci&oacute;n del n&uacute;mero de participantes, del n&uacute;mero de turnos,
e incluso del "perfil psicol&oacute;gico" de los jugadores... 
<P>Una reflexi&oacute;n: este modelo se denomina de colaboraci&oacute;n ego&iacute;sta. El 
objetivo es obtener beneficios y aumentar la eficacia a medio y largo plazo. 
La colaboraci&oacute;n no s&oacute;lo no es desinteresada, sino que el voluntarismo est&aacute; 
penalizado. La idea de la participaci&oacute;n altruista es uno de los mitos del 
software abierto, pero de ning&uacute;n modo se corresponde con la realidad, 
especialmente en el mundo empresarial.
<P>
<H2><A NAME="ss8.3">8.3 El dilema del preso y el software libre.</A>
</H2>

<P>
<P>Como muchos lectores conocedores del tema objetar&aacute;n, el modelo del
dilema del preso est&aacute; estudiado para el caso de n participantes compitiendo
entre si dos a dos. Esta no es una aproximaci&oacute;n realista, pues no tiene
en cuenta que en el mundo real las interacciones se producen entre todos
los participantes de manera simult&aacute;nea. Las alianzas y pactos entre
varios participantes, por citar un ejemplo, no est&aacute;n contempladas, ni
siquiera estudiadas. Para que el modelo de cooperaci&oacute;n sea &oacute;ptimo en este
entorno deben darse unas condiciones de contorno que permitan reducir
el problema al caso conocido.
<P>
<UL>
<LI>El primer concepto es el de "masa cr&iacute;tica": para que el modelo
sea efectivo, el n&uacute;mero de participantes debe ser grande, varias
magnitudes superior al de un desarrollo software normal. De lo 
contrario, no tenemos sino un modelo de trabajo distribuido.
</LI>
<LI>El segundo concepto es el de "temporalidad": en un proyecto a
corto plazo, el modelo de software libre no es capaz de proporcionar
suficientes beneficios. Estudiando estad&iacute;sticamente partidas del
dilema del preso se ve que las curvas inversi&oacute;n/beneficios del
modelo cooperativo son asint&oacute;ticas respecto al tiempo, seg&uacute;n la
gr&aacute;fica:

<BLOCKQUOTE><CODE>
<HR>
<PRE>
        |                                                    --
        |                                             =====--
        |                                        =====   --
        |                                   =====      --
        |                              =====         --
        |                         =====            --
        |          Inversion =====               --
        |               =====                  --
        |          =====                     --
        |     =====                       ---
        |=====                         ---
        |                           --- Beneficios
        |                       ----
        |                   ----
        |              -----
        |        ------
        |--------
        |
        |-------------------------------------------------------------> tiempo
</PRE>
<HR>
</CODE></BLOCKQUOTE>


Por ello la empresa que adopte el modelo de software libre debe ser
capaz de asumir un periodo de p&eacute;rdidas iniciales, hasta conseguir 
su aceptaci&oacute;n.
</LI>
<LI>Otro concepto es el de "Identificaci&oacute;n". Los participantes 
deben conocer y asumir su papel en el modelo, y lo que es fundamental
TODOS los participantes deben obtener beneficios de la cooperaci&oacute;n
mutua. De lo contrario, se est&aacute; pidiendo a gritos un cambio de 
estrategia a un modelo de pactos, o a una desviaci&oacute;n respecto 
del proyecto original.
</LI>
<LI>Haciendo un s&iacute;mil con la f&iacute;sica nuclear, la conjunci&oacute;n de estas
tres condiciones, provoca la "ignici&oacute;n", esto es, el modelo llega a 
ser auto-mantenido, y la productividad se dispara por efecto de 
m&uacute;ltiples realimentaciones. Es el estado "ideal" de este modelo.</LI>
</UL>

No es sencillo llegar a la "ignici&oacute;n". Los usuarios y voluntarios
deben ser convencidos de mantenerse en el proyecto, a costa de grandes 
inversiones por parte de la empresa o director de proyecto.  La figura y 
carisma del l&iacute;der es fundamental para mantener el estado de &aacute;nimo. Una vez 
alcanzada la ignici&oacute;n, casi no habr&aacute; que hacer tareas de captaci&oacute;n: el &eacute;xito 
tiene su propia inercia, y la afluencia de "adeptos" ser&aacute; casi autom&aacute;tica. 
Es el momento de recoger los frutos del trabajo....
<P>
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-9.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-7.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc8">Índice general</A>
</BODY>
</HTML>
