<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Conclusiones.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-12.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-10.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc11" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-12.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-10.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc11">Índice general</A>
<HR>
<H2><A NAME="conclusion"></A> <A NAME="s11">11. Conclusiones.</A></H2>

<P>
<P>A lo largo de este documento hemos presentado al lector la panor&aacute;mica
del software libre desde el punto de vista empresarial. Como resumen del
ensayo vamos a enumerar una serie de conclusiones:
<P>
<H2><A NAME="ss11.1">11.1 Software libre como modelo de desarrollo sostenible.</A>
</H2>

<P>Hemos visto como el software libre es susceptible de convertirse en
modelo de desarrollo empresarial, y como hoy en d&iacute;a hay empresas que est&aacute;n
obteniendo grandes beneficios trabajando con software libre. <BR>
Del mismo modo hemos estudiado como para algunas organizaciones y
sociedades en desarrollo, este modelo es el &uacute;nico viable para su desarrollo
tecnol&oacute;gico.
<P>Por ello, se puede afirmar, sin temor a equivocarnos que este modelo
es viable, y que constituye un modelo de desarrollo sostenible, basado en 
que la compartici&oacute;n de informaci&oacute;n constituye una manera de aumentar el
bienestar colectivo, y que con una adecuada orientaci&oacute;n y gesti&oacute;n, el modelo
es, no s&oacute;lo productivo, sino tambi&eacute;n rentable.
<P>
<H2><A NAME="ss11.2">11.2 La empresa en la sociedad de la informaci&oacute;n.</A>
</H2>

<P>
<P>Hoy en d&iacute;a la empresa en las sociedades industrializadas est&aacute; orientada
mayoritariamente al sector servicios. El hecho de considerar la informaci&oacute;n
como un bien com&uacute;n, y orientar la producci&oacute;n de software, - y en general de
todas aquellas materias relacionadas con el aumento del conocimiento -
obliga a la empresa a un cambio de actitud, tanto en la orientaci&oacute;n empresarial
como en el modelo de trabajo a aplicar. La metodolog&iacute;a del software libre
cambia el concepto de software como producto, por el de software como servicio
de valor a&ntilde;adido.
<P>
<H2><A NAME="ss11.3">11.3 No perder el objetivo: obtener beneficios.</A>
</H2>

<P>A pesar de todo no se puede perder el objetivo: una empresa debe buscar
la rentabilidad. Adoptar el modelo del software libre implica buscar
nuevas fuentes de financiaci&oacute;n, nuevos nichos de mercado, as&iacute; como una mayor
orientaci&oacute;n a los deseos del cliente. La relaci&oacute;n entre productor y consumidor 
pasa a ser bi-direccional, y se debe garantizar que todas las partes ganen 
con el intercambio. Los modelos matem&aacute;ticos nos ayudan a analizar este proceso,
y a poder prever cu&aacute;l va a ser la reacci&oacute;n del mercado.
<P>
<H2><A NAME="ss11.4">11.4 El futuro del software libre.</A>
</H2>

<P>
<P>Con el advenimiento de la empresa al modelo de software libre es de
prever que dicho software sufra una evoluci&oacute;n. En opini&oacute;n del autor, la
apariencia es que se est&aacute; produciendo un proceso de focalizaci&oacute;n de los 
objetivos, de manera que:
<UL>
<LI> Los proyectos coordinados por organizaciones sin &aacute;nimo de
lucro se centrar&aacute;n en el software como herramienta, esto es:
<UL>
<LI> El n&uacute;cleo del sistema operativo.</LI>
<LI> El entorno de trabajo.</LI>
<LI> Las herramientas de desarrollo.</LI>
<LI> Las aplicaciones de productividad.</LI>
<LI> Control de est&aacute;ndares y modelos de implementaci&oacute;n.</LI>
</UL>
</LI>
<LI> Las empresas obtienen m&aacute;s beneficios del software de valor
a&ntilde;adido, tales como:
<UL>
<LI> Herramientas de administraci&oacute;n y gesti&oacute;n.</LI>
<LI> Soluciones a medida.</LI>
<LI> Proyectos de integraci&oacute;n.</LI>
<LI> Herramientas espec&iacute;ficas para soluciones particulares.</LI>
</UL>
</LI>
</UL>
        
<P>Es de esperar que el proceso de adopci&oacute;n del software libre por 
los grandes de la inform&aacute;tica conlleve una cierta "ralentizaci&oacute;n" del
desarrollo, para as&iacute; proveer de unos API's m&aacute;s estables y documentados. Del
mismo modo, la adopci&oacute;n de este modelo puede dar lugar a una mejora en los
est&aacute;ndares, pues como hemos visto en uno de los cap&iacute;tulos, la b&uacute;squeda de 
extensiones a los est&aacute;ndares aceptados conlleva un mayor coste econ&oacute;mico y
un rechazo por parte del cliente.
<P>Por &uacute;ltimo, el modelo de compartici&oacute;n de informaci&oacute;n puede ser
exportado a otros mercados, no s&oacute;lo el del software. Tenemos una primera
introducci&oacute;n en el concepto de franquicias, de cesi&oacute;n de derechos de explotaci&oacute;n,
etc. Es de esperar una legislaci&oacute;n clara respecto al software libre, en 
especial en el campo de la elaboraci&oacute;n de documentos, y en la publicaci&oacute;n en
Internet.
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-12.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-10.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc11">Índice general</A>
</BODY>
</HTML>
