<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>La empresa ante el software libre.: Marco legal del software libre.</TITLE>
 <LINK HREF="La_empresa_ante_el_software_libre-11.html" REL=next>
 <LINK HREF="La_empresa_ante_el_software_libre-9.html" REL=previous>
 <LINK HREF="La_empresa_ante_el_software_libre.html#toc10" REL=contents>
</HEAD>
<BODY>
<A HREF="La_empresa_ante_el_software_libre-11.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-9.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc10">Índice general</A>
<HR>
<H2><A NAME="s10">10. Marco legal del software libre.</A></H2>

<P>
<P>
<H2><A NAME="ss10.1">10.1 Resumen del cap&iacute;tulo.</A>
        </H2>

<P>
<UL>
<LI>Marco legal del software.</LI>
<LI>El derecho a recibir y emitir libremente informaci&oacute;n veraz.</LI>
<LI>La ley de Propiedad intelectual.</LI>
<LI>¿Es patentable la informaci&oacute;n?.</LI>
<LI>Control de las licencias de software libre.   </LI>
<LI>Problem&aacute;tica de la documentaci&oacute;n libre.</LI>
</UL>
<P>Hemos visto en anteriores cap&iacute;tulos el modelo de empresa basada en
el software libre, los fundamentos filos&oacute;ficos y modelos matem&aacute;ticos. Hemos
hecho una parada en el aspecto pol&iacute;tico y social de dicho software.
Dedicaremos este cap&iacute;tulo a un tema, que tiene una importancia
capital en el software libre: la cobertura legal de dicho software.
<P>Seg&uacute;n hemos visto, dada la naturaleza intr&iacute;nseca de informaci&oacute;n libre que 
implica el modelo OSS, es necesario establecer una serie de protecciones a 
dicho software, que se plasman en las denominadas licencias de uso y 
distribuci&oacute;n. Veremos una serie de temas legales que afectan a dichas
licencia.
<P>
<H2><A NAME="ss10.2">10.2 Marco legal del software.</A>
</H2>

<P>
<P>La libertad de informaci&oacute;n es un derecho consagrado en nuestra
Constituci&oacute;n. La legislaci&oacute;n y jurisprudencia espa&ntilde;ola, tiende a entender
dicha libertad en un sentido amplio, proviniendo las principales limitaciones
a la protecci&oacute;n al honor y la intimidad.
De hecho temas como la ingenier&iacute;a inversa, la realizaci&oacute;n de copias de
seguridad, el uso a prueba del software, etc. son concebidos en un sentido 
permisivo en tanto que est&aacute;n autorizados siempre que no lesionen los 
derechos del propietario.
<P>A partir de esta concepci&oacute;n tenemos una serie de leyes org&aacute;nicas que
acotan y definen la libertad de informaci&oacute;n:
<P>La Ley General de Telecomunicaciones, establece la libre recepci&oacute;n de
se&ntilde;ales, con independencia de su emisor. Las restricciones se aplican a los
emisores, en forma de licencias, tasas, control del modo de emisi&oacute;n, etc...
Actualmente est&aacute; en estudio la posible aplicaci&oacute;n de dicha ley a sistemas
de transmisi&oacute;n de datos tipo Internet. El problema es que la aplicaci&oacute;n de
dicha ley a un entorno transnacional es de dif&iacute;cil soluci&oacute;n. Por ello, la
Comisi&oacute;n Europea est&aacute; realizando diversos estudios sobre el tema, para 
uniformizar la legislaci&oacute;n.
Un aspecto importante de la LGT es que establece la titularidad de
las emisiones: la recepci&oacute;n de la se&ntilde;al es libre. No obstante su re-emisi&oacute;n
est&aacute; condicionada a la autorizaci&oacute;n del propietario. La aplicaci&oacute;n a la
transmisi&oacute;n de datos por Internet es obvia, y uno de los puntos claves de la
legislaci&oacute;n sobre la circulaci&oacute;n de datos por la red.
Otro aspecto es el del concepto de portador de la se&ntilde;al: se refiere 
al concepto del canal por donde circula la informaci&oacute;n. El portador debe
garantizar el "derecho de paso", y poner los medios t&eacute;cnicos para que la
se&ntilde;al llegue a su destinatario. En lenguaje Internet: el proveedor, debe
garantizar la conectividad y encaminamiento.
<P>La Ley Org&aacute;nica Reguladora del Tratamiento Automatizado de Datos
(LORTAD), no s&oacute;lo trata temas de protecci&oacute;n de la intimidad, sino de 
garant&iacute;as de integridad, autenticidad, etc. de los datos que se transfieren. 
Los temas de seguridad, criptograf&iacute;a, comunicaciones seguras, dinero en 
Internet, etc. caen bajo el paraguas de dicha ley. En este aspecto, la 
legislaci&oacute;n europea difiere grandemente entre los diversos pa&iacute;ses. Tenemos as&iacute;
el ejemplo de Francia, donde toda comunicaci&oacute;n encriptada no autorizada est&aacute;
prohibida (?), o bien pa&iacute;ses como Finlandia, donde cada uno puede hacer casi lo
que quiera. La Comisi&oacute;n Europea est&aacute; estudiando una serie de soluciones
intermedias, donde se establece una cierta libertad a cambio de restricciones 
en diversos campos. Caso especial de estudio es el de importaci&oacute;n y 
exportaci&oacute;n de t&eacute;cnicas de criptograf&iacute;a.
Otro campo de aplicaci&oacute;n es el de los contratos electr&oacute;nicos y el
intercambio electr&oacute;nico de documentaci&oacute;n. Existe una amplia normativa que
regula el comercio en Internet. Se regula el uso de firmas digitales y se
establece el concepto de emisor de certificados digitales de autenticidad.
Un &uacute;ltimo aspecto de la LORTAD, trata sobre los derechos y deberes
del propietario de las bases de datos, as&iacute; como la reglamentaci&oacute;n sobre
su uso. Diferencia entre la titularidad de la base de datos y la titularidad
de los contenidos.
<P>La ley de protecci&oacute;n al honor y la intimidad, es de aplicaci&oacute;n a los
sitios web. La pornograf&iacute;a es ilegal, y los sitios web residentes en Espa&ntilde;a
caen bajo la jurisdicci&oacute;n de las leyes espa&ntilde;olas, con independencia del usuario.
Junto con la LORTAD, se establecen cl&aacute;usulas de confidencialidad, autenticidad,
accesibilidad, etc. a los diversos datos, as&iacute; como se regula la transferencia
y compartici&oacute;n de dicha informaci&oacute;n.
Se establece el concepto de responsabilidad civil, en el sentido de
que existen responsabilidades penales por el uso indebido o falsedad en los
datos. Desgraciadamente la responsabilidad civil no est&aacute; extendida al
software, por lo que bajo la legislaci&oacute;n Espa&ntilde;ola, a&uacute;n no es posible demandar
al creador de un software err&oacute;neo, ni reclamar da&ntilde;os y perjuicios por un
funcionamiento incorrecto o impropio de un programa.
<P>Es de notar que realmente no existe ninguna ley especifica sobre 
la informaci&oacute;n en Internet. La jurisprudencia existente utiliza la legislaci&oacute;n
existente en la actualidad referente a otras &aacute;reas, lo que frecuentemente
provoca colisiones e incongruencias entre varias leyes.
<P>De especial inter&eacute;s es la Ley de Propiedad intelectual, y su aplicaci&oacute;n
al software. B&aacute;sicamente, la jurisprudencia actual parte de identificar el
concepto de producto software con el de el creaci&oacute;n literaria o art&iacute;stica: 
el software es una cosa que se utiliza como un libro: una sola persona a la 
vez en un &uacute;nico sitio. Resulta curioso el art&iacute;culo de la Ley de Contratos del
Estado, que permite a &eacute;ste utilizar software legalmente adquirido del modo que
considere m&aacute;s conveniente con independencia del uso original... esto desemboca
en licencias "campus" para universidades y organismos p&uacute;blicos.
<P>Recientes actualizaciones han incluido el concepto de software, y de
programa de ordenador. Se establece la titularidad del software, los derechos
de uso y copia. Se garantiza que el derecho de uso no conlleva la transferencia
de titularidad. Se define el concepto de licencia y las condiciones de uso
y restricci&oacute;n de uso del producto software. Especial menci&oacute;n merece el punto
donde se establece la no posibilidad de cesi&oacute;n del derecho de uso, salvo
acuerdo en contra. Esto incluye el alquiler y pr&eacute;stamo del software: es ilegal
que un v&iacute;deo-club alquile software si no tiene autorizaci&oacute;n del propietario.
<P>
<H2><A NAME="ss10.3">10.3 Legislaci&oacute;n sobre software libre.</A>
</H2>

<P>
<P>El mundo del software libre no est&aacute; citado en ninguna legislaci&oacute;n. 
El autor ha visto la perplejidad, cuando no el regocijo con que expertos en
derecho le contestaban respecto a las consultas acerca de legislaci&oacute;n sobre
el software libre. Tras la lectura de la GPL, lo m&aacute;s aproximado que se ha
encontrado sobre legislaci&oacute;n aplicable es el concepto mercantil de franquicia.
<P>La similitud, es bastante plausible: existe una marca comercial
( nombre del programa ) un propietario ( el creador o due&ntilde;o del copyright )
que establece unos derechos de uso y explotaci&oacute;n de la marca comercial
( la licencia GPL ). Existen diferencias, por supuesto, especialmente en
cuanto al uso del derecho de explotaci&oacute;n por parte de terceras personas
( redistribuci&oacute;n ). En cualquier caso se hace patente una necesidad 
fundamental en el software libre: el garantizar la titularidad del producto.
<P>Porque la &uacute;nica garant&iacute;a legal aplicable en el software libre es la
de la titularidad: es fundamental, para que el modelo de software libre
en la empresa sea viable, que dicha titularidad sea reconocida y mantenida
bajo cualquier circunstancia imaginable. El programa debe estar registrado
convenientemente, y la licencia de uso debe reflejar claramente este hecho.
<P>Aqu&iacute; se produce un hecho fundamental que diferencia la legislaci&oacute;n
europea con la Americana: el precinto que encontramos en los paquetes de
software que nos avisa de que su rotura implica la aceptaci&oacute;n de la 
licencia.... carece de validez. Nuestra legislaci&oacute;n precisa de un
contrato o una aceptaci&oacute;n expl&iacute;cita de la licencia, con conocimiento de las
dos partes. Se admite como firma del contrato la solicitud de clave de 
registro, o la introducci&oacute;n de dicha clave en el proceso de instalaci&oacute;n
o activaci&oacute;n del programa.
<P>De cara a la GPL, esto implica que su aceptaci&oacute;n debe ser explicita:
no basta con acceder y utilizar el programa para considerar que la licencia
es aceptada. Es necesario el registro para que tal licencia tenga validez
en Europa. Por ello es tan necesario el que el software libre est&eacute; 
perfectamente registrado y con el copyright vigente. Es casi imposible con
la ley en la mano perseguir un uso abusivo de un programa GPL. De hecho las
infracciones a dicha licencia son resueltas por los usuarios de la red en
forma de boycott al infractor.... lo cual suele ser mucho m&aacute;s efectivo que
la actuaci&oacute;n legal.
<P>
<H2><A NAME="ss10.4">10.4 ¿Es patentable la informaci&oacute;n?.</A>
</H2>

<P>
<P>Todo esto nos lleva al concepto mismo del software libre y de la
libertad de informaci&oacute;n: el saber qu&eacute; informaci&oacute;n est&aacute; sujeta a titularidad
y cu&aacute;l es distribu&iacute;ble. En el tema del software nos encontramos con una 
paradoja: muchas legislaciones diferencian el concepto de algoritmo del
concepto de implementaci&oacute;n, y a&ntilde;adiendo el concepto de interfaz. Seg&uacute;n
nuestra legislaci&oacute;n, s&oacute;lo la implementaci&oacute;n y el interfaz est&aacute;n sujetos 
a titularidad. La legislaci&oacute;n Americana permite tambi&eacute;n patentar algoritmos, 
mientras que en todos los casos el interfaz de programaci&oacute;n debe ser p&uacute;blico, 
entendiendo por tal publicidad el que su conocimiento -no su uso- es asequible 
a todo el mundo.
<P>Desgraciadamente, la evoluci&oacute;n de los lenguajes de programaci&oacute;n ha
hecho que muchos de ellos, no consistan sino en la descripci&oacute;n formal de un
algoritmo, ¿c&oacute;mo patentar este tipo de software?. Otro punto conflictivo 
lo constituyen los lenguajes de macros o de scripting: el ejecutable y el
c&oacute;digo fuente son una misma cosa.
<P>La legislaci&oacute;n espa&ntilde;ola solventa este problema de una forma bastante
ingeniosa: define como programa una secuencia de datos que tienen una 
funcionalidad determinada... expl&iacute;citamente incluye todo lo que acompa&ntilde;a a
dicha secuencia ( manuales, c&oacute;digo fuente, etc. ) como parte integrante del
software.
<P>Muchos autores reconocen pues que el software no es patentable -es
decir sujeto a propiedad industrial- pero s&iacute; le reconocen derecho de autor
-es decir, sujeto a propiedad intelectual-. Este es el caso de la legislaci&oacute;n
espa&ntilde;ola, pero no de la americana. En cualquier caso la discusi&oacute;n est&aacute; abierta.
<P>En concreto, las leyes espa&ntilde;olas especifican que el software s&oacute;lo
est&aacute; sujeto a propiedad intelectual, y que no es patentable ning&uacute;n producto
software, salvo que sea una implementaci&oacute;n directa de un producto patentado. 
Ejemplo t&iacute;pico: el software de desarrollo que el fabricante de un chip 
proporciona con el chip. Expl&iacute;citamente, los algoritmos, elementos
b&aacute;sicos de la estructura de un programa ( bucles, saltos, subrutinas ), y 
especialmente los API's no pueden ser patentados...
Curiosamente, tanto los API's, como los lenguajes de programaci&oacute;n
s&iacute; est&aacute;n sujetos a propiedad intelectual, y por tanto el autor puede exigir
el cobro de los derechos de uso.
<P>El software libre es el &uacute;ltimo eslab&oacute;n de la cadena: un producto
que s&oacute;lo est&aacute; sujeto a titularidad y cuya licencia permite el libre uso y
distribuci&oacute;n. Dada la "excentricidad" de este planteamiento no es de extra&ntilde;ar 
la falta de legislaci&oacute;n. Es de esperar que a medida que el uso de Internet 
como medio de intercambio de informaci&oacute;n, junto con la evoluci&oacute;n del concepto 
de "programa", vaya surgiendo una legislaci&oacute;n apropiada.
<P>Un &uacute;ltimo punto: del hecho de que el software libre s&oacute;lo est&eacute;
sujeto a titularidad, implica que los costes de dicho software deben derivarse
de los derechos de autor -que en el software libre, y por cuestiones de simple
supervivencia del proyecto, son nulos- , y de los costes de producci&oacute;n y 
distribuci&oacute;n.  No tiene sentido cobrar por patentes, derechos empresariales, 
licencias de uso o desarrollo, etc...  Extrapolando dicho hecho, el IVA 
aplicable al software libre deber&iacute;a ser el correspondiente, no a productos 
industriales, sino al de libros y documentaci&oacute;n... que Hacienda tome nota :-)
<P>En los ap&eacute;ndices, el lector podr&aacute; encontrar referencias a los diversos
modelos de licencia de software libre, as&iacute; como las leyes y directivas que
se aplican al software.
<P>[JAMC: a&ntilde;adir problem&aacute;tica de la documentaci&oacute;n libre ]
<P>
<HR>
<A HREF="La_empresa_ante_el_software_libre-11.html">Página siguiente</A>
<A HREF="La_empresa_ante_el_software_libre-9.html">Página anterior</A>
<A HREF="La_empresa_ante_el_software_libre.html#toc10">Índice general</A>
</BODY>
</HTML>
