<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Utilizando servicios Internet con direcciones IP din&aacute;micas</TITLE>
 <LINK HREF="PPP-Como-22.html" REL=next>
 <LINK HREF="PPP-Como-20.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc21" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-22.html">Página siguiente</A>
<A HREF="PPP-Como-20.html">Página anterior</A>
<A HREF="PPP-Como.html#toc21">Índice general</A>
<HR>
<H2><A NAME="dynamic-server"></A> <A NAME="s21">21. Utilizando servicios Internet con direcciones IP din&aacute;micas</A></H2>

<P>Si est&aacute; utilizando direcciones IP din&aacute;micas (y muchos proovedores s&oacute;lo le
dar&aacute;n una direcci&oacute;n IP din&aacute;mica a menos que pague mucho m&aacute;s por su
conexi&oacute;n), entonces deber&aacute; reconocer las limitaciones que esto impone.
<P>
<P>Antes de nada, las peticiones de servicio hacia fuera funcionar&aacute;n. Esto es,
podr&aacute; enviar mensajes utilizando sendmail (siempre que tenga bien
configurado sendmail), enviar/recibir ficheros v&iacute;a ftp, hacer finger a
usuarios en otras m&aacute;quinas, navegar por la Web, etc.
<P>
<P>En particular, puede responder al correo electr&oacute;nico que haya recibido en su
m&aacute;quina aunque est&eacute; desconectado. El correo simplemente esperar&aacute; en su
cola de mensajes hasta que vuelva a conectarse con su ISP.
<P>
<P>Sin embargo, su m&aacute;quina NO est&aacute; conectada a Internet las 24 horas del d&iacute;a,
ni tiene la misma IP cada vez que se conecta. Por lo que es imposible que
reciba correo direccionado a su m&aacute;quina, y muy dif&iacute;cil configurar un
servidor web o ftp de manera que sus amigos puedan acceder. 
<P>Por lo menos, en lo que a Internet se refiere, su m&aacute;quina no es una &uacute;nica
m&aacute;quina contactable permanentemente ya que no tiene una &uacute;nica direcci&oacute;n IP
(recuerde - otras m&aacute;quinas utilizar&aacute;n la misma direcci&oacute;n IP que usted ha
utilizado alguna otra vez).
<P>
<P>Si configura un servidor Web (u otro servidor), ser&aacute; completamente
desconocido por otro usuario en la Red A MENOS QUE sepan que su m&aacute;quina est&aacute;
conectada y su direcci&oacute;n IP actual. Hay un n&uacute;mero de modos de los que pueden
conseguir esta informaci&oacute;n, que abarcan desde que usted les llame, les env&iacute;e
un correo electr&oacute;nico o utilice ficheros ".plan" en una cuenta shell en su
proovedor de servicios (siempre y cuando su proovedor permita el acceso a
shell y finger).
<P>
<P>Pero, para la mayor&iacute;a de los usuarios, este no es un problema. Lo que la
mayor&iacute;a de la gente quiere es recibir y enviar correo (utilizando su cuenta
en su proovedor de servicios) y hacer conexiones a servidores externos WWW,
ftp en Internet. Si DEBE permitir conexiones internas, deber&iacute;a conseguir una
IP est&aacute;tica. De manera alternativa puede explorar los m&eacute;todos comentados
anteriormente...
<P>
<H2><A NAME="ss21.1">21.1 Configurar el correo electr&oacute;nico</A>
</H2>

<P>Incluso para direcciones IP din&aacute;micas, puede configurar sendmail en su
m&aacute;quina para que env&iacute;e hacia afuera cualquier correo que escriba localmente.
La configuraci&oacute;n de sendmail puede ser oscura y dif&iacute;cil - por lo que este
documento no intentar&aacute; decir c&oacute;mo hacer esto. Sin embargo, deber&iacute;a
configurar sendmail para que su proovedor de servicios Internet sea
designado como su m&aacute;quina "smart relay" (la opci&oacute;n <B>DS</B> de
<CODE>sendmail.cf</CODE>. (Para m&aacute;s informaci&oacute;n acerca de la configuraci&oacute;n de
sendmail, lea los documentos sendmail - y mire las configuraciones m4 que
vienen con sendmail. Casi seguro que haya una acorde con sus necesidades).
<P>
<P>Hay tambi&eacute;n libros excelentes sobre Sendmail (como la "biblia" de O'Reilly
and Associates), pero es casi seguro que sobrecargar&iacute;an al la mayor parte de
los usuarios.
<P>
<P>Una vez que tiene sendmail configurado, probablemente desee que sendmail
mande todos los mensajes que han estado esperando en la cola de salida de
mensajes tan pronto como la conexi&oacute;n se efect&uacute;e. Para hacer esto, a&ntilde;ada la
orden
<P>
<BLOCKQUOTE><CODE>
<PRE>
sendmail -q &amp;
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>a su script /etc/ppp/ip-up (ver m&aacute;s abajo).
<P>
<P>La recepci&oacute;n de correo es un problema para las direcciones IP din&aacute;micas.
La manera de configurar esto es:-
<UL>
<LI>configurar su programa gestor de correo de manera que todos los
mensajes enviados salgan con una cabecera "reply to" direccionada a su
direcci&oacute;n de correo en el proovedor.<BR>
Si puede, podr&iacute;a tambi&eacute;n ajustar su direcci&oacute;n FROM para que sea tambi&eacute;n la
su direcci&oacute;n en su ISP.
</LI>
<LI>usar los programas popclient y fetchmail para descargar el correo de
su proovedor de servicios. De manera alternativa, si su ISP utiliza IMAP,
usted puede usar un gestor de correo con soporte IMAP (como por ejemplo,
pine).</LI>
</UL>
<P>
<P>Puede automatizar este proceso en el momento de conexi&oacute;n poniendo las
&oacute;rdenes necesarios en el script <CODE>/etc/ppp/ip-up</CODE> (ver m&aacute;s abajo).
<P>
<H2><A NAME="ss21.2">21.2 Configurar un servidor de nombres local</A>
</H2>

<P>Aunque usted pueda utilizar f&aacute;cilmente los servidores de nombres localizados
en su ISP, puede tambi&eacute;n instalar un servidor de nombres local de cach&eacute;
(secundario) que sea iniciado en el script ip-up. La ventaja de ejecutar un
servidor de nombres local (de cach&eacute;) es que le ahorrar&aacute; tiempo (y ancho de
banda) si contacta frecuentemente con las mismas m&aacute;quinas durante una sesi&oacute;n
de larga duraci&oacute;n.
<P>
<P>La configuraci&oacute;n DNS para un servidor de nombres cach&eacute; (que utiliza una
linea "forwarders" en el fichero named.boot que apunta al servidor de
nombres de su ISP) es relativamente simple. El libro de O'Really (DNS and
Bind) explica todo lo que desea saber sobre esto.
<P>
<P>Hay tambi&eacute;n un DNS-COMO disponible.
<P>
<P>
<P>Si est&aacute; ejecutando una peque&ntilde;a red local que permita el acceso a Internet a
trav&eacute;s de su PC Linux (utilizando enmascaramiento IP, por ejemplo), puede
que sea una buena idea ejecutar un servidor de nombres local (con una
directiva forwarders) aunque la conexi&oacute;n est&eacute; activada, ya que esto
minimizar&aacute; el ancho de banda y los retardos asociados a la resoluci&oacute;n de
nombres.
<P>
<P>Un consejo de cortes&iacute;a: pida permiso a su ISP antes de empezar a usar un
servidor de nombres secundario de cach&eacute; en el dominio de su servidor. Si
est&aacute; bien configurado, su servidor de nombres no causar&aacute; ning&uacute;n problema a
su ISP, pero si las cosas van mal, puede causar problemas.
<P>
<P>
<P>
<HR>
<A HREF="PPP-Como-22.html">Página siguiente</A>
<A HREF="PPP-Como-20.html">Página anterior</A>
<A HREF="PPP-Como.html#toc21">Índice general</A>
</BODY>
</HTML>
