<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Estableciendo la conexi&oacute;n PPP de manera manual</TITLE>
 <LINK HREF="PPP-Como-15.html" REL=next>
 <LINK HREF="PPP-Como-13.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc14" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-15.html">Página siguiente</A>
<A HREF="PPP-Como-13.html">Página anterior</A>
<A HREF="PPP-Como.html#toc14">Índice general</A>
<HR>
<H2><A NAME="manual"></A> <A NAME="s14">14. Estableciendo la conexi&oacute;n PPP de manera manual</A></H2>

<P>Ahora que ha creado sus ficheros <CODE>/etc/ppp/options</CODE> y
<CODE>/etc/resolv.conf</CODE> (y, si son necesarios, el fichero
<CODE>/etc/ppp/pap|chap-secrets</CODE>), puede probar la configuraci&oacute;n
manualmente estableciendo una conexi&oacute;n PPP. (Una vez que tengamos
funcionando la conexi&oacute;n manual, automatizaremos el proceso).
<P>
<P>Para hacer esto, su software de comunicaciones debe ser capaz de salir sin
reiniciar el m&oacute;dem. Minicom puede hacer esto - ALT Q (o en versiones m&aacute;s
antiguas CTRL A Q).
<P>
<P>Aseg&uacute;rese de tener una cuenta de root abierta.
<P>
<P>Arranque su software de comunicacions (como minicom), marque el tel&eacute;fono del
servidor PPP y entre en el sistema como suele hacer. Si necesita ejecutar una
orden para hacer que se inicie el servidor PPP, h&aacute;galo. Ver&aacute; aparecer los
caracteres sin sentido que vio antes.
<P>
<P>Si est&aacute; utilizando pap o chap, entonces simplemente conectandose al sistema
remoto se iniciar&aacute; ppp en el servidor y podr&aacute; ver los caracteres sin sentido
sin ni siquiera haber entrado en el sistema (aunque esto no sucede en
algunos servidores - pruebe a pulsar <B>Enter</B> para que los caracteres sin
sentido comiencen a mostrarse).
<P>
<P>Salga del programa de comunicaciones <EM>sin reiniciar el m&oacute;dem</EM> (ALT Q o
CTL A Q en minicom) y, en la l&iacute;nea de &oacute;rdenes de Linux (como root) teclee
<P>
<HR>
<PRE>
pppd -d -detach /dev/ttySx 38400 &amp;
</PRE>
<HR>
<P>
<P>La opci&oacute;n -d conecta el modo de depuraci&oacute;n - la conversaci&oacute;n de
inicializaci&oacute;n de la conexi&oacute;n ppp se enviar&aacute; al registro del sistema - lo
cual es &uacute;til si se tienen problemas.
<P>
<P>Las luces de su m&oacute;dem deber&iacute;an parpadear mientras se establece la conexi&oacute;n
PPP. Realizar la conexi&oacute;n PPP tardar&aacute; un breve rato.
<P>
<P>En ese momento puede mirar a la interfaz PPP, tecleando la orden
<P>
<HR>
<PRE>
ifconfig
</PRE>
<HR>
<P>
<P>
<P>Adem&aacute;s de cualquier dispositivo Ethernet y de bucle que posea, ver&aacute; algo
como :-
<P>
<HR>
<PRE>
ppp0     Link encap:Point-Point Protocol
         inet addr:10.144.153.104  P-t-P:10.144.153.51 Mask:255.255.255.0
         UP POINTOPOINT RUNNING  MTU:552  Metric:1
         RX packets:0 errors:0 dropped:0 overruns:0
         TX packets:0 errors:0 dropped:0 overruns:0
</PRE>
<HR>
<P>
<P>Donde
<UL>
<LI>inet addr:10.144.153.10 es la direcci&oacute;n IP de su lado de la conexi&oacute;n.</LI>
<LI>P-t-P:10.144.153.5 es la direcci&oacute;n IP del SERVIDOR.</LI>
</UL>
<P>(Naturalmente, ifconfig no informar&aacute; estas mismas direcciones IP, pero
mostrar&aacute; las de su servidor PPP.)
<P>
<P>Nota: ifconfig tambi&eacute;n notifica que el enlace esta ACTIVO y EJECUT&Aacute;NDOSE.
<P>
<P>
<P>Si no hay ning&uacute;n dispositivo ppp listado o hay algo como
<P>
<HR>
<PRE>
ppp0     Link encap:Point-Point Protocol
         inet addr:0.0.0.0  P-t-P:0.0.0.0  Mask:0.0.0.0
         POINTOPOINT  MTU:1500  Metric:1
         RX packets:0 errors:0 dropped:0 overruns:0
         TX packets:0 errors:0 dropped:0 overruns:0
</PRE>
<HR>
<P>
<P>la conexi&oacute;n PPP no ha sido realizada... Vea la &uacute;ltima secci&oacute;n acerca de la
depuraci&oacute;n.
<P>
<P>Tambi&eacute;n deber&iacute;a poder ver un camino a la m&aacute;quina remota (y m&aacute;s all&aacute;). Para
hacer esto, teclee la orden
<P>
<HR>
<PRE>
route -n
</PRE>
<HR>
<P>
<P>Deber&iacute;a ver algo como esto:-
<P>
<HR>
<PRE>
Kernel routing table
Destination     Gateway         Genmask         Flags MSS    Window Use Iface
10.144.153.3    *               255.255.255.255 UH    1500   0        1 ppp0
127.0.0.0       *               255.0.0.0       U     3584   0       11 lo
10.0.0.0        *               255.0.0.0       U     1500   0       35 eth0
default         10.144.153.3    *               UG    1500   0        5 ppp0
</PRE>
<HR>
<P>
<P>Aqu&iacute; hay algo de bastante importancia: d&eacute;se cuenta de que hay DOS entradas
apuntando a su interfaz ppp.
<P>
<P>La primera es un camino HOST (indicada por la marca H) y que nos permite ver
la m&aacute;quina a la que estamos conectados, pero no m&aacute;s all&aacute;.
<P>
<P>La segunda es el camino por defecto (establecido al dar a pppd la opci&oacute;n
<CODE>defaultroute</CODE>. Este es el camino que dice a nuestro PC Linux que env&iacute;e
cualquier paquete NO destinado a las redes locales - para las que tenemos
caminos espec&iacute;ficos - al propio servidor PPP. El servidor PPP es entonces
responsable de encaminar nuestros paquetes a internet y de traernos los
paquetes que vengan hacia nosotros.
<P>
<P>Si no ve una tabla de encaminamiento con dos entradas, algo va mal. En
particular si su registro de sistema muestra un mensaje diciendo que ppd 
no est&aacute; reemplazando ning&uacute;n camino existente por defect, cuando tiene un
camino por defecto apuntando a su interfaz Ethernet - el cual <B>DEBE</B> ser
reemplazado por un camino espec&iacute;fica de red: <B>S&Oacute;LO PUEDE TENER UN CAMINO
POR DEFECTO</B>.
<P>
<P>Necesitar&aacute; explorar los ficheros de inicializaci&oacute;n de su sistema para
averiguar d&oacute;nde se establece la ruta por defecto (usar&aacute; una orden
<CODE>route add default...</CODE>). C&aacute;mbielo a algo como <CODE>route add net...</CODE>.
<P>
<P>Ahora probemos el enlace haciendo pings a la direcci&oacute;n IP del servidor, tal
y como se nos informa en la salida de ifconfig, por ejemplo:
<P>
<HR>
<PRE>
ping 10.144.153.51
</PRE>
<HR>
<P>
<P>Deber&iacute;a recibir mensajes como
<P>
<HR>
<PRE>
PING 10.144.153.51 (10.144.153.51): 56 data bytes
64 bytes from 10.144.153.51: icmp_seq=0 ttl=255 time=328.3 ms
64 bytes from 10.144.153.51: icmp_seq=1 ttl=255 time=190.5 ms
64 bytes from 10.144.153.51: icmp_seq=2 ttl=255 time=187.5 ms
64 bytes from 10.144.153.51: icmp_seq=3 ttl=255 time=170.7 ms
</PRE>
<HR>
<P>
<P>Esta lista podr&iacute;a durar indefinidamente. Para pararla utilice CTRL C, en ese
momento recibir&aacute; algo m&aacute;s de informaci&oacute;n :-
<P>
<HR>
<PRE>
--- 10.144.153.51 ping statistics ---
4 packets transmitted, 4 packets received, 0% packet loss
round-trip min/avg/max = 170.7/219.2/328.3 ms
</PRE>
<HR>
<P>
<P>Hasta ahora la cosa va bien.
<P>
<P>Ahora intentemos hacer un ping a un sitio por nombre (que no sea el propio
nombre del servidor, pero que sea de una m&aacute;quina que usted SEPA est&eacute;
encendida y funcionando). Por ejemplo
<P>
<HR>
<PRE>
ping sunsite.unc.edu
</PRE>
<HR>
<P>
<P>En ese momento habr&aacute; una pausa mientras Linux obtiene del servidor de
nombres que usted especific&oacute; en <CODE>/etc/resolv.conf</CODE> la direcci&oacute;n IP 
correspondiente al nombre de la m&aacute;quina a la que ha hecho un ping. No se
preocupe por la espera (ver&aacute; que las luces del m&oacute;dem parpadean). En breve
plazo recibir&aacute; una respuesta como
<P>
<HR>
<PRE>
 PING sunsite.unc.edu (152.2.254.81): 56 data bytes
64 bytes from 152.2.254.81: icmp_seq=0 ttl=254 time=190.1 ms
64 bytes from 152.2.254.81: icmp_seq=1 ttl=254 time=180.6 ms
64 bytes from 152.2.254.81: icmp_seq=2 ttl=254 time=169.8 ms
64 bytes from 152.2.254.81: icmp_seq=3 ttl=254 time=170.6 ms
64 bytes from 152.2.254.81: icmp_seq=4 ttl=254 time=170.6 ms
</PRE>
<HR>
<P>
<P>De nuevo, pare la salida pulsando CTRL C y consiga las estad&iacute;sticas...
<P>
<HR>
<PRE>
--- sunsite.unc.edu ping statistics ---
5 packets transmitted, 5 packets received, 0% packet loss
round-trip min/avg/max = 169.8/176.3/190.1 ms
</PRE>
<HR>
<P>
<P>Si no consigue respuesta, intente hacer un ping a la direcci&oacute;n IP del
servidor de nombres de su ISP. Si recibe respuesta, entonces puede que tenga
un problema con su <CODE>/etc/resolv.conf</CODE>.
<P>
<P>Si no funciona, hay un problema de encaminamiento, o su ISP tien un problema
a la hora de devolverle a usted los paquetes. Compruebe su tabla de
encaminamiento tal y como se describi&oacute; m&aacute;s arriba, y si todo est&aacute; bien,
contacte con su ISP. Una buena manera de probar si su ISP funciona es
utilizar otro sistema operativo para conectar. Si puede conectar a su ISP
con ese otro sistema, entonces el problema ser&aacute; de usted.
<P>
<P>Si todo funciona, corte la conexi&oacute;n tecleando
<P>
<HR>
<PRE>
ppp-off
</PRE>
<HR>
<P>
<P>Tras una breve pausa, el m&oacute;dem colgar&aacute;.
<P>
<P>Si eso no funciona, apague su m&oacute;dem o arranque su programa de comunicaciones
e interrumpa el m&oacute;dem con +++ y luego cuelgue con ATH0 cuando reciba la
notificaci&oacute;n del m&oacute;dem OK.
<P>
<P>Puede que tambi&eacute;n necesite eliminar el fichero de bloqueo creado por pppd
<HR>
<PRE>
rm -f /var/lock/LCK..ttySx
</PRE>
<HR>
<P>
<HR>
<A HREF="PPP-Como-15.html">Página siguiente</A>
<A HREF="PPP-Como-13.html">Página anterior</A>
<A HREF="PPP-Como.html#toc14">Índice general</A>
</BODY>
</HTML>
