<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Conseguir la informaci&oacute;n requerida del servidor PPP</TITLE>
 <LINK HREF="PPP-Como-9.html" REL=next>
 <LINK HREF="PPP-Como-7.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc8" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-9.html">Página siguiente</A>
<A HREF="PPP-Como-7.html">Página anterior</A>
<A HREF="PPP-Como.html#toc8">Índice general</A>
<HR>
<H2><A NAME="Server info"></A> <A NAME="s8">8. Conseguir la informaci&oacute;n requerida del servidor PPP</A></H2>

<P>Antes de que pueda establecer una conexi&oacute;n PPP con un servidor, necesita
obtener la siguiente informaci&oacute;n (del administrador de sistema o de la 
gente de servicio t&eacute;cnico al usuario del servidor PPP):-
<P>
<UL>
<LI>El n&uacute;mero de telefono a marcar para ese servicio<BR>
Si se encuentra detr&aacute;s de una centralita, deber&aacute; marcar el n&uacute;mero de la
centralita que le permite tener acceso exterior. Este suele ser el cero (0) 
o el nueve (9).
</LI>
<LI> ¿Usa el servidor direcciones IP DIN&Aacute;MICAS O EST&Aacute;TICAS?<BR>
Si el servidor utiliza direcciones IP EST&Aacute;TICAS, entonces pude que necesite 
saber qu&eacute; direcci&oacute;n IP utilizar para su parte de la conexi&oacute;n PPP. Si su ISP 
le proporciona un conjunto de direcciones IP v&aacute;lidas, necesitar&aacute; saber qu&eacute; 
direcciones IP puede utilizar y tambi&eacute;n necesitar&aacute; saber cu&aacute;l es la m&aacute;scara 
de red (netmask)<BR>

La mayor&iacute;a de los Proovedores de Servicio de Internet usan direcciones IP
DIN&Aacute;MICAS. Tal y como se mencion&oacute; antes, esto provoca que algunos servicios
no puedan utilizarse en su plena potencia.<BR>

Sin embargo, incluso si usted utiliza direcciones IP EST&Aacute;TICAS, la mayor&iacute;a
de los servidores PPP nunca permitir&aacute;n al cliente especificar una direcci&oacute;n
IP, ya que esto es un agujero de seguridad. Por ello, usted <B>debe</B> saber qu&eacute;
direcci&oacute;n le ser&aacute; asignada.
</LI>
<LI>¿Qu&eacute; son las direcciones IP de los servidores de nombres de dominio de
los ISPs?<BR>

Deber&iacute;a haber al menos dos, aunque s&oacute;lo se necesita una.<BR>

Aqu&iacute; podr&iacute;a haber un problema. La configuraci&oacute;n PPP de MS Windows 95 permite
que la direcci&oacute;n del servidor de nombres se transmita al cliente como parte
del proceso de conexi&oacute;n. Por lo que su ISP (o la mesa de informaci&oacute;n de su
empresa) puede decirle que usted no necesita saber la direcci&oacute;n IP del
servidor de nombres.<BR>

En Linux, usted <B>NECESITA</B> conocer la direcci&oacute;n de al menos un servidor
de nombres. La implementaci&oacute;n de PPP para Linux no permite la configuraci&oacute;n
durante la conexi&oacute;n de la direcci&oacute;n del servidor de nombres - y es bastante
posible que nunca lo haga.<BR>

<B>Nota</B>: aunque Linux (como cliente PPP) no puede aceptar la
direcci&oacute;n del servidor de nombres transmitida desde un servidor, sin
embargo, cuando act&uacute;a como servidor, puede pasar esta informaci&oacute;n a clientes
utilizando la opci&oacute;n de pppd <CODE>dns-addr</CODE>.
</LI>
<LI>¿Requiere el servidor el uso de PAP/CHAP?<BR>
Este es el caso en que se necesita saber las "id" y "secret" a usar durante
la conexi&oacute;n. (Estas son, probablemente, su nombre de usuario y clave en el
ISP).
</LI>
<LI>¿El servidor inicia PPP autom&aacute;ticamente o debe enviarle &oacute;rdenes para
que inicie PPP una vez que se ha conectado?<BR>
Si debe utilizar una orden para iniciar PPP, ¿cu&aacute;l es?
</LI>
<LI>¿Es el servidor un sistema MS Windows NT? Si lo es, ¿utiliza el
sistema MS PAP/CHAP?<BR>
Muchas redes corporativas utilizan MS Windows NT de esta manera para,
parece, incrementar la seguridad.</LI>
</UL>
<P>
<P>Apunte cuidadosamente esta informaci&oacute;n - ¡va a necesitarla!
<P>
<HR>
<A HREF="PPP-Como-9.html">Página siguiente</A>
<A HREF="PPP-Como-7.html">Página anterior</A>
<A HREF="PPP-Como.html#toc8">Índice general</A>
</BODY>
</HTML>
