<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Problemas comunes una vez que el enlace funciona</TITLE>
 <LINK HREF="PPP-Como-21.html" REL=next>
 <LINK HREF="PPP-Como-19.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc20" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-21.html">Página siguiente</A>
<A HREF="PPP-Como-19.html">Página anterior</A>
<A HREF="PPP-Como.html#toc20">Índice general</A>
<HR>
<H2><A NAME="s20">20. Problemas comunes una vez que el enlace funciona</A></H2>

<P>Un problema que puede encontrarse es que muchos proovedores s&oacute;lo dan
servicio t&eacute;cnico al paquete de programas que distribuyen con las nuevas
cuentas. Esto es (t&iacute;picamente) para Microsoft Windows :-( - y muchos
servicios de ayuda de ISPs no parecen saber nada acerca de Unix (ni sobre
Linux). Por lo tanto, prep&aacute;rese a recibir una asistencia limitada por su
parte.
<P>
<P>Siempre podr&iacute;a hacer a todos un favor y mostrarles el funcionamiento de
Linux (cualquier persona de un servicio t&eacute;cnico deber&iacute;a estar al d&iacute;a en
t&eacute;rminos de Internet y eso quiere decir que deber&iacute;a tener un ordenador con
Linux en casa).
<P>
<H2><A NAME="ss20.1">20.1 No puedo ver m&aacute;s all&aacute; del servidor PPP con el que me conecto</A>
</H2>

<P>Bien - su conexi&oacute;n PPP est&aacute; establecida y ejecut&aacute;ndose y puede hacer ping al
servidor PPP por direcci&oacute;n IP (la segunda direcci&oacute;n IP (remota) mostrada por
<CODE>ifconfig ppp0</CODE>), pero no puede alcanzar nada m&aacute;s all&aacute; de esto.
<P>
<P>Antes de nada, intente hacer un ping a las direcciones IP especificadas en
/etc/resolv.conf como servidores de nombres. Si funciona, usted <B>puede</B>
ver m&aacute;s alla de su servidor PPP (a menos que tenga la misma direcci&oacute;n IP que
la direcci&oacute;n IP remota para su conexi&oacute;n). Ahora intentemos hacer un ping al
nombre completo de Internet de su proovedor de servicios. Por ejemplo
<P>
<BLOCKQUOTE><CODE>
<PRE>
ping mi.proveedor.net.au
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>Si NO funciona, tiene un problema con la resoluci&oacute;n de nombres.
Probablemente por un error tipogr&aacute;fico en su /etc/resolv.conf. Compruebe
este cuidadosamente con la informaci&oacute;n que ha adquirido al telefonear a su
proovedor de servicio. Si todo tiene buen aspecto, telefonee a su proovedor
de servicio y compruebe que anot&oacute; los n&uacute;meros IP correctamente.
<P>
<P>Si SIGUE sin funcionar (y su proovedor confirma que tiene sus servidores de
nombres encendidos y funcionando), usted tendr&aacute; un problema en alg&uacute;n otro
sitio - le sugioero que compruebe cuidadosamente su instalaci&oacute;n Linux
(examinando particularmente los permisos de los ficheros).
<P>
<P>Si sigue sin poder hacer ping a los servidores de nombres de su proovedor
mediante direcci&oacute;n IP, o est&aacute;n apagados (haga una llamada telef&oacute;nica y
compruebelo) o hay un problema de encaminamiento en la parte de su
proovedor. De nuevo, ll&aacute;meles y compru&eacute;belo.
<P>
<P>Una posibilidad es que la parte remota sea un servidor PPP Linux en la que
la opci&oacute;n de reenv&iacute;o de IPs no haya sido especificada en le n&uacute;cleo.
<P>
<P>Una buena prueba general es intentar conectar con su proovedor utilizando el
software que deben haber suminstrado para (cielos) Microsoft Windows. Si
todo funciona desde otro sistema operativo con la misma cuenta, entonces el
problema es con su sistema Linux, y NO con su proovedor de servicios.
<P>
<H2><A NAME="ss20.2">20.2 Puedo enviar mensajes, pero no recibirlos</A>
</H2>

<P>Si utiliza direcci&oacute;n IP din&aacute;mica, esto es perfectamente normal. Vea
"Configurar los servicios" m&aacute;s abajo.
<P>
<H2><A NAME="ss20.3">20.3 ¿Por qu&eacute; la gente no puede hacer finger, WWW, gopher, talk... a mi</A>
m&aacute;quina?</H2>

<P>De nuevo, si est&aacute; utilizando direcciones IP din&aacute;micas, esto es perfectamente
normal. Vea "Configurando servicios" m&aacute;s abajo.
<P>
<P>
<HR>
<A HREF="PPP-Como-21.html">Página siguiente</A>
<A HREF="PPP-Como-19.html">Página anterior</A>
<A HREF="PPP-Como.html#toc20">Índice general</A>
</BODY>
</HTML>
