<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Utilizar PPP a trav&eacute;s de una conexi&oacute;n m&oacute;dem nulo (serie directa)</TITLE>
 <LINK HREF="PPP-Como-26.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc27" REL=contents>
</HEAD>
<BODY>
Página siguiente
<A HREF="PPP-Como-26.html">Página anterior</A>
<A HREF="PPP-Como.html#toc27">Índice general</A>
<HR>
<H2><A NAME="direct"></A> <A NAME="s27">27. Utilizar PPP a trav&eacute;s de una conexi&oacute;n m&oacute;dem nulo (serie directa)</A></H2>

<P>Esto es muy simple - no hay m&oacute;dem por ah&iacute; por lo que las cosas son mucho m&aacute;s
sencillas.
<P>
<P>Primero, escoja una de las m&aacute;quinas como servidor, estableciendo un getty en
el puerto serie de manera que pueda probar que tiene conectividad al
utilizar minicom para acceder al puerto serie del cliente.
<P>
<P>Una vez que tenga esto funcionando, puede eliminar el getty A MENOS que
desee asegurarse de que la conexi&oacute;n se valida utilizando el par
nombre/contrase&ntilde;a para una conexi&oacute;n por marcado. Ya que tiene control f&iacute;sico
de ambas m&aacute;quinas, presumir&eacute; de que NO desea hacer esto.
<P>
<P>Ahora, en el servidor, elimine getty y aseg&uacute;rese de que tiene puertos serie
en ambas m&aacute;quinas configurados correctamente utilizando "setseral".
<P>
<P>Todo lo que necesita saber es ejecutar pppd en ambos sistemas. Asumir&eacute; que
la conexi&oacute;n utiliza /dev/ttyS3 en ambas m&aacute;quinas. Por lo tanto, en ambas
m&aacute;quinas ejecutar&eacute; la orden:-
<P>
<HR>
<PRE>
pppd -detach crtscts lock &lt;local IP>:&lt;remote IP> /dev/ttyS3 38400 &amp;
</PRE>
<HR>
<P>
<P>Esto crear&aacute; la conexi&oacute;n - pero todav&iacute;a no habr&aacute; especificado ning&uacute;n
encaminamiento. Puede probar a hacer un ping a y desde cada m&aacute;quina. Si esto
funciona, corte la conexi&oacute;n matando uno de los dos procesos pppd.
<P>
<P>El encaminamiento que necesita depender&aacute; de qu&eacute; es lo que est&aacute; intentando
hacer exactamente. Generalmente, una de las m&aacute;quinas se conectar&aacute; a una
Ethernet (y m&aacute;s alla), y por lo tanto, el encaminamiento requerido es,
exactamente, el mismo para el servidor PPP que para el cliente.
<P>
<P>Por lo que en la m&aacute;quina equipada con Ethernet, la orden pppd ser&iacute;a
<P>
<HR>
<PRE>
pppd -detach crtscts lock proxyarp &lt;local IP>:&lt;remote IP> /dev/ttyS3 38400 &amp;
</PRE>
<HR>
<P>
<P>y en la otra m&aacute;quina
<P>
<HR>
<PRE>
pppd -detach crtscts lock defaultroute &lt;local IP>:&lt;remote IP> /dev/ttyS3
38400 &amp;
</PRE>
<HR>
<P>Si est&aacute; enlazando dos redes (utilizando una conexi&oacute;n serie) o tiene unas
necesidades de encaminamiento m&aacute;s complejas, puede utilizar /etc/ppp/ip-up
ex&aacute;ctamente de la misma manera que se mencion&oacute; en este documento.
<P>
<P>
<P>
<P><B>Robert Hart</B><BR>
Port Hedland, Australia Occidental<BR>
Melbourne, Victoria, Australia
Agosto/Octubre 1996
Enero/Marzo 1997
<P>
<P>Traducci&oacute;n: <B>David Mar&iacute;n Carre&ntilde;o</B><BR>
Madrid, Espa&ntilde;a
Febrero 1999
<P>
<HR>
Página siguiente
<A HREF="PPP-Como-26.html">Página anterior</A>
<A HREF="PPP-Como.html#toc27">Índice general</A>
</BODY>
</HTML>
