<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Direcciones IP</TITLE>
 <LINK HREF="PPP-Como-3.html" REL=next>
 <LINK HREF="PPP-Como-1.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-3.html">Página siguiente</A>
<A HREF="PPP-Como-1.html">Página anterior</A>
<A HREF="PPP-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2. Direcciones IP</A></H2>

<P>Cualquier dispositivo que se conecta a Internet debe tener su propia y
&uacute;nica direcci&oacute;n IP. Estas son asignadas en cada pa&iacute;s por una autoridad
central.
<P>
<P>Si est&aacute; conectando una red de &aacute;rea local (LAN) a Internet, <B>DEBE</B> usar
una direcci&oacute;n IP de alcance local para todos y cada uno de los
dispositivos que tenga en la red. <B>NO DEBE</B> inventarse direcciones IP y
usarlas al conectarse con otra RED (aunque no sea Internet). Lo peor que
puede pasar es que simplemente nada funcione y el sistema se caiga al
comenzar a interferir su n&uacute;mero IP 'robado' con las comunicaciones de otra
m&aacute;quina que ya se encontraba usando el n&uacute;mero IP que se acaba de inventar.
<P>
<P>Dese cuenta de que las direcciones IP utilizadas a lo largo de este
documento (con algunas excepciones) son direcciones de "red
no conectada" que est&aacute;n reservadas para su uso en redes que no est&aacute;n
(jam&aacute;s) conectadas a la red de redes.
<P>
<P>Estas son las direcciones IP que est&aacute;n espec&iacute;ficamente reservadas para
redes locales no conectadas a Internet (tambi&eacute;n llamadas redes privadas).
Las direcciones IP son:-
<P>
<UL>
<LI>Direcci&oacute;n de red clase uno A<BR>
10.0.0.0 (m&aacute;scara de red 255.0.0.0)</LI>
<LI>Direcciones de red clase 16 B<BR>
172.16.0.0 - 172.31.0.0 (m&aacute;scara de red 255.255.0.0)</LI>
<LI>Direcciones de red clase 256 C<BR>
192.168.0.0 - 192.168.255.0 (m&aacute;scara de red 255.255.255.0)</LI>
</UL>
<P>
<P>Si tiene una red local <B>sin</B> direcciones IP reservadas por la
autoridad responsable en su pa&iacute;s, deber&iacute;a utilizar para sus m&aacute;quinas uno
de estos tipos de direcciones.
<P>
<P>Estos n&uacute;meros <B>nunca</B> deben ser utilizados en Internet.
<P>
<P>Sin embargo, pueden usarse para la Ethernet local en una m&aacute;quina que est&aacute;
conectada a Internet. Esto es porque las direcciones IP se refieren a
interfaces de red, no a ordenadores. Su interfaz Ethernet puede usar
10.0.0.1 (por ejemplo), mas cuando se conecte a Internet usando PPP, su
interfaz PPP conseguir&aacute; del servidor otra direcci&oacute;n IP (que s&iacute; ser&aacute;
v&aacute;lida). Su PC tendr&aacute; conectividad Internet, pero los otros ordenadores de
su red no.
<P>
<P>Sin embargo, usando Linux, gracias a su capacidad para enmascaramiento de
IP (tambi&eacute;n conocido como NAT - Traducci&oacute;n de direcciones de red) y
mediante el software ipfwadm, podr&aacute; conectar su red local a Internet (con
alguna restricci&oacute;n de servicios), incluso sin llegar a tener direcciones
IP v&aacute;lidas para las m&aacute;quinas de su Ethernet.
<P>
<P>Para m&aacute;s informaci&oacute;n sobre c&oacute;mo hacer esto lea el mini-Como de
Enmascaramiento de IP en <EM>Linux IP Masquerade mini HOWTO</EM>
<CODE>
<A HREF="http://sunsite.unc.edu/mdw/HOWTO/mini/IP-Masquerade">http://sunsite.unc.edu/mdw/HOWTO/mini/IP-Masquerade</A></CODE>
<P>
<P>Para la mayor&iacute;a de usuarios, que conectan una sola m&aacute;quina a un proovedor
de servicios Internet v&iacute;a PPP, no ser&aacute; necesario obtener una direcci&oacute;n IP
(o m&aacute;s exactamente, una direcci&oacute;n de red).
<P>
<P>Si desea conectar una peque&ntilde;a red local a Internet, muchos proovedores de
servicios de Internet (ISPs) pueden conseguirle una subred dedicada (una
secuencia espec&iacute;fica de n&uacute;meros IP) a partir de su espacio de direcciones
IP. En otro caso, siempre puede usar el enmascaramiento de IPs.
<P>
<P>La mayor parte de los proveedores usan asignaci&oacute;n de direcciones IP
<B>din&aacute;micas</B> para los usuarios que conectan un solo PC a Internet. Es
decir: el servicio PPP con el que se contacta comunicar&aacute; a su sistema,
como parte del proceso de conexi&oacute;n, qu&eacute; direcci&oacute;n IP se utilizar&aacute; durante
esa sesi&oacute;n para su interfaz PPP. Esa direcci&oacute;n no ser&aacute; la misma cada vez
que usted se conecte a su proovedor.
<P>
<P>Con las direcciones IP din&aacute;micas, usted <B>no</B> tendr&aacute; la misma direcci&oacute;n
IP cada vez que se conecte. Esto tiene consecuencias para aplicaciones de
tipo servidor existentes en su m&aacute;quina Linux tales como sendmail, ftpd,
httpd y algunas por el estilo. Estos servicios se basan en la premisa de
que el ordenador que ofrece el servicio est&aacute; accesible siempre con la
misma direcci&oacute;n IP (o al menos con un nombre fijo cuya direcci&oacute;n IP est&eacute;
disponible v&iacute;a DNS).
<P>
<P>Las limitaciones de servicio debidas a la asignaci&oacute;n de direcciones IP
din&aacute;micas (y maneras de solucionarlas, siempre y cuando sea posible)
ser&aacute;n comentadas m&aacute;s tarde en este documento.
<P>
<HR>
<A HREF="PPP-Como-3.html">Página siguiente</A>
<A HREF="PPP-Como-1.html">Página anterior</A>
<A HREF="PPP-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
