<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Encaminamiento en una red local</TITLE>
 <LINK HREF="PPP-Como-26.html" REL=next>
 <LINK HREF="PPP-Como-24.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc25" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-26.html">Página siguiente</A>
<A HREF="PPP-Como-24.html">Página anterior</A>
<A HREF="PPP-Como.html#toc25">Índice general</A>
<HR>
<H2><A NAME="s25">25. Encaminamiento en una red local</A></H2>

<P>Si est&aacute; conectado a una red pero todav&iacute;a desea utilizar PPP en su m&aacute;quina
personal Linux, necesita configurar algunos asuntos acerca del encaminar
paquetes. Esto es necesario para que su m&aacute;quina pueda acceder a su red local
(a trav&eacute;s de la interfaz Ethernet) y tambi&eacute;n al servidor PPP y m&aacute;s all&aacute;.
<P>
<P>Esta secci&oacute;n NO intenta ense&ntilde;ar nada acerca de encaminamiento - s&oacute;lo trata
un caso especial y sencillo de encaminamiento est&aacute;tico.
<P>
<P>Le recomiendo que lea la Gu&iacute;a del Administrador de Redes Linux (GARL) si NO
est&aacute; familiarizado con el encaminamiento. El libro de O'Reilly "TCP/IP
Network Administration" trata este tema de una manera muy comprensible.
<P>
<P>El norma b&aacute;sica del encaminamiento est&aacute;tico es que la ruta por defecto
deber&iacute;a ser la que apunta a la MAYORIA de las direcciones de red. Para otras
redes, introduzca rutas espec&iacute;ficas a la tabla de encaminamiento.
<P>
<P>La UNICA situaci&oacute;n que voy a tratar aqu&iacute; es en la que su PC Linux est&aacute; en
una red local que no est&aacute; conectada a Internet - y desea conectarse v&iacute;a PPP
a Internet para uso personal mientras permanece conectado a la red local.
<P>
<P>Antes de nada, aseg&uacute;rese de que su camino Ethernet est&aacute; configurado para ser
la direcci&oacute;n espec&iacute;fica de red a trav&eacute;s de su red local y NO est&aacute;
configurada para ser el camino por defecto.
<P>
<P>Compruebe esto tecleando una orden route. Deber&iacute;a ver algo como lo
siguiente:-
<P>
<BLOCKQUOTE><CODE>
<PRE>
[root@hwin /root]# route -n
Kernel routing table
Destination     Gateway         Genmask         Flags MSS    Window Use Iface
loopback        *               255.255.255.0   U     1936   0       50 lo
10.0.0.0        *               255.255.255.0   U     1436   0      565 eth0
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>Si su interfaz Ethernet (eth0) est&aacute; apuntada como camino por defecto (la
primera columna mostrar&aacute; "default" en la l&iacute;nea eth0) necesitar&aacute; cambiar los
scripts de inicializaci&oacute;n Ethernet para hacer que apunte a n&uacute;meros
espec&iacute;ficos de red (consulte el COMO Redes2 y GARL).
<P>
<P>Esto le permitir&aacute; que pppd ajuste el camino por defecto como se aqu&iacute; se
muestra:-
<P>
<BLOCKQUOTE><CODE>
<PRE>
[root@hwin /root]# route -n
Kernel routing table

Destination     Gateway         Genmask         Flags MSS    Window Use Iface
10.144.153.51   *               255.255.255.255 UH    488    0        0 ppp0
127.0.0.0       *               255.255.255.0   U     1936   0       50 lo
10.1.0.0        *               255.255.255.0   U     1436   0      569 eth0
default         10.144.153.51   *               UG    488    0        3 ppp0
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>Como puede ver, tenemos un camino de HOST al servidor PPP ( 10.144.153.51)
v&iacute;a ppp0 y tambi&eacute;n un camino de red por defecto que utiliza el servidor PPP
como pasarela.
<P>
<P>Si su configuraci&oacute;n necesita ser m&aacute;s compleja que esto - lea los documentos
de encaminamiento ya mencionados y consulte a un experto.
<P>
<P>Si su red local tiene encaminadores, ya tendr&aacute; pasarelas establecidas hacia
las redes m&aacute;s anchas disponibles. PERO deber&iacute;a tener apuntando su camino por
defecto a la interfaz PPP - y hacer que los otros caminos sean espec&iacute;ficos de
las redes a las que sirven.
<P>
<H2><A NAME="ss25.1">25.1 Nota acerca de la Seguridad</A>
</H2>

<P>Cuando configura un ordenador Linux de una red existente para conectarlo a
Internet, est&aacute; potencialmente abriendo toda su red local a Internet - y a
los malos que residen aqu&iacute;. Antes de hacer esto, le sugiero que consulte con
el administrador de su red y la pol&iacute;tica de seguridad de su
empresa/universidad/sitio donde se encuentra. Si su conexi&oacute;n PPP a Internet
es utilizada para atacar con &eacute;xito su red local, ser&aacute; el destino del odio de
los usuarios de la red y de los administradores de sistemas y de red.
Tambi&eacute;n puede encontrarse con un problema mucho m&aacute;s serio.
<P>
<P>Antes de conectar una red local a Internet, deber&iacute;a considerar las
implicaciones de segurdad que tiene incluso una conexi&oacute;n DIN&Aacute;MICA - para
ello sirva la referencia al "Building Internet Firewalls" de O'Reilly.
<P>
<HR>
<A HREF="PPP-Como-26.html">Página siguiente</A>
<A HREF="PPP-Como-24.html">Página anterior</A>
<A HREF="PPP-Como.html#toc25">Índice general</A>
</BODY>
</HTML>
