<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Resumen de c&oacute;mo hacer que PPP funcione como cliente </TITLE>
 <LINK HREF="PPP-Como-7.html" REL=next>
 <LINK HREF="PPP-Como-5.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-7.html">Página siguiente</A>
<A HREF="PPP-Como-5.html">Página anterior</A>
<A HREF="PPP-Como.html#toc6">Índice general</A>
<HR>
<H2><A NAME="s6">6. Resumen de c&oacute;mo hacer que PPP funcione como cliente </A></H2>

<P>Este documento contiene una gran cantidad de informaci&oacute;n, y con cada versi&oacute;n
crece.
<P>
<P>
<P>Como consecuencia, esta secci&oacute;n intenta dar un resumen conciso de las
acciones que deben llevarse a cabo para hacer que su sistema Linux se
conecte como cliente a un servidor PPP.
<P>
<H2><A NAME="ss6.1">6.1 Obtener/Instalar el software</A>
</H2>

<P>Si su distribuci&oacute;n Linux no incluye el software PPP, necesitar&aacute; obtenerlo:
<EM>el demonio PPP para Linux</EM> <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/system/Network/serial/ppp/ppp-2.2.0f.tar.gz">ftp://sunsite.unc.edu/pub/Linux/system/Network/serial/ppp/ppp-2.2.0f.tar.gz</A></CODE>.
<P>
<P>A la hora de escribir estas l&iacute;neas, esta era la &uacute;ltima versi&oacute;n oficial. Sin
embargo, escoja la &uacute;ltima versi&oacute;n disponible (ppp-2.3 estaba en fase beta a
la hora de escribir esto, y deber&iacute;a ser lanzado en un breve plazo).
<P>
<P>El paquete PPP contiene instrucciones acerca de c&oacute;mo compilar e instalar el
software <B>por lo que este COMO no las incluye</B>.
<P>
<H2><A NAME="ss6.2">6.2 Compilar el soporte PPP en el n&uacute;cleo</A>
</H2>

<P>Las operaciones PPP en Linux se dividen en dos partes
<UL>
<LI>el demonio PPP mencionado anteriormente</LI>
<LI>el soporte de PPP en el n&uacute;cleo</LI>
</UL>
<P>
<P>Muchas distribuciones dan soporte PPP en el n&uacute;cleo en sus n&uacute;cleos de
instalaci&oacute;n por defecto, pero otras no lo hacen.
<P>
<P>Si en el momento de iniciar Linux, el n&uacute;cleo da mensajes como
<P>
<HR>
<PRE>
PPP Dynamic channel allocation code copyright 1995 Caldera, Inc.
PPP line discipline registered.
</PRE>
<HR>
<P>
<P>su n&uacute;cleo tiene integrado el soporte PPP.
<P>
<P>Sin embargo, es probable que desee compilar su propio n&uacute;cleo sea cual sea su
distribuci&oacute;n, para poder as&iacute; darle a los recursos de su sistema el uso m&aacute;s
eficiente dada su configraci&oacute;n particular de hardware. Es valioso recordar que
el n&uacute;cleo no puede ser guardado en el swap, por lo que mantener el n&uacute;cleo lo
m&aacute;s peque&ntilde;o que sea posible tiene sus ventajas en m&aacute;quinas de memoria limitada.
<P>
<P>Este documento da unas instrucciones m&iacute;nimas de recompilaci&oacute;n del n&uacute;cleo en
la secci&oacute;n 
<A HREF="PPP-Como-7.html#Kernel configuration">Configurar el N&uacute;cleo Linux</A>.
<P>
<P>Para m&aacute;s detalles, busque el Kernel-COMO en <EM>la p&aacute;gina oficial del
proyecto Insflug (traducciones de documentos COMO)</EM>
<CODE>
<A HREF="http://www.insflug.org">www.insflug.org</A></CODE>
<P>
<H2><A NAME="ss6.3">6.3 Obtener informaci&oacute;n de su proveedor de servicios de Internet (ISP)</A>
</H2>

<P>Hay casi un n&uacute;mero infinito de maneras en las que se puede configurar un
servidor PPP. Para conectarse a su ISP (o servidor PPP corporativo para
acceder a su intranet), deber&aacute; obtener informaci&oacute;n acerca de c&oacute;mo funciona
su servidor.
<P>
<P>Debido a que usted est&aacute; utilizando Linux, puede tener algunos problemas con
los servicios de ayuda de algunos ISP (y servidores PPP de intranet) que
saben s&oacute;lo acerca de los clientes de MS Windows.
<P>
<P>Sin embargo, un n&uacute;mero creciente de ISPs utilizan Linux para dar su
servicio - y Linux tambi&eacute;n est&aacute; penetrando en el entorno empresarial, por lo
que podr&iacute;a ser ayudado si tiene problemas.
<P>
<P>En la secci&oacute;n 
<A HREF="PPP-Como-8.html#Server info">Conseguir la informaci&oacute;n necesaria de su servidor PPP</A> se informa de lo que necesitar&aacute; saber acerca del
servidor PPP al que se va a conectar - y c&oacute;mo averiguar la informaci&oacute;n que
necesita saber.
<P>
<H2><A NAME="ss6.4">6.4 Configurar su m&oacute;dem y puerto serie</A>
</H2>

<P>Para conectar a un servidor PPP y obtener la mejor tasa de transferencia
posible, su m&oacute;dem necesita ser configurado correctamente.
<P>
<P>De manera similar, los puertos series de su m&oacute;dem y de su ordenador
necesitan estar configurados correctamente.
<P>
<P>La secci&oacute;n 
<A HREF="PPP-Como-9.html#Modem">Configurar el m&oacute;dem y el puerto serie</A>
da informaci&oacute;n acerca de esto.
<P>
<H2><A NAME="ss6.5">6.5 Configurar la resoluci&oacute;n de nombres (DNS)</A>
</H2>

<P>Adem&aacute;s de los ficheros que ejecutan PPP y de realizar la conexi&oacute;n
automatizada al servidor PPP, hay un n&uacute;mero de ficheros de configuraci&oacute;n que
deben ser modificados para que el ordenador pueda traducir nombres como
<CODE>www.interweft.com.au</CODE> a la direcci&oacute;n IP realmente utilizada para
contactar con ese ordenador. Este proceso se denomina resoluci&oacute;n de nombres.
Los ficheros son:-
<P>
<UL>
<LI><CODE>/etc/resolv.conf</CODE></LI>
<LI><CODE>/etc/host.conf</CODE></LI>
</UL>
<P>
<P>La secci&oacute;n 
<A HREF="PPP-Como-10.html#DNS">Configurar la resoluci&oacute;n de nombres</A>
da m&aacute;s detalles acerca de esto.
<P>
<P>En particular, <B>NO</B> necesita ejecutar un servidor de nombres en su PC
Linux para conectarse a Internet (aunque pueda desearlo). Todo lo que tiene
que saber es conocer, al menos, la direcci&oacute;n IP de un servidor de nombres
que pueda utilizar (preferiblemente el de su ISP).
<P>
<H2><A NAME="ss6.6">6.6 PPP y los privilegios de root</A>
</H2>

<P>Debido a que establecer un enlace PPP entre su ordenador Linux y otro
servidor PPP requiere la manipulaci&oacute;n de dispositivos de red (la interfaz
PPP es una interfaz de red) y de la tabla de encaminamiento del n&uacute;cleo, pppd
requiere privilegios de root.
<P>
<P>Para m&aacute;s detalles acerca de esto, lea la secci&oacute;n 
<A HREF="PPP-Como-11.html#root">Usar PPP y privilegios de root</A>.
<P>
<H2><A NAME="ss6.7">6.7 Comprobar los ficheros PPP de su distribuci&oacute;n y configurar las</A>
opciones de PPP</H2>

<P>Hay un n&uacute;mero de ficheros de configuraci&oacute;n que necesitan ser configurados
para hacer que PPP funcione. Hay ejemplos en la distribuci&oacute;n PPP y esta
secci&oacute;n muestra qu&eacute; ficheros deber&iacute;a tener:-
<P>
<HR>
<PRE>
/etc/ppp/options
/etc/ppp/scripts/ppp-on
/etc/ppp/scripts/ppp-on-dialer
/etc/ppp/options.tpl
</PRE>
<HR>
<P>
<P>Puede que necesite crear algunos ficheros adicionales dependiendo de
ex&aacute;ctamente qu&eacute; desea alcanzar con PPP:-
<P>
<HR>
<PRE>
/etc/ppp/options.ttyXX
/etc/ppp/ip-up
/etc/ppp/pap-secrets
/etc/ppp/chap-secrets
</PRE>
<HR>
<P>
<P>En suma, el demonio PPP puede utilizar un gran n&uacute;mero de opciones de l&iacute;nea
de &oacute;rdens y es importante utilizar las correctas; esta secci&oacute;n le lleva a
trav&eacute;s de las opciones est&aacute;ndar de PPP y le ayuda a escoger las opciones
que deber&iacute;a usar.
<P>
<P> Para m&aacute;s detalles acerca de esto, lea 
<A HREF="PPP-Como-12.html#options">Configurando los ficheros de conexi&oacute;n PPP</A>.
<P>
<H2><A NAME="ss6.8">6.8 Si su servidor PPP utiliza PAP (Protocolo de Autentificaci&oacute;n de</A>
Contrase&ntilde;as)</H2>

<P>Muchos ISPs y servidores PPP corporativos usan PAP. Si su servidor <B>no</B>
requiere el uso de PAP (si puede conectarse manualmente y recibir las
preguntas est&aacute;ndar de nombre de usuario/contrase&ntilde;a en modo texto entonces no
usa PAP), puede ignorar esta secci&oacute;n.
<P>
<P>En lugar de conectarse a un servidor utilizando el nombre de usuario y
contrase&ntilde;a cuando el servidor se lo pida, un servidor PPP que utilice PAP
no requiere un acceso basado en texto.
<P>
<P>La informaci&oacute;n de autentificaci&oacute;n de usuario es intercambiada como parte del
protocolo de control de conexi&oacute;n (LCP) que es lo primero que se realiza al
establecer un enlace PPP.
<P>
<P>La secci&oacute;n 
<A HREF="PPP-Como-13.html#pap">Si su servidor PPP utiliza PAP</A> da
informaci&oacute;n acerca de los ficheros que necesita configurar para establecer
un enlace PPP utilizando PAP.
<P>
<H2><A NAME="ss6.9">6.9 Conectar con el servidor PPP manualmente</A>
</H2>

<P>Una vez configurados los ficheros b&aacute;sicos, es una buena idea probarlos
conectando (utilizando minicom o seyon) y arrancando pppd en su PC Linux
manualmente.
<P>
<P>Vea la secci&oacute;n 
<A HREF="PPP-Como-14.html#manual">Establecer la conexi&oacute;n PPP manualmente</A> para conseguir los detalles completos acerca de esto.
<P>
<H2><A NAME="ss6.10">6.10 Automatizar su conexi&oacute;n PPP</A>
</H2>

<P>Una vez que puede conectarse manualmente, puede pasar a configurar una serie
de scripts que automatizaran el establecimiento de la conexi&oacute;n.
<P>
<P>La secci&oacute;n 
<A HREF="PPP-Como-15.html#automate">Automatizar las conexiones - Crear los scripts de conexi&oacute;n</A> trata la creaci&oacute;n de los scripts necesarios,
centr&aacute;ndose en <CODE>chat</CODE> y realizando scripts para el proceso de entrada en
el servidor PPP.
<P>
<P>Esta secci&oacute;n tambi&eacute;n trata los scripts para la autentificaci&oacute;n
nombre/contrase&ntilde;a as&iacute; como los scripts para servidores con autentificaci&oacute;n
PAP/CHAP.
<P>
<H2><A NAME="ss6.11">6.11 Desconectar el enlace</A>
</H2>

<P>Una vez que el enlace est&aacute; establecido y funcionando, necesita poder
desactivar el enlace.
<P>
<P>Esto es comentado en la secci&oacute;n 
<A HREF="PPP-Como-17.html#off">Desactivar el enlace PPP</A>.
<P>
<H2><A NAME="ss6.12">6.12 Si tiene problemas</A>
</H2>

<P>Mucha gente tiene problemas para conseguir que PPP funcione bien. La
variedad de servidores PPP y de c&oacute;mo requieren que se establezca la conexi&oacute;n
es enorme. De manera similar, hay muchas opciones de PPP - y alguna
combinaci&oacute;n de las mismas es posible que no funcione.
<P>
<P>Adem&aacute;s de los problemas de conexi&oacute;n e inicio del servicio PPP, puede haber
problemas con los m&oacute;dems y con la propia l&iacute;nea telef&oacute;nica.
<P>
<P>La secci&oacute;n 
<A HREF="PPP-Como-18.html#problems">Soluci&oacute;n de problemas</A> da informaci&oacute;n
b&aacute;sica acerca de los errores m&aacute;s frecuentes, de c&oacute;mo aislarlos y de c&oacute;mo
solucionarlos.
<P>
<P>Esta secci&oacute;n <B>NO</B> est&aacute; orientada para tratar m&aacute;s que lo b&aacute;sico. Al
Longyear mantiene el PUF-PPP que contiene mucha m&aacute;s informaci&oacute;n acerca de
este tema.
<P>
<H2><A NAME="ss6.13">6.13 Tras realizar la conexi&oacute;n</A>
</H2>

<P>Una vez que el enlace PPP est&aacute; operativo (m&aacute;s concretamente, una vez que la
capa IP est&aacute; operativa), Linux PPP puede ejecutar autom&aacute;ticamente (como
usuario root), un script para realizar <B>cualquier</B> funci&oacute;n que pueda ser
ejecutada mediante un script.
<P>
<P>La secci&oacute;n 
<A HREF="PPP-Como-23.html#ip-up">Tras realizar la conexi&oacute;n</A> 
da informaci&oacute;n acerca del script <CODE>/etc/ppp/ip-up</CODE>, de los par&aacute;metros que
recibe de PPP y de c&oacute;mo utilizarlo para realizar cosas como recoger su
correo de su cuenta en el ISP, enviar cualquier correo que tenga una
transmisi&oacute;n pendiente y similares.
<P>
<H2><A NAME="ss6.14">6.14 Problemas de servicios de IP est&aacute;ndar con una conexi&oacute;n PPP de IP</A>
din&aacute;mica </H2>

<P>Tal y como se dijo en la introducci&oacute;n, las direcci&oacute;nes IP din&aacute;micas afectan
a la posibilidades de su PC Linux como servidor en Internet.  
<P>
<P>La secci&oacute;n 
<A HREF="PPP-Como-21.html#dynamic-server">Problemas de servicios IP est&aacute;ndar con una conex&iacute;on PPP de IP din&aacute;mica</A> da informaci&oacute;n acerca de los
(principales) servicios afectados y de lo que puede hacer (si es posible)
para solucionarlo.
<P>
<HR>
<A HREF="PPP-Como-7.html">Página siguiente</A>
<A HREF="PPP-Como-5.html">Página anterior</A>
<A HREF="PPP-Como.html#toc6">Índice general</A>
</BODY>
</HTML>
