<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Configurar los ficheros de conexi&oacute;n PPP</TITLE>
 <LINK HREF="PPP-Como-13.html" REL=next>
 <LINK HREF="PPP-Como-11.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc12" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-13.html">Página siguiente</A>
<A HREF="PPP-Como-11.html">Página anterior</A>
<A HREF="PPP-Como.html#toc12">Índice general</A>
<HR>
<H2><A NAME="options"></A> <A NAME="s12">12. Configurar los ficheros de conexi&oacute;n PPP</A></H2>

<P>Usted necesita estar conectado como <B>root</B> para crear los directorios y
editar los ficheros que necesita para configurar PPP, incluso si desea que
PPP sea accesible para todos los usuarios.
<P>
<P>PPP utiliza un n&uacute;mero de ficheros para conectar y para configurar una 
conexi&oacute;n PPP. La localizaci&oacute;n y el nombre de &eacute;stos var&iacute;a entre PPP 2.1.2 y
PPP 2.2.
<P>
<P>Para PPP 2.1.2 los ficheros son:-
<P>
<HR>
<PRE>
/usr/sbin/pppd       # el ejecutable PPP 
/usr/sbin/ppp-on     # el script de marcado/conexi&oacute;n
/usr/sbin/ppp-off    # el script de desconexi&oacute;n
/etc/ppp/options     # las opciones que pppd usa para todas las conexiones
/etc/ppp/options.ttyXX   # las opciones espec&iacute;ficas para este puerto
</PRE>
<HR>
<P>
<P>Para PPP 2.2 los ficheros son:-
<P>
<HR>
<PRE>
/usr/sbin/pppd           # el ejecutable PPP
/etc/ppp/scripts/ppp-on      # el script de marcado/conexi&oacute;n
/etc/ppp/scripts/ppp-on-dialer   # parte 1 el script de marcado
/etc/ppp/scripts/ppp-off # el script real del propio programa chat
/etc/ppp/options     # las opciones que pppd usa para todas las conexiones
/etc/ppp/options.ttyXX       # las opciones espec&iacute;ficas para este puerto
</PRE>
<HR>
<P>
<P>Los usuarios de Red Hat Linux deber&iacute;an fijarse en que los lugares en que Red
Hat 5.X pone estos scripts es en el subdirectorio /scripts del directorio de 
documentaci&oacute;n del paquete ppp (para la versi&oacute;n 2.2.0f de este paquete es
<CODE>/usr/doc/ppp-2.2.0f-2/scripts</CODE>).
<P>
<P>En su directorio /etc deber&iacute;a existir un directorio ppp:-
<P>
<BLOCKQUOTE><CODE>
<PRE>
drwxrwxr-x   2 root     root         1024 Oct  9 11:01 ppp
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>Si no existe, cr&eacute;elo con esos permisos y propietario.
<P>
<P>Si el directorio ya existe, deber&iacute;a contener una plantilla de opciones
denominada <B>options.tpl</B>. Este fichero se incluye m&aacute;s abajo en caso
de que no lo contenga. 
<P>
<P>Imprimalo ya que contiene una explicaci&oacute;n de casi todas las opciones PPP
(son &uacute;tiles leerlas junto con las p&aacute;ginas de manual pppd).
Aunque usted pueda utilizar este fichero como base para su fichero
<CODE>/etc/ppp/options</CODE>, es probablemente mejor crear su propio fichero de
opciones que no contenga ning&uacute;n comentario de la plantilla. Ser&aacute; mucho m&aacute;s
corto y m&aacute;s f&aacute;cil de leer/mantener.
<P>
<P>Si tiene varios m&oacute;dems/puertos serie (caso t&iacute;pico de servidores PPP), cree
un fichero general <CODE>/etc/ppp/options</CODE> que contenga las opciones
comunes para todos los puertos serie en los que de soporte de entrada salida
y configure ficheros de opciones individuales con los ajustes necesarios
para cada puerto serie en el que desee establecer una conexi&oacute;n PPP. 
<P>
<P>Estos ficheros de opciones espec&iacute;ficas de puertos <CODE>options.ttx1</CODE>,
tt/options.ttyx2/ y as&iacute; (donde x es la letra apropiada para sus puertos
serie).
<P>
<P>Sin embargo, para una &uacute;nica conexi&oacute;n PPP, puede usar sin problemas el
fichero <CODE>/etc/ppp/options</CODE>. De manera alternativa puede poner todas
las opciones como argumentos de la propia orden pppd.
<P>
<P>Es m&aacute;s sencillo mantener una configuraci&oacute;n que utilice ficheros
<CODE>/etc/ppp/options.ttySx</CODE>. Si utiliza PPP para conectar con varios
servidores, puede crear ficheros de opciones para cada uno de ellos en
<CODE>/etc/ppp/options.servidor</CODE> y entonces especificar el fichero 
de opciones como un par&aacute;metro de la orden PPP mientras conecta (utilizando 
la opci&oacute;n <CODE>file fichero-de-opciones</CODE> de pppd en la l&iacute;nea de &oacute;rdenes).
<P>
<H2><A NAME="ss12.1">12.1 El fichero options.tpl suministrado</A>
</H2>

<P>Algunas distribuciones de PPP parecen haber perdido el fichero options.tpl,
por lo que aqu&iacute; est&aacute; el fichero completo. Le sugiero que NO edite este
fichero para crear su(s) fichero(s) <CODE>/etc/ppp/options</CODE>. En su lugar,
copie este a un nuevo fichero y entonces ed&iacute;telo. Si se hace un l&iacute;o con las
ediciones, siempre podr&aacute; volver al original y comenzar de nuevo.
<P>
<HR>
<PRE>
# /etc/ppp/options -*- sh -*- opciones generales para pppd
# creado 13-Jul-1995 jmk
# traducido 5-Feb-1999 davefx
# autodate: 01-Aug-1995
# autotime: 19:45

# Usar el ejecutable u orden especificado para configurar el puerto serie
# Esta orden usar&iacute;a t&iacute;picamente el programa "chat" para hacer que el m&oacute;dem 
# marque y conectar la sesi&oacute;n ppp remota.
#connect "echo Necesita instalar un comando connect."

# Ejecutar el programa u orden especificado despu&eacute;s de que pppd haya
# finalizado la conexi&oacute;n.  Este script podr&iacute;a, por ejemplo, mandar &oacute;rdenes
# al m&oacute;dem para que cuelgue si las se&ntilde;ales de control hardware del mismo no
# est&aacute;n disponibles.
#disconnect "chat -- \d+++\d\c OK ath0 OK"

# mapa de caracteres async -- 32-bit hex; cada bit es un car&aacute;cter que 
# necesita ser asincronizado para que pppd lo reciba. 0x00000001 representa
# '\x01', y 0x80000000 representa '\x1f'.
#asyncmap 0

# Obligar a la pareja a que se autentifique antes de permitir que los
# paquetes de red se env&iacute;en o se reciban.
#auth

# Usar el flujo de paquetes hardware (como RTS/CTS) para controlar el flujo
# de datos del puerto serie.
#crtscts

# Usar el flujo de paquetes sotware (como XON/XOFF) para controlar el flujo
# de datos en el puerto serie.
#xonxoff

# A&ntilde;adir un camino por defecto a las tablas de encaminamiento del sistema,
# utilizando a la pareja como pasarela, una vez que la negociaci&oacute;n IPCP sea
# completada con &eacute;xito.  Esta entrada se elimina cuando la conexi&oacute;n PPP 
# finaliza.
#defaultroute

# Especifica que ciertos caracteres deben ser puestos en secuencia de escape
# en la transmisi&oacute;n (sin importar el hecho de que la pareja pida que sean
# mapeados por el control async).  Los caracteres que han de ser puestos en
# secuencia de escape se especifican como una lista de n&uacute;meros hexadecimales
# separados por comas. F&iacute;jese de que casi todos los caracteres pueden ser
# especificados por la opci&oacute;n escape, no como con la opci&oacute;n asyncmap que
# s&oacute;lo permite hacerlo a los caracteres de control. Los caracteres que no
# pueden ser puestos en secuencia de escape son aquellos con valores
# situados entre 0x20 - 0x3f o 0x5e.
#escape 11,13,ff

# No usar las l&iacute;neas de control del m&oacute;dem.
#local

# Especificar que pppd deber&iacute;a utilizar el bloqueo modo UUCP del dispositivo
# serie para asegurarse un acceso exclusivo al dispositivo.
#lock

# Usar las l&iacute;neas de control del m&oacute;dem. En Ultrix, esta opci&oacute;n implica
# control de flujo por hardware, al igual que la opci&oacute;n crtscts. (Esta
# opci&oacute;n no est&aacute; implementada por completo.)
#modem

# Ajustar el valor de MRU (Unidad de recepci&oacute;n m&aacute;xima) a &lt;n> para la
# negociaci&oacute;n.  pppd pedir&aacute; a la pareja que no env&iacute;e paquetes de m&aacute;s de &lt;n>
# bytes. El valor m&iacute;nimo de MRU es 128. El valor por defecto es 1500.  Un
# valor recomendado para enlaces lentos es 296 (40 bytes para cabecera
# TCP/IP + 256 bytes de datos).
#mru 542

# Establecer la m&aacute;scara de red de la interfaz a &lt;n>, una m&aacute;scara de red en
# notaci&oacute;n "punto-decimal" (como 255.255.255.0).
#netmask 255.255.255.0

# Desabilitar el comportamiento por defecto cuando no se especifica una
# direcci&oacute;n IP local, que es determinar (si es posible) la direcci&oacute;n IP
# local de la m&aacute;quina. Con esta opci&oacute;n, la pareja deber&aacute; proveer la
# direcci&oacute;n local IP durante la negociaci&oacute;n IPCP (a menos que se especifique
# expl&iacute;citamente en la l&iacute;nea de &oacute;rdenes o en un fichero de opciones).
#noipdefault

# Habilita la opci&oacute;n "pasiva" en la LCP. Con esta opci&oacute;n, pppd intentar&aacute;
# iniciar una conexi&oacute;n; si no se recibe ninguna r&eacute;spuesta de la pareja,
# pppd esperar&aacute; de manera pasiva un paquete LCP de la pareja (en lugar de
# salir, que es lo que har&iacute;a sin esta opci&oacute;n).
#passive

# Con esta opci&oacute;n, pppd no transmitir&aacute; paquetes LCP para iniciar una
# conexi&oacute;n hasta que un paquete LCP v&aacute;lido sea recibido de la pareja (como
# la opci&oacute;n "passive" con antiguas versiones de pppd).
#silent

# No solicitar o permitir negociaci&oacute;n de ninguna opci&oacute;n para LCP y IPCP
# (usar valores por defecto).
#-all

# Deshabilitar la compresi&oacute;n en la negociaci&oacute;n de Direcci&oacute;n/control (usa
# la configuraci&oacute;n por defecto, como desabilitar el campo
# direcci&oacute;n/control).
#-ac

# Deshabilitar la necociaci&oacute;n asyncmap (usa el asyncmap por defecto, que es
# poner en secuencia de escape todos los caracteres de control).
#-am

# No transformarse en un proceso en segundo plano (si no, pppd lo har&aacute; si
# se especifica un dispositivo serie).
#-detach

# Desabilitar la negociaci&oacute;n de direcci&oacute;n IP (con esta opci&oacute;n, la IP remota
# debe especificarse con una opci&oacute;n en la l&iacute;nea de &oacute;rdenes o en un fichero
# de opciones).
#-ip

# Deshabilitar la negociaci&oacute;n de n&uacute;mero m&aacute;gico.  Con esta opci&oacute;n, pppd no
# puede detectar una l&iacute;nea con recepci&oacute;n de paquetes enviados.
#-mn

# Deshabilitar la negociaci&oacute;n MRU (unidad de m&aacute;xima recepci&oacute;n) (utilizar el
# valor por defecto, p.e. 1500).
#-mru

# Deshabilitar la negociaci&oacute;n de compresi&oacute;n de campo de protocolo (usar el
# valor por defecto, p.e. compresi&oacute;n de campo de protocolo inhabilitada).
#-pc

# Obligar a que la pareja se autentifique utilizando PAP.
# Esto require autentificaci&oacute;n de DOBLE SENTIDO. NO UTILICE esto para una
# conexi&oacute;n est&aacute;ndar PAP con un ISP ya que esto requerir&aacute; que la m&aacute;quina ISP
# se autentifique ante su m&aacute;quina (y no podr&aacute; hacerlo).
#+pap

# No autentificar utilizando PAP.
#-pap

# Requerir que la pareja se autentifique utilizando CHAP [Protocolo de 
# Autentificaci&oacute;n de Saludo Criptogr&aacute;fico].
# Esto require autentificaci&oacute;n de DOBLE SENTIDO. NO UTILICE esto para una
# conexi&oacute;n est&aacute;ndar CHAP con un ISP ya que esto requerir&aacute; que la m&aacute;quina ISP
# se autentifique ante su m&aacute;quina (y no podr&aacute; hacerlo).
#+chap

# No autentificar utilizando CHAP.
#-chap

# Deshabilitar la negociaci&oacute;n de la compresi&oacute;n de cabeceras IP estilo Van
# Jacobson (utilizar la configuraci&oacute;n por defecto, p.e. sin compresi&oacute;n).
#-vj

# Incrementar el nivel de depuraci&oacute;n (lo mismo que -d). Si se da esta opci&oacute;n,
# pppd guardar&aacute; los contenidos de todos los paquetes de control enviados o
# o recibidos de forma legible.  Los paquetes se guardan a trav&eacute;s de syslog
# con las formas de demonio y nivel. Esta informaci&oacute;n puede ser
# direccionada a un fichero configurando /etc/syslog.conf de manera adecuada
# (ver syslog.conf(5)).  (Si pppd se compila con la opci&oacute;n de extra
# depuraci&oacute;n, mostrar&aacute; mensajes utilizando local2 en lugar de demonio).
#debug

# A&ntilde;adir el nombre de dominio &lt;d> al de la m&aacute;quina local en prop&oacute;sitos de 
# autentificaci&oacute;n.  Por ejemplo, si gethostname() devuelve el nombre porche,
# pero el nombre de dominio completamente cualificado es
# porsche.Quotron.COM, se deber&iacute;a usar la opci&oacute;n de dominio para establecer
# el nombre de dominio a Quotron.COM.
#domain &lt;d>

# Habilitar el c&oacute;digo de depuraci&oacute;n en el controlador nivel-n&uacute;cleo PPP. El
# argumento n es un n&uacute;mero que es la suma de los siguientes valores:
# 1 para habilitar los mensajes de depuraci&oacute;n generales, 2 para solicitar
# que el contenido de los paquetes recibidos sea impreso, y 4 para solicitar
# que el contenido de los paquetes enviados sea impreso.
#kdebug n

# Ajustar el valor de MTU (Unidad m&aacute;xima de transmisi&oacute;n) a &lt;n>. A menos que
# la pareja requiera un menor valor v&iacute;a negociaci&oacute;n MRU, pppd necesitar&aacute; que
# el c&oacute;digo de red del n&uacute;cleo env&iacute;e paquetes de no mas de n bytes a trav&eacute;s
# de la interfaz de red PPP.
#mtu &lt;n>

# Cambiar a &lt;n> el nombre del sistema local para prop&oacute;sitos de
# autentificaci&oacute;n. Esto probablemente deba ser cambiado al nombre almacenado
# en la base de datos de nombres de su servidor ISP si est&aacute; utilizando 
# PAP/CHAP.
#name &lt;n>

# Cambiar el nombre de usuario a &lt;u> para autentificar esta m&aacute;quina con la 
# pareja con la que se utiliza PAP.
# NO use esto si ya utiliza la opci&oacute;n 'name' anteriormente.
#user &lt;u>

# Forzar el uso del nombre de servidor como el nombre del sistema local
# en prop&oacute;sitos de autentificaci&oacute;n (sobreescribe la opci&oacute;n name).
#usehostname

# Cambiar el nombre asumido del sistema remoto para prop&oacute;sitos de
# autentificaci&oacute;n a &lt;n>
#remotename &lt;n>

# A&ntilde;adir una entrada a la tabla del protocolo de resoluci&oacute;n de direcciones 
# (ARP) de este sistema con la direcci&oacute;n IP de la pareja y la direcci&oacute;n 
# Ethernet de su sistema.
#proxyarp

# Usar la base de datos de contrase&ntilde;as del sistema para autentificar a la
# pareja al utilizar PAP.
#login

# Si se habilita esta opci&oacute;n, pppd enviar&aacute; un marco de petici&oacute;n de eco LCP
# a la pareja cada n segundos. Bajo Linux, la petici&oacute;n de eco se env&iacute;a
# cuando no se recibe ning&uacute;n paquete de la pareja durante n segundos. 
# Normalmente, la pareja deber&iacute;a responder a la petici&oacute;n de eco con una
# respuesta de eco. Esta opci&oacute;n puede utilizarse con la opci&oacute;n lcp de fallo
# de eco para detectar que la pareja no est&aacute; conectada.
#lcp-echo-interval &lt;n>

# Si se da esta opci&oacute;n, pppd presupondr&aacute; que la pareja est&aacute; muerta si
# tras enviar n peticiones de eco no se ha recibido ninguna respuesta v&aacute;lida
# de eco. Si esto sucede, pppd finalizar&aacute; la conexi&oacute;n.  El uso de esta
# opci&oacute;n requiere un valor distinto de 0 para el par&aacute;metro
# lcp-echo-interval.
# Esta opci&oacute;n puede utilizarse para posibilitar que pppd finalice despu&eacute;s de
# que la conexi&oacute;n f&iacute;sica se haya roto (p.e., el modem ha colgado) en
# en situaciones en las que no est&aacute; disponible el control de l&iacute;neas del
# m&oacute;dem por v&iacute;a hardware.
#lcp-echo-failure &lt;n>

# Ajustar el intervalo de reinicio de LCP a &lt;n> segundos (3 por defecto).
#lcp-restart &lt;n>

# Ajustar el m&aacute;ximo n&uacute;mero de transimisiones de petici&oacute;n de finalizaci&oacute;n de
# LCP a &lt;n> (3 por defecto).
#lcp-max-terminate &lt;n>

# Ajustar el m&aacute;ximo n&uacute;mero de transmisiones de petici&oacute;n de configuraci&oacute;n de 
# LCP a &lt;n> (10 por defecto).
# Algunos servidores PPP son lentos al inicializarse. Puede que necesite 
# incrementar esto si sigue consiguiendo errores de "l&iacute;nea serie en bucle" y
# usted est&aacute; seguro de haber conectado correctamente y de que PPP se deber&iacute;a
# estar iniciando en el servidor.
#lcp-max-configure &lt;n>

# Ajustar a &lt;n> el m&aacute;ximo n&uacute;mero de NAKs de configuraci&oacute;n LCP devueltos antes 
# de comenzar a enviar Denegaciones de configuraci&oacute;n. (10 por defecto).
#lcp-max-failure &lt;n>

# Ajustar el intervalo de reinicializaci&oacute;n de IPCP (retardo de
# retransmisi&oacute;n) a &lt;n> segundos (3 por defecto).
#ipcp-restart &lt;n>

# Ajustar el m&aacute;ximo n&uacute;mero de transmisiones petici&oacute;n de finalizaci&oacute;n de IPCP
# a &lt;n> (3 por defecto).
#ipcp-max-terminate &lt;n>

# Ajustar el m&aacute;ximo n&uacute;mero de peticiones de configuraci&oacute;n IPCP a &lt;n> (10 por
# defecto).
#ipcp-max-configure &lt;n>

# Ajustar a &lt;n> el m&aacute;ximo n&uacute;mero de NAKs de configuraci&oacute;n IPCP devueltos antes 
# de comenzar a enviar Denegaciones de configuraci&oacute;n. (10 por defecto).
#ipcp-max-failure &lt;n>

# Ajustar el intervalo de reinicializaci&oacute;n PAP (retardo de retransmisi&oacute;n) a
# &lt;n> segundos. (3 por defecto).
#pap-restart &lt;n>

# Ajustar el m&aacute;ximo n&uacute;mero de transmisiones de petici&oacute;n de autentificaci&oacute;n
# PAP a &lt;n> (10 por defecto).
#pap-max-authreq &lt;n>

# Ajustar el intervalo de reinicializaci&oacute;n CHAP (retardo de retransmisi&oacute;n de
# intentos) a &lt;n> segundos. (3 por defecto).
#chap-restart &lt;n>

# Ajustar el m&aacute;ximo n&uacute;mero de transmisiones de intentos CHAP a &lt;n>
# (10 por defecto).
#chap-max-challenge

# Si se da esta opci&oacute;n, pppd recomprobar&aacute; la autenticidad de la pareja cada
# &lt;n> segundos.
#chap-interval &lt;n>

# Con esta opci&oacute;n, pppd aceptar&aacute; la direcci&oacute;n IP dada por la pareja como la
# IP propia, incluso aunque se haya especificado la direcci&oacute;n IP local como
# una opci&oacute;n.
#ipcp-accept-local

# Con esta opci&oacute;n pppd aceptar&aacute; la direcci&oacute;n IP dada por la pareja como su
# IP, incluso aunque la direcci&oacute;n IP remota se ha especificado como opci&oacute;n.
#ipcp-accept-remote
</PRE>
<HR>
<P>
<P>
<H2><A NAME="ss12.2">12.2 ¿Qu&eacute; opciones deber&iacute;a usar? (No PAP/CHAP)</A>
</H2>

<P>Bien, como dice la canci&oacute;n, todo depende. Las opciones especificadas aqu&iacute;
deber&iacute;an funcionar con la mayor&iacute;a de los servidores.
<P>
<P>Sin embargo, si NO funciona, LEA EL FICHERO DE PLANTILLA 
(<CODE>/etc/ppp/options.tpl</CODE>) <B>y</B> las p&aacute;ginas de manual de pppd
<B>y</B> hable con el administrador/servicio t&eacute;cnico que llevan el servidor al
que se est&aacute; conectando.
<P>
<P>Deber&iacute;a darse cuenta de que los scripts de conexi&oacute;n presentados aqu&iacute; tambi&eacute;n
utilizan algunas opciones de l&iacute;nea de &oacute;rdenes para hacer las cosas algo m&aacute;s
sencillas de cambiar.
<P>
<HR>
<PRE>
# /etc/ppp/options (NO PAP/CHAP)
#
# Evitar que pppd trabaje en segundo plano
-detach
#
# utilizar las l&iacute;neas de control del m&oacute;dem
modem
# utilizar bloqueos de tipo uucp para asegurar acceso exclusivo a los
# dispositivos serie
lock
# usar control de flujo hardware
crtscts
# crear un camino por defecto para esta conexi&oacute;n en la table de
# encaminamiento
defaultroute
# NO establecer ninguna secuencia de control en forma de cadena de escape
asyncmap 0
# transmitir paquetes de 552 bytes de tama&ntilde;o m&aacute;ximo
mtu 552
# recibir paquetes de 552 bytes de tama&ntilde;o m&aacute;ximo
mru 552
#
#-------FIN DE EJEMPLO /etc/ppp/options (no PAP/CHAP)
</PRE>
<HR>
<P>
<HR>
<A HREF="PPP-Como-13.html">Página siguiente</A>
<A HREF="PPP-Como-11.html">Página anterior</A>
<A HREF="PPP-Como.html#toc12">Índice general</A>
</BODY>
</HTML>
