<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux PPP C&oacute;mo: Configurar su N&uacute;cleo Linux</TITLE>
 <LINK HREF="PPP-Como-8.html" REL=next>
 <LINK HREF="PPP-Como-6.html" REL=previous>
 <LINK HREF="PPP-Como.html#toc7" REL=contents>
</HEAD>
<BODY>
<A HREF="PPP-Como-8.html">Página siguiente</A>
<A HREF="PPP-Como-6.html">Página anterior</A>
<A HREF="PPP-Como.html#toc7">Índice general</A>
<HR>
<H2><A NAME="Kernel configuration"></A> <A NAME="s7">7. Configurar su N&uacute;cleo Linux</A></H2>

<P>Para usar PPP, su n&uacute;cleo Linux debe ser compilado para incluir soporte PPP.
Obtenga el c&oacute;digo fuente Linux para su n&uacute;cleo si no lo tiene ya - se
encuentra en <CODE>/usr/src/linux</CODE> en un sistema de ficheros est&aacute;ndar
Linux.
<P>
<P>Compruebe este directorio - muchas distribuciones Linux instalan el arbol
fuente (ficheros y subdirectorios) como parte de su proceso de instalaci&oacute;n.
<P>
<P>Durante el arranque, su n&uacute;cleo Linux imprime una gran cantidad de
informaci&oacute;n. Entre ella est&aacute; la informaci&oacute;n acerca del soporte PPP que
incluya. Para visualizar esta informaci&oacute;n, lea su fichero syslog o utilice
<CODE>dmesg | less</CODE> para mostrar la informaci&oacute;n en la pantalla. Si su n&uacute;cleo
incluye soporte PPP, podr&aacute; ver l&iacute;neas como
<P>
<HR>
<PRE>
PPP Dynamic channel allocation code copyright 1995 Caldera, Inc.
PPP line discipline registered.
</PRE>
<HR>
<P>
<P>(esta es para las series de n&uacute;cleos Linux 2.0.x).
<P>
<P>Los c&oacute;digos fuente de Linux pueden obtenerse por ftp de <CODE>ftp.kernel.org</CODE>
o de sus servidores r&eacute;plica.
<P>
<H2><A NAME="ss7.1">7.1 Instalando el c&oacute;digo fuente del n&uacute;cleo Linux</A>
</H2>

<P>Estas son breves instrucciones para obtener e instalar los fuentes del
n&uacute;cleo Linux. Puede conseguir informaci&oacute;n completa acerca de esto de
<EM>The Linux Kernel HOWTO</EM>
<CODE>
<A HREF="http://sunsite.unc.edu/mdw/HOWTO/Kernel-HOWTO.html">http://sunsite.unc.edu/mdw/HOWTO/Kernel-HOWTO.html</A></CODE>.
<P>
<P>Para instalar y compilar el n&uacute;cleo Linux, necesita tener abierta una cuenta
como root.
<P>
<OL>
<LI>Cambie al directorio <CODE>/usr/src</CODE><BR>
<CODE>cd /usr/src</CODE></LI>
<LI>Compruebe <CODE>/usr/src/linux</CODE> para ver si ya posee los fuentes
instalados.</LI>
<LI>Si no tiene los fuentes, cons&iacute;galos del <EM>directorio de fuentes de
n&uacute;cleo Linux</EM>
<CODE>
<A HREF="ftp://ftp.kernel.org/pub/Linux/kernel/v2.2">ftp://ftp.kernel.org/pub/Linux/kernel/v2.2</A></CODE>
o de su lugar r&eacute;plica m&aacute;s cercano.<BR>
Si est&aacute; buscando versiones anteriores del n&uacute;cleo (como la 1.2.X), &eacute;stas se
guardan en <EM>el directorio de fuentes de antiguos n&uacute;cleos Linux</EM>
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/kernel/old">ftp://sunsite.unc.edu/pub/Linux/kernel/old</A></CODE>.</LI>
<LI>Escoja el n&uacute;cleo adecuado - normalmente el m&aacute;s reciente es el que debe
buscar. Cons&iacute;galo y ponga el fichero tar con los fuentes en
<CODE>/usr/src</CODE>.<BR>
<B>Nota</B>: un fichero 'tar' es un archivo - posiblemente comprimido (como
los ficheros tar del n&uacute;cleo de Linux) que contiene muchos ficheros en varios
directorios. Es el equivalente Linux a un fichero zip con varios
directorios.
</LI>
<LI>Si ya tiene el c&oacute;digo fuente instalado pero desea actualizar a un
nuevo n&uacute;cleo, debe eliminar los fuentes antiguos. Utilice la
orden<BR>
<CODE>rm -rf /usr/src/linux</CODE></LI>
<LI>Ahora descomprima y extraiga los fuentes utilizando la
orden<BR>
<CODE>tar xzf linux-2.2.XX.tar.gz</CODE></LI>
<LI>Ahora, <CODE>cd /usr/src/linux</CODE> y lea el fichero README. Contiene
una excelente informaci&oacute;n acerca de c&oacute;mo configurar y compilar un nuevo
n&uacute;cleo. Lea este fichero (es una buena idea imprimirlo y tener una copia a
mano mientras se compila hasta que esto se ha realizado un n&uacute;mero suficiente
de veces para saber c&oacute;mo funciona todo).</LI>
</OL>
<P>
<H2><A NAME="ss7.2">7.2 Conocer su hardware</A>
</H2>

<P>Usted <B>DEBE</B> saber qu&eacute; tarjetas/dispositivos tiene en su PC si desea
recompilar el n&uacute;cleo. Para algunos dispositivos (como tarjetas de sonido)
tambi&eacute;n necesitar&aacute; saber otros ajustes (como IRQ's, direcciones E/S y cosas
por el estilo).
<P>
<H2><A NAME="ss7.3">7.3 Compilaci&oacute;n del N&uacute;cleo - Los n&uacute;cleos 1.3.x y 2.x.x </A>
</H2>

<P>Para comenzar el proceso de configuraci&oacute;n del n&uacute;cleo utilice
<P>
<BLOCKQUOTE><CODE>
<PRE>
make menuconfig
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>Esto ejecutar&aacute; un sistema de configuraci&oacute;n basado en men&uacute;s con ayuda en
l&iacute;nea que le permite adelantarse o atrasarse en el proceso de configuraci&oacute;n.
<P>
<P>Hay tambi&eacute;n una interfaz basada en X Window muy recomendable:
<BLOCKQUOTE><CODE>
<PRE>
make xconfig
</PRE>
</CODE></BLOCKQUOTE>
<P>
<P>Puede compilar el soporte PPP directamente dentro de su n&uacute;cleo o como un
m&oacute;dulo cargable.
<P>
<P>Si usted s&oacute;lo utiliza PPP la m&iacute;nima parte del tiempo en el que su m&aacute;quina
Linux est&aacute; funcionando, se recomienda compilar el soporte PPP como un m&oacute;dulo
cargable. Utilizando 'kerneld', su n&uacute;cleo cargar&aacute; autom&aacute;ticamente el/los
m&oacute;dulo(s) requeridos para proveer soporte PPP cuando arranque su proceso de
conexi&oacute;n PPP. Esto ahorra un valioso espacio en memoria: ninguna parte del
n&uacute;cleo puede sacarse de la memoria, pero los m&oacute;dulos cargables se eliminan
autom&aacute;ticamente si no se utilizan.
<P>
<P>Para hacer esto, debe habilitar el soporte de m&oacute;dulos cargables:-
<HR>
<PRE>
 Enable loadable module support (CONFIG_MODULES) [Y/n/?] y
</PRE>
<HR>
<P>Para a&ntilde;adir soporte PPP en el n&uacute;cleo, responda a la siguiente pregunta:-
<HR>
<PRE>
 PPP (point-to-point) support (CONFIG_PPP) [M/n/y/?]  
</PRE>
<HR>
<P>
<P>Para utilizar un m&oacute;dulo PPP cargable, responda <B>M</B>. Para compilar el
soporte PPP de modo interno al n&uacute;cleo, responda <B>Y</B>.
<P>
<H2><A NAME="ss7.4">7.4 Consideraciones generales de configuraci&oacute;n del n&uacute;cleo para PPP</A>
</H2>

<P>Si desea configurar su PC Linux como servidor PPP, debe compilar el soporte
de IP forwarding.  Esto tambi&eacute;n es necesario si desea utilizar Linux para
enlazar dos redes locales o su red local a Internet.
<P>
<P>Si est&aacute; enlazando una red local a Internet (o entrelazando dos redes
locales), deber&iacute;a preocuparse acerca de la seguridad. A&ntilde;adir el soporte para
cortafuegos IP en el n&uacute;cleo es, probablemente, una OBLIGACI&Oacute;N.
<P>
<P>Tambi&eacute;n necesitar&aacute; esto si desea utilizar enmascaramiento IP para conectar una
red local que utilice cualquiera de las direcciones IP reservadas para redes
locales desconectadas".
<P>
<P>Una vez instalado y reiniciado el nuevo n&uacute;cleo, puede comenzar a configurar
y a probar su(s) enlace(s) PPP.
<P>
<HR>
<A HREF="PPP-Como-8.html">Página siguiente</A>
<A HREF="PPP-Como-6.html">Página anterior</A>
<A HREF="PPP-Como.html#toc7">Índice general</A>
</BODY>
</HTML>
