<HTML>
<HEAD>
<TITLE>Linux XFree86 COMO: Configuraci&oacute;n de XFree86</TITLE>
</HEAD>
<BODY>
<A HREF="XFree86-Como-3.html">Anterior</A>
<A HREF="XFree86-Como-5.html">Siguiente</A>
<A HREF="XFree86-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Configuraci&oacute;n de XFree86</A></H2>


<P>La configuraci&oacute;n de XFree86 no es dif&iacute;cil en la mayor&iacute;a de los casos. De
todos modos, si se da el caso de que emplees hardware cuyos controladores
est&eacute;n en desarrollo, o desees obtener las mejores prestaciones o
resoluciones de una tarjeta gr&aacute;fica aceleradora, la configuraci&oacute;n de
XFree86 puede requerir tiempo en alg&uacute;n aspecto.</P>
<P>En esta secci&oacute;n describiremos c&oacute;mo crear y editar el archivo
<CODE>XF86Config</CODE>, que configura el servidor XFree86. En muchos casos es
mejor empezar con una configuraci&oacute;n ``b&aacute;sica'' de XFree86, que emplee una
resoluci&oacute;n baja, como 640x480, que deber&iacute;a ser soportada por todas las
tarjetas de v&iacute;deo y monitores de todo tipo. Una vez se tenga XFree86
funcionando a resoluci&oacute;n baja, est&aacute;ndar, se podr&aacute; jugar con la
configuraci&oacute;n para explotar las posibilidades de su hardware de v&iacute;deo. La
idea es que lo que se debe saber es si XFree86 funciona del todo en su
sistema, y de que no hay nada err&oacute;neo en la configuraci&oacute;n, antes de
intentar la a veces dif&iacute;cil tarea de configurar XFree86 para su aut&eacute;ntico
uso. </P>
<P>Adem&aacute;s de la documentaci&oacute;n relacionada aqu&iacute;, se debe leer la siguiente
documentaci&oacute;n: </P>
<P>
<UL>
<LI>La documentaci&oacute;n XFree86, en <CODE>/usr/X11R6/lib/X11/doc</CODE>
(contenida en el paquete <CODE>XFree86-3.1-doc</CODE>). Debe ser le&iacute;do
especialmente el fichero <CODE>README.Config</CODE>, que es un tutorial sobre
la configuraci&oacute;n de XFree86. 
</LI>
<LI>Varios chipsets de v&iacute;deo tienen ficheros <CODE>README</CODE> aparte,
sitos en el directorio mencionado antes (como <CODE>README.Cirrus</CODE> y
<CODE>README.S3</CODE>).  Le&aacute;nse si son aplicables a su caso. 
</LI>
<LI>La p&aacute;gina man para <CODE>XFree86</CODE>.</LI>
<LI>La p&aacute;gina man para <CODE>XF86Config</CODE>.
</LI>
<LI>La p&aacute;gina man para el servidor en concreto que se est&eacute; usando. (como
<CODE>XF86_SVGA</CODE> o <CODE>XF86_S3</CODE>). 
</LI>
</UL>
</P>
<P>El fichero principal de configuraci&oacute;n de XFree86 es
<CODE>/usr/X11R6/lib/X11/XF86Config</CODE>.  Este fichero contiene informaci&oacute;n
de su rat&oacute;n, par&aacute;metros de su tarjeta de v&iacute;deo, y dem&aacute;s cosas
relacionadas. El fichero <CODE>XF86Config.eg</CODE> se adjunta con la
distribuci&oacute;n como ejemplo. Copiar este fichero a <CODE>XF86Config</CODE> y
editarlo como punto de partida. </P>
<P>La p&aacute;gina man de <CODE>XF86Config</CODE> explica el formato de este fichero en
detalle.  L&eacute;ase esta p&aacute;gina ahora, si es que no lo ha hecho todav&iacute;a. </P>
<P>Vamos a presentar un fichero de configuraci&oacute;n de muestra
<CODE>XF86Config</CODE>, parte por parte. Este archivo puede no parecerse
exactamente al fichero incluido con la distribuci&oacute;n de XFree86, pero la
estructura es la misma. </P>
<P>T&eacute;ngase en cuenta que el formato del archivo <CODE>XF86Config</CODE> puede
variar con cada versi&oacute;n de XFree86; esta informaci&oacute;n s&oacute;lo es v&aacute;lida para
la versi&oacute;n 3.1 de XFree86. </P>
<P>Asimismo, no se debe copiar sin m&aacute;s el fichero de configuarci&oacute;n descrito
aqu&iacute; a su sistema e intentar usarlo. El intentar emplear un fichero de
configuraci&oacute;n que no se corresponde a su hardware puede someter al monitor
a funcionar a una frecuencia demasiado alta para el mismo; se ha informado
de monitores (especialmente monitores de frecuencia fija) que han sido
da&ntilde;ados o inutilizados por el uso de ficheros <CODE>XF86Config</CODE>
configurados incorrectamente. La conclusi&oacute;n: Aseg&uacute;rese completamente de
que su archivo <CODE>XF86Config</CODE> se corresponde a su hardware antes de
intentar hacer uso de &eacute;l. </P>
<P>Cada secci&oacute;n del fichero <CODE>XF86Config</CODE> va entre el par de l&iacute;neas</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Section &quot;section-name&quot;
  ...
EndSection
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La primera parte del fichero <CODE>XF86Config</CODE> es <CODE>Files</CODE>, que
tiene este aspecto: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Section &quot;Files&quot;
    RgbPath     &quot;/usr/X11R6/lib/X11/rgb&quot;
    FontPath    &quot;/usr/X11R6/lib/X11/fonts/misc/&quot;
    FontPath    &quot;/usr/X11R6/lib/X11/fonts/75dpi/&quot;
EndSection
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La l&iacute;nea <CODE>RgbPath</CODE> define la trayectoria o <EM>path</EM> hacia la base
de datos de color de X11R6, y cada l&iacute;nea <CODE>FontPath</CODE> define la
trayectoria hacia el directorio que contenga las fuentes X11. En general
no hace falta modificar estas l&iacute;neas; basta con cerciorarse de que hay una
entrada <CODE>FontPath</CODE> por cada tipo de fuente que se haya instalado
(es decir, por cada directorio de <CODE>/usr/X11R6/lib/X11/fonts</CODE>). </P>
<P>La siguiente secci&oacute;n es <CODE>ServerFlags</CODE>, que especifica distintos
par&aacute;metros para el servidor. Generalmente esta secci&oacute;n est&aacute; vac&iacute;a. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Section &quot;ServerFlags&quot;
# descomentar esto puede causar un ``core dump'' en el punto en que
# se reciba una signal. Esto puede dejar la consola en un estado inoperante,
# pero puede proveer un seguimiento de los fallos mejor al core dump para
# ayudar a localizar errores
#    NoTrapSignals

# Descomentar esto para inhabilitar la secuencia de salida del servidor 
#    DontZap
EndSection
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Aqu&iacute; tenemos todos los renglones comprendidos por las secciones descomentados.</P>
<P>La siguiente secci&oacute;n es <CODE>Keyboard</CODE>. Esta deber&aacute; ser bastante intuitiva.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Section &quot;Keyboard&quot;
    Protocol    &quot;Standard&quot;
    AutoRepeat  500 5
    ServerNumLock
EndSection
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Hay m&aacute;s opciones disponibles ---ver el fichero <CODE>XF86Config</CODE> si se
quiere modificar la configuraci&oacute;n del teclado--- lo anterior debe
funcionar en la mayor&iacute;a de los sistemas. </P>
<P>La siguiente secci&oacute;n es <CODE>Pointer</CODE>, que especifica los par&aacute;metros
para el rat&oacute;n. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Section &quot;Pointer&quot;

    Protocol    &quot;MouseSystems&quot;
    Device      &quot;/dev/mouse&quot;

# Baudrate y SampleRate son solo para algunos ratones Logitech 
#    BaudRate   9600
#    SampleRate 150

# Emulate3Buttons es una opcion para los ratones de 2 botones tipo Microsoft
#    Emulate3Buttons

# ChordMiddle es una opcion para algunos ratones de 3 botones Logitech
#    ChordMiddle

EndSection
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Las &uacute;nicas opciones que deber&iacute;an afectarle por ahora son <CODE>Protocol</CODE>
y <CODE>Device</CODE>. <CODE>Protocol</CODE> especifica el <EM>protocolo</EM> que su
rat&oacute;n usa (no la marca o modelo del rat&oacute;n). Los tipos v&aacute;lidos de
<CODE>Protocol</CODE> (bajo LiNUX, hay otras opciones disponibles para otros
Sistemas Operativos) son: </P>
<P>
<UL>
<LI> <CODE>BusMouse</CODE> </LI>
<LI> <CODE>Logitech</CODE></LI>
<LI> <CODE>Microsoft</CODE></LI>
<LI> <CODE>MMSeries</CODE></LI>
<LI> <CODE>Mouseman</CODE></LI>
<LI> <CODE>MouseSystems</CODE></LI>
<LI> <CODE>PS/2</CODE></LI>
<LI> <CODE>MMHitTab</CODE></LI>
</UL>
</P>
<P><CODE>BusMouse</CODE> Debe ser empleado con el rat&oacute;n tipo busmouse Logitech. 
T&eacute;ngase en cuenta que los ratones antiguos Logitech usar&aacute;n protocolos
<CODE>Logitech</CODE>, pero los nuevos ratones Logitech emplean protocolos
tanto <CODE>Microsoft</CODE> como <CODE>Mouseman</CODE>.  Este es un caso en el
que el protocolo no tiene que ver necesariamente con la marca o modelo del
rat&oacute;n. </P>
<P><CODE>Device</CODE> especifica el fichero de dispositivo con el que se puede
acceder al rat&oacute;n. En la mayor&iacute;a de los sistemas LiNUX, es
<CODE>/dev/mouse</CODE>.  <CODE>/dev/mouse</CODE> ES generalmente un enlace al
puerto serie apropiado (como <CODE>/dev/cua0</CODE>) para un rat&oacute;n serie, o al
dispositivo busmouse para ratones busmouse. En cualquiera de los casos,
asegurarse de que el fichero de dispositivo mencionado en <CODE>Device</CODE>
existe. </P>
<P>La siguiente secci&oacute;n es <CODE>Monitor</CODE>, que especifica las
caracter&iacute;sticas de tu monitor. Como con otras secciones del fichero
<CODE>XF86Config</CODE>, puede haber m&aacute;s de una secci&oacute;n <CODE>Monitor</CODE>. 
Esto es &uacute;til si se tiene m&aacute;s de un monitor conectado a un sistema, o si se
emplea el mismo fichero <CODE>XF86Config</CODE> con multiples configuraciones
de hardware.  No obstante, en general, s&oacute;lo se necesitar&aacute; una secci&oacute;n
<CODE>Monitor</CODE>. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Section &quot;Monitor&quot;

    Identifier  &quot;CTX 5468 NI&quot;

    # Estos valores son unicamente para un CTX 5468NI! No intentar emplearlo 
    # con su monitor (a menos que tenga este modelo)

    Bandwidth    60
    HorizSync    30-38,47-50
    VertRefresh  50-90

    # Modes: Name      dotclock  horiz                vert 

    ModeLine &quot;640x480&quot;  25       640 664 760 800      480 491 493 525
    ModeLine &quot;800x600&quot;  36       800 824 896 1024     600 601 603 625
    ModeLine &quot;1024x768&quot; 65       1024 1088 1200 1328  768 783 789 818

EndSection
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La l&iacute;nea <CODE>Identifier</CODE> se emplea para otorgar un nombre arbitrario a
la entrada <CODE>Monitor</CODE>. Esta puede ser una cadena; se emplear&aacute; para
referirse posteriormente a la entrada <CODE>Monitor</CODE> en el fichero
<CODE>XF86Config</CODE>. </P>
<P>Estas son listadas a continuaci&oacute;n.</P>
<P><CODE>HorizSync</CODE> especifica las frecuencias horizontales de sincronismo
para su monitor, en kHz. Si se tiene un monitor multisync, tiene que ser
un rango de valores (o varios rangos separados por comas), como se ve a
continuaci&oacute;n. Si se tiene un monitor de frecuencia fija, debe ser una
relaci&oacute;n de valores concretos, como: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    HorizSync    31.5, 35.2, 37.9, 35.5, 48.95
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El manual del monitor debe proporcionar esos valores en las
especificaciones t&eacute;cnicas. Si no se dispone de esta informaci&oacute;n, se puede
contactar tanto con el fabricante como con el vendedor del monitor para
obtenerlas. Tambi&eacute;n existen otras fuentes de informaci&oacute;n. </P>
<P><CODE>VertRefresh</CODE> especifica los intervalos verticales de refresco
horizontal v&aacute;lidos (o frecuencias de sincronismo vertical) para el
monitor, en Hz.  Como <CODE>HorizSync</CODE>, este dato puede ser un intervalo
o una lista de valores discretos; el manual del monitor debe de tener una
lista de ellos. </P>
<P><CODE>HorizSync</CODE> y <CODE>VertRefresh</CODE> se emplean s&oacute;lo para comprobar
doblemente que las resoluciones de pantalla que se especifiquen est&aacute;n
comprendidas en los intervalos v&aacute;lidos. Esto se hace para disminuir el
riesgo de da&ntilde;ar el monitor, intentando hacerlo funcionar a una frecuencia
para la que no est&aacute; dise&ntilde;ado. </P>
<P>la indicaci&oacute;n <CODE>ModeLine</CODE> se emplea para especificar una &uacute;nica
resoluci&oacute;n para el monitor. El formato de <CODE>ModeLine</CODE> es</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ModeLine nombre valores_de_reloj valores_horiz. valores_vert.
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><CODE>nombre</CODE> es una cadena arbitraria, que se emplear&aacute; para referirse a
dicho modo de resoluci&oacute;n en el archivo posteriormente.
<CODE>valores_de_reloj</CODE> son las frecuencias de reloj a las que se
somete, o ``dot-clock'' asociado a dicho modo de resoluci&oacute;n. La frecuencia
de reloj se especifica normalmente en MHz, y es el rango al cual la
tarjeta de v&iacute;deo deber&aacute; mandar los ``pixels'' al monitor a esa resoluci&oacute;n. 
<CODE>valores_horiz</CODE> y <CODE>valores_vert</CODE> son cuatro valores,
especificando cada uno cu&aacute;ndo debe de dispararse el haz de electrones, y
cu&aacute;ndo tienen lugar los pulsos horizontales y verticales de sincronismo
durante un barrido. </P>
<P>¿C&oacute;mo se pueden determinar los valores de <CODE>ModeLine</CODE> para su
monitor?  El fichero <CODE>VideoModes.doc</CODE>, incluido con la distribuci&oacute;n
de XFree86, describe en detalle c&oacute;mo determinar esos valores para cada
modo de resoluci&oacute;n que soporte el monitor. Antes que nada,
<CODE>valores_de_reloj</CODE> debe corresponderse a uno de los valores de
``dot-clock'' que pueda producir su tarjeta. Posteriormente, en el archivo
<CODE>XF86Config</CODE> especificaremos estos valores; s&oacute;lo se pueden usar
modos de v&iacute;deo con un valor de <CODE>frecuencia_de_reloj</CODE> soportados por la
tarjeta de v&iacute;deo.</P>
<P>Hay dos ficheros incluidos en la distribuci&oacute;n de XFree86 que puede que
contengan valores de <CODE>ModeLine</CODE> para su monitor. Estos archivos son
<CODE>modeDB.txt</CODE> y <CODE>Monitors</CODE>, residiendo ambos en
<CODE>/usr/X11R6/lib/X11/doc</CODE>. </P>
<P>Se debe comenzar con los valores de <CODE>ModeLine</CODE> para los tiempos
correspondientes al monitor est&aacute;ndar VESA, que son soportados por la
mayor&iacute;a de los monitores. <CODE>modeDB.txt</CODE> incluye valores de tiempo
para resoluciones VESA est&aacute;ndar. En ese fichero, se ver&aacute;n entradas como: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# 640x480@60Hz Non-Interlaced mode
# Horizontal Sync = 31.5kHz
# Timing: H=(0.95us, 3.81us, 1.59us), V=(0.35ms, 0.064ms, 1.02ms)
#
# name        clock   horizontal timing     vertical timing      flags
 &quot;640x480&quot;     25.175  640  664  760  800    480  491  493  525
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Este es un valor de tiempo est&aacute;ndar VESA para un modo de v&iacute;deo 640x480. 
Emplea un ``dot-clock'' de 25.175, que debe de ser soportado por la
tarjeta de v&iacute;deo para usar este modo (m&aacute;s sobre esto despu&eacute;s). Para
incluir esta entrada
en el archivo <CODE>XF86Config</CODE>, deber&aacute; emplearse la l&iacute;nea:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ModeLine &quot;640x480&quot; 25.175 640 664 760 800 480 491 493 525
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>T&eacute;ngase en cuenta que el argumento <CODE>nombre</CODE> para <CODE>ModeLine</CODE> (en este
caso <CODE>&quot;640x480&quot;</CODE>) es una cadena de valores arbitrarios
--- por convenci&oacute;n, se nombra el modo tras la resoluci&oacute;n, pero <CODE>nombre</CODE>
puede ser t&eacute;cnicamente cualquier dato descriptivo que d&eacute; una referencia
sobre el modo para nosotros.---</P>
<P>Para cada <CODE>ModeLine</CODE> empleado, el servidor comprobar&aacute; que las
especificaciones para dicho modo caen dentro del intervalo de valores
especificados con <CODE>Bandwidth</CODE>, <CODE>HorizSync</CODE> y
<CODE>VertRefresh</CODE>. </P>
<P>Si no es as&iacute;, el servidor protestar&aacute; cuando se intente iniciar X (m&aacute;s
sobre esto m&aacute;s adelante). Por cierta raz&oacute;n, el ``dot-clock'' empleado por
el modo en cuesti&oacute;n no deber&aacute; ser mayor que el valor usado por
<CODE>Bandwidth</CODE>.  (No obstante, en muchos casos es m&aacute;s seguro el uso de
modos con un ancho de banda ligeramente mayor del que el monitor puede
soportar.)  Si los valores est&aacute;ndar VESA no funcionan en su caso (sabr&aacute;,
tras intentarlo, usarlos m&aacute;s adelante) es momento de mirar en
<CODE>modeDB.txt</CODE> y <CODE>Monitors</CODE>, que incluyen valores para modos
espec&iacute;ficos de muchos tipos de monitor.  Se pueden crear entradas
<CODE>ModeLine</CODE> para los valores hallados en esos dos ficheros tambi&eacute;n.
Aseg&uacute;rese de s&oacute;lo emplear valores para el modelo espec&iacute;fico de monitor que
se tenga. </P>
<P>T&eacute;ngase en cuenta que muchos monitores de 14 y 15 pulgadas no soportan los
modos de resoluci&oacute;n m&aacute;s altos, ni a veces resoluciones de 1024x768 a
valores bajos de frecuencias de reloj. Esto significa que si no puede
encontrar modos de alta resoluci&oacute;n para su monitor en esos archivos, es
muy probable que el monitor no los soporte.</P>
<P>Si se est&aacute; completamente perdido, y no se puede hacer funcionar los
valores <CODE>ModeLine</CODE> para su monitor, se puede seguir las
instrucciones del archivo <CODE>VideoModes.doc</CODE>, incluido con la
distribuci&oacute;n de XFree86, para generar valores de <CODE>ModeLine</CODE> de las
especificaciones enumeradas en el manual del monitor. Aunque el tiempo
requerido para intentar generar valores <CODE>ModeLine</CODE> a mano puede
variar, este es un buen sitio donde mirar si no se encuentran los valores
que se precisan. <CODE>VideoModes.doc</CODE> tambi&eacute;n describe el formato de la
indicaci&oacute;n <CODE>ModeLine</CODE> y otros aspectos del servidor XFree86 con
morboso detalle. </P>
<P>Por &uacute;ltimo, si se obtienen valores <CODE>ModeLine</CODE> que son casi, pero no
del todo correctos, puede ser posible ir modificando ligeramente sus
valores hasta obtener los resultados deseados. Por ejemplo, si al
ejecutarse XFree86 la imagen del monitor se desv&iacute;a ligeramente, o parece
fluctuar, se pueden seguir las instrucciones del fichero
<CODE>VideoModes.doc</CODE> para intentar corregir esos valores. ¡Aseg&uacute;rese
tambi&eacute;n de comprobar los mandos del monitor propiamente dicho! En muchos
casos es necesario cambiar el tama&ntilde;o horizontal o vertical de la imagen
tras arrancar XFree86 para centrarla y ajustar su tama&ntilde;o correctamente. El
tener dichos mandos de control en el frontal del monitor pueden desde
luego hacerle la vida m&aacute;s f&aacute;cil. </P>
<P>No se deben emplear valores de frecuencia o de <CODE>ModeLine</CODE> para
otros modelos de monitor que no sea el suyo. Si se intenta someter al
monitor a otra frecuencia para la que no est&eacute; dise&ntilde;ado, se puede da&ntilde;ar o
incluso inutilizar definitivamente. </P>
<P>La siguiente secci&oacute;n del fichero <CODE>XF86Config</CODE> es <CODE>Device</CODE>,
que especifica los par&aacute;metros de su tarjeta de v&iacute;deo. He aqu&iacute; un ejemplo.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Section &quot;Device&quot; 
        Identifier &quot;#9 GXE 64&quot;

        # Nada por ahora; completaremos estos valores posteriormente.

EndSection
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esta secci&oacute;n define las propiedades de una tarjeta de v&iacute;deo en particular. 
<CODE>Identifier</CODE> es una secuencia arbitraria que describe a la tarjeta; 
usaremos esta secuencia para referirnos a la tarjeta posteriormente.</P>
<P>Inicialmente, no es preciso incluir nada en la secci&oacute;n <CODE>Device</CODE>,
excepto en <CODE>Identifier</CODE>. Esto se debe a que emplearemos el propio
servidor X para probar las propiedades de la tarjeta de v&iacute;deo,
introduci&eacute;ndolas en la secci&oacute;n <CODE>Device</CODE> m&aacute;s tarde.  El servidor
XFree86 es capaz de comprobar el chipset de v&iacute;deo, las frecuencias de
reloj, RAMDAC, y la cantidad de RAM de v&iacute;deo que tiene la tarjeta. </P>
<P>No obstante, antes de que hagamos esto, necesitamos terminar de escribir
el fichero <CODE>XF86Config</CODE>. La siguiente secci&oacute;n es <CODE>Screen</CODE>,
que especifica la combinaci&oacute;n de tarjeta de v&iacute;deo/monitor a usar por un
servidor en particular. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 Section &quot;Screen&quot;
     Driver     &quot;Accel&quot;
     Device     &quot;#9 GXE 64&quot;
     Monitor    &quot;CTX 5468 NI&quot;
     Subsection &quot;Display&quot;
         Depth      16
         Modes      &quot;1024x768&quot; &quot;800x600&quot; &quot;640x480&quot;
         ViewPort   0 0
         Virtual    1024 768
     EndSubsection
 EndSection
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La l&iacute;nea <CODE>Driver</CODE> especifica el servidor X que se va a emplear. 
Los valores v&aacute;lidos para <CODE>Driver</CODE> son: </P>
<P>
<UL>
<LI><CODE>Accel</CODE>: Para los servidores <CODE>XF86_S3</CODE>,
<CODE>XF86_Mach32</CODE>, <CODE>XF86_Mach8</CODE>, <CODE>XF86_8514</CODE>,
<CODE>XF86_P9000</CODE>, <CODE>XF86_AGX</CODE>, y <CODE>XF86_W32</CODE> ; 
</LI>
<LI> <CODE>SVGA</CODE>: Para el servidor <CODE>XF86_SVGA</CODE> ;</LI>
<LI> <CODE>VGA16</CODE>: Para el servidor <CODE>XF86_VGA16</CODE> ;</LI>
<LI> <CODE>VGA2</CODE>: Para el servidor <CODE>XF86_Mono</CODE> ;
</LI>
<LI> <CODE>Mono</CODE>: Para los controladores de los servidores no-VGA
monocromos de <CODE>XF86_Mono</CODE> y <CODE>XF86_VGA16</CODE>. 
</LI>
</UL>
</P>
<P>Debe de asegurarse de que <CODE>/usr/X11R6/bin/X</CODE> es un enlace simb&oacute;lico
al servidor que se est&eacute; empleando. </P>
<P>La l&iacute;nea <CODE>Device</CODE> especifica la secuencia <CODE>Identifier</CODE> de la
secci&oacute;n <CODE>Device</CODE> correspondiente a la tarjeta de v&iacute;deo a emplear
para dicho servidor. Anteriormente, creamos una secci&oacute;n <CODE>Device</CODE>
con la l&iacute;nea</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Identifier &quot;#9 GXE 64&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Por tanto, empleamos <CODE>&quot;#9 GXE 64&quot;</CODE> en la l&iacute;nea
<CODE>Device</CODE> aqu&iacute;. </P>
<P>An&aacute;logamente, la l&iacute;nea <CODE>Monitor</CODE> especifica el nombre de la secci&oacute;n
<CODE>Monitor</CODE> a usarse con este servidor. Aqu&iacute;, <CODE>&quot;CTX 5468
NI&quot;</CODE> es el <CODE>Identifier</CODE> empleado para la secci&oacute;n
<CODE>Monitor</CODE> descrita anteriormente. </P>
<P><CODE>Subsection &quot;Display&quot;</CODE> define varias propiedades del
servidor XFree86 correspondientes a su combinaci&oacute;n de monitor/tarjeta de
v&iacute;deo.  El archivo <CODE>XF86Config</CODE> describe todas estas opciones en
detalle;  la mayor&iacute;a de ellas son para ``poner la guinda'' al pastel y no
son necesarias para hacer funcionar el sistema. </P>
<P>Las opciones que debe conocer son:</P>
<P>
<UL>
<LI> <CODE>Depth</CODE>. Define el n&uacute;mero de planos de color ---el n&uacute;mero de
bits por pixel---. Normalmente, <CODE>Depth</CODE> est&aacute; configurado a 8. Para
el servidor <CODE>VGA16</CODE>, se debe usar una profundidad (de color) de 4,
y para el servidor monocromo una profundidad de 1. Si se est&aacute; empleando
una tarjeta aceleradora con suficiente memoria para soportar m&aacute;s bits por
pixel, se puede definir <CODE>Depth</CODE>
<SL>Profundidad.</SL>
 a
16, 24, o 32.  Si se experimentan problemas con profundidades de color
superiores a 8, config&uacute;relo para 8 nuevamente e intente solucionar el
problema m&aacute;s adelante. 
</LI>
<LI> <CODE>Modes</CODE>. Esta es la lista de nombres de modos de v&iacute;deo que
han sido definidos empleando la etiqueta <CODE>ModeLine</CODE> de la secci&oacute;n
<CODE>Monitor</CODE>. 

En la anterior secci&oacute;n empleamos a <CODE>ModeLines</CODE> con el nombre
<CODE>&quot;1024x768&quot;</CODE>, <CODE>&quot;800x600&quot;</CODE>, y
<CODE>&quot;640x480&quot;</CODE>.  Por tanto, usaremos una l&iacute;nea
<CODE>Modes</CODE> tal como

<BLOCKQUOTE><CODE>
<PRE>
         Modes    &quot;1024x768&quot; &quot;800x600&quot; &quot;640x480&quot;
</PRE>
</CODE></BLOCKQUOTE>


El primer modo que aparece en esta l&iacute;nea ser&aacute; el adoptado por defecto al
arrancar XFree86. Una vez se est&eacute; ejecutando XFree86, se puede cambiar
entre los modos que aparezcan aqu&iacute; empleando las teclas
<CODE>ctrl-alt-numerico +</CODE> y <CODE>ctrl-alt-numerico -</CODE>. 

Lo mejor ser&iacute;a emplear modos de baja resoluci&oacute;n al configurar inicialmente
XFree86, como 640x480, que tender&aacute;n a funcionar en la mayor&iacute;a de los
sistemas.  Una vez se tenga la configuraci&oacute;n b&aacute;sica funcionando, se puede
modificar <CODE>XF86Config</CODE> para proporcionar mayores resoluciones. 
</LI>
<LI><CODE>Virtual</CODE>. Establece el tama&ntilde;o de escritorio virtual. XFree86
posee la capacidad de emplear la memoria adicional disponible en su
tarjeta para aumentar el tama&ntilde;o de su escritorio. Cuando mueva el puntero
del rat&oacute;n al borde de la pantalla, el escritorio se desplazar&aacute;,
visualizando el espacio adicional.  Por tanto, incluso si se emplean los
modos de menor resoluci&oacute;n como 800x600, se puede definir <CODE>Virtual</CODE>
a la resoluci&oacute;n total que pueda proporcionar su tarjeta (una tarjeta de
v&iacute;deo de 1 megabyte puede soportar 1024x768 con una profundidad de 8 bits
por pixel; una tarjeta de 2 megabytes 1280x1024 con una profundidad de 8,
o 1024x768 a una profundidad de 16)
<SL>N. del T. Recu&eacute;rdese, esto
siempre que la tarjeta CUMPLA los est&aacute;ndares VESA, cosa que no todas
hacen, como referenciamos antes, especialmente las
<EM>superbaratas</EM>.</SL>
.  Por supuesto, la superficie al completo
nunca podr&aacute; estar visible al completo, pero sigue pudiendo ser empleada. 

La capacidad <CODE>Virtual</CODE> es una forma estupenda de emplear la memoria
de su tarjeta de v&iacute;deo, pero es m&aacute;s bien limitada. Si se desea utilizar un
verdadero escritorio virtual, sugerimos emplear <CODE>fvwm</CODE>, o un gestor
de ventanas similar en su lugar. <CODE>fvwm</CODE> permite tener escritorios
virtuales suficientemente grandes (implementado mediante la ocultaci&oacute;n de
ventanas y similar, en vez de almacenar el escritorio completo en la
memoria de v&iacute;deo de golpe). Ver las p&aacute;ginas <CODE>man</CODE> de <CODE>fvwm</CODE> para
obtener m&aacute;s detalles sobre esto; la mayor&iacute;a de los sistemas LiNUX emplean
<CODE>fvwm</CODE> por defecto. 
</LI>
<LI><CODE>ViewPort</CODE>. Si se emplea la opci&oacute;n <CODE>Virtual</CODE> descrita
anteriormente, <CODE>ViewPort</CODE> define las coordinadas de la esquina
superior izquierda del escritorio virtual al arrancar XFree86.  Lo m&aacute;s
usado es <CODE>Virtual 0 0</CODE>; si no se especifica as&iacute;, el escritorio se
centra en la pantalla del escritorio virtual (lo cual puede no ser lo
deseado). 
</LI>
</UL>
</P>
<P>Existen muchas opciones para esta secci&oacute;n; ver la p&aacute;gina <CODE>man</CODE> de
<CODE>XF86Config</CODE> para una descripci&oacute;n completa. En la pr&aacute;ctica no son
necesarias estas opciones para conseguir que XFree86 funcione
inicialmente. </P>

<HR>
<A HREF="XFree86-Como-3.html">Anterior</A>
<A HREF="XFree86-Como-5.html">Siguiente</A>
<A HREF="XFree86-Como.html#toc4">Indice</A>
</BODY>
</HTML>
