<HTML>
<HEAD>
<TITLE>Terminales Serie COMO: Hardware</TITLE>
</HEAD>
<BODY>
<A HREF="Terminales-Como-1.html">Anterior</A>
<A HREF="Terminales-Como-3.html">Siguiente</A>
<A HREF="Terminales-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Hardware</A></H2>



<H2><A NAME="ss2.1">2.1 Puertos serie</A></H2>


<P>Puertos serie hay de 2 tipos: Los DB25 y los DB9.</P>
<P>Los DB9 son los vulgarmente (e incorrectamente) conocidos como puertos de
mouse. Tienen 9 patillas y son &quot;macho&quot; es decir: que las
patillas son pinchos. En los conectores &quot;hembra&quot;, las patillas
son orificios para que entren los pinchos. Cualquier semejanza con el sexo
real est&aacute; hecha con toda la intencionalidad. <CODE>:-)</CODE></P>
<P>&ensp; <BR></P>
<P>&ensp; <BR></P>

<H3>Puerto serie DB9</H3>


<P>A continuaci&oacute;n os pongo un &quot;gr&aacute;fico&quot; cutre para que sep&aacute;is que
es lo que hay que ver detr&aacute;s del PC para localizar el puerto serie: 
<BLOCKQUOTE><CODE>
<PRE>
                             .---------------.
                             \   o o o o o   /
                              \   o o o o   /
                               `-----------'
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si localiz&aacute;is alguno, que adem&aacute;s tiene que ser macho (pinchos) 
seguramente se trata de un puerto serie. </P>
<P>Si lo encontr&aacute;is en su versi&oacute;n &quot;hembra&quot; (con orificios) se
trata de el adaptador de V&Iacute;DEO (CGA, H&eacute;rcules, EGA o VGA-digital). </P>

<H3>Puerto serie DB25</H3>

<P>Tambi&eacute;n pod&eacute;is encontrar su versi&oacute;n de 25 pines:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
                     .-------------------------------.
                     \   o o o o o o o o o o o o o   /
                      \   o o o o o o o o o o o o   /
                       `---------------------------' 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Igualmente, las patillas tienen que ser pinchos. Si son orificios, se
trata de un puerto de impresora. </P>
<P>Deb&eacute;is localizar uno de los dos en cada uno de los PCs (<B>Linux</B> y
terminal)  Seguramente vais a encontrar que en alguno de ellos hay de los
dos. Para saber si se trata del COM1 o del COM2 lo m&aacute;s pr&aacute;ctico es
conectar un rat&oacute;n y cargar el driver para COM1 o para COM2 y ver si
funciona. </P>
<P>Las situaciones m&aacute;s normales son:</P>
<P>
<UL>
<LI>Si s&oacute;lo se encuentra uno de ellos, es el COM1;</LI>
<LI>Si se encuentran los dos, normalmente el peque&ntilde;o es el COM1 y el
otro es el COM2; 
</LI>
<LI>Si hay 2 peque&ntilde;os hay que descifrar cu&aacute;l es el COM1 y cu&aacute;l el COM2. 
Esto sucede con equipos <I>HP</I> y <I>COMPAQ</I>, y suele venir indicado cu&aacute;l
es el 1 y cu&aacute;l es el 2. Si no, a por un rat&oacute;n serie y hacer pruebas. 
</LI>
<LI><I>¡No los encuentro!</I>: Mejor pasar un programa de informaci&oacute;n del
PC para saber si hay puertos serie disponibles. Uno de f&aacute;cil localizaci&oacute;n
es el <CODE>msd.exe</CODE> del MSDOS6.2 (Teclear <CODE>msd</CODE> y pulsar la C). </LI>
</UL>
</P>
<P>Una vez localizados los puertos serie de cada PC, voy a escribir algunas
recomendaciones: </P>
<P>
<UL>
<LI>Mejor no utilizar el COM3 si se usa el COM1. Igualmente no usar el
COM4 si se usa el COM2
<SL>N. del Revisor: <BR> 
Podremos usar dichos puertos siempre que: <BR>
a) Configuremos el hardware (por BIOS o por <I>jumpers</I>) para
usar alguna otra IRQ libre, y <BR> 
b) Configuremos el Linux para que los inicialice al arrancar con
el comando <CODE>setserial</CODE>, ver <I>Serie-Como</I>.</SL>

</LI>
<LI><I>Cuidad&iacute;n cuidad&iacute;n</I> con los tornillos que hay en los lados de los
conectores; hay que comprobar que est&aacute;n bien atornillados ya que de lo
contrario podr&iacute;a caer la tuerca interior dentro de la caja del PC y
provocar un desastre. 
</LI>
</UL>
</P>


<HR>
<A HREF="Terminales-Como-1.html">Anterior</A>
<A HREF="Terminales-Como-3.html">Siguiente</A>
<A HREF="Terminales-Como.html#toc2">Indice</A>
</BODY>
</HTML>
