<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="es">
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <TITLE>LF vol. 4,SIZE=5><B>Real-Time Linux (RT-Linux) </TITLE>
 <META name="Author" CONTENT="Ismael Ripoll">
 <META name="Keywords" CONTENT="Real-Time Linux, Operating Systems">
 <META name="Description" CONTENT="Free online magazine on Linux for users and developers">
 <META name="Copyright" CONTENT="&copy; 1998 LinuxFocus">
 <META name="Translator" CONTENT="">
 <META name="Date" CONTENT="1998-02-03T00:00:00Z">


</HEAD>

<BODY bgcolor="#FFFFFF"  text="#000000" link="#ff0033" vlink="#FF3333">

  <MAP name="navegator">
  <AREA shape="rect" coords="0, 0, 65, 28" alt="Hogar" href="../">
  <AREA shape="rect" coords="66, 0, 124, 28" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="125, 0, 193, 28" alt="Busqueda" href="../search.html">
  <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
  <AREA shape="rect" coords="261, 0, 350, 28" alt="Sobre Nosotros" href="../aboutus.html">
  </MAP>



 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0">

 <THEAD>
   <TR align="center">
      <TD colspan="2"><IMG src="../../common/May1998/border-short.jpg" alt="[LinuxFocus Image]" width="407" height="88"></TD>
   </TR>

   <TR align="center">
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/May1998/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28" alt="[Navegation Bar]"></TD>
   </TR>

   <TR align="center">
     <TD colspan="2">     
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5">
		<TR bgcolor="#000000">
		   <TD align="center">
               <A href="../News/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Noticias</B></FONT></A>
               <A href="../Archives/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Archivos</B></FONT></A>
               <A href="../Companies/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Compa&ntilde;&iacute;as</B></FONT></A>
               <A href="../Tips/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Consejos y Trucos &nbsp;</B></FONT></A> 
               </TD>
            </TR>
            
		<TR>
            <!--   Here goes the Title of the article, authors name and abstract -->
		   <TD align="center">
			  <FONT face="Helvetica,Arial" color="#660066"><H1> Real-Time Linux (RT-Linux) </H1></FONT>
			  <FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:iripoll@disca.upv.es"><FONT color="#000000">Ismael Ripoll</FONT></A></H3></FONT>

                  <HR size="2" noshade>
	         </TD>
            </TR>

           </TABLE>

     </TD>
   </TR>

 </THEAD>



 <TBODY>
  
 <TR>
    <TD valign="top" align="center">
           <H4><A href="#intro">&iquest;Qu&eacute; es Tiempo-Real?</A></H4>
           <H4><A href="#segundo">S.O. y Tiempo-Real</A></H4>
           <H4><A href="#futuro">Futuro de RT-Linux</A></H4>
           <H4><A href="#conclu">Conclusiones</A></H4>

    </TD>
   
    <TD align="center">
       <TABLE border="0" width="80%" cellspacing="0" cellpadding="0">
	  <TR>
          <TD>

<p align=right><I>Introducci&oacute;n a los  conceptos b&aacute;sicos de Tiempo-Real
(TR). Tiempo real estricto con RT-Linux.</I></p>


<A name="intro"></A>      
<H3><FONT face="Helvetica,Arial" color="#660033">
&iquest;Qu&eacute; es Tiempo-Real?
</FONT></H3>


Antes de  presentar RT-Linux es  necesario aclarar algunas ideas sobre
qu&eacute; es Tiempo Real. Diremos que: </FONT>


<P>  <I>&quot;Un   sistema     de tiempo   real    es   aquel  sistema
inform&aacute;tico en    el que la    correcci&oacute;n del sistema no
s&oacute;lo depende    de   los  resultados  l&oacute;gicos    de  los
algoritmos, sino que  tambi&eacute;n  depende del  momento  en el  que
estos se producen.&quot;</I>

<P>No es suficiente que  los resultado obtenidos sean correctos,  sino
que tienen que tienen que  obtenerse dentro de  un intervalo de tiempo
especificado.  Observa que de esta definici&oacute;n  no se deduce que
un sistema de  tiempo real tenga  se ser necesariamente r&aacute;pido,
como  quiz&aacute;s  se  pudiera pensar. Por   ejemplo:  el sistema de
guiado de un barco pude parecer en principio que no es de tiempo real,
pues la  velocidad del barco  es relativamente  baja  y normalmente se
dispone de &quot;bastante&quot; tiempo (del  orden de algunos minutos)
para tomar las decisiones de control. Pero s&iacute; que es un sistema
de TR seg&uacute;n la definici&oacute;n anterior.

<P>  Observa que lo  que   he definido es  un sistema  &quot;<U>de</U>
tiempo-real&quot;  y no un  sistema &quot;<U>en</U> tiempo-real&quot;.
Un sistema  &quot;en  tiempo-real&quot;  es   lo que  normalmente   se
entiende por  un  sistema  r&aacute;pido,    capaz de   dar   la
impresi&oacute;n   de  &quot;realidad&quot;.  T&iacute;picamente todas
las simulaciones y juegos interactivos quieren dan la impresi&oacute;n
de continuidad en   el  tiempo y cuantas  m&aacute;s   im&aacute;genes
generen mejor.

<P>  Vamos  a ver con   un poco  m&aacute;s  de detalle  qu&eacute; se
entiende   por  &quot;restricci&oacute;n temporal&quot;.    Supon  que
queremos controlar la velocidad de un motor que est&aacute; sometido a
una carga  variable,   supongamos tambi&eacute;n  que  ese  control lo
queremos realizar utilizando un  control PID (Proporcional,  Integral,
Derivativo).   El control PID  desde nuestro  punto   de vista es  una
funci&oacute;n a la  que se le  pasan unos par&aacute;metros --en este
ejemplo,  la velocidad  actual del motor--   y retorna el  valor de la
se&ntilde;al   de    control  que hay   que    aplicar  al  motor --la
tensi&oacute;n   con   la   que hay    que  alimentar   el  motor.  La
teor&iacute;a,  que por cierto  es mucha,  que  hay detr&aacute;s  del
dise&ntilde;o   de  los  algoritmos PID     supone  que el  tiempo  de
c&oacute;mputo es  despreciable,  esto es,  desde  que  se  lee la
velocidad  del motor hasta que se  act&uacute;a  pasa muy poco tiempo.
Normalmente     se    puede   tolerar    un    cierto  retraso.   Otra
caracter&iacute;stica de este tipo de control es  que se debe realizar
de  forma  peri&oacute;dica, esto es,  el algoritmo  PID  se tiene que
ejecutar regularmente.  Si   entre dos invocaciones  consecutivas a la
funci&oacute;n PID  pasa   demasiado tiempo, entonces el   motor puede
alcanzar una velocidad no deseada.  En  resumen: podemos considerar la
funci&oacute;n PID como un  programa que se   ha de ejecutar  de forma
peri&oacute;dica (Pi); desde  que la ponemos en ejecuci&oacute;n hasta
que acaba ha de estar acotado por  lo m&aacute;ximo que viene impuesto
por  la   teor&iacute;a  de  dise&ntilde;o  del  PID   (Di) y  que  en
funci&oacute;n de la velocidad  del procesador que tengamos  el tiempo
de ejecuci&oacute;n del  propio c&oacute;digo PID  emplea una cantidad
de tiempo (Ci).


<P><SPACER TYPE=HORIZONTAL SIZE=15>Pi: Periodo de la tarea i.</P>
<P><SPACER TYPE=HORIZONTAL SIZE=15>Di: Plazo de ejecuci&oacute;n (deadline) de la tarea i.</P>
<P><SPACER TYPE=HORIZONTAL SIZE=15>Ci: Tiempo de computo en el peor de los casos de la tarea i.</P>

Si el  sistema est&aacute; compuesto por  una  sola tarea, entonces no
hay problema de tiempo real: o el procesador puede hacer el trabajo en
el  tiempo requerido,  o  no.    En caso de   ser  lo  suficientemente
r&aacute;pido  el procesador,    entonces  simplemente  se cambia   de
procesador.

<P>
Los  problemas de TR aparecen cuando  el sistema est&aacute; compuesto
por  varias tareas, y hay que  repartir el procesador (o procesadores)
entre    todas  ellas.  Para  ello no    podemos   utilizar un sistema
cl&aacute;sico  de tiempo compartido  como puede ser  el utilizado por
Linux con los  procesos normales. No en necesario  decir que  ni se te
ocurra  hacer  programas que requieran   tiempo real en Windows...  Un
consejo a&uacute;n  mejor:  no hagas  ning&uacute;n programa  bajo ese
producto.

<p>
<P>
No todos los  sistema  de tiempo real son    iguales, no es lo   mismo
controlar el sistema de frenado ABS  de un coche o la inyecci&oacute;n
de  combustible   en    el   motor  de   un     avi&oacute;n,  que  la
descompresi&oacute;n y visualizaci&oacute;n de un fichero mpeg.  En el
primer  caso, la  perdida   de alg&uacute;n plazo  de ejecuci&oacute;n
puede producir perdidas  humanas  o graves perdidas materiales;  en el
segundo caso, sencillamente   se  tiene una degradaci&oacute;n de   la
calidad del   sistema   (la imagen se queda    congelada   o se pierde
alg&uacute;n  fotograma). A los primeros se   les llama <B>sistemas de
tiempo real estricto</B> (hard real-time)  y a los segundo <B>sistemas
de   tiempo real blando</B> (soft  real-time).   Nos centraremos en el
estudio de los sistemas de tiempo real estricto.

<P>
El dise&ntilde;o de un sistema de tiempo real pasa por varias fases.  Primero
se identifican  las tareas a realizar  y las  restricciones temporales
que deben cumplir; luego se  escriben los programas que ejecutar&aacute;n las
tareas; despu&eacute;s se   mide el tiempo  de  c&oacute;mputo  de cada  tarea  y se
realiza  un     an&aacute;lisis   de  planificabilidad.   El    an&aacute;lisis   de
planificabilidad consiste   en  aplicar unas  pruebas  al  conjunto de
tareas de   tal forma que si  &eacute;stas  pasan el  test  entonces se puede
garantizar que  ninguna tarea  perder&aacute;  su plazo  de ejecuci&oacute;n.  Si no
pasan el test entonces se  tiene que volver  al principio y empezar de
nuevo, utilizando otro  procesador   m&aacute;s potente o   utilizando  otros
algoritmos para implementar las tareas.

<P>
Resumiendo: Las  tareas se modelan  con tres  n&uacute;meros: P, D  y  C.  El
objetivo del sistema es garantizar que  todas las tareas (en todas sus
activaciones)  cumplan   sus    plazos de ejecuci&oacute;n.     La  forma  de
conseguirlo es  teniendo  un sistema <B>predecible.</B>  Decir  que un
sistema es de  tiempo real o que es  un sistema es predecible es decir
casi lo mismo.

<A name="segundo"></A>      
<H3><FONT face="Helvetica,Arial" color="#660033">
&iquest;Qu&eacute; tiene que ver el Sistema Operativo con el Tiempo-Real?
</FONT></H3>


La correcci&oacute;n  sem&aacute;ntica  de la   respuesta  es  responsabilidad   del
programador,  y la  correcci&oacute;n temporal depende  del sistema operativo
(S.O.).


<P>
Es el S.O.  el  que tiene que dar  soporte y organizar la ejecuci&oacute;n de
todas  las  tareas, es tambi&eacute;n    labor  del S.O.    el gestionar  las
interrupciones. El S.O. ha de ofrecer:
<UL>
	<LI> El algoritmo de planificaci&oacute;n.
	<LI> Los mecanismos de comunicaci&oacute;n entre tareas (sem&aacute;foros, mensajes,etc).
        <LI> Gestionar las interrupciones.
	<LI> Activar las tareas en cada uno de sus periodos.
</UL>

<P>
Al contrario que sucede en los S.O. &quot;normales&quot;, el objetivo
en los S.O. de tiempo real es minimizar la complejidad para minimizar
la inceridumbre (falta de predecibilidad).  No se quiere un S.O. que
haga muchas cosas, sino uno lo haga de forma predecible y r&aacute;pida.  Es
preferible un S.O. que normalmente tarde 10 unidades de tiempo (u.t.)
en realizar un cambio de contexto y que en el peor de los casos tarde
12, que otro S.O.  que por t&eacute;rmino medito tarde 3 u.t. pero que de
cuando en cuando necesite 20 u.t.


<P>
No hay que sorprenderse si  descubrimos que los sistemas operativos de
tiempo real son m&aacute;s  &quot;lentos&quot; que  los  S.O.  normales.   En
ocasiones, para obtener  un comportamiento predecible, se puede llegar
incluso  a deshabilitar la  memoria cache, con la consiguiente perdida
de velocidad.      La memoria cache,   los  procesadores  con unidades
pipeline y los algoritmos de  predicci&oacute;n de saltos son claros enemigos
de la predecibilidad y por tanto de los sistemas de tiempo real.
<P>
<center>
<IMG SRC="../../common/May1998/so1.gif" ALIGN=BOTTOM WIDTH=299 HEIGHT=174 BORDER=0>
</center>
</P>

<H2><FONT FACE="helvetica"><FONT SIZE=4><I>Extensiones POSIX de TR.</I></FONT></FONT></H2>


<P>
POSIX son la  iniciales  de  Portable  Operating  System Interface  (Y
&iquest;qu&eacute; es  un  S.O. sin la X    al final?).  Es un  est&aacute;ndar  que
pretende  conseguir la portabilidad  del  software al nivel del c&oacute;digo
fuente.  En otras palabras: un programa  escrito para un S.O.  que sea
compatible con POSIX ha de poderse compilar y ejecutar sobre cualquier
otro  &quot;POSIX&quot;  aunque sea  de otro  fabricante  distinto. El
est&aacute;ndar POSIX define la   interfaz que el  S.O.   debe ofrecer  a las
aplicaciones:  el  juego de llamadas  al   sistema.  POSIX est&aacute; siendo
desarrollado  por    IEEE  (Institute  of Electrical    and Electronic
Engineering) y estandarizado   por ANSI (American   National Standards
Institute)    e    ISO  (International     Standards    Organization).
Evidentemente  POSIX  est&aacute; basado   en  UNIX. La mayor   parte de  los
S.O. (incluido el Windows NT) tienden  en sucesivas versiones hacia la
compatibilidad POSIX.

<P>
<center>
<IMG SRC="../../common/May1998/so2.gif" ALT="DrawObject" widht=300 height=182 Border=0>
</center>

<p>
El trabajo en la definici&oacute;n del est&aacute;ndar POSIX est&aacute; dividida en varios
grupos de trabajo  en los que  participan  fabricantes de ordenadores,
empresas de software, representantes de distintos gobiernos y gur&uacute;s de
la  inform&aacute;tica. Cada grupo se   encarga  de dise&ntilde;ar  un aspecto   del
S.O.. Por   ejemplo:  el  grupo llamado  POSIX.4   se  encarga de  las
cuestiones relativas a tiempo real.

<P>
Las   extensiones  POSIX.4 --renombradas   como   1003.1b desde 1993--
permiten  que un S.O. se pueda   utilizar en situaciones que requieran
tiempo real.  Evidentemente, la mayor parte de estas extensiones est&aacute;n
relacionadas con  la  gesti&oacute;n del   tiempo  y las prioridades  de  los
procesos, tambi&eacute;n hay     llamadas   al sistema   para    facilitar la
comunicaci&oacute;n entre procesos.

<P>
Las extensiones POSIX est&aacute;n pensadas para tener un mayor control sobre
la administraci&oacute;n de los recursos del S.O..

<P>
Linux 2.0 tienen implementadas bastantes   llamadas al sistema de  las
extensiones POSIX  de tiempo  real...  pero este  aspecto  de Linux lo
contar&eacute; en otro art&iacute;culo. En la  versi&oacute;n 2.2, casi con toda seguridad,
Linux ser&aacute; 100% compatible POSIX 1003.1b.
</P>

<H2><FONT FACE="helvetica"><FONT SIZE=4><I>Real Time Linux</I></FONT></FONT></H2>

<P>
Ha sido desarrollado en el departamento de inform&aacute;tica en el Instituto
de Miner&iacute;a y Tecnolog&iacute;a de Nuevo M&eacute;xico, por Victor Yodaiken y Michael
Barabanov.  RT-Linux   fue el  trabajo  de  Michael para  completar su
Master of  Computer Science  in  Computer  Science (algo as&iacute;  como  el
proyecto  fin de  carrera).  La  &uacute;ltima  versi&oacute;n disponible es la 0.6.
Por ahora s&oacute;lo est&aacute; disponible para la arquitectura Intel.

<p>
RT-Linux resuelve el problema de  una forma radicalmente distinta.  En
lugar de modificar el n&uacute;cleo de  Linux para ofrecer nuevas llamadas al
sistema y que sea  predecible, lo que  hace es  construir directamente
sobre el  procesador (i386) un peque&ntilde;o  n&uacute;cleo --que no tiene nada que
ver con el  n&uacute;cleo de Linux--  con un planificador.  Sobre este n&uacute;cleo
el  S.O.   Linux se  ejecuta   como una tarea  m&aacute;s.   Linux se ejecuta
compartiendo el procesador con otras tareas.  M&aacute;s concretamente: Linux
se ejecuta en background, cuando no hay otras tareas que ejecutar.

<p>
Me  imagino que se  te han  roto todos  los  esquemas... quiz&aacute;s
pensabas que el S.O.  era todo poderoso y que no se pod&iacute;a jugar
con   &eacute;l.

<P>
<center>
<IMG    SRC="../../common/May1998/so3.gif"  ALT="DrawObject" width=448 height=232 border=0>
</center>

A&uacute;n  te  parecer&aacute;  m&aacute;s sorprendente   el  hecho de   poder instalar  y
desinstalar  el planificador de  tiempo  real din&aacute;micamente, pues est&aacute;
compilado como un m&oacute;dulo.

<p>
El  c&oacute;digo del    kernel   de Linux  (como    cualquier   S.O.)  suele
deshabilitar  las interrupciones como  medio  de sincronizaci&oacute;n o para
implementar    secciones  cr&iacute;ticas.     Si    mientras  Linux    tiene
deshabilitadas las interrupciones   se  produce una interrupci&oacute;n    de
reloj,  &eacute;sta  quedar&aacute; bloqueada;   con    la consiguiente  perdida  de
precisi&oacute;n  temporal.  En RT-Linux se ha  implementado una soluci&oacute;n muy
elegante: se ha  sustituido todas  las llamadas  a   cli, sti e   iret
(instrucciones    ensamblador  que   modifican  el    estado  de   las
interrupciones) por S_CLI, S_STI y S_IRET que las emulan, de forma que
Linux no puede nunca deshabilitar las interrupciones.

<p>
El planificador por defecto que  viene con RT-Linux es un planificador
basado en  prioridades est&aacute;ticas y trata a  la tarea Linux como
la  tarea de menor prioridad.  Si  las tareas de  tiempo real consumen
todo el  tiempo  del procesador,  entonces la   tarea  Linux no recibe
tiempo de procesador  y da la impresi&oacute;n  de  que el sistema  se
ha&quot;colgado&quot;.

<p>
Con RT-Linux tenemos a  la  vez un sistema  de tiempo  real y un  S.O.
cl&aacute;sico.  Podemos navegar  por la   red a  la  vez que  estamos
muestreando y controlando un proceso f&iacute;sico.

<A name="instal"></A>      
<H3><FONT face="Helvetica,Arial" color="#660033">
Instalaci&oacute;n de RT-Linux
</FONT></H3>


<P>Los ficheros
de   la    distribuci&oacute;n    los  podemos    encontrar   en:   <A
HREF="http://luz.cs.nmt.edu/~rtlinux">http://luz.cs.nt.edu/~rtlinux</A>.</FONT></P>

<P>
Para  &quot;transformar&quot; a Linux  en RT-Linux  hay que aplicar al
c&oacute;digo del kernel un parche que viene  con la distribuci&oacute;n de RT-Linux
y luego  recompilar  el kernel.  Aqu&iacute;   est&aacute; la  receta para  hacerlo.
Supongo que has  bajado el fichero <tt>rtlinux-0.6-2.0.33.tgz</tt>  al
directorio   <tt>/usr/src</tt> y    lo  has   extra&iacute;do  en ese   mismo
directorio,   con  lo      que     ahora  los  fuentes    est&aacute;n     en
<tt>/usr/src/rtlinux-0.6</tt>.  Tambi&eacute;n supongo que ya has configurado
todas las opciones del kernel (make config).

<pre>
# cd /usr/src/linux
# patch       -p1 <../rtlinux-0.6-2.0.33/kernel_path
# make dep; make clean; make zlilo; make modules; make modules_install
# reboot
</pre>

El nuevo n&uacute;cleo  es, en apariencia, igual  que  uno normal,  pero est&aacute;
preparado para convertirse en un  sistema de tiempo real.  Dentro  del
directorio  <tt>/usr/src/rtlinux-0.6-2.0.33/testing</tt>    hay varios
programas de demostraci&oacute;n.

<p>
Aparte del ejemplo de sonido que viene con la distribuci&oacute;n (dentro del
directorio  testing), se puede  bajar otro  ejemplo preparado por Oleg
 Subbotin que permite crear un cronograma de la  ejecuci&oacute;n de las tareas. Uno de
los  ficheros  que viene  en  esta  demo es   un planificador con  las
modificaciones  necesarias  para    que   a  la vez   que   realiza la
planificaci&oacute;n, env&iacute;e informaci&oacute;n sobre las  decisiones que va tomando.
Esta    informaci&oacute;n es  recogida   y  almacenada   en un  fichero  que
posteriormente  puede ser  visualizada  gr&aacute;ficamente.   Como resultado
podemos ver en qu&eacute; orden se han ejecutado las distintas tareas, y como
la tarea m&aacute;s prioritaria  expulsa  a la  menos prioritaria.  La  tarea
Linux no parece representada.

<p>
<center>
<IMG SRC="../../common/May1998/crono.gif"  WIDTH=538 height=310  BORDER=0>  
</center>

<p>
Cada tarea est&aacute; representada sobre un eje horizontal.  Los rect&aacute;ngulos
representan tiempos    en los  que   cada  tarea est&aacute;    utilizando el
procesador  (en  un instante   dado,  s&oacute;lo una   tarea puede estar  en
ejecuci&oacute;n,  pues  estamos en   un   sistema monoprocesador).  En  este
ejemplo, el deadline de cada tarea  es igual a  su periodo; el periodo
de  cada tarea est&aacute; enmarcado  por  un intervalo temporal representado
por: <IMG SRC="../../common/May1998/crono2.gif"   WIDTH=150 height=63 BORDER=0>,dentro  del
cual debe  ejecutarse.  Las tareas de  arriba tienen mayor prioridad y
son capaces  de expulsar del procesador  a  otras de  menos prioridad,
como ocurre en el instante 600.

<A name="futuro"></A>      
<H3><FONT face="Helvetica,Arial" color="#660033">
El      Futuro      de RT-Linux
</FONT></H3>


<p>
Ya est&aacute;  disponible una versi&oacute;n de  RT-Linux para multiprocesador. Los
servicios  que  ofrece RT-Linux  son intencionadamente  m&iacute;nimos, no se
quiere   incluir  ninguna funcionalidad   que  no  sea   estrictamente
necesaria con  el   fin  de mantener al    sistema  lo m&aacute;s  predecible
posible. De  todas formas,  hay  disponibles varias  ampliaciones para
trabajar con sem&aacute;foros y  para  poder acceder  a las tareas  de tiempo
real desde los procesos Linux mediante <tt>/proc/sys</tt>.

<P>
Hace  pocas semanas,  se    ha  comenzado ha  escribir   un   completo
manual-tutorial de RT-Linux.

<A name="conclu"></A>      
<H3><FONT face="Helvetica,Arial" color="#660033">
Conclusiones</I>
</FONT></H3>

<P>
Antes  de aparecer el  RT-Linux la  mayor  parte de los ingenieros que
necesitaban  trabajar con sistemas de  tiempo real ten&iacute;an que o
bien utilizar el MS-DOS y tener que  construirse todos los drivers que
necesitaban,  o bien comprar  un S.O. de tiempo   real (a unos precios
poco atractivos).  Ahora  se dispone de   todo  un completo S.O.  para
desarrollar las aplicaciones  de tiempo real  y sobre el mismo sistema
que se van a ejecutar. De  hecho, podemos tener simult&aacute;neamente
varias tareas de tiempo real en ejecuci&oacute;n y estar navegando por
la Internet     sin  problemas.

<p>
En el    siguiente   art&iacute;culo  veremos   varios    ejemplos  de
aplicaciones  de tiempo real  y c&oacute;mo  escribir nuestras propias
aplicaciones de tiempo real.




    <HR size=2 noshade>
 <p align="right"><I>Art&iacute;culo original en
        Castellano</I> 
	&nbsp;
	<p>&nbsp;


          </TD>
        </TR>
	 </TABLE>

    </TD>

 </TR>

 </TBODY>


 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 Ismael Ripoll</B></FONT><BR>
    <FONT color="#ffffff">Esta p&aacute;gina est&aacute; mantenida por
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>



</TABLE>


</BODY>
</HTML>






