<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.6">
 <TITLE>C&Oacute;MO configurar los ajustes de v&iacute;deo en XFree86: Forzando su monitor.</TITLE>
 <LINK HREF="XFree86-Config-COMO-12.html" REL=next>
 <LINK HREF="XFree86-Config-COMO-10.html" REL=previous>
 <LINK HREF="XFree86-Config-COMO.html#toc11" REL=contents>
</HEAD>
<BODY>
<A HREF="XFree86-Config-COMO-12.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-10.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc11">Índice general</A>
<HR>
<H2><A NAME="overd"></A> <A NAME="s11">11.</A> <A HREF="XFree86-Config-COMO.html#toc11">Forzando su monitor.</A></H2>


<P>Usted <EM>no</EM> deber&iacute;a intentar sobrepasar las tasas de barrido de su monitor
si es uno de tipo frecuencias fijas.  Puede realmente fundir su hardware si lo
intenta.  Hay algunos problemas sutiles acerca de forzar un monitor multifrecuencia
de los que deber&iacute;a ser consciente.</P>
<P>Tener un reloj de pixel mayor que el ancho de banda m&aacute;ximo del monitor es bastante
inocuo.  (Nota: el l&iacute;mite te&oacute;rico se alcanza cuando el reloj de p&iacute;xel es el 
doble del ancho de banda.  Esta es una aplicaci&oacute;n directa del teorema de Nyquist:
considere los p&iacute;xeles como series distribuidas espacialmente de la unidad de 
se&ntilde;ales y sabr&aacute; por qu&eacute;).</P>
<P>Lo problem&aacute;tico es sobrepasar las frecuencias m&aacute;ximas de sincronizaci&oacute;n.
Algunos monitores modernos pueden tener circuiter&iacute;a de protecci&oacute;n que 
apaga el monitor bajo tasas peligrosas, pero no tenga fe en ello.  En
particular existen viejos monitores multifrecuencia (como el Multisync II)
que utilizan s&oacute;lo un transformador horizontal. Estos monitores no opondr&aacute;n
mucha resistencia ante una frecuencia de sincronizaci&oacute;n excesiva. Aunque
su monitor tenga circuiter&iacute;a de regulaci&oacute;n de alto voltaje (que puede no 
encontrarse en monitores de frecuencia fija), &eacute;sta puede no cubrir todos los
rangos de frecuencia concebibles, lo cual es normal en modelos baratos.  
Esto no s&oacute;lo implica mayor carga en la circuiter&iacute;a, sino que tambi&eacute;n puede causar
que el f&oacute;sforo de la pantalla envejezca antes, y puede hacer que el monitor emita
m&aacute;s radiaci&oacute;n de la especificada (incluyendo rayos X).</P>
<P>Otra importancia del ancho de banda es que la impedancia de entrada
del monitor est&aacute; especificada s&oacute;lo para ese rango, y utilizar otras
frecuencias de reloj puede causar reflejos de onda, lo que probablemente
cause peque&ntilde;as interferencias en la pantalla y ruidos en las ondas de 
radio.</P>
<P>Sin embargo, el problema b&aacute;sico de magnitud en cuesti&oacute;n es la tasa de giro
(la pendiente de las se&ntilde;ales de v&iacute;deo) de las tarjetas gr&aacute;ficas, y que
normalmente es independiente de la frecuencia real de pixel, pero que 
est&aacute; relacionada (si el fabricante cuida de esos problemas) con la frecuencia
m&aacute;xima de pixel de la tarjeta.</P>
<P>Por lo tanto, tenga cuidado...</P>

<HR>
<A HREF="XFree86-Config-COMO-12.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-10.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc11">Índice general</A>
</BODY>
</HTML>
