<HTML>
<HEAD>
<TITLE>Kernel-Como: Miscel&aacute;nea </TITLE>
</HEAD>
<BODY>
<A HREF="Kernel-Como-12.html">Anterior</A>
<A HREF="Kernel-Como-14.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc13">Indice</A>
<HR>
<H2><A NAME="s13">13. Miscel&aacute;nea </A></H2>



<H2><A NAME="ss13.1">13.1 El autor </A></H2>


<P>El autor y encargado de mantener el original de este documento en Ingl&eacute;s
es Brian Ward <CODE>
<A HREF="mailto:bri@blah.math.tu-graz.ac.at">bri@blah.math.tu-graz.ac.at</A></CODE>. Env&iacute;enme cualquier comentario,
a&ntilde;adidos o correcciones que considere oportunos. En particular, lo que m&aacute;s
me interesa son las correcciones. Si quiere agradecerme de alguna forma
especial que haya escrito este documento, siempre podr&aacute; enviarme
ordenadores o CD-ROMs que no use, o simplemente una bonita postal de su
zona... </P>
<P>Puede ver mi p&aacute;gina principal de WWW en los URLs:  </P>
<P><CODE>
<A HREF="http://www.math.psu.edu/ward/">http://www.math.psu.edu/ward/</A></CODE></P>
<P><CODE>
<A HREF="http://blah.tu-graz.ac.at/~ward/">http://blah.tu-graz.ac.at/~ward/</A></CODE></P>
<P>Aunque intento atender en lo posible el correo, recuerde que sin embargo
recibo <I>muchos</I> mensajes diarios, lo que har&aacute; que pueda pasar
tiempo antes de contestar su mensaje. Especialmente, si me env&iacute;a alguna
consulta, trate de ser lo m&aacute;s claro y detallado posible en su mensaje. Por
ejemplo, si se trata de hardware que no funcione, trate de explicarme con
el m&aacute;ximo detalle la configuraci&oacute;n de que se trata. No se preocupe si hace
preguntas simples, puesto que si no se la pregunta a nadie ¡nunca tendr&iacute;a
respuesta!. Agradecer&eacute; tambi&eacute;n las sugerencias.</P>
<P>Si me escribe y no obtiene respuesta en mucho tiempo (digamos, m&aacute;s de tres
semanas), puede que accidentalmente haya borrado su mensaje (lo siento,
int&eacute;ntelo de nuevo).</P>
<P>Recibo muchos mensajes sobre cosas que realmente son problemas de
hardware. Est&aacute; bien, pero tenga en cuenta que yo no conozco todo el
hardware existente en el mundo y no siempre puedo ayudarle. Personalmente,
uso m&aacute;quinas con discos IDE y SCSI, CD-ROMs SCSI, tarjetas de red 3Com y
WD, ratones serie, placas base con PCI, controladoras SCSI NCR 810, CPUs
AMD 386DX40 con coprocesador Cyrix, procesadores AMD 5x86, 486DX4 y
tambi&eacute;n de Intel (todo esto es una lista de lo que conozco, pero
ciertamente no es una recomendaci&oacute;n para su equipo, aunque si quiere,
puede preguntarme <CODE>:-) </CODE>).</P>
<P>La versi&oacute;n -0.1 se escribi&oacute; el 3 de Octubre de 1994. Este documento est&aacute;
disponible en SGML, PostScript, TeX, roff y ASCII. </P>
<P><B>Nota del traductor</B>: Al igual que el autor original, me pongo a su
disposici&oacute;n para resolver problemas que est&eacute;n en mi mano, y sobre todo,
aceptar sugerencias sobre esta traducci&oacute;n, perteneciente al proyecto
<I>LUCAS</I> (LinUx en CAStellano) coordinado por Ram&oacute;n Guti&eacute;rrez.
Actualmente, se han preparado versiones SGML, HTML y ASCII. </P>
<P><B>Nota de la revisi&oacute;n 2.1:</B> Ver la secci&oacute;n 
<A HREF="Kernel-Como-14.html#Grupos">Grupos</A>. Me sumo a
las propuestas anteriores. A partir de esta revisi&oacute;n, este <I>COMO</I> est&aacute;
disponible en SGML, HTML, ASCII, PostScript, DVI, LyX, y cualquier otro
formato soportado por <CODE>linuxdoc-sgml</CODE>. Le recomiendo encarecidamente
que si piensa imprimirlo, lo haga con las versiones <CODE>.dvi</CODE> o <CODE>.ps</CODE>,
la calidad no tiene color en comparaci&oacute;n con las otras versiones para
imprimir. Y al fin y al cabo, me he tomado el trabajo de revisarlo
precisamente por esto <CODE>:-)</CODE>, asi como actualizarlo un poco.</P>
<P>El traductor, Juan Jos&eacute; Amor, <CODE>
<A HREF="mailto:jjamor@ls.fi.upm.es">jjamor@ls.fi.upm.es</A></CODE> se
encuentra disponible por correo electr&oacute;nico y tambi&eacute;n en el WWW: </P>
<P><CODE>
<A HREF="http://lml.ls.fi.upm.es/~jjamor">http://lml.ls.fi.upm.es/~jjamor</A></CODE>.</P>


<H2><A NAME="ss13.2">13.2 Pendiente de hacer</A></H2>


<P>La secci&oacute;n 
<A HREF="Kernel-Como-11.html#trucos">trucos</A> es peque&ntilde;a. Espero poderla agrandar
gracias a sus sugerencias.</P>
<P>Lo mismo para la secci&oacute;n 
<A HREF="Kernel-Como-6.html#adicionales">adicionales</A>.</P>
<P>Hay que a&ntilde;adir m&aacute;s informaci&oacute;n acerca de recuperaci&oacute;n de cuelgues y
errores. </P>


<H2><A NAME="ss13.3">13.3 Colaboraciones </A></H2>


<P>Se incluy&oacute; una peque&ntilde;a parte del <CODE>README</CODE> de Linus (acerca de las
opciones de ``<CODE>kernel hacking</CODE>''). (¡Gracias, Linus!).</P>
<P><CODE>
<A HREF="mailto:uc@brian.lunetix.de">uc@brian.lunetix.de</A></CODE> (Ulrich Callmeier): <CODE>patch -s</CODE> y
<CODE>xargs</CODE>. </P>
<P><CODE>
<A HREF="mailto:quinlan@yggdrasil.com">quinlan@yggdrasil.com</A></CODE> (Daniel Quinlan): muchas correcciones y
a&ntilde;adidos. </P>
<P><CODE>
<A HREF="mailto:nat@nataa.frmug.fr.net">nat@nataa.frmug.fr.net</A></CODE> (Nat Makarevitch): <CODE>mrproper</CODE>,
<CODE>tar -p</CODE>. </P>
<P><CODE>
<A HREF="mailto:boldt@math.ucsb.edu">boldt@math.ucsb.edu</A></CODE> (Axel Boldt): recopil&oacute; descripciones de
configuraciones del n&uacute;cleo en la red, luego me envi&oacute; la lista. </P>
<P><CODE>
<A HREF="mailto:lembark@wrkhors.psyber.com">lembark@wrkhors.psyber.com</A></CODE> (Steve Lembark): sobre m&uacute;ltiples
formas de arrancar.</P>
<P><CODE>
<A HREF="mailto:kbriggs@earwax.pd.uwa.edu.au">kbriggs@earwax.pd.uwa.edu.au</A></CODE> (Keith Briggs): algunas
correcciones y sugerencias.</P>
<P><CODE>
<A HREF="mailto:rmcguire@freenet.columbus.oh.us">mailto:rmcguire@freenet.columbus.oh.us</A></CODE> (Ryan McGuire):
adiciones realizables. </P>
<P><CODE>
<A HREF="mailto:dumas@excalibur.ibp.fr">dumas@excalibur.ibp.fr</A></CODE> 
(Eric Dumas): traducci&oacute;n al Franc&eacute;s.</P>
<P><CODE>
<A HREF="mailto:simazaki@yu-gate.yamanashi.ac.jp">simazaki@yu-gate.yamanashi.ac.jp</A></CODE> (Yasutada Shimazaki): 
traducci&oacute;n al Japon&eacute;s. </P>
<P><CODE>
<A HREF="mailto:jjamor@lml.ls.fi.upm.es">jjamor@lml.ls.fi.upm.es</A></CODE> (Juan Jos&eacute; Amor Iglesias): traducci&oacute;n
al Castellano. <CODE>;-)</CODE></P>
<P><CODE>
<A HREF="mailto:donahue@tiber.nist.gov">donahue@tiber.nist.gov</A></CODE> (Michael J Donahue): errores
tipogr&aacute;ficos, ganador de la ``sliced bread
<SL>Proviene de la popular
expresi&oacute;n anglosajona ``<I>... it's the best thing since sliced bread</I>'',
algo as&iacute; como (literalmente) ``<I>... es lo mejor que se ha inventado
desde las tostadas</I>'', suele utilizarse para expresar ``<I>... es lo
mejor que haya parido mente humana</I>''.</SL>
 competition''. </P>
<P><CODE>
<A HREF="mailto:rms@gnu.ai.mit.edu">rms@gnu.ai.mit.edu</A></CODE> (Richard Stallman):  concepto sobre la
documentaci&oacute;n de libre distribuci&oacute;n. </P>
<P><CODE>
<A HREF="mailto:dak@Pool.Informatik.RWTH-Aachen.DE">dak@Pool.Informatik.RWTH-Aachen.DE</A></CODE> (David Kastrup): El tema
del NFS. </P>
<P>La gente que me ha enviado correo con preguntas y problemas tambi&eacute;n me ha
sido de extrema ayuda. </P>


<H2><A NAME="ss13.4">13.4 Notas sobre el Copyright, Licencia y Todo Eso</A></H2>


<P>Nota del traductor: Aunque se traducen las notas siguientes, se copian
tambi&eacute;n intactas para respetar los t&eacute;rminos de la Licencia. </P>


<P>
<BLOCKQUOTE><CODE>
<PRE>
===========Copyright notice, License, and all that stuff ==================

Copyright (c) Brian Ward, 1994-1996.
Permission is granted to make and distribute copies of this manual provided
the copyright notice and this permission notice are preserved on all
copies.

Permission is granted to copy and distribute modified versions of this
manual under the conditions for verbatim copying, provided that the derived
work is distributed under the terms of a permission notice identical to
this one. Translations fall under the catagory of ``modified versions.''


Warranty: None.

Recommendations
:
Commercial redistribution is allowed and encouraged; however, it is
strongly recommended that the redistributor contact the author before the
redistribution, in the interest of keeping things up-to-date (you could
send me a copy of the thing you're making while you're at it). Translators
are also advised to contact the author before translating. The printed
version looks nicer. Recycle.

=============================================================================
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Copyright (c) Brian Ward, 1994, 1995.</P>
<P>Se concede permiso para realizar y distribuir copias de este documento,
siempre proporcionando esta nota y la del Copyright en todas las copias. </P>
<P>Se concede permiso para copiar y distribuir versiones modificadas de este
documento, bajo las condiciones propuestas para copias completas. Las
traducciones se incluyen en la categor&iacute;a de ``versiones modificadas''. </P>
<P>Garant&iacute;as: Ninguna.</P>
<P>Recomendaciones: Se permite y recomienda redistribuir comercialmente este
documento; sin embargo, se sugiere que el distribuidor contacte antes con
el autor, con el fin de mantener las cosas al d&iacute;a. Con este mismo
prop&oacute;sito se recomienda tambi&eacute;n a los traductores que contacten con el
autor. </P>


<HR>
<A HREF="Kernel-Como-12.html">Anterior</A>
<A HREF="Kernel-Como-14.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc13">Indice</A>
</BODY>
</HTML>
