<HTML>
<HEAD>
<TITLE>Kernel-Como: Compilaci&oacute;n del n&uacute;cleo </TITLE>
</HEAD>
<BODY>
<A HREF="Kernel-Como-3.html">Anterior</A>
<A HREF="Kernel-Como-5.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="compilacion"></A> <A NAME="s4">4. Compilaci&oacute;n del n&uacute;cleo </A></H2>



<H2><A NAME="ss4.1">4.1 Limpieza y dependencias </A></H2>


<P>Cuando se termina de configurar, se le instar&aacute; a ejecutar `<CODE>make
dep</CODE>' y `<CODE>clean</CODE>'. Haga `<CODE>make dep</CODE>', lo que preparar&aacute;
las dependencias en poco tiempo, a menos que su PC sea muy lento. Cuando
acabe, haga `<CODE>make clean</CODE>'. Esto elimina ficheros objetos y dem&aacute;s
de la versi&oacute;n anterior. <EM>No olvidar</EM> este paso.</P>


<H2><A NAME="momento"></A> <A NAME="ss4.2">4.2 El momento de compilar </A></H2>


<P>Despu&eacute;s de preparar dependencias, puede ejecutar `<CODE>make zImage</CODE>' o
`<CODE>make zdisk</CODE>' (esta es la parte que tarda m&aacute;s tiempo). `<CODE>make
zImage</CODE>' compilar&aacute; el n&uacute;cleo y lo dejar&aacute; comprimido en
<CODE>arch/i386/boot/zImage</CODE> junto a otros ficheros. Con `<CODE>make
zdisk</CODE>' el nuevo n&uacute;cleo se copiar&aacute; adem&aacute;s en el disquete que est&eacute;
puesto en la disquetera ``A:''.  `<CODE>zdisk</CODE>' es interesante para
probar n&uacute;cleos; si explota (o simplemente no hace nada) se quita el
disquete de la disquetera y podr&aacute; arrancar el n&uacute;cleo antiguo. Adem&aacute;s sirve
para arrancar si borr&oacute; accidentalmente el n&uacute;cleo del disco duro. Tambi&eacute;n
puede usarlo para instalar nuevos sistemas simplemente volcando el
contenido de un disco en otro (``¡¡ todo esto y m&aacute;s !! Ahora, ¿cu&aacute;nto
pagar&iacute;a?''). </P>
<P>Los n&uacute;cleos recientes est&aacute;n comprimidos, con una `<CODE>z</CODE>' comenzando
su nombre. Un n&uacute;cleo comprimido se descomprime autom&aacute;ticamente al ser
ejecutado. </P>


<H2><A NAME="ss4.3">4.3 Otras opciones del `<CODE>make</CODE>'</A></H2>


<P>Con `<CODE>make mrproper</CODE>' har&aacute; una limpieza mucho m&aacute;s ``intensa''. 
Suele hacer falta cuando se actualiza (parchea) el n&uacute;cleo. Pero esta
opci&oacute;n borra tambi&eacute;n su fichero de configuraci&oacute;n del n&uacute;cleo, as&iacute; que
guarde una copia del correspondiente fichero <CODE>.config</CODE> si cree que
le interesa. </P>
<P>La opci&oacute;n `<CODE>make oldconfig</CODE>' intentar&aacute; configurar el n&uacute;cleo con un
fichero de configuraci&oacute;n anterior
<SL>A partir del <CODE>2.0.xx</CODE> no es
necesario, <CODE>make</CODE> <I>recuerda</I> la &uacute;ltima configuraci&oacute;n</SL>

evitando todo el proceso del `<CODE>make config</CODE>'. Si no ha compilado
anteriormente el n&uacute;cleo o no tiene un fichero de configuraci&oacute;n anterior,
no lo elija pues normalmente querr&aacute; algo que se salga de la configuraci&oacute;n
por defecto.</P>
<P>Para compilaci&oacute;n con m&oacute;dulos, vea la secci&oacute;n correspondiente. </P>


<H2><A NAME="ss4.4">4.4 Instalaci&oacute;n del n&uacute;cleo</A></H2>


<P>Una vez que tenga un nuevo n&uacute;cleo que parezca funcionar como desea, ser&aacute;
el momento de instalarlo. Casi todo el mundo utiliza <CODE>LILO</CODE> (LInux
LOader)  para esto. Con `<CODE>make zlilo</CODE>' se instalar&aacute; el n&uacute;cleo
ejecutando <CODE>LILO</CODE>, quedando listo para rearrancar, pero esto solo
funcionar&aacute; si <CODE>LILO</CODE> est&aacute; bien configurado para su sistema: el n&uacute;cleo
es <CODE>/vmlinuz</CODE>, <CODE>LILO</CODE> est&aacute; en <CODE>/sbin</CODE> y la configuraci&oacute;n
de <CODE>LILO</CODE> (<CODE>/etc/lilo.conf</CODE>) es coherente con lo anterior.</P>
<P>En otro caso, necesitar&aacute; usar <CODE>LILO</CODE> directamente. Hay un paquete que
lo instala de manera adecuada, pero su fichero de configuraci&oacute;n tiende a
confundir a la gente. Observe el fichero de configuraci&oacute;n (estar&aacute; en
<CODE>/etc/lilo.conf</CODE> o en <CODE>/etc/lilo/config</CODE> para versiones m&aacute;s
antiguas), y vea cu&aacute;l es la configuraci&oacute;n actual. El fichero de
configuraci&oacute;n ser&aacute; como &eacute;ste:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
image = /vmlinuz
        label = Linux
        root = /dev/hda1
        ...
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>La l&iacute;nea `<CODE>image =</CODE>' apunta al n&uacute;cleo instalado actualmente. Casi
siempre es <CODE>/vmlinuz</CODE>. `<CODE>label</CODE>' es el identificador usado
para seleccionar qu&eacute; sistema arrancar, y `<CODE>root</CODE>' es el disco o
partici&oacute;n a usar para el directorio ra&iacute;z. Haga una copia de seguridad de
su antiguo n&uacute;cleo y copie en <CODE>/vmlinuz</CODE> o donde diga el fichero
anterior el fichero zImage que haya generado el proceso de compilaci&oacute;n.
Ahora, ejecute <CODE>LILO</CODE> (en sistemas modernos, ser&aacute; simplemente teclear
`<CODE>lilo</CODE>'. En sistemas antiguos, habr&aacute; que poner
`<CODE>/etc/lilo/install</CODE>' o <CODE>`/etc/lilo/lilo -C
/etc/lilo/config</CODE>'.)</P>
<P>Si quiere saber m&aacute;s sobre la configuraci&oacute;n de <CODE>LILO</CODE>, o no tiene
<CODE>LILO</CODE>, obtenga la versi&oacute;n m&aacute;s reciente de su servidor <CODE>FTP</CODE>
favorito y siga las instrucciones que le acompa&ntilde;an.</P>
<P>Para arrancar uno de sus antiguos n&uacute;cleos, copie las l&iacute;neas anteriores
incluyendo `<CODE>image = xxx</CODE>' al principio del fichero de
configuraci&oacute;n de <CODE>LILO</CODE>, y cambie `<CODE>image = xxx</CODE>' por `<CODE>image
= yyy</CODE>' donde `<CODE>yyy</CODE>' es el nombre de camino completo al
fichero de la copia de seguridad guardada. Ahora, cambie `<CODE>label =
zzz</CODE>' por `<CODE>label = linux-backup</CODE>' y reejecute <CODE>LILO</CODE>. Puede
ser que necesite poner una l&iacute;nea en el fichero con `<CODE>delay=x</CODE>'
donde x son las cent&eacute;simas de segundo que <CODE>LILO</CODE> esperar&aacute; antes de
arrancar con la primera opci&oacute;n, de modo que pueda interrumpirse (con la
tecla <CODE>SHIFT</CODE>) y seleccionarse qu&eacute; n&uacute;cleo desea arrancar (tecleando la
etiqueta (<CODE>label</CODE>) asignada).</P>
<P><B>Inciso de la revisi&oacute;n 2.1</B></P>
<P>Una forma muy c&oacute;moda de llevar todo el tema del <CODE>LILO</CODE>, si lo tenemos
instalado, y las compilaciones, etc, es a&ntilde;adir lo siguiente en el
<CODE>/etc/lilo.conf</CODE>: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
...
image=/vmlinuz
        label=ultimo
        root=/dev/hd[loquesea]
        read-only
        append = &quot;&quot;
image=/vmlinuz.old
        label=anterior
        root=/dev/hd[loquesea]
        read-only
        append = &quot;&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Al compilar, si lo hacemos con la secuencia de comandos</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# make dep; make clean; make zlilo; make modules; make modules_install
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>el <CODE>make zlilo</CODE> renombrar&aacute; la anterior imagen del kernel a
<CODE>/vmlinuz.old</CODE> , dejando la nueva como <CODE>/vmlinuz</CODE>, e
instalar&aacute; <CODE>LILO</CODE>, a continuaci&oacute;n con lo cual lo hacemos todo
<I>autom&aacute;gicamente</I>. </P>
<P>La &oacute;rdenes <CODE>make modules; make modules_install</CODE> compilar&aacute;n los
m&oacute;dulos que hayamos seleccionado, y los instalar&aacute;n. No olvidar ejecutar
<CODE>depmod -a</CODE> en cuanto hayamos arrancado con dicho n&uacute;cleo. </P>
<P>En caso de que estemos compilando por segunda vez una misma versi&oacute;n de
n&uacute;cleo, y hayamos variado el n&uacute;mero de m&oacute;dulos a compilar, es posible que
la ejecutar <CODE>make dep</CODE> nos encontremos con un mensaje de error; esto se
debe a que los antiguos m&oacute;dulos que no hayamos compilado ahora no son
borrados. Pueden borrarse tranquilamente. </P>


<HR>
<A HREF="Kernel-Como-3.html">Anterior</A>
<A HREF="Kernel-Como-5.html">Siguiente</A>
<A HREF="Kernel-Como.html#toc4">Indice</A>
</BODY>
</HTML>
