<HTML>
<HEAD>
<TITLE>Pilot COMO: C&oacute;mo compartir datos del Pilot con su sistema Linux</TITLE>
</HEAD>
<BODY>
<A HREF="Pilot-Como-2.html">Anterior</A>
<A HREF="Pilot-Como-4.html">Siguiente</A>
<A HREF="Pilot-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. C&oacute;mo compartir datos del Pilot con su sistema Linux</A></H2>



<H2><A NAME="ss3.1">3.1 El programa pilot-link</A></H2>


<P>El conjunto de utilidades disponibles en el paquete pilot-link le
permitir&aacute;n instalar programas en su Pilot, y transferir datos relativos a
varias de las aplicaciones instaladas en el Pilot entre su sistema Linux y
el Pilot. Aunque estos programas no est&aacute;n tan elaborados como los que se
distribuyen con el Pilot, le permitir&aacute;n copiar sus datos en ambas
direcciones. En general, cada programa individual maneja un tipo de datos.
El programa PilotManager est&aacute; construido sobre el pilot-link y ofrece una
soluci&oacute;n m&aacute;s integrada, entre sus caracter&iacute;sticas se incluye la
sincronizaci&oacute;n completa de varios tipos de datos. </P>

<H3>Instalaci&oacute;n del programa pilot-link</H3>


<P>Las versiones empaquetadas siempre ir&aacute;n inevitablemente ligeramente
retrasadas respecto a la distribuci&oacute;n original, pero ser&aacute;n m&aacute;s f&aacute;ciles de
instalar y no requieren configuraci&oacute;n. La distribuci&oacute;n original ser&aacute; la
mejor elecci&oacute;n en aquellas raras ocasiones en las que haya estado
esperando una nueva caracter&iacute;stica o el arreglo de alg&uacute;n fallo. </P>
<P>Puede obtener el paquete Debian de la versi&oacute;n 0.7.2 del programa
pilot-link en <CODE>
<A HREF="ftp://ftp.debian.org/pub/debian/hamm/hamm/binary-i386/otherosfs/pilot-link_0.7.2-1.deb">ftp://ftp.debian.org/pub/debian/hamm/hamm/binary-i386/otherosfs/pilot-link_0.7.2-1.deb</A></CODE>
Instale este archivo de la manera habitual y pase directamente a usar el
programa. </P>
<P>Puede obtener el paquete RedHat de la versi&oacute;n 0.7.6 del programa
pilot-link en <BR>
<CODE>
<A HREF="ftp://ftp.redhat.com/pub/contrib/i386/pilot-link-0.7.6-2.i386.rpm">ftp://ftp.redhat.com/pub/contrib/i386/pilot-link-0.7.6-2.i386.rpm</A></CODE>. 
Instale este archivo de la manera habitual y pase directamente a usar el
programa. </P>
<P>Para otras versiones de Linux o Unix, obtenga la versi&oacute;n 0.8.2 del
programa pilot-link de <CODE>
<A HREF="ftp://ryeham.ee.ryerson.ca/pub/PalmOS/pilot-link.0.8.2.tar.gz">ftp://ryeham.ee.ryerson.ca/pub/PalmOS/pilot-link.0.8.2.tar.gz</A></CODE>. 
El n&uacute;mero de versi&oacute;n es probable que cambie, pero las nuevas versiones
estar&aacute;n en el mismo lugar y con un nombre similar.</P>
<P>Una vez que tenga la distribuci&oacute;n del programa, descompr&iacute;malo con:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        tar -xvzf pilot-link.0.8.2.tar.gz
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto crear&aacute; un directorio (<CODE>pilot-link.0.8.2</CODE>) conteniendo los fuentes.</P>
<P>Ejecute <CODE>./configure</CODE>. Esto buscar&aacute; por su sistema la informaci&oacute;n
necesaria para compilar el programa. Por defecto la configuraci&oacute;n se
realizar&aacute; de tal manera que la instalaci&oacute;n posterior se realizar&aacute; en el
directorio <CODE>/usr/local</CODE>. Si quiere cambiar el directorio, ejecute
<CODE>./configure --prefix=DIR</CODE>, donde pone <CODE>DIR</CODE> debe indicar el
nombre del directorio en el cual quiera que se instale el programa. </P>
<P>Ejecute <CODE>make</CODE>. Con esto compilar&aacute; el programa. El programa no se
instalar&aacute; hasta un poco m&aacute;s tarde, de tal manera que pueda probarlo
primero. (Si est&aacute; reemplazando una versi&oacute;n anterior con una nueva versi&oacute;n,
debe asegurarse que todas las funcionalidades que necesite funcionan
correctamente. Generalmente, esto no es un problema.) </P>
<P>Siendo el usuario <CODE>root</CODE>, ejecute <CODE>make install</CODE>. Este
comando copiar&aacute; los ficheros del programa en <CODE>/usr/local</CODE> (o donde
haya indicado mediante la opci&oacute;n <CODE>--prefix</CODE>). Si no puede acceder
al sistema como <CODE>root</CODE>, puede instalar el programa en cualquier
directorio en el que tenga derechos de escritura.</P>
<P>No olvide a&ntilde;adir a su camino de b&uacute;squeda todo directorio nuevo que
haya creado en el que est&eacute;n almacenados ejecutables. </P>

<H3>Uso del programa pilot-link</H3>


<P>La mayor&iacute;a de programas incluidos en el paquete pilot-link transfieren
datos desde o hacia su Pilot. </P>
<P>Cada vez que se use uno de estos programas, pulse el bot&oacute;n de
sincronizaci&oacute;n <I>HotSync</I> del soporte de su Pilot. Esto iniciar&aacute; la
transferencia de datos en lo concerniente al Pilot. Observe que no todos
estos programas le avisan de que pulse el bot&oacute;n de sincronizaci&oacute;n, por lo
tanto debe acordarse usted mismo de hacerlo. </P>
<P>Para obtener m&aacute;s detalles, y para cualquier otra opci&oacute;n de estos
programas, consulte la correspondiente p&aacute;gina del manual. Para el programa
<CODE>pilot-xfer</CODE>, por ejemplo, teclee <CODE>man pilot-xfer</CODE> en la l&iacute;nea
de comandos.</P>
<P>Si va a usar PilotManager, no se tiene que preocupar en aprender a usar
estas utilidades. </P>

<H3><CODE>pilot-xfer</CODE></H3>


<P>Posiblemente &eacute;ste sea el programa m&aacute;s &uacute;til de los que se compone el
paquete pilot-link. <CODE>pilot-xfer</CODE> permite instalar programas en el
Pilot, realizar copias de seguridad, y restaurar esas copias de seguridad. </P>
<P>Para instalar un programa:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        pilot-xfer /dev/pilot -i programa.prc
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para realizar una copia de seguridad del Pilot:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        pilot-xfer /dev/pilot -b directorio-backup
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Este comando copiar&aacute; todas las bases de datos que est&eacute;n en el Pilot a un
directorio llamado "<CODE>directorio-backup</CODE>", cre&aacute;ndolo si &eacute;ste no existe. </P>
<P>Para restaurar datos en el Pilot:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        pilot-xfer /dev/pilot -r directorio-backup
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Normalmente, se tendr&aacute; &uacute;nicamente que hacer esta operaci&oacute;n si al Pilot se
le acaban totalmente las bater&iacute;as o si ha sido necesario reinicializarlo. </P>
<P>Para listar los programas instalados en el Pilot:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        pilot-xfer /dev/pilot -l
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3><CODE>install-memo</CODE></H3>


<P>Instala un archivo en el Pilot como una nota.</P>
<P>Para instalar una nota en una categor&iacute;a ya existente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        install-memo /dev/pilot -c categoria nota
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El nombre del archivo se insertar&aacute; en la nota como su primera l&iacute;nea y
aparecer&aacute; en el directorio de notas del Pilot. </P>

<H3><CODE>memos</CODE></H3>


<P>Este programa captura cada nota presente en el Pilot y la muestra en el
formato est&aacute;ndard de fichero de correo. </P>
<P>Para ver las notas:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        memos /dev/pilot
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3><CODE>pilot-addresses</CODE></H3>


<P><CODE>pilot-addresses</CODE> transfiere la base de datos de direcciones hacia o
desde el Pilot. </P>
<P>Para leer la base de datos de direcciones del Pilot y escribirla en un
archivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        pilot-addresses /dev/pilot -w archivo
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Para leer la base de datos de direcciones de un fichero y almacenarla en
el Pilot: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        pilot-addresses /dev/pilot -r archivo
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss3.2">3.2 <CODE>makedoc</CODE></A></H2>


<P>Una limitaci&oacute;n del programa de notas incorporado en el Pilot es que no
maneja bien documentos grandes. Para compensar esto, Rick Bram
<CODE>
<A HREF="mailto:rbram@concentric.net">mailto:rbram@concentric.net</A></CODE> escribi&oacute; <CODE>Doc</CODE>, un lector de
documentos para el Pilot (consulte <CODE>
<A HREF="http://www.concentric.net/~rbram/doc.shtml">http://www.concentric.net/~rbram/doc.shtml</A></CODE>).  Cualquier
documento puede ser convertido al formato de <CODE>Doc</CODE> con <CODE>MakeDoc</CODE>, de
Pat Beirne <CODE>
<A HREF="mailto:pat.beirne@sympatico.ca">pat.beirne@sympatico.ca</A></CODE>.</P>

<H3>Instalaci&oacute;n de <CODE>makedoc</CODE></H3>


<P><CODE>MakeDoc</CODE> puede obtenerse de <CODE>
<A HREF="http://www.concentric.net/~rbram/makedoc7.cpp">http://www.concentric.net/~rbram/makedoc7.cpp</A></CODE>. 
Comp&iacute;lelo con un compilador de C++ e instale el ejecutable resultante bajo
el nombre "<CODE>makedoc</CODE>" en cualquier directorio incluido en su camino de
b&uacute;squeda. Parece ser que hay un peque&ntilde;o fallo en <CODE>makedoc</CODE> (versi&oacute;n
0.7a) que ocasiona que no se muestre un retorno de carro como &uacute;ltimo
caracter mostrado al usuario. Esto parece que no afecta al documento que
se obtiene en el archivo, pero es molesto. </P>
<P>Hay una nueva versi&oacute;n, pero necesita Java. Consulte la p&aacute;gina web que
tiene Pat Beirne sobre MakeDoc en <CODE>
<A HREF="http://cpu563.adsl.sympatico.ca/MakeDocJ.htm">http://cpu563.adsl.sympatico.ca/MakeDocJ.htm</A></CODE>. </P>

<H3>Uso de <CODE>makedoc</CODE></H3>


<P>Use MakeDoc de la siguiente forma:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        makedoc documento.txt documento.prc &quot;Titulo del documento&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Este comando crear&aacute; un archivo <CODE>documento.prc</CODE> que puede ser instalado
en el Pilot usando <CODE>pilot-xfer</CODE>. El texto "<CODE>Titulo del documento</CODE>" 
se mostrar&aacute; en el directorio de documentos que maneje <CODE>Doc</CODE>. </P>
<P>La sintaxis de MakeDoc es como sigue:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        makedoc [-n] [-b] &lt;archivo-texto&gt; &lt;archivo-prc&gt; &lt;titulo-documento&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>o bien</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        makedoc -d [-b] &lt;archivo-prc&gt; &lt;archivo-texto&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>
<DL>
<DT><B>archivo-texto</B><DD><P>es el archivo que se desea convertir.</P>
<DT><B>archivo-prc</B><DD><P>es el nombre del archivo resultante. (El nombre debe
terminar en "<CODE>.prc</CODE>"). </P>
<DT><B>titulo-documento</B><DD><P>el nombre que se quiere que sea mostrado en el
directorio de documentos de <CODE>Doc</CODE> o <CODE>Jdoc</CODE>. </P>
</DL>
</P>
<P>Hay tambi&eacute;n opciones para decodificar el fichero <CODE>.prc</CODE> resultante y
para manejar varias opciones de compresi&oacute;n.</P>


<H2><A NAME="ss3.3">3.3 <CODE>PilotManager</CODE></A></H2>


<P><CODE>PilotManager</CODE> es una herramienta de uso general que permite
sincronizar varias bases de datos en una &uacute;nica transferencia.</P>
<P>No me ha sido posible compilar e instalar <CODE>PilotManager</CODE> a tiempo para
escribir sobre &eacute;l en esta versi&oacute;n del <I>Pilot-COMO</I>.</P>
<P>Algunos enlaces que pueden ser de ayuda:</P>
<P>
<UL>
<LI>El paquete PilotManager: <CODE>
<A HREF="http://playground.sun.com/~bharat/pilotmgr.html">http://playground.sun.com/~bharat/pilotmgr.html</A></CODE>
</LI>
<LI>Un parche: <CODE>
<A HREF="ftp://ftp.orbits.com/pub/Pilot/pilotmgr,v1.009-BETA-3.patch">ftp://ftp.orbits.com/pub/Pilot/pilotmgr,v1.009-BETA-3.patch</A></CODE>

Este parche para el PilotManager est&aacute; &uacute;nicamente pensado para ser aplicado
a la versi&oacute;n 1.009 Beta 3 cuando es usado conjuntamente con la versi&oacute;n
0.8.0 del <CODE>pilot-link</CODE>. Instale los fuentes del <CODE>PilotManager</CODE> y
aplique el parche con los siguientes comandos: 

<BLOCKQUOTE><CODE>
<PRE>
        tar -xvzf pilotmgr,v1.009-BETA-3.dev.tar.gz
        cd pilotmgr,v1.009-BETA-3
        patch -p1 &lt; ../pilotmgr,v1.009-BETA-3.patch
</PRE>
</CODE></BLOCKQUOTE>

</LI>
</UL>
</P>
<P>Espero poder instalar este programa en breve y comentarlo en una futura
versi&oacute;n de este documento. </P>


<HR>
<A HREF="Pilot-Como-2.html">Anterior</A>
<A HREF="Pilot-Como-4.html">Siguiente</A>
<A HREF="Pilot-Como.html#toc3">Indice</A>
</BODY>
</HTML>
