<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf265, Applications: Gorm y ProjectCenter, las herramientas RAD de GNUstep</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges     Tarbouriech     
 =LF=CAT___: Applications
 =LF=TITLE_: Gorm y ProjectCenter, las herramientas RAD de GNUstep
 =LF=NUMBER: 265
 =LF=ANAME_: article265.shtml
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Georges-Tarbouriech.jpg" width=
    "115" height="124" alt="Georges Tarbouriech">
<BR>por  Georges Tarbouriech  <br> <small>&lt;georges.t(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<P>Georges es un viejo usuario UNIX. El adora GNUstep y las herramientas que esta gran infraestructura proporciona.

    </P>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Leo Trujillo  (<a href="http://leo.ciberlinea.com"><font size="1">homepage</font></a>)
<br>
<!--
 =LF=TRANSTO=es: Leo Trujillo 
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#265lfindex0">&Eacute;rase que se era...</A></LI>
  <LI><A HREF="#265lfindex1">GNUstep</A></LI>
  <LI><A HREF="#265lfindex2">Gorm.app</A></LI>
  <LI><A HREF="#265lfindex3">ProjectCenter.app</A></LI>
  <LI><A HREF="#265lfindex4">Algunas notas previas</A></LI>
  <LI><A HREF="#265lfindex5">S&oacute;lo llamelo "VerySimpleEditor"</A></LI>
  <LI><A HREF="#265lfindex6">Bajo GNUstep</A></LI>
  <LI><A HREF="#265lfindex7">Bajo MacOS X</A></LI>
  <LI><A HREF="#265lfindex8">Y ahora... una verdadera aplicaci&oacute;n en funcionamiento</A></LI>
  <LI><A HREF="#265lfindex9">Bajo GNUstep</A></LI>
  <LI><A HREF="#265lfindex10">Bajo MacOS X</A></LI>
  <LI><A HREF="#265lfindex11">GNUstep y MacOS X</A></LI>
  <LI><A HREF="#265lfindex12">Imaginando...</A></LI>
  <LI><A HREF="#265lfindex13">Gracias...</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=265">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Gorm y ProjectCenter, las herramientas RAD de GNUstep</H2>
 <IMG src="../../common/images/article265/Gorm_ProjectCenter.png" width="116" height="81" alt="ProjectCenter y Gorm" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->
<p>
    RAD significa Desarrollo R&aacute;pido de Aplicaciones (Rapid Application Development).
     A finales de los 80's, cuando NeXTstep fue liberado, venia con una herramienta increible, llamada
    InterfaceBuilder. Usada en conjunto con otra herramienta, llamada ProjectBuilder,
    permit&iacute;an construir aplicaciones gr&aacute;ficas en un instante. <A
    href="http://www.gnustep.org">GNUstep</A> ofrece una versi&oacute;n Libre de estas herramientas, llamadas Gorm.app y ProjectCenter.app.</p>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


<A NAME="265lfindex0">&nbsp;</A>
<H2>&Eacute;rase que se era...</H2>

<p>
Desde la prehistoria de las computadoras, el desarrollo de software ha tenido un gran cambio.
Las computadora eran bastantes grandes en tama&ntilde;o comparadas con su bajo poder.
Eran demasiado caras, no habia demasiadas y los desarrolladores no tenian la capacidad de usarlas tan frecuentemente
como ellos desear&iacute;an, ya que tenian que compartirlas con otras personas.
Entonces, los investigadores trataron de encontrar una forma de hacer que las computadoras ejecutaran m&aacute;s de una
tarea a la vez para mejorar la eficiencia. Obviamente, tuvieron que dise&ntilde;ar y crear
lenguajes de programaci&oacute;n desde cero, tomando en cuenta los pobres recursos de las m&aacute;quinas disponibles.

<br>
De este modo, durante los 60's nuevos lenguajes de programaci&oacute;n aparecieron: LISP,
FORTRAN, BASIC, Algol68, BCPL, etc. Luego vino el lenguaje B  derivado de BCPL que mencionamos m&aacute;s arriba,
el cual muy pronto di&oacute; origen al lenguaje C.
Este &uacute;ltimo cambi&oacute; el mundo de la programaci&oacute;n.
<br>
Los Lenguajes Orientados a Objetos (SmallTalk, Objective C, C++, etc) aparecieron m&aacute;s tarde, en la "Era
Gr&aacute;fica".
<br>
En los 80's algunas m&aacute;quinas proporcionaron Sistemas Operativos gr&aacute;ficos (Apple Macintosh, Commodore
Amiga, Atari ST, etc) y el X Window System estaba ya en funcionamiento. Al mismo tiempo,
una compa&ntilde;&iacute;a estaba trabajando en una GUI (Interface Gr&aacute;fica de Usuario) para el OS2 de IBM, llamada Presentation Manager.
Antes de terminar este trabajo, esta compa&ntilde;&iacute;a liber&oacute; su "propia" GUI para el DOS, llamado...
Windos. Las dos primeras versiones fueron apenas usables, pero... con la tercera di&oacute; inicio todo.
&iexcl; La MvAI (Microsoft very Artificial Intelligence) hab&iacute;a nacido !
<br>
Esto es, cada usuario vino a convertirse en un cient&iacute;fico de la computaci&oacute;n. Ya que nosotros hemos estado
escribiendo "grandiosas" aplicaciones usando Excel o Word y Visual Basic:-(
<br>
&iexcl; No se preocupe !
<br>
Afortunadamente, mucho antes que llegaramos a la situaci&oacute;n mencionada, NeXTstep habia nacido
y con &eacute;l, lleg&oacute; Interface Buider. Esta herramienta le permite crear una GUI para
su aplicaci&oacute;n en un breve lapso de tiempo y de manera muy f&aacute;cil. De all&iacute;, esta clase
de herramientas se ha extendido. Entre otros,
podemos mencionar Omnis, 4D, Delphi, Kylix, etc. Algunas de ellas son multiplataforma
mientras que la vasta mayor&iacute;a est&aacute;n dedicadas a Windos. Tambi&eacute;n mencionaremos que existen
herramientas libres usando semejante filosof&iacute;a, Gtk (Gimp Tool Kit) por ejemplo.
Los Unixes propietarios tambi&eacute;n proporcionan esta clase de herramientas.
<br>
La m&aacute;s importante caracter&iacute;stica de dichas herramientas es que usted no tiene que escribir c&oacute;digo
para las 200 ventanas de su aplicaci&oacute;n, sino solo administrar los datos.
<br>
Que le gusten o no esta clase de herramientas, no es el punto. El tiempo de desarrollo es corto:
 eso es un echo (de all&iacute; el nombre, "Desarrollo R&aacute;pido de Aplicaciones" - ["Rapid Application Development"]).
<br>
<A href="http://www.gnustep.org">GNUstep</a> nos proporciona herramientas RAD libres.
Estas son llamadas  Gorm y ProjectCenter. Naturalmente, estas herramientas son muy "j&oacute;venes"
pero funcionan. Pasemos a ver cada una de ellas.
</p>
<A NAME="265lfindex1">&nbsp;</A>
<H2>GNUstep</H2>

<p>
Para ser capaz de usar tanto  Gorm como ProjectCenter, necesita instalar GNUstep.
El c&oacute;mo hacerlo esta lejos del alcance de este art&iacute;culo. Encontrar&aacute; todo lo que necesita
en el <A href="http://www.gnustep.org">sitio web de GNUstep</a>. Este incluye
c&oacute;digo fuente, HOWTOs, tutoriales, etc.
<br>
Tambi&eacute;n puede revisar estos art&iacute;culos: <A href=
    "../March2001/article195.shtml">GNUstep, el OpenStep  open source</a> y <A href=
    "../May2002/article241.shtml">GNUMail.app, la evidencia de la portabilidad</a>.
<br>
La prueba del presente art&iacute;culo ha sido realizada bajo FreeBSD 4.7 con Window
Maker 0.80.1, usando gnustep-make-1.5.0, gnustep-base-1.5.0, gnustep-gui-0.8.2 y
gnustep-back-0.8.2. Estos &uacute;ltimos son de la m&aacute;s reciente versi&oacute;n no estable de GNUstep.
Pueden, si lo desean, usar las versiones estables. Por &uacute;ltimo, pero no menos importante,
se uso el compilador gcc 3.0.4.
</p>
<A NAME="265lfindex2">&nbsp;</A>
<H2>Gorm.app</H2>

<p>
Gorm viene de Graphic Object Relationship Modeler (o tal vez de GNUstep Object
Relationship Modeler, como se indica en el archivo README). Este es un clon de
NeXTstep Interface Builder, mencionado m&aacute;s arriba (o lo que hoy es MacOS X).
<br>
Gorm es el trabajo de Richard Frith-Macdonald que ha arrancado el proyecto.
Hoy Gregory Casamento lo mantiene y hace la mayor parte del trabajo con
Pierre-Yves Rivaille. La presente versi&oacute;n es la 0.1.9.
Los m&aacute;s recientes CVS snapshot (que contiene periodicamente cambios) est&aacute;n disponibles desde <A
href="http://savannah.gnu.org/projects/gnustep">http://savannah.gnu.org/projects/gnustep</a>.
<br>
Puede descargar la m&aacute;s reciente versi&oacute;n estable desde el sitio web de GNUstep.
<br>
La filosof&iacute;a detr&aacute;s de Gorm (y de Interface Builder) es proporcionar al usuario objetos que se encuentran en
paletas y arrastrar estos objetos en ventanas vacias para dise&ntilde;ar los componentes gr&aacute;ficos de su aplicaci&oacute;n.

<br>
Los objetos pueden ser botones, cuadros de texto, cuadros de verificaci&oacute;n, paneles, etc. Esto es, todo
lo que usted puede agregar a una ventana para hacerla amigable al usuario. A continuaci&oacute;n, puede modificarlos
usando los inspectors. Desde los inspectors, puede cambiar los atributos, definir
conexiones, tama&ntilde;o, ayuda y manipulaci&oacute;n de clases para los objetos seleccionados. Despu&eacute;s
creando una clase, usted puede agregar salidas y acciones a los objectos.
<br>
Luego que inicializa la clase, el cual crea un nuevo objeto (la instancia) en la ventana principal de Gorm,
conecta las salidas y acciones a los componentes correspondientes. Usted solo arrastra el mouse desde la instancia
al objeto seleccionado para conectar las salidas y desde el objeto a la instancia para conectar las acciones.
Por &uacute;ltimo, crea el esqueleto de la clase de los archivos fuente, y habr&aacute; terminado.
M&aacute;s sobre esto m&aacute;s tarde.
</p>
<A NAME="265lfindex3">&nbsp;</A>
<H2>ProjectCenter.app</H2>

<p>
ProjectCenter, como su nombre lo indica, es el "coraz&oacute;n" del proyecto. Es un clon de Project Builder
que se encuentra bajo NeXTstep y Mac OS X.
<br>
ProjectCenter es el trabajo de Philippe C.D.Robert y la presente versi&oacute;n es la
0.3.0. Al igual que Gorm, puede descargarla desde el sitio web de GNUstep dirigi&eacute;ndose a la secci&oacute;n Developer
apps. Naturalmente, puede obtener una snapshot de CVS: para este art&iacute;culo usamos la versi&oacute;n 0.3.1.
<br>
Desde ProjectCenter puede crear un proyecto, su interface (usando Gorm), escribir su c&oacute;digo fuente;
puede construir este proyecto y ejecutarlo (la depuraci&oacute;n a&uacute;n no esta disponible). En breve, puede
administrar todos los recursos requeridos por el proyecto: c&oacute;digo fuente, documentaci&oacute;n,
librer&iacute;as, subproyectos, interfaces, etc.
<br>
Cuando usted crea un nuevo proyecto, puede elegir su tipo. Puede seleccionar
entre una aplicaci&oacute;n, bundle, herramienta, librer&iacute;a y una aplicaci&oacute;n Gorm.
<br>
Entre otras cosas, ProjectCenter le proporciona un editor con el cual ser&aacute; capaz de completar el c&oacute;digo del esqueleto Gorm.
<br>
&iquest; C&oacute;mo se hace que  Gorm y ProjectCenter trabajen juntos ? Muy bien, &iexcl; Gracias !
<br>
Hablando ya seriamente, usaremos dos ejemplos para ilustrarlo.
</p>
<A NAME="265lfindex4">&nbsp;</A>
<H2>Algunas notas previas</H2>

<p>
Este art&iacute;culo NO es un Tutorial. La idea es mostrar lo f&aacute;cil que es usar estas herramientas
mientras insistimos en el echo de que usted ser&aacute; capaz de usar el mismo codigo tanto para GNUstep
(esto es, para muchas plataformas Unix... y, si le gustan los "conflictos" tambi&eacute;n bajo Windos)
y MacOS X. La &uacute;nica cosa que tiene que hacer es dise&ntilde;ar la interface en cada plataforma,
dado que los archivos nib (InterfaceBuilder o Gorm) no son portables (al menos por ahora).
<br>
El art&iacute;culo mencionado m&aacute;s arriba sobre GNUMail.app mostraba la portabilidad desde un punto de vista del usuario.
Este art&iacute;culo se enfocar&aacute; desde el punto de vista del desarrollador, a&uacute;n manteniendo la portabilidad en mente.
Esto es, en GNUMail.app usamos el trabajo de Ludovic y amigos
y aqu&iacute; crearemos una GUI de aplicaci&oacute;n tanto para GNUstep como para MacOS X.
<br>
Existen muchos tutoriales disponibles, ya sea para MacOS X o GNUstep. Puede investigar m&aacute;s
sobre GNUstep desde el sitio web de GNUstep o bien desde <A href="http://www.gnustep.net">http://www.gnustep.net</a>,
aunque aqu&iacute; mencionaremos algunos de ellos.
<br>
- <a href ="http://gnustep.it/pierre-yves/index.html">Una aplicaci&oacute;n usando Gorm y
ProjectCenter</a> por Pierre-Yves Rivaille.
<br>
- <a href ="http://gnustep.it/nicola/Tutorials">La p&aacute;gina de tutoriales de Nicola Pero</a>
<br>
- Un viejo tutorial de c&oacute;mo crear un HTMLEditor:  <a href
="http://stepwise.com/Articles/Technical/HTMLEditor/">http://stepwise.com/Articles/Technical/HTMLEditor/
</a>
<br>
Para aprender m&aacute;s, puede revisar el codigo fuente, los archivos nib, etc, de las aplicaciones existentes de
GNUstep (Gorm, ProjectCenter, GNUMail, GWorkspace, etc) y obviamente, de los ejemplos gnustep.
</p>
<A NAME="265lfindex5">&nbsp;</A>
<H2>S&oacute;lo llamelo "VerySimpleEditor"</H2>

<p>
Entre los numerosos tutoriales de MacOS X para InterfaceBuilder disponibles en la red,
usaremos el siguiente como un primer modelo:
<a href
="http://www.macdevcenter.com/pub/a/mac/2001/05/18/cocoa.html">http://www.macdevcenter.com/pub/a/mac/2001/05/18/cocoa.html</a>.
El autor Mike Beam, escribi&oacute;
muchos tutoriales m&aacute;s sofisticados disponibles desde <a href
="http://www.macdevcenter.com/pub/ct/37">http://www.macdevcenter.com/pub/ct/37</a>.
<br>
&iquest; Por qu&eacute;  usaremos este ? Porque le proporciona el funcionamiento de un editor de texto sin escribir una sola
l&iacute;nea de c&oacute;digo. Esto muestra el poder de estas herramientas de desarrollo,
ya sea que est&eacute; trabajando bajo MacOS X o bajo GNUstep.
<br>
Usando ProjectCenter.app y Gorm.app bajo GNUstep crearemos un editor de texto muy simple
cap&aacute;z de cortar, copiar, y pegar. Obviamente, no ser&aacute; capaz de guardar su trabajo:
recuerde, nosotros no escribimos una sola l&iacute;nea de c&oacute;digo. Usando ProjectBuilder y InterfaceBuilder bajo
MacOS X haremos exactamente lo mismo. Queda claro que, no hay mucho que mejorar a este editor
y se dejar&aacute; esto como un ejercicio para el lector. Una vez m&aacute;s, &iexcl; este art&iacute;culo no es un tutorial !
<br>
Aqu&iacute; vamos.
</p>
<A NAME="265lfindex6">&nbsp;</A>
<H3>Bajo GNUstep</H3>

<p>
Abrir ProjectCenter.app y crear un nuevo proyecto llamado Editor. Seleccione un proyecto de Aplicaci&oacute;n Gorm
en la parte inferior antes de guardar su nombre.
Esto le proporcionar&aacute; una partida de interfaces en la columna izquierda de
ProjectCenter.
<br>
Haciendo clic en las <i>Interfaces</i> mostrar&aacute; <i>Editor.gorm</i>.
Hacer doble clic en <i>Editor.gorm</i> abre Gorm.app. Seleccione la ventana por defecto
(MyWindow) y usando la herramienta de inspector cambie el nombre a <i>Editor</i> en los Atributos.
<br>
Desde la paleta, arrastre un TextView a la ventana de Editor. El TextView es el mayor objeto
que se encuentra en la paleta seleccionada, usando el &iacute;cono m&aacute;s a la derecha en lo alto de la ventana
de Paletas (Palettes). Redimencione este objeto para hacer que llene la ventana, y habr&aacute; terminado.
<br>
De nuevo, usando el inspector GormInternalViewEditor (mientras el TextView est&aacute; seleccionado), elija <i>Size</i>
y cambie los valores para hacer que coincidan con los valores de tama&ntilde;o de la ventana Editor. Estos
&uacute;ltimos son obtenidos de la misma forma, es decir, seleccionando la ventana y revisando el tama&ntilde;o
en el inspector GormNSWindow. Si no cambia los valores  de X  y de Y, por ejemplo,
no ser&aacute; cap&aacute;z de usar el ancho total del editor, ya sea que redimencione la ventana o no.
<br>
Guarde todo desde el men&uacute; Document de Gorm y salga para regresar a ProjectCenter.
Seleccione el &iacute;cono Build y de clic en el nuevo &iacute;cono en la segunda mitad horizontal
de la ventana. Todo deber&iacute;a ir bien si defini&oacute; correctamente las preferencias de su compilador,
depurador, etc. Por ejemplo, usando FreeBSD, debe cambiar de make a gmake (incluyendo la ruta)
dando clic en el &iacute;cono Settings (Configuraci&oacute;n) de
ProjectCenter. Revise tambi&eacute;n las rutas del men&uacute; de Preferences (Preferencias) en ProjectCenter.
<br>
Si la construcci&oacute;n (built) ha sido todo un &eacute;xito (&iexcl; Que as&iacute; deber&iacute;a ser !), haga los mismo con <i>Run</i> y
ver&aacute; entonces la aplicaci&oacute;n Editor. Juegue un poco con &eacute;l, escriba algo, corte,
pegue, etc. Naturalmente, puede reiniciarlo m&aacute;s tarde usando el comando openapp.
<br>
&iquest; Cu&aacute;nto toma hacer todo esto ? Bueno, yo dir&iacute;a que unos pocos minutos.
<br>
<center>
Aqu&iacute; tenemos como deber&iacute;a verse durante  la fase de desarrollo:
<br><br>
 <A HREF="../../common/images/article265/eddevgn.jpg"><IMG
SRC="../../common/images/article265/eddevgnth.jpg" ALT="EdDev" width="188" height="140"></A>
<br><br>
y la aplicaci&oacute;n resultante:
<br><br>
 <A HREF="../../common/images/article265/edappgn.jpg"><IMG
SRC="../../common/images/article265/edappgnth.jpg" ALT="Editor" width="188" height="140"></A>
</center>
</p>
<A NAME="265lfindex7">&nbsp;</A>
<H3>Bajo MacOS X</H3>

<p>
No hay mucho que decir dado que se har&aacute; lo mismo que lo mostrado m&aacute;s arriba. As&iacute; es como se ve
mientras se dise&ntilde;a la GUI:
<br><br>
<center>
<A HREF="../../common/images/article265/eddevosx.jpg"><IMG
SRC="../../common/images/article265/eddevosxth.jpg" ALT="EdDev" width="188" height="140"></A>
<br><br>
Y aqu&iacute; el editor "Trabajando":
<br><br>
<A HREF="../../common/images/article265/edapposx.jpg"><IMG
SRC="../../common/images/article265/edapposxth.jpg" ALT="Editor" width="188" height="140"></A>
</center>

</p>
<A NAME="265lfindex8">&nbsp;</A>
<H2>Y ahora... una verdadera aplicaci&oacute;n en funcionamiento</H2>

<p>
Ahora seleccionaremos otro ejemplo de Mike Beam. En esta ocasi&oacute;n es una aplicaci&oacute;n completa en
funcionamiento, capaz de administrar datos: un libro de direcciones. Es recomendado leer el tutorial de Mike
acerca del libro de direcciones (asi como muchos otros) para entender como es que la "cosa" trabaja.
Tambi&eacute;n revise el listado del tutorial dado que  Mike proporciona diferentes pasos en el proceso de
desarrollo para la misma aplicaci&oacute;n que permitir&aacute;n mejorarla.
<br>
Volveremos a crear y ejecutar la aplicaci&oacute;n tanto para GNUstep como MacOS X.
</p>
<A NAME="265lfindex9">&nbsp;</A>
<H3>Bajo GNUstep</H3>

<p>
As&iacute; como lo hizo para el Editor simple, inicie ProjectCenter.app. Seleccione una aplicaci&oacute;n Gorm
y ll&aacute;melo AddressBook. Desde ProjectCenter lance Gorm
dando doble clic en Interfaces -&gt; AddressBook.gorm. Arrastre un
TableView desde la paleta a la ventana por defecto. En otras palabras, siga el tutorial de Mike
como lo har&iacute;a estando bajo MacOS X. Tendr&aacute; que adaptar algunas cosas dado que estas funcionan diferente
 en Gorm y en InterfaceBuilder.
<br>
Por ejemplo, el n&uacute;mero de columnas
en la TableView no puede ser definido desde los atributos del inspector en
Gorm. Mantengamos las cosas simples, solo copie una columna y a continuaci&oacute;n obtendr&aacute;
el n&uacute;mero requerido (4 en nuestro caso). Deber&iacute;a obtener algo como esto:
<br><br>
<center>
<A HREF="../../common/images/article265/abdevgn.jpg"><IMG
SRC="../../common/images/article265/abdevgnth.jpg" ALT="ABdev" width="188" height="140"></A>
</center>
<br><br>
Cuando ha terminado con esto, guarde todo y regrese al ProjectCenter para escribir o modificar
el c&oacute;digo. En caso que cometa un error, Mike proporciona el c&oacute;digo fuente completo de la aplicaci&oacute;n.
Si lo descarga, basta copiar y pegar el c&oacute;digo en sus propios archivos
Controller.m y Controller.h generados por Gorm. No incluir (importar en la terminolog&iacute;a de
Objective C) <i>Cocoa.h</i> dado que esta reservado para MacOS X. Por otro lado,
deber&iacute;a mantener el esqueleto "escrito" por Gorm y cambiar algunas cosas. Por ejemplo,
reemplace el <i>void</i> por IBAction en Controller.h y
Controller.m. Agregue IBOutlet despu&eacute;s del id en Controller.h.
<br>
De cualquier modo, si as&iacute; lo desea, puede mantener el c&oacute;digo proporcionado por completo:
solo reemplace la inclusi&oacute;n en cocoa con <i>#import &lt;AppKit/AppKit.h&gt;</i>. Ahora,
Puede contruir y ejecutar la aplicaci&oacute;n.
<br>
Llegado a este punto: puede iniciar a jugar con su nuevo libro de direcciones.
<br>
<center>
Esto es lo que usted ver&aacute;:
<br><br>
<A HREF="../../common/images/article265/abappgn.jpg"><IMG
SRC="../../common/images/article265/abappgnth.jpg" ALT="AddressBook" width="188" height="140"></A>
</center>
</p>
<A NAME="265lfindex10">&nbsp;</A>
<H3>Bajo MacOS X</H3>

<p>
Mike Beam hizo el trabajo completo: &iquest; Qu&eacute; m&aacute;s podr&iacute;a yo agregar ?
<br>
<center>
Aqui tenemos una captura de pantalla del proceso de desarrollo bajo MacOS X:
<br><br>
<A HREF="../../common/images/article265/abdevosx.jpg"><IMG
SRC="../../common/images/article265/abdevosxth.jpg" ALT="ABdev" width="188" height="140"></A>
<br><br>
Y aqu&iacute; la aplicaci&oacute;n resultante:
<br><br>
<A HREF="../../common/images/article265/abapposx.jpg"><IMG
SRC="../../common/images/article265/abapposxth.jpg" ALT="AddressBook" width="188" height="140"></A>
</center>
<br><br>
&iquest; Y luego ? Bueno, tomar&aacute; unos minutos dise&ntilde;ar la GUI y el c&oacute;digo en su totalidad representa
un poco m&aacute;s de 2000 bytes. Nada mal, &iquest;Cierto?
<br>
De nuevo, se pueden hacer muchas mejoras &iexcl; pero tal como esta trabaja bien !
 Ahora, usted puede jugar con el c&oacute;digo para obtener un mejor libro de direcciones...
</p>
<A NAME="265lfindex11">&nbsp;</A>
<H2>GNUstep y MacOS X</H2>

<p>
Obviamente, las herramientas de desarrollo GNUstep no pueden ir m&aacute;s all&aacute; que las de Apple.
Apple y NeXT representan 15 a&ntilde;os de experiencias con cientos de desarrolladores.
GNUstep es el trabajo (sin renumeraci&oacute;n) de unos cuantos individuos que tienen que hacer algo para vivir.
Por ende, no ser&aacute; soprendente encontrar, por ejemplo, muchas m&aacute;s clases disponibles en
InterfaceBuilder que en Gorm. Recuerde, Gorm esta en su versi&oacute;n
0.1.9 (o 0.2.0).
<br>
Adem&aacute;s, hicimos las pruebas de la forma "dura". Esto es, nosotros "portamos" desde OS X hacia
GNUstep. La otra forma deber&iacute;a de ser mucho m&aacute;s f&aacute;cil poque que como se mencion&oacute; m&aacute;s arriba
existen diferencias entre las herramientas.
<br>
Por ejemplo, portar aplicaciones de desarrollo bajo MacOS X 10.2 deber&iacute;a ser mucho m&aacute;s dif&iacute;cil
dado que las nuevas herramientas de desarrollo de  Apple tiene muchas mejoras. Como ya lo mencionamos,
existen muchas clases nuevas disponibles y mucho m&aacute;s elaboradas.
<br>
Sin embargo, las herramientas cuentan con la misma filosof&iacute;a ya sea que funcionen bajo GNUstep
o MacOS X... y GNUstep mejora cada d&iacute;a. Una cosa que se ve muy agradable para m&iacute;:
la gente de GNUstep realmente trabaja en conjunto. Ellos se ayudan entre s&iacute; cuando proyectos individuales
est&aacute;n comprometidos y tambi&eacute;n contribuyen en mejorar el n&uacute;cleo de GNUstep.
Esta es la manera de trabajar del Software Libre que me gusta. Felicitaciones por este comportamiento
a Mr.Fedor y amigos.
</p>
<A NAME="265lfindex12">&nbsp;</A>
<H2>Imaginando...</H2>

<p>
La meta de este art&iacute;culo era mostrar el poder de las herramientas "RAD" de GNUstep,
Gorm.app y ProjectCenter.app. A pesar de su "juventud" estos pueden ayudarle a desarrollar
aplicaciones agradables de una manera muy sencilla.
<br>
Adem&aacute;s, estas herramientas proveen una grata forma de trabajo y por el momento muy eficiente.
 Objective C es un lenguaje muy compacto y, en mi opini&oacute;n, mucho m&aacute;s f&aacute;cil de aprender
que C++ para aquellos que tengan conocimientos de  C (Lo s&eacute;, &iexcl; Ya lo he dicho !).
Esto permite dise&ntilde;ar aplicaciones con buen aspecto (bueno, esto es cuesti&oacute;n de gustos,
pero a mi me gusta este aspecto y comportamiento)
mientras las mantiene en un tama&ntilde;o realmente reducido.
<br>
Debo admitir que nunca me he recuperado del shock que recib&iacute;
cuando me encontr&eacute; por primera vez con la m&aacute;quina NeXT. El echo de que Apple
liberara una moderna versi&oacute;n de NeXTstep me complaci&oacute;. Esto es tambi&eacute;n porque yo soy muy
aficionado a proyectos tales como GNUstep o Window Maker. Sin embargo,
amo el software libre pero no soy un "fundamentalista" y por ende,
no estoy en contra del software propietario (bueno,
tal vez un poco en contra de un editor espec&iacute;fico... pero, &iexcl; s&oacute;lo un poco !).
<br>
GNUstep puede beneficiarse de  Apple... pero Apple puede beneficiarse de GNUstep tambi&eacute;n.
GNUstep no es un competidor de Apple, es software libre. Hasta donde yo s&eacute;,
el software libre es ampliamente usado en OS X. Esto indica que brindar a&uacute;n m&aacute;s software libre
a Apple no puede ser una cosa mala. Lo que Ludovic y amigos hicieron con
GNUMail.app es un buen ejemplo de lo que podr&iacute;a suceder.
<br>
"Yo tuve un sue&ntilde;o"... Apple estaba proporcionando muchas de sus herramientas de desarrollo con c&oacute;digo fuente
a GNUstep. Los desarrolladores de GNUstep y Apple
estaban trabajando juntos para brindar grandiosas aplicaciones a los usuarios de Unix.
Y lentamente, la gente estaba comprendiendo que ellos podr&iacute;an vivir sin Windos...
<br>
Desafortunadamente, era solo un sue&ntilde;o ;-)
<br>
De cualquier manera, si usted no conoce GNUstep y sus aplicaciones, si&eacute;ntase libre de conseguirlos y probarlos.
Recuerde que, GNUstep es una infraestuctura, y herramientas tales como Gorm y ProjectCenter
le proporcionan todo para crear, para inventar. En otras palabras, con un poco de imaginaci&oacute;n,
puede desarrollar "productos" muy diferentes que se pueden ver hoy en d&iacute;a : &iexcl; como clones de aplicaciones Windos !
<br>
&iexcl; Vivimos una &eacute;poca maravillosa !
</p>
<A NAME="265lfindex13">&nbsp;</A>
<H2>Gracias...</H2>

<p>
A la gente de GNUstep: A.Fedor, N.Pero, G.Casamento, P.Y.Rivaille, N.Roard, L.Marcotte,
R.Frith-Macdonald, P. C.D.Robert, E.Sersale, A.Froloff, F.Kiefer, M.Viviani,
M.Guesdon y todos aquellos que pudiese olvidar
por el gran trabajo tanto para el entorno de trabajo o las aplicaciones.
<br>
A la gente de Window Maker: A.Kojima, D.Pascu y amigos por brindarnos una interface libre de NeXTstep
para X.
<br>
A J.M.Hullot y B.Serlet por inventar InterfaceBuilder.
<br>
A "Steve Jobs INC." por brindarnos NeXT, NeXTstep y MacOS X.
<br>
A toda la gente no mencionada aqu&iacute; que ha contribuido para hacernos una vida profesional
mucho menos triste.
 


<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=265"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges     Tarbouriech     , <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Georges Tarbouriech  <small>&lt;georges.t(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Leo Trujillo  (<a href="http://leo.ciberlinea.com"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-12-19, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
