<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Instalaci&oacute;n y configuraci&oacute;n de un servidor de IRC: Introducci&oacute;n </TITLE>
 <LINK HREF="Servidor-IRC-Como-3.html" REL=next>
 <LINK HREF="Servidor-IRC-Como-1.html" REL=previous>
 <LINK HREF="Servidor-IRC-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Servidor-IRC-Como-3.html">Página siguiente</A>
<A HREF="Servidor-IRC-Como-1.html">Página anterior</A>
<A HREF="Servidor-IRC-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="s2">2. Introducci&oacute;n </A></H2>

<P>
<P>
<H2><A NAME="ss2.1">2.1 ¿Qu&eacute; es el IRC? </A>
</H2>

<P>
<P>El IRC (<I>Internet Relay Chat</I>) surgi&oacute; como una ampliaci&oacute;n del
programa <I>talk</I>, tratando de superar sus limitaciones. Se trata de
un sistema de conversaci&oacute;n en tiempo real a trav&eacute;s de redes de ordenadores
y, por supuesto, de Internet. Las principales diferencias con el
<I>talk</I> son las siguientes: 
<P>
<UL>
<LI> Incorpora un protocolo mucho m&aacute;s elaborado, independiente de la
plataforma. 
</LI>
<LI> Posibilidad de conversaciones en las que intervengan m&aacute;s de dos
participantes: el l&iacute;mite depende s&oacute;lo de las posibilidades de los
servidores. 
</LI>
<LI> Organizaci&oacute;n de las charlas en forma de m&uacute;ltiples <I>canales</I>: 
por establecer un s&iacute;mil, los canales son <I>salones</I> donde se dan
cita un cierto n&uacute;mero de usuarios. Esta posibilidad se aprovecha
generalmente para realizar canales tem&aacute;ticos, que son el punto de
encuentro de personas con inquietudes parecidas. 
</LI>
<LI> Posibilidad de conectar varias redes, para poner en comunicaci&oacute;n
un gran n&uacute;mero de usuarios. 
</LI>
<LI> Los usuarios pueden ocultar su identidad, lo que facilita
conversaciones m&aacute;s espont&aacute;neas, pero tambi&eacute;n puede crear riesgos de
seguridad. 
</LI>
</UL>
<P>El IRC naci&oacute; hace diez a&ntilde;os, cuando el finland&eacute;s Jarkko Oikarinen escribi&oacute;
el primer programa para poder efectuar conversaciones con una estructura
cliente-servidor. Su expansi&oacute;n fue muy r&aacute;pida, puesto que pronto se
implant&oacute; en la red nacional finlandesa (<I>FUNET</I>), y posteriormente
en Noruega, Suiza y Estados Unidos. 
<P>La primera gran red de IRC fue <I>EFNet</I> (1990), y despu&eacute;s surgieron
otras como <I>Undernet</I> (<CODE>
<A HREF="http://www.undernet.org">http://www.undernet.org</A></CODE>), <I>IRCNet</I>, <I>DALNet</I>,
<I>StarChat</I>, <I>StarLink</I>, <I>NewLet</I>. Tambi&eacute;n existen
redes para las personas de habla hispana, como <I>RedLatina</I>,
<I>IRC-Hispano</I> (<CODE>
<A HREF="http://www.irc-hispano.org">http://www.irc-hispano.org</A></CODE>) o la m&aacute;s reciente, <I>Esnet</I>
(<CODE>
<A HREF="http://www.esnet.org">http://www.esnet.org</A></CODE>).
Algunas de estas redes son de grandes magnitudes: por ejemplo, en
<I>Undernet</I> existen m&aacute;s de diez mil canales. 
<P>
<H2><A NAME="ss2.2">2.2 ¿Qu&eacute; es un servidor de IRC? </A>
</H2>

<P>
<P>Como se ha comentado, el IRC se basa en redes de ordenadores. En estas
redes, al menos un de los ordenadores trabaja como <I>servidor</I>, y
sus funciones son recoger todos los mensajes enviados por los usuarios y
reenviarlos. Por tanto, los mensajes no son enviados directamente del
emisor al destinatario, sino que pasan por el servidor.
<P>Esta filosof&iacute;a de funcionamiento permite al administrador del servidor
ejercer un cierto control: por ejemplo, puede impedir el acceso a
determinados usuarios, ampliar las posibilidades de conversaci&oacute;n
comunicando varios servidores o limitar las posibilidades de los usuarios.
Adem&aacute;s, hace que todos los usuarios se conecten, en principio, en igualdad
de condiciones, excepto el administrador, por supuesto. 
<P>
<H2><A NAME="ss2.3">2.3 ¿Qu&eacute; necesita un servidor de IRC? </A>
</H2>

<P>
<P>Para que un sistema UNIX pueda hacer las funciones de un servidor de IRC,
es suficiente con lo siguiente: 
<P>
<UL>
<LI> Tener acceso a la red.</LI>
<LI> Instalar el software apropiado.</LI>
</UL>
<P>Dando por supuesto el primer apartado, vamos a puntualizar m&aacute;s en el
segundo. ¿Qu&eacute; tipo de software se requiere? En principio, para el
establecimiento de un servicio b&aacute;sico, es suficiente con ejecutar un
<I>demonio</I> de IRC, que se encargar&aacute; de las tareas descritas en el
apartado anterior. Sin embargo, esto proporcionar&aacute; un servicio precario: 
para un gesti&oacute;n eficiente y autom&aacute;tica de la red de IRC, se hace necesario
un <I>bot</I> o <I>script</I>, que se encargue de la gesti&oacute;n de
usuarios y canales sin intervenci&oacute;n por parte del administrador.
<P>Con el fin de poder monitorizar y administrar la red, es conveniente que
el servidor disponga tambi&eacute;n de un software cliente de IRC. 
<P>
<H2><A NAME="ss2.4">2.4 Comandos b&aacute;sicos de IRC </A>
</H2>

<P>
<P>Antes de describir los comandos, es necesario conocer cu&aacute;l es, a grandes
rasgos, la filosof&iacute;a del funcionamiento del IRC. Como ya ha quedado dicho,
las conversaciones se organizan en canales, que a su vez se identifican
por un nombre (generalmente comienza con el s&iacute;mbolo <CODE>&amp;</CODE>), y un
<I>topic</I>, que es una breve descripci&oacute;n de los temas a los que est&aacute;
dedicado el canal.
<P>Para poder dar coherencia a las conversaciones, los usuarios tambi&eacute;n est&aacute;n
identificados por un nombre, que se llama <I>nick</I> o <I>apodo</I>. 
Con el fin de poder mostrar una informaci&oacute;n m&aacute;s expl&iacute;cita sobre el
usuario, muchas redes exigen introducir el nombre completo y direcci&oacute;n de
correo electr&oacute;nico para poder acceder; sin embargo, la mayor&iacute;a de usuarios
aprovecha estos campos para introducir alg&uacute;n comentario m&aacute;s o menos
gracioso. 
<P>Cuando un usuario est&aacute; dentro de un canal, cualquier texto que escriba y
que no sea reconocido como un comando, ser&aacute; enviado a todos los dem&aacute;s
usuarios que forman parte del canal, y se indicar&aacute; el apodo del usuario
emisor. De la misma forma, la recepci&oacute;n de mensajes es autom&aacute;tica;
simplemente aparecen en la pantalla cuando son enviados.
<P>Dentro de un canal existe al menos un usuario que tiene m&aacute;s privilegios
que el resto. Se conoce como <I>operador</I> (<I>Op</I>), y tiene,
entre otros, el poder de expulsar a otros usuarios del canal. 
<P>Un usuario puede estar presente en varios canales, aunque para poder
disfrutar plenamente de esta posibilidad, es necesario tener un software
cliente potente y manejable. 
<P>Los comandos que se van a describir ahora son los m&aacute;s elementales que debe
conocer un usuario para participar en las conversaciones. Estos comandos
son enviados por el cliente al servidor, quien se encarga de reaccionar de
forma adecuada ante ellos. 
<P>
<UL>
<LI><CODE>/HELP</CODE>: permite obtener ayuda.
</LI>
<LI><CODE>/JOIN &amp;nombre_canal, /CHANNEL &amp;nombre_canal</CODE>:

introduce al usuario en el canal especificado. Si este canal no existe, se
crea (la gesti&oacute;n din&aacute;mica de canales es otra de las posibilidades del
IRC), y adem&aacute;s confiere al usuario el privilegio de ser el operador del
canal. 
</LI>
<LI><CODE>/WHO nombre_canal</CODE>: muestra una lista de los usuarios del
IRC. Si se indica un nombre de canal, restringe el listado a las personas
que est&aacute;n presentes en ese canal. 
</LI>
<LI><CODE>/WHOIS nick</CODE>: muestra m&aacute;s informaci&oacute;n sobre un usuario del
que conocemos su nick. Sin embargo, por las razones ya comentadas, la
informaci&oacute;n no suele ser cierta. 
</LI>
<LI><CODE>/TOPIC cadena</CODE>: cambia el <I>topic</I> o descripci&oacute;n del
canal (si tenemos privilegios para poder hacerlo).
</LI>
<LI><CODE>/NICK nuevo_nick</CODE>: permite cambiar nuestro nick o apodo.
</LI>
<LI><CODE>/MSG nick mensaje</CODE>: env&iacute;a un mensaje personal a un usuario
determinado, sin que los dem&aacute;s usuarios lo vean en su pantalla.
</LI>
<LI><CODE>/SIGNOFF, /SI, /BYE, /EXIT, /QUIT</CODE>: cualquiera de ellos
sirve para abandonar la conversaci&oacute;n. Si se a&ntilde;ade un texto detr&aacute;s del
comando, ser&aacute; enviado como mensaje de despedida. 
</LI>
<LI><CODE>/USERS</CODE>: muestra una lista de todos los usuarios conectados
al servidor. 
</LI>
<LI><CODE>/AWAY</CODE>: se utiliza para anunciar que, sin abandonar el
servidor, vamos a estar unos minutos sin atender a la conversaci&oacute;n. 
</LI>
<LI><CODE>/QUERY nick</CODE>: invita al usuario indicado a participar en una
conversaci&oacute;n privada. Si el receptor responde con un comando similar, el
di&aacute;logo particular dar&aacute; comienzo.
</LI>
</UL>
<P>Los siguientes comandos los utilizan exclusivamente los operadores:
<P>
<UL>
<LI><CODE>/OPER nick password</CODE>: da al usuario indicado los privilegios
de operador (si la contrase&ntilde;a es v&aacute;lida). 
</LI>
<LI><CODE>/KICK nick</CODE>: expulsa al usuario indicado del servidor. 
</LI>
<LI><CODE>/QUOTE comando</CODE>: permite enviar comandos al servidor. Se
puede utilizar para matar el demonio o realizar operaciones privilegiadas. 
</LI>
</UL>
<P>Para una lista m&aacute;s completa de los posibles comandos de IRC, se puede
acudir a <CODE>
<A HREF="ftp://ftp.rediris.es/docs/rfc/14xx/1459">ftp://ftp.rediris.es/docs/rfc/14xx/1459</A></CODE>. 
<P>
<H2><A NAME="ss2.5">2.5 Ataques en el IRC </A>
</H2>

<P>
<P>Como veremos m&aacute;s adelante, tanto el <I>demonio</I> de IRC como el
<I>bot</I> de gesti&oacute;n de los canales dedican una parte importante de su
funcionalidad a impedir la entrada de algunos usuario en las redes de IRC. 
¿Por qu&eacute; es tan importante poder hacer esto? 
<P>La raz&oacute;n es que existen usuarios con grandes conocimientos sobre el IRC, y
que muestran una actitud beligerante respecto a las m&aacute;s desprevenidos, los
usuarios noveles. Aprovech&aacute;ndose de las grietas del sistema, son capaces
de expulsar a otros usuarios e incluso <I>colgar</I> m&aacute;quinas remotas,
mediante diversos tipos de estrategias: 
<P>
<UL>
<LI><I>Flood</I>: consiste en requerir mucha informaci&oacute;n de un usuario
de manera continua (mediante <CODE>version, whois, ping, dcc</CODE>, etc.),
con el objeto de que la m&aacute;quina atacada devuelva todas las peticiones,
llegando a poner en peligro de saturaci&oacute;n al servidor, que proceder&aacute; a
expulsarla. 
</LI>
<LI><I>Floodnets</I>: son grupos de usuarios coordinados mediante
<I>scripts</I>, que consiguen hacer el trabajo de <I>flood</I> m&aacute;s
efectivo. 
</LI>
<LI><I>Botnets</I>: se trata de una versi&oacute;n automatizada (mediante
<I>scripts</I>) del <I>flood</I>. 
</LI>
<LI><I>ICMP</I>: este tipo de ataques son mucho m&aacute;s sofisticados y
malignos. Como dato, baste decir que existe un <I>script</I> escrito en
s&oacute;lo cinco l&iacute;neas de <I>perl</I> y capaz de bloquear una m&aacute;quina Windows
remota. 
</LI>
<LI><I>Smurf</I>: consiste en enviar un <I>ping</I> a la direcci&oacute;n
<I>broadcast</I> de una gran red, con la identidad del remitente
falseada para que apunte a la persona atacada. Las respuestas de las
m&aacute;quinas de la red ir&aacute;n directamente a esta persona, rompi&eacute;ndole la
conexi&oacute;n. 
</LI>
</UL>
<P>Al crear un servidor de IRC, se debe poner mucha atenci&oacute;n en la prevenci&oacute;n
de ataques. Los ataques por saturaci&oacute;n son relativamente f&aacute;ciles de evitar
mediante un <I>bot</I> capaz de detectarlos sobre la marcha y anularlos. 
Sin embargo, contra los ataques <I>ICMP</I>, la mejor manera de
defenderse es utilizar la &uacute;ltima versi&oacute;n del n&uacute;cleo y los parches.
<P>Para dificultar a&uacute;n m&aacute;s el seguimiento de los atacantes, &eacute;stos suelen
emplear <I>bouncers</I>, que son demonios colocados en una tercera
m&aacute;quina y que se limitan a redirigir todos los paquetes que les lleguen.
De esta forma, el pirata puede actuar sin temor a que descubran su IP. 
<P>Se puede consultar m&aacute;s informaci&oacute;n sobre estos temas (ataques, defensas y
monitorizaci&oacute;n) en las siguientes direcciones: <CODE>
<A HREF="http://www.irchelp.org/irchelp/nuke/">http://www.irchelp.org/irchelp/nuke/</A></CODE> y <CODE>
<A HREF="http://www.esi.us.es/~roman/tacticas.html">http://www.esi.us.es/~roman/tacticas.html</A></CODE>. 
<P>
<HR>
<A HREF="Servidor-IRC-Como-3.html">Página siguiente</A>
<A HREF="Servidor-IRC-Como-1.html">Página anterior</A>
<A HREF="Servidor-IRC-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
