<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <TITLE>lf123, Applications: Descubriendo el Ted</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img SRC="../../common/images/Andre-Pascual.jpg" ALT="[Photo de l&aacute;uteur]" height=147 width=132>
<BR>por  <a href="mailto:apascual@club-internet.fr">Andr&eacute; Pascual</a>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Comenz&oacute; siendo dise&ntilde;ador industrial, ahora es profesor de
dise&ntilde;o gr&aacute;fico inform&aacute;tico.La infograf&iacute;a, principalmente en 3D, es una de sus pasiones.
</P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">&iquest;Qu&eacute; es Ted?</A></LI>
  <LI><A HREF="#lfindex1">
&iquest;Qui&eacute;n recupera qu&eacute;, y c&oacute;mo?</A></LI>
  <LI><A HREF="#lfindex2">
&iquest;Qu&eacute; tipos de letra?</A></LI>
  <LI><A HREF="#lfindex3">
&iquest;Es el Ted susceptible de mejora?</A></LI>
  <LI><A HREF="#lfindex4">
&iquest;Qu&eacute; funciones?</A></LI>
  <LI><A HREF="#lfindex5">
&iquest;Cu&aacute;l es la conclusi&oacute;n?</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=123&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Descubriendo el Ted</H2>
 <img SRC="../../common/images/article123/Ted.jpg" ALT="[Illustration]" HSPACE=10 height=100 width=100>
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<p>
El argumento m&aacute;s com&uacute;n para rehusar migrar de Windows a Linux
es la supuesta dificultad para el intercambio de archivos entre uno y otro
sistema . As&iacute;, si bien los formatos gr&aacute;ficos no plantean
problema alguno, el argumento parece tener cierto peso en lo que se refiere
a los datos burocr&aacute;ticos, creados en su mayor&iacute;a con Microsoft
Office o cualquier otro producto compatible con &eacute;l.
<br>Se podr&iacute;a responder que StarOffice 5 &oacute; 5.1 convierte
con facilidad los archivos de Word y Excel, y que con igual facilidad convierte
sus propios archivos a los formatos de Microsoft. No obstante, uno se lo
piensa bien antes de abrir una aplicaci&oacute;n tan grande como StarOffice
para leer o modificar un peque&ntilde;o archivo creado con Word o WordPad.
<br>Ah&iacute; es donde <b><i>Ted</i></b> entra en juego.
</p></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>&iquest;Qu&eacute; es <b><i>Ted</i></b>?</H2>

Se trata de un procesador de textos "wysiwyg", y no de un simple editor
de texto, desarrollado por Mark de Does <a href="mailto:M.de.Does@inter.nl.net">M.de.Does@inter.nl.net</a>.
Ciertamente, su aspecto no est&aacute; muy cuidado: pantalla austera en
Motif, sin iconos, colores discutibles, pocas fuentes disponibles... Desde
el primer momento se ve que se trata de una herramienta para facilitar
el trabajo, nada m&aacute;s que el trabajo. Pero un buen trabajo, como
veremos.
<p>
<center>Ver Figura 0: sobrio aspecto del Ted, pese a haber sido compuesto
con el Gimp.
<br>
<img SRC="../../common/images/article123/ArtTed0.jpg" ALT="[article123/ArtTed0.jpg]" ></center>

<p>El archivo que contiene el Ted puede bajarse de
<i><a href="ftp://ftp.nluuq.nl/pub/editors/ted">&lt;ftp://ftp.nluuq.nl/pub/editors/ted></a></i>
o <i><a href="http://www.de-does.demon.nl">&lt;http://www.de-does.demon.nl></a></i>.
Se puede elegir entre el archivo binario (enlazado estaticamente)
o el fuente; este &uacute;ltimo, <i>ted-2.5.src.tar.gz</i>, tiene un tama&ntilde;o
de 1.9 Mb. y requiere Motif para su compilaci&oacute;n. En realidad, Lesstif.0.88-9
servir&aacute; tambi&eacute;n perfectamente para hacerlo y producir&aacute;
un ejecutable de 1 Mb. (tras limpiarlo con la orden <i>strip</i>). A la
hora de bajarlo, no hay que olvidarse del archivo correspondiente al diccionario
de nuestro idioma que utiliza
<b><i>Ted</i></b>, el cual estar&aacute;
en formato rpm o tgz.
<p><b><i>Ted</i></b> no conoce m&aacute;s que un formato de lectura (si
bien tres de escritura): el formato RTF (<i>Rich Text Format</i>), que
tiene la ventaja de ser independiente del sistema utilizado y de que es
reconocido por cualquier procesador de textos digno de tal nombre. Adem&aacute;s,
las especificaciones aplicadas al texto cuando se escribi&oacute; -tama&ntilde;o
y tipo de letra, alineaci&oacute;n, sangr&iacute;as, etc.- se conservan
una vez guardado el archivo en ese formato. De ese modo, basta con que
cuando trabaje en Word o WordPad, en vez de guardar su documento en el
formato propietario DOC, lo haga en el formato RTF, para que as&iacute;
pueda recuperarlo en una aplicaci&oacute;n Linux con todas sus especificaciones.

<A NAME="lfindex1">&nbsp;</A>
<H2>
&iquest;Qui&eacute;n recupera qu&eacute;, y c&oacute;mo?</H2>

Supongamos que tenemos un archivo producido en WordPad, y guardado en los
formatos RTF y DOC, para ser le&iacute;dos bajo Linux; y que tenemos tambi&eacute;n
ese mismo archivo producido por PressWork2 de GST, y guardado solamente
en RTF. Disponemos por tanto de tres archivos te&oacute;ricamente id&eacute;nticos.
<p>
<center>Ver Figura 1
<br>
<img SRC="../../common/images/article123/ArtTed1.jpg" ALT="[article123/ArtTed1.jpg]" height=724 width=557></center>

<p>Probemos a leerlos con StarOffice, WordPerfect8, Maxwell y Abiword,
que leen archivos DOC y RTF, y con <b><i>Ted</i></b>, que no lee m&aacute;s
que RTF.
<br>Resultados:
<br>-StarOffice recupera a la perfecci&oacute;n los archivos DOC et RTF,
y sustituye la letra BibleSript por&nbsp; la Helmet; conserva las especificaciones
de formato.
<br>-WordPerfect recupera el formato RTF; la Arial es sustituida por la
Univers, Courier por Courier 10cpi (tama&ntilde;o fijo, por tanto), Times
y BibleScript son sustituidas por CG Times; conserva las especificaciones
de formato, salvo el tama&ntilde;o de letra en la Courier. Recupera mejor
los archivos DOC que los RTF.
<br>-Maxwell (version 0.53) no recupera ning&uacute;n archivo de Windows;
s&oacute;lo (y de forma imperfecta) los RTF de Linux, pero ning&uacute;n
DOC, por m&aacute;s que disponga de esta opci&oacute;n.
<br>-Abiword (version 0.7.5 no terminada) se comporta correctamente en
la recuperaci&oacute;n de RTF y DOC.
<br><b><i>-Ted</i></b> recupera perfectamente los archivos RTF de Windows
y sustituye s&oacute;lo la BibleScript por la Helvetica, pero conservando
su tama&ntilde;o y grosor. Igual de bien lee los archivos RTF producidos
por las aplicaciones Linux que acabamos de citar.
<center>La Figura 2 muestra <b><i>Ted</i></b> tras cargar un archivo de
WordPad, lo que demuestra que desempe&ntilde;a eficazmente la tarea.
<br>&nbsp;
<p><img SRC="../../common/images/article123/ArtTed2.jpg" ALT="[article123/ArtTed2.jpg]" height=702 width=592></center>

<A NAME="lfindex2">&nbsp;</A>
<H2>
&iquest;Qu&eacute; tipos de letra?</H2>

Cuando se instala, <b><i>Ted</i></b> dispone de cuatro tipos de letra:
Times, Helvetica, Courier y Symbol. Se trata de tipos de letra m&eacute;tricos
de Adobe en formato AFM; en principio, <b><i>Ted </i></b>es capaz de utilizar
cualquier tipo de letra en ese formato, y como el repertorio de las que
en Linux aparecen en&nbsp; /usr/share/enscript o /usr/share/ghostscript
es muy amplio, uno se ve tentado de utilizarlas, sobre todo si tenemos
en cuenta que el tama&ntilde;o de la Times que viene con <b><i>Ted</i></b>,
as&iacute; como la Courier it&aacute;lica e it&aacute;lica negrilla, tiene
un l&iacute;mite m&aacute;ximo de 18 puntos.
<p>Sin embargo, pese a todos mis esfuerzos, s&oacute;lo he podido a&ntilde;adir
en /usr/local/afm para ser utilizadas por <b><i>Ted </i></b>las letras
Utopia, New Century SchoolBook y Palatino, con un tama&ntilde;o que va
desde los 8 a los 64 puntos. No es gran cosa, pero si tenemos en cuenta
que estos tres tipos de letra son similares a la Times New Roman, y que
la Helvetica es parecida a la Arial, que son las m&aacute;s utilizadas
en Windows, se puede decir que contamos con lo necesario para recuperar
correctamente los trabajos realizados en Word.
<center>La Figura 3 muestra estos tipos de letra en
<b><i>Ted</i></b>.
<br>&nbsp;
<p><img SRC="../../common/images/article123/ArtTed3.jpg" ALT="[article123/ArtTed3.jpg]" height=831 width=788></center>

<p>Nos vemos tentados de guardar este abanico de tipos de letra en un archivo
RTF y ver qu&eacute; sucede en las otras aplicaciones capaces de leerlo.
La Figura 4 muestra c&oacute;mo lo lee AbiWord y c&oacute;mo <b><i>Ted</i></b>
escribe en RTF: eficazmente.
<br>
<center>
<p><img SRC="../../common/images/article123/ArtTed4.jpg" ALT="[article123/ArtTed4.jpg]" height=865 width=922></center>

<p>La documentacion de <b><i>Ted</i></b>, un archivo de 712 Kb., de nombre
TeDocument.rtf, explica, en ingl&eacute;s, c&oacute;mo recuperar e instalar
los tipos de letra AFM. Estos tipos de letra, que son archivos que en modo
texto describen la letra, podr&iacute;an utilizarse tras borrar los caracteres
"retorno al fin de l&iacute;nea" y "fin del archivo" (Control-Z). Pero
dicho as&iacute;, parece m&aacute;s sencillo de lo que en realidad suele
ser.

<A NAME="lfindex3">&nbsp;</A>
<H2>
&iquest;Es el Ted susceptible de mejora?</H2>

Si decimos que a&ntilde;adiendo nuevos tipos de letra, estamos ya respondiendo
que s&iacute;.
<br>No obstante, el producto es tan austero que ser&iacute;a deseable embellecerlo
un poco. Portarlo a Qt o Gtk, tan elegantes y funcionales, es una tarea
demasiado ardua.
<br>Pero podemos darnos un peque&ntilde;o gusto: si observamos atentamente
las copias de la pantalla, se observa que <b><i>Ted</i></b> se presenta
tanto en ingl&eacute;s como en franc&eacute;s. Pese a que no existe una
opci&oacute;n para elegir la lengua, no hay nada de m&aacute;gico en ello:
durante la instalaci&oacute;n, <b><i>Ted</i></b> copia en /usr/local/info
un archivo fuente denominado Ted.ad.sample que est&aacute; redactado por
completo en la lengua de Albi&oacute;n.
<TABLE ALIGN="right" width="45%" BGCOLOR="#dddd00" cellspacing="5" cellpadding="5"><TR><TD>
N. del T.: Lo mismo decimos de la versi&oacute;n en castellano del archivo, que
pod&eacute;is solicitar al traductor de este art&iacute;culo.
</TD></TR></TABLE>
<br>Sin embargo, es extramadamente f&aacute;cil traducirlo. Una vez terminada
la traducci&oacute;n, basta copiarlo en el directorio personal (p.e.: /home/andre)
d&aacute;ndole simplemente el nombre Ted. Adem&aacute;s, ese archivo permite
elegir el tipo de letra por defecto, el tama&ntilde;o del papel, los m&aacute;rgenes,
el diccionario, etc. No es nada desde&ntilde;able por tanto. Mi archivo Ted,
traducido al franc&eacute;s, est&aacute; a disposici&oacute;n de quien lo
quiera.
</p>

<p>
<center>La Figura 5 muestra <b><i>Ted&nbsp;</i></b> con algunos cuadros
de di&aacute;logo en franc&eacute;s
<br>&nbsp;
<p><img SRC="../../common/images/article123/ArtTed5.jpg" ALT="[article123/ArtTed5.jpg]" height=782 width=637></center>

<A NAME="lfindex4">&nbsp;</A>
<H2>
&iquest;Qu&eacute; funciones?</H2>

Es preciso abrir los men&uacute;es desplegables para saber de lo que es
capaz <b><i>Ted</i></b>, lo cual saltar&iacute;a a la vista y ser&iacute;a
m&aacute;s pr&aacute;ctico si dispusiera de una barra de iconos.
<br>El men&uacute;<b> Insert</b> (Insertar)&nbsp; es de los m&aacute;s
interesantes, ya que permite adornar el texto con seis tipos de objetos:
<br>- <b>picture</b> (imagen) vectorial o mapa de bits: reconoce 13 formatos,
entre los que se cuentan .ico, .bmp y .wmf propios de Windows, de manera
que &eacute;se no ser&aacute; un problema a la hora de transferir archivos.
En lo que se refiere a su disposici&oacute;n en la p&aacute;gina, Ted los
trata como si fueran caracteres de texto. En cuanto a sus dimensiones,
se pueden cambiar por medio de ocho puntos que aparecer&aacute;n en los
bordes de la imagen al pulsar sobre la misma dos veces el bot&oacute;n
de izquierdo del rat&oacute;n.
<center>Ver Figura 6
<br>&nbsp;
<p><img SRC="../../common/images/article123/ArtTed6.jpg" ALT="[article123/ArtTed6.jpg]" height=727 width=665></center>

<p>En este ejemplo, el &aacute;guila -en formato vectorial- se redimensiona
sin que se produzcan sorpresas desagradables; en cuanto al Tux dorado -en
formato de mapa de bits-, si queremos evitar efectos extra&ntilde;os al
modificar su tama&ntilde;o, convendr&aacute; respetar aproximadamente la
relaci&oacute;n altura/anchura (la ratio) original. Tales efectos desaparecer&aacute;n
tan pronto le devolvamos a la imagen su ratio.
<br>- <b>symbol</b> (s&iacute;mbolo) o car&aacute;cter particular insertado
con ayuda de una tabla de caracteres. Basta elegir el car&aacute;cter deseado
e insertarlo pulsando sobre Insert. El car&aacute;cter aparecer&aacute;
en la posici&oacute;n en la que se encuentre el cursor en el texto.
<center>Ver Figura 7
<br>&nbsp;
<p><img SRC="../../common/images/article123/ArtTed7.jpg" ALT="[article123/ArtTed7.jpg]" height=573 width=652></center>

<p>- <b>hyperlink </b>(hiperenlace)
<br>- <b>bookmark</b> (se&ntilde;alador)
<br>- <b>File</b> (archivo RTF)
<br>- <b>Table</b> (Tabla creada en Ted).
</p>
<TABLE WIDTH=35% ALIGN="right" BGCOLOR="#dddd00" cellspacing="5" cellpadding="5"><TR><TD>
N. del T.: Ya no se le puede lanzar ese reproche. Al menos
la versi&oacute;n que yo he instalado ya dispone de esa opci&oacute;n.
</TD></TR></TABLE>

<p>El <b>men&uacute; Format</b> se refiere a la forma que se da a los p&aacute;rrafos.
Permite tres tipos de alineaci&oacute;n: Left (izquierda), right (derecha)
y centered (centrada). Se le puede reprochar la ausencia de esa opci&oacute;n
de justificaci&oacute;n que proporciona a los textos un aspecto m&aacute;s
limpio y profesional. El men&uacute; permite, adem&aacute;s, insertar una
linea en blanco antes o despu&eacute;s de un p&aacute;rrafo, a&ntilde;adir
una l&iacute;nea encima o debajo del p&aacute;rrafo, hacer una regla de
formateo (copy ruler) y aplicarla a otros p&aacute;rrafos (paste ruler).
<p>El <b>men&uacute; Tools</b> (Herramientas) le permite hacer modificaciones
sobre su texto mediante seis opciones:
<br>-<b>Font Tool</b> (Tipo de letra): para elegir el tipo de letra, su
tama&ntilde;o y grosor, con la ayuda de una ventana de di&aacute;logo que
le permite previsualizar la letra elegida antes de su aplicaci&oacute;n
al texto.
<br>-<b>Find </b>(Buscar): abre una ventana de di&aacute;logo que le permite
buscar y reemplazar.
<br>-<b>Spelling </b>(Ortograf&iacute;a): corrector que utiliza el diccionario
/usr/local/ind/Spanish.ind, tan pronto como haya sido instalado e indicado
en el archivo de recursos "Ted" que &eacute;se es el diccionario.
En cualquier caso, ese men&uacute; permite elegir cualquiera de los diccionarios
instalados.&nbsp; Con la herramienta de correcci&oacute;n tambi&eacute;n
es posible construir un diccionario personalizado.
<br>&nbsp;&nbsp;&nbsp; Las opciones Learn y Forget, permiten hacer caso
omiso de las palabras desconocidas -opci&oacute;n Ignore- , corregir -opci&oacute;n
Correct- o buscar palabras parecidas -opci&oacute;n Guess-.
<br>- <b>Page Setup</b> (Formato de p&aacute;gina): para definir el tama&ntilde;o
del papel y los m&aacute;rgenes.
<br>- <b>Insert Symbol</b> (Insertar S&iacute;mbolo): para insertar un
s&iacute;mbolo o car&aacute;cter especial.
<br>- <b>Format Tool</b> (Opciones de formato): que desplegar&aacute;
una ventana con m&uacute;ltiples opciones para modificar el p&aacute;rrafo,
una secci&oacute;n o una tabla. Quiz&aacute; fuera preferible una herramienta
m&aacute;s manejable, como la herramienta de construcci&oacute;n din&aacute;mica
de tablas de StarOffice.
<center>Ver Figura 8: ejemplo de tabla
<br>&nbsp;
<p><img SRC="../../common/images/article123/ArtTed8.jpg" ALT="[article123/ArtTed8.jpg]" height=434 width=772></center>

<p>Hay tambi&eacute;n disponibles otras funciones menos habituales, como
<b>Mail
</b>(Correo),
<b>Hyperlinks
</b>(Hiperenlaces),
<b>Bookmark
</b>(Se&ntilde;alador)....
Estas dos &uacute;ltimas son &uacute;tiles si el documento es guardado
en formato HTML, por medio de la opci&oacute;n <b>Save to</b> (Guardar
en) del men&uacute;&nbsp; <b>File </b>(Archivo) que permite la conversi&oacute;n
del archivo con el que se est&aacute; trabajando, en un archivo *.txt y
*.html. En efecto, <b><i>Ted </i></b>puede guardar un archivo en estos
formatos, aunque no sea capaz de leerlos.
<br>Supongamos que guardamos un archivo en HTML. Si el documento contiene
im&aacute;genes, &eacute;stas se guardar&aacute;n en un subdirectorio de
extensi&oacute;n .img dentro del directorio que contiene el archivo HTML.
Para decirlo m&aacute;s claramente, si se guarda el archivo como toto.html,
y este archivo contiene im&aacute;genes, se crear&aacute; un directorio
toto.img que contendr&aacute; todas las im&aacute;genes del documento.
Dependiendo del n&uacute;mero de colores de las im&aacute;genes est&aacute;n
se convertir&aacute;n en GIF o en JPG, y llevar&aacute;n nombres del tipo:
36b60ce1.gif o 373a94ac.jpg, nombres que aparecen en el lugar de la imagen
en el documento HTML as&iacute; creado. Tablas, hiperenlaces y se&ntilde;aladores
se conservan igualmente como tales.
<br>&iexcl;Sencillamente genial!
<p>&iquest;Ofrece <b><i>Ted </i></b>otras posibilidades? La respuesta es
s&iacute;, pero es bueno que el usuario las descubra por s&iacute; mismo.
Es posible, por ejemplo, enviar correo directamente desde <b><i>Ted,</i></b>
como texto, RTF o HTML; es posible la comunicaci&oacute;n entre Netscape
y <b><i>Ted</i></b>; copiar y pegar con otras aplicaciones X11...
<A NAME="lfindex5">&nbsp;</A>
<H2>
&iquest;Cu&aacute;l es la conclusi&oacute;n?</H2>

<b><i>Ted </i></b>es una herramienta productiva, ligera y r&aacute;pida,
de agradable uso y razonablemente estable en su versi&oacute;n 2.5. A veces,
tras utilizar la tecla Supr para borrar l&iacute;neas vac&iacute;as, he
podido comprobar que el programa se cerraba sin previo aviso, lo que obligaba
a guardar el trabajo con frecuencia. Pero este problema ha quedado ya resuelto
en la versi&oacute;n 2.8. A este respecto, se le puede reprochar que no
existe la opci&oacute;n de archivado autom&aacute;tico cada cierto tiempo.
Se le puede objetar tambi&eacute;n una escasa versatilidad en la manipulaci&oacute;n
de las columnas y que no es posible que el texto se distribuya autom&aacute;ticamente
alrededor de las im&aacute;genes, cosa que har&iacute;a de
<b><i>Ted</i></b>
una buena herramienta para presentaciones. Por mi parte, me gustar&iacute;a
verlo portado a Gtk y Qt, con lo cual dispondr&iacute;amos de un GTed y
un KTed perfectamente integrados en Gnome y KDE. Pero lo cierto es que
<b><i>Ted
</i></b>es
un excelente instrumento. Por otra parte, este art&iacute;culo, como todos
los dem&aacute;s que he escrito con anterioridad, ha sido compuesto con
<b><i>Ted</i></b>. Y, que yo sepa, los editores jam&aacute;s han tenido
ning&uacute;n problema para integrarlos en sus programas profesionales
de publicaci&oacute;n. Eso lo dice todo.



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=123&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Andr&eacute; Pascual, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article123.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:apascual@club-internet.fr"><FONT COLOR="#FFFFFF">Andr&eacute; Pascual</FONT></a></font></td>
</tr>
<tr><td><font size=2>fr</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:inignaga@teleline.es"><FONT COLOR="#FFFFFF">Javier Fdez. Retenaga</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-07-02, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
