<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.9">
 <META NAME="LFCATEGORY" CONTENT="Forum">
 <TITLE>lf176, Forum:  Erase una vez... o Unix comercial vs Unix libre, y m&aacute;s!</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 pre { font-familiy:monospace,Courier }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://main.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="[Photo of the Author]" HEIGHT=115 WIDTH=124>
<BR>por  <A HREF="mailto:georges.t@linuxfocus.org">Georges Tarbouriech</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Georges es un usuario viejo de Unix (comercial y libre). Despu&eacute;s de
tantos a&ntilde;os ten&iacute;a ganas de hacer el balance de la
situaci&oacute;n:-)
</P>
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#lfindex0">Treinta a&ntilde;os despu&eacute;s</A></LI>
  <LI><A HREF="#lfindex1">Unix comercial</A></LI>
  <LI><A HREF="#lfindex2">Hardware</A></LI>
  <LI><A HREF="#lfindex3">Software</A></LI>
  <LI><A HREF="#lfindex4">Soporte y documentaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex5">&iquest;Qu&eacute; pasa?</A></LI>
  <LI><A HREF="#lfindex6">Unix libre</A></LI>
  <LI><A HREF="#lfindex7">NetBSD</A></LI>
  <LI><A HREF="#lfindex8">OpenBSD</A></LI>
  <LI><A HREF="#lfindex9">FreeBSD</A></LI>
  <LI><A HREF="#lfindex10">Linux</A></LI>
  <LI><A HREF="#lfindex11">&iquest;Qu&eacute; m&aacute;s?</A></LI>
  <LI><A HREF="#lfindex12">&iquest;A d&oacute;de ir desde aqu&iacute;?</A></LI>
  <LI><A HREF="#lfindex13">Fin</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=176&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2> Erase una vez... o Unix comercial vs Unix libre, y m&aacute;s!</H2>
 <IMG SRC="../../common/images/white.gif" HSPACE=10 >
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<p>
Unix apareci&oacute; en 1970. AT&T public&oacute; la primera licencia de c&oacute;digo
fuente en 1973. BSD (Berkeley Software Distribution) provey&oacute; c&oacute;digo
fuente para los que ten&iacute;an una licencia AT&T en 1977. El primer verdadero
Unix comercial, System III, apareci&oacute; en 1979 publicado por el mismo AT&T.
1988 vi&oacute; el nacimiento del System V release 4... y a fines de los 80,
ten&iacute;amos por lo menos 30 sabores de Unix, comerciales sobre todo, con
incompatibilidad de c&oacute;digo! Por esa &eacute;poca, la
mayor&iacute;a de las grandes compan&iacute;as tienen su
propio Unix: IBM con AIX, Apple con
A/UX, Microsoft con XENIX, HP con HP-UX...
</p><p>
En 1984, Richard Stallman arranc&oacute; el proyecto GNU (GNU is Not Unix)
y cre&oacute; la Free Software Foundation en 1985.
Durante el tiempo en el cual las grandes compan&iacute;as trataban de vender
licencias muy caras,la Free Software Foundation trataba de esparcir el concepto
de software libre.
Libre significaba libertad de usar el programa, de modificar el programa, de
distribuir copias o copias modificadas a favor de la communidad, pero no necesariamente
gratis.
Si quieren saberlo todo, den un paseo por <a
href="http://www.gnu.org">http://www.gnu.org</a>.
</p><p>
Mucha gente se sint&oacute; pr&oacute;xima a esta filosof&iacute;a y a principios de
los 90 ya ten&iacute;amos differentes sabores de Unix libre: NetBSD, Linux...
Hoy tenemos unos 50 Unixes comerciales o libre (quiz&aacute;s m&aacute;s!).
<br>
&iquest;Entonces qu&eacute;?
</p></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Treinta a&ntilde;os despu&eacute;s</H2>

<P>
El nombre Unix viene de MULTICS. Puesto que la gente que lo hab&iacute;a
desarrollado pensaba que hab&iacute;an querido demasiado, uno de los miembros
del equipo de MULTICS, Brian Kernighan, cambi&oacute; el nombre en UNICS, lo que
fue r&aacute;pidamente transformado en UNIX.
Sin embargo, actualmente Unix a&uacute;n es el &uacute;nico sistema "multitodo":
multitarea, multi-usuarios, multi-plataformas...
<br>
Es decir, NINGUN systema puede hacer lo mismo de la misma manera!
</P>

<P>
Todos los medios, <em>especializados</em> (en maquinas Wintel!) o no, presentan
Linux como una alternativa para Win*. &iquest;C&oacute;mo puede Linux ser una alternativa
para esa "cosa"? Linux es Unix, y si hay alternativa est&aacute; entre Unixes comerciales
o libres. Los entornos disponibles en Unix libre, como KDE o GNOME, pueden dar
al usuario una impresi&oacute;n de <em>dej&aacute; vu</em>, pero es todo. Adem&aacute;s,
hace diez a&ntilde;os les habr&iacute;an tomado por locos si ten&iacute;an Unix en su
ordenador personal!
<br>
Olvidemos!
</P>

<p>
lo importante es: pueden tener Unix a casa. Y eso da a Unix una nueva
<em>juventud</em> puesto que los usuarios se vuelven m&aacute;s y m&aacute;s
numerosos! Y esto es a&uacute;n m&aacute;s importante cuando se trata del
&aacute;rea profesional. Hoy se pueden elegir entre muchas soluciones al trabajo:
la competici&oacute;n entre Unix comercial y libre es una realidad.
<br>
&iquest;Qu&eacute; puede ayudar en &eacute;sta selecci&oacute;n?
</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>Unix comercial</H2>

<p>
A principios, &eacute;stos sistemas estaban reservados en las empresas gordas para m&aacute;quinas
gordas. Con el tiempo, los micro-ordenadores se han vuelto m&aacute;s potentes
que los mini-ordenadores y, en consecuencia, el mercado se ha vuelto m&aacute;s
importante. Cada fabricante trat&oacute; de construir m&aacute;quinas potentes para
m&aacute;s usuarios. Algunos lo han conseguido, independientemente de la forma en que
lograron alcanzar este objetivo.
</P>

</P>
Hay grandes fabricantes que son "referencias" en el mundo Unix.
IBM <ahref="http://www.ibm.com">http://www.ibm.com</a>,
Sun <a href="http://www.sun.com">http://www.sun.com</a>,
SGI <a href="http://www.sgi.com">http://www.sgi.com</a>,
HP <a href="http://www.hp.com">http://www.hp.com</a>,
y muchos otros son los m&aacute;s conocidos y probablemente los m&aacute;s utilizados.
Pero esto no significa que sean perfectos. La mayor&iacute;a tiene sus
particularidades y son m&aacute;s o menos Unixes propietarios (&iexcl;m&aacute;s m&aacute;s
que menos!). Son muy buenos en sistemas grandes pero probablemente no tanto en
m&aacute;quinas m&aacute;s peque&ntilde;as. Y Los precios son muy altos,
particularmente si tienen CPU especifica: SPARC, MIPS... Aunque tienen a menudo algo
especial. Por ejemplo, Sun es excelente para las redes, SGI es la referencia absoluta
para el grafismo...
</P>

<P>
Tratemos de ver lo que "ofrecen".
</p>

<A NAME="lfindex2">&nbsp;</A>
<H3>Hardware</H3>

<p>
Puesto que hablamos de empresas gordas, no podemos mencionar toda la lista de
sus productos. Sin embargo, sus <em>peque&ntilde;as workstations</em>
(estaciones de trabajo) pueden ser utilizadas como servidores, por ejemplo.
Es decir, podr&iacute;an elegir una RS6000 de IBM, una Ultra 2, 5, 10 o la nueva Blade
1000 de Sun, o una O2, Octane o Octane 2 de SGI. Claro que &eacute;stas </em>workstations</em>
son mucho m&aacute;s caras que una m&aacute;quina Intel "top range".
Los recambios tampoco son baratos. Una tarjeta gr&aacute;fica puede costar 5 o 6
veces el precio del &uacute;ltimo equivalente en el mundo Intel.
El poner al d&iacute;a una CPU, representar&aacute; el precio, otra vez, de una
m&aacute;quina Intel completa.
</P>

<P>
No obstante, &eacute;stas m&aacute;quinas van a durar largo tiempo, sin la necesidad de
cambiar piezas cada 3 meses... Tampoco necesitan una CPU de carreras para
trabajar con velocidad (aunque, sus CPU tampoco son lentos). Pero, incluso
una "peque&ntilde;a" CPU, digamos 200Mhz, dar&aacute; mejor resultados que el
equivalente Intel, &iexcl;que nadie m&aacute;s quiere! Por ejemplo, &eacute;stas estaciones no
tienen que aguantar el famoso efecto embudo que tienen las m&aacute;quinas Intel,
puesto que usan multi-canales para Entrada/Salida.
</p>

<A NAME="lfindex3">&nbsp;</A>
<H3>Software</H3>

<p>
Como hemos dicho antes, los SO de &eacute;stas m&aacute;quinas <EM>high-end</EM> son muy
propietarios. Es diff&iacute;cil decir cual es el <EM>peor</EM> (el m&aacute;s
propietario). Personalmente, dir&iacute;a que Sun. Es decir, &iexcl;Solaris no es Unix, es
Solaris! Esto vale para las &uacute;ltimas versiones: 2.*, 7 y 8. Solaris 1.*
era un buen BSD, pero s&oacute;lo es mi opinion. Pero Sun hizo un buen trabajo
para Unix: NFS, NIS... Sin embargo, ya hace alg&uacute;n tiempo.
</P>

<P>
Si &eacute;stas empresas son miembros del COSE (Common Open Software Environment) les
ofrecen el mejor entorno disponible: CDE. Claro, es broma, puesto que CDE es
la pieza de s...oftware (&iquest;?) con m&aacute;s bugs que pueden imaginar.
Afortunadamente, tenemos muchos gestores de ventanas libres para remplazar &eacute;sta
cosa, y en cualquier caso se  pueden usar alternativas, tales como OpenWindows
en Sun, por ejemplo.
<br>
Aparte del propio SO, el software es bastante caro en &eacute;stas m&aacute;quinas.
No obstante, la calidad es casi siempre de alto nivel. Y, no lo olviden, pueden
tambi&eacute;n beneficiarse del software libre. Sin embargo, &eacute;sto cambia, puesto que mucho
software importante tiene el mismo precio que en las otras plataformas. Por ejemplo,
Lightwave, un famoso software 3D, tiene el mismo precio para todas las plataformas
en las cuales se puede encontrar (pero, estoy siempre esperando la evoluci&oacute;n
6.0 para SGI, ya disponible para las otras plataformas desde hace un rato).
</P>

<P>
Algunos de &eacute;stos fabricantes proveen herramientas muy interesantes con sus
distribuciones. La mejor oferta parece ser la de SGI. A&uacute;n m&aacute;s, SGI
provee un CDROM con software libre. Hablando de free software, es imposible
olvidar la importancia de GNU para &eacute;stas empresas. &iexcl;Qu&eacute; suerte para ellas, tener
la posibilidad de usar compiladores GNU!, por ejemplo. Ser&iacute;a muy interesante
conocer el porcentaje de usuarios de &eacute;stas m&aacute;quinas trabajando con compiladores
GNU en vez de los compiladores "de la casa" (eso si los proveen con el sistema, si
no tendr&aacute;n que comprar otra licencia!). Y podr&iacute;amos a&ntilde;adir:
algunos de &eacute;stos compiladores no valen una pela; &iexcl;es un hecho! Puedo dar nombres...
</p>

<A NAME="lfindex4">&nbsp;</A>
<H3>Soporte y documentaci&oacute;n</H3>

<p>
Si pagan por ello, &eacute;stas grandes compan&iacute;as les ofrecen soporte t&eacute;cnico.
Seg&uacute;n el tipo de soporte, el precio de tal servicio puede ser muy alto.
Si no pagan por &eacute;ste servicio, se las arreglan.
Sin embargo, sus sitios web permiten obtener parches y documentaci&oacute;n...
Si tienen "experiencia", pueden tratar de pasar sin eso, sobre todo si no tienen
miedo a emplear tiempo buscando soluciones a sus problemas...
<br>
Habitualmente, la ayuda en l&iacute;nea es bastante completa en &eacute;stos sistemas. Aparte
de las p&aacute;ginas de manual, pueden encontrar mucho en hardware o software,
a menudo en HTML para ser leido con un navegador.
Otra vez, la mejor oferta parece venir de SGI puesto que tienen por lo menos
tres herramientas para buscar o leer documentaci&oacute;n.
</p>

<A NAME="lfindex5">&nbsp;</A>
<H3>&iquest;Qu&eacute; pasa?</H3>

<p>
Lo sorprendente viene del hecho que la mayor&iacute;a de &eacute;stos fabricantes
vende m&aacute;quinas basadas en CPU Intel, ¡a un precio m&oacute;dico!
&iquest;Qu&eacute; les pasa? &iquest;Qu&eacute; le pas&oacute; a SGI para presentar una m&aacute;quina basada
en Intel y trabajando bajo No Terminado 4.0? Bueno, los usuarios lo han pedido:
&iexcl;que gente m&aacute;s extra&ntilde;a!
</p>

<p>
Y ahora, la "moda" Linux va cambiando la pol&iacute;tica de &eacute;stas grandes
compan&iacute;as.
¿No les parecen raro, &eacute;stas empresas vendiendo sus m&aacute;quinas con Linux?
O a&uacute;n m&aacute;s sorprendiente, ¿dejando su SO gratis
(Solaris 7 u 8 por ejemplo) cuando se sabe por cuanto vend&iacute;an &eacute;ste SO poco
tiempo antes?
&iquest;Se convierten a la filantrop&iacute;a? &iquest;D&oacute;nde est&aacute; la trampa?
Miremos el lado positivo de &eacute;ste nuevo comportamiento: pueden obtener
m&aacute;quinas revisadas por el precio de un PC Intel... ¡en el cual
podr&aacute;n instalar un Unix libre!
A prop&oacute;sito, la nueva estaci&oacute;n SGI basado en Linux tiene probablemente
la mejor implementaci&oacute;n de OpenGL nunca vista en &eacute;ste sistema. Aunque SGI
es el padre de OpenGL: ¡&eacute;so puede ayudar!
</p>

<p>
Unas palabras sobre un nuevo Unix (bueno, lo llamaremos NeXT est&aacute; de
vuelta!): Mac OS X. Podr&iacute;a ser una buena elecci&oacute;n!
Pero, &iquest;no es Apple haciendo el mismo error que NeXT: una falsa posici&oacute;n en
el mercado? Esperen y vean o visiten <a href="http://www.apple.com">http://www.apple.com</a>!
Para concluir &eacute;ste cap&iacute;tulo, podemos decir que &eacute;stos sistemas comerciales
son muy fiables y estables y NO PUEDEN ser comparados de ninguna manera al
matador de Unix, el s&oacute;lo y &uacute;nico (por suerte!) No Terminado 4.0,
el padre (si, han inventado algo en Redmond!) del BSOD (Blus Screen Of Death -
Pantalla Azul De la Muerte)
<br>
Vamonos a la verdadera alternativa.
</p>

<A NAME="lfindex6">&nbsp;</A>
<H2>Unix libre</H2>

<p>
Hoy, todos hablan de Linux. Parece que Linux lo ha logrado d&oacute;nde otros han
fallado. Quiero decir hay muchos Unix libres, con tantas capacidades como Linux,
funcionando en muchas m&aacute;s plataformas, pero la prensa no los conoce (a
prop&oacute;sito, ¿saben algo de Linux?). Eso tiene que ser el resultado de la
plataforma inicial de Linux, puesto que era la m&aacute;s utilizada.
Por ejemplo NetBSD y sus derivados OpenBSD o FreeBSD son muy buenos. Pero
NetBSD, por ejemplo, no estaba &uacute;nicamente dedicado a las plataformas Intel cuando
apareci&oacute;. Lo que hubiera debido ser una ventaja se ha vuelto un
inconveniente.
</p>

<A NAME="lfindex7">&nbsp;</A>
<H3>NetBSD</H3>

<p>
NetBSD es probablemente uno de los mejores Unix libres. Funciona en unas 20
plataformas o m&aacute;s, y es realmente estable en casi todas. Este Unix es casi
perfecto y puede ser una buena elecci&oacute;n al trabajo, para remplazar Unixes
comerciales, seg&uacute;n lo que quieren hacer con el. Su evoluci&oacute;n es
m&aacute;s lenta que la de Linux. Pero ¿es eso cosa mala? La versi&oacute;n
actual se basa en BSD 4.4 y el &uacute;ltimo release es 1.4.2.
De todo modos pueden tenerle confianza!
<br>
Unas palabras en la licencia. La licencia NetBSD es a&uacute;n m&aacute;s libre
que la GPL. Para saber m&aacute;s echen un vistazo a
<a href="http://www.netbsd.org">http://www.netbsd.org</a>.
</p>

<A NAME="lfindex8">&nbsp;</A>
<H3>OpenBSD</H3>

<p>
Para ser breves: el mismo que el precedente pero funcionando en algunas
plataformas menos.
El acento est&aacute; particularmente puesto en la seguridad. Aparte, tiene m&aacute;s o
menos las mismas cualidades que NetBSD. Otro Unix en el cual pueden tener
confianza. Claro, tambi&eacute;n se basa en BSD 4.4. La versi&oacute;n actual es 2.7.
M&aacute;s en
<a href="http://www.openbsd.org">http://www.openbsd.org</a>.
</p>

<A NAME="lfindex9">&nbsp;</A>
<H3>FreeBSD</H3>

<p>
Como sus "hermanos mayores", pero particularmente dedicado a las plataformas
Intel y Alpha. Miren
<a href="http://www.freebsd.org">http://www.freebsd.org</a>.
</p>

<A NAME="lfindex10">&nbsp;</A>
<H3>Linux</H3>

<p>
Una revoluci&oacute;n para mucha gente, ¡lo que no es! Simplemente un buen Unix
libre basado en System V con muchas distribuciones disponibles. Todas iguales y
todas diferentes. La competici&oacute;n parece ser ¡mi instalaci&oacute;n es
m&aacute;s f&aacute;cil que la tuya! Cada sabor tiene sus defensores,
aunque la diferencia entre las
distribuciones no justifica un debate. Debian es conocido por su
filosof&iacute;a, RedHat por su abundancia, igual para SuSE, Mandrake...
Nunca use TurboLinux, Caldera... Encontrar&aacute;n todas las distribuciones
pinchando el bot&oacute;n "enlaces" arriba de &eacute;sta p&aacute;gina.
<br>
De todos modo, Linux es otro Unix fiable.
</p>

<A NAME="lfindex11">&nbsp;</A>
<H3>&iquest;Qu&eacute; m&aacute;s?</H3>

<p>
Estos Unixes no son propietarios comparados a los Unixes comerciales, aunque
tienen diferencias. La diferencia m&aacute;s importante viene del origen: BSD
o System V. Una cosa muy buena alrededor del Unix libre viene del importante
desarrollo de software. Eso ense&ntilde;a el dinamismo del software libre.
El n&uacute;mero de herramientas disponibles es impresionante, ¡y muchas
son gratis! Y otra vez, ¡tenemos GNU!
<br>
&Uacute;ltimo y no lo menos, pueden usar Unixes libres en casi todas las
plataformas disponibles. Pueden instalarlos en una vieja Intel
486 o en una realmente potenta m&aacute;quina Alpha (incluso si Compaq
distribuyera hoy d&iacute;a la tecnolog&iacute;a Alpha)
</p>

<A NAME="lfindex12">&nbsp;</A>
<H2>&iquest;A d&oacute;de ir desde aqu&iacute;?</H2>

<p>
Podr&iacute;amos contestar con una pregunta &iquest;Quiere decir este art&iacute;culo
"dejen de usar Unixes comerciales y empiezen usar Unixes libres"?
Bueno, &iexcl;eso es como les de la gana! Es decir, si necesitan "peque&ntilde;os"
servidores, pueden tener confianza en los Unixes libres (aqu&iacute;,
peque&ntilde;os significa no un Cray, por ejemplo).
<br>
Ser&aacute;n muy buenos para muchas tareas: servidores web, servidores de
aplicaciones (no siempre, puesto que depende mucho del tipo de applicaciones),
servidores de communicaci&oacute;n... y con mucha m&aacute;s seguridad que otros
(&iquest;de qui&eacute;n se trata?).
</p>

<p>
Lo que se dice de ellos muy a menudo es que no proporcionan soporte t&eacute;cnico.
No se dejen enga&ntilde;ar por tal afirmaci&oacute;n. A menudo, elsoporte t&eacute;cnico no
es muy eficaz. Lo siento, &iexcl;pero es un hecho! El trabajo principal para la gente
que administra sistemas, redes, etc. es encontrar soluciones a los diferentes
problemas. Es la &uacute;nica manera de aprender mucho: se podr&iacute;a llamar
"experiencia", y la vida ser&iacute;a m&aacute;s aburrida si no fuera por
buscar soluciones:-). De todos modos, la idea de soporte t&eacute;cnico sigue su camino
y la mayor&iacute;a de los distribuidores empiezan a proveer &eacute;ste servicio.
</p>

<p>
La cosa m&aacute;s importante relativa al software libre es sin duda la palabra
"compartir" (&iquest;tomar parte?). Cuando decimos que pueden tener confianza en el
software libre, significa que el tiempo de reacci&oacute;n es mucho m&aacute;s
corto que el de las grandes compan&iacute;as. Hay una communidad entera
detr&aacute;s de &eacute;l: un problema encontrado hoy, puede tener su soluci&oacute;n
ma&ntilde;ana. &iexcl;La gente de &eacute;sta communidad comparte cosas!
<br>
A&uacute;n m&aacute;s, para una empresa (grande o peque&ntilde;a), usar software
libre es una garant&iacute;a de reducir los gastos (&iexcl;por lo menos ahora!). Una
gran parte de &eacute;ste software es muy a menudo tan buena como los competidores
comerciales.
<br>
Otro punto importante: &iexcl;la imaginaci&oacute;n! El software libre nos da
herramientas nunca vistas antes. El &aacute;rea de la communicaci&oacute;n, por
ejemplo, se est&aacute; volviendo muy rica (gracias a la "revoluci&oacute;n"
Internet, &iexcl; que tambi&eacute;n tiene 30 a&ntilde;os !). Herramientas para redes,
seguridad, aparecen casi cada d&iacute;a, y a menudo est&aacute;n muy acabadas. Y esto
es cierto para muchas &aacute;reas.
<br>
Otro argumento que pueden o&iacute;r contra el software libre es la falta
de documentaci&oacute;n. &iexcl;Completamente falso! Hay toneladas de
documentaci&oacute;n, y va mejorando. Claro, &eacute;sta documentaci&oacute;n, a veces
no es tan elaborada como la de los productos comerciales. A menudo, s&oacute;lo
existe en un idioma (igual que con Unixes comerciales, de todas maneras). Sin
embargo, cada distribuci&oacute;n de Unix libre proporciona mucha
documentaci&oacute;n, &iexcl;&eacute;sto ten&iacute;a que ser dicho!
</p>

<p>
A prop&oacute;sito, &iexcl;documentaci&oacute;n internacional es la raz&oacute;n por
la cual estamos aqu&iacute;! El fundador de LinuxFocus, Miguel Angel Sepulveda,
se di&oacute; cuenta del problema idiom&aacute;tico muy temprano, y de ah&iacute; la idea de
la revista que estan leyendo.
Otro hecho a&uacute;n m&aacute;s notable alrededor de LinuxFocus, es que sigue
completamente la filosof&iacute;a del software libre. Somos probablemente una de
las pocas revistas en el web sin publicidad (aparte la del webhost, lo que parece
merecido).
En corto, no estamos "vendidos" a ninguna compan&iacute;a. Somos libres:
libres como gratis, libres como libertad de expresi&oacute;n... y felices.
Todos los miembros del equipo estan de acuerdo con eso.
Tambi&eacute;n trabajamos como trabaja el software libre. Somos un peque&ntilde;o
equipo, con miembros alrededor del mundo. &iquest;Cual es nuestro objetivo? Compartir
con los lectores. Si quieren, vengan con nosotros...
</p>

<A NAME="lfindex13">&nbsp;</A>
<H2>Fin</H2>

<p>
&iexcl;Por fin, se acab&oacute;! Puede haber parecido que &eacute;ste art&iacute;culo es un
alegato a favor del software libre (y de Unix). &iexcl;Claro que lo es! No tengo nada
contra las compan&iacute;as que tratan de ganar dinero por todos los medios.
Aunque depende de los medios... Pero tengo mucho respeto a &eacute;sta gente que hace
un trabajo fenomenal por nada. Estoy orgulloso de ser una muy peque&ntilde;a
parte de eso. Un punto notable, es la manera de trabajar. La mayor&iacute;a de
estos trabajos estan realizados por gente que nunca se ha visto, y que
estan separados por millares de kilometros.
Sin embargo, logran cumplir proyectos en un tiempo muy corto. &iexcl;A m&iacute; me parece
a una lecci&oacute;n sobre la organizaci&oacute;n del trabajo! Eso
tendr&iacute;a que dar ideas a los gerentes... Si Vd. es un gerente, puedo
trabajar en lo que quiera desde casa, en cualquier lugar que se encuentre... si me
deja tiempo para participar en proyectos libres. (&iexcl;publicidad libre!)
</p>

<p>
El otro punto importante concierne a Unix y los reci&eacute;n llegados.
Por favor traten de aprender sobre Unix. Hay toneladas de
literatura disponible en todos los idiomas. Vale la pena. Olviden su primera
experiencia con computadoras. Una de las grandes fuerzas del Rey de Redmond ha
sido de hacer creer a los usuarios que lo hab&iacute;an entendido todo. Claro, sus
productos piensan por vosotros... &iexcl;Aunque no piensan muy bien!
De todos modo, si hacen &eacute;ste esfuerzo, no lo lamentar&aacute;n. Y no
olviden, Unix tiene una gran ventaja: todo est&aacute; muy bien organizado. No
encontrar&aacute;n bibliotecas por todas partes, o unos directorios importantes
en las profundidades del &aacute;rbol, etc...
Si la palabra maestra para el software libre es "compartir", la palabra maestra
para Unix es "jerarqu&iacute;a". Piensen en eso, &iexcl;ayudar&aacute; mucho!
Despu&eacute;s de lograr, ser&aacute;n LIBRES... y libertad es una de las pocas grandes
causas valiendo la pena de luchar para defenderlas.
</p>

<p>
Vivimos una &eacute;poca estupenda... &iexcl;y las cosas mejor&aacute;n!
</p>



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=176&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article176.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2001-07-02, generated by lfparser version 2.9</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
