<HTML>
<HEAD>
<TITLE>Reproducci&oacute;n De Sonido COMO: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
<A HREF="Reproduccion-De-Sonido-Como-1.html">Anterior</A>
<A HREF="Reproduccion-De-Sonido-Como-3.html">Siguiente</A>
<A HREF="Reproduccion-De-Sonido-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Introducci&oacute;n</A></H2>


<P>Esto es el Reproducci&oacute;n-De-Sonido COMO. Contiene una lista de los diversos
formatos de sonido y de las aplicaciones que pueden ser usadas para
reproducirlos. Adem&aacute;s lista algunos trucos y consejos referentes al uso de
estas aplicaciones. Tambi&eacute;n describe algunas aplicaciones relacionadas con
el sonido pero no directamente con su reproducci&oacute;n. Sin embargo, este
documento <EM>no</EM> describe c&oacute;mo configurar Linux para dotarlo de soporte
para el sonido. Consulte el Sonido-Como traducido por Sergio Alonso
Manzanedo, <CODE>
<A HREF="mailto:sa.manzanedo@vll.servicom.es">sa.manzanedo@vll.servicom.es</A></CODE> para obtener instrucciones sobre
c&oacute;mo configurar un sistema Linux para tener sonido e informaci&oacute;n acerca
del hardware soportado.</P>
<P>Este documento trata de las aplicaciones de sonido para el usuario final.
Esto significa que solamente trata lo que un usuario medio tiene que
conocer del sonido desde el punto de vista de las aplicaciones, y no cosas
ex&oacute;ticas como la s&iacute;ntesis de voz, o informaci&oacute;n acerca del hardware que es
tratada en el Sonido COMO.</P>

<H2><A NAME="ss2.1">2.1 Copyright de este documento</A></H2>


<P>This document can be freely distributed and modified (I would appreciate
it if I were notified of any modifications), as long as this copyright
notice is preserved.  However, it cannot be placed under any further
restrictions, and a modified document must have the same copyright as this
one.  Also, credit must be given where due. </P>
<P>Este documento puede ser distribuido libremente y modificado (apreciar&iacute;a
que se me las notificara), siempre y cuando esta nota de copyright sea
conservada. Sin embargo, ninguna otra restricci&oacute;n adicional podr&aacute; ser
aplicada y cualquier trabajo derivado de &eacute;ste debe tener el mismo
copyright. Alg&uacute;n cr&eacute;dito debe ser acordado donde sea necesario.</P>


<H2><A NAME="ss2.2">2.2 Copyright de las aplicaciones listadas</A></H2>


<P>Si no se menciona ning&uacute;n copyright, la aplicaci&oacute;n est&aacute; sometida a la
Licencia GNU General Public License. </P>


<H2><A NAME="ss2.3">2.3 D&oacute;nde conseguir este documento</A></H2>


<P>La versi&oacute;n oficial (en ingl&eacute;s) m&aacute;s reciente de este documento puede ser
obtenida del <I>Linux Documentation Project</I>, <CODE>
<A HREF="http://sunsite.unc.edu/mdw/linux.html">http://sunsite.unc.edu/mdw/linux.html</A></CODE>. La versi&oacute;n no oficial
m&aacute;s reciente puede ser obtenida de <CODE>
<A HREF="http://laplace.snu.ac.kr/~wacko/howto/">http://laplace.snu.ac.kr/~wacko/howto/</A></CODE>. </P>
<P>Una versi&oacute;n en coreano de este documento (un poco desfasada) est&aacute;
disponible en <CODE>
<A HREF="http://plaza.snu.ac.kr/~wacko/howto/Sound-Playing-HOWTO.ks">http://plaza.snu.ac.kr/~wacko/howto/Sound-Playing-HOWTO.ks</A></CODE>. </P>
<P>Una versi&oacute;n en japon&eacute;s de este documento est&aacute; disponible en <CODE>
<A HREF="http://jf.gee.kyoto-u.ac.jp/JF/JF-ftp/euc/Sound-Playing-HOWTO.euc">http://jf.gee.kyoto-u.ac.jp/JF/JF-ftp/euc/Sound-Playing-HOWTO.euc</A></CODE>. </P>
<P>La &uacute;ltima versi&oacute;n Oficial (INSFLUG) en espa&ntilde;ol del documento que est&aacute; leyendo
estar&aacute; siempre en <CODE>
<A HREF="http://www.insflug.org">http://www.insflug.org</A></CODE>, y en la p&aacute;gina del traductor, 
<CODE>
<A HREF="http://www.geocities.com/SiliconValley/Vista/4289/Reproducir-sonido-index.html">http://www.geocities.com/SiliconValley/Vista/4289/Reproducir-sonido-index.html</A></CODE>. </P>


<H2><A NAME="ss2.4">2.4 Comentarios</A></H2>


<P>No lo s&eacute; todo, y no uso todas las aplicaciones aqu&iacute; listadas (algunas no
las puedo ni probar), as&iacute; que seguro que hay errores. Por otro lado, los
programas evolucionan continuamente, de tal forma que la documentaci&oacute;n
tiende a quedarse desfasada. Por lo tanto, si encuentra algo incorrecto,
por favor env&iacute;eme a <CODE>
<A HREF="mailto:wacko@power1.snu.ac.kr">wacko@power1.snu.ac.kr</A></CODE> cualquier correcci&oacute;n. Las
Sugerencias o adiciones a este documento ser&aacute;n bienvenidas. </P>


<H2><A NAME="ss2.5">2.5 Agradecimientos</A></H2>


<P>A todos los autores de las aplicaciones descritas en este COMO. Tambi&eacute;n a
Hannu Savolainen por el estupendo controlador de sonido y a Linus Torvalds
por el gran SO que lo soporta.  Querr&iacute;a dar las gracias a Raymond Nijssen
(<CODE>
<A HREF="mailto:raymond@es.ele.tue.nl">raymond@es.ele.tue.nl</A></CODE>), Jeroen Rutten (<CODE>
<A HREF="mailto:jeroen@es.ele.tue.nl">jeroen@es.ele.tue.nl</A></CODE>),
Antonio P&eacute;rez (<CODE>
<A HREF="mailto:aperez@arrakis.es">aperez@arrakis.es</A></CODE>), Ian Jackson (<CODE>
<A HREF="mailto:ijackson@gnu.ai.mit.edu">ijackson@gnu.ai.mit.edu</A></CODE>), y Peter Amstutz (<CODE>
<A HREF="mailto:amstpi@freenet.tlh.fl.us">amstpi@freenet.tlh.fl.us</A></CODE>) por sus informaciones y ayuda. </P>


<HR>
<A HREF="Reproduccion-De-Sonido-Como-1.html">Anterior</A>
<A HREF="Reproduccion-De-Sonido-Como-3.html">Siguiente</A>
<A HREF="Reproduccion-De-Sonido-Como.html#toc2">Indice</A>
</BODY>
</HTML>
