<HTML>
<HEAD>
<TITLE>Reproducci&oacute;n De Sonido COMO: Reproducci&oacute;n de diversos formatos de sonido</TITLE>
</HEAD>
<BODY>
<A HREF="Reproduccion-De-Sonido-Como-2.html">Anterior</A>
<A HREF="Reproduccion-De-Sonido-Como-4.html">Siguiente</A>
<A HREF="Reproduccion-De-Sonido-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Reproducci&oacute;n de diversos formatos de sonido</A></H2>


<P>Hay muchos tipos de formatos de sonido (WAV, MIDI, MPEG, etc...). A
continuaci&oacute;n son enumerados, as&iacute; como las aplicaciones que pueden ser
usadas para reproducirlos. </P>

<H2><A NAME="ss3.1">3.1 MIDI</A></H2>


<P>MIDI proviene de <I>Musical Instrument Device Interface</I>. Los ficheros midi
tienen normalmente la extensi&oacute;n <CODE>.mid</CODE>.  Contienen informaci&oacute;n de
secuenciado, es decir, acerca de cu&aacute;ndo tocar qu&eacute; instrumento y de qu&eacute;
forma, etc.  Seg&uacute;n su hardware (y tal vez dependiendo del sofware que use
para reproducirlo), el sonido puede ser excelente, o bien insufrible. </P>

<H3>El conjunto adagio</H3>


<P>Este conjunto incluye <CODE>mp</CODE> (un reproductor de ficheros MIDI desde la
l&iacute;nea de comandos) y <CODE>xmp</CODE> (un reproductor de ficheros basado en
XView). Necesitar&aacute; las extensiones SlingShot para usar <CODE>xmp</CODE>.  Tambi&eacute;n
contiene otros programas para reproducir partituras de Adagio. </P>
<P>Si tiene una GUS, <CODE>mp</CODE> puede reproducir ficheros MOD (v&eacute;ase la secci&oacute;n
<A HREF="#sec-modules">M&oacute;dulos</A> para m&aacute;s informaci&oacute;n).</P>
<P>Un peque&ntilde;o y molesto fallo (en la versi&oacute;n 0.5) es que el sonido acaba
bruscamente al final. En vez de terminar el sonido en la forma
especificada por el fichero MIDI, acaba repitiendo la nota inmediatamente
anterior a la final durante un largo intervalo de tiempo. Esto no ha hecho
que deje de usar <CODE>mp</CODE>, pero puede disuadir a alguien de usarlo para
trabajo 'de verdad'. Tambi&eacute;n arranca de forma relativamente lenta.</P>
<P>El programa no contiene ninguna informaci&oacute;n de copyright (al menos ninguna
que haya sido capaz de encontrar), as&iacute; que asumo que puede ser libremente
redistribuido y modificado. No me tome al pie de la letra, de todas
formas. (Por una interpretaci&oacute;n estricta de la ley de copyright, nada nos
da el derecho de hacer estas cosas, pero no creo que &eacute;sta fuese la
intenci&oacute;n del autor.)</P>
<P>Existe una versi&oacute;n del <I>CMU MIDI Toolkit para Linux</I> (aunque hay suficientes
adiciones como para que no sea una simple conversi&oacute;n) cuyo autor es Greg
Lee, <CODE>
<A HREF="mailto:lee@uhunix.uhcc.hawaii.edu">lee@uhunix.uhcc.hawaii.edu</A></CODE>.</P>
<P>Puede ser encontrada en <CODE>
<A HREF="ftp://tsx-11.mit.edu/pub/linux/packages/sound/adagio05.tar.gz">ftp://tsx-11.mit.edu/pub/linux/packages/sound/adagio05.tar.gz</A></CODE> 
Los ficheros binarios
inclu&iacute;dos est&aacute;n en formato <CODE>a.out</CODE> (enlazados con librer&iacute;as antiguas) y
el fichero <CODE>xmp</CODE> da un fallo de segmentaci&oacute;n en el entorno X11R6
(<CODE>XFree86 3.1.1, libc 4.7.2</CODE>).  El fichero <CODE>mp</CODE> funciona bien en un
entorno <CODE>a.out</CODE>. </P>
<P>Necesitar&aacute; un poco de ma&ntilde;a para compilarlo. Realmente, no es muy dif&iacute;cil. 
Todo lo que tiene que hacer es incluir el modificador <CODE>-lfl</CODE> al final
de <CODE>SHROBJ</CODE> y <CODE>XMPOBJ</CODE> en el fichero <CODE>Makefile</CODE>.  Esto es para
enlazarlo con la librer&iacute;a <CODE>flex</CODE>, que no es enlazada por defecto. Siga
a continuaci&oacute;n las instrucciones de instalaci&oacute;n. Y no olvide instalar las
extensiones XView y SlingShot si quiere compilar <CODE>xmp</CODE>. </P>

<H3>TiMidity</H3>


<P>Alguna gente recomienda este programa <EM>experimental</EM> por su buen sonido
(y es cierto, es mucho mejor que <CODE>mp</CODE> en una Sound Blaster 16, y
probablemente no sea muy diferente en una GUS).  Sin embargo, tiene como
inconveniente el importante uso de la CPU. Reproduce ficheros MIDI
mediante una conversi&oacute;n a formato WAV y despu&eacute;s reproduce este &uacute;ltimo
(tambi&eacute;n puede convertir un fichero MIDI en un WAV sin reproducirlo si lo
desea). Esta es la raz&oacute;n de su uso intensivo de la CPU. </P>
<P>Tambi&eacute;n tiene una interfaces ncurses, SLang, Tcl/Tk y Motif.</P>
<P>Necesita un parche para poder usarlo con tarjetas Gravis Ultrasound. 
Consulte la FAQ incluida con TiMidity para m&aacute;s informaci&oacute;n.</P>
<P>El autor es Tuukka Toivonen, <CODE>
<A HREF="mailto:tt@cgs.fi">tt@cgs.fi</A></CODE>). </P>
<P>La &uacute;ltima versi&oacute;n de <CODE>timidity</CODE> puede ser encontrada en <CODE>
<A HREF="http://www.cgs.fi/~tt/timidity/">http://www.cgs.fi/~tt/timidity/</A></CODE>.  Esta p&aacute;gina tambi&eacute;n
contiene un enlace a una peque&ntilde;a librer&iacute;a de parches para GUS. La versi&oacute;n
Motif puede obtenerse de <CODE>
<A HREF="http://www.loria.fr/~pagel">http://www.loria.fr/~pagel</A></CODE></P>


<H3>playmidi</H3>


<P>Este es un reproductor de MIDI que funciona con FM, GUS y MIDI externo. 
Se dice que comienza m&aacute;s r&aacute;pidamente que otros. Tambi&eacute;n es capaz de
reproducir ficheros Creative Music, Microsoft RIFF y ficheros MIDI de gran
tama&ntilde;o de juegos como Ultima 7.</P>
<P>Tiene una interfaz bajo X y otra para SVGA. Tambi&eacute;n tiene una opci&oacute;n para
reproducci&oacute;n en tiempo real siguiendo todas las notas en cada canal y la
velocidad de reproducci&oacute;n (incluido autom&aacute;ticamente con <CODE>xplaymidi</CODE> y
<CODE>splaymidi</CODE>). </P>
<P>Deber&iacute;a hacer algo como</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ splaymidi foo.mid; stty sane
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>si va a usar la interfaz SVGA, porque no reinicializa el modo tty del
terminal correctamente. La interfaz SVGA es susceptible de ser eliminada
pr&oacute;ximamente.</P>
<P>Ha sido realizado por Nathan Laredo, <CODE>
<A HREF="mailto:laredo@gnu.ai.mit.edu">laredo@gnu.ai.mit.edu</A></CODE> o
<CODE>
<A HREF="mailto:laredo@ix.netcom.com">laredo@ix.netcom.com</A></CODE>).</P>
<P>Puede ser obtenido por FTP an&oacute;nimo de <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/playmidi-2.3.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/playmidi-2.3.tar.gz</A></CODE></P>


<H2><A NAME="sec-modules"></A> <A NAME="ss3.2">3.2 M&oacute;dulos</A></H2>


<P>Los m&oacute;dulos (en el campo de la m&uacute;sica por ordenador) son ficheros de
m&uacute;sica digital, compuestos de un conjunto de muestras y de informaci&oacute;n de
secuenciado, que indican al reproductor cu&aacute;ndo reproducir qu&eacute; muestra
(instrumento) en qu&eacute; pista y en qu&eacute; tono, y realizando opcionalmente un
efecto como vibrato, por ejemplo. </P>
<P>Una ventaja que tiene sobre MIDI es que puede incluir casi cualquier tipo
de sonido (incluyendo voces humanas). Otra es que suena exactamente igual
en cualquier sistema, porque las muestras est&aacute;n en el m&oacute;dulo.  Una
desventaja que tiene es que es mucho m&aacute;s grande que MIDI. Adem&aacute;s, no tiene
ning&uacute;n formato est&aacute;ndar (el &uacute;nico <I>verdadero</I> es el ProTracker, con el
que muchos m&oacute;dulos no son compatibles). Apareci&oacute; en el Amiga.</P>
<P>Normalmente tienen la extensi&oacute;n <CODE>.mod</CODE>. Hay muchas otras extensiones
dependiendo de en qu&eacute; formato est&eacute;n. </P>

<H3>tracker</H3>


<P>Este programa portable (ha sido portado a muchas plataformas)  reproduce
m&oacute;dulos de m&uacute;sica SoundTracker y ProTracker. Usa solamente salida de 16
bits en est&eacute;reo, y considero que la calidad es muy buena. Si necesita una
forma simple de reducir el uso de la CPU, use la opci&oacute;n <CODE>-mono</CODE>. </P>
<P>Es un programa <I>giftware</I> citando al autor, Marc Espie, <CODE>
<A HREF="mailto:Marc.Espie@ens.fr">Marc.Espie@ens.fr</A></CODE>).</P>
<P>Puede encontrar una versi&oacute;n con el fichero <CODE>Makefile</CODE> modificado
para Linux en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/tracker-4.3-linux.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/tracker-4.3-linux.tar.gz</A></CODE></P>

<H3>gmod</H3>


<P>&Eacute;ste es un reproductor de m&oacute;dulos para la tarjeta Gravis Ultrasound. 
Soporta los formatos MOD de 4/6/8 pistas, 8 pistas 669, MultiTracker
(MTM), UltraTracker (ULT), FastTracker (XM) y ScreamTracker III (S3M). </P>
<P>Requiere la versi&oacute;n 3.0 o posterior de el controlador de sonido. Y una
GUS, por supuesto. Tal vez tenga que modificar el n&uacute;cleo para hacer que el
control de volumen funcione de la forma deseada. </P>
<P>Tiene una interfaz X. Usa las librer&iacute;as QT (versi&oacute;n 0.99 o superior).  Vea
<CODE>
<A HREF="http://www.troll.no/">http://www.troll.no/</A></CODE>
para informaci&oacute;n sobre QT. </P>
<P>Puede ser libremente distribuido. Fue escrito originalmente por Hannu
Savolainen, y ahora es mantenido por Andrew J. Robinson, <CODE>
<A HREF="mailto:robinson@cnj.digex.net">robinson@cnj.digex.net</A></CODE>.</P>
<P>Puede ser encontrado por ftp an&oacute;nimo de <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/gmod+x-3.0.1.tgz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/gmod+x-3.0.1.tgz</A></CODE></P>

<H3>MikMod</H3>


<P>Este reproductor de m&oacute;dulos reconoce los formatos XM, ULT, STM, S3M, MTM,
MOD y UNI. (El formato UNI es uno interno usado por MikMod). Soporta los
m&oacute;dulos comprimidos. Usa sonido est&eacute;reo de 16 bits como salida. Use la
opci&oacute;n <CODE>-m</CODE> (para sonido monoaural) si necesita una forma sencilla de
reducir el uso de la CPU. </P>
<P>La versi&oacute;n para Unix usa ncurses o Tcl/Tk para su interfaz.  Tambi&eacute;n puede
ser usado como una librer&iacute;a, y no s&oacute;lo como un programa independiente. </P>
<P>Ha sido escrito por Jean-Paul Mikkers, <CODE>
<A HREF="mailto:mikmak@via.nl">mikmak@via.nl</A></CODE>). Ahora es mantenido
por Jake Stine, <CODE>
<A HREF="mailto:dracoir@epix.net">dracoir@epix.net</A></CODE>).</P>
<P>Es shareware que tiene que ser registrado si desea usarlo comercialmente. 
Tambi&eacute;n necesita permiso para distribuirlo comercialmente (la distribuci&oacute;n
no comercial no lo necesita). </P>
<P>La versi&oacute;n para Unix puede ser encontrada en <CODE>
<A HREF="http://www.aics.net/~amstutz/mikmod.html">http://www.aics.net/~amstutz/mikmod.html</A></CODE>. </P>

<H3>xmp</H3>


<P>&Eacute;ste es un reproductor de m&oacute;dulos (no confundir con el <CODE>xmp</CODE> de Adagio) 
que puede reproducir MOD, S3M, STM, 669, y m&oacute;dulos XM (otros formatos
tambi&eacute;n son soportados, pero a&uacute;n est&aacute;n en fase experimental o incompletos)
en tarjetas de sonido con tabla de s&iacute;ntesis de ondas (GUS o SoundBlaster
32AWE), o en sistemas con SoftOSS (un controlador de s&iacute;ntesis wavetable por
software), En un futuro pr&oacute;ximo la salida ordinaria DSP deber&iacute;a ser
posible igualmente.</P>
<P>Tambi&eacute;n est&aacute; disponible una interfaz bajo <CODE>xmp</CODE>.</P>
<P>Fue escrito por Claudio Matsuoka (<CODE>
<A HREF="mailto:claudio@brasil.enemy.org">claudio@brasil.enemy.org</A></CODE> y H. Carraro Jr. </P>
<P>Puede ser encontrado en <CODE>
<A HREF="http://www.mardre.net/~claudio/xmp">http://www.mardre.net/~claudio/xmp</A></CODE>. </P>


<H3>s3mod</H3>


<P>Reproduce m&oacute;dulos MOD de 4/6/8 pistas y m&oacute;dulos de Scream Tracker 3. Usa
salida monoaural de 8 bits con una frecuencia de muestreo de 22000 Hz por
defecto. Puede usar la opci&oacute;n <CODE>-s</CODE> para usar est&eacute;reo, <CODE>-b</CODE> para
habilitar la salida de 16 bits, y <CODE>-f</CODE> para especificar la frecuencia
de muestreo. Sin embargo, el sonido resultante es peor que el de tracker
(alg&uacute;n ruido), as&iacute; que recomiendo el uso de <CODE>tracker</CODE> en vez de
<CODE>s3mod</CODE> para reproducir ficheros MOD comunes (a menos que tenga una
m&aacute;quina poco potente). Usa mucho menos la CPU que tracker. </P>
<P>El copyright pertenece a Daniel Marks y David Jeske, <CODE>
<A HREF="mailto:jeske@uiuc.edu">jeske@uiuc.edu</A></CODE> pero puede hacer
lo que quiera con &eacute;l (excepto afirmar que lo ha escrito). </P>
<P>Puede ser encontrado por ftp an&oacute;nimo en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/s3mod-v1.09.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/s3mod-v1.09.tar.gz</A></CODE></P>

<H3>mod</H3>


<P>Este programa en fase beta reproduce MODs (15/31 instrumentos, hasta 32
voces), MTMs, ULTs y S3Ms en la tarjeta Gravis Ultrasound. Puede usar
tambi&eacute;n m&oacute;dulos comprimidos si tiene <CODE>gzip</CODE>, <CODE>lharc</CODE>, <CODE>unzip</CODE>, o
<CODE>unarj</CODE> instalados. No puede reproducir m&oacute;dulos Powerpack, o los
comprimidos mediante ciertos compositores de Amiga (firma "PACK").</P>
<P>Requiere al menos la versi&oacute;n 3.0 del controlador de sonido. <EM>No</EM>
funcionar&aacute; con la versi&oacute;n 2.90-2 o anteriores. La interfaz de texto
requiere ncurses. Tambi&eacute;n est&aacute; incluida una interfaz X que usa Tcl/Tk. </P>
<P>Ha sido escrito por Mikael Nordqvist, <CODE>
<A HREF="mailto:mech@df.lth.se">mech@df.lth.se</A></CODE> o <CODE>
<A HREF="mailto:d91mn@efd.lth.se">d91mn@efd.lth.se</A></CODE>.</P>
<P>Puede ser encontrado por ftp an&oacute;nimo en  <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/mod-v0.81.tgz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/mod-v0.81.tgz</A></CODE></P>

<H3>nspmod</H3>


<P>&Eacute;ste es un reproductor de m&oacute;dulos en fase <EM>alpha</EM> que puede reproducir
m&oacute;dulos MTM, S3M y MOD. Se supone que es un reproductor de m&oacute;dulos para
tarjetas de sonido sin DSP (no se confunda con lo que Creative Labs llama
DSP). Su uso de la CPU es similar al de <CODE>tracker</CODE>. </P>
<P>Tiene una funci&oacute;n que permite que los m&oacute;dulos se reproduzcan en bucles si
as&iacute; lo especifican. El n&uacute;mero de bucles puede ser limitado mediante la
opci&oacute;n <CODE>-l</CODE>.  Tan solo usa 8 bit en la salida de sonido (en la versi&oacute;n
0.1). </P>
<P>Ha sido escrito por Toru Egashira, <CODE>
<A HREF="mailto:toru@jms.jeton.or.jp">toru@jms.jeton.or.jp</A></CODE>. </P>
<P>Puede ser encontrado por ftp an&oacute;nimo en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/nspmod-0.1.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/nspmod-0.1.tar.gz</A></CODE>.</P>

<H3>yampmod</H3>


<P>Este programa en fase <EM>alpha</EM> ha sido concebido para reproducir m&oacute;dulos
de 4 canales usando el m&iacute;nimo de recursos de la CPU. No fue dise&ntilde;ado para
producir sonido de alta calidad. As&iacute; que s&oacute;lo produce sonido de 22 kHz en
monoaural.  Adem&aacute;s, la salida no es tan "limpia" como deber&iacute;a, lo que
refleja su condici&oacute;n de software en fase alpha. </P>
<P>Ha sido escrito por David Groves, <CODE>
<A HREF="mailto:djg@djghome.demon.co.uk">djg@djghome.demon.co.uk</A></CODE>. </P>
<P>Est&aacute; disponible por ftp en <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/yampmod-0.1.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/yampmod-0.1.tar.gz</A></CODE></P>


<H2><A NAME="ss3.3">3.3 Ficheros de sonido MPEG</A></H2>


<P>MPEG es un est&aacute;ndar que especifica la codificaci&oacute;n de video y del audio
asociado para almacenamiento digital. MPEG est&aacute; normalmente asociado al
video, pero la parte de audio del est&aacute;ndar puede ser usada por separado. </P>
<P>&Eacute;sta define tres niveles: nivel I, II, y III.  Los reproductores que
pueden decodificar los niveles superiores tambi&eacute;n pueden decodificar las
inferiores. (ej: un reproductor de nivel III puede reproducir los ficheros
de tipo II). Los ficheros MPEG de tipo I tienen corrientemente la
extensi&oacute;n <CODE>.mpg</CODE> (as&iacute; que si un fichero no puede ser reproducido por un
reproductor de video MPEG, es probablemente de audio).; los de tipo II
normalmente <CODE>.mp2</CODE> y los de tipo III suelen tener <CODE>.mp3</CODE>. La
compresi&oacute;n del sonido es bastante buena. Un fichero de tipo MPEG II de dos
megabytes ocupar&iacute;a probablemente hasta 25 megabytes en un fichero de
muestras PCM con la misma calidad.</P>

<H3>mpg123</H3>


<P>Este programa <EM>beta</EM> es un reproductor de audio MPEG eficiente,
con soporte para mpeg 1.0/2.0 de niveles I, II y III. Est&aacute; basado en
el c&oacute;digo de muchas fuentes. Es capaz de reproducir en tiempo real
flujos le&iacute;dos por HTTP (es decir, uno puede reproducir audio MPEG
directamente desde la World Wide Web).</P>
<P>El autor principal es Michael Hipp, <CODE>
<A HREF="mailto:Michael.Hipp@student.uni-tuebingen.de">Michael.Hipp@student.uni-tuebingen.de</A></CODE>. Puede ser usado y
distribuido sin modificar libremente para fines no comerciales.  Su
inclusi&oacute;n en una colecci&oacute;n de software libre (como en im&aacute;genes de CD-ROM
de servidores FTP) est&aacute; explicitamente permitida. </P>
<P>La &uacute;ltima versi&oacute;n puede ser obtenida de <CODE>
<A HREF="http://www.heim3.tu-clausthal.de/~olli/mpg123/">http://www.heim3.tu-clausthal.de/~olli/mpg123/</A></CODE>.</P>

<H3>maplay 1.2</H3>


<P>Este reproductor de audio MPEG tan s&oacute;lo soporta los niveles I y II. 
Carece de soporte para el nivel III en la versi&oacute;n 1.2. Soporta tarjetas de
sonido de 16 bits bajo Linux (sin embargo, los rumores dicen que algunas
tarjetas de 16 bits no funcionan con <CODE>maplay</CODE>. </P>
<P>Usa muchos recursos de la CPU, tomando hasta alrededor de 55% del tiempo
de proceso en un Pentium 60MHz. La salida es intolerable en un 486 66MHz
porque la CPU simplemente no puede seguir el sonido. Si esto le ocurre,
intente reproducir solamente un lado del flujo de sonido (con las opciones
<CODE>-l</CODE> o <CODE>-r</CODE>), en vez del est&eacute;reo por defecto. </P>
<P>Un ligero cambio en uno de los ficheros puede ser necesario para
compilarlo. Necesitar&aacute; a&ntilde;adir la l&iacute;nea siguiente al comienzo del fichero
<CODE>configuration.sh</CODE>. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#! /bin/sh
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P><CODE>maplay</CODE> 1.2 puede ser obtenido por ftp an&oacute;nimo de <CODE>
<A HREF="ftp://ftp.cs.tu-berlin.de/pub/multimedia/maplay1.2/maplay1_2.tar">ftp://ftp.cs.tu-berlin.de/pub/multimedia/maplay1.2/maplay1_2.tar</A></CODE></P>

<H3>maplay 1.3b</H3>


<P>Esta es una modificaci&oacute;n no oficial (es decir, no del autor original)  de
<CODE>maplay</CODE> 1.2, que puede ejecutarse con un uso de la CPU menor. Consigue
&eacute;sto principalmente haciendo que la salida u-law funcione realmente en
otras plataformas aparte de SPARC. Tenga en cuenta que usa u-law como
salida por defecto, as&iacute; que la calidad del sonido es menor. </P>
<P>Las modificaciones fueron hechas por Orlando Andico, <CODE>
<A HREF="mailto:orly@gibson.eee.upd.edu.ph">orly@gibson.eee.upd.edu.ph</A></CODE>. </P>
<P>Se puede obtener via ftp an&oacute;nimo de <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/maplay-1.3b-Linux.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/maplay-1.3b-Linux.tar.gz</A></CODE>.</P>

<H3>maplay3</H3>


<P>Otro derivado de <CODE>maplay</CODE> 1.2. A&ntilde;ade soporte para audio MPEG de
nivel III. En estos momentos parece tener ciertos fallos en su
reproducci&oacute;n (se oyen algunos ruidos agudos). Tendr&aacute; que probar con las
opciones para solucionar esto. </P>
<P>Las modificaciones fueron realizadas por Timo Jantunen, <CODE>
<A HREF="mailto:timo.jantunen@hut.fi">timo.jantunen@hut.fi</A></CODE> o
<CODE>
<A HREF="mailto:jeti@cc.hut.fi">jeti@cc.hut.fi</A></CODE>. Dice
que se puede usar libremente, pero no se permite ganar dinero. Sin
embargo, no estoy totalmente seguro de la validez de este copyright,
puesto que el <CODE>maplay</CODE> original est&aacute; bajo la licencia GNU General
Public License, que no permite que los trabajos derivados tengan un
copyright diferente. </P>

<P>Se puede obtener via ftp an&oacute;nimo de <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/maplay3.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/maplay3.tar.gz</A></CODE>.</P>

<H3>splay</H3>


<P>Este player <EM>beta</EM> es otro derivado de <CODE>maplay</CODE> 1.2 (realmente, es
un derivado de <CODE>maplay</CODE> 1.2+, que es un derivado de <CODE>maplay</CODE> 1.2
para MS Windows solamente).  A&ntilde;ade soporte para audio MPEG de nivel III.
Tambi&eacute;n puede reproducir ficheros WAV. Adem&aacute;s, es capaz de reproducir
audio recibido a trav&eacute;s de una conexi&oacute;n HTTP. </P>
<P>Otra caracter&iacute;stica de <CODE>splay</CODE> es que puede ser usado como una librer&iacute;a
(bajo la LGPL), as&iacute; que puede ser usado en otros programas. Tambi&eacute;n
intenta mejorar el rendimiento usando <EM>threading</EM> (necesita
<CODE>pthreads</CODE> para usar esta caracter&iacute;stica) y un poco de ensamblador. </P>
<P><CODE>splay</CODE> usa una interfaz de l&iacute;nea de comando y opcionalmente una
interfaz bajo X (que usa QT).</P>
<P>Si despu&eacute;s de compilarlo no funciona (por ejemplo, da fallos de
segmentaci&oacute;n), intente recompilarlo de nuevo sin <EM>threading</EM>. </P>
<P>Es de Jung Woo-jae <CODE>
<A HREF="mailto:jwj95@eve.kaist.ac.kr">jwj95@eve.kaist.ac.kr</A></CODE>. </P>
<P>Puede ser obtenido desde <CODE>
<A HREF="http://adam.kaist.ac.kr/~jwj95/">http://adam.kaist.ac.kr/~jwj95/</A></CODE>.</P>

<H3>Sajber Jukebox</H3>


<P>Este programa es un reproductor MPEG con una interfaz gr&aacute;fica. Est&aacute; basado
en <CODE>splay</CODE>, as&iacute; que incluye soporte para MPEG de nivel I, II y III.
Tambi&eacute;n puede reproducir audio MPEG en tiempo real, mediante una conexi&oacute;n
HTTP. Es adem&aacute;s f&aacute;cil de configurar. </P>
<P>Usa las librer&iacute;as QT, <CODE>
<A HREF="http://www.troll.no/">http://www.troll.no/</A></CODE> (al menos la versi&oacute;n 1.2).  Tambi&eacute;n usa
la librer&iacute;a LinuxThreads, <CODE>
<A HREF="http://pauillac.inria.fr/~xleroy/linuxthreads/">http://pauillac.inria.fr/~xleroy/linuxthreads/</A></CODE> (el binario
incluido s&oacute;lo funciona con la versi&oacute;n 0.5).</P>
<P>El autor es Joel Lindholm, <CODE>
<A HREF="mailto:wizball@kewl.campus.luth.se">wizball@kewl.campus.luth.se</A></CODE>. </P>
<P>La &uacute;ltima versi&oacute;n puede obtenerse por <CODE>
<A HREF="ftp://kewl.campus.luth.se/pub/jukebox">ftp://kewl.campus.luth.se/pub/jukebox</A></CODE>.</P>

<H3>amp</H3>


<P>Este reproductor MPEG <EM>beta</EM> s&oacute;lo soporta audio MPEG de nivel III.
Puede reproducir directamente a la tarjeta de sonido, o dar salida a
ficheros PCM o WAV <I>en bruto</I> o sin cabecera. Tambi&eacute;n usa bastante 
CPU (alrededor de 60% en
un Pentium 133MHz). </P>
<P>Fue escrito por Tomislav Uzelac, <CODE>
<A HREF="mailto:tuzelac@rasip.fer.hr">tuzelac@rasip.fer.hr</A></CODE>. 
Puede ser usado y distribuido libremente, mientras no sea vendido
comercialmente sin permiso (sin embargo, est&aacute; expl&iacute;citamente permitido
incluirlo en CD-ROMs que contengan software libre). </P>
<P>Puede ser obtenido por <CODE>
<A HREF="ftp://ftp.rasip.fer.hr/pub/mpeg/amp-0.7.3.tgz">ftp://ftp.rasip.fer.hr/pub/mpeg/amp-0.7.3.tgz</A></CODE>. </P>


<H3>XAudio</H3>


<P>Esta librer&iacute;a <EM>alpha</EM> fue escrita para ser una implementaci&oacute;n r&aacute;pida de
una librer&iacute;a de descompresi&oacute;n MPEG para varias interfaces gr&aacute;ficas. 
Soporta audio MPEG de nivel I, II y III. Puede acceder aleatoriamente al
flujo de audio. Se incluye una interfaz de l&iacute;nea de comandos, al igual
que una bajo Motif (Lesstif)  en la versi&oacute;n para Linux. </P>
<P>Es de Gilles Boccon-Gibod, Alain Jobart y otros. Las interfaces para la
librer&iacute;a pueden ser descargadas libremente. La librer&iacute;a en s&iacute; debe ser
licenciada para usarla (una licencia para c&oacute;digo fuente y binarios tambi&eacute;n
est&aacute; disponible). </P>
<P>Las interfaces de la librer&iacute;a pueden obtenerse de <CODE>
<A HREF="http://www.mpeg.org/xaudio/">http://www.mpeg.org/xaudio/</A></CODE>. </P>

<H3><CODE>l3dec-l3enc</CODE> Codificador/decodificador de nivel IIIShareware</H3>


<P>Este es realmente un conversor que transforma los ficheros MPEG de nivel
III en WAV, AIFF, SND, AIFC, o ficheros de mustra PCM. La versi&oacute;n para
Linux no reproduce directamente el sonido con la tarjeta. Se tiene que
transformar en primer lugar a otro formato. </P>
<P>Sin embargo, cuando intente reproducir un fichero convertido mediante
<CODE>sox</CODE>, seguramente obtendr&aacute; s&oacute;lo ruido porque el orden de los bytes en
las muestras PCM no es correcto (al menos en las plataformas Intel). 
Necesitar&aacute; dar a <CODE>sox</CODE> la opci&oacute;n <CODE>-x</CODE> para resolver el problema.
Hay algunos reproductores que no necesitan que le indique el orden
de los bytes, as&iacute; que no tendr&aacute; que preocuparse de esto.</P>
<P>Si tiene un ordenador muy r&aacute;pido (al menos un Pentium a 90Mhz), entonces
puede intentar reproducirlo directamente sin convertir el fichero MPEG a
otro formato, como en el ejemplo siguiente (este ejemplo asume que est&aacute;
usando <CODE>sox</CODE> y reproduciendo una muestra de 44.1 kHz est&eacute;reo). </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ l3dec foo.mp3 -sto | play -t raw -x -u -w -c 2 -r 44100 -
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El n&uacute;mero tras <CODE>-r</CODE> es la frecuencia de muestreo de audio, y el n&uacute;mero
tras <CODE>-c</CODE> depende de si es mono o est&eacute;reo (o incluso tetraf&oacute;nico). Si
esto parece muy complicado, o inc&oacute;modo de usar continuamente, puede crearse 
algo como un script o un alias.</P>
<P>Este es shareware con copyright de <I>Fraunhofer-IIS</I>. Hay disponible una 
versi&oacute;n de
evaluaci&oacute;n para Linux (sistemas x86) por ftp an&oacute;nimo en
<CODE>
<A HREF="ftp://ftp.fhg.de/pub/layer3">ftp://ftp.fhg.de/pub/layer3</A></CODE>  S&oacute;lo convierte audio MPEG de
nivel III. </P>


<H2><A NAME="ss3.4">3.4 WAV</A></H2>


<P>Cita de la p&aacute;gina man de <CODE>sox</CODE>:</P>
<P>
<BLOCKQUOTE>
Parecen ser muy similares a los ficheros IFF, pero no iguales. Son el
formato de fichero nativo de Windows 3.1. Obviamente, Windows 3.1 es de
una importancia tan increible para la industria de la computaci&oacute;n que
simplemente ten&iacute;a que tener su propio formato de fichero de sonido. 
</BLOCKQUOTE>
</P>
<P>Normalmente tienen la extensi&oacute;n <CODE>.wav</CODE>.</P>
<P>Vea tambi&eacute;n la secci&oacute;n 
<A HREF="#sec-sox">sox</A> y 
<A HREF="#sec-bplay">bplay</A> para otros reproductores de WAV aparte de los listados aqu&iacute;. </P>

<H3>wavplay</H3>


<P>Este programa tiene una interfaz de l&iacute;nea de comandos y otra para X Window
para reproducir y grabar en formato WAV. Usa <EM>locking</EM> as&iacute; que s&oacute;lo un
sonido puede ser reproducido a la vez. Su capacidades de <EM>locking</EM>
pueden ser usadas separadamente de las de reproducci&oacute;n de sonido. </P>
<P>Adem&aacute;s de su interfaz de l&iacute;nea de comandos, tambi&eacute;n tiene una para Motif,
que puede ser usada con Lesstif. </P>
<P>Fue originalmente escrito por Andre Fuechsel, <CODE>
<A HREF="mailto:af1@irz.inf.tu-dresden.de">af1@irz.inf.tu-dresden.de</A></CODE>, y la implementaci&oacute;n actual es de
Warren W. Gay, <CODE>
<A HREF="mailto:bx249@freenet.toronto.on.ca">bx249@freenet.toronto.on.ca</A></CODE> o <CODE>
<A HREF="mailto:wwg@ica.net">mailto:wwg@ica.net</A></CODE>.</P>
<P>Se puede obtener via ftp an&oacute;nimo de <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/wavplay-1.0.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/wavplay-1.0.tar.gz</A></CODE>.</P>

<H3>XWave</H3>


<P>Este programa est&aacute; basado en <CODE>wavplay</CODE>. Tambi&eacute;n tiene una intefaz para
X Window para reproducir y grabar en formato WAV. Sin embargo, tambi&eacute;n
tiene ciertas capacidades de edici&oacute;n y puede a&ntilde;adir efectos. </P>
<P>Todav&iacute;a tiene fallos, as&iacute; que el autor apreciar&iacute;a cualquier informe de
fallo, correcciones, o nuevo c&oacute;digo. </P>
<P>Es <I>cardware</I>, o en otras palabras puede distribuirlo
libremente si lo registra enviando al autor una postal. Pero lo puede usar
sin registrarse, ¿¿¿mientras no le cojan??? </P>
<P>El autor es Will Fish <CODE>
<A HREF="mailto:fishwj@ee.port.ac.uk">fishwj@ee.port.ac.uk</A></CODE>.</P>
<P>XWave puede ser encontrado en <CODE>
<A HREF="ftp://ftp.ee.port.ac.uk/pub/linux/sound/xwave0.01-1.tar.gz">ftp://ftp.ee.port.ac.uk/pub/linux/sound/xwave0.01-1.tar.gz</A></CODE>. </P>


<H2><A NAME="ss3.5">3.5 Otras cosas</A></H2>


<P>Esta secci&oacute;n lista programas que reproducen sonido y que no merecen una
secci&oacute;n aparte (es decir, formatos para los que s&oacute;lo hay un reproductor
disponible). </P>

<H3><A NAME="sec-sox"></A> sox</H3>


<P>Este programa es realmente un convertidor, es decir que convierte sonido
de un formato a otro. Cuando es invocado como <CODE>play</CODE>, sin embargo,
reproduce el sonido (la aplicaci&oacute;n <CODE>play</CODE> del Sonido COMO probablemente
se refiere a esto). </P>
<P>Soporta binarios en bruto (sin cabecera)  y dato textual, archivos IRCAM,
Sound Blaster <CODE>.voc</CODE>, SPARC <CODE>.au</CODE> (con cabecera), Mac HCOM, PC/DOS
<CODE>.sou</CODE>, Sndtool y Sounder, NeXT <CODE>.snd</CODE>, Windows 3.1 RIFF/WAV, Turtle
Beach <CODE>.smp</CODE>, CD-R (CDAudio, seg&uacute;n el libro naranja), y Apple/sGI
AIFF as&iacute; como formatos 8SVX. </P>
<P>A partir de los kernel 1.3.6x, puede que tenga que hacer un peque&ntilde;o cambio
en un archivo para hacer que reproduzca el sonido directamente. 
Concretamente, tal vez deba cambiar la linea 179 en <CODE>sbdsp.c</CODE> de</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        if (abuf_size &lt; 4096 || abuf_size &gt; 65536) {
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>a</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        if (abuf_size &lt; 1 || abuf_size &gt; 65536) {
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Pero de nuevo, tal vez no tenga que hacer esto; hacerlo no estropear&aacute;
nada. </P>
<P>Ha sido escrito por mucha gente, y puede ser usado para cualquier
prop&oacute;sito. </P>
<P>Puede encontrarse por ftp an&oacute;nimo de <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/convert/Lsox-linux.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/convert/Lsox-linux.tar.gz</A></CODE>.</P>
<P>Una versi&oacute;n m&aacute;s reciente de Chris
Bagwell, <CODE>
<A HREF="mailto:cbagwell@mwsun026.aud.alcatel.com">cbagwell@mwsun026.aud.alcatel.com</A></CODE>, est&aacute; basado en la &uacute;ltima
versi&oacute;n gamma del <CODE>sox</CODE> original, y puede obtenerse por ftp de
<CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/convert/sox-11gamma-cb3.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/convert/sox-11gamma-cb3.tar.gz</A></CODE></P>

<H3><A NAME="sec-bplay"></A> bplay</H3>


<P>Este programa <EM>beta</EM> reproduce audio <EM>bruto</EM>, WAV y VOC. Tambi&eacute;n
puede grabar a estos ficheros. Usa varias t&eacute;cnicas para lograr la m&aacute;xima
velocidad posible, as&iacute; que puede ejecutarse aceptablemente incluso en
m&aacute;quinas lentas. Una de esas t&eacute;cnicas requiere que los programas
instalados sean setuid root. Los paranoicos que quieran usarlo podr&aacute;n
querer el paquete Debian de Ian Jackson, <CODE>
<A HREF="ijackson@gnu.ai.mit.edu">ijackson@gnu.ai.mit.edu</A></CODE>,
que desconecta la caracter&iacute;stica que necesita el bit setuid. </P>
<P>El autor es David Monro, <CODE>
<A HREF="mailto:davidm@gh.cs.usyd.edu.au">davidm@gh.cs.usyd.edu.au</A></CODE>. </P>
<P>Puede obtenerse por ftp an&oacute;nimo de <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/bplay-0.96.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/players/bplay-0.96.tar.gz</A></CODE></P>

<H3>SIDPLAY</H3>


<P>Este programa emula el chip "Sound Interface Device" (MOS 6581, com&uacute;nmente
llamado SID) y la unidad de micro procesador (MOS 6510) del Commodore 64.
Por &eacute;sto, es capaz de cargar y ejecutar programas en c&oacute;digo m&aacute;quina de C64
que producen m&uacute;sica o sonido. En general estos fragmentos de c&oacute;digo y
datos han sido extra&iacute;dos de juegos y programas de demostraci&oacute;n que han
sido transferidos directamente desde el C64. </P>
<P>Usa una interfaz de l&iacute;nea de comandos por defecto. Tambi&eacute;n hay interfaces
para Tk y QT disponibles separadas desde la p&aacute;gina principal. </P>
<P>Es mantenido por Michael Schwendt, <CODE>
<A HREF="mailto:sidplay@geocities.com">sidplay@geocities.com</A></CODE>. </P>
<P>Puede obtenerse de <CODE>
<A HREF="http://www.geocities.com/SiliconValley/Lakes/5147/">http://www.geocities.com/SiliconValley/Lakes/5147/</A></CODE>.</P>

<H3>RealAudio Player</H3>


<P>Esto le permite escuchar el sonido en tiempo real a trav&eacute;s de Internet sin
descargar el fichero completo antes. Puede ser usado solo, pero est&aacute;
realmente dise&ntilde;ado para ser usado con un navegador web (los expl&iacute;citamente
soportados son Mosaic y Netscape). No puede ser usado sin X (no ser&iacute;a
capaz de hacerlo funcionar con Lynx en una consola de texto). </P>
<P>Es de Progressive Networks, Inc. No puede ser redistribuido, modificado,
etc. Mire la licencia para detalles exactos sobre lo que puede hacer. 
Puede ser obtenido mediante un registro gratuito en la p&aacute;gina de
RealAudio, <CODE>
<A HREF="http://www.realaudio.com/">http://www.realaudio.com/</A></CODE>.</P>

<H3>cat</H3>


<P>Uno podr&iacute;a preguntarse qu&eacute; tiene que ver <CODE>cat</CODE>, la utilidad de
concatenaci&oacute;n, con la reproducci&oacute;n de sonidos. Mostrar&eacute; su uso a trav&eacute;s de
un ejemplo. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
$ cat sample.voc &gt; /dev/dsp
$ cat sample.wav &gt; /dev/dsp
$ cat sample.au &gt; /dev/audio
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Hacer un <CODE>cat</CODE> de un fichero <CODE>.au</CODE> a <CODE>/dev/audio</CODE> normalmente
funcionar&aacute;, y si tiene bastante suerte y el fichero tiene el orden
adecuado de bytes (para su plataforma), etc., un <CODE>cat</CODE> de un fichero de
sonido que una muestras PCM (como <CODE>.wav</CODE> o <CODE>.voc</CODE>) a
<CODE>/dev/dsp</CODE> puede incluso sonar bien. </P>
<P>Esto no supone un uso absurdo de <CODE>cat</CODE>. Puede ser &uacute;til, por
ejemplo si tiene un fichero de sonido que ninguno de sus programas
reconoce, y sabe que usa muestras PCM; entonces puede hacerse una idea muy
aproximada de como suena de esta forma (si tiene suerte). </P>


<HR>
<A HREF="Reproduccion-De-Sonido-Como-2.html">Anterior</A>
<A HREF="Reproduccion-De-Sonido-Como-4.html">Siguiente</A>
<A HREF="Reproduccion-De-Sonido-Como.html#toc3">Indice</A>
</BODY>
</HTML>
