<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.15">
 <TITLE>El C&oacute;mo del sonido en Linux: Instalaci&oacute;n.</TITLE>
 <LINK HREF="Sonido-COMO-5.html" REL=next>
 <LINK HREF="Sonido-COMO-3.html" REL=previous>
 <LINK HREF="Sonido-COMO.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="Sonido-COMO-5.html">Página siguiente</A>
<A HREF="Sonido-COMO-3.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4.</A> <A HREF="Sonido-COMO.html#toc4">Instalaci&oacute;n.</A></H2>

<P>Configurar Linux para que soporte sonido implica los siguientes pasos:</P>
<P>
<OL>
<LI>Instalar la tarjeta de sonido.</LI>
<LI>Configurar y construir el n&uacute;cleo para que soporte sonido.</LI>
<LI>Crear los ficheros de dispositivo.</LI>
<LI>Rearrancar el n&uacute;cleo Linux y comprobar la instalaci&oacute;n.</LI>
</OL>
</P>
<P>La siguiente secci&oacute;n cubre cada uno de estos pasos en detalle.</P>

<H2><A NAME="ss4.1">4.1</A> <A HREF="Sonido-COMO.html#toc4.1">Instalar la tarjeta de sonido.</A>
</H2>

<P>Siga las instrucciones del fabricante para instalar el hardware o enc&aacute;rgueselo
a su vendedor.</P>
<P>Las tarjetas de sonido antiguas suelen tener microinterruptores o "jumpers" 
para ajustar el canal DMA, IRQ, etc; apunte los valores utilizados. Si no est&aacute;
seguro, utilice los valores por defecto. Intente evitar conflictos con otros 
dispositivos como tarjetas ethernet, controladores SCSI, puertos serie y paralelo,
si es posible.</P>
<P>Normalmente deber&iacute;a utilizar el mismo puerto E/S, IRQ y DMA que bajo DOS. En algunos
casos (particularmente con tarjetas PnP) puede necesitar utilizar ajustes distintos
para conseguir que las cosas funcionen correctamente bajo Linux. Puede que requiera
experimentar un poco.</P>

<H2><A NAME="ss4.2">4.2</A> <A HREF="Sonido-COMO.html#toc4.2">Configurar el n&uacute;cleo.</A>
</H2>

<P>Cuando inicialmente instala Linux, est&aacute; usando el n&uacute;cleo precompilado.
estos n&uacute;cleos generalmente no soportan sonido. Lo mejor es recompilar el
n&uacute;cleo con los controladores que necesite. Tambi&eacute;n puede querer recompilar el
n&uacute;cleo para actualizar hacia una nueva versi&oacute;n o para liberar recursos
de memoria minimizando el tama&ntilde;o del mismo.</P>
<P>El <CODE>Linux Kernel HOWTO</CODE> 
<A HREF="http://sunsite.unc.edu/mdw/HOWTO/kernel-HOWTO.html">Linux Kernel HOWTO</A>
puede ser consultado para m&aacute;s detalles acerca de la construcci&oacute;n del n&uacute;cleo. S&oacute;lo
mencionar&eacute; los aspectos que son espec&iacute;ficos a las tarjetas de sonido.</P>
<P>Si nunca ha configurado el n&uacute;cleo para soporte de sonido, es una buena
idea leer todos los ficheros Readme incluidos con los controladores de sonido
del n&uacute;cleo, particularmente aquellos que se refieren a su tipo de tarjeta.
Los siguientes ficheros de documentaci&oacute;n se pueden encontrar en el directorio
de sonido del n&uacute;cleo, generalmente instalado en
<CODE>/usr/src/linux/drivers/sound</CODE>:</P>
<P>
<PRE>
CHANGELOG         - Descripci&oacute;n de los cambios en cada versi&oacute;n.
COPYING           - Restricciones de copia y copyright.
Readme            - &Uacute;ltimas y m&aacute;s importantes noticias.
Readme.aedsp16    - Informaci&oacute;n sobre la tarjeta Audio Excel DSP 16.
Readme.cards      - Notas de configuraci&oacute;n de tarjetas espec&iacute;ficas.
Readme.linux      - Notas de instalaci&oacute;n separada de controladores de sonido.
Readme.modules    - C&oacute;mo construir un controlador como un m&oacute;dulo del n&uacute;cleo cargable.
Readme.v30        - Nuevas caracter&iacute;sticas de la versi&oacute;n 3.0 del controlador de sonido.
experimental.txt  - Notas de caracter&iacute;sticas experimentales.
</PRE>

Siga el procedimiento usual de construcci&oacute;n del n&uacute;cleo. Hay tres formas de
ejecutar el proceso de configuraci&oacute;n. Un interfaz gr&aacute;fico de usuario que
se ejecuta bajo X11 puede ser llamado usando <CODE>make xconfig</CODE>, un sistema
basado en men&uacute;s que s&oacute;lo requiere un display de texto est&aacute; disponible como
<CODE>make menuconfig</CODE> y el m&eacute;todo original, utilizando <CODE>make config</CODE>,
que ofrece un simple interfaz basado en texto.</P>
<P>Hay que ser especialmente cuidadosos cuando se emplee "make xconfig" o "make 
menuconfig". Todas las preguntas de S&iacute;/No deben ser examinadas cuidadosamente. La
respuesta proporcionada por defecto para estas preguntas es siempre No, lo cual
no es lo adecuado en todos los casos. en particular, la opci&oacute;n "/dev/dsp and
/dev/audio support" (CONFIG_AUDIO) debe ser habilitada normalmente.</P>
<P>En este documento asumir&eacute; que usted utiliza el m&eacute;todo tradicional de configuraci&oacute;n
en l&iacute;nea de comandos invocado utilizando "make config", aunque el proceso es similar
en todos los casos.</P>
<P>Hay tambi&eacute;n dos maneras distintas de configurar el sonido. La primera es la manera
"antigua" (la &uacute;nica ofrecida antes del n&uacute;cleo 2.0.0). Utiliza un programa de configuraci&oacute;n
independiente que es parte del controlador de sonido. Este m&eacute;todo funciona con la mayor&iacute;a
de las tarjetas de sonido excepto con las pocas que requieren controladores adicionales
de bajo nivel (miroSOUND, AWE32, y AEDSP16).</P>
<P>El segundo es el "nuevo" m&eacute;todo que est&aacute; mejor integrado con la configuraci&oacute;n basada en
men&uacute;s utilizada para el resto del kernel. Este m&eacute;todo no funciona bien con las tarjetas
de sonido que requieren un fichero descargado de la propia empresa. Esto afecta a las
tarjetas PSS, SM Wave, AudioTrix Pro y TurtleBeach Tropez/Maui. Con estas tarjetas
debe usarse el m&eacute;todo antiguo.</P>
<P>El m&eacute;todo "nuevo" se utiliza siempre al hacer "make xconfig". Cuando se utiliza "make
menuconfig" puede elegir entre los m&eacute;todos nuevo y viejo en la submen&uacute; de sonido. Cuando
utilice "make config" se usar&aacute; el m&eacute;todo viejo por defecto. Sin embargo, si usted ha 
utilizado el m&eacute;todo "nuevo" alguna vez, "make config" lo utilizar&aacute; tambi&eacute;n. Puede volver
al m&eacute;todo "viejo" ejecutando "make menuconfig" y eligiendo el metodo "antiguo".</P>
<P>El m&eacute;todo recomendado es utilizar "make menuconfig" junto con el m&eacute;todo de configuraci&oacute;n
de sonido "antiguo". Muchos problemas de configuraci&oacute;n son causados (al menos en parte) por
el uso incorrecto del m&eacute;todo "nuevo".</P>
<P>Tambi&eacute;n es posible construir el controlador de sonido como un m&oacute;dulo cargable del
n&uacute;cleo. Yo recomiendo construir, en un principio, el controlador dentro del n&uacute;cleo. Una vez que
ha comprobado que funciona, si lo desea puede probar usando la opci&oacute;n de m&oacute;dulo
del n&uacute;cleo.</P>
<P>Cuando ejecute <CODE>make config</CODE>, active el soporte de sonido contestando "y" a la
pregunta</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Sound card support (CONFIG_SOUND) [M/n/y/?]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Al final de las preguntas de configuraci&oacute;n un programa de configuraci&oacute;n de
sonido ser&aacute; compilado, ejecutado y te preguntar&aacute; qu&eacute; opciones de sonido
quieres. Tenga cuidado al contestar estas preguntas, ya que si contesta
incorrectamente a alguna, repercutir&aacute; en preguntas posteriores. Por ejemplo,
no conteste "yes" (s&iacute;) a la primera pregunta (PAS16) si realmente no tiene
una PAS16. No active m&aacute;s tarjetas de las que realmente tiene, ya que
consumen memoria. Adem&aacute;s algunos controladores (como el MPU401) pueden entrar en
conflicto con el controlador SCSI e impedir la arranque del n&uacute;cleo.</P>
<P>Aqu&iacute; listo una peque&ntilde;a descripci&oacute;n de cada una de las opciones del di&aacute;logo
de configuraci&oacute;n. Conteste "y" (s&iacute;) o "n" (no) en cada pregunta. La respuesta
por defecto es mostrada en primer lugar y en may&uacute;sculas, de tal forma que
"Y/n/? significa "y" (s&iacute;) por defecto, y "N/y/? significa "n" (no). Para usar
el valor por defecto basta con pulsar return, pero hay que recordar que el
valor por defecto no significa que sea necesariamente correcto.</P>
<P>Si introduce como respuesta una interrogaci&oacute;n (?) saldr&aacute; un corto mensaje
describi&eacute;ndote esa opci&oacute;n de configuraci&oacute;n.</P>
<P>Debe fijarse en que no todas las preguntas ser&aacute;n respondidas. El programa de configuraci&oacute;n
desactivar&aacute; algunas preguntas dependiendo de las respuestas anteriores.
Adem&aacute;s &eacute;l tambi&eacute;n elegir&aacute; algunas opciones autom&aacute;ticamente.</P>
<P>
<DL>
<DT><B>Old configuration exists in /etc/soundconf. Use it Y/n/?</B><DD><P>Si previamente ha compilado el n&uacute;cleo para soporte de sonido entonces
la configuraci&oacute;n anterior se puede salvar. Si desea usar
los valores anteriores conteste "y" (s&iacute;). Si est&aacute; probando una configuraci&oacute;n
diferente o ha actualizado a un n&uacute;cleo nuevo, debe contestar
"n" (no) e ir a trav&eacute;s del proceso de configuraci&oacute;n.</P>

<DT><B>ProAudioSpectrum 16 support Y/n/?</B><DD><P>Conteste "y" (s&iacute;) <EM>s&oacute;lo</EM> si tiene una Pro Audio Spectrum <EM>16</EM>,
Pro Audio Studio 16 o Logitech SoundMan 16. No conteste "y" (s&iacute;)
si tiene otra tarjeta de Media Visi&oacute;n o Logitech ya que no
son compatibles con PAS16.</P>

<DT><B>SoundBlaster support Y/n/?</B><DD><P>Conteste "y" (s&iacute;) s&oacute;lamente si posee una SoundBlaster original
de Creative Labs o una cl&oacute;nica 100% compatible a nivel hardware
como por ejemplo una Thunderboard o una SM Games. Si su tarjeta
estaba en la lista de tarjetas soportadas busque las instrucciones
espec&iacute;ficas en el fichero Readme.cards antes de contestar a
la pregunta. Para una tarjeta desconocida puede contestar "y"
(s&iacute;) si la tarjeta presume de ser compatible con SoundBlaster.</P>

<DT><B>Gravis Ultrasound support Y/n/?</B><DD><P>Conteste "y" (s&iacute;) si tienes una GUS o una GUS MAX. Conteste "n"
(no) en caso contrario ya que el controlador consume mucha memoria.</P>

<DT><B>MPU-401 support (NOT for SB16) Y/n/?</B><DD><P>Tenga cuidado con esta pregunta. El interfaz MPU401 es soportado
por casi todas las tarjetas de sonido, aunque algunas tarjetas
tienen su propio controlador MPU401. Activar la opci&oacute;n MPU401 con esas
tarjetas causar&aacute; un conflicto. Tambi&eacute;n el activar MPU401 en un
sistema que realmente no tiene un MPU401 puede causar alg&uacute;n problema.
Si su tarjeta estaba en la lista de tarjetas soportadas busque las
instrucciones espec&iacute;ficas en el fichero <CODE>Readme.cards</CODE>.
Es seguro contestar "y" (s&iacute;) si posee una verdadera tarjeta interfaz
MPU401 MIDI.</P>

<DT><B>6850 UART Midi support Y/n/?</B><DD><P>Lo mejor es contestar "n" (no) siempre. El interfaz UART 6850
raramente es usado.</P>

<DT><B>PSS (ECHO-ADI2111) support Y/n/?</B><DD><P>Conteste "y" (s&iacute;) solamente si tiene una Orchid SW32, Cardinal
DSP16 o alguna otra tarjeta basada en el juego de chips PSS
(AD1848 codec + ADSP-2115 DSP chip + Echo ESC614 ASIC CHIP).</P>

<DT><B>16 bit sampling option of GUS (<EM>not</EM> GUS MAX) Y/n/?</B><DD><P>Conteste "y" (si) si tiene instalada una tarjeta hija de 16
bits en su GUS. Conteste "n" (no) si tiene una GUS MAX.
Activando esta opci&oacute;n se desactiva el soporte GUS MAX.</P>

<DT><B>GUS MAX support Y/n/?</B><DD><P>Conteste "y" (s&iacute;) s&oacute;lo si tiene una GUS MAX.</P>

<DT><B>Microsoft Sound System support Y/n/?</B><DD><P>Piense otra vez cuidadosamente antes de contestar "y" (s&iacute;) a
esta pregunta. Lo mejor es contestar s&iacute; cuando se tenga una tarjeta
original Windows Sound System fabricada por Microsoft o una
Aztech SG16 Pro (o una NX16 Pro). Tambi&eacute;n puede contestar
"y" (s&iacute;) en el caso de que su tarjeta no estuviera en la lista
anterior. Para las tarjetas que tienen soporte del controlador, consulte
las instrucciones espec&iacute;ficas en el fichero <CODE>Readme.cards</CODE>. Algunos
controladores tienen su propio soporte MSS y por lo tanto activar esta
opci&oacute;n causar&aacute; un conflicto.</P>

<DT><B>Ensoniq Soundscape support Y/n/?</B><DD><P>Conteste "y" (s&iacute;) si tiene una tarjeta basada en el juego de
chips Ensoniq Soundscape. Estas tarjetas son fabricadas, al menos,
por Ensoniq, Spea y Reveal (Reveal hace otras tarjetas tambi&eacute;n).</P>

<DT><B>MediaTriX AudioTriX Pro support Y/n/?</B><DD><P>Conteste "y" (s&iacute;) si tiene una AudioTriX Pro.</P>

<DT><B>Support for MAD16 and/or Mozart based cards?</B><DD><P>Conteste "y" (s&iacute;) si su tarjeta tiene un chip de interfaz de
audio Mozart (OAK OTI-601) o un MAD16 (OPTI 82C928 o 82C929).
Estos chips son actualmente muy comunes por lo que es posible
que algunas tarjetas "sin nombre" tengan alguno de ellos.
Adem&aacute;s el chip MAD16 es usado en algunas tarjetas fabricadas por
fabricantes como Turtle Beach (Tropez), Reveal (algunos modelos)
y Diamond (modelos m&aacute;s recientes).</P>

<DT><B>Support for Crystal CS4232 based (PnP) cards Y/n/?</B><DD><P>Conteste "y" (s&iacute;) si su tarjeta est&aacute; basada en el juego de chips
Crystal CS4232.</P>

<DT><B>Support for Turtle Beach Wave Front (Maui, Tropez) synthesizers</B><DD><P>Conteste "y" (s&iacute;) si tiene algunas de estas tarjetas.</P>

<DT><B>SoundBlaster Pro support Y/n/?</B><DD><P>Active esta opci&oacute;n si su tarjeta es una SoundBlaster Pro o
SoundBlaster 16. Activela tambi&eacute;n con cualquier cl&oacute;nico de la
SoundBaster Pro. Contestar "n" (no) ahorra algo de memoria pero
contestar "y" (s&iacute;) es la mejor opci&oacute;n.</P>

<DT><B>SoundBlaster 16 support Y/n/?</B><DD><P>Act&iacute;vela si tiene una SoundBlaster 16 (inclu&iacute;da la AWE32 o AWE64).</P>

<DT><B>Audio Excel DSP 16 initialization support Y/n/?</B><DD><P>Active esta opci&oacute;n si tiene una tarjeta Audio Excel DSP 16.
Mire el fichero <CODE>readme.aedsp16</CODE> para m&aacute;s informaci&oacute;n.</P>

</DL>
</P>
<P>Despu&eacute;s el programa de configuraci&oacute;n hace algunas preguntas de servicios de
alto nivel. La contestaci&oacute;n recomendada es "y" (s&iacute;) para cada una de las
preguntas. Conteste "n" (no) solamente si sabe que no va a utilizar esa
opci&oacute;n. </P>
<P>
<DL>

<DT><B>/dev/dsp and /dev/audio support (usually required) Y/n/?</B><DD><P>Conteste "y" (s&iacute;). Si contesta "n" (no) desactivar&aacute; los
dispositivos de los conversores A/D y D/A: /dev/dsp y /dev/audio.</P>

<DT><B>MIDI interface support Y/n/?</B><DD><P>Si contesta "n" (no) desactivar&aacute; los dispositivos <CODE>/dev/midixx</CODE>
y el acceso a cualquier puerto MIDI usando <CODE>/dev/sequencer</CODE> y
<CODE>/dev/music</CODE>. 
Esta opci&oacute;n tambi&eacute;n afecta a los dispositivos compatibles con el MPU401 y/o General MIDI.</P>

<DT><B>FM synthesizer (YM3812/OPL-3) support Y/n/?</B><DD><P>Conteste "y" (s&iacute;) aqu&iacute;.</P>

<DT><B>/dev/sequencer support Y/n/?</B><DD><P>Contestar "n" (no) desactivar&aacute; <CODE>/dev/sequencer</CODE> y <CODE>/dev/music</CODE>.</P>

<DT><B>Do you want support for the mixer of SG NX Pro ?</B><DD><P>Conteste "y" (s&iacute;) si tiene una tarjeta Sound Galaxy NX Pro y
quieres soporte para sus funciones extra del mezclador.</P>

<DT><B>Do you want support for the MV Jazz16 (ProSonic etc.) ?</B><DD><P>Conteste "y" (s&iacute;) si tiene una tarjeta MV Jazz16.</P>

<DT><B>Do you have a Logitech SoundMan Games Y/n/?</B><DD><P>Conteste "y" (s&iacute;) si tiene una tarjeta Logitech SoundMan Games.</P>

</DL>
</P>
<P>Despu&eacute;s de las preguntas anteriores, el programa de configuraci&oacute;n pregunta
por la informaci&oacute;n espec&iacute;fica de la tarjeta. Generalmente es indicar la
direcci&oacute;n I/O, IRQ y el DMA. Con algunas tarjetas el programa pregunta por los
ficheros que van a ser usados durante la inicializaci&oacute;n de la tarjeta. Son
las tarjetas que tienen un chip o un microprocesador DSP el cual debe ser
inicializado bajando un programa (microc&oacute;digo) a la tarjeta. En algunos casos
este fichero es escrito a un fichero de cabecera .h por el programa de
configuraci&oacute;n y ya es incluido en el controlador durante la compilaci&oacute;n. Lea de nuevo
la informaci&oacute;n concerniente a su tarjeta en el fichero <CODE>Readme.cards</CODE>.</P>
<P>Por &uacute;ltimo se le preguntar&aacute;:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
     The sound driver is now configured.
     Save copy of this configuration to /etc/soundconf [Y/n/?]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Normalmente debe contestar "y" (s&iacute;) de manera que si m&aacute;s tarde necesita recompilar
el n&uacute;cleo tendr&aacute; la opci&oacute;n de usar la misma configuraci&oacute;n del controlador de sonido.</P>
<P>Si est&aacute;s actualizando un controlador anterior de sonido, aseg&uacute;rese de que los
ficheros <CODE>/usr/include/sys/soundcard.h</CODE> y <CODE>/usr/include/sys/ultrasound.h</CODE> son
enlaces simb&oacute;licos a los ficheros correspondientes en <CODE>/usr/include/linux</CODE> o
que simplemente contienen las l&iacute;neas <CODE>#include &lt;linux/soundcard.h&gt;</CODE> y <CODE>#include
&lt;linux/ultrasound.h&gt;</CODE>, respectivamente.</P>
<P>Ahora est&aacute; preparado para compilar e instalar el nuevo n&uacute;cleo.</P>

<H2><A NAME="ss4.3">4.3</A> <A HREF="Sonido-COMO.html#toc4.3">Creando los ficheros de dispositivo.</A>
</H2>


<P>Para operar correctamente, deben crearse los ficheros de dispositivos de sonido. 
Normalmente, estos se crean durante la instalaci&oacute;n de su sistema Linux. Puede efectuarse
un chequeo r&aacute;pido utilizando el comando listado m&aacute;s abajo. Si el comando responde
de la manera mostrada (la fecha puede variar), entonces los ficheros de dispositivo
son, casi seguro, correctos.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% ls -l /dev/sdnstat
crw-rw-rw-   1 root     root      14,   6 Apr 25  1995 /dev/sndstat
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>D&eacute;se cuenta de que tener los ficheros de dispositivo correctos no garantiza nada
de por s&iacute;. El controlador del n&uacute;cleo debe tambi&eacute;n estar cargado y compilado antes
de que los dispositivos funcionen (se hablar&aacute; m&aacute;s de ello m&aacute;s tarde).</P>
<P>En algunos casos, si usted cree que los ficheros de dispositivo son err&oacute;neos, puede
crearlos de nuevo utilizando el script que viene al final del fichero <CODE>Readme.linux</CODE> en el
directorio <CODE>/usr/src/linux/drivers/sound</CODE>, ejecut&aacute;ndolo como root. De manera
alternativa, la mayor parte de las distribuciones Linux tienen el script /dev/MAKEDEV
el cual puede ser utilizado para este prop&oacute;sito.</P>
<P>Si est&aacute; utilizando el controlador del altavoz del PC, lea la documentaci&oacute;n que
adjunta al paquete para determinar qu&eacute; ficheros de dispositivo necesita crear.</P>

<H2><A NAME="ss4.4">4.4</A> <A HREF="Sonido-COMO.html#toc4.4">Inicializando Linux y comprobando la instalaci&oacute;n.</A>
</H2>

<P>Ahora debe estar preparado para inicializar el n&uacute;cleo y comprobar los controladores
de sonido. Siga el procedimiento habitual para instalar y reinicializar el
nuevo n&uacute;cleo (por supuesto tenga a mano el anterior n&uacute;cleo por si hay problemas)</P>
<P>Durante la inicializaci&oacute;n, compruebe si se da un mensaje como el siguiente durante
el arranque (si las l&iacute;neas aparecen muy r&aacute;pido y no las puede leer,
utilice el comando <CODE>dmesg</CODE>):</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Sound initialization started
&lt;Sound Blaster 16 (4.13)> at 0x220 irq 5 dma 1,5
&lt;Sound Blaster 16> at 0x330 irq 5 dma 0
&lt;Yamaha OPL3 FM> at 0x388
Sound initialization complete
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>&Eacute;ste debe coincidir con el tipo de tu tarjeta de sonido y con los par&aacute;metros
determinados por los jumpers que tenga (si es que tiene alguno).</P>
<P>Tenga en cuenta que los mensajes de m&aacute;s arriba no se muestran cuando se usa
el m&oacute;dulo cargable del controlador del sonido (a menos que lo habilite, 
utilizando "insmod sound trace_init=1).</P>
<P>Cuando el controlador de sonido est&aacute; compilado dentro del n&uacute;cleo, deber&iacute;an
mostrarse los mensajes "Sound initialization started" y "Sound initialization complete".
Si no se muestran, es que no hay controlador de sonido presente en el n&uacute;cleo. En ese
caso, deber&iacute;a comprobar que usted instal&oacute; realmente el n&uacute;cleo que compil&oacute; tras 
habilitar el soporte de sonido.</P>
<P>Si no se muestra nada entre las l&iacute;neas de "Sound initialization started" y 
"Sound initialization complete", quiere decir que no se detectaron dispositivos
de sonido. Lo m&aacute;s probable es que usted no tenga habilitado el controlador correcto,
que la tarjeta no est&eacute; soportada, que el puerto E/S no es el correcto, o que tiene una
tarjeta PnP que no ha sido configurada.</P>
<P>El controlador tambi&eacute;n puede mostrar mensajes de error y advertencias durante
el inicio. Est&eacute; atento para localizar alguno cuando inicie por primera vez
despu&eacute;s de haber configurado el controlador de sonido.</P>
<P>Lo siguiente que debe comprobar es el fichero de dispositivo <CODE>/dev/sndstat</CODE>.
Leer el fichero de dispositivo del estado del controlador de sonido deber&iacute;a proporcionar
informaci&oacute;n adicional acerca de si se inicializ&oacute; correctamente el controlador de la tarjeta.
Un ejemplo de esta informaci&oacute;n ser&iacute;a el siguiente:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% cat /dev/sndstat
Sound Driver:3.5.4-960630 (Sat Jan 4 23:56:57 EST 1997 root,
Linux fizzbin 2.0.27 #48 Thu Dec 5 18:24:45 EST 1996 i586)
Kernel: Linux fizzbin 2.0.27 #48 Thu Dec 5 18:24:45 EST 1996 i586
Config options: 0

Installed drivers: 
Type 1: OPL-2/OPL-3 FM
Type 2: Sound Blaster
Type 7: SB MPU-401

Card config: 
Sound Blaster at 0x220 irq 5 drq 1,5
SB MPU-401 at 0x330 irq 5 drq 0
OPL-2/OPL-3 FM at 0x388 drq 0

Audio devices:
0: Sound Blaster 16 (4.13)

Synth devices:
0: Yamaha OPL-3

Midi devices:
0: Sound Blaster 16

Timers:
0: System clock

Mixers:
0: Sound Blaster
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>El comando de m&aacute;s arriba puede devolver algunos mensajes de error. "No such file or
directory" indica que necesita crear los ficheros de dispositivo (vea secci&oacute;n 4.3).
"No such device" indica que el controlador de sonido no est&aacute; cargado o enlazado con
el n&uacute;cleo. Vuelva a la secci&oacute;n 4.2 para corregir esto.</P>
<P>Si las l&iacute;neas dentro de la secci&oacute;n "Card config:" de /dev/sndstat est&aacute;n listadas
entre par&eacute;ntesis (tal como (SoundBlaster at 0x220 irq 5 drq 1,5)"), significa que
el dispositivo fue configurado pero no detectado.</P>
<P>Ahora debe estar preparado para reproducir un fichero de sonido. Consiga un
fichero de ejemplo y env&iacute;elo al dispositivo de sonido para comprobar la
salida de sonido. Por ejemplo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% cat endoftheworld >/dev/dsp
% cat crash.au >/dev/audio
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>(Aseg&uacute;rese de que no omitir el "&gt;" en estos comandos)</P>
<P>F&iacute;jese de que, en general, usar <CODE>cat</CODE> no es la manera correcta de reproducir archivos de sonido,
esto es s&oacute;lo una prueba r&aacute;pida. Desear&aacute; conseguir un reproductor de sonido en regla (descrito m&aacute;s
tarde) que har&aacute; un mejor trabajo.</P>
<P>Este comando s&oacute;lo funcionar&aacute; si existe, al menos, un dispositivo listado en
la secci&oacute;n "audio devices" de /dev/sndstat. Si esa secci&oacute;n est&aacute; vac&iacute;a deber&iacute;a
comprobar por qu&eacute; no fue detectado el dispositivo.</P>
<P>Si los comandos de arriba devuelven "I/O error", deber&iacute;a mirar al final de
los mensajes del n&uacute;cleo listados utilizando dmesg. Lo mas probable es que all&iacute;
se muestre un mensaje de error. Muy a menudo el mensaje es: "Sound: DMA (output) timed out - IRQ/DRQ config error?".
Este mensaje siginifica que el controlador no pudo conectar con la tarjeta de sonido en la IRQ esperada.
En la mayor parte de los casos esto quiere decir que el IRQ o el canal DMA configurados en el controlador
no funcionan. La manera m&aacute;s sencilla de conseguir que funcione es intentar con todas las posibles 
DMAs e IRQs soportados por el dispositivo.</P>
<P>Otra posible raz&oacute;n es que el dispositivo no sea compatible con el dispositivo hacia el cual
est&aacute; configurado el controlador. Esto es casi cierto en el caso de una supuesta "SoundBlaster (Pro/16) compatible"
que no funciona con el controlador SoundBlaste. En ese caso deber&iacute;a intentar averiguar el dispositivo
con el que su tarjeta es compatible (enviando un mensaje al foro de noticias comp.os.linux.hardware, por ejemplo).</P>
<P>Algunos ficheros de sonido de ejemplo se pueden obtener de:
<A HREF="ftp://tsx-11.mit.edu/pub/linux/packages/sound/snd-data-0.1.tar.Z">ftp://tsx-11.mit.edu</A></P>
<P>Ahora puede comprobar la grabaci&oacute;n de sonido. Si tiene una tarjeta de sonido con capacidad de entrada, puede realizar
una prueba r&aacute;pida con utilizando los siguientes comandos.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
# graba 4 segundos de audio desde el micr&oacute;fono
EDT% dd bs=8k count=4 &lt; /dev/audio > sample.au
4+0 records in
4+0 records out
# play back sound
% cat sample.au > /dev/audio
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Obviamente para que esto funcione necesita tener un micr&oacute;fono conectado a la tarjeta
de sonido. Tambi&eacute;n necesita un programa mezclador (mixer) para seleccionar al
micr&oacute;fono como dispositivo de entrada y ajustar el nivel de grabaci&oacute;n.</P>
<P>Si supera estas pruebas, puede confiar razonablemente en que el hardware y el
software D/A y A/D funciona. Si tiene problema, mire la siguiente secci&oacute;n
de este documento.</P>

<H2><A NAME="ss4.5">4.5</A> <A HREF="Sonido-COMO.html#toc4.5">Resoluci&oacute;n de problemas.</A>
</H2>

<P>Si despu&eacute;s de seguir las instrucciones de este documento todav&iacute;a tiene problemas, 
aqu&iacute; hay algunas cosas que debe comprobar. Las comprobaciones est&aacute;n
listadas en orden ascendente de complejidad. Si una comprobaci&oacute;n falla,
resuelve el problema antes de pasar al siguiente punto.</P>

<H3>Punto 1: Aseg&uacute;rese de que realmente est&aacute; ejecutando el n&uacute;cleo compilado consoporte para sonido.</H3>


<P>Puede comprobar la fecha del kernel para ver si est&aacute; ejecutando el que
compil&oacute; con soporte para sonido. Para comprobarlo, utilice el comando <CODE>uname</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% uname -a
Linux fizzbin 2.0.0 #1 Tue Jun 4 16:57:55 EDT 1996 i386
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>o imprimiendo por pantalla el archivo <CODE>/proc/version</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% cat /proc/version
Linux version 2.0.0 (root@fizzbin) (gcc version 2.7.0) #1 Tue Jun 4 16:57:55 EDT 1996
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si la fecha no se corresponde con la que era cuando compil&oacute; el n&uacute;cleo por &uacute;ltima vez,
entonces usted est&aacute; ejecutando un n&uacute;cleo anterior. ¿Reinicializ&oacute; Linux? Si usa 
LILO, ¿lo reinstal&oacute; (ejecutando, normalmente, <CODE>/etc/lilo/install</CODE>)?. Si arranca desde
disquete, ¿cre&oacute; un nuevo disco de inicio y lo us&oacute; al arrancar?.</P>

<H3>Punto 2: Aseg&uacute;rese de que los controladores de sonido del n&uacute;cleo est&aacute;n compilados en &eacute;l.</H3>


<P>La manera m&aacute;s facil de hacer esto es comprobar la salida de "dev/sndstat" tal
y como se describi&oacute; m&aacute;s arriba. Si la salida no es como se esperaba, entonces ocurri&oacute;
algo con la configuraci&oacute;n o construcci&oacute;n del n&uacute;cleo. Comience de nuevo el proceso de
instalaci&oacute;n, comenzando con la instalaci&oacute;n y construyendo el n&uacute;cleo.</P>

<H3>Punto 3: ¿Detect&oacute; el n&uacute;cleo su tarjeta de sonido durante la inicializaci&oacute;n?</H3>


<P>Aseg&uacute;rese de que la tarjeta de sonido fue detectada cuando rearranc&oacute; el n&uacute;cleo.
Deber&iacute;a haber visto un mensaje durante la inicializaci&oacute;n del n&uacute;cleo. 
Si el mensaje desapareci&oacute; de la pantalla muy pronto,
puede revisarlo usando el comando <CODE>dmesg</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% dmesg
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>o</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
% tail /var/adm/messages
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Si su tarjeta de sonido no fue encontrada entonces algo no funcion&oacute;. Aseg&uacute;rese
de que est&aacute; bien instalada. Si la tarjeta de sonido funciona bajo DOS
entonces se puede asegurar que no es debido al hardware por lo que 
seguramente el problema est&eacute; en la configuraci&oacute;n del n&uacute;cleo. Quiz&aacute; configur&oacute; su tarjeta como
otra de otro tipo o con par&aacute;metros equivocados, o quiz&aacute;s su tarjeta no es
compatible con los controladores de tarjeta de sonido del n&uacute;cleo de Linux.</P>
<P>Una posibilidad es que su tarjeta sea una del tipo "compatible" que requiere
inicializaci&oacute;n por el controlador del DOS. Intente arrancar DOS
y cargar el controlador suministrado por el vendedor de la tarjeta de sonido.
Despu&eacute;s reinicie Linux "en caliente" pulsando Control-Alt-Supr. Aseg&uacute;rese
de que la direcci&oacute;n E/S, el DMA y el IRQ para Linux son los mismos que los
usados bajo DOS. Lea el fichero <CODE>Readme.cards</CODE> para configurar su tipo de
tarjeta.</P>
<P>Si su tarjeta de sonido no est&aacute; listada en este documento, es posible que
los controladores de Linux no la soporten. Compruebe las referencias
listadas al final de este documento.</P>

<H3>Punto 4: ¿Puede leer datos desde el dispositivo dsp?</H3>

<P>Intente leer desde el dispositivo <CODE>/dev/audio</CODE> usando el comando <CODE>dd</CODE>
listado anteriormente en este documento. El comando se debe ejecutar sin errores.</P>
<P>Si esto no va bien, entonces es posible que el problema sea un conflicto IRQ o DMA
o algun tipo de incompatibilidad hardware (el dispositivo no est&aacute; soportado por
Linux o el controlador est&aacute; configurado para un dispositivo incorrecto).</P>
<P>Una posibilidad remota es que sea problema del hardware. Intente comprobar
el controlador bajo DOS, si es posible, para eliminar esta posibilidad.</P>

<H3>Punto 5: Cuando todo falla</H3>

<P>Si todav&iacute;a tiene problemas, aqu&iacute; van unas sugerencias finales:</P>
<P>
<UL>
<LI>Relea este documento cuidadosamente.</LI>
<LI>Lea las referencias listadas al final de este documento, especialmente
las p&aacute;ginas Web de Hannu Savolainen y las concernientes a los ficheros Readme
del c&oacute;digo fuente del n&uacute;cleo.</LI>
<LI>Env&iacute;e su pregunta al foro de noticias comp.os.linux o a cualquier otro foro
de Usenet (comp.os.linux.hardware es una buena elecci&oacute;n; debido a la gran cantidad
de tr&aacute;fico en esos grupos ayudar&aacute; que ponga la palabra "sound" en la cabecera Asunto
del art&iacute;culo para que los expertos adecuados puedan leerla).</LI>
<LI>Usar un motor de b&uacute;squeda Web/Usenet con un criterio de selecci&oacute;n "inteligente"
puede dar buenos resultados de manera r&aacute;pida. Uno de estos motores es 
<A HREF="http://www.altavista.digital.com">http://www.altavista.digital.com</A></LI>
<LI>Intente usar el &uacute;ltimo n&uacute;cleo Linux (pero s&oacute;lo como &uacute;ltimo recurso: los &uacute;ltimos
n&uacute;cleos de desarrollo pueden ser inestables).</LI>
<LI>Env&iacute;e un mensaje al autor del controlador de sonido.</LI>
<LI>Env&iacute;e un mensaje al autor de este documento.</LI>
<LI>Ejecute <CODE>emacs</CODE> y teclee <CODE>Esc-x doctor</CODE>   :-)</LI>
</UL>
</P>

<HR>
<A HREF="Sonido-COMO-5.html">Página siguiente</A>
<A HREF="Sonido-COMO-3.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc4">Índice general</A>
</BODY>
</HTML>
