<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.15">
 <TITLE>El C&oacute;mo del sonido en Linux: 6. Respuestas a Preguntas Usualmente Formuladas (PUF).</TITLE>
 <LINK HREF="Sonido-COMO-7.html" REL=next>
 <LINK HREF="Sonido-COMO-5.html" REL=previous>
 <LINK HREF="Sonido-COMO.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="Sonido-COMO-7.html">Página siguiente</A>
<A HREF="Sonido-COMO-5.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc6">Índice general</A>
<HR>
<H2><A NAME="s6">6.</A> <A HREF="Sonido-COMO.html#toc6">6. Respuestas a Preguntas Usualmente Formuladas (PUF).</A></H2>

<P>Esta secci&oacute;n contesta algunas de las preguntas que mas com&uacute;nmente han
aparecido en los grupos de noticias Usenet y en las listas de correo.</P>

<H2><A NAME="ss6.1">6.1</A> <A HREF="Sonido-COMO.html#toc6.1">¿Cu&aacute;les son los ficheros de dispositivo de sonido?</A>
</H2>

<P>&Eacute;stos son los nombres de ficheros de dispositivo "est&aacute;ndar", aunque algunas
distribuciones de Linux utilizan nombres ligeramente diferentes.</P>
<P>
<DL>
<DT><B>/dev/audio</B><DD><P>normalmente un enlace a <CODE>/dev/audio0</CODE></P>
<DT><B>/dev/audio0</B><DD><P>Dispositivo de audio compatible con las estaciones de trabajo Sun
(solamente una implementaci&oacute;n parcial, ya que no soporta el interfaz ioctl y s&oacute;lo permite
formato u-law)</P>
<DT><B>/dev/audio1</B><DD><P>Segundo dispositivo de audio (si es soportado por la tarjeta o si
hay m&aacute;s de una tarjeta instalada)</P>
<DT><B>/dev/dsp</B><DD><P>Normalmente un enlace a <CODE>/dev/dsp0</CODE></P>
<DT><B>/dev/dsp0</B><DD><P>Primer dispositivo de muestreo digital</P>
<DT><B>/dev/dsp1</B><DD><P>Segundo dispositivo de muestreo digital</P>
<DT><B>/dev/mixer</B><DD><P>Normalmente un enlace a <CODE>/dev/mixer0</CODE></P>
<DT><B>/dev/mixer0</B><DD><P>Primer mezclador de sonido</P>
<DT><B>/dev/mixer1</B><DD><P>Segundo mezclador de sonido</P>
<DT><B>/dev/music</B><DD><P>Interfaz del secuenciador de alto nivel</P>
<DT><B>/dev/sequencer</B><DD><P>Acceso a bajo nivel MIDI, FM, y GUS </P>
<DT><B>/dev/sequencer2</B><DD><P>Normalmente un enlace a <CODE>/dev/music</CODE></P>
<DT><B>/dev/midi00</B><DD><P>Primer puerto MIDI directo</P>
<DT><B>/dev/midi01</B><DD><P>Segundo puerto MIDI directo</P>
<DT><B>/dev/midi02</B><DD><P>Tercer puerto MIDI directo</P>
<DT><B>/dev/midi03</B><DD><P>Cuarto puerto MIDI directo</P>
<DT><B>/dev/sndstat</B><DD><P>Visualiza el estado del controlador de sonido cuando es le&iacute;do</P>
</DL>
</P>
<P>El controlador del altavoz del PC incorpora los siguientes dispositivos:</P>
<P>
<DL>
<DT><B>/dev/pcaudio</B><DD><P>equivalente a /dev/audio</P>
<DT><B>/dev/pcsp</B><DD><P>equivalente a /dev/dsp</P>
<DT><B>/dev/pcmixer</B><DD><P>equivalente a /dev/mixer</P>
</DL>
</P>

<H2><A NAME="ss6.2">6.2</A> <A HREF="Sonido-COMO.html#toc6.2">¿C&oacute;mo puedo reproducir una muestra de sonido?</A>
</H2>


<P>Los ficheros de sonido de las estaciones de trabajo Sun (.au) pueden ser
reproducidos envi&aacute;ndolos al dispositivo <CODE>/dev/audio</CODE>. Las muestras pueden
ser enviadas al <CODE>/dev/dsp</CODE>. Es preferible usar un programa como por ejemplo
<CODE>play</CODE>, el cual reconocer&aacute; la mayor&iacute;a de los tipos de ficheros y pasar&aacute;
a la tarjeta de sonido la correcta frecuencia de muestreo, etc.</P>
<P>Programas como wavplay o vplay (en el paquete snd-util) dar&aacute;n los mejores
resultados con archivos WAV. Sin embargo, no reconocen el los archivos WAV con
formato de compresi&oacute;n Microsoft ADPCM. Versiones antiguas de play (del paquete
Lsox) tampoco funcionar&aacute;n bien con los archivos WAV de 16 bit.</P>
<P>El comando splay incluido en el paquete snd-util puede utilizarse para reproducir
la mayor parte de los archivos de sonido si se introducen manualmente los par&aacute;metros
adecuados en la l&iacute;nea de comandos.</P>

<H2><A NAME="ss6.3">6.3</A> <A HREF="Sonido-COMO.html#toc6.3">¿C&oacute;mo puedo grabar una muestra?</A>
</H2>

<P>Leer de <CODE>/dev/audio</CODE> o <CODE>/dev/dsp</CODE> devolver&aacute; un muestreo de datos que puede ser
redireccionado a un fichero. Un programa como el <CODE>vrec</CODE> har&aacute; m&aacute;s f&aacute;cil el controlar
la frecuencia de muestreo, la duraci&oacute;n, etc. Tambi&eacute;n se necesita un programa
muestreador para seleccionar el dispositivo de entrada adecuado.</P>

<H2><A NAME="ss6.4">6.4</A> <A HREF="Sonido-COMO.html#toc6.4">¿Puedo tener m&aacute;s de una tarjeta de sonido?</A>
</H2>

<P>Con el controlador actual de sonido es posible tener varias tarjetas SoundBlaster, SoundBlaster Pro,
SoundBlaster 16, MPU-401 o MSS en el sistema. Instalar dos SoundBlasters es posible pero
requiere definir las macros SB2_BASE, SB2_IRQ, SB2_DMA y (en algunos casos) SB2_DMA2 editando
local.h manualmente. Tambi&eacute;n es posible tener una SoundBlaster a la vez que una PAS16.</P>
<P>Con los nuevos n&uacute;cleos 2.0.x que configure utilizando make config, en lugar del fichero <CODE>local.h</CODE>,
ser&aacute; necesario editar el fichero <CODE>/usr/incluide/linux/autoconf.h</CODE>. Tras la secci&oacute;n que contiene
las l&iacute;neas:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#define SBC_BASE 0x220
#define SBC_IRQ (5)
#define SBC_DMA (1)
#define SB_DMA2 (5)
#define SB_MPU_BASE 0x0
#define SB_MPU_IRQ (-1)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>a&ntilde;ada estas otras (con los valores adecuados a su sistema):</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#define SB2_BASE 0x330
#define SB2_IRQ (7)
#define SB2_DMA (2)
#define SB2_DMA2 (2)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Los siguientes controladores no permiten instancias m&uacute;ltiples</P>
<P>
<UL>
<LI>GUS (limitaci&oacute;n de controlador)</LI>
<LI>MAD16 (limitaci&oacute;n hardware)</LI>
<LI>AudioTrix Pro (limitaci&oacute;n hardware)</LI>
<LI>CS432 (limitaci&oacute;n hardware)</LI>
</UL>
</P>

<H2><A NAME="ss6.5">6.5</A> <A HREF="Sonido-COMO.html#toc6.5">Error: No such file or directory for sound devices</A>
</H2>

<P>Necesita crear los ficheros de dispositivo del controlador de sonido. Vea la
secci&oacute;n sobre creaci&oacute;n de ficheros de dispositivo. Si tiene que crear los
ficheros de dispositivo, aseg&uacute;rase de que tienen los n&uacute;meros de dispositivo
mayor y menor correcto (algunas distribuciones antiguas en CD-ROM de Linux
no crean los ficheros de dispositivo correctos durante la instalaci&oacute;n).</P>

<H2><A NAME="ss6.6">6.6</A> <A HREF="Sonido-COMO.html#toc6.6">Error: No such device for sound devices</A>
</H2>

<P>No ha arrancado con un n&uacute;cleo que contenga el controlador de sonido o la
direcci&oacute;n de E/S de la configuraci&oacute;n no corresponde con su hardware. Compruebe
que est&aacute; ejecutando el n&uacute;cleo reci&eacute;n compilado y verifique que las opciones
introducidas en la configuraci&oacute;n del controlador de sonido corresponden con
las opciones del hardware.</P>

<H2><A NAME="ss6.7">6.7</A> <A HREF="Sonido-COMO.html#toc6.7">Error: No space left on device for sound devices</A>
</H2>

<P>Esto puede ocurrir si intenta grabar datos a <CODE>/dev/audio</CODE> o <CODE>/dev/dsp</CODE> sin
haber creado los ficheros de dispositivo necesarios. El dispositivo de sonido
ahora es un fichero normal y ocupa espacio en su partici&oacute;n de disco. Necesita ejecutar
el script descrito en la secci&oacute;n sobre creaci&oacute;n de ficheros de dispositivo
de este documento.</P>
<P>Esto tambi&eacute;n puede suceder con Linux 2.0 y posteriores si no hay suficiente memoria RAM libre
en el sistema cuando se abre el dispositivo. El controlador de sonido requiere, al menos, dos
p&aacute;ginas (8k) de memoria f&iacute;sica RAM contiguas para cada canal DMA. Esto sucede, a veces, en 
m&aacute;quinas con menos de 16M de RAM o que llevan encendidas durante mucho tiempo. Es posible
liberar algo de RAM compilando y ejecutando el siguiente programa en C antes de intentar
abrir de nuevo el dispositivo:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
main() {
  int i;
  char mem[500000];
  for (i = 0; i &lt; 500000; i++)
    mem[i] = 0;
  exit(0);
}
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H2><A NAME="ss6.8">6.8</A> <A HREF="Sonido-COMO.html#toc6.8">Error: Device busy for sound devices</A>
</H2>

<P>Solamente puede abrirse un proceso a la vez en un dispositivo de sonido. 
A la mayor&iacute;a nos gustar&iacute;a saber si otro proceso est&aacute; usando el dispositivo
en cuesti&oacute;n. Una forma de averiguar &eacute;sto es usar el comando <CODE>fuser</CODE>:</P>
<P><CODE>% fuser -v /dev/dsp
/dev/dsp:             USER       PID ACCESS COMMAND
tranter    265 f....  tracker</CODE></P>
<P>En el ejemplo de arriba, el comando <CODE>fuser</CODE> muestra que el proceso 265
tiene el dispositivo abierto. Esperar a que el proceso se complete o matarlo
permitir&aacute; que el dispositivo de sonido pueda ser accedido una vez m&aacute;s. Usted
debe ejecutar el comando <CODE>fuser</CODE> como root para recibir un informe de
lo que est&aacute;n utilizando otros usuarios aparte de usted mismo.</P>

<H2><A NAME="ss6.9">6.9</A> <A HREF="Sonido-COMO.html#toc6.9">¡Todav&iacute;a tengo errores de dispositivo ocupado (device busy)!</A>
</H2>

<P>De acuerdo con Brian Gough, para las tarjetas SoundBlaster que usan el
canal DMA 1 hay un conflicto en potencia con el controlador de la cinta QIC-02,
la cual tambi&eacute;n usa el DMA 1, causando los errores "device busy". Si est&aacute;
usando FTAPE, debe tener este controlador activado. De acuerdo con el
FTAPE-HOWTO el controlador QIC-02 no es esencial para el uso de FTAPE; solamente
el controlador QIC-117 es necesario. Reconfigurar el n&uacute;cleo para usar el QIC-117
en vez del QIC-02 permite coexistir a FTAPE y al controlador de sonido.</P>

<H2><A NAME="ss6.10">6.10</A> <A HREF="Sonido-COMO.html#toc6.10">Reproducci&oacute;n parcial de un fichero de sonido digitalizado.</A>
</H2>


<P>Generalmente, el s&iacute;ntoma es que una muestra de sonido se reproduce
durante un segundo y despu&eacute;s se para completamente o devuelve un mensaje
de error como "missing IRQ" o "DMA timeout". La mayor&iacute;a de las veces
significa que los par&aacute;metros del IRQ o del canal DMA son incorrectos.
Verifique que la configuraci&oacute;n del n&uacute;cleo corresponde con los jumpers de
la tarjeta de sonido y que no entran en conflicto con otro dispositivo.</P>
<P>Otro s&iacute;ntoma es que la muestra de sonido se "repite". Esto es generalmente
causado por un conflicto IRQ.</P>

<H2><A NAME="ss6.11">6.11</A> <A HREF="Sonido-COMO.html#toc6.11">Hay pausas cuando reproduzco ficheros MOD.</A>
</H2>

<P>Reproducir ficheros MOD absorbe gran capacidad de la CPU. Si tiene
demasiados procesos ejecut&aacute;ndose en su ordenador, no se podr&aacute; reproducir en tiempo
real. Las posibles opciones son:</P>
<P>
<UL>
<LI>Intente reproducir con una menor frecuencia de muestreo o en modo mono.</LI>
<LI>Elimine otros procesos.</LI>
<LI>Compre un ordenador m&aacute;s r&aacute;pido.</LI>
<LI>Compre una tarjeta de sonido m&aacute;s potente (por ejemplo, Gravis Ultrasound).</LI>
</UL>
</P>
<P>Si tiene una tarjeta Gravis Ultrasound, debe usar uno de los reproductores
de ficheros MOD escritos espec&iacute;ficamente para la GUS (por ejemplo <CODE>gmod</CODE>).</P>

<H2><A NAME="ss6.12">6.12</A> <A HREF="Sonido-COMO.html#toc6.12">Errores de compilaci&oacute;n al compilar aplicaciones de sonido.</A>
</H2>

<P>El controlador de sonido versi&oacute;n 1.0c y anteriores usaban un esquema <CODE>ioctl()</CODE>
diferente e incompatible. Obtenga un c&oacute;digo fuente m&aacute;s moderno o haga los
cambios necesarios para adaptarlo al nuevo controlador de sonido. Lea el
fichero del controlador de sonido <CODE>Readme</CODE> para m&aacute;s detalles.</P>
<P>Aseg&uacute;rese tambi&eacute;n de que ha usado la &uacute;ltima versi&oacute;n del <CODE>soundcard.h</CODE> y
<CODE>ultrasound.h</CODE> cuando compile la aplicaci&oacute;n. Lea las instrucciones de
instalaci&oacute;n al comienzo de este texto.</P>

<H2><A NAME="ss6.13">6.13</A> <A HREF="Sonido-COMO.html#toc6.13">Obtengo SEGV al ejecutar programas de sonido que antes funcionaban.</A>
</H2>

<P>Este es probablemente el mismo problema que el descrito en la anterior cuesti&oacute;n.</P>

<A HREF="ftp://nic.funet.fi/pub/Linux/ALPHA/sound/">ftp://nic.funet.fi/pub/Linux/ALPHA/sound/</A>. Hay
que se&ntilde;alar que este directorio est&aacute; "escondido" y no aparece en los listados de
directorios. Si usted hace un "cd" al directorio y usa el comando FTP "dir", los
ficheros est&aacute;n ah&iacute;.
En el momento de escribir estas l&iacute;neas, se puso disponible nueva documentaci&oacute;n en la
P&aacute;gina Web de 4Front Technologies.
Otra fuente de informaci&oacute;n es la Gu&iacute;a Linux Multimedia, descrita en la secci&oacute;n Referencias.
<H2></H2>

<H2><A NAME="ss6.15">6.15</A> <A HREF="Sonido-COMO.html#toc6.15">¿C&uacute;ales son los recursos de la CPU necesarios para reproducir o grabar sin pausas?</A>
</H2>


<P>No hay una respuesta f&aacute;cil para esta pregunta, ya que depende de:</P>
<P>
<UL>
<LI> Si se utiliza muestreo PCM o s&iacute;ntesis FM.</LI>
<LI> Frecuencia de muestreo y tama&ntilde;o de muestreo.</LI>
<LI> Qu&eacute; aplicaci&oacute;n est&aacute; utilizando para reproducir o grabar.</LI>
<LI> Hardware de la tarjeta de sonido.</LI>
<LI> Frecuencia de I/O del disco, velocidad del reloj de la CPU, tama&ntilde;o
del cach&eacute;, etc.</LI>
</UL>
</P>
<P>En general, las m&aacute;quinas 386 deber&iacute;an ser capaces de reproducir muestras o m&uacute;sica sintetizada
FM en una tarjeta de sonido de 8 bits sin problemas.</P>
<P>Reproducir ficheros MOD, necesita muchos recursos de la CPU. Algunas medidas
experimentales han mostrado que reproducir a 44kHz necesita m&aacute;s del 40% de la
velocidad de un 486/50 y un 386/25 ha penas puede reproducir r&aacute;pidamente m&aacute;s
de 22kHz (con una tarjeta de 8 bits como la SoundBlaster). Una tarjeta como
la Gravis UltraSound ejecuta m&aacute;s funciones en el hardware y requerir&aacute; menos
recursos de la CPU.</P>
<P>Todo esto supone que el ordenador no est&aacute; ejecutando otras tareas intensivas
en la CPU.</P>
<P>Convertir ficheros de sonido y a&ntilde;adir efectos usando una utilidad como <CODE>Sox</CODE>
es mucho m&aacute;s r&aacute;pido si tienes un coprocesador matem&aacute;tico (o un procesador
con coprocesador integrado). El controlador del n&uacute;cleo
por si mismo no hace c&aacute;lculos de coma flotante.</P>

<H2><A NAME="ss6.16">6.16</A> <A HREF="Sonido-COMO.html#toc6.16">Problemas con una PAS16 y una controladora SCSI Adaptec 1542.</A>
</H2>

<P>(La siguiente explicaci&oacute;n fue proporcionada por <CODE>seeker@indirect.com</CODE>) 
Linux s&oacute;lo reconoce la 1542 en la direcci&oacute;n 330 (por defecto) o en la 334
y la PAS solamente permite la emulaci&oacute;n MPU-401 en la 330. Aunque se desactive
el MPU-401 bajo software, algo todav&iacute;a entra en conflicto con el 1542 si contin&uacute;a
con su direcci&oacute;n por defecto. Mover la 1542 a la direcci&oacute;n 334 hace feliz
a ambas.</P>
<P>Adem&aacute;s, tanto la 1542 como la PAS16 hacen DMA de 16 bits, por lo que si realiza
una muestra a 16 bits 44kHz y en est&eacute;reo y guarda el fichero a un dispositivo
SCSI se colgar&aacute; el 1542, por lo que existe un problema. El DMA se solapa y no hay
suficiente tiempo para refrescar la RAM, por lo que se obtiene el mensaje "PARITY ERROR-SYSTEM HALTED",
sin ninguna pista que indique el motivo que lo caus&oacute;.</P>
<P>A&uacute;n puede ser peor porque los vendedores de unidades de cinta QIC-117 recomiendan 
establecer el bus activado/desactivado durante un tiempo tal que la 1542 est&eacute; activada
m&aacute;s tiempo del normal. Consiga el programa <CODE>SCSISEL.EXE</CODE> de la BBS de Adaptec
o de cualquier otro lugar de Internet, y reduzca el tiempo del bus activado o incremente
el tiempo del bus desactivado hasta que el problema se solucione. <CODE>SCSISEL</CODE> cambia
los par&aacute;metros de la EEPROM, por lo que es m&aacute;s duradero que un parche en el controlador
de DOS desde la l&iacute;nea del <CODE>CONFIG.SYS</CODE>, y funcionar&aacute; si arranca directamente en Linux
(cosa que no har&aacute; el parche de DOS)</P>
<P>El &uacute;ltimo problema: los viejos juegos de chip Symphony reducen dr&aacute;sticamente
el tiempo de los ciclos de I/O para aumentar los accesos al bus. Ninguna de
las tarjetas de sonido que he probado han dado <EM>ning&uacute;n</EM> problema con el tiempo reducido
excepto la PAS16. La BBS de Media Vision tiene el fichero <CODE>SYMPFIX.EXE</CODE>
el cual se supone que soluciona el problema a&ntilde;adiendo un bit de diagn&oacute;stico en
el controlador del bus del Symphony, pero no da muchas garant&iacute;as. Usted puede
necesitar:</P>
<P>
<UL>
<LI>conseguir que el distribuidor de la placa base reemplace la antigua versi&oacute;n del chip del bus</LI>
<LI>reemplazar la placa base, o</LI>
<LI>comprar otra tarjeta de sonido de marca diferente. </LI>
</UL>
</P>
<P>Young Microsystems actualizar&aacute; las placas que importaron por 30$ (US); otros
vendedores har&aacute;n lo mismo si puede probar qui&eacute;n hizo o import&oacute; la
placa madre (buena suerte). El problema est&aacute; en el chip del interfaz del bus
de ProAudio, que yo sepa. Nadie compra una tarjeta de 120$ y la conecta a un
AT de 6MHz. La mayor&iacute;a lo har&aacute; en un 386/486 a 25-40MHz, y seguramente podr&aacute;
manipular al menos frecuencias de bus de 12MHz si los chips est&aacute;n bien dise&ntilde;ados.</P>
<P>El primer problema depende del juego de chips usados en su placa base, de la
velocidad del bus y de otros par&aacute;metros de la BIOS, y de la fase de la luna.
El segundo problema depende del par&aacute;metro de la opci&oacute;n de refresco (oculto o
sincronizado), de la frecuencia de DMA del 1542 y (posiblemente) de la frecuencia
de E/S (entrada/salida) del bus.
El tercero se puede determinar llamando a Media Vision y pregunt&aacute;ndoles qu&eacute;
chip de Symphony es incompatible con su lento dise&ntilde;o. Atento: 3 de 4 t&eacute;cnicos
con los que habl&eacute; ten&iacute;an el cerebro da&ntilde;ado. Asist&iacute; at&oacute;nito a todo lo que hablaron
acerca del hardware de los dem&aacute;s, ya que ellos no parece que conozcan el suyo
muy bien.</P>

<H2><A NAME="ss6.17">6.17</A> <A HREF="Sonido-COMO.html#toc6.17">¿Es posible leer y escribir muestras simult&aacute;neamente?</A>
</H2>

<P>Debido a limitaciones del hardware, esto no es posible con la mayor&iacute;a de
las tarjetas de sonido. Algunas tarjetas nuevas lo soportan. Lea la
secci&oacute;n de "modo bidireccional" en la <EM>Hacker's Guide To VoxWare</EM> para m&aacute;s
informaci&oacute;n.</P>

<H2><A NAME="ss6.18">6.18</A> <A HREF="Sonido-COMO.html#toc6.18">Mi SB16 est&aacute; puesta con un IRQ 2, pero la configuraci&oacute;n no me deja usar este valor.</A>
</H2>

<P>En los &uacute;ltimos 286, la interrupci&oacute;n IRQ 2 es asignada al segundo controlador
de interrupciones. Es equivalente a IRQ 9.</P>

<H2><A NAME="ss6.19">6.19</A> <A HREF="Sonido-COMO.html#toc6.19">¿Est&aacute;n soportadas la SoundBlaster AWE32 o la SoundBlaster16 ASP?</A>
</H2>

<P>En el pasado, Creative Labs no era partidaria de dar informaci&oacute;n acerca de la programaci&oacute;n de
estas tarjetas. Ellos han cambiado su pol&iacute;tica y en los n&uacute;cleos Linux 2.1.x se incluye ahora un
controlador AWE.</P>

<H2><A NAME="ss6.20">6.20</A> <A HREF="Sonido-COMO.html#toc6.20">Si estoy en Linux y despu&eacute;s inicio una sesi&oacute;n de DOS, tengo errores y/o las aplicaciones de sonido no funcionan correctamente.</A>
</H2>

<P>Esto ocurre despu&eacute;s de un reinicio en caliente hacia el DOS. Algunas veces el
mensaje de error se refiere enga&ntilde;osamente a que est&aacute; mal el fichero <CODE>CONFIG.SYS</CODE>.</P>
<P>La mayor&iacute;a de las tarjetas de sonido tienen los par&aacute;metros del IRQ y del DMA
programables por Software. Si tu usa par&aacute;metros diferentes entre el
Linux y el MS-DOS/Windows, esto causar&aacute; problemas. Algunas tarjetas de
sonido no aceptan nuevos par&aacute;metros sin una completa inicializaci&oacute;n (reset)
(por ejemplo corte la corriente o pulse el bot&oacute;n de reset).</P>
<P>La soluci&oacute;n m&aacute;s r&aacute;pida para este problema es llevar a cabo un completo
reinicio usando el bot&oacute;n de reset o cortando la energ&iacute;a despu&eacute;s de un
reinicio en caliente (por ejemplo ctrl-alt-del).</P>
<P>La soluci&oacute;n correcta es asegurarse de utilizar los mismos par&aacute;metros IRQ y DMA en el
MS-DOS y Linux (o no utilizar MS-DOS :-).</P>

<H2><A NAME="ss6.21">6.21</A> <A HREF="Sonido-COMO.html#toc6.21">Problemas ejecutando DOOM bajo Linux.</A>
</H2>

<P>Los usuarios del puerto para Linux del juego de ID Software DOOM pueden
estar interesados en estas notas.</P>
<P>Para la correcta salida de sonido se necesita la versi&oacute;n 2.90 o posterior del
controlador de sonido. Tiene soporte para el "modo DOOM" en tiempo real.</P>
<P>Las muestras de sonido son de 16 bits. Si usted posee una tarjeta de sonido
de 8 bits puedes hacer que el sonido funcione usando uno de los muchos
programas disponibles en 
<A HREF="ftp://sunsite.unc.edu/pub/Linux/games/doom">ftp://sunsite.unc.edu</A></P>
<P>Si la ejecuci&oacute;n del DOOM en su sistema es pobre, desactivar el sonido (renombrando
el fichero <CODE>sndserver</CODE>) puede mejorarla.</P>
<P>Por defecto DOOM no soporta m&uacute;sica (como en la versi&oacute;n del DOS). El programa
<CODE>musserver</CODE> a&ntilde;adir&aacute; soporte para m&uacute;sica al DOOM bajo Linux. Lo puede encontrar
en 
<A HREF="ftp://pandora.st.hmc.edu/pub/linux/musserver.tgz">ftp://pandora.st.hmc.edu</A></P>

<H2><A NAME="ss6.22">6.22</A> <A HREF="Sonido-COMO.html#toc6.22">¿C&oacute;mo puedo reducir el ruido recogido por mi tarjeta de sonido?</A>
</H2>

<P>Usar cables con buen aislante y probar la tarjeta de sonido en diferentes
ranuras le ayudar&aacute; a reducir el ruido. Si la tarjeta de sonido tiene control de
volumen puede intentar diferentes posiciones (al m&aacute;ximo es probablemente lo
mejor).</P>
<P>Usar un programa mezclador le asegurar&aacute; que las entradas no deseadas (por
ejemplo el micr&oacute;fono) est&aacute;n puestas a cero.</P>
<P>Algunas tarjetas de sonido simplemente no est&aacute;n dise&ntilde;adas con buen aislante
y con toma de tierra y son propensas a generar ruido.</P>
<P>Finalmente, en mi sistema encontr&eacute; que la opci&oacute;n de l&iacute;nea de comandos del kernel
<CODE>no-hlt</CODE> reduce el nivel de ruido. Esta opci&oacute;n le dice al kernel que no
utilice la instrucci&oacute;n halt cuando ejecuta el bucle de procesos activos. Puede 
probar esto al arrancar, o establecerlo utilizando el comando <CODE>append="no-hlt"</CODE>
en su fichero de configuraci&oacute;n de LILO.</P>

<H2><A NAME="ss6.23">6.23</A> <A HREF="Sonido-COMO.html#toc6.23">Puedo reproducir sonido, pero no puedo grabar.</A>
</H2>

<P>Si puede reproducir sonido pero no puede grabar, siga estos pasos:
<UL>
<LI> Use un programa mezclador para elegir el dispositivo apropiado (como
por ejemplo el micr&oacute;fono).</LI>
<LI> Use el mezclador para seleccionar la ganancia de entrada al m&aacute;ximo.</LI>
<LI> Si puede, intente probar la tarjeta de sonido grabando bajo MS-DOS
para comprobar si es un problema de hardware.</LI>
</UL>
</P>
<P>A veces, se utiliza un canal DMA distinto al grabar que al reproducir. En este caso la raz&oacute;n m&aacute;s
probable es que el DMA de grabaci&oacute;n no est&eacute; ajustado correctamente.</P>

<H2><A NAME="ss6.24">6.24</A> <A HREF="Sonido-COMO.html#toc6.24">Mi tarjeta de sonido "compatible" s&oacute;lo funciona si primero la inicializo bajo MS-DOS.</A>
</H2>

<P>En la mayor&iacute;a de los casos una tarjeta "compatible SoundBlaster" funcionar&aacute; mejor bajo
Linux si se configura con un controlador distinto al de la SoundBlaster. La mayor&iacute;a de las tarjetas de
sonido presumen de ser compatibles (como "compatible 16 bit SB Pro" o "SB compatible 16 bit")
pero normalmente esta compatibilidad Sound Blaster es s&oacute;lo un "truco" proporcionado para la
compatibilidad con los juegos bajo DOS. La mayor&iacute;a de las tarjetas tienen un modo nativo 16 bit que
probablemente ser&aacute; soportado por las versiones de Linux m&aacute;s recientes (2.0.1 y posteriores).</P>

<H2><A NAME="ss6.25">6.25</A> <A HREF="Sonido-COMO.html#toc6.25">Mi tarjeta de sonido "compatible" SoundBlaster 16-bit s&oacute;lo funciona en el modo 8-bit bajo Linux</A>
</H2>

<P>Las tarjetas de sonido de 16 bits descritas como compatibles SoundBlaster
realmente s&oacute;lo son compatibles con la SoundBlaster Pro de 8 bits. Generalmente
tienen un modo de 16 bits que no es compatible con la SoundBlaster 16 y tampoco
es compatible con el controlador de sonido del Linux.</P>
<P>Puede conseguir que la tarjeta funcione en modo 16-bits utilizando el controlador
MAD16 o MSS/WSS.</P>

<H2><A NAME="ss6.26">6.26</A> <A HREF="Sonido-COMO.html#toc6.26">¿D&oacute;nde puedo encontrar aplicaciones de sonido para Linux?</A>
</H2>


<P>Estos son unos buenos sitios para buscar aplicaciones espec&iacute;ficas de sonido
para Linux:</P>
<P>
<UL>
<LI> 
<A HREF="ftp://sunsite.unc.edu:/pub/Linux/kernel/sound/">ftp://sunsite.unc.edu:/pub/Linux/kernel/sound/</A></LI>
<LI> 
<A HREF="ftp://sunsite.unc.edu:/pub/Linux/apps/sound/">ftp://sunsite.unc.edu:/pub/Linux/apps/sound/</A></LI>
<LI> 
<A HREF="ftp://tsx-11.mit.edu:/pub/linux/packages/sound/">ftp://tsx-11.mit.edu:/pub/linux/packages/sound/</A></LI>
<LI> 
<A HREF="ftp://nic.funet.fi:/pub/Linux/util/sound/">ftp://nic.funet.fi:/pub/Linux/util/sound/</A></LI>
<LI> 
<A HREF="ftp://nic.funet.fi:/pub/Linux/xtra/snd-kit/">ftp://nic.funet.fi:/pub/Linux/xtra/snd-kit/</A></LI>
<LI> 
<A HREF="ftp://nic.funet.fi:/pub/Linux/ALPHA/sound/">ftp://nic.funet.fi:/pub/Linux/ALPHA/sound/</A></LI>
</UL>
</P>

<H2><A NAME="ss6.27">6.27</A> <A HREF="Sonido-COMO.html#toc6.27">¿Puede el controlador de sonido ser compilado como m&oacute;dulo cargable?</A>
</H2>


<P>Con los &uacute;ltimos n&uacute;cleos el controlador de sonido es soportado como un m&oacute;dulo cargable.</P>
<P>Lea los ficheros <CODE>/usr/src/linux/drivers/sound/Readme.modules</CODE> y
<CODE>/usr/src/linux/Documentation/modules.txt</CODE> (o <CODE>/usr/src/linux/README</CODE>)
para m&aacute;s detalles.</P>

<H2><A NAME="ss6.28">6.28</A> <A HREF="Sonido-COMO.html#toc6.28">¿Puedo usar la tarjeta de sonido para sustituir el pitido de la consola del sistema?</A>
</H2>

<P>Pruebe con el programa <CODE>oplbeep</CODE> disponible en
<A HREF="ftp://sunsite.unc.edu/pub/Linux/apps/sound/oplbeep-alpha.tar.gz">ftp://sunsite.unc.edu/pub/Linux/apps/sound/oplbeep-alpha.tar.gz</A></P>
<P>Una variante es el programa <CODE>beep</CODE> en
<A HREF="ftp://sunsite.unc.edu/pub/Linux/kernel/patches/misc/modreq_beep.tgz">ftp://sunsite.unc.edu/pub/Linux/kernel/patches/misc/modreq_beep.tgz</A></P>
<P>El paquete <CODE>modutils</CODE> tiene un programa de ejemplo y un parche del
n&uacute;cleo que soporta llamadas a programas externos para generar los sonidos
del n&uacute;cleo.</P>
<P>Alternativamente, algunas tarjetas se pueden conectar al altavoz del PC por
lo que todos los sonidos van a los altavoces de la tarjeta.</P>

<H2><A NAME="ss6.29">6.29</A> <A HREF="Sonido-COMO.html#toc6.29">¿Qu&eacute; es VoxWare?</A>
</H2>

<P>Los controladores de sonido del n&uacute;cleo soportan diferentes sistemas operativos
basados en la arquitectura Intel y compatibles con Unix, y se pueden obtener
como un paquete separado del n&uacute;cleo del Linux. Hasta febrero del 96 el autor
hab&iacute;a llamado al software "VoxWare". Desafortunadamente este nombre ha sido
registrado por VoxWare Incorporated, y no puede ser usado. El nuevo nombre del
controlador es OSS/Free.</P>
<P>El Open Sound System es un controlador del sonido del n&uacute;cleo disponible
comercialmente para varios sistemas Unix, vendido por 4Front Technologies. La
versi&oacute;n libre, conocida como OSS/Free continuar&aacute; siendo desarrollada totalmente
gratis para los sistemas Linux.</P>
<P>Otros nombres con los que puede encontrarse que han sido usados en el pasado para
referirse al mismo controlador de sonido son TASD (Controlador de Sonido Temporalmente
An&oacute;nimo) y USS (Sistema de Sonido Unix).</P>
<P>Para m&aacute;s informaci&oacute;n visite la p&aacute;gina Web de 4Front Technologies.
<A HREF="http://www.4front-tech.com">http://www.4front-tech.com</A>. Escrib&iacute;
una revisi&oacute;n de OSS/Linux para la edici&oacute;n de Junio de 1997 de 
<A HREF="http://www.ssc.com/lj/">Linux Journal</A>.</P>

<H2><A NAME="ss6.30">6.30</A> <A HREF="Sonido-COMO.html#toc6.30">¿Est&aacute;n soportadas las tarjetas de sonido Plug-and-Play?</A>
</H2>

<P>El soporte total de Plug and Play ir&aacute; desarroll&aacute;ndose en la versi&oacute;n 2.1.x de Linux.
En este momento hay un buen n&uacute;mero de formas para conseguir que las tarjetas de
sonido Plug and Play funcionen.</P>
<P>Si usted posee un sistema Pentium o superior con BIOS Plug and Play, &eacute;ste ya cuidar&aacute; de
configurar las tarjetas por usted. Aseg&uacute;rese de que usted configura el controlador de
sonido de Linux para usar la misma direcci&oacute;n E/S, IRQ y canal DMA que las configuradas
por la BIOS.</P>
<P>Hay un paquete de herramientas Plug and Play para Linux que puede utilizarse para 
ajustar la tarjeta. Puede encontrarse en el sitio Web de Red Hat 
<A HREF="http://www.redhat.com/">http://www.redhat.com/</A>
(puede tambi&eacute;n estar incluido en su distribuci&oacute;n Linux).</P>
<P>Si usa la tarjeta bajo Windows95, puede utilizar el Administrador de Dispositivos para
establecer los valores de la tarjeta, y rearrancar Linux en caliente utilizando el programa
LOADLIN. Aseg&uacute;rese de que Linux y Windows95 utilizan los mismos par&aacute;metros de configuraci&oacute;n de
la tarjeta.</P>
<P>Si utiliza la tarjeta bajo DOS, puede utilizar la utilidad <CODE>icu</CODE> que viene con las tarjetas
SoundBlaster16 PnP para configurarlas bajo DOS, y luego rearrancar Linux en caliente utilizando
el programa LOADLIN. De nuevo, aseg&uacute;rese de que DOS y Linux utilizan los mismos par&aacute;metros de 
configuraci&oacute;n de la tarjeta.</P>
<P>El controlador de sonido comercial OSS da soporte a la tarjeta SoundBlaster16 PnP. Puede adquirir
este controlador de 4Front Technologies.</P>

<H2><A NAME="ss6.31">6.31</A> <A HREF="Sonido-COMO.html#toc6.31">Sox/Play/Vplay saca el mensaje "invalid block size 1024"</A>
</H2>

<P>Un cambio en el controlador de sonido de la versi&oacute;n 1.3.67 romp&iacute;a algunos programas
de reproducci&oacute;n de sonido los cuales (incorrectamente) comprobaban que el resultado
del ioctl SNDCTL_DSP_GETBLKSIZE era mayor que 4096. Las utilidades incluidas
en el &uacute;ltimo paquete snd-util-3.x.tar.gz (en 
<A HREF="ftp://ftp.4front-tech.com/ossfree">ftp://ftp.4front-tech.com/ossfree</A>.) ahora
manejan esto de manera adecuada. Las &uacute;ltimas versiones del controlador de sonido
tambi&eacute;n han sido arregladas para impedir reservar fragmentos menores de 4096 bytes,
lo que resuelve el problema con las utilidades antiguas. </P>

<H2><A NAME="ss6.32">6.32</A> <A HREF="Sonido-COMO.html#toc6.32">¿Por qu&eacute; el controlador de sonido tiene su propio programa de configuraci&oacute;n?</A>
</H2>

<P>El controlador de sonido soporta diferentes par&aacute;metros de configuraci&oacute;n. El programa
<CODE>configure</CODE> incluido con el controlador de sonido comprueba las dependencias entre
los par&aacute;metros. Las herramientas usadas para configurar el n&uacute;cleo no soportan
este nivel de funcionabilidad.</P>
<P>Los &uacute;ltimos n&uacute;cleos permiten usar las herramientas de
configuraci&oacute;n del n&uacute;cleo est&aacute;ndar con el controlador de sonido (vea la 
secci&oacute;n "Configurando el N&uacute;cleo").</P>

<H2><A NAME="ss6.33">6.33</A> <A HREF="Sonido-COMO.html#toc6.33">Las opciones del mezclador son borradas cuando cargo el m&oacute;dulo del controlador de sonido</A>
</H2>

<P>Puede construir el controlador de sonido como un m&oacute;dulo cargable y usar <CODE>kerneld</CODE>
para cargarlo y descargarlo autom&aacute;ticamente. Esto puede presentar un problema:
cuando el m&oacute;dulo se recarga los par&aacute;metros del mezclador vuelven a sus valores
por defecto. Para algunas tarjetas de sonido esto puede ser muy ruidoso (por ejemplo
la SB16) o muy silencioso. Markus Gutschke 
<A HREF="mailto:gutschk@uni-muenster.de">gutschk@uni-muenster.de</A>
encontr&oacute; esta soluci&oacute;n: use una l&iacute;nea en su fichero <CODE>/etc/conf.modules</CODE> como la
que sigue:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
options sound dma_buffsize=65536 &amp;&amp; /usr/bin/setmixer igain 0 ogain 0 vol 75
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto har&aacute; que su programa mezclador (en este caso <CODE>setmixer</CODE>) sea ejecutado
inmediatamente despu&eacute;s de que su controlador de sonido es cargado. El par&aacute;metro dma_buffsize
es s&oacute;lo un valor "de pega" necesario porque el comando de opci&oacute;n requiere una opci&oacute;n
en la l&iacute;nea de comando. Cambie la l&iacute;nea seg&uacute;n corresponda a su programa
mezclador y los par&aacute;metros de ganancia.</P>
<P>Si ha compilado el controlador de sonido dentro del n&uacute;cleo y desea ajustar la ganancia
del mezclador durante el reinicio, puede llamar al programa mezclador en
un fichero de inicio del sistema como por ejemplo <CODE>/etc/rc.d/rc.local</CODE></P>

<H2><A NAME="ss6.34">6.34</A> <A HREF="Sonido-COMO.html#toc6.34">Solamente el root puede grabar sonido.</A>
</H2>

<P>Por defecto el script que hay en el fichero <CODE>Readme.linux</CODE> que crea
los ficheros de dispositivo de sonido s&oacute;lo permite que los dispositivos sean
le&iacute;dos por el root. Esto se hace para aumentar la seguridad. En un entorno
de red, varios usuarios externos pueden conectarse de forma remota a un PC con
Linux con tarjeta de sonido y micr&oacute;fono y pueden escuchar a escondidas.
Si a usted no le preocupa eso, puede cambiar los permisos usados en el script.</P>
<P>Con la configuraci&oacute;n original, los usuarios a&uacute;n pueden reproducir ficheros de
sonido. Esto no es un riesgo para la seguridad, pero es una posibilidad para
molestar o ser molestado.</P>

<H2><A NAME="ss6.35">6.35</A> <A HREF="Sonido-COMO.html#toc6.35">¿Est&aacute; soportado el hardware de sonido del IBM ThinkPad?</A>
</H2>


<P>Puede encontrarse informaci&oacute;n acerca de c&oacute;mo usar la tarjeta de sonido mwave del ordenador
port&aacute;til IBM ThinkPad en 
<A HREF="http://www.screamin.demon.co.uk/">http://www.screamin.demon.co.uk/</A>.</P>

<HR>
<A HREF="Sonido-COMO-7.html">Página siguiente</A>
<A HREF="Sonido-COMO-5.html">Página anterior</A>
<A HREF="Sonido-COMO.html#toc6">Índice general</A>
</BODY>
</HTML>
