<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Linux Networking-concepts HOWTO: ¿Qu&eacute; es la «Internet»?</TITLE>
 <LINK HREF="conceptos-de-redes-COMO-4.html" REL=next>
 <LINK HREF="conceptos-de-redes-COMO-2.html" REL=previous>
 <LINK HREF="conceptos-de-redes-COMO.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="conceptos-de-redes-COMO-4.html">Página siguiente</A>
<A HREF="conceptos-de-redes-COMO-2.html">Página anterior</A>
<A HREF="conceptos-de-redes-COMO.html#toc3">Índice general</A>
<HR>
<H2><A NAME="definition-internet"></A> <A NAME="s3">3. ¿Qu&eacute; es la «Internet»?</A></H2>

<P>Internet es una 
<A HREF="conceptos-de-redes-COMO-2.html#definition-WAN">WAN</A> que abarca todo el
planeta: es una de las m&aacute;s grandes redes de ordenadores existentes. La
expresi&oacute;n «internetworking» se refiere a conectar redes separadas para
construir una m&aacute;s grande, de manera que «La Internet» es la conexi&oacute;n de un
gran conjunto de subredes.
<P>De manera que examinemos ahora la lista anterior y pregunt&eacute;monos:
¿cu&aacute;l es el tama&ntilde;o de Internet, sus detalles f&iacute;sicos y protocolos?
<P>El tama&ntilde;o ya lo hemos establecido: es mundial.
<P>Los detalles f&iacute;sicos, sin embargo, son variados: cada peque&ntilde;a subred se
conecta de forma diferente, con un aspecto y naturaleza f&iacute;sica distinta.
Los intentos de hacer un mapa &uacute;til de Internet han acabado de forma
general en un abyecto fracaso.
<P>Los protocolos que se hablan entre cada enlace tambi&eacute;n son diferentes a
menudo: todos los 
<A HREF="conceptos-de-redes-COMO-2.html#definition-link-level-protocol">protocolos de nivel de enlace</A> que nombramos antes, y muchos m&aacute;s.
<P>
<H2><A NAME="ss3.1">3.1 ¿C&oacute;mo funciona la Internet?</A>
</H2>

<P>Entonces se nos plantea la pregunta: ¿c&oacute;mo puede hablar cada nodo de
Internet con otros, si todos utilizan diferentes protocolos de nivel de
enlace?
<P>
<A NAME="definition-network-protocol"></A> 
La respuesta es muy sencilla: necesitamos otro protocolo que controle c&oacute;mo
fluyen las cosas a trav&eacute;s de la red. El protocolo de nivel de enlace
describe c&oacute;mo llegar de un nodo a otro si est&aacute;n conectados de forma
directa: el «protocolo de red» nos dice c&oacute;mo llegar de un punto de la red
a otro, yendo a trav&eacute;s de otros enlaces si fuera necesario.
<P>
<A NAME="definition-internet-protocol"></A> 
<A NAME="definition-IP"></A> 
<A NAME="definition-IPv4"></A> 
<A NAME="definition-IPv6"></A> 
Para la Internet, el protocolo de red es el <EM>Internet Protocol</EM>
(versi&oacute;n 4), o «IP». No es el &uacute;nico que hay (tenemos otros como el
Appletalk de Apple, IPX de Novell, DECNet de Digital y el NetBEUI de
Microsoft) pero es el m&aacute;s ampliamente adoptado. Hay una nueva versi&oacute;n de
IP denominada IPv6, pero a&uacute;n no es tan com&uacute;n.
<P>
<A NAME="definition-router"></A> 
Para enviar un mensaje de una parte a otra del planeta, su ordenador escribe
un fragmento de <EM>Internet Protocol</EM>, lo env&iacute;a por el m&oacute;dem, que usa alg&uacute;n
protocolo de nivel de enlace de m&oacute;dems para enviarlo al otro m&oacute;dem al que
est&aacute; llamando, que posiblemente est&eacute; enchufado a un servidor terminal
(b&aacute;sicamente una gran caja de m&oacute;dems), que lo env&iacute;a a otro nodo dentro de
la red del ISP (Internet Service Provider - Proveedor de Servicios de
Internet), que lo env&iacute;a normalmente a otro nodo mayor, que lo manda al
siguiente, y as&iacute; sucesivamente. Un nodo que conecte dos o m&aacute;s redes se
llama «router»
<BLOCKQUOTE>N. del T.: mantenemos la denominaci&oacute;n «router», ya
que es la m&aacute;s com&uacute;n entre los propios hispanohablantes. Tambi&eacute;n hemos
escuchado «enrutador» o «encaminador»</BLOCKQUOTE>
: tendr&aacute; una 
<A HREF="conceptos-de-redes-COMO-2.html#definition-network-interface">interfaz</A> para cada red.
<P>
<A NAME="definition-protocol-stack"></A> 
Llamamos a este conjunto de protocolos una «pila de protocolos», que a veces 
se representa de esta manera:
<P>
<BLOCKQUOTE><CODE>
<PRE>
  [ Aplicaci&oacute;n: Controla Porno ]        [ Capa de aplicaci&oacute;n: Sirve Porno ]
                |                                       ^
                v                                       |
[ TCP: Controla la Retransmisi&oacute;n ]      [ TCP: Controla la Retransmisi&oacute;n ]
                |                                       ^
                v                                       |
[ IP: Controla el Encaminamiento ]      [ IP: Controla el Encaminamiento ]
                |                                       ^
                v                                       |
[ Enlace: Controla un solo Salto ]      [ Enlace: Controla un solo Salto ]
                |                                       |
                +---------------------------------------+
</PRE>
</CODE></BLOCKQUOTE>
<P>
<A NAME="definition-transmission-control-protocol"></A> 
<A NAME="definition-TCP"></A> 
De manera que en el diagrama vemos un Netscape (la Aplicaci&oacute;n de la
izquiereda) obteniendo una p&aacute;gina web de un servidor web (la Aplicaci&oacute;n de
la derecha). Para hacerlo utiliza el «Transmission Control Protocol» o
«TCP»: alrededor del 90% del tr&aacute;fico de la Internet hoy d&iacute;a es TCP, y se
emplea para Web y correo electr&oacute;nico.
<P>De manera que el Netscape hace una consulta mediante una conexi&oacute;n TCP al
servidor web remoto: esto lo controla la capa TCP, que se la pasa a la
capa IP, que se hace cargo de la direcci&oacute;n que tiene que seguir, y la
pasa a la capa de enlace apropiada, que la transmite al otro extremo del
enlace.
<P>En el otro extremo, la capa de enlace la pasa a la capa IP, que comprueba
que vaya destinado a esa m&aacute;quina (si no, puede enviarla a otra capa de
enlace diferente para que pase al siguiente nodo), se la entrega a la capa
TCP que, por &uacute;ltimo, se la manda al servidor.
<P>De manera que tenemos lo siguiente:
<P>
<OL>
<LI>La aplicaci&oacute;n (Netscape, o el servidor web en el otro extremo)
decide con qui&eacute;n quiere hablar, (y qu&eacute; le quiere enviar).

<A NAME="definition-packets"></A> </LI>
<LI>La capa TCP env&iacute;a paquetes especiales para iniciar la conversaci&oacute;n
con el otro extremo, y entonces empaqueta los datos en «paquetes»
TCP: un paquete es s&oacute;lo un t&eacute;rmino para describir un grupo de datos
que pasan a trav&eacute;s de la red. La capa TCP delega este paquete en la
<A NAME="definition-retransmission"></A> 
capa IP: estar&aacute; mand&aacute;ndoselo a la capa IP hasta que la capa TCP del
otro extremo responda diciendo que lo ha recibido. Esto se llama
«retransmisi&oacute;n», e implica gran cantidad de reglas complejas que
deciden cu&aacute;ndo retransmitir, cu&aacute;nto esperar, etc. Tambi&eacute;n le da a
cada paquete un n&uacute;mero, lo que significa que el otro extremo podr&aacute;
ponerlos en el orden correcto.

<A NAME="definition-routing"></A> </LI>
<LI>La capa IP comprueba el destino del paquete, y averigua el siguiente
nodo al que mand&aacute;rselo. Este sencillo acto se llama «encaminamiento»
(<EM>routing</EM>), y va desde lo realmente sencillo (si s&oacute;lo tiene un
m&oacute;dem, y no hay otra interfaz de red, todos los paquetes saldr&aacute;n por
ah&iacute;) a lo extremadamente complejo (si tiene 15 grandes redes
conectadas directamente con usted).</LI>
</OL>
<P>
<HR>
<A HREF="conceptos-de-redes-COMO-4.html">Página siguiente</A>
<A HREF="conceptos-de-redes-COMO-2.html">Página anterior</A>
<A HREF="conceptos-de-redes-COMO.html#toc3">Índice general</A>
</BODY>
</HTML>
