<!Doctype HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="es">
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <TITLE>LinuxFocus -- Marzo 1998 A Traves de la Ventana</TITLE>
 <META name="Author" CONTENT="Miguel Angel Sepulveda">
 <META name="Keywords" CONTENT="LINUX magazine opengl povray photoshop gimp">
 <META name="Description" CONTENT="Free online magazine on LINUX for users and developers">
 <META name="Copyright" CONTENT="&copy; 1998 LINUXFocus">
 <META name="Translator" CONTENT="">
 <META name="Date" CONTENT="1998-02-91T00:00:00Z">


</HEAD>

<BODY bgcolor="#FFFFFF" text="#000000" link="#ff0033" vlink="#FF3333">

  <MAP name="navegator">
  <AREA shape="rect" coords="0, 0, 65, 28" alt="Hogar" href="../">
  <AREA shape="rect" coords="66, 0, 124, 28" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="125, 0, 193, 28" alt="Busqueda" href="../search.html">
  <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
  <AREA shape="rect" coords="261, 0, 350, 28" alt="Sobre Nosotros" href="../aboutus.html">
  </MAP>



 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0">

 <THEAD>
   <TR align="center">
      <TD colspan="2"><IMG   src="../../common/March1998/border-short.jpg"   alt="[LINUXFocus
      Image]" width="407" height="88"></TD>
   </TR>

   <TR align="center">
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/March1998/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28" alt="[Navegation Bar]"></TD>
   </TR>

   <TR align="center">
     <TD colspan="2">     
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5">
		<TR bgcolor="#000000">
		   <TD align="center">
               <A href="../News/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Noticias</B></FONT></A>
               <A href="../Archives/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Archivos</B></FONT></A>
               <A href="../Companies/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Compa&ntilde;ias</B></FONT></A>
               <A href="../Tips/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Consejos y Trucos &nbsp;</B></FONT></A> 
               </TD>
            </TR>
            
		<TR>
            <!--   Here goes the Title of the article, authors name and abstract -->
		   <TD align="center">
 			<FONT face="Helvetica,Arial" color="#660066"><H1>A TRAV&Eacute;S DE LA VENTANA</H1></FONT>
 			<FONT face="Helvetica,Arial" color="#000000"><H3><A href="mailto:jmlm@ctv.es"><FONT color="#000000">Jos&eacute; Manuel Laveda Molina</FONT></A></H3></FONT>
                  <HR size="2" noshade>
	         </TD>
            </TR>

           </TABLE>

     </TD>
   </TR>

 </THEAD>



 <TBODY>
  
 <TR>
    <TD valign="top" align="center">
           <H4><A href="#section1">INTRODUCCI&Oacute;N</A></H4>
	   <H4><A href="#section2">&iquest;NECESITA LINUX UN ENTORNO EST&Aacute;NDAR?</a></H4>
           <H4><A href="#section3">KDE (The K Desktop Environment)</A></H4>
           <H4><A href="#section4">WINDOWMAKER & AFTERSTEP</A></H4>
           <H4><A href="#section5">GNOME. NO PUDO SER :(.</A></H4>
	   <H4><A href="#section6">EP&Iacute;LOGO.</A></H4>
	   <H4><A href="#section7">ANEXO: LESSTIF. &iquest;LA GRAN OLVIDADA?</A></H4>
    </TD>
   
    <TD align="center">
       <TABLE border="0" width="80%" cellspacing="0" cellpadding="0">
	  <TR>
          <TD>
           <H3><FONT face="Helvetica,Arial" color="#660033">INTRODUCCI&Oacute;N</FONT></H3>
	     <A name="section1"></A>
		  <p> Este art&iacute;culo trata de recoger mis primeras impresiones tras manejar los gestores de ventanas (&oacute; entornos) abordados. Se tratar&aacute;n sus aspectos generales y algunos comentarios sobre los mismos.
		  <p> Los creadores de cada gestor de ventanas han optado por una liber&iacute;a gr&aacute;fica, lenguaje/s y otras herramientas diferentes (e incluso dispares para alg&uacute;n caso que se ver&aacute;), por lo que hay que dejar patente que la comparaci&oacute;n en los mismos t&eacute;rminos de estos entornos en unas condiciones objetivas no se puede hacer. El estado de desarrollo de cada una de las librer&iacute;as utilizadas, el tiempo que el proyecto lleva en marcha, el n&uacute;mero de personas que est&aacute;n participando en el mismo, etc... son multitud de factores que hacen que no se pueda afirmar que un gestor es mejor que otro sin m&aacute;s, y es algo que ha de tenerse muy en cuenta a la hora de leer este art&iacute;culo.
		  <p> Por otra parte decir que, como no, existe cierto toque de subjetividad debido a los gustos y preferencias del autor, por lo que tratar&eacute; de ser lo m&aacute;s objetivo posible siempre tendiendo en cuenta todo lo dicho.
		  <p> Aqu&iacute; muestro los ficheros que he utilizado para poder disponer al mismo tiempo de dos gestores de ventanas. Esto me ha sido muy &uacute;til en cuanto pod&iacute;a cambiar de terminal para volver al mio en cualquier momento (gracias a M. Soriano :) ).

		   <p> Mi fichero /usr/local/bin/flin:

		    <pre>#! /bin/sh
export WM=after
if [ $# = 0 ]; then
        exec startx -- -bpp 16 :0
else
        if [ $1 = 'dual' ]; then
                export WM=after
                exec startx -- -bpp 16 :0 &
                sleep 5
                export WM=kde
                exec startx -- :1 &
        fi
        if [ $1 = 'kde' ];then
                export WM=kde
                exec startx -- -bpp 16 :0
        fi

fi      </pre>
		  <p> Mi fichero $HOME/.XClients:

		    <pre>#! /bin/bash
#
# Styx's .xinitrc
#
####################################

exec 2>$HOME/xinit.error.log

echo "Parametro 1 $1 " >&2

sysresources=$HOME/.Xdefaults

# merge in defaults and keymaps

if [ -f $sysresources ]; then
         xrdb -merge $sysresources
fi

# You may at this point start your personal applications.
# e.g xscreensaver

# xscreensaver -timeout 2 -cycle 1 &

xmodmap ~/resources/X11/Mapeo.es

xhost +

# Agenda planifier

if [ -f /usr/local/lib/pland ]; then
         /usr/local/lib/pland &
fi

if [ $WM = "kde" ]; then
        exec startkde -display :1
else 
	exec afterstep -display :0
fi 
</pre>
		  <p> De esta forma puedo invocar indistintamente:
		    <ul>
		    <li> $ flin &nbsp;&nbsp;/*AfterStep*/
		    <li> $ flin kde  &nbsp;&nbsp;   /*KDE*/
		    <li> $ flin dual &nbsp;&nbsp;   /*AfterStep & KDE*/
		    </ul>
		  

		      
	<H4><FONT face="Helvetica,Arial" color="#660033">MULTITUD DE LIBRER&Iacute;AS</FONT></H4>
		  <p> Lo primero que puede llamar la atenci&oacute;n al lector es la disparidad de librer&iacute;as utilizadas en cada uno de los entornos, todas ellas son de dominio p&uacute;blico bajo las conocidas GPL/LGPL u otras que permiten su uso gratuito.
		  <p> Esto plantea, a mi entender, un problema para el usuario que quiera escoger alguno de ellos, ha de tenerse muy en cuenta que librer&iacute;a/s utiliza el gestor por el que se ha optado. En todas las ocasiones encontrar&aacute; informaci&oacute;n puntual sobre este detalle en la documentaci&oacute;n y p&aacute;ginas <I>web</I> correspondientes a cada uno de los proyectos. 

	   <H3><FONT face="Helvetica,Arial" color="#660033">&iquest;NECESITA LINUX UN ENTORNO EST&Aacute;NDAR?</FONT></H3>
	     <A name="section2"></A>
		  <p> Esta pregunta, que a priori puede parecer banal, tiene para algunos usuarios una respuesta muy sencilla: "Que cada uno utilice el que m&aacute;s le guste", mientras que para otros supone un punto de inflexi&oacute;n a partir del cual LINUX podr&aacute; extenderse m&aacute;s f&aacute;cilmente.
		  <p> El objetivo consiste en obtener un interfaz de usuario muy sencillo de manejar, intuitivo, con herramientas de ayuda en l&iacute;nea potentes, integraci&oacute;n total de las aplicaciones y otras caracter&iacute;sticas que hagan el trabajo diario con el sistema m&aacute;s f&aacute;cil y que todo pueda realizarse pr&aacute;cticamente "a golpe de rat&oacute;n", incluso llegando a m&aacute;s, que todo esto se integre con el proceso de instalaci&oacute;n y administraci&oacute;n del sistema operativo en cualquier m&aacute;quina.
		  <p> Algunas empresas ya hace tiempo que empezaron a trabajar en esta l&iacute;nea, tal es el caso de <A href="http://www.caldera.com">Caldera</A> con el interfaz que incorpora en su distribuci&oacute;n, o <A href="http://www.redhat.com">Red Hat</A> con su CDE para LINUX. Como es muy com&uacute;n es esta comunidad en la que estamos implicados ;), tambi&eacute;n existe alternativas de dominio p&uacute;blico que son las que van a ocupar este art&iacute;culo.
		  <p> Aparte de la libertad que cada uno puede ejercer en esta cuesti&oacute;n, creo que hay que darle su importancia, dado que con un interfaz como el perseguido por cada una de las opciones podremos dejar de o&iacute;r aquello de que LINUX "es feo". Nota: &iquest;A nadie le ha pasado tener su m&aacute;quina en marcha con el kde (por ejemplo) y que cualquier otra persona todav&iacute;a no se ha dado cuenta que eso que est&aacute; viendo NO es Microsoft Windows ni nada parecido?.
		  <p> Por otra parte la existencia de un est&aacute;ndar facilitar&iacute;a la labor a los desarrolladores de software debido a que conocer&iacute;an perfectamente c&oacute;mo el gestor de ventanas iba a relacionarse con las aplicaciones, teniendo en cuenta que algunas de las operaciones m&aacute;s comunes dependen del gestor de ventanas (todo esto es mas complejo, &iexcl;claro!, pero creo que de esta forma todos lo entendemos).
		  <p> En fin, como se suele decir en estos casos, "la pol&eacute;mica est&aacute; servida".
           <H3><FONT face="Helvetica,Arial" color="#660033">KDE (The K Desktop Environment)</FONT></H3>
	     <A name="section3"></A>
		  <p> He de decir que mis comienzos con este entorno no fueron muy f&aacute;ciles, una vez instalada la librer&iacute;a <A href="http://www.toll.no">QT</A> en la que se basa este entorno, obtuve los diferentes paquetes en formato '.rpm' en su versi&oacute;n Beta2. Esto no funcion&oacute; por lo que para la versi&oacute;n Beta3, que comento en estas l&iacute;neas, opt&eacute; por obtenerlo en forma de c&oacute;digo fuente para compilarlo en mi m&aacute;quina, funcionando de esta manera en cuanto se instal&oacute;, tras, porqu&eacute; no decirlo, algo m&aacute;s de 1 hora de compilaci&oacute;n en mi modesto P133 con 32 Mb. Aunque esto no ha de ser un factor que influya sobre el usuario a la hora de escoger su formato de fichero, existen los fuentes y ejecutables en formato 'tar' comprimido adem&aacute;s de los respectivos paquetes '.deb' de <A href="http://www.DEBIAN.org"> DEBIAN</A> y '.rpm' de Red Hat.
		  <p> Una vez establecidas las variables del entorno necesarias y los "configure;make;make install" pertinentes la primera impresi&oacute;n del entorno es muy grata. Disponemos de un entorno gr&aacute;fico muy similar a otros existentes de tipo comercial y solo puedo dar un consejo al lector, no tenga miedo y navegue por &eacute;ste. Con un poco de conocimientos de este tipo de entornos ser&aacute; muy f&aacute;cil el manejarse sin problemas en poco tiempo, llegando a modificar el aspecto del entorno a su gusto muy f&aacute;cilmente. El aspecto general del entorno puede configurarse con el <i>"look and feel"</i> &oacute; estilo del Windows'95 o Motif adem&aacute;s de colores del CDE, KDE, y algun tipo de paleta especial. Para el caso de la primera figura mostrada el estilo est&aacute; fijado a Motif y los colores del CDE (as&iacute; no me recuerda tanto a otros sistemas operativos que en su d&iacute;a abandon&eacute; :) ).
		    <br><br>
		     <IMG src="./../../common/March1998/kde.gif" alt="[Ventana principal del KDE]" width=600 height=400 align=center>
		 <p align=center>Pantalla principal del KDE (parcialmente personalizada).
		 
		  <p> Mediante la barra inferior de la pantalla y el bot&oacute;n marcado como "K", podemos controlar todas las utilidades que este entorno incorpora, pudiendo instalarlas en el men&uacute; (mediante la utilidad kmenuedit) o en la barra de tareas.

		  <p> La primera utilidad que llama la atenci&oacute;n es la ayuda que incorpora, basada en un navegador que permite, adem&aacute;s de la b&uacute;squeda de lo relacionado con el propio entorno, el buscar a trav&eacute;s de las p&aacute;ginas del manual y (en un futuro) los conocidos ficheros en formato 'info'. Basta con pulsar el bot&oacute;n derecho del rat&oacute;n para obtener un men&uacute; del que hay que escoger "Ayuda del Escritorio" (<i>Help on desktop</i>). En principio puede obtenerse los mensajes del entorno fijando la variable del entorno LANG a "es", aunque se puede realizar esto mismo el Panel de Control.

		  <p> Otra de las utilidades a destacar es el Gestor de Ficheros (<i>kfm</i>) del kde, &eacute;ste sirve tanto para navegar por nuestra m&aacute;quina como para realizar las tareas de un verdadero navegador, con lo que tenemos solucionados ambos aspectos.
		 <br>
		 <br>
		    <IMG src="./../../common/March1998/kdehelp.gif" alt="[Ayuda del KDE]" width=600 height=400 align=center>
		 <p align=center>Imagen de la ayuda en l&iacute;nea.
		 
		 
		 <p> Una gran cantidad de utilidades acompa&ntilde;an al entorno. Estas est&aacute;n clasificadas en los siguientes grupos: utilidades, red, juegos, gr&aacute;ficos, administraci&oacute;n, multimedia e Internet. Cualquier usuario que se instale este entorno dispondr&aacute; de esta forma de un m&iacute;nimo conjunto de utilidades con el que puede ya sacarle partido a su m&aacute;quina, esta es la idea de este entorno integrado, un conjunto de aplicaciones totalmente integradas que pueden satisfacer las necesidades m&iacute;nimas de cualquier usuario. 
		
		 <p> Sirva como ejemplo el apartado de utilidades en el que podremos encontrar una completa calculadora, que puede trabajar en varios sistemas num&eacute;ricos y con m&aacute;s de 15 d&iacute;gitos adem&aacute;s de la extensi&oacute;n para la coma flotante, un editor hexadecimal, visor de ficheros gr&aacute;ficos, una herramienta para el control de tiempo invertido en tareas, formateado de discos flexibles, para la escritura de notas, configuraci&oacute;n de impresora, para notas del tipo "postit", editor de men&uacute;s, ejecuta una sesi&oacute;n de terminal (kvt), y para el control de paquetes zip. Por lo que intentar describir todas las utilidades y el funcionamiento completo de este entorno dar&iacute;a para m&aacute;s de un art&iacute;culo, quiz&aacute; para m&aacute;s de un n&uacute;mero de esta publicaci&oacute;n.
		 <p> Una de las novedades respecto a la Beta2 y que puede facilitarnos la tarea de configurar el entorno puede ser el "KDE Control Center", podemos tener un control absoluto sobre el entorno, pudiendo configurarlo a nuestro gusto, siempre teniendo en cuenta que ciertas utilidades tendremos que utilizarlas como "root", claro!, tal es el caso de las utilidades como <b>kuser</b>, para la gesti&oacute;n de usuarios. Todo esto sustituye a la entrada <i>Settings</i> del men&uacute; principal.
		 <br>
		 <br>
		    <IMG src="./../../common/March1998/kdecc.gif" alt="[Centro de Control KDE]" width=600 height=400 align=center>
		     <p align=center>Imagen del centro de control del KDE.

		  <p> De esta forma al ir pulsando con el rat&oacute;n sobre cada uno de los apartados del &aacute;rbol mostrado en la parte izquierda de la ventana se ir&aacute;n desplegando, permitiendo llegar al punto exacto que queremos configurar. La mayor&iacute;a de los par&aacute;metros modificados pueden ser instalados en el momento, mediante la tecla Aplicar, siendo pocos los casos en los que tendremos que volver a ejecutar el gestor para ver los resultados. Un primer paso para cualquier usuario puede ser, mediante la activaci&oacute;n de la opci&oacute;n Languaje dentro del men&uacute; Desktop, la elecci&oacute;n del idioma en que queremos que el sistema muestre los mensajes, esto puede hacerse mediante un sencillo men&uacute; mediante el que podemos ubicar hasta tres idiomas diferentes, para el caso que no tengamos instalado el anterior.
		 <p> Si nuestro acceso a Internet es v&iacute;a m&oacute;dem podemos hacer uso del programa kppp, una vez configuradas las opciones t&iacute;picas para nuestro acceso a nuestro ISP (mediante el protocolo ppp :) ), podemos lanzar esta utilidad que nos mantiene informados del estado de la conexi&oacute;n, el tiempo empleado e incluso el coste de las llamadas. Esto se hace mediante la configuraci&oacute;n del pa&iacute;s en el que estamos, por cierto, existe la posibilidad de configurar las tarifas de la conocida red Infov&iacute;a, perteneciente a la empresa espa&ntilde;ola de Telef&oacute;nica S.A.
		 <p> Una vez conectados, y si no tenemos otras utilidades a mano, podemos hacer uso del gestor de correo, lector de news, utilidades de red, etc..  que incorpora el entorno.
		 <br><br>
		    <IMG src="./../../common/March1998/kppp.gif" alt="[KPPP]" width=300 height=200 align=center>
		     <p align=center>Ventana principal del kppp.
		 <p> Compilando e instalado el software desde los fuentes, como ha sido mi caso, se observa como existe en el men&uacute; principal una entrada etiquetada como <i>"non-KDE Apps"</i>, de esta forma se han incorporado (o se ha intentado) todas las utilidades que ya ten&iacute;amos anteriormente instaladas y que est&aacute;n destinadas al entorno gr&aacute;fico. De no ser as&iacute;, existe la posiblidad de invocar al programa "kappfinder", que buscar&aacute; las utilidades mas comunes dentro del entorno gr&aacute;fico para realizar esta labor.
		 <p> En la parte izquierda de la pantalla, aparecen los iconos de la papelera (sin comentarios), el de Plantillas (<i>Templates</i>) para la definici&oacute;n de accesos directos a dispositivos, direcci&oacute;nes de internet, etc. y la carpeta <i>Autostart</i> en la que podemos incluir cualquier elemento que deseamos que se ejecute en el arranque del entorno (incluyendo en &eacute;sta cualquier definici&oacute;n de tipo '.kdelnk' que hayamos definido). Adem&aacute;s podemos a&ntilde;adir cualquier acceso directo que deseemos, sirva por ejemplo mi caso en el que he creado uno a un dispositivo ZIP externo con los siguientes pasos:
		    <ul>
		    <li> Escogemos en el men&uacute; del escritorio (bot&oacute;n derecho del rat&oacute;n) un nuevo dispositivo (<i>Device</i>).
		    <li> Aparece una ventana como la siguiente e introduciremos zip.kdelnk
		      <br><br>
		      
		      <IMG src="./../../common/March1998/newdevice.gif" alt="[Creaci&oacute;n de un acceso directo]" width=400 height=150 align=center>
		     <br><br>
		    <li> Se nos crear&aacute; un icono en el que tendremos dos posibilidades, editar sus propiedades o escoger <i>Open with</i> con lo que con nuestro editor podemos modificar el dispositivo, punto de montaje, y otras propiedades. Decir que el kde lleva por defecto unas plantillas para cada uno de los accesos directos que queremos crear, por lo que en ocasiones no se ajustar&aacute; a nuestras necesidades y tendremos que hacer el trabajo editando directamente el fichero como es en este caso. Esta es la ventana de propiedades del acceso directo:
		      <br><br>
		     <IMG src="./../../common/March1998/newdevice2.gif" alt="[Creaci&oacute;n de un acceso directo]" width=500 height=400 align=center>
		      <br><br>
		      </ul>
		  <p> Al salir del entorno el mismo intentar&aacute; guardar el estado del mismo a fin de poder restaurarlo tal y como lo tenemos en una pr&oacute;xima invocaci&oacute;n, present&aacute;ndonos un men&uacute; que muestra las utilidades que kde puede restaurar completamente y aquellas de las que se pueden perder datos. Esta opci&oacute;n tambi&eacute;n existe en el WINDOWMAKER (tratado en un pr&oacute;ximo apartado) mediante la grabaci&oacute;n de la sesi&oacute;n.

		 <p> Finalmente decir que la navegaci&oacute;n o trabajo diario con este entorno es muy sencillo, podemos configurar la parte superior para que contenga una serie de botones de todas las aplicaciones activas, as&iacute; como en n&uacute;mero de paneles virtuales que necesitemos, de esta forma podemos movernos f&aacute;cilmente entre ellas, si optamos por el teclado esto se hace mediante la combinaci&oacute;n de teclas &lt;Ctrl&gt;/&lt;Alt&gt; + &lt;Tab&gt;. Incluso una sencilla terminal (<i>kvt</i>) puede ser configurada desde su men&uacute; principal para modificar su tipo y tama&ntilde;o de fuente as&iacute; como los colores del fondo y del texto, si deseamos dejar esta ventana fija en nuestra pantalla s&oacute;lo tendremos que pulsar con el rat&oacute;n sobre el icono mostrado en la parte superior izquierda de la ventana, a modo de "chincheta".
		    
		     <br>
		 <br>
		    <IMG src="./../../common/March1998/kvt.gif" alt="[Men&uacute; Termianl del KDE]" width=200 height=200 align=center>
		     <p align=center>Men&uacute; de opciones del Terminal del KDE (<i>kvt</i>).

		 <p> Estas y otras muchas posibilidades nos ofrece este entorno de trabajo, para m&aacute;s informaci&oacute;n no dejar de consultar la propia ayuda del programa, aunque como ya he dicho, salvo excepciones todo puede hacerse muy intuitivamente y tener en poco tiempo todo configurado a nuestro gusto. 

		    <H4><FONT face="Helvetica,Arial" color="#660033">LA LIBRERIA QT, FUENTE DE DISCORDIAS.</FONT></H4>
		  <p> El que se haya escogido esta liber&iacute;a para el desarrollo de este entorno ha sido, seg&uacute;n los integrantes de esta iniciativa, debido al bajo consumo de recursos del sistema y a la consistencia obtenida. Este aspecto ha creado no poca pol&eacute;mica debido a que la licencia de esta librer&iacute;a permite el desarrollo de software siempre que &eacute;ste se distribuya libremente, s&oacute;lo hay que pagar para el desarrollo de software comercial, a diferencia de nuestra archiconocida GNU/GPL. 
		  <p> Cualquier usuario puede obtener el c&oacute;digo fuente de las mismas, documentaci&oacute;n y multitud de ejemplos y, para este caso, disfrutar de este entorno gr&aacute;fico, pero parece ser que la empresa se guarda algunos derechos sobre la propiedad intelectual de la misma, la pol&eacute;mica esta servida ... Algunos usuarios no ven mal que una empresa utilice esta pol&iacute;tica para distribuir sus productos, e incluso han optado por desarrollar software de dominio p&uacute;blico con la misma, considerando factores aparte de la licencia como: facilidad de desarrollo con la misma, conocimientos de lenguaje C++ (aunque puede utilizarse el C), el estado de desarrollo en el que se encuentra, etc. Otros ven en esto una clara pol&iacute;tica de que, en cuanto la librer&iacute;a se encuentre en un estado mejor (quiz&aacute; una posible versi&oacute;n 1.4), dejar&aacute; de ser de dominio p&uacute;blico para hacernos pagar a todos, aprovechando esta empresa el esfuerzo de la comunidad de LINUX. <i>NOTA</i>: La licencia de la QT afirma que siempre habr&aacute; una versi&oacute;n libre para X Window.
		  <p> Realmente lo &uacute;nico que se puede afirmar con seguridad es que hasta la versi&oacute;n 1.32 de la misma las cosas siguen por el mismo camino, dominio p&uacute;blico para lo que ser&aacute; de dominio p&uacute;blico y comercial para desarrollos de este tipo. Nadie puede adivinar las intenciones de esta empresa, desde luego, pero "a priori" no se puede desmerecer el trabajo realizado y hoy por hoy es una seria opci&oacute;n para el desarrollo de aplicaciones para el entorno gr&aacute;fico de LINUX. Otras voces abogan por la conversi&oacute;n de este entorno a otra librer&iacute;a, como por ejemplo la <A href="http://www.gimp.org/gtk">GTK</A> o incluso el desarrollo de una liber&iacute;a QT totalmente libre (LGPL).
		  <p> Personalmente creo que conseguir desde cero una liber&iacute;a similar a la QT de dominio p&uacute;blico es una tarea costosa en tiempo y personas y, sin &aacute;nimo de ofender, creo que el estado actual de la liber&iacute;a GTK no permite su utilizaci&oacute;n plena con este entorno, aunque tambien es cierto que si se apostara por esta posibilidad podr&iacute;an evolucionar ambos proyectos a la par. Posibilidades hay muchas y no me gustar&iacute;a vivir un desgaste de recursos y esfuerzos debido a este tipo de "batallas". El estado en el que se encuentra el KDE es envidiable y es un firme candidato para ser un entorno gr&aacute;fico est&aacute;ndar para LINUX, de echo los encargados de la distrubuci&oacute;n <A href="http://www.suse.de">SUSE</A> han apostado por &eacute;ste y lo van a incorporar a la misma.
		  

		    

		    

           <H3><FONT face="Helvetica,Arial" color="#660033">WINDOWMAKER & AFTERSTEP</FONT></H3>
	     <A name="section4"></A>
           <p> Mi intenci&oacute;n inicial consist&iacute;a en escribir unas l&iacute;neas sobre mi gestor de ventanas actual, AfterStep, hasta que recientemente he entrado en contacto con el proyecto del Windowmaker. No lo he podido confirmar pero parece ser que ambas iniciativas van a converger (o lo han hecho) en una sola, el Windowmaker es una evoluci&oacute;n del AfterStep o si &eacute;ste &uacute;ltimo ya se encuentra abandonado con una &uacute;ltima versi&oacute;n 1.3. De echo el coordinador del proyecto Windowmaker (Alfredo K. Kojima) es uno de los autores del AfterStep.  De todas formas considero que pueden tratarse ambos en paralelo para ver las similitudes entre ambos que el lector podr&aacute; observar.
          <p> AfterStep es una evoluci&oacute;n del twm, como muchos otros gestores de ventanas. Para m&aacute;s datos el twm sirvi&oacute; de base para el fvwm que, a su vez, dio origen al BowMan (de Bo Yang) que es la base del AfterStep (uff!! :) ). La idea original consiste en emular el <i>"look and feel"</i> del NEXTSTEP. Dejo como ejercicio al lector que aplique todo este &aacute;rbol geneal&oacute;gico al WindowMaker ;).
	  <p> La instalaci&oacute;n (del Windowmaker) resulta muy sencilla, no se necesitan librer&iacute;as adicionales fuera de las que podamos tener instaladas, algo muy de agradecer, y todo lo necesario viene en el propio paquete con el c&oacute;digo fuente. Lo &uacute;nico a destacar en este proceso es que hay que compilar e instalar la librer&iacute;a (siento la peque&ntilde;a "mentira" anterior) libPropList antes de nada y que una vez compilado e instalado el software y los pixmaps que lo acompa&ntilde;an (WindowMaker-data-tar.gz). Para acabar de instalarlo hay que invocar el fichero "wmaker.inst" que modificar&aacute; convenientemente nuestro fichero $HOME/.xinitrc para que se ejecute el gestor de ventanas y crear&aacute; el directorio $HOME/GNUsttep que contiene los ficheros de configuraci&oacute;n del entorno, por lo que hay que tener en cuenta los ficheros .xinitrc o .Xclients que podamos tener configurados en nuestro directorio de trabajo.
	   <p> Una vez arrancado aparece un fondo azul y una simple terminal, nada inusual para la persona familiarizada con AfterStep, de echo la confgiuraci&oacute;n de las teclas del rat&oacute;n nos permite desplegar un men&uacute; (bot&oacute;nm derecho del rat&oacute;n) para ejecutar cualquier aplicaci&oacute;n incluida (y que tengamos instalada, claro!!) y movernos a trav&eacute;s de los distintos paneles (bot&oacute;n central del rat&oacute;n). Decir que estoy escribiendo estas l&iacute;neas desde este gestor de ventanas debido a mi ya mencionada familiaridad con el AfterStep. 
		    <br><br>
		    <IMG SRC="../../common/March1998/wm.gif" alt="[Pantalla del Windowmaker]" width=600 height= 400 align=center>
		    <p align=center>Pantalla del Windowmaker.
<br><br>
	   <p> Las ventanas pueden enrrollarse pulsando dos veces sobre la barra de la misma, cambiar su tama&ntilde;o pulsando sobre la parte inferior de las mismas y ampliarse a tu tama&ntilde;o m&aacute;ximo mediante la combinacion de teclas Control+Shift+Bot&oacute;n izquierdo del rat&oacute;n dos veces, car&aacute;cter&iacute;stica que con el AfterStep se realizaba mediante la pulsaci&oacute;n con el bot&oacute;n derecho del rat&oacute;n sobre la barra principal de la ventana.
	   <p> Pulsando sobre esta zona con el bot&oacute;n dereco del rat&oacute;n obtenemos un men&uacute; como el que se muestra en la figura. Esto permite configurar las caracter&iacute;stcias de la misma desde una serie de opciones, en vez de navegar por los distintos ficheros de configuraci&oacute;n implicados.
		    <br><br>
		    <IMG SRC="./../../common/March1998/wmmenu.gif" alt="[Men&uacute; para las ventanas]" align=center>
		    <p align=center>Men&uacute; para las ventanas.
		    <br><br>
	   <p> Quiz&aacute; la opci&oacute;n m&aacute;s interesante es la entrada <i> Atributes...</i> que permite configurar las propiedades de la ventana, opciones como si deseamos mantenerla en primer plano en todo momento, no permitir en iconizarla, respecto al "focus", el icono que deseamos que la represente, etc.
		    <br><br>
		    <IMG SRC="./../../common/March1998/wmattr.gif" alt="[Configuraci&oacute;n de las ventanas]" align=center>
		    <p align=center>Configuraci&oacute;n de las ventanas..
		    <br><br>
	  <p> Otra novedad respecto al AfterStep es la de a&ntilde;adir iconos a la parte derecha de la pantalla a modo de accesos directos de una forma totalmente manual, esto es, arrastrando dicho icono hasta la parte inferior del anterior con lo que podemos tener en este formato aquellas aplicaciones que ejecutamos m&aacute;s usualmente, aunque curiosamente no he conseguido a&ntilde;adir un icono para el xemacs de esta forma :(.

	  <p> Si lo que deseamos es configurar el gestor desde los m&uacute;tiples ficheros de configuraci&oacute;n que existen, hay que acudir al manual existente en formato postcript. No est&aacute;n documentadas todas las caracter&iacute;sticas del gestor pero la parte final explica muy bien la sintaxis a utilizar y las posibilidades son muy extensas. Esta ha sufrido un cambio significativo respecto de su antecesor <i>.steprc</i> por lo que recomiendo un vistazo a esta documentaci&oacute;n. La misma explica desde el simple uso del gestor hasta la personalizaci&oacute;n del mismo abundando en ejemplos de combinaciones de teclas para obtener los resultados deseados sin tener que acudir al rat&oacute;n. En este caso considero que un factor importante en este gestor de ventanas es la sencillez de uso y la b&uacute;squeda de la productividad m&aacute;xima, debido al escaso uso de recuros que hace y la posibilidad de usarlo todo desde el teclado. Aunque no puedo avalarlo con datos objetivos pero podr&iacute;a afirmar que parece m&aacute;s r&aacute;pido que el kde y su hermano menor.

		    <p> En el caso del AfterStep exite la utilidad ascp (<i>AfterStep Control Panel</i>), en su versi&oacute;n 0.8 destinada a ayudarnos en la tarea de personalizar el entorno. 
		    <br><br>
		    <IMG SRC="./../../common/March1998/ascp.gif" alt="[Panel de Control del AfterStep]" align=center>
		    <p align=center>Panel de Control del AfterStep.

		  
	 <p> Como conclusi&oacute;n decir que nos encontramos ante buen gestor de ventanas y que para los usuarios de AfterStep puede considerarse como el siguiente paso en el mismo. Quiz&aacute; no he podido explicar ni expotar todas sus posibilidades, pero podr&iacute;a ser un serio candidato para cualquier m&aacute;quina que no disponga de excesivos recursos y necesite un gestor de ventanas r&aacute;pido y sencillo de manejar. La &uacute;nica dificultad intr&iacute;nseca al mismo, es el tener que editar los ficheros de configuraci&oacute;n si queremos personalizarlo al m&aacute;ximo, pero no creo que presente mayor problema para cualquier usuario, con un m&iacute;nimo conocimiento de ingl&eacute;s y de LINUX :).

           
	  <H3><FONT face="Helvetica,Arial" color="#660033">GNOME. NO PUDO SER :(.</FONT></H3>
	     <A name="section5"></A>	    
		  <p> Siento el tener que terminar este art&iacute;culo con malas noticias. Mi objetivo era abordar el proyecto GNOME y ver su estado actual (m&aacute;xime despu&eacute;s del anuncio por parte de la empresa Red Hat y de la comunidad DEBIAN de su inter&eacute;s por este proyecto). Con este fin obtuve de su p&aacute;gina principal los ficheros necesarios (gnome-0.12.tar.gz y otros) adem&aacute;s de la librer&iacute;a GTK (veris&oacute;n 0.99.2).
		  <p> Para los no iniciados simplemente comentar que la librer&iacute;a GTK es en la que se basa el archi-conocido GIMP, software de dise&ntilde;o gr&aacute;fico de dominio p&uacute;blico por excelencia en LINUX. Aprovechando esta idea ha ido evolucionando con el fin de obtener una librer&iacute;a de desarrollo para X Window totalmente libre y en la que se basa el GNOME para funcionar.
		  <p> En un primer momento he de decir que me desconcert&oacute; el no encontrar ayuda alguna sobre el tema, a pesar de mi b&uacute;squeda no la he encontrado y la existente es muy pobre. Realmente no sab&iacute;a que hacer con los paquetes, en qu&eacute; orden instalarlos, si era necesario alg&uacute;n par&aacute;metro especial, etc... Lo primero que hice, guiado por mi intuici&oacute;n, fue instalar y compilar todos los paquetes excepto el principal, por si eran un pre-requisito. El  paquete que m&aacute;s problemas me ha dado es el "slib", aunque creo que finalmente lo instal&eacute;.
 
		  <p> Tras los primeros intentos obtuve la ayuda alguien de la lista de LINUX a la que estoy suscrito, dici&eacute;ndome que optara por la gtk versi&oacute;n 0.99.3. Bien, obtengo el parche necesario para actualizar la m&iacute;a y cuando lo instalo y voy a recompilarla, obtengo un mensaje de error debido a que &iexcl;no encontraba el Emacs!. Existe un peque&ntilde;o script que invoca al Emacs para compilar un fichero generado en Lisp (ranlisp), pude modificarlo poniendo "xemacs" en su lugar y todo fue bien, ya que utilizo esta implementaci&oacute;n del programa.

		  <p> Tambien averig&uuml;&eacute; que tambi&eacute;n necesitaba tener instalado el compilador de Objective C porque alg&uacute;n fichero lo necesita &iquest;no es as&iacute;?.
		  <p> En fin, por lo que he podido apreciar, y teniendo en cuenta mis limitaciones, que las tengo, el estado del proyecto est&aacute; todav&iacute;a muy en sus primeros pasos, quiz&aacute; est&aacute; concebido de momento s&oacute;lo para desarrolladores, aunque tampoco he encontrado referencia alguna a si era "Alpha" o "Beta" la versi&oacute;n que estaba obteniendo. Tampoco entiendo si est&aacute; bien pensado el utilizar C, C++, Objective C, Lisp, Scheme, etc... &iquest;deber&aacute; conocer el usuario de gnome todo esto para poder utilizarlo?, &iquest;donde habr&eacute; errado?.

		  <p> Actualmente, es justo mencionarlo, estoy recibiendo mensajes con sugerencias de usuarios sobre mis problemas de instalaci&oacute;n pero, a pesar de que pueda hacerlo funcionar, creo que no ser&iacute;a justo el abordarlo en el momento de la redacci&oacute;n de este art&iacute;culo. En este momento el tiempo es un factor determinante y deseo dedicarle el tiempo necesario para poder hacerlo mejor.

		  <p> De todas formas aprovecho para manifestar MI OFRECIMIENTO para, cuando solucione estos problemas, abordar este proyecto en un pr&oacute;ximo art&iacute;culo, o invitar a cualquier persona que lo haya conseguido a ponerse en contacto conmigo para poder llevar a buen fin el que LINUXFocus sea la primera publicaci&oacute;n en tener un art&iacute;culo sobre el GNOME, Animo!!! :).

<H3><FONT face="Helvetica,Arial" color="#660033">EP&Iacute;LOGO.</FONT></H3>
	     <A name="section6"></A>	    
		    <p> Estre art&iacute;culo ha tratado de arrojar un poco de luz sobre el tema de las diferentes alternativas existentes en LINUX para hacer que nuestro trabajo diario sea m&aacute;s f&aacute;cil. Por lo que he podido observar todos los trabajos son muy buenos y considero que "en la variedad est&aacute; el gusto".
		    <p> Espero, asimismo, haber arrojado un poco de luz sobre el controvertido tema de las librer&iacute;as implicadas en cada uno de los entornos mencionados, no ha sido ni es mi &aacute;nimo el adoctrinar al lector sobre el tema y he tratado de ser lo m&aacute;s imparcial posible, explicando para cada caso la situaci&oacute;n actual o <i>"state of the art"</i> del mismo. Reitero mis disculpas si alg&uacute;n lector se ha podido considerar ofendido por alguna de mis afirmaciones.
		    <p> En fin, desde estas l&iacute;neas UN APLAUSO merecido a todas las iniciativas y a toda la gente que est&aacute; contribuyendo a que LINUX, adem&aacute;s de funcinar como funciona :), sea m&aacute;s "bonito" tanto para veteranos como para nuevos usuarios. 

 <H3><FONT face="Helvetica,Arial" color="#660033">ANEXO: LESSTIF. &iquest;LA GRAN OLVIDADA?</FONT></H3>
	     <A name="section7"></A>
		  <p> No puedo pasar por alto un hecho que me ha llamado la atenci&oacute;n. En todo este trabajo de investigaci&oacute;n no he encontrado ni un solo entorno que se base en esta librer&iacute;a (exceptuando el mwm que no trato en este art&iacute;culo y que se supone incorporado en todas las versiones de Motif). &iquest;Existe una implementaci&oacute;n totalmente LGPL de la liber&iacute;a OSF/Motif a la cual, para este aspecto, no se le ha hecho caso?. &iquest;Porque?. 
		  <p> Por lo que el autor ha podido constatar existe un "cierto rechazo" entre la comunidad LINUX a todo lo que no est&eacute; bajo licencias del tipo GNU/GPL, tambi&eacute;n es cierto que quiz&aacute; esta librer&iacute;a no ofrezca todas las capacidades que un entorno puede necesitar, su estado de desarrollo no sea el necesario, etc... (aunque de todo esto podr&iacute;a discutirse extendidamente), pero existiendo el entorno CDE que, parece ser, va a convertirse en el est&aacute;ndar "de facto" dentro de los entornos para los diferentes UNIX, &iquest;porque no un CDE basado en esta librer&iacute;a?. 
		  <p> Una vez anunciado por parte de <A href="http://www.netscape.com">Netscape</A> la disponibilidad del c&oacute;digo fuente de su navegador en la versi&oacute;n 5.0 (bajo una licencia de dominio p&uacute;blico), &iquest;podr&aacute;n los usuarios de LINUX utilizar esta librer&iacute;a para compilar este programa?, si esto es as&iacute; considero que ser&aacute; una buena noticia para los desarrolladores y usuarios de la misma.
		  <p> Desconozco la respuesta a todos estos interrogantes, pero creo que existen ya m&uacute;ltiples aplicaciones que pueden aprovechar las caracter&iacute;sticas de Lesstif y que, con el apoyo de los usuarios y desarrolladores, podr&iacute;a prosperar m&aacute;s y convertirse en una seria alternativa a las implementaciones comerciales.
      <br><br>

          </TD>
        </TR>
	 </TABLE>

     <HR size=2 noshade>


    </TD>

 </TR>

 </TBODY>

<TBODY>
  <TR>
    <TD colspan="2">
    <B>Para m&aacute;s informaci&oacute;n:</B>:<BR>
    <UL>
      <LI>KDE <A href="http://www.kde.org">http://www.kde.org</A>. </LI>
      <LI>GNOME <A href="http://www.gnome.org">http://www.gnome.org</A>.</LI> 
      <LI>LESSTIF <A href="http://www.lesstif.org">http://www.lesstif.org</A>.</LI> 
      <LI>WINDOWMAKER <A href="http://www.windowmaker.org">http://www.windowmaker.org</A></LI>
      <LI>AFTERSTEP <A href="http://www.cs.purdue.edu/homes/zamboni/afterstep/FAQ.html">http://www.cs.purdue.edu/homes/zamboni/afterstep/FAQ.html</A></LI>
      <LI>TKSTEP <A href="http://rhein-zeitung.de/~ograf/wm/">http://rhein-zeitung.de/~ograf/wm/</A></LI>
	 
     <UL><BR><BR>
    <TD>
  </TR>
</TBODY>

 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 JOSE MANUEL LAVEDA MOLINA</B></FONT><BR>
    <FONT color="#ffffff">This website is mantained by 
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>



</TABLE>


</BODY>
</HTML>






