<HTML>
<HEAD>
<TITLE>NT OS Loader + Linux mini-COMO: ¿C&oacute;mo instalar Windows NT y Linux en el mismo sistema? </TITLE>
</HEAD>
<BODY>
<A HREF="Linux-NT-Loader-1.html">Anterior</A>
<A HREF="Linux-NT-Loader-3.html">Siguiente</A>
<A HREF="Linux-NT-Loader.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. ¿C&oacute;mo instalar Windows NT y Linux en el mismo sistema? </A></H2>



<H2><A NAME="ss2.1">2.1 Instalaci&oacute;n de Windows NT </A></H2>


<P>Intente instalar Windows NT primero. Si quiere utilizar NTFS para su
partici&oacute;n de Windows NT, adelante, pero recuerde que la
versi&oacute;n de Linux no puede acceder a este tipo de particiones
<SL>N. del T.:<BR>
actualmente, las versiones m&aacute;s recientes del n&uacute;cleo s&iacute; lo permiten</SL>
.
Una version alfa del controlador que permite acceder a las particiones
NTFS est&aacute; disponible en
<CODE>
<A HREF="http://www.informatik.hu-berlin.de/~loewis/ntfs">http://www.informatik.hu-berlin.de/~loewis/ntfs</A></CODE> . Usted puede
crear una partici&oacute;n FAT separada para intercambiar datos, y
puede usar disquetes con formato DOS.</P>


<H2><A NAME="ss2.2">2.2 Particionando</A></H2>


<P>Otro Mini-como recomienda no usar el <CODE>"Administrador de discos"</CODE> 
de NT para
crear las particiones de Linux (tanto la principal como la de intercambio).
Es suficiente con dejar el espacio libre por el momento. Tambi&eacute;n se
recomienda utilizar el <CODE>fdisk</CODE> de Linux despu&eacute;s.</P>


<H2><A NAME="ss2.3">2.3 Instalaci&oacute;n de Linux </A></H2>


<P>Arranque Linux desde disquetes, y cree la partici&oacute;n de intercambio y
la principal. <CODE>Fdisk</CODE> considera que la partici&oacute;n NTFS es una
partici&oacute;n HPFS. Esto es normal. Arranque de nuevo con disquetes e
instale Linux como prefiera. </P>
<P>En caso de que el procedimiento de instalaci&oacute;n le sugiera montar la partici&oacute;n 
HPFS que se ha encontrado, responda que no.</P>


<H2><A NAME="ss2.4">2.4 Lilo</A></H2>


<P>Cuando llegue a la secci&oacute;n de <CODE>Lilo</CODE>, elija la partici&oacute;n Linux
como dispositivo de arranque, porque el Registro Maestro de Arranque (MBR)
de su disco duro est&aacute; ocupado por Windows NT. Esto significa que
los valores <CODE>root</CODE> y <CODE>boot</CODE> del fichero
<CODE>/etc/lilo.conf</CODE> tendr&aacute;n el mismo valor. Por ejemplo, si usted
tiene un disco IDE y su partici&oacute;n Linux es la segunda partici&oacute;n, la
entrada <CODE>boot</CODE> en <CODE>/etc/lilo.conf</CODE> ser&aacute;: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
boot=/dev/hda2
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En cambio, si tiene dos discos duros y la partici&oacute;n Linux es la
primera del segundo disco, tendr&aacute;: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
boot=/dev/hdb1
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ejecute <CODE>lilo</CODE> con un n&uacute;cleo adecuado para su sistema. Compruebe el
n&uacute;cleo arrancando primero desde un disquete si no est&aacute; seguro. </P>
<P>Si usted no puede arrancar con Windows NT ahora, tiene un problema. Espero que
haya creado un disco de rescate recientemente. </P>


<HR>
<A HREF="Linux-NT-Loader-1.html">Anterior</A>
<A HREF="Linux-NT-Loader-3.html">Siguiente</A>
<A HREF="Linux-NT-Loader.html#toc2">Indice</A>
</BODY>
</HTML>
