<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges     Tarbouriech     
 =LF=CAT___: System Administration
 =LF=TITLE_: C&oacute;mo asegurar una red heterogenea usando herramientas libres
 =LF=NUMBER: 245
 =LF=ANAME_: article245.shtml
 -->
 <TITLE>lf245, System Administration: C&oacute;mo asegurar una red heterogenea usando herramientas libres</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Georges-Tarbouriech.jpg" width=
    "115" height="124" alt="Georges Tarbouriech">
<BR>por  Georges Tarbouriech  <br> <small>&lt;georges.t(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Georges es un viejo usuario de Unix. El agradece a la comunidad del
Software Libre por proporcionarnos muchas valiosas herramientas de seguridad.
    </P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Leo Trujillo  (<a href="http://www.10lineas.com/leo/"><font size="1">homepage</font></a>)
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#245lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#245lfindex1">Presentaci&oacute;n</A></LI>
  <LI><A HREF="#245lfindex2">Ejemplo de una red heterog&eacute;nea</A></LI>
  <LI><A HREF="#245lfindex3">Herramientas y c&oacute;mo usarlas</A></LI>
  <LI><A HREF="#245lfindex4">Protegiendo la Red</A></LI>
  <LI><A HREF="#245lfindex5">Systems particularity</A></LI>
  <LI><A HREF="#245lfindex6">La intolerante ligereza de las cosas</A></LI>
  <LI><A HREF="#245lfindex7">&iexcl; Esto es todo!</A></LI>
  <LI><A HREF="#245lfindex8">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=245&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>C&oacute;mo asegurar una red heterogenea usando herramientas libres</H2>
 <IMG src="../../common/images/article243/logo-small.gif"  width="45"
height="67" alt="mail" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>Este art&iacute;culo fue publicado primeramente en una publicaci&oacute;n especial de
Linux Magazine France enfocada en la seguridad. El editor, los autores, y
traductores amablemente permitieron que LinuxFocus publique cada art&iacute;culo de
esta edici&oacute;n especial.
    Como consecuencia, LinuxFocus le brindar&aacute; a usted dichos art&iacute;culos tan
pronto como est&eacute;n disponibles en Ingl&eacute;s. Gracias a toda la gente involucrada en
este trabajo.
    Este resumen se reproducir&aacute; por cada art&iacute;culo que tenga el mismo origen.
    </P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="245lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

<p>
La seguridad en las redes de computadoras es probablemente uno de los m&aacute;s
grandes retos de este siglo 21.
<br>
Sin embargo, como en muchos temas de interes, todo mundo habla sobre esto, pero
los que deber&iacute;an de sentirse m&aacute;s afectados no parecen haber detectado la escala
potencial de desastre. Los "m&aacute;s afectados" naturalmente, son los principales
editores de software o de sistemas. El mejor ejemplo, de nuevo, viene de
Redmond, donde la seguridad parece ser un mundo, por lo menos mucho menos "bajo
control" que el marketing, por ejemplo.
<br>
Afortunadamente, en las dos &uacute;ltimas d&eacute;cadas del siglo 20 hemos visto el
nacimiento del Software Libre (Free Software) y la filosof&iacute;a que viene con &eacute;l.
Si usted "desea" mejorar la seguridad de sus m&aacute;quinas, sus sistemas, sus
redes... aqui es donde usted tendr&aacute; que buscar. La comunidad del Software Libre
ha hecho mucho m&aacute;s acerca de la seguridad que todos los grandes editores juntos.
<br>
Ya se ha dicho, las herramientas no lo hacen todo, y la seguridad de una red,
por ejemplo, es casi un trabajo permanente : &iexcl; todo cambia en todo momento !
<br>
Esto significa que usted nunca ser&aacute; capaz de decir que una red es 100% segura.
Puede solamente reducir los riegos. Lo que mostramos aqu&iacute;, es solamente una
peque&ntilde;a parte de lo que puede hacer para reducir los riesgos. Despu&eacute;s de leer
esta edici&oacute;n especial (Nota del Autor : recuerde, este art&iacute;culo era parte de la
edici&oacute;n especial de Linux Magazine France enfocada a la seguridad), conocer&aacute; un
poco m&aacute;s acerca de la seguridad, pero de ninguna manera podr&aacute; decir que su red
es segura. Usted ya est&aacute; advertido.
<br>
Por &uacute;ltimo pero no menos importante : un art&iacute;culo jam&aacute;s ser&aacute; exhaustivo. Hay
mucha literatura sobre el tema y se est&aacute; lejos de tener resuelto el problema.
Por tanto, no espere que este art&iacute;culo mencione todo, en relaci&oacute;n a Sistemas
Operativos, herramientas, configuraci&oacute;n, uso... que son de inter&eacute;s.
<br>
Para finalizar esta introducci&oacute;n, a&ntilde;adimos que algunas partes de este art&iacute;culo
son prestados de LinuxFocus, pero no se preocupe, con el consentimiento de los
autores.
</p>
<A NAME="245lfindex1">&nbsp;</A>
<H2>Presentaci&oacute;n</H2>

<p>
Primero, hablaremos acerca de la estructura de una red muy heterogenea,
conteniendo sistemas m&aacute;s o menos extendidos. Mientras m&aacute;s Sistemas Operativos,
mayor es la complejidad, ya que estos sistemas no son iguales al frente de la
adversidad... Adem&aacute;s, las m&aacute;quinas usadas como servidores deber&iacute;an tener
distintas funciones en la red : trataremos de diversificar sus asignaciones.
<br>
Siguiente, trataremos un rango de herramientas esenciales para mejorar la
seguridad. La elecci&oacute;n ser&aacute; arbitraria : hay demasiadas herramientas para
siquiera mencionarlas a todas ellas.
Obviamente, explicaremos c&oacute;mo asegurar las m&aacute;quinas y las redes con estas
herramientas.
El siguiente cap&iacute;tulo repasar&aacute; las caracter&iacute;sticas de diferentes sistemas
durante la etapa de seguridad.
<br>
La conclusi&oacute;n tratar&aacute; de explicar la "relatividad" de los procesos de seguridad,
para mostrar c&oacute;mo el camino es largo, sin "sumergirse" dentro de la futurolog&iacute;a.
</p>
<A NAME="245lfindex2">&nbsp;</A>
<H2>Ejemplo de una red heterog&eacute;nea</H2>

<p>
Como una primer ventaja, el protocolo TCP/IP es "hablado"  por todos los
Sistemas Operativos en la Tierra.
As&iacute;, cada sistema diferente es capaz de comunicarse con otros, para
intercambiar. Conforme a la red que usaremos como ejemplo, TCP/IP siempre estar&aacute;
presente. En otras palabras, no mencionaremos los protocolos propietarios, los
menos extendidos u obsoletos. Ni hablaremos de la estructura f&iacute;sica, es decir el
tipo de conecci&oacute;n, la categor&iacute;a, etc.<br>
Entonces, en esta red, pondremos un poco de todo. Claro esta, encontraremos
Unix, proprietario o Libre : por ejemplo, un poco de Solaris 2.6, o SunOS 5.6,
si prefiere, un poco de Irix 6.5, Linux (RH 6.2), MacOS X. Podriamos agregar un
poquito de QNX o NeXTSTEP,  NetBSD o OpenBSD. Del lado "convencional"
incluiremos el &uacute;nico y solitario No Terminado 4.0 (Not Terminated) (no, no es
cualquier otro, pero son los peores). Aqu&iacute; tambi&eacute;n, podr&iacute;amos agregar OS2 el
cual es el menos peor. Por &uacute;ltimo, agregaremos un poco de esos "no
convencionales", digamos que BeOS y AmigaOS (s&iacute;, a&uacute;n existen... bueno, &iexcl; no
muchos realmente !)<br>
Como no, algunos de ustedes se quejar&aacute;n : y, &iquest; no hay AIX, ni HP-UX ? &iexcl; No !
Si nosotros pudieramos mencionar cada Unix, tendr&iacute;amos un art&iacute;culo de 10
vol&uacute;menes.
No obstante, las reglas de la seguridad b&aacute;sica son aplicables a todos los
sistemas.
</p>
<p>
Ahora, &iquest; qu&eacute; indagaremos acerca de ellos ?<br>
Por ejemplo, diremos que Solaris ser&aacute; un servidor de aplicaciones. Irix
administrar&aacute; los respaldos. NT ser&aacute; otro servidor de aplicaciones. Linux sera un
gateway.
Otra instalaci&oacute;n Linux ser&aacute; un servidor http o un servidor de base de datos. Y
todas las dem&aacute;s m&aacute;quinas ser&aacute;n clientes. Consideraremos que esta red contiene
cerca de 30 m&aacute;quinas usando autentificaci&oacute;n de archivos. Podriamos haber
seleccionado una autentificaci&oacute;n m&aacute;s sofisticada : NIS (p&aacute;ginas amarillas) o
LDAP o Kerberos...
&iexcl; Hagamos las cosas simples ! Tampoco usaremos NFS. A&uacute;n si pudiera ser &uacute;til,
cuando la seguridad es una preocupaci&oacute;n, lo mejor es olvidarlo, a pesar de
algunas mejoras.
En Francia, la gente mayor, acostumbra decir "no pongas todos los huevos en la
misma cesta". Luego, los "inciertos" pero necesarios, servicios o protocolos
estar&aacute;n presentes una &uacute;nica vez, en m&aacute;quinas que no hacen nada m&aacute;s que eso...
Por ejemplo, un &uacute;nico servidor ftp, un servidor http, preferentemente en
m&aacute;quinas Unix. Algunas m&aacute;quinas Unix ser&aacute;n servidores SSH mientras que otras
ser&aacute;n clientes SSH. Retornaremos a esto m&aacute;s tarde. Usaremos direcciones IP
est&aacute;ticas : y no DHCP. En otras palabras, &iexcl; nos quedaremos en lo b&aacute;sico !
Esto, claro esta, puede ser aplicado a una red de 50 m&aacute;quinas : con muchas m&aacute;s
m&aacute;quinas, esto podr&iacute;a ser una pesadilla.
</p>
<A NAME="245lfindex3">&nbsp;</A>
<H2>Herramientas y c&oacute;mo usarlas</H2>

<p>
Como es usual, siempre hay m&aacute;s de una manera de hacerlo (TIMTOWDI). El caso
ideal ser&iacute;a iniciar desde cero, con m&aacute;quinas para instalar y una red para
configurar. Pero &iexcl; esto solo es cierto en las pel&iacute;culas ! Consecuentemente,
consideraremos una red ya existente, con m&aacute;quinas que se mueven de un lugar a
otro, la llegada de otra nuevas, etc. Debido a la "velocidad" en Mhz, por
ejemplo, hoy las m&aacute;uinas Intel no duran mucho.
Despu&eacute;s de cerca de 3 a&ntilde;os, es muy dificil encontrar piezas de repuesto. De esta
manera, usted puede reciclar las m&aacute;quinas a la sucursal o logra deshacerse de
ellas : &iexcl; esto es triste pero es verdad ! Afortunadamente, algunas otras merecen
ser mejoradas.
No crea que esto en un off topic : un administrador debe mantener en alto la
disponibilidad.
</p>
<strong>Las bases</strong>
<p>
Podr&iacute;amos llamarle "generalidades" al primer paso de el trabajo. Consiste de
eliminar todo lo in&uacute;til de cada m&aacute;quina : lo cual no es una tarea "ligera" !
Cada Sistema operativo, incluido Unix, instalan un increible n&uacute;mero de
servicios, protocolos, que nuca usar&aacute;. La palabra maestra es : &iexcl; echelos a todos
fuera ! Bajo Unix, un simple... una forma es comentar cada cosa en
/etc/inetd.conf. Esto hace tener un poco menos de servicios.
Naturalmente, esto es un poco exagerado, pero en muchas m&aacute;quinas esto es
perfectamente aceptable. Dependiendo de sus necesidades. Bajo Linux y algunos
and otros usted puede tambi&eacute;n usar el comando <I>chkconfig</I> para
desactivar algunos servicios.<br>

Tambi&eacute;n revise en los archivos los SUID/SGID y no vacile en quitar el
bit "culpable"  o en desactivar el programa. Un comando como :
<I>find / -user root -a \( -perm -4000 -o -perm -2000 \) -print</I> le dar&aacute;
la lista de esos archivos. Para remover el bit "s", escriba <I>chmod a-s
nombreprograma</I>.<br>
Remueva los programas "peligrosos" o los que se conozca su "riesgo" : los comandos remotos
tales como rsh, rlogin, rcp... por ejemplo. SSH los reemplazar&aacute; perfectamente a estos.
<br>
Revise los permisos de los directorios como /etc, /var... Entre m&aacute;s restrictivo mejor.
Por ejemplo, un comando como <I>chmod -R 700</I> en el directorio que contiene
los archivos de inicio (/etc/rc.d/init.d en muchos Unixes) no es mala idea.
Las mismas reglas se aplican a todos los sistemas que son parte de la red : elimine lo que no use
o, al menos, desactivelo. Para NT, sientase libre de detener un m&aacute;ximo de
servicios desde el panel de control. Hya muchas "cosas" b&aacute;sicas por hacer
y hay mucha literatura sobre el tema.
</p>
<strong>Las Herramientas</strong>
<p>
Iniciemos con Unix, dado que aqui hay que tomar encuenta reales problemas de
seguridad. Segundo, Hay una gran cantidad de software libre
 de calidad y muchas de ellas trabajan en varios sabores de Unix.
</p>
<p>
Por ahora, trabajaremos en las m&aacute;quinas individuales dado que la seguridad de una red significa,
despu&eacute;s de todo, asegurar estos elementos. La instalaci&oacute;n de estas herramientas es muy b&aacute;sica,
por lo que no perderemos mucho tiempo en este asunto. Sus par&aacute;metros tambi&eacute;n dependen de los
sistemas, lo necesario... Ver&aacute; como aplicar esto a su propio caso.
La primer herramienta requerida es llamada <I>shadow utils</I>. Esto significa encriptac&oacute;n de
passwords. Afortunadamente, es parte de muchas distribuciones Unix. El archivo /etc/shadow
es entonces "creado" desde /etc/passwd.
</p>
<p>
A&uacute;n mejor, <I>PAM</I> (Pluggable Authentication Modules) permite reestringir
a los usarios por servicio. Todo es administrado desde el directorio que contiene los
archivos de configuraci&oacute;n para cada servicio concerniente, usualmente /etc/pam.d. Muchos
servicios pueden ser "manejados" por PAM, tales como ftp, login, xdm, etc, permitiendo al
administrador elegir que derechos para hacer qu&eacute;.
</p>
<p>
La siguiente herramienta que es un deber tener : <I>TCPWrapper</I> . Tambi&eacute;n trabaja en cada sabor de Unix
o casi. Para hacerlo breve, permite reestringir el acceso a los servicios
a algunos hosts. Estos hosts son permitidos o denegados usando estos archivos :
/etc/hosts.allow y /etc/hosts.deny. TCPWrapper puede ser configurado de dos maneras :
ya sea como demonio o selecionandolo en el archivo /etc/inetd.conf. Despu&eacute;s, veremos que
TCPWrapper trabajar&aacute; bien en conjunci&oacute;n con otras herramientas. Usted encontrar&aacute;
TCPWrapper en
<a
href="ftp://ftp.porcupine.org/pub/security">ftp://ftp.porcupine.org/pub/security</a>
</p>
<p>
Otra interesante herramienta es xinetd. Otra vez, expliquemos brevemente, xinetd es un
reemplazo para inetd. Seg&uacute;n lo sobre dicho sobre inetd, nosotros no insistiremos.
Si est&aacute; interesado, lo encontrar&aacute; en
<a href="http://www.xinetd.org/">http://www.xinetd.org</a>.
</p>
<p>
Bajo Linux, hay una herramienta sin la que usted no puede vivir : es llamada
Bastille-Linux. La encontrar&aacute; en <a
href="http://www.bastille-linux.org/">http://www.bastille-linux.org</a>.
Esta herramienta, escrita en Perl, no solamente es didactica sino que tambi&eacute;n muy eficiente.
Despu&eacute;s de ejecutar un script, usted contesta a muchas preguntas y Bastille-Linux act&uacute;a por consiguiente.
Cada pregunta esta explicada y respuestas por defecto son proporcionadas. Usted puede
deshacer los cambios, iniciar una nueva configuraci&oacute;n, revisar que se ha hecho...
&iexcl; Eso es todo ! Tambi&eacute;n ofrece una configuraci&oacute;n del firewall : regresaremos a esto
m&aacute;s tarde. Al momento de escribir esto, Bastille-Linux est&aacute; en su versi&oacute;n 1.1.1, pero
la versi&oacute;n 1.2.0 tambi&eacute;n esta disponible como  versi&oacute;n candidato. Ha mejorado mucho,
y provee una  GUI basada en Tk y su m&oacute;dulo Perl.
(Nota del autor : este art&iacute;culo fue escrito hace muchos meses. Y naturalmente,
la presente versi&oacute;n de Bastille-Linux es la 1.3.0).
</p>
<p>
Los sistemas de detecci&oacute;n de intrusos tambi&eacute;n son esenciales. Los dos "heavywheight"
son llamados snort y portsentry. El primero puede ser descargado desde
<a
href="http://www.snort.org">http://www.snort.org</a> y el segundo de uno de los
sitios web de Abacus, <a href="http://www.psionic.com">http://www.psionic.com</a>.
Dichas herramientas no pueden ser comparadas : la primera es un NIDS (Network Intrusion
Detection System - sistema de detecci&oacute;n de intrusos) principalmente proporciona
informaci&oacute;n, mientras la segunda puede ser considerada como orientada a la m&aacute;quina
 y m&aacute;s activa. snort tiene much&iacute;simas opciones que permiten supervisar el tr&aacute;fico en
 la red. Puede listar todo lo que desee : entradas, salidas,
dentro y fuera del firewall. Naturalmente, &iexcl; puede crear registros enormes,
pero usted debe saber lo que desea ! Una versi&oacute;n para Win 32,
lo que es importante si consideramos el n&uacute;mero de herraminetas libres disponibles
en estos "sistemas".
</p>
<p>
portsentry tiene una caracter&iacute;stica interesante : puede bloquear los puertos
escaneados a su elecci&oacute;n. redireccionar al atacante a una
direcci&oacute;n inusitada de la red o redirigiro al cortafuego.
Ciertamente, usted uede seleccionar que bloquear y que no.
Ahora podemos regresar al tema de TCPWrapper : portsentry es capaz de
escribir dentro del archivo /etc/hosts.deny si asi lo desea.
As&iacute;, portsentry llega a ser absolutamente eficiente.
No entraremos en debate acerca de la filosof&iacute;a de portsentry
que consiste en el enlace de puerto. Pruebelo : haga su elecci&oacute;n despu&eacute;s de
profundizar en el tema. Tambi&eacute;n se le advierte que portsentry puede hacer a una
m&aacute;quina "invisible", lo cual no es nada malo ! Por &uacute;ltimo, portsentry puede usar
diferentes modos de operaci&oacute;n, el m&aacute;s avanzado ser&aacute; "reservado" para Linux
(al menos por ahora).
</p>
<p>
No podemos hablar acerca de la seguridad sin mencionar la encriptaci&oacute;n.
Sin embargo, la ley al respecto, es diferente de un pa&iacute;s a otro y alguna veces
es completamente prohibido.
<br>
Nota del autor : la siguinete secci&oacute;n ha sido eliminada de la versi&oacute;n en ingl&eacute;s
del art&iacute;culo ya que solamente concierne a las leyes de Francia.
<br>
Conclusi&oacute;n : si en su pa&iacute;s se permite la encriptaci&oacute;n, instale clientes y servidores ssh
en sus m&aacute;quinas Unix (bueno, seg&uacute;n sus necesidades !).
</p>
<p>
Para finalizar con las herramientas Unix, mencionemos las que pertenecen
a los Unixes propietarios. Bajo Solaris, usted tiene ndd, aset; bajo Irix, puede usar ipfilterd.
MacOS X provee sus propias herramientas libres : ssh, ipfwadm...
<br>
Regresaremos a esto despu&eacute;s.
</p>
<p>
Ahora, vamos hablar del primero y &uacute;nico (afortunadamente!) No terminado 4.0
Aqu&iacute; no podemos hablar sobre herramientas libres... sin embargo,
el hombre de Redmond nos provee de material "libre" para mejorar las caracter&iacute;sticas
del sistema (nada que hacer con la correcci&oacute;n de bugs puesto que no hay bugs!).
Referente a seguridad, el NT 4,0 es un modelo... de incongruencia.
&iexcl;Es un poco como un tamiz! Nada en mente. Por consiguiente, usted apenas tiene que
descargar el paquete m&aacute;s reciente del servicio (6 a la hora de esta escritura) y el
HotFixes... que son remiendos de la seguridad. ... usted puede conseguir despu&eacute;s
algunas herramientas libres (en el significado libre de disponible y sin el c&oacute;digo
fuente). &Eacute;se es todo.
</p>
<p>
Para otras herramientas usted tendr&aacute; que buscar. Para AmigaOS,
el desarrollo no parece motivar a mucha gente y la capa de TCP/IP es un poco vieja.
Sin embargo, el Dominio P&uacute;blico sigue all&iacute; manteniendose ocupado.
Referente a BeOS, las cosas no son mejores: este gran OS que parece tener un futuro
muy comprometido y la capa de red llamada Bone todav&iacute;a est&aacute; siendo trabaja.
<br>
(Nota del autor : desafortunadamente, ahora BeOS no existe m&aacute;s.
Algunas personas intentan mantenerlo vivo como un producto de software libre...
y ellos hacen un trabajo muy bueno.)
<br>
Pero all&iacute; tambi&eacute;n, usted encontrar&aacute; algunas herramientas del mundo de Unix para
mejorar las cosas.
</p>
<strong>Seguridad de los hosts</strong>
<p>
Ahora, &iexcl; usted tendr&aacute; que configurar todo esto !
Una vez m&aacute;s, considere que cada m&aacute;quina Unix esta "equipada" con
shadow-utils, PAM, TCPWrapper, y que cada servicio no necesario ha sido detenido o
eliminado, que los permisos han sido endurecidos en los directorios "sensibles",
etc.
</p>
<p>
En las m&aacute;quinas Linux, es tiempo de iniciar Bastille-Linux. (Esta herramienta deber&iacute;a
funcionar en muchas distribuciones Linux, sin embargo, originalmente ha sido dise&ntilde;ada
para RedHat y Mandrake). Sientase libre de responder la preguntas de una manera muy
restrictiva.
<br>
En una maq&uacute;ina Linux usada como un gateway, el sistema deber&iacute;a ser "minimalista".
Usted puede eliminar muchos de los servicios : http, ftp, etc. Elimine X11 : &iexcl; No es
necesario !
Remueva el software no necesario... esto es, casi todo. Detenga los demonios no
utilizados. Usted deber&iacute;a obtener un sistema donde un comando <i>ps ax</i>
podr&iacute;a no sentir la pantalla de la consola. Si usa Enmascaramiento de IP,
el comando <i>lsof -i</i> deberia desplegar una l&iacute;nea :
la concerniente alistado del servidor (supnemos que es una conecci&oacute;n no permanente).
<br>
Arbitrariamente, instalaremos portsentry en las m&aacute;quinas Linux y ser&aacute; lanzada
en el tiempo de inicio, usando el modo "avanzado" (reservado para Linux, esto es las
opciones -atcp y -audp options). Esto implica que TCPWrapper y un firewall han
sido instalados. Regresaremos a estos m&aacute;s tarde.
</p>
<p>
Para Solaris, usaremos los comandos <I>aset</I> y <I>ndd</I>. M&aacute;s de esto despu&eacute;s.
portsentry ser&aacute; instalado tambi&eacute;n. Podemos agregar IP Filter y
reemplazar la versi&oacute;n est&aacute;ndar de RPCbind con la versi&oacute;n 2.1 disponible en
porcupine.org.
Para Irix, selecionaremos ipfilterd para filtro de paquetes como el nombre lo indica.
Es parte de las distribuciones Irix pero no se instala por defecto.
</p>
<p>
Concerniente a  NT, las cosas se tornan m&aacute;s complicadas... La soluci&oacute;n "fascista"
consiste en bloquear los puertos 137 y 139, que es el famoso NetBIOS (o a&uacute;n mejor
removiendo NetBIOS)... but there is no network left (esa es la red Windos)
&iexcl; puede ser un peque&ntilde;o problema cuando se refiere a un servidor de aplicaciones !
Usted puede instalar snort
pero no evitar&aacute; que esas m&aacute;quinas sean como tamices.
Por consiguiente, tendr&aacute; que ser muy restrictivo sobre el acceso de la partici&oacute;n,
acceso de directorio... tan pronto como trabaje con las particiones NTFS,
por supuesto. Hay un programa disponible libremente para salir librado de la
cuenta hu&eacute;sped pero el c&oacute;digo de fuente no est&aacute; disponible.
&iexcl;Entonces, instale todos los remiendos de la seguridad que usted puede encontrar!
Por &uacute;ltimo pero no menos importante, pliegue sus mangas e intente  hacer
esa cosa menos vulnerable. Es un poco como ir un curso de asalto
pero es obligatorio.
</p>
<p>
Para los "ex&oacute;ticos" Sistemas Operativos, tendr&aacute; que buscar y elegir. Como es usual,
y despu&eacute;s de todo, las reglas b&aacute;sicas deber&iacute;an aplicarse : mientras menos
n&uacute;mero de servicios activos, mejor.
</p>
<A NAME="245lfindex4">&nbsp;</A>
<H2>Protegiendo la Red</H2>

<p>
Si los hosts han sido "preparados" correctamente, usted esta a la mitad del camino.
Pero necesitar&aacute; ir m&aacute;s lejos. Puesto que estamos hablando de software libre,
elegiremos un firewall libre para el gateway: bien, es la m&aacute;quina que permitiendo que
usted tenga acceso al mundo "salvaje". Arbitrariamente (otra vez!) utilizamos una
caja de Linux: podemos utilizar el cortafuego de Bastille-Linux.
Trabaja con ipchains o ipfwadm de acuerdo a su versi&oacute;n del n&uacute;cleo.
Si utiliza un n&uacute;cleo 2,4, trabajar&aacute; con iptables.
</p>
<p>
Una peque&ntilde;a digresi&oacute;n: no es una buena idea tener todos los problemas iniciales a
tolerar, cuando la seguridad es una preocupaci&oacute;n.
La "raza" de la &uacute;ltima versi&oacute;n del n&uacute;cleo puede conducir a una situaci&oacute;n muy
negativa. Esto no significa que el trabajo sobre el nuevo n&uacute;cleo no es bueno,
sin embargo, la "uni&oacute;n" con las herramientas existentes, no dise&ntilde;adas para trabajar
sobre el nuevo kernel puede ser un error grande. Un consejo: &iexcl;sea paciente!
La herramienta nueva del cortafuego, parte del n&uacute;cleo 2,4 es muy prometedora pero
probablemente un poco "joven"...
</p>
<p>
Luego, el firewall Bastille-Linux es tanto sencillo como eficiente. Sin embargo,
hay muchas herramientas muy elaboradas, un poco asi como una "fabrica de gasolina",
llamada T.REX. Est&aacute; disponible desde <a
href="http://www.opensourcefirewall.com">http://www.opensourcefirewall.com</a>.
Si busca una herramienta sofisticada y libre, ese es el lugar.
</p>
<p>
Otras soluciones existen, por ejemplo proxys, no obstante no son siempre mejores.
Otra digresi&oacute;n: los proxys a menudo se llaman "cortafuegos". Sin embargo, son dos
cosas muy diversas. Con los cortafuegos estamos hablando del paquete de uso de
filtrado de paquetes y no proporciona m&eacute;todo de la autentificaci&oacute;n.
Hay dos tipos de servidores poxy: aplicaciones o sockets. En breve, una aplicaci&oacute;n proxy
trabaja para usted administrando la comunicaci&oacute;n y premitiendo  a usuarios
la autentificaci&oacute;n. Esta es la raz&oacute;n por la cual necesita mucho m&aacute;s recursos
que un cortafuego. Pero, repetidas veces, esta clase de herramientas protegen
solamente un lapso de tiempo corto. Un cortafuego puede ser "agrietado" en
cerca de 15 minutos. &iquest;Es bueno saberlo, no? Por lo tanto la necesidad de
asegurar correctamente los hosts en su red: &iexcl;el decidir asegurar una red que
conf&iacute;a solamente en un cortafuego o un proxy es un error!
</p>
<p>
Otro medio para reducir los riesgos en una red es el cifrado.
Por ejemplo, usar telnet es como hacer caminos a los crakers en una alfombra roja.
Es una manera de darles las llaves de la tienda. Pueden ver no s&oacute;lo los datos que
circulan, sino que incluso mejor, consiguen la contrase&ntilde;a en texto claro:
&iquest;agradable, no? Por consiguiente, si&eacute;ntase libre de utilizar ssh con los protocolos
 "inciertos" (o en vez de). Si usted DEBE (?) utilizar telnet, env&iacute;e los datos a
 trav&eacute;s de una conexi&oacute;n segura. Es decir vuelva a dirigir telnet seguro.
 Encontrar&aacute; m&aacute;s de esto en el art&iacute;culo titulado "a trav&eacute;s del t&uacute;nel"
(<a href="../May2001/article202.shtml">
English/May2001/article202.shtml</a>).
(&iexcl; Comerciales gratis !)
</p>
<p>
Bien, nosotros tratamos de mejorar la seguridad, pero ahora debemos comprobar
nuestro trabajo. Para hacer esto, seamos "crakers": utilizaremos sus herramientas.
&iquest;Muy Feo, no? En esta &aacute;rea tambi&eacute;n, hay una colecci&oacute;n agradable de programas,
despu&eacute;s, otra vez arbitrariamente, elegiremos dos de ellos: nmap y nessus.
No hay redundancia, puesto que, por ejemplo, el segundo requiere al primero.
Estas herramientas son exploradores de puertos, incluso si nessus es mucho m&aacute;s que
esto. Este &uacute;ltimo le informa sobre las vulnerabilidades del sistema,
comparando los resultados de exploraci&oacute;n a su base de datos de las vulnerabilidades.
 El funcionamiento de estas herramientas en una red permitir&aacute; que usted descubra
 debilidades de cada host, a&uacute;n del OS. Los resultados son muy reveladores
as&iacute; que son herramientas que debe tener. Usted encontrar&aacute; el nmap
<a href="http://www.insecure.org">http://www.insecure.org</a> and nessus at
<a
href="http://www.nessus.org">http://www.nessus.org</a>.
</p>
<p>
Desde el principio de este art&iacute;culo estamos hablando acerca de la seguridad
de una red local en la cual algunas m&aacute;quinas se abrir&aacute;n al mundo externo.
Una caja del Proveedor de Servicios de Internet (Internet Service Provider) ser&iacute;a
obviamente diferente y no conseguiremos muchos detalles del tema.
Vamos a decir que todo lo que mencionamos todav&iacute;a est&aacute; disponible pero usted
tendr&aacute; que utilizar mucho m&aacute;s m&eacute;todos elaborados, tales como VPN
(red privada virtual), LDAP para la autentificaci&oacute;n (por ejemplo), etc.
Es casi otro tema puesto que los apremios son mucho m&aacute;s numerosos seg&uacute;n el caso.
No hablamos de sitios de e-negocio, donde las cosas son imprudentes.
&iexcl; Sitios seguros ellos ! No me diga... &iquest;Usted env&iacute;a su n&uacute;mero de la tarjeta de
cr&eacute;dito a trav&eacute;s de Internet? Si s&iacute;, usted es muy valeroso.
Sugerencia: si usted puede leer franc&eacute;s de una mirada en este website
<a
href="http://www.kitetoa.com">http://www.kitetoa.com</a>, it is worth it.
</p>
<A NAME="245lfindex5">&nbsp;</A>
<H2>Systems particularity</H2>

<p>
Seg&uacute;n lo mencionado ya, los sistemas no son iguales delante del enemigo.
Algunos tienen capacidades muy buenas mientras que otros son tamices.
Parad&oacute;jico (bueno, &iexcl; realmente no !), los OS libres est&aacute; entre lo mejor.
Los diversos BSDs (OpenBSD, NetBSD, FreeBSD...), los diversos Linuxes son
mejor cuando la seguridad es una preocupaci&oacute;n. Una vez m&aacute;s es el resultado
del gran trabajo de la comunidad del software libre. Los otros, incluso los
etiquetados como Unix, son un poco menos avanzados. &iexcl;Cuando no son Unix, es
mucho peor!
</p>
<p>
Todas las herramientas mencionadas en este art&iacute;culo se han desarrollado
para OS libres. La mayor&iacute;a de los sistemas propietarios Unix pueden beneficiarse
de ellos. Sin embargo, estos OS propietarios tienen a menudo sus propias
herramientas. Por ejemplo, referente a Solaris, mencionamos <I>ndd y </I>aset.
A pesar de una idea extensa, los sistemas de Sun no son modelos de seguridad.
Una herramienta tal como aset, permite  mejorar las cosas por lo que a los
derechos de acceso se refiere.  aset ofrece tres niveles de protecci&oacute;n: bajo,
medio y alto. Usted puede ejecutarlos desde un shell o de una tarea cron. En una
red que era real a las 5pm puede llegar a ser falso a las 5.30pm. por lo tanto
el inter&eacute;s en comandos corrientes de una manera c&iacute;clica de guardar una cierta
homogeneidad. Esta es la raz&oacute;n por la cual aset tiene la capacidad de administraci&oacute;n
de cron. As&iacute;, comprobar&aacute; cada 30 minutos o cada hora, o lo que usted desea,
los permisos de los directorios, los archivos...
<br>
ndd, permite cambiar los par&aacute;metros del stack. Por ejemplo, puede ser utilizado
para ocultar las huellas digitales del sistema. Un sistema identificado es
m&aacute;s vulnerable, puesto que los crakers saben mejor d&oacute;nde "pulsar".
Con ndd, usted puede cambiar el tama&ntilde;o m&aacute;ximo del segmento de TCP (MSS).
Por defecto, este tama&ntilde;o de id es de 536 bajo Solaris 2,6. El comando
<I>ndd -set /dev/tcp tcp_mss_def 546</I> lo cambia a 546. El MSS m&aacute;s alto es,
el mejor (&iexcl;no demasiado!). Nmap, por ejemplo puede encontrar esta debilidad.
Usando ndd, usted cort&oacute; la tierra inferior de sus pies.
Si usted tiene m&aacute;quinas ejecutando Solaris, si&eacute;ntase libre de utilizar ndd.
Hay muchas opciones: compruebe la p&aacute;gina man.
<br>
Puede tambi&eacute;n usar IP Filter, un paquete de herramientas de filtrado. Esta disponible
 desde
<a
href="ftp://coombs.anu.edu/pub/net/ip-filter">ftp://coombs.anu.edu/pub/net/ip-filter</a>.
</p>
<p>
Referente a Irix, hay a&uacute;n m&aacute;s. En defensa de SGI (ex Silicon Graphics), como
dice el nombre, su sistema el primero dise&ntilde;ado para gr&aacute;ficos.
La seguridad no era la preocupaci&oacute;n principal. Sin Necesidad de saber ninguna ley,
lleg&oacute; a ser obligatorio proporcionar maneras de reducir los riesgos.
ipfilterd entonces fue proporcionado en las distribuciones de Irix, pero no es
instalado por defecto: &iexcl;usted tendr&aacute; que buscarlo! ipfilterd, por supuesto se
utiliza para el filtrado de paquetes, as&iacute; permitiendo negar el acceso a qui&eacute;n usted
desea. Conf&iacute;a en un archivo de configuraci&oacute;n llamado ipfilterd.conf y aqu&iacute; es
donde las cosas se hacen un poco dif&iacute;cil. La sintaxis de este archivo es algo
peculiar y no tiene gusto de espacios inesperados o de l&iacute;neas vac&iacute;as.
As&iacute;, para permitir a la m&aacute;quina llamada "Marte"  hablar con la m&aacute;quina llamada
"J&uacute;piter" (que es el sitio de trabajo de SGI), usted tendr&aacute; que mecanografiar
una l&iacute;nea que se parece a: <Br> <I>accept -i ec0 between jupiter mars</I>.
Las m&aacute;quinas no enumeradas en este archivo no podr&aacute;n tener acceso a J&uacute;piter.
Peor : &iexcl;si usted no cambia el par&aacute;metro de
<I>ipfilterd_inactive_behavior</I> usando el systune, nadie tendr&aacute; acceso a la
m&aacute;quina! &iquest;Eficiente, no? Este par&aacute;metro omite 1, y usted necesitar&aacute; cambiarlo a 0
usando  <I>systune -i ipfilterd_inactive_behavior 0</I>
<br>
Otra cosa bien conocida, mejor recordar, Irix tiene una "gran" vulnerabilidad,
llamada fam (monitor de la alteraci&oacute;n de archivo). Este programa est&aacute; a cargo de
una caracter&iacute;stica muy agradable, la comunicaci&oacute;n entre los varios demonios.
Por ejemplo, permite obtener iconos hermosos en la carga del archivo.
Sin embargo, hay solamente una cosa que hacer: &iexcl;desact&iacute;vela! Triste, pero es as&iacute;.
</p>
<p>
Para finalizar con los sistemas Unix, menionemos que QNX es muy vulnerable
pero puede beneficiarse de las herramientas libres. Mac OS X
ya provee algunas de estas herramientas.
</p>
<p>
Debemos hablar un poco de la absoluta referencia entre los sistemas de la red:
el primero y &uacute;nico NT 4.0. Asegurar esa cosa es una visi&oacute;n ut&oacute;pica, a pesar de
qu&eacute; dice el Rey de Redmond (y de muchos otros). La simulaci&oacute;n de un ataque con
nessus, por ejemplo, ser&aacute; una pesadilla. Por lo que si NetBIOS est&aacute; activo,
nessus le proveer&aacute; a usted los nombres de cada m&aacute;quina en el dominio con sus
usuarios correspondientes, incluyendo administradores. La respuesta es:
&iexcl;librese de NetBIOS! refuerce, pero seg&uacute;n lo mencionado ya, ning&uacute;n NetBIOS,
ninguna red... Usted tendr&aacute; que elegir su lado.
<br>
nessus le informar&aacute; amablemente que puede registrarse como el guest con una sesi&oacute;n
NULA (que  es con un nombre de usuario NULO y una contrase&ntilde;a NULA).
&iexcl;Qu&iacute;telo, entonces! &iquest;S&iacute;, pero c&oacute;mo?
<br>
As&iacute; pues, reduzca el acceso a las particiones (NTFS), a los directorios.
Para la partici&oacute;n FAT... ninguna soluci&oacute;n. Sin embargo, seg&uacute;n el software que
usted utiliza puede necesitar particiones FAT: un cierto software no trabajar&aacute; en
el extremo de NTFS. Para terminar, evita que funcione el gran IIS, especialmente
como ftp server. De hecho, no lo instale. Si hoy,  muchas ISP son bastante
molestas de utilizar esa cosa, solo sugerir utilizar Apache en lugar de otro,
pero... No pasamos mucho tiempo en IIS, existe mucha de literatura en el tema.
<br>
De hecho, hay una manera de hacer que el tamiz se convierta en un filtro
(los agujeros son m&aacute;s peque&ntilde;os!). El problema es que es  una manera algo larga y
el compartimiento entero no ser&iacute;a suficiente. Mencionemos solamente el m&aacute;s
importante. Obviamente, el punto no es asegurar con software libre:
&iexcl;estamos hablando del mundo de Microsoft! La primera sugerencia es utilizar
MSCE (Editor de Configuraci&oacute;n de Seguridad Microsoft) disponible en el ServicePack 4
con MMC (consola de administraci&oacute;n Microsoft).
&iexcl;Sin embargo, tenga extremado cuidado! Puede incurrir en una equivocaci&oacute;n.
Por supuesto, este software es una versi&oacute;n inglesa. Si usted utiliza una vesri&oacute;n
 extranjera (no ingl&eacute;s), del sistema ser&aacute; advertido que la mezcla de idiomas
 nunca da resultados muy buenos en el mundo de Redmond.
 Le han advertido. Despu&eacute;s, entre las medidas requeridas, usted debe
 "segurar" la cuenta del administrador, o a&uacute;n desactivarla. Tome una mirada en
  <I>passprop</I> disponible desde el SP 3.
Tambi&eacute;n puede reforzar el uso de claves usando el dll <I>passfilt</I> a trav&eacute;s del
regitro (Yo simepre creo que la gente que invento esa cosa fue bajo la influencia de LSD...).
Desactive la famosa cuenta guest. No es muy &uacute;til (ver m&aacute;s abajo),
pero hace que las cosas sean menos peores. A&uacute;n, puede restringir sus accesos
a los logs del registro. En "HKEY_LOCAL_MACHINE", cree las llaves
<I>System\CurrentControlSet\Services\EventLog\Application</I>, de Seguridad
y Sistema (estas dos &uacute;ltimas deber&iacute;an reemplazar Application). Su nombre es
"RestrictGuestAccess", el tipo es REG_SZ y el valor es 1.
Puede encriptar el password con <I>syskey</I>. Cuidado, &iexcl; esta operaci&oacute;n es
irreversible !
Por &uacute;ltimo buenas noticias : puede restringir el acceso guest. Otra vez,
esta relacionado con el registro, a&uacute;n en  "HKEY_LOCAL_MACHINE". Esta vez la llave es
llamada
<I>System\CurrentControlSet\Control\Lsa</I>. El nombre es
"RestrictAnonymous", el tipo "REG_DWORD" y el valor es 1.
Sin embargo, el mundo de Microsoft es bromista: aconseja que este cambio puede
alterar algunos servicios de red...
Entre las cosas importantes, usted puede restringir el acceso a algunos puertos,
usando el uso de la red en el panel de la configuraci&oacute;n. De las caracter&iacute;sticas de
TCP/IP, selecione "avanzado" y marque "Activar la Seguridad"
(creo que este es su nombre, pero yo no tengo esta clase de cosas en casa
para poder comprobar). De la ventana de la "seguridad", marque "permitir solamente"
y selecciona los puertos que desea activar. Aqu&iacute; tambi&eacute;n, tenga cuidado.
Usted debe saber lo que usted est&aacute; haciendo, si no algunos servicios no trabajar&aacute;n
m&aacute;s.
<br>
Se puede hacer mucho m&aacute;s, pero esto es lo esencial. Para aprender m&aacute;s, puede visitar
sans.org : ciento de documentos disponibles.
</p>
<A NAME="245lfindex6">&nbsp;</A>
<H2>La intolerante ligereza de las cosas</H2>

<p>
Bien, usted ha hecho todo esto. Ejecute nessus para explorar la red entera y
encontrar&aacute; los agujeros de seguridad. &iexcl;No diremos de d&oacute;nde vienen...  nosotros
lo sabemos ya! Intente enga&ntilde;ar essos substitutos del sistema. No quitar&aacute; los
agujeros "proporcionados" por NetBIOS, sino que limitar&aacute; el da&ntilde;o.
Cree los subdominios. No registre como administrador. Aplique los remiendos.
Refuerce, intente ocultar todo el esto detr&aacute;s de las m&aacute;quinas de Unix usadas
como gateways. Desafortunadamente, la relatividad de la seguridad viene no
solamente de los productos hechos en Redmond. Una red est&aacute; viva: hay siempre algo
que se enciende. Un buen administrador es un "paranoide" uno, comprueba por c
onsiguiente a menudo el "inventario de accesorios". Escriba scripts para automatizar
las revisiones. Por ejemplo para controlar sobre una base regular los programas
 de SUID/SGID, los archivos cr&iacute;ticos, los registros...
Para obtener a algunos amigos, trabe el disco floppy de los usuarios o los
dispositivos de CDROM. No acepte que los usuarios descargan software sin su
consentimiento, especialmente cuando este software es ejecutable como siempre
en el mundo de Microsoft. No acepte que los usuarios abran documentos adjuntos
como &eacute;sos de formato Word o Excel usando  un sistema de filtraci&oacute;n de correo.
S&iacute;, lo s&eacute; soy como el fascismo, pero &iquest;qu&eacute; puede usted hacer contra macro-virus?
No utilice los productos tales como Outlook. &iexcl;De nuevo, usted debe saber lo que
desea! S&eacute;, qu&eacute; lo que digo es in&uacute;til, pero &iquest;puede usted hablar de seguridad con
tales productos? El famoso "I love you" no ense&ntilde;&oacute; ninguna lecci&oacute;n.
<br>
Concerniente a  Unix, las descargas pueden ser controladas tambi&eacute;n.
Los Checksums no son proporcionados por accidente.
</p>
<p>
Tenga el h&aacute;bito de controlar su red bajo una base regular de logs, scripts,
scaners... Habr&aacute; notado : las cosas cambian tan r&aacute;pido y no precisamente
de la mejor manera.
<br>
Finalmente,  no dijimos una palabra sobre ella, sino no nos olvidamos de reservas.
La estrategia es unchanging: diario, semanal y mensual. Una m&aacute;quina de Unix puede
tambi&eacute;n tener problemas, incluso si es inusual. Y, los usuarios incurren a veces
en equivocaciones... pero no muy a menudo. Es bien sabido que los problemas vienen
de las m&aacute;quinas o del departamento a cargo de ellas:- (
</p>
<A NAME="245lfindex7">&nbsp;</A>
<H2>&iexcl; Esto es todo!</H2>

<p>
Si usted lleg&oacute; a esta secci&oacute;n es que usted es valeroso.
&iexcl;El problema es que solo nadamos solamente sobre el tema!
La seguridad no tiene ning&uacute;n extremo y se refiere no solamente a redes.
Los usos vulnerables pueden comprometer una red. Un cortafuego mal configurado
es gravemente m&aacute;s peligroso que ning&uacute;n cortafuego. Una m&aacute;quina de Unix contiene
a menudo millares de archivos. &iquest;Qui&eacute;n puede estar seguro que ninguno de ellos
es vulnerable? &iquest;Qui&eacute;n piensa que un craker intentar&aacute; romper una llave de 128
bits? No se enga&ntilde;e: &eacute;l intentar&aacute; encontrar una puerta detr&aacute;s de la casa.
Repetidas veces, usted puede instalar todas las herramientas de seguridad
disponibles, si deja un agujero muy peque&ntilde;o, esto es por donde ir&aacute; el "malo".
</p>
<p>
La seguridad es tambi&eacute;n un comportamiento: Por ejemplo, visite los sitios web
sobre una base regular, igual para los sitios web de los editores de sus Sistemas Operativos...
Por ejemplo, Sun publica remiendos recomendados cada mes.
SGI lanza una nueva versi&oacute;n de Irix cada tres meses. Microsoft proporciona con
frecuencia ServicePacks o HotFixes. Las distribuidores de Linux publican las
erratas para cada vulnerabilidad nueva descubierta. Iguales para los diversos BSDs.
Si usted no utiliza los productos que corresponden a un remiendo los quita de su
disco duro. Etc&eacute;tera: la lista de las cosas que se har&aacute;n es muy, muy larga.
En breve, este trabajo no debe conover despidos.
</p>
Finalmente, vamos decirlo otra vez, todo esto contribuir&aacute; solamente para hacer
su red un poco menos vulnerable. No cuente con conseguir una red 100% segura,
incluso en un momento dado (bien, puede ser, si se paran todas las m&aacute;quinas).
Un dicho, &iexcl; no es un requisito ser paranoide para hacer este trabajo... pero
ayuda! Pero no sea algo comun en su vida diaria, ser&aacute; mucho m&aacute;s
agradable para la gente alrededor de usted...
</p>
<A NAME="245lfindex8">&nbsp;</A>
<H2>Referencias</H2>

<p>
<a
href="http://www.linuxsecurity.com">http://www.linuxsecurity.com</a>
<br><br>
<a
href="http://www.sans.org">http://www.sans.org</a>
<br><br>
<a
href="http://www.infosyssec.org">http://www.infosyssec.org</a>
<br><br>
<a
href="http://www.securityfocus.com">http://www.securityfocus.com</a>
<br><br>
<a
href="http://www.cs.purdue.edu/coast/hotlist/">http://www.cs.purdue.edu/coast/hotlist/</a>
<br><br>
<strong>Life is sad : let's have some fun !</strong>
<br><br>
<a
href="http://bofh.ntk.net/Bastard.html">Another way to do the job ;-)</a>

 

