<HTML>
<HEAD>
<TITLE>Dosemu COMO: M&uacute;ltiples usuarios y sesiones sin-interactividad</TITLE>
</HEAD>
<BODY>
<A HREF="Dosemu-Como-4.html">Anterior</A>
<A HREF="Dosemu-Como-6.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. M&uacute;ltiples usuarios y sesiones sin-interactividad</A></H2>



<H2><A NAME="ss5.1">5.1 ¿Puedo utilizar dosemu en un sistema multiusuario?</A></H2>


<P>Corey Sweeney (<CODE>
<A HREF="mailto:corey@amiganet.xnet.com">corey@amiganet.xnet.com</A></CODE>) (12/8/93) comentaba:</P>
<P>Si est&aacute; utilizando dosemu en un sistema en el cual m&aacute;s de una persona
puede querer ejecutar dosemu, deber&aacute; en consecuencia cambiar el directorio
de su imagen de disco duro. En el archivo <CODE>/etc/dosemu.conf</CODE> existe
una l&iacute;nea de forma predeterminada que indica que la imagen del disco duro
es "<CODE>hdimage</CODE>".  Si lo cambia por <CODE>/var/lib/dosemu/hdimage</CODE>
entonces los usuarios no tendr&aacute;n que preocuparse por el directorio en el
que est&eacute;n cuando ejecuten dosemu, y el archivo <CODE>hdimage</CODE> no necesitar&aacute;
ser cambiado cada vez que instale una versi&oacute;n nueva de dosemu.</P>
<P>Si hace esto para un dosemu multiusuario, querr&aacute; entonces crear el archivo
<CODE>hdimage</CODE> de s&oacute;lo lectura en <CODE>/var/lib/dosemu</CODE> para cualquiera
menos para el administrador del dosemu.</P>
<P>Tenga en cuenta que puede usar el nuevo controlador <CODE>emufs.sys</CODE> para
montar un directorio "p&uacute;blico" y/o un directorio "privado" (un
subdirectorio en el directorio <CODE>home</CODE> de cada usuario).</P>
<P><B>Nota</B>: Los usuarios deben tambi&eacute;n crear un fichero de configuraci&oacute;n
personal llamado <CODE>~/.dosrc</CODE> (con el mismo formato que el
<CODE>/etc/dosemu.conf</CODE>) para ejecutar su copia personal del dos. </P>


<H2><A NAME="ss5.2">5.2 ¿C&oacute;mo puedo ejecutar comandos del dos de forma no interactiva?</A></H2>


<P>He estado tentado de escribir un art&iacute;culo sobre esto durante bastante
tiempo, pero no me he puesto todav&iacute;a a ello.  Aqu&iacute; tiene algunas
indicaciones de otros: </P>
<P>Dan Newcombe (<CODE>
<A HREF="mailto:newcombe@aa.csc.peachnet.edu">newcombe@aa.csc.peachnet.edu</A></CODE>) informaba (1/27/94) de lo
siguiente:</P>
<P>He aqu&iacute; una idea (sin comprobar) para ser capaz de ejecutar un comando del
DOS desde la l&iacute;nea de comandos (o por elecci&oacute;n de un men&uacute;, etc...) sin
modificar el emulador actual. (Se asume que su partici&oacute;n del dos est&aacute; ya
montada bajo Linux).</P>
<P>Supongamos que quiere ejecutar <CODE>wp60.exe</CODE> con los par&aacute;metros "<CODE>wp60
d:\doc\paper.txt</CODE>".  Deber&iacute;a hacer algo parecido a
"<CODE>dosrun wp60 d:\doc\paper.txt</CODE>".  "<CODE>dosrun</CODE>" 
deber&iacute;a ser un script que tendr&iacute;a que </P>
<P>
<OL>
<LI>Editar/modificar/recrear el <CODE>autoexec.bat</CODE> de su partici&oacute;n
del dos y </LI>
<LI>Simplemente ejecutar dosemu (ej., "<CODE>dos -C >/dev/null</CODE>".  </LI>
</OL>
</P>
<P>El paso 1 deber&iacute;a guardar de alguna manera todo lo que normalmente tenga
puesto en el <CODE>autoexec.bat</CODE> (ej., <CODE>mouse.com</CODE>) y en la &uacute;ltima
l&iacute;nea deber&aacute; poner "<CODE>wp60d:\doc\paper.txt</CODE>". </P>
<P>En la parte del dosemu, y con antelaci&oacute;n, deber&aacute; modificar el archivo 
<CODE>config.sys</CODE> (situado en el archivo <CODE>hdimage</CODE>) de forma que </P>
<P>
<OL>
<LI>Utilice <CODE>emufs</CODE> para acceder a la partici&oacute;n del dos como
<CODE>D:</CODE>, 
</LI>
<LI>Escriba "<CODE>COMPSEC=D:\</CODE> (o eso creo. no tengo un manual
del DOS a mano.), y </LI>
<LI>Escriba "<CODE>shell=c:\command.com /p</CODE>".</LI>
</OL>
</P>
<P>La idea estriba en que cada vez que cargue el emulador del DOS, se crear&aacute; un
<CODE>autoexec.bat</CODE> espec&iacute;fico para esa sesi&oacute;n. Las modificaciones en el
archivo <CODE>hdimage</CODE> radican en decirle al emulador/DOS que quiera
utilizar que arranque desde la unidad <CODE>D:</CODE>, la cual sera la partici&oacute;n
DOS actual. </P>
<P>Si no utiliza el archivo <CODE>hdimage</CODE> y accede al sistema de ficheros
del DOS directamente mediante el arranque de dosemu, entonces esto
funcionar&aacute;, no teniendo as&iacute; que cambiar el archivo <CODE>hdimage</CODE>. </P>
<P>Daniel T. Schwager (<CODE>
<A HREF="mailto:danny@dragon.s.bawue.de">danny@dragon.s.bawue.de</A></CODE>) informaba (7/2/94) que:</P>
<P>Puede utilizar diferentes archivos <CODE>dosemu.conf</CODE> (y distintas im&aacute;genes
de arranque, <CODE>hdimage</CODE>, con <CODE>autoexec.bat</CODE>'s distintos) y llamar al
dosemu de la forma</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 
$ dos -F mi_dosemu.conf 
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Dietmar Braun (<CODE>
<A HREF="mailto:braun@math20.mathematik.uni-bielefeld.de">braun@math20.mathematik.uni-bielefeld.de</A></CODE>) informaba: (7/4/94) </P>
<P>No hay problemas a la hora de utilizar el redirector de dosemu. Es posible
redireccionar una letra de unidad a una ruta de linux dada por una
variable de entorno. </P>
<P>De forma que tengo un <I>script</I> llamado "<CODE>DOS</CODE>" el cual hace algo
parecido a</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
 mkdir /tmp/dos.$$
 DOSTMP=/tmp/dos.$$; export DOSTMP
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y luego un peque&ntilde;o truco para conseguir que </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
echo $* &gt; $DOSTMP/startup.bat
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>realmente funcione (un peque&ntilde;o programa en C que cambie las '/' por
'<CODE>\</CODE>' y termine las l&iacute;neas de forma correcta para <I>messy
dos</I> utilizando cr/lf y a&ntilde;adiendo <CODE>^Z</CODE> al final de archivo), cree
archivos de arranque, enlaces y dem&aacute;s en este directorio, y luego inicie
dosemu. Dentro del "<CODE>autoexec.bat</CODE>" la unidad <CODE>c:</CODE> est&aacute;
redireccionada del <CODE>hdimage</CODE> al directorio temporal, el cual tiene
enlaces para <CODE>$HOME</CODE> y <CODE>$PWD</CODE>. </P>
<P>Luego, si quiero ver mis archivos reducidos a 8.3 caracteres puedo
escribir "<CODE>DOS dir</CODE>" y as&iacute; tendr&eacute; el listado de mi directorio
actual. De forma que tengo un DOS multiusuario (No tengo ninguna partici&oacute;n
de DOS y redireccionando hacia Linux se preservan los permisos de usuario)
y multitarea (ya que las sesiones de dosemu son completamente
independientes).  Hice esto una vez para poder utilizar un controlador del
dos para mi impresora. Actualmente mi <CODE>printcap df</CODE> es un programa de
DOS. De forma que puede hacer que algunos ejecutables del DOS act&uacute;en como
filtros de impresi&oacute;n. </P>


<HR>
<A HREF="Dosemu-Como-4.html">Anterior</A>
<A HREF="Dosemu-Como-6.html">Siguiente</A>
<A HREF="Dosemu-Como.html#toc5">Indice</A>
</BODY>
</HTML>
