<HTML>
<HEAD>
<TITLE>Noticias COMO: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Noticias-Como-2.html">Siguiente</A>
<A HREF="Noticias-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>La intenci&oacute;n de este documento es contestar a algunas de las preguntas y
comentarios que parecen encajar en la definici&oacute;n de "preguntas frecuentes" 
sobre programas de noticias bajo Linux en general, y la versi&oacute;n en la
distribuci&oacute;n Slackware en particular. </P>
<P>Este documento, junto con los "COMOS" de correo y UUCP, sustituye al
<CODE>UUCP-NEWS-MAIL-FAQ</CODE> que anteriormente se publicaba en
<CODE>comp.os.linux.announce</CODE>. </P>

<H2><A NAME="ss1.1">1.1 Nuevas versiones de este documento</A></H2>


<P>Las nuevas versiones de este documento ser&aacute;n peri&oacute;dicamente publicadas en
<CODE>comp.os.linux.announce</CODE>, <CODE>comp.answers</CODE>, y <CODE>news.answers</CODE>. 
Tambi&eacute;n ser&aacute;n enviadas a los diversos servidores FTP an&oacute;nimos que archivan
tal informaci&oacute;n, incluyendo <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO">ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO</A></CODE>
<SL><I>N. del
T.</I>/: El autor se refiere, l&oacute;gicamente, a la versi&oacute;n original en ingl&eacute;s.</SL>
</P>
<P>Adem&aacute;s, tambi&eacute;n deber&iacute;a ser posible encontrar este documento en la Linux
<I>WorldWideWeb home page</I> en <CODE>
<A HREF="http://sunsite.unc.edu/mdw/linux.html">http://sunsite.unc.edu/mdw/linux.html</A></CODE>. </P>


<H2><A NAME="ss1.2">1.2 Sugerencias, cr&iacute;ticas y comentarios.</A></H2>


<P>Estoy interesado en recibir por correo electr&oacute;nico cualquier comentario,
positivo o negativo, relativo al contenido de este documento. P&oacute;ngase en
contacto conmigo si encuentra errores u omisiones obvias. </P>
<P>Leo, aunque no necesariamente respondo, todo el correo electr&oacute;nico que
recibo. Las peticiones para mejorar este documento ser&aacute;n consideradas
seg&uacute;n la combinaci&oacute;n que se d&eacute; ese d&iacute;a entre tiempo disponible, m&eacute;rito de
la petici&oacute;n, y presi&oacute;n sangu&iacute;nea <CODE>:-)</CODE> </P>
<P>Los insultos ir&aacute;n silenciosamente a <CODE>/dev/null</CODE>, as&iacute; que no se
moleste. </P>
<P>Particularmente, el est&aacute;ndar sobre rutas para el sistema de archivos de
Linux es algo en evoluci&oacute;n. Lo que aparece en este documento son s&oacute;lo
ejemplos basados en el est&aacute;ndar en curso a la hora de escribirlo, y en las
rutas usadas en las distribuciones o paquetes de programas que he visto
personalmente. Por favor, consulte su distribuci&oacute;n particular de Linux
para saber qu&eacute; rutas utiliza. </P>
<P>Los comentarios sobre el formato del documento deber&iacute;an ir dirigidos al
coordinador de los <I>HOWTO</I>: Greg Hankins (<CODE>
<A HREF="mailto:gregh@sunsite.unc.edu">gregh@sunsite.unc.edu</A></CODE>). </P>


<H2><A NAME="ss1.3">1.3 Informaci&oacute;n sobre el copyright</A></H2>


<P>El <I>News-HOWTO</I> es copyright (c)1994 Vince Skahan.</P>
<P>Pueden reproducirse o distribuirse copias literales de este documento en
cualquier medio f&iacute;sico o electr&oacute;nico sin permiso del autor. Las
traducciones est&aacute;n igualmente permitidas sin permiso expreso si se incluye
un aviso sobre qui&eacute;n hizo la traducci&oacute;n. </P>

<P>Se pueden usar peque&ntilde;as citas del documento sin consentimiento previo del
autor. Los trabajos derivados y distribuciones parciales del
<I>News-HOWTO</I> deben ser acompa&ntilde;ados ya sea con una copia literal de este
fichero o con una referencia a la copia original. </P>
<P>Se permite y se insta a la redistribuci&oacute;n comercial. Sin embargo, al autor
le gustar&iacute;a ser avisado de tales distribuciones (como cortes&iacute;a). </P>
<P>En resumen, deseamos promover la diseminaci&oacute;n de esta informaci&oacute;n por
tantos canales como sea posible. Sin embargo, deseamos mantener el
copyright de los documentos <I>HOWTO</I>. </P>
<P>Es m&aacute;s, deseamos diseminar TODA la informaci&oacute;n contenida en los
<I>HOWTO</I>. Si tiene alguna pregunta, por favor contacte con Greg Hankins,
el coordinador de los HOWTO de Linux en <CODE>
<A HREF="mailto:gregh@sunsite.unc.edu">gregh@sunsite.unc.edu</A></CODE>. </P>


<H2><A NAME="ss1.4">1.4 Nota de descargo</A></H2>


<P>Por supuesto, no asumo ninguna responsabilidad potencial por los
contenidos de este documento. El uso de los conceptos, ejemplos, y/u otros
contenidos de este documento es un riesgo que el lector debe asumir como
propio. </P>

<H3>&Iacute;dem sobre la traducci&oacute;n</H3>


<P>El traductor no se responsabiliza de los contenidos de este documento. 
Tampoco tiene por qu&eacute; compartir ninguna opini&oacute;n, criterio, gusto, estilo,
sugerencia o afirmaci&oacute;n del autor. Ante cualquier duda, cons&uacute;ltese el
original en ingl&eacute;s. </P>


<H2><A NAME="ss1.5">1.5 Otras fuentes de informaci&oacute;n</A></H2>



<H3>Usenet</H3>


<P>
<UL>
<LI><CODE>news.admin.misc</CODE> Sobre la administraci&oacute;n de noticias en general. 
</LI>
<LI><CODE>news.admin.policy</CODE>       Normativas de Usenet.
</LI>
<LI><CODE>news.admin.technical</CODE> Mantenimiento de noticias de red.
(Moderado) 
</LI>
<LI><CODE>news.software.b</CODE>         Sobre B-news y programas compatibles.</LI>
<LI><CODE>news.software.nn</CODE>        Sobre el lector de noticias "<CODE>nn</CODE>".
</LI>
<LI><CODE>news.software.nntp</CODE> Protocolo de Transferencia de Noticias en
Red. 
</LI>
<LI><CODE>news.software.readers</CODE>   Programas para leer noticias.</LI>
<LI><CODE>news.sysadmin</CODE>           Comentarios a administradores de sistemas.
</LI>
<LI><CODE>news.announce.newusers</CODE> Explicaciones para nuevos usuarios.
(Moderado) 
</LI>
<LI><CODE>news.newusers.questions</CODE> Preguntas y respuestas para nuevos usuarios.</LI>
</UL>
</P>

<H3>Libros</H3>


<P>A continuaci&oacute;n, una lista no exhaustiva de libros que pueden ayudar.</P>
<P>
<UL>
<LI>"<I>Managing UUCP and USENET</I>", publicado por
O'Reilly &amp; Associates, es en mi opini&oacute;n el mejor libro para conocer los
programas y protocolos necesarios para ser parte de Usenet. 
</LI>
<LI>"<I>Unix Communications</I>", publicado por The Waite Group,
contiene una buena descripci&oacute;n de todas las piezas (y m&aacute;s), y c&oacute;mo encajan
unas con otras. 
</LI>
<LI>"<I>Practical Unix Security</I>" publicado por
O'Reilly &amp; Associates, contiene una buena disertaci&oacute;n sobre seguridad en
UUCP en general. 
</LI>
<LI>"<I>The Internet Complete Reference</I>", de Osborne, es un buen
libro de referencia que explica los diversos servicios disponibles en
Internet, siendo una buena fuente de informaci&oacute;n sobre noticias, correo, y
otros varios recursos de Internet. 
</LI>
<LI>"<I>The Linux Networking Administrators' Guide</I>", de Olaf Kirch
del Linux DOC Project, est&aacute; disponible en la red y tambi&eacute;n publicado por
(al menos) O'Reilly y SSC 
<SL><I>N. del T.</I>/: Tambi&eacute;n disponible 
en castellano bajo
el t&iacute;tulo de <I>Gu&iacute;a de administraci&oacute;n de redes con Linux</I>. V&eacute;ase
secci&oacute;n 
<A HREF="Noticias-Como-8.html#Grupos">Grupos</A></SL>
. Es una buena manera de
aprender sobre todo lo que sobre redes de Unix pueda imaginarse. 
</LI>
</UL>
</P>


<H2><A NAME="ss1.6">1.6 D&oacute;nde NO buscar ayuda</A></H2>


<P>No hay nada "especial" en configurar y mantener las noticias de Usenet
bajo Linux. Por lo tanto, no se deber&iacute;a publicar preguntas gen&eacute;ricas sobre
noticias en los grupos <CODE>comp.os.linux.*</CODE>.</P>
<P>Al menos que su pregunta sea realmente espec&iacute;fica sobre Linux (p. ej.,
<I>``¿qu&eacute; parches se necesitan para ejecutar <CODE>INN</CODE> con el <CODE>bash1.12</CODE> en
SLS v1.03?''</I>)  deber&iacute;a publicar sus preguntas en los grupos mencionados
arriba.</P>
<P>Perm&iacute;taseme repetir esto.</P>
<P>Ya no hay virtualmente ninguna raz&oacute;n para publicar nada relacionado con
las noticias en la jerarqu&iacute;a <CODE>comp.os.linux.*</CODE> Existen grupos en la
jerarqu&iacute;a <CODE>news.*</CODE> para manejar *TODAS* sus preguntas. </P>
<P><EM>SI PUBLICA VD. EN COMP.OS.LINUX.* PREGUNTAS NO ESPEC&Iacute;FICAS SOBRE LINUX,
EST&Aacute; BUSCANDO AYUDA EN EL SITIO EQUIVOCADO. LOS EXPERTOS EN NOTICIAS DE
USENET EST&Aacute;N EN LOS GRUPOS ANTERIORMENTE MENCIONADOS Y GENERALMENTE NO
USAN LINUX. </EM></P>
<P><EM>HACER PREGUNTAS NO ESPEC&Iacute;FICAS DE LINUX EN LA JERARQU&Iacute;A LINUX ES UN
DESPERDICIO DE TIEMPO PARA VD. Y PARA TODOS LOS DEM&Aacute;S, Y FRECUENTEMENTE LO
&Uacute;NICO QUE CONSEGUIR&Aacute; ES RETRASAR LA RESPUESTA A SUS PREGUNTAS. </EM></P>


<HR>
Anterior
<A HREF="Noticias-Como-2.html">Siguiente</A>
<A HREF="Noticias-Como.html#toc1">Indice</A>
</BODY>
</HTML>
