<HTML>
<HEAD>
<TITLE>Noticias COMO: Lectores de noticias</TITLE>
</HEAD>
<BODY>
<A HREF="Noticias-Como-4.html">Anterior</A>
<A HREF="Noticias-Como-6.html">Siguiente</A>
<A HREF="Noticias-Como.html#toc5">Indice</A>
<HR>
<H2><A NAME="s5">5. Lectores de noticias</A></H2>


<P>No existe un "lector de noticias verdadero". Como resultado, hay muchos
lectores bien conocidos que se compilan f&aacute;cilmente bajo Linux en
particular.  En el momento de escribir esto, "<CODE>tin</CODE>",
"<CODE>trn</CODE>", y "<CODE>nn</CODE>" est&aacute;n en la mayor&iacute;a de las distribuciones
de Linux disponibles y en <CODE>newspack</CODE>. </P>
<P>A la hora de elegir un lector de noticias, se requiere b&aacute;sicamente algo
que sea f&aacute;cil de usar, muy configurable por el usuario, y con capacidad
para ordenar por hebras y filtrar los art&iacute;culos (seleccionar los art&iacute;culos
interesantes o hacer que los no interesantes no aparezcan en absoluto). </P>
<P>Puede configurar sus rutas como quiera en tanto en cuanto todos los
lectores puedan encontrar "<CODE>inews</CODE>" de su instalaci&oacute;n de <CODE>Cnews</CODE>
o <CODE>INN</CODE>, y el programa "<CODE>mail</CODE>" para mandar respuestas por
correo electr&oacute;nico a los art&iacute;culos.</P>
<P>Esta secci&oacute;n tratar&aacute; brevemente sobre varios de los lectores m&aacute;s
populares.  Antes de que pregunte, yo uso "<CODE>nn</CODE>" por un mont&oacute;n de
razones <CODE>:-)</CODE> </P>

<H2><A NAME="ss5.1">5.1 Tin</A></H2>


<P>Tin es un lector con capacidad de ordenamiento en hebras que trata de ser
f&aacute;cil para los nuevos usuarios. Soporta filtrado de art&iacute;culos y hebras
NOV.  Si utiliza Vd. <CODE>INN</CODE>, leer&aacute; los ficheros <CODE>.overview</CODE> por
defecto, y no escribir&aacute; ficheros &iacute;ndice. </P>
<P>Para compilar Tin bajo Linux, simplemente edite el fichero <CODE>Makefile</CODE>
para indicar d&oacute;nde se encuentran ciertos programas (especialmente la
ubicaci&oacute;n de <CODE>inews</CODE>) y teclee "<CODE>make linux</CODE>". No se requiere ning&uacute;n
parche para <CODE>tin</CODE> bajo Linux.</P>
<P>Para ordenar los art&iacute;culos en hebras, puede simplemente invocar a <CODE>tin</CODE>
con el par&aacute;metro "<CODE>-u</CODE>" para actualizar los ficheros &iacute;ndice. </P>
<P>Para usar la capacidad de <CODE>tin</CODE> para leer v&iacute;a <CODE>NNTP</CODE>, comp&iacute;lese con
"<CODE>NNTP_ABLE</CODE>"  definido. Esto resultar&aacute; en un fichero llamado
"<CODE>tin</CODE>" para el servidor local y otro llamado "<CODE>rtin</CODE>" para lectura
<CODE>NNTP</CODE>. "<CODE>tin -r</CODE>" obtendr&aacute; el mismo resultado que "<CODE>rtin</CODE>".</P>
<P>Iain Lea recomienda la siguiente entrada de <CODE>crontab</CODE>, y dice que se
necesita hacer un "<CODE>make daemon</CODE>" para compilar <CODE>tind</CODE>.</P>
<P>
<PRE>
        # ordenar en hebras
        35 * * * * /usenet/bin/tind -u
</PRE>
</P>
<P>He usado <CODE>tin</CODE> sobre un enlace SLIP como lector <CODE>NNTP</CODE>. Si
conecta Vd.  con un sistema que disponga de todos los grupos de Usenet, se
har&aacute; muy viejo esperando a que <CODE>tin</CODE> se baje el fichero "<CODE>active</CODE>".</P>


<H2><A NAME="ss5.2">5.2 Trn/Mthreads</A></H2>


<P><CODE>trn</CODE> es un derivado de "<CODE>rn</CODE>" con capacidad para ordenar en hebras. 
<CODE>trn3.2</CODE> y superiores tienen la posibilidad de seleccionar entre
"<CODE>mthreads</CODE>" (el creador de hebras de <CODE>trn</CODE>) o NOV (creador de
hebras de <CODE>INN</CODE>).</P>
<P>Para compilarlo, simplemente ejecute <CODE>Configure</CODE> y acepte las opciones
por defecto. Es posible que necesite <CODE>lib4.4.1</CODE> y <CODE>bash-1.13</CODE> (hay
una beta disponible en varios servidores de archivos de Linux) para
ejecutar <CODE>Configure</CODE> con &eacute;xito. Probablemente necesitar&aacute; tanto
<CODE>bash1.13</CODE> como <CODE>libs4.4.1</CODE> para conseguir que el nuevo
<CODE>Configure</CODE> funcione correctamente. </P>
<P>La distribuci&oacute;n <CODE>newspak</CODE> de sunsite contiene ficheros de configuraci&oacute;n
funcionales para <CODE>trn</CODE> bajo Linux.</P>
<P>Es probablemente poco deseable intentar editar un <CODE>config.sh</CODE> a mano, a
menos que est&eacute; Vd. haciendo algo *MUY* sencillo, como cambiar las rutas
para adecuarlas a sus gustos. Si hace esto, necesitar&aacute; ejecutar
"<CODE>Configure -S</CODE>"  antes de "<CODE>make depend</CODE>", "<CODE>make</CODE>" y "<CODE>make
install</CODE>".</P>
<P>Aunque "<CODE>Configure</CODE>" falla generalmente bajo Linux con <CODE>bash1.12</CODE>,
"<CODE>Configure -S</CODE>" funciona bien, as&iacute; que si toma Vd. el <CODE>config.sh</CODE>
de <CODE>newspak</CODE> como punto de partida, estar&aacute; muy cerca.</P>
<P>Compilar con soporte <CODE>NNTP</CODE> es tan simple como contestar "<CODE>yes</CODE>"
cuando <CODE>Configure</CODE> le pregunte si lo quiere (suponiendo que
<CODE>Configure</CODE> funciona en su sistema). Un futuro lanzamiento de
<CODE>newspak</CODE> incluir&aacute; un <CODE>config.sh</CODE> para <CODE>NNTP</CODE>, as&iacute; como el ya
existente para sistema local para aquellos de nosotros que seguimos usando
<CODE>bash1.12</CODE>. </P>
<P>He usado <CODE>trn</CODE> sobre un enlace SLIP como lector <CODE>NNTP</CODE>. Si
conecta Vd.  con un sistema que disponga de todos los grupos de Usenet, se
har&aacute; muy viejo esperando a que <CODE>trn</CODE> se baje el fichero "<CODE>active</CODE>" y
a que ordene los art&iacute;culos.</P>
<P>Hay docenas de par&aacute;metros con los que invocar a <CODE>trn</CODE> para obtener toda
clase de comportamientos. Lea la p&aacute;gina de manual de "<CODE>trn</CODE>" para
conocer los detalles. Yo uso una buena prestaci&oacute;n de <CODE>trn</CODE> para indicar
todos los par&aacute;metros f&aacute;cilmente: </P>
<P>
<UL>
<LI>Cree un fichero <CODE>~/.trnrc</CODE> con todas las opciones</LI>
<LI><CODE>export TRNINIT="~/.trnrc</CODE>"</LI>
</UL>
</P>
<P>La distribuci&oacute;n actual de <CODE>newspak</CODE> tiene una copia de mi <CODE>.trnrc</CODE>
como ejemplo.</P>
<P><CODE>trn3.2</CODE> y superiores permiten elegir al usuario hebras NOV o de
<CODE>mthreads</CODE>. Por lo tanto, recomiendo compilar el programa para permitir
ambos mecanismos (es una pregunta de <CODE>Configure</CODE>). Para elegir uno de
ellos en el momento de ejecuci&oacute;n, pruebe "<CODE>trn -Zo</CODE>" para NOV y
"<CODE>trn -Zt</CODE>" para <CODE>mthreads</CODE>. Yo defino un alias para <CODE>trn</CODE> para
usar el mecanismo deseado. </P>
<P>Para construir la base de datos de <CODE>mthreads</CODE>, haga algo como lo
siguiente en el <CODE>crontab</CODE> de "<CODE>news</CODE>":</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        # crear la base de datos de mthreads
        35 * * * * /usenet/bin/mthreads all
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss5.3">5.3 NN</A></H2>


<P>La distribuci&oacute;n <CODE>newspak</CODE> de sunsite contiene ficheros de configuraci&oacute;n
funcionales para <CODE>nn6.4.18</CODE> que Vd. puede copiar en el lugar adecuado y
teclear "<CODE>make</CODE>" bajo Linux. Tambi&eacute;n funcionan con la beta 6.5b3 de la
pr&oacute;xima actualizaci&oacute;n <CODE>nn6.5</CODE>.</P>
<P>Cuando haya terminado la compilaci&oacute;n, necesita hacer lo siguiente:</P>
<P>
<UL>
<LI>ejecutar el programa "<CODE>inst</CODE>" para instalar cosas.
(instalar todo)
</LI>
<LI>inicializar la base de datos
</LI>
<LI>arrancar <CODE>nnmaster</CODE>
</LI>
</UL>
</P>
<P>Consulte los documentos de <CODE>nn</CODE> para m&aacute;s detalles. Compilar, configurar
y ejecutar <CODE>nn</CODE> bajo Linux no es diferente a ejecutar <CODE>nn</CODE> en
cualquier otro *nix con la excepci&oacute;n de que podr&iacute;a desearse ejecutar
<CODE>nnmaster</CODE> desde <CODE>cron</CODE> en vez de como demonio. Si se ejecuta como
demonio bajo Linux, es posible que tienda a no activarse adecuadamente (de
todas formas el efecto de ejecutarlo desde <CODE>cron</CODE> es el mismo). </P>
<P>El soporte para "<CODE>nn</CODE>" es tan simple como las siguientes entradas de
<CODE>crontab</CODE>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        # ejecutar nnmaster
        # (no necesario si se usa NOV de INN en nn-6.5beta3)
        25 * * * * /usenet/sw/nn/lib/nnmaster

        # purgar la base de datos de nn
        # (no necesario si se usa NOV de INN en nn-6.5beta3)
        0  4       * * * /usenet/sw/nn/bin/nnadmin =EYW 

        # obtener una copia del fichero active de &quot;nngoback&quot; y guardar los
        # ultimos 7
        0 3 * * * /usenet/sw/nn/lib/back_act 7 
</PRE>
</CODE></BLOCKQUOTE>
</P>

<P>He experimentado un poco ejecutando <CODE>nn</CODE> como lector <CODE>NNTP</CODE>
sobre una conexi&oacute;n SLIP. En este caso, querr&aacute; Vd. editar ligeramente el
fichero <CODE>config.h</CODE>. Lea los comentarios del fichero para conocer
los detalles. Cuando se usa como lector <CODE>NNTP</CODE>, <CODE>nn</CODE> ejecuta una
copia local de <CODE>nnmaster</CODE> para mantener la base de datos en el
sistema local, con lo que la selecci&oacute;n de art&iacute;culos es muy r&aacute;pida (aunque
por supuesto hay que esperar un poco al cuerpo del art&iacute;culo si se usa SLIP
con un m&oacute;dem). </P>
<P>La nueva versi&oacute;n (6.5.x) de <CODE>nn</CODE> tiene soporte para la base de
datos NOV de <CODE>INN</CODE>, lo que hace absolutamente innecesario el uso de
<CODE>nnmaster</CODE>. Esta configuraci&oacute;n est&aacute; <EM>altamente</EM> recomendada, ya
que como resultado, no se tendr&aacute; que gastar tiempo de la CPU para ejecutar
<CODE>nnmaster</CODE> en absoluto, y no se producir&aacute;n desfases entre la base
de datos y los art&iacute;culos reales disponibles.</P>


<H2><A NAME="ss5.4">5.4 Otros lectores</A></H2>


<P>A continuaci&oacute;n, una lista no exhaustiva de lectores de noticias que se
dice funcionan bajo Linux: </P>
<P>
<UL>
<LI><CODE>tass</CODE></LI>
<LI><CODE>xrn</CODE></LI>
<LI><CODE>gnus</CODE></LI>
</UL>
</P>


<HR>
<A HREF="Noticias-Como-4.html">Anterior</A>
<A HREF="Noticias-Como-6.html">Siguiente</A>
<A HREF="Noticias-Como.html#toc5">Indice</A>
</BODY>
</HTML>
