<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>El Registro de la Propiedad Intelectual: Pr&oacute;logo</TITLE>
 <LINK HREF="Propiedad-Intelectual-Como-2.html" REL=next>

 <LINK HREF="Propiedad-Intelectual-Como.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Propiedad-Intelectual-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Propiedad-Intelectual-Como.html#toc1">Índice general</A>
<HR>
<H2><A NAME="prologo"></A> <A NAME="s1">1. Pr&oacute;logo</A></H2>

<P>
<P>
<H2><A NAME="ss1.1">1.1 Presentaci&oacute;n</A>
</H2>

<P>
<P>A la hora de escribir mi ensayo <EM>«La empresa ante el software libre»</EM>,
encontr&eacute; un tema acerca del cual se escribe muy poco en el mundo Open Source:
el concepto de propiedad del software. La opini&oacute;n generalizada es que el modelo
Open Source, y la GNU Public License constituyen una renuncia de hecho a la
propiedad sobre el software
<P>Y sin embargo, la propiedad del software es el pilar b&aacute;sico de la GPL: la
legislaci&oacute;n americana y europea son muy expl&iacute;citas: s&oacute;lo el autor de una obra
tiene derecho a especificar los derechos de uso, copia y distribuci&oacute;n 
(copyright) de dicha obra. Para que nosotros, amantes de la GPL, podamos decir
que un programa se distribuye bajo licencia GPL, el programa debe ser
<EM>legalmente</EM> nuestro.
<P>Este documento est&aacute; basado en la informaci&oacute;n que la Comunidad de Madrid ofrece
a trav&eacute;s de su Servicio de Informaci&oacute;n y Documentaci&oacute;n Juvenil acerca de los
derechos, deberes y procedimientos de inscripci&oacute;n en el Registro de la
Propiedad Intelectual.
<P>Una &uacute;ltima observaci&oacute;n: Este documento NO trata expl&iacute;citamente sobre el
software: la legislaci&oacute;n espa&ntilde;ola contempla los programas de ordenador como
«obras art&iacute;sticas, cient&iacute;ficas o literarias»
<P>
<H2><A NAME="ss1.2">1.2 Copyright</A>
</H2>

<P>
<P>Este documento es Copyright de la Comunidad de Madrid, Consejer&iacute;a de Juventud y
Cultura. Su contenido es de libre distribuci&oacute;n y copia, siempre que se cite su
procedencia y autor&iacute;a.
<P>La adaptaci&oacute;n a linuxdoc-sgml ha sido realizada por <EM>Juan Antonio Mart&iacute;nez
Casta&ntilde;o</EM> <CODE> 
<A HREF="mailto:jantonio@dit.upm.es">mailto:jantonio@dit.upm.es</A></CODE> 
<P>El documento original puede encontrarse en las p&aacute;ginas Web de InforJoven: <CODE>
<A HREF="http://www.comadrid.es/inforjoven">http://www.comadrid.es/inforjoven</A></CODE> 
<P>
<HR>
<A HREF="Propiedad-Intelectual-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Propiedad-Intelectual-Como.html#toc1">Índice general</A>
</BODY>
</HTML>
