<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>El Registro de la Propiedad Intelectual: Requisitos de las solicitudes</TITLE>
 <LINK HREF="Propiedad-Intelectual-Como-6.html" REL=next>
 <LINK HREF="Propiedad-Intelectual-Como-4.html" REL=previous>
 <LINK HREF="Propiedad-Intelectual-Como.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="Propiedad-Intelectual-Como-6.html">Página siguiente</A>
<A HREF="Propiedad-Intelectual-Como-4.html">Página anterior</A>
<A HREF="Propiedad-Intelectual-Como.html#toc5">Índice general</A>
<HR>
<H2><A NAME="requisitos"></A> <A NAME="s5">5. Requisitos de las solicitudes</A></H2>

<P>
<P>Todas las solicitudes de inscripci&oacute;n deben contener:
<P>
<UL>
<LI> Nombre, nacionalidad y domicilio del autor o autores.</LI>
<LI> Fotocopia del DNI.</LI>
<LI> Naturaleza y condiciones del derecho que se pretende inscribir.</LI>
</UL>
<P>Dependiendo de la naturaleza del derecho que se desea inscribir, deber&aacute;n
contener adem&aacute;s:
<P>
<UL>
<LI>Cuando se refieran a obras art&iacute;sticas, cient&iacute;ficas y literarias:
<UL>
<LI> T&iacute;tulo de la obra (descripci&oacute;n de la obra que permita su
completa utilizaci&oacute;n).</LI>
<LI>Declaraci&oacute;n de si la obra ha sido o no divulgada. En caso
afirmativo, la fecha y lugar de la divulgaci&oacute;n.</LI>
</UL>
</LI>
<LI>Cuando se refieran a derechos de la propiedad intelectual de los
artistas-int&eacute;rpretes o ejecutantes:
<UL>
<LI>Descripci&oacute;n detallada por escrito, en un m&aacute;ximo de 25 folios, de
la interpretaci&oacute;n, actuaci&oacute;n o ejecuci&oacute;n.</LI>
<LI>Lugar y fecha de la interpretaci&oacute;n, actuaci&oacute;n o ejecuci&oacute;n.</LI>
<LI>T&iacute;tulo y autor de la obra interpretada.</LI>
</UL>
</LI>
<LI>Cuando se refieran a derechos de la propiedad intelectual de los
productores de fonogramas:
<UL>
<LI>N&uacute;mero de dep&oacute;sito legal.</LI>
<LI>T&iacute;tulo y autor de la obra fijada en el fonograma.</LI>
<LI>Tipo de fonograma y sistema de grabaci&oacute;n.</LI>
<LI>Lugar y fecha de publicaci&oacute;n del fonograma.</LI>
</UL>
</LI>
<LI>Cuando se refieran a derechos de propiedad intelectual en los supuestos de
producci&oacute;n de grabaciones audiovisuales:
<UL>
<LI>Un m&aacute;ximo de 25 secuencias, que permitan una identificaci&oacute;n de
la grabaci&oacute;n, y un resumen que no exceda de 25 p&aacute;ginas.</LI>
<LI>Lugar y fecha de la divulgaci&oacute;n, en su caso.</LI>
</UL>
</LI>
<LI>Cuando se refieran a derechos de propiedad intelectual en los supuestos
de meras fotograf&iacute;as:
<UL>
<LI>El solicitante deber&aacute; presentar 2 copias en positivo de 18 por
24 o bien de 24 por 24.</LI>
<LI>Lugar y fecha de la divulgaci&oacute;n, en su caso.</LI>
</UL>
</LI>
</UL>
<P>
<HR>
<A HREF="Propiedad-Intelectual-Como-6.html">Página siguiente</A>
<A HREF="Propiedad-Intelectual-Como-4.html">Página anterior</A>
<A HREF="Propiedad-Intelectual-Como.html#toc5">Índice general</A>
</BODY>
</HTML>
