<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Bridge+Cortafuegos Mini-COMO: ¿Qu&eacute; y por qu&eacute; (y c&oacute;mo)?</TITLE>
 <LINK HREF="Bridge+Cortafuegos-Mini-Como-3.html" REL=next>
 <LINK HREF="Bridge+Cortafuegos-Mini-Como-1.html" REL=previous>
 <LINK HREF="Bridge+Cortafuegos-Mini-Como.html#toc2" REL=contents>
</HEAD>
<BODY>
<A HREF="Bridge+Cortafuegos-Mini-Como-3.html">Página siguiente</A>
<A HREF="Bridge+Cortafuegos-Mini-Como-1.html">Página anterior</A>
<A HREF="Bridge+Cortafuegos-Mini-Como.html#toc2">Índice general</A>
<HR>
<H2><A NAME="queyporque"></A> <A NAME="s2">2. ¿Qu&eacute; y por qu&eacute; (y c&oacute;mo)?</A></H2>

<P>
<P>
<H2><A NAME="que"></A> <A NAME="ss2.1">2.1 Qu&eacute;</A>
</H2>

<P>
<P>Un puente es un cable inteligente que conecta dos tarjetas de red. Un
cortafuegos es un aislante inteligente.
<P>
<H2><A NAME="porque"></A> <A NAME="ss2.2">2.2 Por qu&eacute;</A>
</H2>

<P>
<P>Puede querer un puente cuando tenga varios ordenadores:
<P>
<OL>
<LI>
<A NAME="bridge1"></A> 
para ahorrar el precio de un nuevo concentrador si resulta tener una tarjeta
ethernet de sobra.
</LI>
<LI>
<A NAME="bridge2"></A>  
para ahorrarse la molestia de aprender sobre reenv&iacute;o IP y otros trucos
similares cuando <B>ya tiene</B> dos tarjetas en su ordenador.
</LI>
<LI>
<A NAME="bridge3"></A>  
Para evitar el trabajo de mantenimiento cuando las cosas cambien en el futuro.
</LI>
</OL>
<P>«Varios ordenadores» pueden ser tan pocos como tres si est&aacute;n rutando o
puenteando o simplemente movi&eacute;ndose por la habitaci&oacute;n con frecuencia. Tambi&eacute;n
puede querer un puente s&oacute;lo por la diversi&oacute;n de averiguar qu&eacute; es lo que hace.
De hecho esto (
<A HREF="#bridge2">2</A>) es para lo que yo lo quer&iacute;a. 
<P>Si realmente est&aacute; interesado en el punto 
<A HREF="#bridge1">1</A>, debe ser
uno de los pocos.  Lea los documentos Redes-En-Linux-Como, <CODE>
<A HREF="http://www.insflug.org/documentos/Redes-En-Linux-Como/">http://www.insflug.org/documentos/Redes-En-Linux-Como/</A></CODE> y Serie-Como
<CODE>
<A HREF="http://www.insflug.org/documentos/Serie-Como/">http://www.insflug.org/documentos/Serie-Como/</A></CODE> en busca de trucos
mejores.
<P>Querr&aacute; un cortafuegos si
<P>
<OL>
<LI>
<A NAME="firewall1"></A> trata de proteger su red de accesos externos, o
</LI>
<LI>
<A NAME="firewall2"></A> quiere denegar el acceso al mundo exterior desde su
red.
</LI>
</OL>
<P>Curiosamente yo necesitaba el punto 
<A HREF="#firewall2">2</A> tambi&eacute;n aqu&iacute;.
La pol&iacute;tica de mi universidad es que no debemos actuar como proveedores de
servicios internet a los pregraduados.
<P>
<H2><A NAME="como"></A> <A NAME="ss2.3">2.3 ¿C&oacute;mo?</A>
</H2>

<P>
<P>Comenc&eacute; haciendo puente entre las tarjetas de red de un cortafuegos, y acab&eacute;
haciendo un cortafuegos sin quitar el puente. Parece funcionar y es m&aacute;s
flexible que cualquiera de las configuraciones por s&iacute; solas. Puedo tirar el
firewall y seguir haciendo puente o tirar el puente cuando quiero ser m&aacute;s
prudente.
<P>Supongo que el c&oacute;digo del puente est&aacute; justo encima del c&oacute;digo de la capa f&iacute;sica
y que el c&oacute;digo del cortafuegos est&aacute; una capa m&aacute;s arriba, as&iacute; que el puente y
el cortafuegos act&uacute;an como si estuvieran ejecutando juntos, «secuencialmente» y
no «en paralelo» (¡vaya!). diagrama: 
<P>
<BLOCKQUOTE><CODE>
<PRE>
-> Entrada-puente -> Entrada-cortafuegos -> Kernel -> Salida-cortafuegos -> Salida-puente ->
</PRE>
</CODE></BLOCKQUOTE>
<P>No hay otra manera de explicar c&oacute;mo una m&aacute;quina puede ser «conductor» y
«aislante» a la vez. Hay varias advertencias sobre esto, pero las detallar&eacute;
mas tarde. B&aacute;sicamente deber&aacute; rutar los paquetes que quiera sean considerados
por el firewall. De cualquier manera, parece funcionar bien de manera conjunta.
Esto es lo que har&aacute;...
<P>
<HR>
<A HREF="Bridge+Cortafuegos-Mini-Como-3.html">Página siguiente</A>
<A HREF="Bridge+Cortafuegos-Mini-Como-1.html">Página anterior</A>
<A HREF="Bridge+Cortafuegos-Mini-Como.html#toc2">Índice general</A>
</BODY>
</HTML>
