<HTML>
<HEAD>
<TITLE>Linux Meta-FAQ: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="MetaFAQ-Como-2.html">Siguiente</A>
<A HREF="MetaFAQ-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>
<DL>
<DT><B>¿Qu&eacute; es Linux?</B><DD><P>Linux es una implementaci&oacute;n de sistemas operativos POSIX independiente
de la especificaci&oacute;n, con extensiones de SYSV y de BSD, que ha
sido escrita de la nada. No incluye ning&uacute;n c&oacute;digo propietario. Linux
es distribuible libremente bajo la "GNU Public License". Funciona en
compatibles IBM PC con bus ISA o EISA (incluyendo las variantes de
bus local como PCI y VLB) y con procesador 386 o superior.</P>
<P>Adem&aacute;s, tambi&eacute;n funciona en algunos Amiga y Atari con MMU (unidad de
gesti&oacute;n de memoria). Esto es, 68020 con MMU externa, 68030 o 68040.
Una FPU (unidad de punto flotante) tambi&eacute;n es requerida y lo ser&aacute;
hasta que alguien escriba un emulador de FPU.</P>
<P>Respecto del soporte para las Alpha de DEC est&aacute; actualmente en
desarrollo el n&uacute;cleo y DEC ha sacado una distribuci&oacute;n denominada
"BLADE" disponible en ftp.dec.com en el directorio /pub/DEC/Linux-Alpha/.
El Linux comercial de Red Hat est&aacute; ahora disponible tambi&eacute;n para las
Alpha.</P>
<P>El soporte para las Sparc est&aacute; progresando r&aacute;pidamente y tanto Red
Hat como Debian han anunciado la pr&oacute;xima llegada de distribuciones
para ellas.</P>
<P>Soportes para ARM, PowerPC y MIPS est&aacute;n en distintas fases de
desarrollo, pero no lo esperes ya. Lee comp.os.linux.announce
en su lugar.</P>
<P>Lee la FAQ para conocer los requisitos de hardware con m&aacute;s
exactitud. El n&uacute;cleo de Linux est&aacute; escrito por Linus Torvalds
(Linus.Torvalds@.Helsinki.FI) de Finlandia y por otros voluntarios.
La mayor parte de los programas que corren en Linux son programas
gratuitos de Unix, muchos de ellos del proyecto GNU.</P>

<DT><B>FAQ de Linux</B><DD><P>Una colecci&oacute;n de problemas comunes y sus soluciones. Respuestas a
muchas preguntas con mayor rapidez que en la red. Almacenadas en
muchos FTP sites de Linux (incluyendo /pub/linux/docs en
tsx-11.mit.edu) y en rtfm.mit.edu el site general para las FAQ's.</P>

<DT><B>HOWTO's sobre Linux</B><DD><P>Son similares a las FAQ's, pero en lugar de responder cuestiones
t&iacute;picas explican c&oacute;mo hacer tareas comunes, como encargar una
distribuci&oacute;n de Linux, configurar los servicios de impresi&oacute;n bajo
Linux, establecer un enlace UUCP b&aacute;sico, etc. Ver sunsite.unc.edu,
directorio /pub/Linux/docs/HOWTO/ para las versiones definitivas de
todos los HOWTO's. Otros sites que mantienen copias actualizadas de
los HOWTO's son ftp.cc.gatech.edu y tsx-11.mit.edu.</P>
<P>Adem&aacute;s hay muchos peque&ntilde;os documentos, sin formato fijo, llamados
"mini-HOWTOs". Estos documentos cubren asuntos muy concretos, tales
como BogoMIPS o Color-ls. Est&aacute;n disponibles en el directorio
/pub/Linux/docs/HOWTO/mini/</P>

<DT><B>Grupos de noticias sobre Linux</B><DD><P>Hay diversos grupos de noticias de USENET para Linux. No es mala
idea seguir al menos comp.os.linux.announce si usas Linux. Este
grupo est&aacute; moderado por Lars Wirzenius. Para presentar documentos al
grupo de noticias escribe a la direcci&oacute;n linux-announce@news.ornl.gov.
Puedes dirigir tus cuestiones sobre comp.os.linux.announce a Lars
Wirzenius, wirzeniu@kruuna.helsinki.fi</P>
<P>El grupo de noticias comp.os.linux.announce es un grupo de noticias
moderado para anuncios sobre Linux (nuevos programas, correcci&oacute;n de
errores, etc).</P>
<P>El grupo de noticias comp.os.linux.answers es un grupo de noticias
moderado al que se env&iacute;an la Linux FAQ, los HOWTO's y otros
documentos.</P>
<P>El grupo de noticias comp.os.linux.setup es un grupo de noticias no
moderado para la discusi&oacute;n de asuntos y problemas relativos a la
puesta en funcionamiento de sistemas Linux.</P>
<P>El grupo de noticias comp.os.linux.admin es un grupo de noticias no
moderado para la discusi&oacute;n sobre la administraci&oacute;n de un sistema
Linux.</P>
<P>El grupo de noticias comp.os.linux.development.system es un grupo de
noticias no moderado dedicado espec&iacute;ficamente a la discusi&oacute;n sobre
el desarrollo del <B>kernel</B> (n&uacute;cleo) de Linux. Las &uacute;nicas cuestiones
sobre desarrollo de aplicaciones que deben ser discutidas aqu&iacute; son
aquellas que est&aacute;n &iacute;ntimamente ligadas al n&uacute;cleo. Todas las dem&aacute;s
cuestiones de desarrollo son probablemente gen&eacute;ricas de Unix y deben
ser dirigidas un grupo de comp.unix, a menos que sean preguntas muy
ligadas a Linux, en cuyo caso deben ser enviadas a
comp.os.linux.apps.</P>
<P>El grupo de noticias comp.os.linux.development.apps es un grupo de
noticias no moderado destinado a la discusi&oacute;n sobre el desarrollo de
aplicaciones en relaci&oacute;n con Linux. No est&aacute; para discutir sobre el
lugar en el que se puede conseguir una aplicaci&oacute;n para Linux, ni
para discusi&oacute;n entre aquellos que quieren aplicaciones para Linux.</P>
<P>El grupo de noticias comp.os.linux.hardware es para preguntas de
hardware espec&iacute;ficas de Linux.</P>
<P>El grupo de noticias comp.os.linux.networking es para preguntas
espec&iacute;ficas de Linux sobre desarrollo de redes y su puesta a punto.</P>
<P>El grupo de noticias comp.os.linux.x es para cuestiones sobre
X-Windows relativas a Linux.</P>
<P>El grupo de noticias comp.os.linux.misc es para cualquier discusi&oacute;n
que no est&eacute; cubierta en las tem&aacute;ticas de los anteriores grupos.</P>
<P>Por norma, <B>no</B> reenv&iacute;es entre los grupos de noticias de Linux. El
&uacute;nico reenv&iacute;o que es aceptable es un env&iacute;o ocasional de un grupo no
moderado a comp.os.linux.announce. La raz&oacute;n para dividir
comp.os.linux en varios grupos es reducir el tr&aacute;fico en cada uno.
Aquellos que no sigan esta regla ser&aacute;n fulminados sin piedad...</P>

<DT><B>Otros grupos de noticias</B><DD><P>No creas que todas tus preguntas son apropiadas para un grupo de
Linux s&oacute;lo porque t&uacute; trabajes en Linux. ¿No es tu pregunta realmente
sobre la progamaci&oacute;n de la shell en cualquier unix o cl&oacute;nico de
unix?. Entonces pregunta en comp.unix.shell. ¿Es sobre GNU Emacs?.
Entonces prueba en gnu.emacs.help. Adem&aacute;s, si no conoces otro grupo
en el que preguntar, pero piensas que lo debe haber, pregunta
cort&eacute;smente si hay otro grupo que sea m&aacute;s apropiado para tu
cuesti&oacute;n. Al menos los grupos
comp.unix.{questions,shell,programming,bsd,admin} adem&aacute;s de
comp.windows.x.i386unix deber&iacute;an ser &uacute;tiles para un usuario de
Linux.</P>

<DT><B>El World-Wide Web</B><DD><P>Greg Hankins, gregh@cc.gatech.edu, mantiene la p&aacute;gina web madre para
el proyecto Linux. Su URL es http://sunsite.unc.edu/mdw/linux.html</P>

<DT><B>Linux Journal</B><DD><P>Una revista llamada <EM>Linux Journal</EM> apareci&oacute; hace m&aacute;s de un a&ntilde;o.
Incluye art&iacute;culos destinados a casi cualquier nivel y pretende ser
de ayuda a todos los usuarios de Linux. La subscripci&oacute;n por un a&ntilde;o
cuesta $22 en USA, $27 en Canada y M&eacute;jico, y $32
en cualquier otro pa&iacute;s, pagables en moneda USA. Las solicitudes de
subscripci&oacute;n pueden ser enviadas por email a subs@ssc.com, por fax a
+1-206-782-7191, por tel&eacute;fono a +1-206-782-7733 o por correo a Linux
Journal, PO Box 85867, Seattle, WA 98145-1867 USA. SSC tiene una
clave PGP p&uacute;blica por si quieres enviar el n&uacute;mero de tu tarjeta de
cr&eacute;dito v&iacute;a email encriptado: haz finger a info@ssc.com</P>

<DT><B>Los Mapas</B><DD><P>La informaci&oacute;n del software gratuito disponible para Linux puede ser
encontrada en el "Linux Software Map", que est&aacute; en sunsite.unc.edu
en /pub/Linux/docs/LSM.gz</P>
<P>Informaci&oacute;n de proyectos no comerciales puede ser encontrada en el
"Projects Map", que es enviado ocasionalmente a
comp.os.linux.announce y guardado en sunsite.unc.edu en el
directorio /pub/Linux/docs/Projects-Map/Projects-Map.gz</P>
<P>Informaci&oacute;n sobre productos comerciales puede ser encontrada en el
"Linux Commercial Products Map" que es enviado ocasionalmente a
comp.os.linux.announce</P>

</DL>
</P>

<HR>
Anterior
<A HREF="MetaFAQ-Como-2.html">Siguiente</A>
<A HREF="MetaFAQ-Como.html#toc1">Indice</A>
</BODY>
</HTML>
