<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Instalaci&oacute;n y configuraci&oacute;n de un servidor de IRC: Cliente de IRC</TITLE>
 <LINK HREF="Servidor-IRC-Como-6.html" REL=next>
 <LINK HREF="Servidor-IRC-Como-4.html" REL=previous>
 <LINK HREF="Servidor-IRC-Como.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="Servidor-IRC-Como-6.html">Página siguiente</A>
<A HREF="Servidor-IRC-Como-4.html">Página anterior</A>
<A HREF="Servidor-IRC-Como.html#toc5">Índice general</A>
<HR>
<H2><A NAME="s5">5. Cliente de IRC</A></H2>

<P>
<P>
<H2><A NAME="ss5.1">5.1 Funci&oacute;n de un cliente de IRC </A>
</H2>

<P>
<P>La funci&oacute;n de un cliente de IRC es conectarse al servidor y filtrar la
informaci&oacute;n disponible para cada usuario. Adem&aacute;s, debe encargarse de enviar
los mensajes y comandos que escribe el usuario mediante el protocolo de IRC.
<P>El cliente habitualmente reside en la m&aacute;quina del usuario y se conecta al
servidor a trav&eacute;s de un puerto (generalmente el 6667). Existen clientes de
IRC para todas las plataformas, dado que no es necesario que la plataforma
cliente coincida con la del servidor. En los sistemas Windows, el cliente m&aacute;s
popular es el <I>mIRC</I>, que nosotros elegimos para hacer las primeras
pruebas y asegurarnos de que el <I>demonio</I> estaba funcionando
correctamente. Una vez confirmado el buen funcionamiento del servidor,
instalamos un cliente para Linux. Para esta plataforma, la oferta es muy
grande. Los m&aacute;s conocidos son:
<P>
<UL>
<LI><I>Kirc</I> (<CODE>
<A HREF="ftp://ftp.kde.org/">ftp://ftp.kde.org/</A></CODE>): el m&aacute;s antiguo cliente en el entorno
<I>KDE</I>.  Tiene un entorno gr&aacute;fico muy cuidado, pero carece de algunas
caracter&iacute;sticas b&aacute;sicas.
</LI>
<LI><I>Ksirc</I> (<CODE>
<A HREF="http://www.ksirc.org/">http://www.ksirc.org/</A></CODE>): tambi&eacute;n para el <I>KDE</I> y resultado
de la evoluci&oacute;n de un cliente en modo texto (el <I>Sirc</I>). Est&aacute; todav&iacute;a en
fase de desarrollo.  
</LI>
<LI><I>Keric</I> (<CODE>
<A HREF="http://www.indonesia-undernet.org/keirc">http://www.indonesia-undernet.org/keirc</A></CODE>): otro m&aacute;s que funciona
bajo <I>KDE</I> y es uno de los m&aacute;s prometedores, aunque a&uacute;n est&aacute; muy lejos
de poder ofrecer una versi&oacute;n completamente estable.
</LI>
<LI><I>BitchX</I> (<CODE>
<A HREF="http://www.bitchx.com/">http://www.bitchx.com/</A></CODE>): el cliente en modo texto preferido por los
usuarios de Linux.
</LI>
<LI><I>ScrollZ</I> (<CODE>
<A HREF="http://www.scrollz.com/">http://www.scrollz.com/</A></CODE>): tiene caracter&iacute;sticas similares al
<I>BitchX</I>, y es el m&aacute;s veterano de todos, lo que le permite alcanzar una
buena velocidad y un gran nivel de optimizaci&oacute;n (menor consumo de recursos).
</LI>
<LI><I>YagIRC</I> (<CODE>
<A HREF="http://www.sicom.fi/~ikioma/yagirc.html">http://www.sicom.fi/~ikioma/yagirc.html</A></CODE>). Cliente para el entorno
<I>GNOME</I>, bastante reciente y capaz de mostrar un interfaz en modo texto
o en modo gr&aacute;fico.</LI>
</UL>
<P>
<H2><A NAME="ss5.2">5.2 Descripci&oacute;n de <I>BitchX</I> </A>
</H2>

<P>
<P>Entre sus caracter&iacute;sticas est&aacute;n:
<P>
<UL>
<LI>Varias conversaciones en el mismo canal.</LI>
<LI>M&uacute;ltiples servidores.</LI>
<LI>Autocompletado de <I>nicks</I>.</LI>
<LI>Soporte para <I>scripts</I>.</LI>
<LI>Cliente de FTP incorporado.</LI>
<LI>Nuevas caracter&iacute;sticas exclusivas, como son: cliente de correo
integrado y un reproductor de CDs musicales.</LI>
</UL>
<P>
<H2><A NAME="ss5.3">5.3 Obtenci&oacute;n e instalaci&oacute;n </A>
</H2>

<P>
<P>El <I>BitchX</I> puede conseguirse en <CODE>
<A HREF="http://www.bitchx.com/">http://www.bitchx.com/</A></CODE>, desde donde
se pueden conseguir varios ficheros: uno de ellos contiene el paquete b&aacute;sico y
los dem&aacute;s son accesorios opcionales.
<P>Tras descomprimir y desempaquetar el fichero con la orden <I>tar</I> en el
directorio <CODE>/usr/local/BitchX/</CODE>, obtendremos directamente los
ejecutables, puesto que se distribuye con los fuentes ya compilados.
<P>
<H2><A NAME="ss5.4">5.4 Configuraci&oacute;n </A>
</H2>

<P>
<P>No contiene ning&uacute;n fichero de configuraci&oacute;n, sino que las opciones se
establecen mediante variables de entorno. Las principales son:
<P>
<UL>
<LI><CODE>IRCNICK</CODE>: establece el <I>nick</I> por defecto.</LI>
<LI><CODE>IRCUSER</CODE>: establece el nombre de usuario por defecto.</LI>
<LI><CODE>IRCNAME</CODE>: permite escribir el nombre real del usuario.</LI>
<LI><CODE>IRCSERVER</CODE>: nombre del servidor a utilizar.</LI>
<LI><CODE>IRCPORT</CODE>: puerto a utilizar.</LI>
</UL>
<P>Es conveniente dar valor a estas variables en los <I>scripts</I> de
arranque o bien en el fichero <CODE>~/.profile</CODE> de cada usuario del sistema.
<P>
<H2><A NAME="ss5.5">5.5 Ejecuci&oacute;n </A>
</H2>

<P>
<P>El ejecutable se llama <CODE>BitchX-tcl</CODE>, pero resulta conveniente crear un
enlace simb&oacute;lico llamado <CODE>irc</CODE> situado en un directorio que forme parte
del <I>path</I> para simplificar el trabajo de los usuarios.
<P>
<HR>
<A HREF="Servidor-IRC-Como-6.html">Página siguiente</A>
<A HREF="Servidor-IRC-Como-4.html">Página anterior</A>
<A HREF="Servidor-IRC-Como.html#toc5">Índice general</A>
</BODY>
</HTML>
