<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Instalaci&oacute;n y configuraci&oacute;n de un servidor de IRC: El bot de gesti&oacute;n del servidor </TITLE>
 <LINK HREF="Servidor-IRC-Como-5.html" REL=next>
 <LINK HREF="Servidor-IRC-Como-3.html" REL=previous>
 <LINK HREF="Servidor-IRC-Como.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="Servidor-IRC-Como-5.html">Página siguiente</A>
<A HREF="Servidor-IRC-Como-3.html">Página anterior</A>
<A HREF="Servidor-IRC-Como.html#toc4">Índice general</A>
<HR>
<H2><A NAME="s4">4. El <I>bot</I> de gesti&oacute;n del servidor </A></H2>

<P>
<P>
<H2><A NAME="ss4.1">4.1 Funci&oacute;n de un <I>bot</I> de gesti&oacute;n del servidor</A>
</H2>

<P>
<P>La funci&oacute;n de un <I>bot</I> o <I>script</I> de gesti&oacute;n del servidor es
ampliar las posibilidades del IRC, y a la vez permitir un cierto control sobre
los usuarios. El <I>bot</I> se introduce como un usuario m&aacute;s, pero adquiere
el poder del operador, lo que le permite administrar de manera eficiente los
canales. Entre sus posibilidades est&aacute;n:
<P>
<UL>
<LI>Env&iacute;o de mensajes peri&oacute;dicos a ciertos canales.</LI>
<LI>Impedir la entrada de usuarios no deseados.</LI>
<LI>Reconocer a los administradores del servidor y cederles el poder.</LI>
<LI>Aumentar la seguridad general del servidor.</LI>
<LI>Impedir que los usuarios puedan expulsarse entre ellos.</LI>
</UL>
<P>Existen multitud de <I>bots</I> disponibles. Entre los m&aacute;s importantes,
podemos destacar:
<P>
<UL>
<LI><I>Eggdrop</I>: posiblemente el m&aacute;s conocido, pero tambi&eacute;n el m&aacute;s
complejo de instalar y mantener. Requiere TCL.</LI>
<LI><I>Uworld</I>.</LI>
<LI><I>Cservice</I>.</LI>
<LI><I>Argobot</I>.</LI>
</UL>
<P>
<H2><A NAME="ss4.2">4.2 <I>Argobot</I> </A>
</H2>

<P>
<P>El <I>Argobot</I> es un <I>bot</I> relativamente sencillo escrito por el
espa&ntilde;ol Jes&uacute;s Cea Avi&oacute;n (<CODE>
<A HREF="http://www.argo.es/~jcea">http://www.argo.es/~jcea</A></CODE>), aunque algunas grandes redes hispanas
de IRC est&aacute;n adopt&aacute;ndolo. Soporta todas las caracter&iacute;sticas antes enunciadas,
pero sin profundizar en ellas, de forma que no resulta tan grande y complejo
como <I>Eggdrop</I>. Como ventaja a&ntilde;adida, ocupa muy poca memoria y es muy
eficiente. Es un <I>bot</I> multicanal capaz de:
<P>
<UL>
<LI>Proteger los modos de un canal.</LI>
<LI>Dar y quitar los privilegios de operador de forma manual y autom&aacute;tica.</LI>
<LI>Enviar mensajes (<I>notices</I>) a los usuarios reci&eacute;n llegados a
un canal.</LI>
<LI>Controlar el acceso y configuraci&oacute;n de modos y permisos
independientemente para cada canal.</LI>
<LI>Acceder a redes que exigen claves.</LI>
</UL>
<P>Otras caracter&iacute;sticas del Argobot son:
<P>
<UL>
<LI>Se distribuye con el c&oacute;digo fuente completo (escrito en lenguaje C), y
que adem&aacute;s puede compilarse bajo UNIX o en plataformas Windows.</LI>
<LI>Utiliza un fichero de configuraci&oacute;n.</LI>
<LI>Lleva registros (ficheros <I>log</I>) de toda la actividad que se
produce en el servidor.</LI>
<LI>Puede reconfigurarse sin necesidad de detener su actividad, es decir,
puede modificarse su configuraci&oacute;n y cargar de nuevo el <I>bot</I> sin que
los usuarios adviertan ning&uacute;n cambio ni interrupci&oacute;n del servicio.</LI>
</UL>
<P>
<H2><A NAME="ss4.3">4.3 Instalaci&oacute;n </A>
</H2>

<P>
<P>El <I>Argobot</I> se puede conseguir en la p&aacute;gina web de su creador
(<CODE>
<A HREF="http://www.argo.es/~jcea/irc/argobot.htm">http://www.argo.es/~jcea/irc/argobot.htm</A></CODE>). Existen multitud de
versiones, algunas desarrolladas espec&iacute;ficamente para alguna gran red, y adem&aacute;s
se pueden conseguir una veintena de <I>parches</I> que corrigen algunos
defectos y a&ntilde;aden nuevas caracter&iacute;sticas.
<P>Si optamos por obtener el <I>Argobot</I> por Internet, descubriremos que
apenas incluye unos pocos ficheros (c&oacute;digo fuente C), y como &uacute;nica
documentaci&oacute;n un fichero <CODE>README</CODE> muy breve. Para paliar esta
deficiencia, su autor a puesto toda la documentaci&oacute;n disponible a trav&eacute;s de
Internet, en forma de p&aacute;ginas web. Es necesario, por tanto, descargar estas
p&aacute;ginas y leerlas detenidamente. 
<P>El <I>Argobot</I> se suministra en forma de un fichero <CODE>.tgz</CODE>, que una
vez descomprimido (en nuestro caso, en el directorio
<CODE>/usr/src/argobot/</CODE>) da lugar a cuatro ficheros:
<P>
<UL>
<LI><CODE>argobot.c</CODE>: fichero principal del c&oacute;digo fuente.</LI>
<LI><CODE>argo_parser.c</CODE>: c&oacute;digo fuente que interpreta el fichero de
configuraci&oacute;n.</LI>
<LI><CODE>argobot.conf</CODE>: fichero de configuraci&oacute;n.</LI>
<LI><CODE>argobot.log</CODE>: mantiene un registro de los comandos enviados
al bot.</LI>
</UL>
<P>Es importante comprobar que este &uacute;ltimo fichero se ha creado realmente.
Debido a algunas configuraciones de <CODE>tar</CODE>, es posible que no se
genere este fichero (porque est&aacute; vac&iacute;o), lo que provocar&aacute; errores al intentar
ejecutar el <I>Argobot</I>. En este caso, es necesario crear el fichero
manualmente (con la orden <CODE>touch</CODE>, por ejemplo), y darle los permisos
apropiados. 
<P>Nota: si queremos utilizar una de las caracter&iacute;sticas m&aacute;s avanzadas del
<I>Argobot</I>, como es la propagaci&oacute;n de l&iacute;neas <CODE>K</CODE> (s&oacute;lo tiene
sentido en redes de varios servidores), ser&aacute; necesario seguir las
instrucciones relativas a los permisos y el fichero <CODE>ircd.conf</CODE>.
<P>
<H2><A NAME="ss4.4">4.4 Edici&oacute;n del c&oacute;digo fuente </A>
</H2>

<P>
<P>Antes de compilar, es conveniente comprobar que el c&oacute;digo fuente esta bien
adaptado a nuestro sistema. Las modificaciones que debemos hacer dependen de la
forma en la que vamos a ejecutar el <I>bot</I>:
<P>
<UL>
<LI>Si vamos a ejecutar el <I>bot</I> como <I>root</I> (es el m&eacute;todo
recomendado), nos aseguraremos de que est&aacute; definido <CODE>SEGURIDAD</CODE> (con la
sentencia <CODE>#define SEGURIDAD</CODE>), y que las macros <CODE>UID</CODE> y
<CODE>GID</CODE> tienen valores apropiados. Si adem&aacute;s vamos a hacer un
<I>CHROOT</I> (que es una medida adicional de seguridad), definiremos el
directorio que debe tomar como ra&iacute;z con la sentencia <CODE>#define CHROOT
&lt;directorio&gt;</CODE>.</LI>
<LI>Si vamos a ejecutar el <I>bot</I> como un usuario distinto a
<I>root</I>, debemos eliminar el s&iacute;mbolo <CODE>SEGURIDAD</CODE> (con la
sentencia <CODE>#undef SEGURIDAD</CODE>).</LI>
</UL>
<P>Adem&aacute;s de estas modificaciones, podemos definir el s&iacute;mbolo <CODE>VERBOSE</CODE>
para que se impriman en la pantalla todos los mensajes que el servidor
env&iacute;a al <I>Argobot</I>. Otro s&iacute;mbolo interesante es <CODE>CONTROL_FLOOD</CODE>,
que por defecto est&aacute; activado, pero que deberemos eliminar si el nodo al que
conectamos est&aacute; preparado para controlar los ataques por <I>flood</I>.
<P>
<H2><A NAME="ss4.5">4.5 Compilaci&oacute;n </A>
</H2>

<P>
<P>Como ya se ha indicado, el <I>Argobot</I> puede ser compilado bajo m&uacute;ltiples
plataformas. En Linux, es suficiente con hacer:
<P>
<BLOCKQUOTE><CODE>
<PRE>
gcc -Wall -g argobot.c -o argobot
chown root argobot
chgrp root argobot
</PRE>
</CODE></BLOCKQUOTE>
<P>La primera instrucci&oacute;n realiza la compilaci&oacute;n, generando el fichero
<CODE>argobot</CODE>. Con las dos siguientes, establecemos los propietarios de
este fichero.
<P>
<H2><A NAME="ss4.6">4.6 Configuraci&oacute;n </A>
</H2>

<P>
<P>La tarea de configuraci&oacute;n se limita al fichero <CODE>argobot.conf</CODE>, aunque
tambi&eacute;n es necesario crear una nueva cuenta de usuario para el operador del
servidor IRC.
<P>El fichero <CODE>argobot.conf</CODE> es un fichero de texto que contiene l&iacute;neas con
comandos. Al hacer la instalaci&oacute;n, se genera un fichero de ejemplo, pero lo m&aacute;s
conveniente es modificarlo para adaptarlo a nuestras necesidades. Los comandos
son:
<P>
<UL>
<LI><CODE>IRCnick &lt;nick&gt;</CODE>: indica cu&aacute;l es el <I>nick</I> que debe
emplear el <I>bot</I> para identificarse como operador ante el nodo IRC.
</LI>
<LI><CODE>IRCpasswd &lt;password&gt;</CODE>: complementa al comando anterior,
indicando la clave necesaria para adquirir los privilegios de operador.
</LI>
<LI><CODE>nick &lt;nick&gt;</CODE>: especifica el <I>nick</I> bajo el que
aparecer&aacute; el <I>bot</I> a los usuarios.
</LI>
<LI><CODE>server &lt;servidor&gt;</CODE>: sirve para indicar el servidor a
que va a conectarse.
</LI>
<LI><CODE>port &lt;puerto&gt;</CODE>: indica el puerto al que se va a
conectar (generalmente, el 6667).
</LI>
<LI><CODE>passwd &lt;password&gt;</CODE>: clave que ser&aacute; enviada al servidor
al principio de la conexi&oacute;n, con lo que se podr&aacute; acceder a otras redes que
necesiten claves.
</LI>
<LI><CODE>away &lt;mensaje&gt;</CODE>: mensaje que se muestra a los usuarios
al entrar.
</LI>
<LI><CODE>nick_collide &lt;mensaje&gt;</CODE>: mensaje enviado a aquellos
usuarios que est&eacute;n utilizando el <I>nick</I> indicado en el comando
<CODE>nick</CODE>. Inmediatamente despu&eacute;s, se les expulsar&aacute; mediante un
<I>kick</I>.
</LI>
<LI><CODE>umbral_kline &lt;valor&gt;</CODE>: indica cu&aacute;ntos intentos de
conexi&oacute;n se permitir&aacute;n antes de poner una <I>l&iacute;nea k</I> local. El valor
m&aacute;s corriente es cinco. Esto es una medida de protecci&oacute;n contra los usuarios
que tengan una actitud sospechosa.
</LI>
<LI><CODE>timeout_klines &lt;valor&gt;</CODE>: indica cu&aacute;ntos segundos
permanecer&aacute; activa una <I>l&iacute;nea k</I> local. El valor m&aacute;s aconsejable es en
torno a 900 (es decir, 15 minutos).
</LI>
<LI><CODE>timeout_whowas &lt;valor&gt;</CODE>: indica cada cu&aacute;ntos segundos
hay que comprobar la presencia de <I>clones</I> (usuarios que est&aacute;n
presentes bajo varios <I>nicks</I>, lo que suele ser s&iacute;ntoma de actividades
peligrosas). Es conveniente un valor en torno a cinco.
</LI>
<LI><CODE>timer &lt;offset&gt; &lt;periodo&gt; &lt;comando&gt;</CODE>:
se utiliza para enviar comandos peri&oacute;dicos al servidor de IRC, que se
repetir&aacute;n cada cierto n&uacute;mero de segundos. El <I>offset</I> indica el retraso
del primer env&iacute;o.
</LI>
<LI><CODE>set &lt;alias&gt; &lt;m&aacute;scara&gt; [clave]</CODE>: define un
usuario. El nombre de referencia (interno al <I>Argobot</I> ser&aacute; el
<I>alias</I>, y se aplicar&aacute; a aquel usuario que satisfaga las condiciones de
la <I>m&aacute;scara</I>, que tiene la forma <CODE>nick!usuario@dominio</CODE> (se
admiten comodines).
</LI>
<LI><CODE>group &lt;nombre_grupo&gt; &lt;alias&gt; [&lt;alias&gt;...]</CODE>:
define un grupo de usuarios, cuyo nombre ser&aacute; el indicado, y al que
pertenecer&aacute;n los usuarios indicados a continuaci&oacute;n.
</LI>
<LI><CODE>join &lt;canal&gt; [clave]</CODE>: indica al <I>bot</I> que
debe gestionar el canal indicado, entrando con la clave proporcionada, que
es opcional. Si utilizamos la clave <CODE>GOD</CODE>, se forzar&aacute; la entrada del
<I>bot</I>. NOTA: dado que el car&aacute;cter '#' se emplea para indicar
comentarios, no debe escribirse en el campo <I>canal</I>. Por tanto, si
escribimos <CODE>linux</CODE>, estamos refiri&eacute;ndonos al canal <CODE>#linux</CODE>.</LI>
</UL>
<P>Puede haber tantos comandos <CODE>join</CODE> como sean necesarios. Para cada uno
de ellos, se pueden indicar opciones espec&iacute;ficas para el canal, mediante los
siguientes comandos:
<P>
<UL>
<LI><CODE>autoop &lt;grupo&gt;</CODE>: cualquier usuario del grupo indicado
ser&aacute; autom&aacute;ticamente dotado de los privilegios de operador cuando entre en
el canal.
</LI>
<LI><CODE>privil &lt;grupo&gt;</CODE>: declara privilegiados a los miembros del
grupo indicado, lo que les permitir&aacute; enviar comandos al <I>bot</I>.
</LI>
<LI><CODE>mode_default &lt;modos&gt;</CODE>: indica el modo por defecto del
canal.
</LI>
<LI><CODE>mode_disallow &lt;modos&gt;</CODE>: prohibe algunos modos en el
canal.
</LI>
<LI><CODE>log &lt;fichero&gt;</CODE>: almacena toda la actividad del canal
en un fichero. Se incluyen marcas temporales cada diez minutos.
</LI>
<LI><CODE>notice &lt;texto&gt;</CODE>: indica un mensaje que ser&aacute; enviado
a todos los usuarios que entren en el canal.
</LI>
<LI><CODE>allow_any_ban</CODE>: permite a los operadores del canal hacer
pr&aacute;cticamente todo, lo que no es muy aconsejable.</LI>
</UL>
<P>Para nuestro sistema, el fichero <CODE>argobot.conf</CODE> es el siguiente:
<P>
<BLOCKQUOTE><CODE>
<PRE>
#
# Par&aacute;metros globales
#

# Nick utilizado a la hora de identificarse como IRCop, as&iacute; como
# para el WHOIS
IRCnick ArgoBot

# Password correspondiente al nick anterior
IRCpasswd miclave
# Nick bajo el cual debe aparecer el bot
nick _ArgoBOT
passwd miclave

# Nombre del dominio al que se va a conectar el bot
server maquina.euitio.uniovi.es
port 6667

# Mensaje que aparece en el away del bot
away Bot de control de maquina.euitio.uniovi.es. No respondemos \
de los fallos.

# Mensaje enviado con el KILL a cualquier usuario que est&eacute; utilizando el
# nick definido en el comando NICK anterior
nick_collide Escoge otro Nick, por favor

# Las siguientes l&iacute;neas configuran distintos aspectos de la seguridad
umbral_kline 5  # M&aacute;ximo n&uacute;mero de intentos (desconectado)
timeout_klines 15  # 15 minutos
timeout_whowas 5 # Tiempo entre whowas

#
#
# Grupos de usuarios
#
#

# Define el grupo de usuarios al que pertenecen todos
set todos *!*@*      # Comodines
group todos todos

# Define el grupo de IRCops
set diego *!diego@maquina.euitio.uniovi.es
set alfredo *!alfredo@maquina.euitio.uniovi.es
group IRCops diego alfredo

# Define el grupo de proveedores
group proveedores diego alfredo

# Canal ayuda-esnet
group ayuda-esnet diego alfredo

#
#
# Canales
#
#

join linux GOD
autoop IRCops
mode_default ntm
mode_disallow silpko
notice Canal dedicado a los amantes del Linux. \
Prohibido a Bill Gates.
timer 60 60 privmsg #linux :Mensaje enviado al canal linux de forma \
autom&aacute;tica
timer 60 9999 topic #linux :Canal para los autenticos entendidos en \
inform&aacute;tica y sistemas operativos.

# Pone un modo para reducir el consumo de ancho de banda
timer 60 600 mode _argobot :+d
</PRE>
</CODE></BLOCKQUOTE>
<P>
<H2><A NAME="ss4.7">4.7 Ejecuci&oacute;n </A>
</H2>

<P>
<P>Para ejecutar el <I>bot</I>, basta con escribir (preferiblemente como
<I>root</I>):
<P>
<BLOCKQUOTE><CODE>
<PRE>
cd /usr/src/argobot
./argobot
</PRE>
</CODE></BLOCKQUOTE>
<P>Si iniciamos <I>Argobot</I> de esta manera, imprimir&aacute; por la pantalla toda
la actividad que registre (como entradas y salidas de usuarios), lo que puede
ser conveniente por motivos de depuraci&oacute;n, pero resulta innecesario durante
una ejecuci&oacute;n normal. Por tanto, es muy frecuente ejecutar el <I>Argobot</I>
en segundo plano y redireccionando la salida:
<P>
<BLOCKQUOTE><CODE>
<PRE>
nohup argobot &amp;
</PRE>
</CODE></BLOCKQUOTE>
<P>Esto nos evitar&aacute; ver todos los mensajes por la pantalla, pero los enviar&aacute;
a un fichero llamado <CODE>nohup.out</CODE> situado en el directorio actual. El
problema es que este fichero puede crecer muy r&aacute;pidamente, de manera que en
grandes redes se suele enlazar con el dispositivo nulo, para convertirlo en
un <I>agujero negro</I>:
<P>
<BLOCKQUOTE><CODE>
<PRE>
ln -s /dev/null nohup.out
</PRE>
</CODE></BLOCKQUOTE>
<P>Durante la ejecuci&oacute;n de una sesi&oacute;n de IRC, los usuarios autorizados pueden
enviar mensajes al <I>bot</I> para cambiar su funcionamiento. Para realizar
esta tarea, se emplea el comando <CODE>MSG</CODE> del IRC:
<P>
<BLOCKQUOTE><CODE>
<PRE>
/MSG _argobot &lt;clave&gt; &lt;comando&gt; &lt;canal&gt; [nick]
</PRE>
</CODE></BLOCKQUOTE>
<P>Donde <I>comando</I> puede ser:
<P>
<UL>
<LI><CODE>op</CODE>: da privilegios de operador al usuario indicado.</LI>
<LI><CODE>deop</CODE>: quita los privilegios de operador al usuario indicado.</LI>
<LI><CODE>invite</CODE>: invita a un usuario a un canal.</LI>
</UL>
<P>
<HR>
<A HREF="Servidor-IRC-Como-5.html">Página siguiente</A>
<A HREF="Servidor-IRC-Como-3.html">Página anterior</A>
<A HREF="Servidor-IRC-Como.html#toc4">Índice general</A>
</BODY>
</HTML>
