<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//ES">
<HTML lang="es">
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <TITLE> LinuxFocus Vol 3 1998 -- GLUT programming </TITLE>
 <META name="Author" CONTENT="Miguel Angel Sepulveda ">
 <META name="Keywords" CONTENT="GLUT programming tutorial">
 <META name="Description" CONTENT="GLUT programming windows API  subwindows">
 <META name="Copyright" CONTENT="&copy; 1998 LinuxFocus">
 <META name="Translator" CONTENT="C&eacute;sar Ordi&ntilde;ana">
 <META name="Date" CONTENT="1998-02-91T00:00:00Z">

</HEAD>

<BODY bgcolor="#FFFFFF" text="#000000" link="#ff0033" vlink="#FF3333">

  <MAP name="navegator">
  <AREA shape="rect" coords="0, 0, 65, 28" alt="Hogar" href="../">
  <AREA shape="rect" coords="66, 0, 124, 28" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="125, 0, 193, 28" alt="Busqueda" href="../search.html">
  <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
  <AREA shape="rect" coords="261, 0, 350, 28" alt="Personal" href="../aboutus.html">
  </MAP>



 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0">

 <THEAD>
   <TR align="center">
      <TD colspan="2"><IMG src="../../common/March1998/border-short.jpg" alt="[Imagen LinuxFocus]" width="407" height="88"></TD>
   </TR>

   <TR align="center">
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/March1998/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28" alt="[Barra de navegaci&oacute;n]"></TD>
   </TR>

   <TR align="center">
     <TD colspan="2">     
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5">
		<TR bgcolor="#000000">
		   <TD align="center">
               <A href="../News/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp;Noticias</B></FONT></A>
               <A href="../Archives/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp;Archivos</B></FONT></A>
               <A href="../Companies/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp;Compa&ntilde;&iacute;as</B></FONT></A>
               <A href="../Tips/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp;Trucos &nbsp;</B></FONT></A> 
               </TD>
            </TR>
            
		<TR>
            <!--   Here goes the Title of the article, authors name and abstract -->
		   <TD align="center">
 			<FONT face="Helvetica,Arial" color="#660066"><H1>Programando GLUT: Gesti&oacute;n de Ventanas</H1></FONT>
 			<FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#000000">Miguel Angel Sep&uacute;lveda</FONT></A></H3></FONT>
                  <HR size="2" noshade>
	         </TD>
            </TR>

           </TABLE>

     </TD>
   </TR>

 </THEAD>



 <TBODY>
  
 <TR>
    <TD valign="top" align="center">
           <H4><A href="#section1">Introducci&oacute;n</A></H4>
           <H4><A href="#section2">Gesti&oacute;n de Ventanas</A></H4>
           <H4><A href="#section3">Usando Sub-Ventanas</A></H4>
           <H4><A href="#section4">El Teclado</A></H4>
           <H4><A href="#section5">Trazar Texto</A></H4>
           <H4><A href="#section6">Conclusi&oacute;n</A></H4>
    </TD>
   
    <TD align="center">
       <TABLE border="0" width="80%" cellspacing="0" cellpadding="0">
	  <TR>
          <TD>
	     <A name="section1"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">Introducci&oacute;n</FONT></H3>

	  <P>Este art&iacute;culo contin&uacute;a nuestras series sobre GLUT, la biblioteca de 
          herramientas GL escrita por Mark Kilgard para aplicaciones OpenGL.
          Tal y como mencionamos en nuestro art&iacute;culo anterior (<A
          href="../January1998/article16.html">Ventanas y Animaciones</A>) GLUT
          es una biblioteca muy interesante y &uacute;til para cualquier
          programador OpenGL, ya que permite escribir c&oacute;digo portable. GLUT 
          esconde al programador los detalles complicados del gestor de
          ventanas y del interfaz GUI.</P>

          <P>GLUT se divide en varios  subAPIs. En este n&uacute;mero
          describiremos el subAPI de <i>Gesti&oacute;n de Ventanas</i>. 
          Como su nombre indica, &eacute;ste se ocupa de tareas relacionadas
          con las ventanas usadas por tu aplicaci&oacute;n OpenGL:
          crear, cerrar, minimizar una ventana; poner delante, detr&aacute;s
          esconder, mover; y poner t&iacute;tulos, posiciones, etc...</P>

          
	     <A name="section2"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">El Sub-Api de Gesti&oacute;n de Ventanas</FONT></H3>

          <P>Aqu&iacute; est&aacute; la lista completa de funciones soportadas por la gesti&oacute;n de ventanas
          en GLUT (En la versi&oacute;n 3.6):</P>

          <TABLE border="0">
	  <TR>
	  <TD><TT>int glutCreateWindow(char *name)</TT>  </TD>
          <TD> Crea una nueva ventana top-level</TD>  
          </TR>
	  <TR>
	  <TD><TT>int glutCreateSubWindow(int win, <BR>
                   &nbsp;&nbsp;  int x, int y, int width, int height)</TT>  </TD>
          <TD> Crea una sub-ventana </TD>  
          </TR>
	  <TR>
	  <TD><TT>void glutSetWindow(int winId)</TT>  </TD>
          <TD> Establece la ventana con ID winId como ventana actual</TD>  
          </TR>
	  <TR>
	  <TD><TT>int glutGetWindow(void)</TT>  </TD>
          <TD> Solicita el identificador de la ventana actual </TD>  
          </TR>
	  <TR>
	  <TD><TT>void glutDestroyWindow(int winId)</TT>  </TD>
          <TD> Cierra la ventana especificada por winId </TD>  
          </TR>
	  <TR>
	  <TD><TT>void glutPostRedisplay(void)</TT>  </TD>
          <TD> Le dice al procesador de eventos de GLUT que la ventana
               actual necesita ser redibujada</TD>  
          </TR>
	  <TR>
	  <TD><TT>void glutSwapBuffers(void)</TT>  </TD>
          <TD> Intercambia los buffers de la ventana actual</TD>
          </TR>
	  <TR>
	  <TD><TT>void glutPositionWindow(int x, int y)</TT>  </TD>
          <TD> Solicita un cambio en la posici&oacute;n de la ventana</TD>
          </TR>
	  <TR>
	  <TD><TT>void glutReshapeWindow(int width, int height)</TT>  </TD>
          <TD> Solicita un cambio en el tama&ntilde;o de la ventana</TD>
          </TR>
	  <TR>
	  <TD><TT>void glutFullScreen()</TT>  </TD>
          <TD> Solicita que la ventana actual cambie a full screen</TD>
          </TR>

	  <TR>
	  <TD><TT>void glutPopWindow(void) <BR>
                  void glutPushWindow(void)</TT> </TD>
          <TD> Hace un Push o un Pop de la ventana actual relativo a las otras en
          la pila  </TD>  
          </TR>


	  <TR>
	  <TD><TT>void glutShowWindow(void) <BR>
                  void glutHideWindow(void) <BR>
                  void glutIconifyWindow(void)</TT> </TD>
          <TD> Muestra, esconde o minimiza la ventana actual</TD>
          </TR>

	  <TR>
	  <TD><TT>void glutSetWindowTitle(char *name) <BR>
                  void glutSetIconTitle(char *name)</TT></TD>

          <TD> Pone la barra de t&iacute;tulo en la ventana o en la ventana minimizada</TD> 
          </TR>
		      
          </TABLE>



	     <A name="section3"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">Usar Sub-ventanas</FONT></H3>
  
         <P>El uso de la mayor&iacute;a de las funciones anteriores es
         muy simple.  Algunas fueron analizadas en nuestro primer
         art&iacute;culo: <tt>glutPostRedisplay, glutCreateWindow,
         glutPositionWindow, glutSwapBuffers,..</tt>etc. Otras, aunque
         nuevas, tienen un uso trivial y la descripci&oacute;n
         anterior explica muy bien lo que hacen, como
         <tt>glutSetIconTitle, glutFullScreen, ...</tt>etc. Sin
         embargo el uso de sub-ventanas no es tan simple, por lo que
         hemos decidido poner a continuaci&oacute;n un ejemplo simple
         y explicar brevemente los detalles de su
         implementaci&oacute;n.</P>

         <P>Aqu&iacute; est&aacute; el c&oacute;digo fuente de la
         peque&ntilde;a demo OpenGL-GLUT (<A
         href="../../common/March1998/example1.c">../../common/March1998/example1.c</A>, <A
         href="../../common/March1998/Makefile">../../common/March1998/Makefile</A>). Su proposito es
         ense&ntilde;arte: (a) C&oacute;mo manejar una sub-ventana,
         (b) C&oacute;mo usar el teclado para interaccionar con tu
         aplicaci&oacute;n OpenGL (c) C&oacute;mo trazar texto en una
         ventana OpenGL..</P> <i>(Por favor, imprime o ten a mano el
         c&oacute;digo fuente del ../../common/March1998/example1.c a mano mientras seguimos
         con la explicaci&oacute;n.)</i>

         <BR><BR>
	 <CENTER>
         <A href="../../common/March1998/glut1.jpg">
         <IMG src="../../common/March1998/glut2.jpg" border="1" width="305" height="313" 
           ALT="[Vista del example1 ejecut&aacute;ndose]"></A><BR>
         </CENTER>


         <P>Primero vamos a echar un vistazo a la funci&oacute;n
         main().  Ésta empieza, como cualquier otra aplicaci&oacute;n
         GLUT, con inicializaciones: analizar las opciones de la
         l&iacute;nea de comandos, seleccionar el modo de pantalla y
         establecer la posici&oacute;n y el tama&ntilde;o de la
         ventana inicial. Como nuestra aplicaci&oacute;n va a manejar
         m&aacute;s de una ventana, es necesario guardar el entero ID
         de la ventana devuelto por la expresi&oacute;n
         <tt>glutCreateWindow</tt>. La variable <b>winIdMain</B> es un
         manejador de ventana.  Es ahora el momento de establecer las
         funciones callback para los eventos asociados a la ventana
         <b>winIdMain</B>; algunas funciones callback est&aacute;n
         definidas y todas realizan una tarea en la ventana principal:
         una funci&oacute;n de pantalla (<tt>mainDisplay</tt>) que
         dibuja la escena, una funci&oacute;n de cambio de forma
         (<tt>mainReshape</tt>) que maneja cualquier
         transformaci&oacute;n del marco de la ventana, otra llamada
         keyboard que maneja las acciones disparadas por el teclado y
         otra llamada idle para manejar la animaci&oacute;n cuando no
         hay otros eventos pendientes (ver <A
         href="../January1998/article16.html"> Animaciones y
         Ventanas</A> para una descripci&oacute;n m&aacute;s detallada
         de la funci&oacute;n <b>idle</b>;</P>

         <P> La primera cosa importante a saber es que en una
         aplicaci&oacute;n GLUT s&oacute;lo puede haber <em>una</em>
         funci&oacute;n callback idle. La funci&oacute;n idle es
         global para todas las ventanas de la aplicaci&oacute;n. Ten
         esto en cuenta cuando dise&ntilde;es las funciones
         <tt>idle()</tt>, ellas deben tener cuidado de refrescar todas
         las ventanas y subventanas de la aplicaci&oacute;n.</P>

         <P>Despu&eacute;s, en el c&oacute;digo, viene la
         creaci&oacute;n de una subventana (<b>winIDSub</b>).  Para
         crear una sub-ventana debes proporcionar el ID de la ventana
         de nivel superior, en el presente caso <B>winIDMain</B>, las
         coordenadas de <tt>x</tt> e <tt>y</tt> en pixels para la
         subventana, relativas a las coordenadas internas de
         <B>winIDMain</B>, y el ancho y el alto en pixels de la
         ventana solicitada. Despu&eacute;s de crear la subventana
         GLUT devuelve un manejador a nuestro programa y, entonces, ya
         estamos listos para monar las funciones callback apropiadas
         para <b>winIDSub</b>. En nuestra dema hemos establecido dos
         funciones callback: una display (subDisplay) y otra reshape
         (subReshape). </P>

         <P>Cuando GLUT abre una subventana le proporciona un contexto
         OpenGL completo. Hay pues una p&eacute;rdida de rendimiento
         al usar subventanas, ya que el driver de la tarjeta de video
         tiene que refrescar el área de memmoria para cada una de las
         ventanas en pasadas separadas. Gracias a tener un contexto
         OpenGL independiente cada ventana tiene su propio sistema de
         coordenadas, por ejemplo. En ../../common/March1998/example1.c los sistemas de
         coordenadas se ponen en <tt>mainDisplay()</tt> y
         <tt>subDisplay()</tt> respectivamente. Ahora ve y examina
         esas dos funciones de pantalla, son bastante simples y si has
         seguido nuestro art&iacute;culo de Enero sobre OpenGL (<A
         href="../January1998/article17.html">"Trazado de
         Pol&iacute;gonos Simples"</A>) no tendr&aacute;s problemas
         para entenderlas.</P>

         <P>La funci&oacute;n <tt>mainDisplay()</tt> dibuja un
         tri&aacute;ngulo con v&eacute;rtices Verde, Rojo y
         Azul. OpenGL interpola los colores entre los tres
         v&eacute;rtices para llenar el pol&iacute;gono. Antes de
         trazar el tri&aacute;ngulo hemos a&ntilde;adido un
         <tt>glRotate</tt> que gira el tri&aacute;ngulo alrededor del
         eje z (perpendicular a la pantalla), el &aacute;ngulo de
         rotaci&oacute;n (<B>spin</B>) se incrementa lentamente en
         <tt>idle()</tt> para dar la ilusi&oacute;n de que la figura
         est&aacute; girando.</P>

         <P>Tambi&eacute;n la funci&oacute;n de pantalla asociada con
         <b>winIdSub</B> est&aacute; bastante clara. Primero pinta el
         fondo con un color gris, luego dibuja un borde verde
         alrededor de la subventana y, finalmente, traza un
         texto. M&aacute;s tarde explicaremos como funciona el trazado
         de texto bajo GLUT. Por el momento basta se&ntilde;alar que
         <tt>glRasterPos2f(x,y)</tt> establece la posici&oacute;n
         d&oacute;nde se va a dibujar el texto, y que las coordenadas
         <tt>x</tt> e <tt>y</tt> usadas son relativas a las
         coordenadas del sistema de la subventana (definida en
         <tt>subReshape()</tt>). </P>

         <P>La subventana act&uacute;a como un tablero de texto para
         los datos provenientes de la animaci&oacute;n. Es una
         aplicaci&oacute;n tonta, bastar&iacute;a con haber dibujado
         el tablero de texto en la ventana principal para conseguir el
         mismo resultado (incluso de forma m&aacute;s eficiente). Sin
         embargo, bajo algunas circunstancias, tiene sentido abrir una
         ventana para la salida de texto. Por ejemplo cuando la
         animaci&oacute;n es en 3D con luces y efectos ambientales y
         no quieres deformar tu tablero de texto con luces molestas,
         efectos de perspectiva, sombras o niebla, etc.  Bajo esas
         circunstancias una subventana es muy &uacute;til ya que
         est&aacute; completamente aislada de la animaci&oacute;n
         3D.</P>
 
         <P>Hay una diferencia crucial entre la funci&oacute;n
         callback de cambio de tama&ntilde;o para la ventana de
         m&aacute;s alto nivel o para una subventana. Cuando un evento
         de cambio de tama&ntilde;o se dispara, s&oacute;lo se invoca
         la funci&oacute;n callback de cambio de tama&ntilde;o de la
         ventana de m&aacute;s alto nivel, en nuestro ejemplo
         <tt>mainReshape()</tt>. Hay que llamar a la funci&oacute;n
         callback de cambio de tama&ntilde;o <tt>subReshape</tt> desde
         dentro de <tt>mainReshape</tt>. Esto tiene sentido ya que la
         localizaci&oacute;n y la forma de las subventanas est&aacute;
         condicionado al tama&ntilde;o y la forma de su ventana
         principal. De esta forma, si lees ahora el c&oacute;digo de
         <tt>mainReshape()</tt>ver&aacute;s que primero damos valor a
         la matriz de proyecci&oacute;n para la ventana de m&aacute;s
         alto nivel, entonces cambiamos a la subeventana
         <B>winIDsub</B> y vamos invocando secuencialmente la
         funci&oacute;n de cambio de tama&ntilde;ode la subventana con
         el ancho y el alto relativos a <B>winIDMain</B> que queremos
         usar.</P>

         <P>Antes se mencion&oacute; que la funci&oacute;n callback
         <tt>idle()</tt> debe actualizar todas ventanas principales y
         subventanas en la aplicaci&oacute;n OpenGL. En nuestro
         ejemplo <tt>idle()</tt> actualiza primero las variables de
         estado de la animaci&oacute;n (<B>time</B> y <B>spin</B>) y
         luego pide a la ventana principal y la subventana que se
         revisualicen.</P>

	     <A name="section4"></A> <H3><FONT face="Helvetica,Arial"
	     color="#660033">El teclado</FONT></H3>
		    
         <P>He a&ntilde;adido dos teclas activas al programa. Pulsando
         la tecla "i" puedes activar o desactivar el tablero de texto
         y con la tecla "q" puedes salir de la
         aplicaci&oacute;n. Pru&eacute;balas :)</P>

         <P>En el momento que pulses una tecla en tu teclado, el
         driver de proceso de eventos de GLUT registra un evento de
         teclado. Estos eventos son manejados por las funciones
         callback de teclado. En principio cada ventana tiene su
         propia funci&oacute;n callback. Cuando el rat&oacute;n
         est&aacute; en la posici&oacute;n (x, y) dentro de una
         ventana (o subventana) y se dispara un evento de teclado
         entonces la funci&oacute;n callback de teclado asociada con
         esa ventana es invocada. Esta funci&oacute;n callback toma
         como argumentos el c&oacute;digo ASCII <i>unsigned char</i>
         asociado con la tecla y la posici&oacute;n x, y del cursor en
         ese momento. En ../../common/March1998/example2.c no hay ning&uacute;n uso para x, y
         pero estoy seguro de que se te ocurriran aplicaciones donde
         puedas tomar ventaja de esta interesante
         caracter&iacute;stica. </P>

         <P>Únicamente la ventana de m&aacute;s alto nivel en nuestra
         demo tiene una funci&oacute;n callback. Si pruebas a pulsar
         las teclas "i" o "q" mientras el cursor est&aacute; dentro de
         la subventana ver&aacute;s que no pasa nada. Por defecto
         cuando se crea una ventana y no se registra ning&uacute;n
         callback de teclado entonces todas las pulsaciones de teclado
         se ignoran. Ten esto en cuenta en el futuro si usas múltiples
         ventanas y quieres que el teclado est&eacute; activo.</P>

         <P>Finalmente mencionar que la generaci&oacute;n de callbacks
         de teclado se puede deshabilitar pasando NULL a
         <tt>glutKeyBoardFunc()</tt>.</P>

	   <A name="section5"></A> <H3><FONT face="Helvetica,Arial"
	   color="#660033">Trazar texto</FONT></H3>

         <P>Renderizar texto en OpenGL y GLUT es un
         co&ntilde;azo!. Perd&oacute;n por decirlo pero es la
         verdad. No estoy seguro de por qu&eacute; el renderizado de
         texto ha sido desatendido en la librer&iacute;a OpenGL. La
         vieja librer&iacute;a GL de SGI ten&iacute;a unas pocas
         funciones de alto nivel para manejar el trazado de texto en
         el modo gr&aacute;fico y hab&iacute;a una librer&iacute;a
         auxiliar adicional para cambiar fuentes. OpenGL s&oacute;lo
         proporciona directivas muy primitivas para el trazado de
         bitmaps, y eso significa que te tienes que hacer tu propia
         librer&iacute;a de bitmaps para cada car&aacute;cter, tener
         en cuenta la resoluci&oacute;n, el escalado de
         fuentes... todo lo necesario!. </P>

         <P>GLUT resuelve un poco el dilema de usar texto en OpenGL.
         Proporciona <tt>glutBitmapCharacter</tt>, que traza un
         &uacute;nico car&aacute;cter en la posiciç&oacute;n
         especificada por <tt>glRasterPos</tt>. He a&ntilde;adido unas
         pocas funciones, <tt>drawString()</tt>, y
         <tt>drawStringBig()</tt> que hacen la vida un poco mejor al
         trazar cadenas de caracteres.</P>

	   <A name="section6"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">Conclusi&oacute;n</FONT></H3>

         <P>Aqu&iacute; concluye una introducci&oacute;n muy simple al
         uso de subventanas de GLUT. En este punto tengo que mencionar
         que, aunque es bueno experimentar con él bajo varias
         plataformas, el soporte de subventanas de GLUT no es
         completamente funcional en todos los entornos. Usuarios con
         tarjetas basadas en 3Dfx comprobar&aacute;n que las
         subventanas a&uacute;n no son funcionales debido a
         limitaciones hardware. Tambi&eacute;n he encontrado una gran
         penalizaci&oacute;n en las prestaciones al usar subventanas
         en algunas plataformas. Por ejemplo, bajo mi Linux Alpha con
         una Matrox Millenium con 2Mb, una subventana hace que la
         aplicaci&oacute;n vaya el doble de lento, probablemente
         porque desafortunadamente el servidor X para Alpha
         todav&iacute;a no soporta ninguna aceleraci&oacute;n
         hardware. Por el otro lado, la misma aplicaci&oacute;n en
         windows 95 y una ATI RageII con 2Mb con el driver de SGI para
         OpenGL va de maravilla.</P>


         <P>Como el desarrollo de Linux se mueve tan r&aacute;pido es
         posible que en un futuro cercano alguno de los problemas de
         rendimiento e incompatibilidades desaparezcan. Por el momento
         simplemente tener en cuenta que existen, por lo que usa
         m&uacute;ltiples ventanas con cautela.</P>

         <P><I>Por supuesto, usuarios avanzados pueden encontrar
         siempre una forma alternativa de usar subventanas jugando con
         la pila matriz, pero como todav&iacute;a no hemos estudiado
         esto, perd&oacute;name si lo dejo para m&aacute;s
         tarde.. ;)</i>). </P>

          </TD>
        </TR>
	 </TABLE>

     <HR size=2 noshade>
         <P align="right"><I>Traducido por <A href="mailto:cordin@iti.upv.es">C&eacute;sar Ordi&ntilde;ana</A></I> </P> 

    </TD>

 </TR>

 </TBODY>

<TBODY>
  <TR>
    <TD colspan="2">
    <B>Para m&aacute;s informaci&oacute;n</B>:<BR>
    <UL>
      <LI>Leer otros art&iacute;culos en esta serie: <A href="../January1998/article16.html">"Programaci&oacute;n con GLUT: Animaciones y Ventanas"</A>. </LI>
      <LI>Leer otros art&iacute;culos del mismo autor: <A href="article28.html">"Programaci&oacute;n con OpenGL:M&aacute;s sobre Lineas" </A>.</LI> 
     <UL><BR><BR>
    <TD>
  </TR>
</TBODY>

 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 Miguel Angel Sepulveda</B></FONT><BR>
    <FONT color="#ffffff">P&aacute;gina web mantenida por 
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>



</TABLE>


</BODY>
</HTML>







