<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="Forum">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf276, Forum: Unix Libre: Las especies BSD de Unix</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges Tarbouriech
 =LF=CAT___: Forum
 =LF=TITLE_: Unix Libre: Las especies BSD de Unix
 =LF=NUMBER: 276
 =LF=ANAME_: article276.html
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="Georges Tarbouriech"
WIDTH=115 HEIGHT=124>
<BR>por  Georges Tarbouriech <br> <small>&lt;gt(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<P>
Georges es un viejo usuario de Unix. Le gustan las variantes BSD libres de este gran sistema.
</P>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Leo Trujillo  (<a href="http://leo.ciberlinea.com"><font size="1">homepage</font></a>)
<br>
<!--
 =LF=TRANSTO=es: Leo Trujillo 
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#276lfindex0">La Genealog&iacute;a</A></LI>
  <LI><A HREF="#276lfindex1">FreeBSD</A></LI>
  <LI><A HREF="#276lfindex2">NetBSD</A></LI>
  <LI><A HREF="#276lfindex3">OpenBSD</A></LI>
  <LI><A HREF="#276lfindex4">Darwin</A></LI>
  <LI><A HREF="#276lfindex5">&iquest;Y luego qu&eacute;?</A></LI>
  <LI><A HREF="#276lfindex6">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=276">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Unix Libre: Las especies BSD de Unix</H2>
 <img src="../../common/images/illustration276.png"
width="396" height="372" alt="[illustration]" hspace="5">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->
<P>
La genealog&iacute;a de Unix es un poco compleja. A trav&eacute;s del tiempo, m&aacute;s y m&aacute;s ramas se han agregado al &aacute;rbol.
Hasta hoy, existen dos principales familias: BSD y System
V. La rama BSD proporciona varias versiones libres de Unix. Cada uno tiene sus propias especificaciones que
dan a los usuarios una amplia elecci&oacute;n. Vamos a tratar de hacer una peque&ntilde;a revisi&oacute;n
de cada uno de estos formidables Sistemas Operativos.
</P>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


<A NAME="276lfindex0">&nbsp;</A>
<H2>La Genealog&iacute;a</H2>

<P>
BSD es el acr&oacute;nimo de Berkeley Software Distribution (Distribuci&oacute;n de Software Berkeley). El nombre hizo su aparici&oacute;n en 1977
cuando los investigadores de Berkeley comenzaron a proporcionar c&oacute;digo fuente a las compa&ntilde;&iacute;as que poseen las licencias AT&amp;T.
Es decir, la meta era mejorar el c&oacute;digo y las caracter&iacute;sticas de AT&amp;T V6 (y V7 un poco despu&eacute;s).
<br>
El primer trabajo fue llamado 1BSD, el segundo 2BSD. A partir de all&iacute;, hemos tenido una
segunda rama: uno mantiene las mejoras del c&oacute;digo AT&amp;T hasta la &uacute;ltima versi&oacute;n, V10,
y se numera 2.7, 2.8, 2.9 hasta 2.11, mientras que el otro comienzo de 3BSD y se desarrolla
a 4.0, 4.1 hasta 4.4 hasta el presente. Esta segunda rama
es la que est&aacute; intentando crear un sistema completamente libre del c&oacute;digo de AT&amp;T.
La 4.4BSD es la primera distribuci&oacute;n sin nada del c&oacute;digo de AT&amp;T.
La versi&oacute;n alfa aparece en 1992 y la final en 1993.
<br>
Sin mebargo, a partir de la 4.3, hemos tenido unas pocas ramas m&aacute;s: 4.3BSD Tahoe,
4.3BSD Net/1, 4.3BSD Reno y 4.3BSD Net/2, comenzando en 1988 para la primera hasta 1991 para la &uacute;ltima.
<br>
1991 es el a&ntilde;o de la primera tentativa de hacer un port de BSD a la arquitectura 386 llamada
BSD/386 y es el trabajo de Berkeley Software Design, Inc. 386BSD aparece en 1992 y es el
punto de partida de las versiones libres de BSD.
<br>
NetBSD 0,8 aparece a principios de 1993 y FreeBSD a finales del mismo a&ntilde;o.
1994 vi&oacute; el nacimiento de BSD Lite y esta &uacute;ltima llega a ser la base para las futuras versiones
libres de NetBSD o FreeBSD. Al mismo tiempo, BSD/386 se convierte en BSD/OS.
<br>
En 1996 OpenBSD libera su primera versi&oacute;n llamada OpenBSD 2.0 y en  1997, Apple
libera Rhapsody.
<br>
&iexcl;&Eacute;ste es un resumen algo corto y espero no incurrir
en una equivocaci&oacute;n! Si desea conocer la historia entera, solo de una mirada a
 <a
href="ftp://ftp.freebsd.org/pub/FreeBSD/branches/-current/src/share/misc/bsd-family-tree">ftp://ftp.freebsd.org/pub/FreeBSD/branches/-current/src/share/misc/bsd-family-tree</a>
<br>
Al momento que escribo esto, las versiones estables actuales son: 4.7 para FreeBSD,
1.6 para NetBSD y 3.2 para OpenBSD.
</p>
<A NAME="276lfindex1">&nbsp;</A>
<H2>FreeBSD</H2>

<p>
Dado que LinuxFocus ya ha publicado un art&iacute;culo acerca de FreeBSD, no pasaremos demasiado tiempo
en &eacute;l. Puede leerlo siguiendo este <A href="../September2002/article260.shtml">enlace</a>.
<br>
Para decirlo brevemente, FreeBSD es simple y ordenado.
Es f&aacute;cil de instalar y configurar. La documentaci&oacute;n esta muy bien organizada y realmente
ayudar&aacute; al reci&eacute;n llegado. Adem&aacute;s, est&aacute; disponible en varios idiomas.
<br>
FreeBSD proporciona a los usuarios toneladas de aplicaciones en cada categor&iacute;a.
<br>
Sin embargo, las redes y la seguridad son uno de los puntos fuertes de este sistema.
IPv6 (est&aacute;ndar bajo FreeBSD) e IPSec permiten que el administrador maneje f&aacute;cilmente una red
privada virtual (Virtual Private Network). El <a
href="http://www.kame.net/">proyecto KAME</a> ha realizado un gran trabajo proporcionandonos
caracter&iacute;sticas de tunel.
<br>
Muchas herramientas de seguridad son parte del sistema base cortafuegos, proxies, criptograf&iacute;a,
exploradores de puertos (scanners), etc. Por ejemplo, puede elegir entre dos programas de
filtrado de paquetes: ipfw e IPFilter. Por supuesto, no est&aacute;n activos por defecto y tendr&aacute;
que configurar de nuevo y recompilar su n&uacute;cleo.
<br>
Como ya lo he mencionado en el art&iacute;culo mencionado m&aacute;s arriba, FreeBSD corre en arquitecturas Intel y Alpha.
Es realmente un sistema r&aacute;pido y el n&uacute;cleo b&aacute;sico es algo relativamente peque&ntilde;o en tama&ntilde;o.
La memoria esta muy bien administrada y protegida.
<br>
FreeBSD se puede utilizar de muchas diversas maneras: como sistema casero, dentro de una red
y obviamente como servidor. En este &uacute;ltimo caso, FreeBSD es un muy buen amigo puesto que
le provee de todo que usted necesita. No hemos mencionado jail, por ejemplo, que es
una clase de chroot mejorado. <Br>
Debemos tambi&eacute;n mencionar el proyecto TrustedBSD previsto para la mejora de la seguridad.
El resultado de este trabajo ser&aacute; integrado en FreeBSD.
<br>

Insisto, FreeBSD es un gran sistema que merece m&aacute;s que un  intento.
</p>
<A NAME="276lfindex2">&nbsp;</A>
<H2>NetBSD</H2>

<p>
NetBSD es la prueba absoluta de la filosof&iacute;a original de Unix:
"nosotros no nos preocupamos por la arquitectura". Es apenas incre&iacute;ble:
&iexcl;NetBSD puede funcionar en m&aacute;s de 50 procesadores... y a&uacute;n creciendo!!!
Puede funcionar en m&aacute;quinas tan "extra&ntilde;as" una Playstation o una Dreamcast.
<br>
Solo imagine el n&uacute;mero de drivers requeridos para hacer esto. NetBSD es probablemente
uno de los proyectos m&aacute;s impresionantes del software libre.
No estoy enterado de ninguna otra compa&ntilde;&iacute;a (libre o comercial) capaz de producir un trabajo as&iacute;.
<br>
Aun as&iacute;, NetBSD puede funcionar tambi&eacute;n en procesadores muy modernos.
<br>
Como FreeBSD, es un sistema limpio y simple. Es tambi&eacute;n f&aacute;cil instalar, incluso a pesar de no tener ning&uacute;n GUI como tienen
muchas distribuciones Linux.
Es tambi&eacute;n f&aacute;cil de configurar y la documentaci&oacute;n es realmente grande
(disponible tambi&eacute;n en muchas idiomas).
Dado que el n&uacute;mero de plataformas soportadas es "algo" grande,
NetBSD debe proporcionar y proporciona la documentaci&oacute;n espec&iacute;fica para cada uno de ellas. &iexcl;Otro gran trabajo!
<br>
El software para NetBSD est&aacute; disponible como paquetes y por supuesto, como archivos de c&oacute;digo
fuente. Es decir, puedes descargar lo que quieras como haces con Linux, por ejemplo.
Hay un sistema de emulaci&oacute;n que permite compatibilidad binaria con toneladas de software.
El software comercial est&aacute; tambi&eacute;n disponible.
<br>
Y nuevamente, como en FreeBSD, un gran esfuerzo se ha hecho en redes y seguridad.
NetBSD tambi&eacute;n cumple con la norma de IPv6, por ejemplo.
<br>
De hecho, podemos decir que NetBSD es muy cercano a FreeBSD. Ambos
comparten mucho c&oacute;digo. La diferencia principal viene del n&uacute;mero de plataformas disponibles.
<br>
NetBSD es la mejor soluci&oacute;n si usted desea un Unix libre para algo m&aacute;s que una m&aacute;quina  Intel
o Alpha (incluso si puede funcionar en estas). Por ejemplo,
algunas estaciones de trabajp SPARC no pueden funcionar con Linux: NetBSD trabaja en ellas.
Esto permite que usted utilice una estaci&oacute;n de trabajo como un gateway, por ejemplo,
en vez de conseguir librarse de ella. Esto es solamente un ejemplo, y puede hacer mucho m&aacute;s
con NetBSD.
<Br> La estaci&oacute;n de trabajo que acabamos de mencionar, pod&iacute;a tambi&eacute;n convertirse en un
servidor de base de datos en una red local. Porqu&eacute; este ejemplo: porque NetBSD no requiere
CPU de carreras o toneladas de recursos.
<br>
Como otro ejemplo, yo utilic&eacute; NetBSD (1.0 y 1.1) en una Amiga 3000T con una
CPU 68030/25Mhz y una Motorola 8 Mb de RAM (antes de agregar 8 Mb m&aacute;s)... &iexcl;y funcionaba
X con una tarjeta gr&aacute;fica de 2Mb!!! &iexcl;A prop&oacute;sito, nunca se estrell&oacute;!
Por supuesto, puede que fuera un poco lento cuando lo comparamos con
los monstruos de hoy en d&iacute;a.
<Br>Una vez m&aacute;s, estos ejemplos no indican que NetBSD puede funcionar solamente
en viejos pedazos de chatarra. Permite que usted haga igual que FreeBSD,
utiliz&aacute;ndolo en su sistema casero, agreg&aacute;ndolo en una red existente o instal&aacute;ndolo
como servidor de confianza en las computadoras muy nuevas.
<br>
Insisto, &iexcl;un gran trabajo!
<br>
Obviamente, esto es una presentaci&oacute;n muy corta y NetBSD merece mucho m&aacute;s.
Solo dimos un intento. Como la mayor&iacute;a de las distribuciones libres de Unix,
usted puede conseguirlo del sitio web de NetBSD o puede comprar un cdrom.
</p>
<A NAME="276lfindex3">&nbsp;</A>
<H2>OpenBSD</H2>

<p>
OpenBSD es la referencia absoluta cuando de seguridad se trata.
Es el primer sistema Unix que se liber&oacute; con la seguridad en mente.
<Br>Si usted necesita un servidor altamente seguro (&iquest;y qui&eacute;n no necesita uno?),
&eacute;ste es el sistema correcto. Por supuesto, no estoy diciendo que los dos anteriores son
como tamices o que la mayor&iacute;a de las distribuciones de Linux est&aacute;n llenas de vulnerabilidades.
Solo digo, que OpenBSD es el primero en proporcionarle un sistema seguro en la primera
instalaci&oacute;n. El &uacute;nico equivalente que puedo mencionar es la distribuci&oacute;n Linux EnGarde,
puesto que la idea detr&aacute;s es la misma: seguridad.
<br>
Con OpenBSD, usted consigue todo. Todas las herramientas de seguridad est&aacute;n disponibles,
la criptograf&iacute;a es realmente parte del sistema (el mismo equipo desarrolla OpenSSH),
y por &uacute;ltimo pero no menos importante, esa gente ha hecho mucho para mejorar la revisi&oacute;n
del c&oacute;digo. De esta manera, el equipo de OpenBSD contribuy&oacute; en descubrir y corregir muchas
vulnerabilidades de Unix. Esto tambi&eacute;n incluye defectos de seguridad en software
de terceras personas, para la ventaja de la comunidad Unix (libre o propietaria).
<Br>Adem&aacute;s, puesto que OpenBSD viene de NetBSD, puede funcionar en muchas m&aacute;s plataformas
que Intel o Alpha (por supuesto, &iexcl;no tantos como NetBSD!).
Hasta el momento, hay cerca de diez plataformas capaces de funcionar con OpenBSD.
<br>
La filosof&iacute;a "seguro por defecto" es algo que nosotros no utilizarabamos antes de que apareciera
OpenBSD. Ningunos de los editores de Unix (libre o propietario) pensaron de esa manera
y siguieron proporcionando sistemas que requer&iacute;an mucho trabajo
(&iexcl;y un cierto conocimiento!) para endurecerlos. Por ejemplo, la idea de levatar el sistema
sin demonios corriendo por defecto todav&iacute;a no se ha entendido. Para muchos
editores, la idea parece ser como correr tantos servicios como sea posible por defecto.
A veces, usted puede tener algunos algunos malos servicios ejecutandose en tiempo de inicio del sistema.
"Cosas" como telnetd, rshd, ftpd, etc, est&aacute;n all&iacute; por defecto. &iexcl;Simplemente incre&iacute;ble!
<Br> Sin embargo, aunque la mayor&iacute;a de los editores admiten que OpenBSD es un modelo
a seguir ... en este caso no intenta "copiarlo". Hasta ahora,
la familia libre de BSD parece ser la &uacute;nica que han entendido el problema.
&iexcl;Muchas gracias a ellos!
<br>
Por consiguiente, si usted necesita un servidor muy seguro,
proporcionando alta disponibilidad, la opci&oacute;n obvia es OpenBSD.
Bien, si usted quiere lo puede usar en casa &iquest;por qu&eacute; no?
Y por supuesto, ser&aacute; muy f&aacute;cil integrarlo en su red local tambi&eacute;n.
Adem&aacute;s, si comprueba la manera que trabaja, aprender&aacute; mucho sobre seguridad:
qu&eacute; hacer, qu&eacute; evitar, etc. Y entonces podr&aacute; aplicar esto a otros sistemas.
Los fundamentos son siempre iguales: cuando menos servicios activos mejor,
menos puertos abiertos, mejor. No utilice, si puede (&iexcl;y deber&iacute;a!) protocolos o
demonios que transfieren datos en texto plano (incluyendo contrase&ntilde;as).
Si no puede evitar esto (&iexcl;an&iacute;mate!) entonces utilice un t&uacute;nel de SSH para enviar o
recibir sus datos. Restrinja los permisos en directorios y archivos sensibles.
Compruebe los programas SUID y SGID. Etc&eacute;tera.
<br>
&iexcl;OpenBSD hace todo este trabajo por usted mientras que, por ejemplo,
muchos Unixes propietarios activan por defecto un servidor web para leer la documentaci&oacute;n en l&iacute;nea!
<Br> Ahora usted sabe d&oacute;nde encontrar el sistema correcto para sus servidores; -)
</p>
<A NAME="276lfindex4">&nbsp;</A>
<H2>Darwin</H2>

<p>
No debemos olvidarnos de mencionar la base de Mac OS X en un momento en que Apple va a Unix:
Darwin. Darwin viene de 4.4BSD-Lite2 y utiliza un microkernel Mach 3.0
(desarrollado inicialmente por la universidad de Carnegie-Mellon y mejorado por la OSF,
ahora llamado The Open Group). La versi&oacute;n actual es 6.0.1,
mientras que la versi&oacute;n del kernel del  OS encontrado en Mac OS X 10.2  es 6.2.
<Br> De hecho, FreeBSD ha sido el punto de partida del desarrollo de Darwin.
Sin embargo NetBSD y OpenBSD tambi&eacute;n se han utilizado en este desarrollo.
Por ejemplo la criptograf&iacute;a integrada en Darwin viene de OpenBSD e inevitablemente de OpenSSH.
Muchos comandos y herramientas vienen de NetBSD.
<Br> El n&uacute;cleo se llama XNU (s&iacute;, como otras siglas bien conocidas) y
esta hecho tanto de Mach y BSD. Mach est&aacute; a cargo de la administraci&oacute;n de la memoria,
IPC y mensajer&iacute;a, I/O kit (drivers de dispositivo) mientras que BSD maneja los usuarios y
permisos, redes, VFS (sistema de archivos virtual) y capa de la compatibilidad POSIX.
<br>
Por consiguiente, Darwin se beneficia del trabajo de los BSD antedichos.
Es decir, cuando se ha encontrado una vulnerabilidad, Apple proporciona actualizaciones
muy rapido despu&eacute;s de que aparecieran en la comunidad libre de BSD.

<Br> Tambi&eacute;n mencionar que como los BSD libres, OS X de Mac es uno de los pocos Unixes
que vienen sin servicios activos por defecto.
<Br> Por supuesto, Darwin primero fue dedicado a CPUs de Motorola PPC, pero puesto que
Darwin es fuente abierta, hay tambi&eacute;n una versi&oacute;n de Intel disponible desde GNU-Darwin.
<Br> Lo destacable de Darwin es la hermosa interfaz Aqua, que no es obviamente fuente abierta.
Sin embargo, gracias a la comunidad libre de BSD, Apple proporciona el
Unix m&aacute;s amigable al usuario. Seguro, esto los convierte en un Unix propietario,
pero demuestra la alta calidad del software libre de BSD. Adem&aacute;s, traer Unix al mundo
entero me parece a m&iacute; una grandiosa idea.
NeXT hizo lo mismo hace 15 a&ntilde;os pero fall&oacute; despu&eacute;s (desafortunadamente).
Realmente espero que Mac OS X tenga &eacute;xito donde no lo hizo su "padre".
</p>
<A NAME="276lfindex5">&nbsp;</A>
<H2>&iquest;Y luego qu&eacute;?</H2>

Cada entidad de la familia libre de BSD comparte sus trabajos con los otros.
Son realmente libres en cada significado del t&eacute;rmino.
Son m&aacute;s seguros por defecto que cualquier otro Unix. Funcionan en la mayor&iacute;a de las
plataformas disponibles. Las distribuciones no est&aacute;n "hinchadas" y el sistema
base es algo peque&ntilde;o de tama&ntilde;o. Puede funcionar la mayor&iacute;a del software disponible.
Etc&eacute;tera.
<br>Sin embargo, muchos de los Unixes propietarios est&aacute;n basados en el System V.
Parece que no les preocupa en absoluto BSD. Sin embargo, todos tienen paquetes de
compatibilidad con BSD y algunos de ellos originalmente estaban basados en BSD.
<br>Desafortunadamente, estos Unixes propietarios est&aacute; liberando m&aacute;s y m&aacute;s cuotas de mercado.
Sus pol&iacute;ticas me parecen extra&ntilde;as a m&iacute;.
Todos parecen absolutamente interesados en Linux. &iquest;Qu&eacute; esperan?
&iquest;Para venderlo al mismo precio que su propio sistema?
Me temo que esto no funcionar&aacute;. &iquest;Piensan en la venta de sus m&aacute;quinas que substituyen
su propio sistema por Linux? Muy costoso en mi opini&oacute;n a menos que vendan las computadoras
del extremo inferior, y en todo caso, la "soluci&oacute;n" Intel ser&aacute; m&aacute;s barata.
&iquest;Y, de esta manera, c&oacute;mo compensar&aacute;n la p&eacute;rdida? S&iacute;, s&eacute; la respuesta:
&iexcl; venta de servicios! &iquest;Por cu&aacute;nto tiempo esto &uacute;ltimo? &iquest;Y qu&eacute; sobre sus soluciones
existentes? &iquest;Desear&aacute;n substituirlas lentamente por un Linux mucho m&aacute;s barato?

<br>
&iexcl;Sin embargo, este a&ntilde;o muchas de estas compa&ntilde;&iacute;as han "despedido" a centenares de personas!
&iquest;A donde conducen eso? A una cada vez m&aacute;s fuerte hegemon&iacute;a Microsoft...
y m&aacute;s gente desempleada. &iexcl;Muy, muy triste!
<Br> Por supuesto, no estoy diciendo que usar BSD en lugar de System&nbsp;V
solucionar&iacute;a este problema. S&oacute;lo que no entiendo la pol&iacute;tica de esos grandes fabricantes.
Ni entiendo porqu&eacute; dejan fuera a BSD si est&aacute;n tan interesados en Unix libre.
<Br> Aunque esto puede parecer salirse del tema, no es as&iacute;.
Los Unix propietarias necesitan al Unix libre... pero el Unix libre necesita del propietario tambi&eacute;n.
Cada uno obtiene algo del otro. Muchos Unix propietarios usan software libre de una forma u otra,  los
compiladores por ejemplo. Y el Unix libre se beneficia de lo que dio a la comunidad
el Unix propietario. Un gran ejemplo: OpenGL.
Gracias a SGI.
<Br> Esto es una manera agradable de compartir y crea una emulaci&oacute;n.
OpenBSD, ayuda mucho en demostrar los sistemas m&aacute;s seguros. OpenSSH por ejemplo,
est&aacute; disponible para la mayor&iacute;a de Unixes propietarios. Como nosotros dijimos ya,
los BSD libres son muy importantes para Apple. &iexcl;No puedo recordar a Apple cuidar
mucho sobre seguridad antes de Mac OS X!
<br>
Todo esto para decir que la "manera" Linux est&aacute; pervirtiendo muchas cosas.
Me gusta Linux pero no me gusta su "evoluci&oacute;n". No comparto la idea de la "reproducci&oacute;n"
Windows y su software. No estoy de acuerdo con el hecho que las distribuciones principales
son m&aacute;s grandes y m&aacute;s grandes... y m&aacute;s y m&aacute;s "comerciales".
No deseo un monopolio que substituya otro (&iexcl;cosa que no creo, de todas formas!).
Por ahora, Microsoft realmente no teme a Linux u otros Unixes. El d&iacute;a
del "peligro" se convertir&aacute; en una realidad, Microsoft tiene la energ&iacute;a de trabar todo
y particularmente Internet en un lapso de tiempo muy corto.
S&eacute;, que esto puede parecer paranoico, y espero que no suceda, pero...
Ya lo he dicho, no se preocupe: Yo no tengo la verdad y no soy aficionado a la futurolog&iacute;a.
<Br> Necesitamos una opci&oacute;n verdadera: Entre m&aacute;s SO disponibles, tanto mejor.
&iquest;Por qu&eacute; decir "dominaci&oacute;n del mundo"? Aparte de Microsoft, &iquest;qui&eacute;n se preocupar&aacute; de esto?
Por lo que tenemos que "luchar" es por la libertad de elecci&oacute;n. Lo s&eacute;, ya lo he dicho :-(
<br>
La familia libre de BSD contribuye mucho a esta libertad.
Esa gente realmente comparte y esto conduce a sistemas muy grandes. Muchas gracias a todos.
<Br>A prop&oacute;sito, Sr. RMS usted "no ha recomendado" decir GNU/FreeBSD o GNU/NetBSD o
GNU/OpenBSD (naturalmente, &iexcl;tenemos GNU-Darwin!):
&iquest;Usted se olvid&oacute; de BSD como los grandes fabricantes de Unix , o es que
encuentra que esa gente no utiliza "suficiente" software GNU?
&iexcl;Por supuesto, estoy bromeando, pero la libertad del discurso tambi&eacute;n existe,
por lo menos por ahora... y no me agrada decir (o escribir) GNU/Linux!<br>
<br><br>
&iquest;No vivimos acaso una &eacute;poca maravillosa?
</p>
<A NAME="276lfindex6">&nbsp;</A>
<H2>Referencias</H2>

<p>
En los siguinetes enlaces usted encontrar&aacute; mirrors, &aacute;reas de descarga,
documentaci&oacute;n en varios lenguajes,
etc:
<br>
<ul>
<li>
Sitio web Oficial: <A href="http://www.freebsd.org/">FreeBSD</a>
<br>
<li>Sitio web Oficial: <A href="http://www.netbsd.org/">NetBSD</a>
<br>
<li>Sitio web Oficial: <A href="http://www.openbsd.org/">OpenBSD</a>
<br>
<li>Sitio web Oficial: <A href="http://developer.apple.com/darwin/">Darwin</a>
</ul>
<br><br>
Recursos:
<br>
<ul>
<li>LA seguridad Linux: <A
href="http://www.guardiandigital.com/">EnGarde Linux</a>
<li>Mucha informaci&oacute;n: <A href="http://www.daemonnews.org/">Daemonnews</a>
<br>
<li>Sitio web de <A href="http://www.trustedbsd.org/">TrustedBSD</a>
<br>
<li>Como su nombre lo dice: <A href="http://www.gnu-darwin.org/">GNU-Darwin</a>
</ul>





<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=276"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">en --&gt; -- : Georges Tarbouriech <small>&lt;gt(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Leo Trujillo  (<a href="http://leo.ciberlinea.com"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2003-01-28, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
