<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="Applications">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf275, Applications: Demograf&iacute;a pr&aacute;ctica</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Ralf Wieland
 =LF=CAT___: Applications
 =LF=TITLE_: Demograf&iacute;a pr&aacute;ctica
 =LF=NUMBER: 275
 =LF=ANAME_: article275.html
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/RalfWieland.jpg" alt=
"[Photo of the Author]" width="177" height="191">
<BR>por  Ralf Wieland <br> <small>&lt;rwieland-at-zalf.de&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<p>Utilizo Linux (desde 0.88pl12) para programar simulaciones
de entorno, redes neuronales y sistemas difusos. Adem&aacute;s estoy
interesado en la electr&oacute;nica y el hardware, y tambi&eacute;n uso Linux en
estos campos.</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Roberto Hernando Velasco (<a href="http://www.rhernando.ya.st"><font size="1">homepage</font></a>)
<br>
<!--
 =LF=TRANSTO=es: Roberto Hernando Velasco
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#275lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#275lfindex1">Trasfondo</A></LI>
  <LI><A HREF="#275lfindex2">Usando el Modelo</A></LI>
  <LI><A HREF="#275lfindex3">Instalaci&oacute;n y Licencia</A></LI>
  <LI><A HREF="#275lfindex4">Desarrollo posterior</A></LI>
  <LI><A HREF="#275lfindex5">Agradecimientos</A></LI>
  <LI><A HREF="#275lfindex6">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=275">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Demograf&iacute;a pr&aacute;ctica</H2>
 <img src="../../common/images/article275/logo.gif" alt=
"[Illustration]" hspace="10" width="120" height="116">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->

Este art&iacute;culo se ocupa de la cuesti&oacute;n "&iquest;Cu&aacute;l ser&aacute; la estructura
de la poblaci&oacute;n dentro de 50 o 100 a&ntilde;os, si sigue creciendo
como ahora?" Como parte de mi intento para responder a esta pregunta,
presento un peque&ntilde;o programa QT, con el que los lectores
pueden experimentar por s&iacute; mismos. Algunos podr&aacute;n
sacarle provecho e incluso puede que algunos desarrollen sus propias
extensiones del programa.


<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


<A NAME="275lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>


<p>La inmigraci&oacute;n y la integraci&oacute;n de extranjeros en nuestro pa&iacute;s
es uno de los temas de discusi&oacute;n preferidos por nuestros pol&iacute;ticos.
Las empresas basan el perfil de sus productos en el crecimiento
demogr&aacute;fico.
La sanidad, el sistema de pensiones, etc. dependen de c&oacute;mo evoluciona
la poblaci&oacute;n.</p>

<p>Se hacen muchas investigaciones en este tema, public&aacute;ndose
estudios muy profundos. A pesar de ello la mayor&iacute;a de la gente ignora
todo el proceso que est&aacute; detr&aacute;s del crecimiento demogr&aacute;fico. Este
art&iacute;culo se ocupa poco de la exactitud pol&iacute;tica o cient&iacute;fica, ocup&aacute;ndose
principalmente
de nuestra propia experiencia. &iquest;Por qu&eacute; no echar un vistazo, incluso de
forma divertida, a la poblaci&oacute;n en 50 o 100 a&ntilde;os? &iquest;Qu&eacute; pasa cuando
unos dejan el pa&iacute;s, y qu&eacute; pasa cuando otros llegan? Para permitirnos
experimentar con las distintas posibilidades, he desarrollado un peque&ntilde;o
programa QT.</p>

<A NAME="275lfindex1">&nbsp;</A>
<H2>Trasfondo</H2>


<p>La mayor&iacute;a de las personas se pregunta alguna vez de d&oacute;nde vienen
realmente las 'pir&aacute;mides poblacionales' que se ven en los peri&oacute;dicos - ya
sabe,
esas que muestran, por ejemplo, qu&eacute; poblaci&oacute;n habr&aacute; en 50 a&ntilde;os. &iquest;En qu&eacute;
informaci&oacute;n se basan esos diagramas?</p>

<p>Si piensa en ello, se dar&aacute; cuenta de que todo depende del
n&uacute;mero de ni&ntilde;os nacidos, el n&uacute;mero de gente que muere, y la
tasa de movimiento de personas dentro y fuera del &aacute;rea geogr&aacute;fica
en cuesti&oacute;n; en otras palabras, migraci&oacute;n, que se divide en inmigraci&oacute;n
y emigraci&oacute;n.</p>

<p>Empecemos con la primera cosa que necesita saber para
construir un diagrama de poblaci&oacute;n: la tasa de natalidad. Cada a&ntilde;o
nace cierto n&uacute;mero de ni&ntilde;os. La tasa de natalidad es el n&uacute;mero
medio de ni&ntilde;os que tiene una mujer a lo largo de su vida.
Esta tasa difiere de pa&iacute;s en pa&iacute;s dependiendo de un n&uacute;mero
de factores como cultura, situaci&oacute;n econ&oacute;mica, educaci&oacute;n
y costumbres. En alemania la tasa es de 1.3 hijos por mujer.</p>

<p>Unos pa&iacute;ses tienen una actitud "pro-natalidad" mayor que
otros, los hijos pueden ser vistos en parte como una forma
de seguro para cuando seamos viejos. En nuestro caso, la tasa de
natalidad es un punto de partida para el programa, que se puede
establecer entre 0 y 10 hijos por mujer. Es decir, podemos
ajustar la tasa de natalidad en el programa para ajustarnos a
distintas situaciones.</p>

<p>El n&uacute;mero de ni&ntilde;os nacidos no depende s&oacute;lo de la tasa de
natalidad, sino tambi&eacute;n del n&uacute;mero de mujeres en edad de tener
hijos. En el modelo, el n&uacute;mero de mujeres en edad de tener
hijos (para el programa, las edades entre 15 y 45) simplemente
se suma y se multiplica por la tasa de natalidad. Para calcular el
n&uacute;mero de ni&ntilde;os nacidos por a&ntilde;o, este n&uacute;mero se divide entre
45-15=30. Esto se basa en la suposici&oacute;n de que las
mujeres, en media, tendr&aacute;n a lo largo de su vida el n&uacute;mero de
hijos dado por la tasa de natalidad. Alguno se preguntar&aacute; c&oacute;mo
se calcula realmente la tasa de natalidad ya que, despu&eacute;s de todo,
una mujer puede tener 7 hijos mientras que otra puede no tener
ninguno. Esta es una cuesti&oacute;n estad&iacute;stica y se explica en la literatura
especializada. En nuestro programa, estamos menos preocupados
por la exactitud estad&iacute;stica y m&aacute;s por la posibilidad de la
experimentaci&oacute;n - por ejemplo, sobre la cuesti&oacute;n de qu&eacute;
ocurrir&iacute;a si se pusiese de moda en Alemania tener m&aacute;s de tres
hijos por familia.</p>


<p>Claro que igual que nacen ni&ntilde;os, tambi&eacute;n hay personas que mueren.
La tasa de mortalidad es similar a la tasa de natalidad, salvo
que se aplica a toda la poblaci&oacute;n y no solo a las mujeres. (Por supuesto,
los hombres tambi&eacute;n juegan un papel en la tasa de natalidad,
pero este no es el lugar para discutirlo ;-)). Evidentemente la edad del
invididuo
es un factor principal en la tasa de mortalidad; estad&iacute;sticamente
las personas ancianas tienen m&aacute;s probabilidades de morir que
las personas j&oacute;venes. En Alemania existe una tabla oficial de tasa
de mortalidad, que utilizan las compa&ntilde;&iacute;as de seguros para calcular
las primas de los seguros de vida. Nuestro programa utiliza los datos
de esta tabla de tasa de mortalidad. Habr&aacute; que modificar estos datos
para otros pa&iacute;ses.</p>

<p>En los pa&iacute;ses industrializados, la tasa deber&iacute;a basarse solo en
la edad y no en factores adicionales como la clase social. Sin embargo,
como me ha explicado un amigo mexicano, esto no se puede
aplicar a todo el mundo. En nuestro programa, la tasa de mortalidad
solo tiene en cuenta la edad, por lo que si alguien quiere a&ntilde;adir
los factores sociales tendr&aacute; que ampliar el programa. &iquest;Quiz&aacute;s alguien
quiera hacerlo?</p>

<p>Y por &uacute;ltimo habr&iacute;a que tener en cuenta la migraci&oacute;n. Desde luego,
los procesos migratorios siempre han jugado un importante papel.
Por ejemplo, en siglos pasados, la poblaci&oacute;n rural tend&iacute;a a
migrar a las ciudades. Esto no representaba un problema serio, en
la medida que la alta tasa de natalidad cancelaba los efectos
de la p&eacute;rdida de poblaci&oacute;n. Hoy en d&iacute;a los procesos migratorios
son diferentes. Sin embargo, la despoblaci&oacute;n rural todav&iacute;a es
un fen&oacute;meno significativo en la Alemania moderna, que implica
el creciente aislamiento de algunas regiones.</p>

<p>El proceso completo es un autocatal&iacute;tico que se ve reforzado
por la degradaci&oacute;n social y cultural. No vale de mucho tener facilidades
para los ni&ntilde;os en una zona en la que viven muy pocos ni&ntilde;os.
Al mismo tiempo, pocos querr&aacute;n irse a una zona donde no haya
facilidades para los ni&ntilde;os. Pasa lo mismo con las facilidades culturales.
Sin entrar mucho en los detalles, deber&iacute;a quedar claro que la
migraci&oacute;n puede tener muchas y variadas causas. Lo m&aacute;s importante
para los prop&oacute;sitos del programa es que la estructura
de edad de las personas que dejan una zona es normalmente
diferente de las personas que llegan a esa zona. Para reflejarlo en
el programa, se puede adaptar el campo "Distribution" en el c&oacute;digo
fuente "./demogra/demogra1.cpp" a nuestros prop&oacute;sitos. Esto no deber&iacute;a
ser necesario en los experimentos iniciales.</p>

<p>Los campos "Immigration" y "Emigration" son para introducir
esos datos. Esos campos toman valores absolutos. Luego, si
10000 personas al a&ntilde;o se mueven a una zona, introduciremos
10,000 en el campo Immigration.</p>

<p>Por &uacute;ltimo (pero no menos importante), todos envejecemos
un a&ntilde;o cada a&ntilde;o. Para tenerlo en cuenta, el ciclo de a&ntilde;os hace
que  alguien que tuviera 40 a&ntilde;os pase a tener 41. El campo "Step"
nos permite avanzar varios a&ntilde;os cada vez - por ejemplo, si
especificamos 10, el modelo mostrar&aacute; el desarrollo sobre un per&iacute;odo
de 10 a&ntilde;os en un paso.</p>

<A NAME="275lfindex2">&nbsp;</A>
<H2>Usando el Modelo</H2>


<p>Echemos un vistazo a la interfaz de usuario del programa:<br>
</p>

<center>
  <img src="../../common/images/article275/demo_th.jpg" width=
  "500" height="439" alt="The Model">
</center>

<p>Los campos de entrada descritos anteriormente est&aacute;n en la
parte izquierda de la pantalla. El n&uacute;mero total de hombres y mujeres
aparece en el campo correspondiente en esta parte de la pantalla
despu&eacute;s de cada paso. Estos campos son s&oacute;lo de salida.
De forma similar, todo el &aacute;rea gr&aacute;fica est&aacute; dedicada a la visualizaci&oacute;n.
Los botones en la parte inferior izquierda de la pantalla sirven
para controlar la simulaci&oacute;n.
El bot&oacute;n "Step" avanza un paso en la simulaci&oacute;n. "Reset" lo reajusta
todo a su estado inicial. El estado actual del modelo se puede guardar
en el fichero "simulation.dat". Este fichero contiene el n&uacute;mero de hombres
y mujeres de cierta edad seg&uacute;n refleja el modelo en el momento
de guardarlo. Es posible llevar a cabo un an&aacute;lisis separado con
este fichero. Los botones "Help" y "Quit" son autoexplicativos.</p>

<p>La parte inferior del gr&aacute;fico muestra el m&aacute;ximo n&uacute;mero de hombres
y mujeres en todos los grupos de edad como un valor gu&iacute;a. T&eacute;ngase
en cuenta que el tama&ntilde;o de las barras depende de esta figura m&aacute;xima.
Puede que no sea la mejor soluci&oacute;n, pero todav&iacute;a no he encontrado
una alternativa. &iquest;A alguien se le ocurre algo?</p>

<p>Por otro lado, la simulaci&oacute;n deber&iacute;a explicarse por s&iacute; misma.
Si la entrada es extrema en un lado u otro - por ejemplo, si el
n&uacute;mero de emigrantes es muy alto - aparecer&aacute;n huecos en
pir&aacute;mide de edad. Este tipo de resultados es improbable en la pr&aacute;ctica,
por
lo que la entrada tendr&aacute; que ser apropiada. Por otro lado,
&iquest;fen&oacute;menos patol&oacute;gicos, como el SIDA, podr&iacute;an
    producir un efecto como &eacute;ste en la realidad?
&iquest;Podr&iacute;a ocurrir que en una zona cierto grupo de edad fuera diezmado por el
SIDA,
y el resto de la poblaci&oacute;n fuera dejando la zona desierta?</p>

<A NAME="275lfindex3">&nbsp;</A>
<H2>Instalaci&oacute;n y Licencia</H2>


<p>El programa tiene licencia GLP. Para Qt se aplica
la licencia TrollTech.</p>

<p>La instalaci&oacute;n es muy sencilla. Lo primero es descargrse
el modelo demogr&aacute;fico (v&eacute;anse las referencias). Use tar -zxvf
demographie-0.2.tar.gz
para desempaquetar el fichero "demographie-0.2.tar.gz".
La instalaci&oacute;n se lanza desde el directorio reci&eacute;n creado
mediante make o un previo qmake. Los prerequisitos son
QT3 y gcc. El programa se ha probado satisfactoriamente
en SuSE 8.0 y SuSE 8.1, y tambi&eacute;n deber&iacute;a funcionar con otras
distribuciones.</p>

<p>Para arrancar el programa, ponga "./demographie" en la l&iacute;nea
de comandos. Aseg&uacute;rese de que "demo.csv" est&eacute; en el mismo directorio.
Este fichero contien los n&uacute;meros de los a&ntilde;os, las figuras para
hombres y mujeres, y las tasas de mortalidad  para hombres y mujeres,
todo como valores separados por comas. Si quiere ajustar los datos
para adaptarlos a una regi&oacute;n particular, lo tiene que hacer en este
fichero.
En nuestro ejemplo, un peri&oacute;dico fue la fuente de las figuras para
Alemania.
Puede que no sea completamente preciso, pero es adecuado
para nuestros prop&oacute;sitos de experimentar.</p>

<A NAME="275lfindex4">&nbsp;</A>
<H2>Desarrollo posterior</H2>


<p>El programa forma parte de un sistema de simulaci&oacute;n
regional. El sistema se ha dise&ntilde;ado para responder preguntas como
&iquest;c&oacute;mo evolucionar&aacute; la poblaci&oacute;n de una regi&oacute;n geogr&aacute;fica bien definida
(el &aacute;rea rural del norte de Berl&iacute;n)? En particular, el sistema
examinaba la llegada de familias j&oacute;venes a zonas cercanas a Berl&iacute;n
y la partida de personas j&oacute;venes al Western
<i>Bundesl&auml;nder</i>. Los resultados mostraban grandes diferencias
de regi&oacute;n en regi&oacute;n. Hay algunas zonas donde la poblaci&oacute;n
est&aacute; creciendo y otras cuya poblaci&oacute;n decrece. Algunas zonas,
especialmente las m&aacute;s remotas geogr&aacute;ficamente, se est&aacute;n volviendo
m&aacute;s y m&aacute;s escasamente pobladas. Un efecto notable en esto es
el proceso autocatal&iacute;tico referido anteriormente.</p>

<p>Tenemos que ser cuidados con este tipo de predicciones, ya
que no se han incluido todos los datos relevantes en este proceso.
Por ejemplo, el fen&oacute;meno del teletrabajo se traduce en que la
distancia a Berl&iacute;n ya no ser&aacute; tan importante como parece.
Los programas para promover zonas particulares como buenos
lugares industriales tambi&eacute;n pueden crear escenarios diferentes. En
consecuencia, los modelos simplemente representan una continuaci&oacute;n
del estado actual y solo sirven de forma orientativa.</p>

<p>Si queremos aplicar el programa a otras &aacute;reas del mundo,
tendremos que considerar tambi&eacute;n otros procesos. Podr&iacute;a ser
interesante usar el programa para examinar un &aacute;rea completamente
distinto, como por ejemplo las regiones rurales de M&eacute;xico. Aqu&iacute; hacen
falta montones de nuevas ideas. &iquest;Quiz&aacute;s alguien querr&iacute;a ver
esto en mayor detalle, o adaptar el modelo a otras regiones?
Me alegrar&iacute;a recibir comentarios en este aspecto.</p>

<A NAME="275lfindex5">&nbsp;</A>
<H2>Agradecimientos</H2>


<p>Querr&iacute;a enviar un sincero agradecimiento a la comunidad Linux,
que ha desarrollado tan fant&aacute;stico sistema. Tambi&eacute;n doy las gracias
a la empresa Troll Tech por la brillante QT y por hacerla disponible
para Linux. Y por supuesto un agradecimiento especial a la FSF por
tantas herramientas, especialmente gcc, sin las que el trabajo
presentado aqu&iacute; no habr&iacute;a sido posible.</p>

<A NAME="275lfindex6">&nbsp;</A>
<H2>Referencias</H2>


<ul>
  <li>Descargar el modelo demogr&aacute;fico de este servidor: <a href=

"../../common/src/article275/demography-0.2.tar.gz">demography-0.2.tar.gz</a></li>

  <li>Modelo demogr&aacute;fico, la &uacute;ltima versi&oacute;n: <a href=

"http://www.zalf.de/ftp/pub/out/lsa/demographie.tgz">http://www.zalf.de/ftp/pub/out/lsa/demographie.tgz</a></li>
</ul>

<p>Happy hacking!</p>




<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=275"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Ralf Wieland, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">de --&gt; -- : Ralf Wieland <small>&lt;rwieland-at-zalf.de&gt;</small></font></td></tr>
  <tr><td><font size="2">de --&gt; en: Orla Shanaghy &lt;o_shanaghy-at-yahoo.com&gt;</font></td></tr>
  <tr><td><font size="2">en --&gt; es: Roberto Hernando Velasco (<a href="http://www.rhernando.ya.st"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2003-03-14, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
