<HTML>
<HEAD>
<TITLE>DNS COMO: C&oacute;mo hacerse un gran admin DNS.</TITLE>
</HEAD>
<BODY>
<A HREF="DNS-Como-8.html">Anterior</A>
<A HREF="DNS-Como-10.html">Siguiente</A>
<A HREF="DNS-Como.html#toc9">Indice</A>
<HR>
<H2><A NAME="documentacion"></A> <A NAME="s9">9. C&oacute;mo hacerse un gran <I>admin</I> DNS.</A></H2>


<P>Documentaci&oacute;n y herramientas.</P>
<P>Existe <I>Documentaci&oacute;n Real</I>. En l&iacute;nea e impresa. Se requiere la lectura
de esta documentaci&oacute;n para seguir los pasos de peque&ntilde;o a gran <I>admin</I>
DNS. En formato impreso el libro est&aacute;ndar es <I>DNS and BIND</I> de C. Liu y
P.  Albitz de <I>O'Reilly &amp; Associates</I>, Sebastopol, CA, ISBN
0-937175-82-X. Lo le&iacute;, es excelente. Hay tambi&eacute;n una secci&oacute;n sobre DNS en
<I>TCP/IP Network Administration</I>, de Craig Hunt de <I>O'Reilly</I>...,
ISBN 0-937175-82-X. Otros libros necesarios para un Buenos Administradores
DNS (o bueno para cualquier cosa de la materia) es <I>Zen and the Art of
Motorcycle Maintenance</I> de Robert M.  Prisig <CODE>:-)</CODE> Disponible con ISBN
0688052304 y otros.</P>
<P>Puede encontrar material en l&iacute;nea en <CODE>
<A HREF="http://www.dns.net/dnsrd/">http://www.dns.net/dnsrd/</A>,
<A HREF="http://www.vix.com/isc/bind/">http://www.vix.com/isc/bind/</A></CODE>; una <I>PUF</I>, un manual de
referencia (<I>BOG</I>;  <I>Bind Operations Guide</I>) as&iacute; como <I>papers</I> y
definici&oacute;n de protocolos y diversos retoques o <I>hacks</I> de DNS (&eacute;stos y
la mayor&iacute;a, si no todas las referencias mencionadas arriba, est&aacute;n tambi&eacute;n
contenidas en la distribuci&oacute;n de <I>bind</I>).  No he le&iacute;do la mayor&iacute;a, pero
tampoco soy un gran admin DNS.  Arnt Gulbrandsen, por otra parte ha le&iacute;do
el <I>BOG</I> y est&aacute; extasiado con &eacute;l <CODE>:-)</CODE>. El grupo de noticias
<CODE>comp.protocols.tcp-ip.domains</CODE> es sobre DNS. En suma, hay un gran
n&uacute;mero de <CODE>RFC</CODE>s sobre DNS, las m&aacute;s importantes son probablemente las
siguientes:</P>
<P>
<DL>
<DT><B>RFC 2052</B><DD><P>A. Gulbrandsen, P. Vixie, <I>A DNS RR for specifying the location of
services (DNS SRV)</I>, Octubre de 1996</P>

<DT><B>RFC 1918</B><DD><P>Y. Rekhter, R. Moskowitz, D. Karrenberg, G. de Groot, E. Lear, <I>Address
Allocation for Private Internets</I>, 02/29/1996. </P>

<DT><B>RFC 1912</B><DD><P>D. Barr, <I>Common DNS Operational and Configuration Errors</I>, 02/28/1996. </P>

<DT><B>RFC 1713</B><DD><P>A. Romao, <I>Tools for DNS debugging</I>, 11/03/1994.</P>

<DT><B>RFC 1712</B><DD><P>C. Farrell, M. Schulze, S. Pleitner, D. Baldoni, <I>DNS Encoding of
Geographical Location</I>, 11/01/1994. </P>

<DT><B>RFC 1183</B><DD><P>R. Ullmann, P. Mockapetris, L. Mamakos, C. Everhart, <I>New DNS RR
Definitions</I>, 10/08/1990. </P>

<DT><B>RFC 1035</B><DD><P>P. Mockapetris, <I>Domain names - implementation and specification</I>,
11/01/1987. </P>

<DT><B>RFC 1034</B><DD><P>P. Mockapetris, <I>Domain names - concepts and facilities</I>, 11/01/1987. </P>

<DT><B>RFC 1033</B><DD><P>M. Lottor, <I>Domain administrators operations guide</I>, 11/01/1987. </P>

<DT><B>RFC 1032</B><DD><P>M. Stahl, <I>Domain administrators guide</I>, 11/01/1987.</P>

<DT><B>RFC 974</B><DD><P>C. Partridge, <I>Mail routing and the domain system</I>, 01/01/1986.</P>
</DL>
</P>

<HR>
<A HREF="DNS-Como-8.html">Anterior</A>
<A HREF="DNS-Como-10.html">Siguiente</A>
<A HREF="DNS-Como.html#toc9">Indice</A>
</BODY>
</HTML>
