<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Miguel Angel Sepulveda">
   <META NAME="Keywords" CONTENT="Povray Ray Tracing Linux Programming">
   <META NAME="Copyright" CONTENT="© 1998 LinuxFocus">
   <META NAME="Translator" CONTENT="First Steps with Povray">
   <META NAME="Date" CONTENT="1998-02-91T00:00:00Z">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [en] (X11; I; Linux 2.0.29 i586) [Netscape]">
   <TITLE>LinuxFocus Vol Nr. 4 Nociones generales sobre Povray</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#FF0033" VLINK="#FF3333">
<MAP name="navegator"><AREA shape="rect" coords="0, 0, 65, 28" alt="Ir al Hogar" href="../"><AREA shape="rect" coords="66, 0, 124, 28" alt="Ver &Iacute;ndice" href="../indice.html"><AREA shape="rect" coords="125, 0, 193, 28" alt="Buscar" href="../search.html"><AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html"><AREA shape="rect" coords="261, 0, 350, 28" alt="Acerda de nosotros" href="../aboutus.html"></MAP>

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH="100%" >
<CAPTION>

<THEAD>
</THEAD>

<TBODY>
</CAPTION>

<TR ALIGN=CENTER>
<TD COLSPAN="2">
<IMG SRC="../../common/May1998/border-short.jpg" ALT="[LinuxFocus Image]" HEIGHT=88 WIDTH=407></DIV>
</TD>
</TR>

<TR ALIGN=CENTER>
<TD COLSPAN="2" BGCOLOR="#660033">
<IMG ISMAP SRC="../../common/May1998/Navegator-bar.gif" ALT="[Navegation Bar]" BORDER=0 usemap="#navegator" HEIGHT=28 WIDTH=351></DIV>
</TD>
</TR>

<TR ALIGN=CENTER>
<TD COLSPAN="2">
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=5 WIDTH="75%" >
<TR BGCOLOR="#000000">
<TD ALIGN=CENTER>
<I><FONT FACE="Helvetica,Arial"><A HREF="../News/"><FONT COLOR="#FFFFFF">&nbsp;
Noticias</FONT></A></FONT>&nbsp;<FONT FACE="Helvetica,Arial"><A HREF="../Archives/"><FONT COLOR="#FFFFFF">&nbsp;
Archivos</FONT></A></FONT>&nbsp;<FONT FACE="Helvetica,Arial"><A HREF="../Companies/"><FONT COLOR="#FFFFFF">&nbsp;
Compa&ntilde;&iacute;as</FONT></A></FONT>&nbsp;<FONT FACE="Helvetica,Arial"><A HREF="../Tips/"><FONT COLOR="#FFFFFF">&nbsp;
Consejos&nbsp;</FONT></A></FONT>&nbsp;</I>
</TD>
</TR>

<TD ALIGN=CENTER>

<H1>
<I><FONT FACE="Helvetica,Arial"><FONT COLOR="#660066">Nociones generales
sobre Povray</FONT></FONT></I></H1>

<H3>
<I><FONT FACE="Helvetica,Arial"><FONT COLOR="#000000">por <A HREF="mailto:acastro@ctv.es">Antonio
Castro</A></FONT></FONT></I></H3>
&nbsp;
<I>Este es el segundo art&iacute;culo de la serie dedicado
a Povray.  En el presente explicaremos alguna nociones generales
y comenzaremos con los elementos b&aacute;sicos del lenguaje</I>

<HR size="2" noshade></DIV>
</TD>
</TR>
</TABLE>

</TD>
</TR>

<TR>
<TD ALIGN=CENTER VALIGN=TOP>
<H4>
<A HREF="#IMAG_ART">Im&aacute;genes del art&iacute;culo</A></H4>

<H4>
<A HREF="#FUND_RENDER">Fundamentos del render</A></H4>

<H4>
<A HREF="#7ERR">Los siete errores</A></H4>

<H4>
<A HREF="#POV_LANG">El lenguaje de Povray</A></H4>

<H4>
<A HREF="#ANIM">Conceptos b&aacute;sicos sobre animaci&oacute;n</A></H4>

<H4>
<A HREF="#POV20">POV Ver 2.0</A></H4>

<H4>
<A HREF="#3D">Aspectos 3D</A></H4>

<H4>
<A HREF="#3DPOS">Posuci&oacute;n</A></H4>

<H4>
<A HREF="#3DTRANS">Traslaci&oacute;n</A></H4>

<H4>
<A HREF="#3DGIRO">Giro</A></H4>

<H4>
<A HREF="#3DESCAL">Escalado</A></H4>

<H4>
<A HREF="#LUZ">Luz</A></H4>

<H4>
<A HREF="#CAMARA">C&aacute;mara</A></H4>
&nbsp;</TD>

<TD ALIGN=CENTER>
<TABLE BORDER=0 CELLSPACING=5 CELLPADDING=5 WIDTH="75%" >
<TR>
<TD>
<H3>
<A NAME="IMAG_ART"></A>Im&aacute;genes del art&iacute;culo.&nbsp;</H3>
En este art&iacute;culo las im&aacute;genes se presentan con tama&ntilde;o
reducido y en formato 'jpg'&nbsp; Pinchando en la imagen podremos ver una
imagen en formato 'gif' mayor y con mucha m&aacute;s calidad .&nbsp;

<P>Las animaciones se construir&aacute;n sobre una resoluci&oacute;n baja
y solo se mostraran 15 fotogramas en formato 'jpg'.&nbsp;
<BR>Esto se hace asi para no ocupar excesivo espacio de disco duro y para
evitar que la descarga de este art&iacute;culo resulte demasiado lenta.&nbsp;
<BR>De todas formas como siempre proporcionaremos los fuentes y disponemos
una herramienta 'pov' que ya presentamos en el art&iacute;culo anterior,
para que cualquiera pueda renderizar con la resoluci&oacute;n que quiera,
o cambiar el fuente para experimentar y aprender el lenguaje de Povray.&nbsp;

<P>Si a&uacute;n no ha instalado Povray en su ordenador puede hacerlo guiandose
por&nbsp; el art&iacute;culo anterior con el que iniciamos la serie dedicada
a Povray. Le animamos a hacerlo.&nbsp;
<H3>
<A NAME="FUND_RENDER"></A>Fundamentos del render.</H3>
En el cap&iacute;tulo anterior mencionamos de pasada la noci&oacute;n de
trazado de rayos, y vamos a profundizar algo m&aacute;s ahora.&nbsp;
<BR>El render es la t&eacute;cnica m&aacute;s completa para lograr una
imagen sint&eacute;tica.&nbsp;
<BR>Para ello se intenta emular de la manera mas realista y menos costosa
posible el comportamiento de la luz en la realidad y sus efectos visuales.&nbsp;

<P>En nuestro art&iacute;culo anterior mencionamos que el render calcula
cantidad de rayos luminosos pero curiosamente en este modelo la fuente
de luz se comporta como sumidero de los rayos y la c&aacute;mara ser&aacute;
el punto del que salgan todos los rayos. La raz&oacute;n de esto, es que
si lo hici&eacute;ramos al rev&eacute;s la mayor&iacute;a de los rayos
solo supondr&iacute;an c&aacute;lculo in&uacute;til y solo unos pocos alcanzar&iacute;an
la c&aacute;mara. Al hacerlo al rev&eacute;s partimos de cada uno de los
puntos de la imagen que queremos obtener. Cada uno de los puntos de la
futura imagen se corresponde con un punto de una hipot&eacute;tica pel&iacute;cula
fotosensible de nuestra c&aacute;mara virtual. De esta manera procesamos
cada uno de estos puntos por separado. Nosotros hemos configurado Povray
para que construya una imagen y luego la visualizamos con un visualizador
externo. Si hubi&eacute;ramos configurado Povray para SVGA habr&iacute;amos
comprobado como resulta posible ir visualizando la imagen a medida que
esta se calcula. Esto se hace pixel a pixel, de izquierda a derecha de
la pantalla y de arriba abajo. El orden no es casual. El formato de salida
m&aacute;s normal para Povray es el TGA de 24 bits, y tambi&eacute;n se
construye en este orden.&nbsp;

<P>Si alguien se anima a configurar Povray para SVGA. (Yo no lo he hecho)
ver&aacute; que la velocidad de construcci&oacute;n de la imagen depende
de que estemos en una parte complicada o sencilla.&nbsp;
<BR>Podemos observar que las zonas con muchos objetos en la imagen tardan
mas tiempo en procesarse que las que tienen uno solo o ninguno. Desde cada
uno de los impactos de esos rayos en los objeto se calcula el efecto luminoso
correspondiente comprobando la posici&oacute;n de la fuente de luz. La
orientaci&oacute;n de la superficie relativa a la fuente de luz y tambi&eacute;n
las caracter&iacute;sticas de color, textura, y otras caracter&iacute;sticas
definidas en el objeto. El resultado de este an&aacute;lisis se concreta
el tres valores RGB que definen el color y luminosidad de ese punto de
la imagen.&nbsp;

<P><B>Una digresi&oacute;n</B>&nbsp;

<P>El formato TGA de 24 bits es un formato que ocupa mucho espacio pero
resulta trivial generarlo o procesarlo.&nbsp;

<P>Cada pixel viene dado por tres n&uacute;meros de 8 bits para codificar
el color en RGB.&nbsp;
<BR>8bits *3 = 24 bits; 2^24 = 16777216 (16 millones de colores)&nbsp;

<P><!(anexo.1) (unas lineas de C)>
<TABLE BORDER=2 COLS=1 WIDTH="70%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="80%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE><B><I>Para averiguar el ancho y alto:&nbsp;</I></B>&nbsp;

<P>int w, h, i;&nbsp;
<BR>fseek(fi, 12L, SEEK_SET);&nbsp;
<BR>fread(&amp;w, 2L, 1L, fi); /** pos 12 **/&nbsp;
<BR>fread(&amp;h, 2L, 1L, fi); /** pos 14 **/&nbsp;

<P><B><I>Para leer el primer pixel:</I></B>&nbsp;

<P>fseek(fi, 16L, SEEK_SET); /** pos 16 **/&nbsp;
<BR>Blue=fgetc(fi);&nbsp;
<BR>Green=fgetc(fi);&nbsp;
<BR>Red=fgetc(fi);&nbsp;</TD>
</TR>
</TABLE></CENTER>
&nbsp;</TD>
</TR>
</TABLE>
&nbsp;

<P>Simplemente con esta informaci&oacute;n ya seria posible procesar algunas
im&aacute;genes para lograr algunos efectos sencillos.&nbsp;
<BR>Si es un manitas de la programaci&oacute;n le proponemos los siguientes
ejercicios:&nbsp;

<P>1) Aclarar/oscurecer&nbsp; una imagen.&nbsp; (Los pixels blancos valen&nbsp;
255,255,255, y&nbsp; los negros 0,0,0)&nbsp;
<BR>2) Superrponer una imagen con fondo negro a otra tomando el negro como
transparente.&nbsp;
<BR>3) Fundir dos imagenes en una promedio.&nbsp;
<BR>5)&nbsp; Realzar/atenuar&nbsp; un color&nbsp;
<BR>6) Obtener el histograma de color de una imagen (Lista de colores y
sus frecuencias).&nbsp;

<P>Estas cosa normalmente se puede conseguir utilizando programas auxiliares
pero puede que alguna vez necesitemos&nbsp;
<BR>hacer un tratamiento trivial de una imagen y sin embargo no encontrar
una herramienta que lo haga.&nbsp; Este formato TGA&nbsp;
<BR>de 24 bits le resultar&aacute; muy manegable.&nbsp;

<P><B>Fin de la digresi&oacute;n</B>&nbsp;

<P>Vamos a resaltar un aspecto de este proceso. Los rayos salen de un punto
de la pel&iacute;cula fotosensible de nuestra c&aacute;mara virtual pero
para calcular el color resultante van comprobando si alguno de los objetos
definidos en la escena va a interceptar al rayo. En caso afirmativo se
continua analizando las caracter&iacute;sticas del objeto en la parte alcanzada
por el rayo. Pues bien existe una t&eacute;cnica de optimizaci&oacute;n
muy efectiva cuando se dise&ntilde;an objetos complejos. Consiste en definir
un objeto invisible y muy simple de forma que todo el objeto complejo quede
en su interior. Generalmente como objeto simple se utilizan esferas. Tambi&eacute;n
cajas. La idea es que este objeto sirva para indicar al trazador que si
un rayo no puede pasar por este objeto sencillo tampoco lo har&aacute;
por el objeto complejo situado en su interior. Esto elimina mucho proceso
de calculo. La primitiva se llama "bounced_by" y la he comentado ahora
porque ilustra muy bien como funciona el trazador. Veremos alg&uacute;n
ejemplo m&aacute;s adelante en este art&iacute;culo cuando hablemos de
figuras compuestas.&nbsp;

<P>Es interesante resaltar que las cosas en un trazador de rayos no son
siempre lo que parecen.&nbsp;
<H3>
<A NAME="7ERR"></A>Los siete errores.</H3>
Para ilustrar lo comentado hasta ahora vamos a mostrar una imagen donde
se han utilizado varias t&eacute;cnicas pero poniendo de manifiesto el
truco empleado.&nbsp;

<P>Esta escena la he titulado los 7 errores.&nbsp;

<P>LF2-7errores.gif&nbsp;
<CENTER><A HREF="../../common/May1998/7errores.jpg"><IMG SRC="../../common/May1998/7errores-small.jpg" ALT="7errores"></A></CENTER>


<P>Si nos fijamos atentamente veremos que hay alunos aspectos de esta imagen
que no resultan normales.&nbsp;
<OL>
<LI>
Hay un &uacute;nico foco de luz intensa situado en el centro de un anillo,
pero pese a estar mirando casi directamente a ses punto, no se puede ver.&nbsp;</LI>

<LI>
Hemos puesto un poco m&aacute;s atr&aacute;s de este foco una bola blanca
que proyecta una sombra en el cielo. Por ello descubrimos que en lugar
de un cielo tenemos un decorado barato,&nbsp; porque la sombra nos indica
la presencia de una boveda celeste s&oacute;lida.&nbsp;</LI>

<LI>
El mar tiene olas pero est&aacute; construido con una delgad&iacute;sima
superficie totalmente plana. Para poderlo apreciar hemos cortado el mar
y vemos que el corte es totalmente recto. (sin olas)&nbsp;</LI>

<LI>
En un plano cercano tenemos tres cajas. Vemos que la del centro no produce
sombra.&nbsp;</LI>

<LI>
Considerando en conjunto las tres cajas se produce una situaci&oacute;n
extra&ntilde;a. Que clase de iluminaci&oacute;n hay realmente. Un foco
directo provocando sombras duras. Luz difusa indirecta provocando sombras
suaves? Al parecer la luz ambiente es distinta para cada caja.&nbsp;</LI>

<LI>
La bola de cristal parece maciza en su parte izquierda pero tambi&eacute;n
hemos recortado un trocito a la derecha y hemos introducido un objeto por
ese lado para que se pueda apreciar que tambi&eacute;n es hueca.&nbsp;</LI>

<LI>
La s&eacute;ptima resulta de mirar la imagen en su conjunto. Esta imagen
carece de efectos atmosf&eacute;ricos y hay un exceso de transparencia
en el aire. El color del mar deber&iacute;a ser un poco m&aacute;s azulado
i difuminado al fondo. La bola blanca provoca un cono de sombra que no
deja el menor rastro en el aire .</LI>
</OL>
En este momento no podemos explicar los detalles del las numerosas t&eacute;cnicas
empleadas.Solo quer&iacute;a hacer ver que los trazadores de rayos utilizan
t&eacute;cnicas que simplemente imitan los fen&oacute;menos naturales de
forma no siempre fiel a la realidad porque existe un precio a pagar como
tiempo de proceso. Algunas t&eacute;cnicas sirven solo como parches para
disimular defectos producidos por otras t&eacute;cnicas. Lo que importa
es que el resultado final sea bueno sin un excesivo trabajo de CPU.&nbsp;

<P>Dejemos todo esto como una colecci&oacute;n de enigmas que poco a poco
el avezado alumno ir&aacute; resolviendo en su larga b&uacute;squeda hacia
la perfecci&oacute;n infogr&aacute;fica. Una vez alcanzada podr&aacute;
considerarse a si mismo como master del universo virtual.&nbsp;
<BR>Y si esta&nbsp; maravillosa justificaci&oacute;n no le convence, da
igual porque no pienso explicar nada m&aacute;s sobre el ejemplito de los
siete errores por el momento.&nbsp;
<H3>
<A NAME="POV_LANG"></A>El Lenguaje de Povray.</H3>
Una vez m&aacute;s insistimos en advertir queestos articulos sobre Povray
no pueden hacer otra cosa que tratar distintos temas de forma superficial.
El lenguaje de Povray es demasiado amplio para tratarlo en profundidad.
Quizas por es resaltar en unas pocas lineas lo m&aacute;s destacado del
mismo es lo m&aacute;s acertado que podemos hacer en este momento.&nbsp;
<BR>En Povray es frecuente encontrar varias formas gramaticales para conseguir
el mismo resultado. Esto es debido a que la sintaxis actual es el resultado
de&nbsp; profundos cambios entre las distintas versiones de Povray.&nbsp;
La sint&aacute;xis actual es mucho mejor y quizas no sufra tantos cambios
en el futuro. Por razones de portabilidad se conservan formas sint&aacute;cticas
antiguas o parecidas a las antiguas. Un ejemplo de esta flexibilidad en
la sintaxis son los giros que veremos mas adelante.&nbsp;

<P>Existe una directiva de compilaci&oacute;n que permite utilizar fuentes
de versiones antiguas de Povray.&nbsp;

<P>Ejemplo:&nbsp;
<BR>&nbsp;
<TABLE BORDER=2 COLS=1 WIDTH="70%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="80%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE><B><I>Para&nbsp; usar en un mismo fuente la sint&aacute;xis
de la versi&oacute;n 1, 2, y 3:&nbsp;</I></B>&nbsp;

<P>#version 1.0&nbsp;
<BR>.......&nbsp;
<BR>#version 2.0&nbsp;
<BR>.......&nbsp;
<BR>#version 3.0&nbsp;
<BR>.......&nbsp;</TD>
</TR>
</TABLE></CENTER>
&nbsp;</TD>
</TR>
</TABLE>
&nbsp;
<BR>&nbsp;

<P>Esto permite mezclar en un mismo fuente las tres formas de sintaxis
que se corresponden con los n&uacute;meros principales de las versiones
de Povray&nbsp;

<P>No se pretende hacer un recorrido completo de la sintaxis. Existe un
manual muy bueno para ello, y esto no es un segundo manual.&nbsp; Intentaremos
ganar tiempo se&ntilde;alando &uacute;nicamente lo mas importante. Vamos
a adelantar ahora algunas cuestiones referentes al lenguaje.&nbsp;

<P>Comentarios, Declaraciones, Ficheros include.&nbsp;

<P>Los comentarios son como en C++.&nbsp;
<BR>&nbsp;

<P>Ejemplo:&nbsp;
<BR>&nbsp;
<TABLE BORDER=2 COLS=1 WIDTH="70%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="80%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE><B><I>Para poner comentarios:</I></B>&nbsp;

<P>// Este comentario termina con el final de linea&nbsp;
<BR>/* Este comentario termina con asterisco slash */&nbsp;
<BR>&nbsp;</TD>
</TR>
</TABLE></CENTER>
&nbsp;</TD>
</TR>
</TABLE>
&nbsp;

<P>Los elementos del lenguaje que empiezan por '#' se llaman directivas
de lenguaje (Language Directives).&nbsp;
<BR>Las m&aacute;s usadas son '#declare' e '#include'.&nbsp;
<BR>&nbsp;

<P>&nbsp;
<TABLE BORDER=2 COLS=1 WIDTH="70%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="80%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE><B><I>Las llamadas declaraciones tienen la forma:&nbsp;</I></B>&nbsp;

<P>#declare IDENTIFIER = ITEM&nbsp;</TD>
</TR>
</TABLE></CENTER>
&nbsp;</TD>
</TR>
</TABLE>
&nbsp;

<P>Ejemplo:&nbsp;
<BR>&nbsp;
<TABLE BORDER=2 COLS=1 WIDTH="70%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="80%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE><B><I>Para&nbsp; declarar diversos tipos de elementos:&nbsp;</I></B>&nbsp;

<P>#declare Rows = 5&nbsp;
<BR>#declare Count = Count+1&nbsp;
<BR>#declare Here = &lt;1,2,3>&nbsp;
<BR>#declare White = rgb &lt;1,1,1>&nbsp;
<BR>#declare Cyan = color blue 1.0 green 1.0&nbsp;
<BR>#declare Font_Name = "ariel.ttf"&nbsp;
<BR>#declare Ring = torus {5,1}&nbsp;
<BR>#declare Checks = pigment { checker White, Cyan }&nbsp;</TD>
</TR>
</TABLE></CENTER>
&nbsp;</TD>
</TR>
</TABLE>
&nbsp;

<P>La sentencia '#declare' permite almacenar una gran variedad de elementos.
Desde un giro, una textura, un color, un objeto un valor num&eacute;rico,
etc....&nbsp;

<P>Otro elemento imprescindible del lenguaje son la referencia a ficheros
include.&nbsp;

<P>Permiten incluir en el fuente otros segmentos de otros fuentes.&nbsp;

<P>Por defecto busca en el directorio actual. En caso contrario busca en
Library_Path.&nbsp;
<BR>Nosotros usaremos dos lugares:&nbsp;

<P>Library_Path=${POVRAY}/include // Aqui los includes de Povray&nbsp;
<BR>Library_Path=${HOMEPOV}/include // Aqui los includes del usuario&nbsp;

<P>As&iacute; es como lo tenemos definido en nuestra nueva versi&oacute;n
de 'pov'&nbsp; para que genere el fichero de inicializaci&oacute;n correcto.
Hablaremos m&aacute;s adelante de eso.&nbsp;

<P>Existe una colecci&oacute;n de ficheros include que conviene conocer
para poder sacar todo el partido posible al Povray. Es una librer&iacute;a
de recursos que podemos usar no solo para incluirlas sino para obtener
copias modificadas a nuestro gusto.&nbsp;
<BR>&nbsp;
<TABLE BORDER=2 COLS=1 WIDTH="70%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="80%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE><B><I>Algunos includes de Povray de uso corriente:</I></B>&nbsp;

<P>#include "colors.inc"&nbsp;
<BR>#include "textures.inc"&nbsp;
<BR>#include "shapes.inc"&nbsp;
<BR>#include "finish.inc"&nbsp;
<BR>#include "glass.inc"&nbsp;
<BR>#include "metals.inc"&nbsp;
<BR>#include "stones.inc"&nbsp;
<BR>#include "woods.inc"&nbsp;
<BR>#include "atmos.inc"&nbsp;</TD>
</TR>
</TABLE></CENTER>
&nbsp;</TD>
</TR>
</TABLE>


<P>Algunas otras directivas de lenguaje permiten implementar bucles y sentencias
condicionales. En las primeras versiones de Povray no exist&iacute;an sentencias
de bucles ni condicionales. Eso unido a que las descripciones de los elementos
de la escena pod&iacute;an aparecer en cualquier orden supon&iacute;a un
cambio de mentalidad frente a un lenguaje de programaci&oacute;n tradicional.&nbsp;
<BR>El orden en que se declaran los elementos de una escena sigue siendo
indiferente pero los bucles pueden evitarnos tener que escribir muchas
lineas parecidas y las directivas condicionales nos permiten definir de
distintas formas una misma escena en funci&oacute;n por ejemplo del valor
de 'clock' utilizado en animaciones. Pondremos un ejemplo de sentencia
condicional&nbsp; en&nbsp; otros art&iacute;culos m&aacute;s adelante.
Cuando mencionemos la figuras compuestas.&nbsp;

<P>Existen muchas otras directivas de lenguaje (que empiezan por '#') pero
insistimos en que estas dos que acabamos de mencionar '#declare' e '#include'
son con diferencia las m&aacute;s utilizadas.&nbsp;
<BR>&nbsp;
<BR>No vamos a describir cosas que son muy similares a otros lenguajes,
tales como expresiones aritm&eacute;ticas, constantes de diversos tipos,
operadores l&oacute;gicos, de comparaci&oacute;n, operadores para vectores,&nbsp;
funciones predefinidas, y muchas cosas m&aacute;s.

<P>Cuando tenga que declarar un identificador es conveniente usar alguna
may&uacute;scula. La raz&oacute;n es que las palabras reservadas del lenguaje.
<BR>(Ver el manual) solo utilizan min&uacute;sculas.&nbsp; Si en alg&uacute;n
fuente localiza una palabra que tiene alguna may&uacute;scula se trata
de un identificador
<BR>declarado en alguna parte. Esta es una buena forma de averiguar si
tiene que buscar en el manual o en los includes.
<H3>
<A NAME="ANIM"></A>Conceptos b&aacute;sicos sobre animaci&oacute;n.</H3>
Tratar este tema tan pronto merece una aclaraci&oacute;n.&nbsp;
<BR>Siempre se ha dicho que una imagen vale m&aacute;s que mil palabras.
Esto es especialmente cierto cuando intentamos explicar las funcionalidades
de un trazador de rayos. Intentaremos ilustrar abundantemente cada concepto
porque de otro modo estar&iacute;amos obligando al lector con ganas de
aprender a comprobar por si mismo las explicaciones generando ejemplos
para poderlas entender mejor. De esta forma usando abundante material gr&aacute;fico
no solo obtendremos un texto m&aacute;s ameno y de m&aacute;s f&aacute;cil
lectura sino una gu&iacute;a de consulta realmente &uacute;til porque algunas
veces simplemente volviendo a consultar las im&aacute;genes relativas a
la ilustraci&oacute;n de un concepto nos evita tener que volver a releer
toda la explicaci&oacute;n. Una imagen tiene la virtud de refrescar la
memoria de manera instant&aacute;nea. Algunas veces no basta una imagen
sino que es necesario una secuencia de ellas para poder apreciar ciertos
efectos mediante la comparaci&oacute;n de las im&aacute;genes, y es aqu&iacute;
donde se justifica la necesidad de hablar tan pronto de este tema.&nbsp;
<BR>Povray b&aacute;sicamente se limita a generar la secuencia de im&aacute;genes
y guardarlas en disco por separado.&nbsp;
<BR>De momento solo nos interesa explicar una forma sencilla de conseguirlo.
El trazador Povray ser&aacute; lanzado varias veces pas&aacute;ndole cada
vez un valor distinto que es funci&oacute;n del n&uacute;mero de imagen
que en el fuente ser&aacute; considerado produciendo una imagen distinta.
Para lanzar varias veces el Povray se pueden usar ciertas opciones en el
fichero *.ini pensadas para generar animaciones.&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<TABLE BORDER=2 COLS=1 WIDTH="70%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="80%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE><B><I>Ejemplo para un fichero *.ini :</I></B>&nbsp;

<P>Initial_Clock = 0.0&nbsp;
<BR>Final_Clock = 2.0&nbsp;
<BR>Initial_Frame = 1&nbsp;
<BR>Final_Frame = 200&nbsp;
<BR>Subset_Start_Frame = 51&nbsp;
<BR>Subset_End_Frame = 75</TD>
</TR>
</TABLE></CENTER>
&nbsp;</TD>
</TR>
</TABLE>
&nbsp;

<P>Puesto que para generar el fichero *.ini propusimos en el art&iacute;culo
anterior un programa sencillo que nos permit&iacute;a el uso sencillo y
c&oacute;modo de Povray vamos a proceder a actualizarlo para que nos sirva
para generar animaciones.&nbsp;

<P>Una modificaci&oacute;n m&aacute;s. Hemos habilitado un directorio include
que podr&aacute; ser compartido por varios proyectos.&nbsp;
<BR>'$HOME/dat/pov/include'&nbsp; Si desea crear su propia librer&iacute;a
de includes este ser&iacute;a un buen lugar para colocarla.&nbsp;
<BR>&nbsp;
<H4>
<A NAME="POV20"></A>Pov ver 2.0</H4>
<!(anexo.2) (fuente de pov)>
<TABLE BORDER=2 COLS=1 WIDTH="90%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE>
<CENTER><TABLE BORDER=0 COLS=1 WIDTH="90%" BGCOLOR="#FFFFCC" NOSAVE >
<TR NOSAVE>
<TD NOSAVE><B><I>Ejemplo para un fichero *.ini :</I></B>&nbsp;
<PRE>-----------------------------------------------8&lt;-----------------

#!/bin/bash
#####################################################################
#&nbsp; Autor: Antonio Castro Snurmacher&nbsp; (Feb-1998)
#
#&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pov (ver 2.0)
#
#&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Esta versi&oacute;n esta dedicada a su inclusi&oacute;n en la
#&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; revista LinuxFocus&nbsp;&nbsp; (freeware)
#
#&nbsp; Esta version (2.0) incorpora posibilidad de generar animaciones
#
#&nbsp; Requiere 'xv' e 'imagemagick (convert,animate) '
#&nbsp;
#&nbsp; Este programa puede ser utilizado, distribuido, y modificado
#&nbsp; libremente pero siempre se deber&aacute; respetar la propiedad
#&nbsp; intelectual de su autor. Esta cabecera debe ser conservada&nbsp;
#&nbsp; tal cual en todas las modificaciones.&nbsp;
#
#&nbsp; En caso de traduccion deber&aacute; conservarse el texto original de
#&nbsp; esta cabecera y a&ntilde;adirse la traducci&oacute;n a continuaci&oacute;n de ella.
#
#&nbsp; El autor renuncia a todo tipo de beneficio econ&oacute;mico y no se hace&nbsp;
#&nbsp; responsable de los posibles perjuicios derivados del uso del mismo.&nbsp;
#&nbsp;
#&nbsp; E-mail (acastro@ctv.es)
#&nbsp;
#####################################################################
uso(){
&nbsp;&nbsp; echo "Uso: pov &lt;proyect> &lt;size=0..6> &lt;quality=1..11> "
&nbsp;&nbsp; echo "&nbsp;&nbsp;&nbsp; [ &lt;Initial_Frame> &lt;Final_Frame> &lt;Initial_Clock> &lt;Final_Clock>"
&nbsp;&nbsp; echo "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; [ &lt;Subset_Start_Frame> &lt;Subset_End_Frame> ] ]"
&nbsp;&nbsp; echo
&nbsp;&nbsp; echo "0) 40x30&nbsp;&nbsp;&nbsp;&nbsp; (STD/20) No backup"
&nbsp;&nbsp; echo "1) 80x60&nbsp;&nbsp;&nbsp;&nbsp; (STD/10) No backup"
&nbsp;&nbsp; echo "2) 100x75&nbsp;&nbsp;&nbsp; (STD/8)&nbsp; No backup"
&nbsp;&nbsp; echo "3) 200x150&nbsp;&nbsp; (STD/4)"
&nbsp;&nbsp; echo "4) 266x200&nbsp;&nbsp; (STD/3)"
&nbsp;&nbsp; echo "5) 320x200 *"
&nbsp;&nbsp; echo "6) 400x300&nbsp;&nbsp; (STD/2)"
&nbsp;&nbsp; echo "7) 640x480 *"
&nbsp;&nbsp; echo "8) 800x600 *&nbsp;&nbsp; (STD)"
&nbsp;&nbsp; echo "9) 1024x768 *"
&nbsp;&nbsp; echo
&nbsp;&nbsp; echo "Los proyectos deben situarse en un directorio situado en"
&nbsp;&nbsp; echo "${HOMEPOV} y se usar&aacute; el mismo nombre&nbsp; para el directorio"
&nbsp;&nbsp; echo "que para el fichero fuente principal *.pov"
&nbsp;&nbsp; echo "(STD) es la resoluci&oacute;n elegida como referencia estandar."
&nbsp;&nbsp; echo
&nbsp;&nbsp; exit 1
}

newversion(){
mv ${PREFIX}.pov.8.gz ${PREFIX}.pov.9.gz 2> /dev/null
mv ${PREFIX}.pov.7.gz ${PREFIX}.pov.8.gz 2> /dev/null
mv ${PREFIX}.pov.6.gz ${PREFIX}.pov.7.gz 2> /dev/null
mv ${PREFIX}.pov.5.gz ${PREFIX}.pov.6.gz 2> /dev/null
mv ${PREFIX}.pov.4.gz ${PREFIX}.pov.5.gz 2> /dev/null
mv ${PREFIX}.pov.3 ${PREFIX}.pov.4 2> /dev/null
mv ${PREFIX}.pov.2 ${PREFIX}.pov.3 2> /dev/null
mv ${PREFIX}.pov.1 ${PREFIX}.pov.2 2> /dev/null
cp ${PREFIX}.pov&nbsp;&nbsp; ${PREFIX}.pov.1&nbsp;
gzip ${PREFIX}.pov.4 2> /dev/null
}

#################################################
size(){
&nbsp;&nbsp; export SAVE="yes"
&nbsp;&nbsp; case&nbsp; $1 in
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 0) Width=40 ; Height=30; SAVE="no" ;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1) Width=80 ; Height=60&nbsp; SAVE="no" ;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2) Width=100; Height=75&nbsp; SAVE="no" ;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3) Width=200; Height=150;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 4) Width=266; Height=200;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 5) Width=320; Height=200;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 6) Width=400 ;Height=300;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 7) Width=640 ;Height=480;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 8) Width=800 ;Height=600;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 9) Width=1024;Height=768;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; *) uso
&nbsp;&nbsp; esac
}

quality(){
&nbsp;&nbsp; case $1 in
&nbsp;&nbsp; 1) ;;
&nbsp;&nbsp; 2) ;;
&nbsp;&nbsp; 3) ;;
&nbsp;&nbsp; 4) ;;
&nbsp;&nbsp; 5) ;;
&nbsp;&nbsp; 6) ;;
&nbsp;&nbsp; 7) ;;
&nbsp;&nbsp; 8) ;;
&nbsp;&nbsp; 9) ;;
&nbsp;&nbsp; 10) ;;
&nbsp;&nbsp; 11) ;;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; *) uso
&nbsp;&nbsp; esac
&nbsp;&nbsp; export Quality=$1
}

#############################################################
Single(){&nbsp;
cat &lt;&lt;-FIN >> ${PREFIX}.ini
&nbsp;&nbsp; Output_File_Name=${PREFIX}.tga
&nbsp;&nbsp; Post_Scene_Command=xv ${PREFIX}.tga
FIN
}

#############################################################
SubSet(){
cat &lt;&lt;-FIN >> ${PREFIX}.ini
&nbsp;&nbsp; Subset_Start_Frame=$Subset_Start_Frame
&nbsp;&nbsp; Subset_End_Frame=$Subset_End_Frame
FIN
}

#############################################################
Animation(){
cat &lt;&lt;-FIN >> ${PREFIX}.ini
&nbsp;&nbsp; Output_File_Name=${PREFIX}.tga
&nbsp;&nbsp; Initial_Frame=$Initial_Frame
&nbsp;&nbsp; Final_Frame=$Final_Frame
&nbsp;&nbsp; Initial_Clock=$Initial_Clock
&nbsp;&nbsp; Final_Clock=$Final_Clock
FIN
if [ $NumParm == 9 ]
&nbsp;&nbsp; then&nbsp;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; SubSet
fi
cat &lt;&lt;-FIN >> ${PREFIX}.ini
&nbsp;&nbsp; Pre_Scene_Command=rm -f \`ls --color=none ${PREFIX}*.tga.gif\`&nbsp;&nbsp;&nbsp;
&nbsp;&nbsp; Pre_Frame_Command=rm -f \`ls --color=none ${PREFIX}*.tga\`&nbsp;&nbsp;&nbsp;
&nbsp;&nbsp; Post_Frame_Command=convert %o %o.gif
&nbsp;&nbsp; Post_Scene_Command=animate -delay $DELAY&nbsp; \`ls -tr --color=none ${PREFIX}*.tga.gif\`&nbsp;
FIN
}

####################### main ##############################
export HOMEPOV=${HOME}/dat/pov
export PROYECT=$1
export PREFIX=${HOMEPOV}/${PROYECT}/${PROYECT}
if [ $# != 3 ] &amp;&amp; [ $# != 7 ] &amp;&amp; [ $# != 9 ]
&nbsp;&nbsp; then uso
fi
NumParm=$#
if [ $NumParm -le 3 ] &amp;&amp; [ grep Clock ${PREFIX}.pov > /dev/null 2>&amp;1 ]
&nbsp;&nbsp; then&nbsp;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; echo "No econtrado identificador Clock en el fuente"
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; uso
fi
export POVRAY=/usr/local/apli/povray/povray3
size $2
quality $3
Initial_Frame=$4
Final_Frame=$5
Initial_Clock=$6
Final_Clock=$7
Subset_Start_Frame=$8
Subset_End_Frame=$9

NumClocks=`expr $Final_Clock - $Initial_Clock`
if [ $NumClocks -gt 0 ]
&nbsp;&nbsp; then if [ $NumClocks -le 40 ]
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; then export DELAY=`expr 4000 / $NumClocks`
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; else export DELAY=100
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; fi
&nbsp;&nbsp; else export DELAY=4000
fi

if [ $SAVE == "yes" ]
&nbsp;&nbsp; then newversion
fi
cat &lt;&lt;-FIN > ${PREFIX}.ini
&nbsp;&nbsp; Width=$Width
&nbsp;&nbsp; Height=$Height
&nbsp;&nbsp; Quality=$Quality
&nbsp;&nbsp; Library_Path=${POVRAY}/include
&nbsp;&nbsp; Library_Path=${HOMEPOV}/include
&nbsp;&nbsp; Input_File_Name=${PREFIX}.pov
&nbsp;&nbsp; Output_to_File=on
&nbsp;&nbsp; Output_File_Type=t
&nbsp;&nbsp; verbose=on
FIN
if [ $NumParm == 3 ]
&nbsp;&nbsp; then ## Single image
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Single
&nbsp;&nbsp; else ## Animation
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Animation
fi
#montage ${PREFIX}.tga.* ; animate ${PREFIX}.

#&nbsp;&nbsp; Output_File_Type=t
## Others hight performace options ##
#&nbsp;&nbsp; Antialias_Depth=3
#&nbsp;&nbsp; Antialias=On
#&nbsp;&nbsp; Antialias_Threshold=0.1
#&nbsp;&nbsp; Jitter_Amount=0.5
#&nbsp;&nbsp; Jitter=On

# Baja prioridad por si quiero hacer otras cosas.
nice -20 x-povray ${PREFIX}.ini&nbsp;

if [ $SAVE != "yes" ]
&nbsp;&nbsp;&nbsp; then echo "!! Atenci&oacute;n !! No se gener&oacute; backup de esta versi&oacute;n."
fi

---------------------------8&lt;-----------------------------------</PRE>
</TD>
</TR>
</TABLE></CENTER>
&nbsp;</TD>
</TR>
</TABLE>
&nbsp;

<P>De vez en cuando utilizaremos programas externos a Povray.&nbsp;

<P>Para poder visualizar la animaci&oacute;n usaremos las utilidades animate,
y convert de imagemagick.&nbsp;

<P><B>Digresi&oacute;n&nbsp;</B>&nbsp;

<P>Pregunt&eacute; a Enrique Zanardi, encargado de mantener el paquete
de Povray para Debian, si exist&iacute;a alg&uacute;n modelador para Povray.&nbsp;

<P>E.Zanardi wrote&nbsp;

<P>> Yo he usado el ScEd (tambi&eacute;n disponible para Debian). Una vez
que le&nbsp; coges el truquillo es bastante c&oacute;modo.&nbsp;
<BR>> Adem&aacute;s tienes la opci&oacute;n de compilarlo con un interprete
de Scheme incorporado, de forma que puedes definir tus propias&nbsp;
<BR>> &oacute;rdenes, todo lo complejas que t&uacute; quieras.&nbsp;
<BR>> Tambi&eacute;n se recomienda mucho por ah&iacute; el Ac3D, pero creo
que no es libre.&nbsp;
<BR>&nbsp;

<P><B>Fin digresi&oacute;n&nbsp;</B>&nbsp;

<P>Veremos un ejemplo de animaci&oacute;n en el capitulo que viene a continuaci&oacute;n,
que nos servir&aacute; para ilustrar la forma de especificar giros y traslaciones.&nbsp;

<P>Vamos a comentar ahora brevemente otra forma de generar animaci&oacute;n
que es la que se utilizaba en las primeras versiones de Povray pero que
aun continua siendo muy valida.&nbsp;

<P>Consiste en usar un programa externo que generara un bucle para lanzar
el Povray varias veces. A cada iteraci&oacute;n se escribir&aacute; un
fichero incluido mediante una sentencia '#include' en el fuente principal
y que contendr&aacute; las definiciones variables e el tiempo.&nbsp;

<P>Para hacer esto en C ser&iacute;a m&aacute;s o menos as&iacute;:&nbsp;

<P><!(anexo.3) (fragmento en C)>
<CENTER><TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFFFCC" NOSAVE >
<CAPTION>&nbsp;</CAPTION>

<TR>
<TD>----------------------8&lt;----------------------------------------------&nbsp;
<PRE>for(Frame=1; Frame &lt; UltimoFrame; Frame++){
&nbsp;&nbsp; fi=fopen("pajaro.inc", "w");
&nbsp;&nbsp; fprintf(fi, "#declare PosX_pajaro1 = %d\n", FuncionPosX_pajaro1(Frame));
&nbsp;&nbsp; fprintf(fi, "#declare PosY_pajaro1 = %d\n", FuncionPosY_pajaro1(Frame));
&nbsp;&nbsp; fprintf(fi, "#declare AnguloAlas_p1 = %d\n", FuncionAngAlas_p1(Frame));
&nbsp;&nbsp; fclose(fi);
&nbsp;&nbsp; sprintf(comando, "povray -ipajaro.pov -opajaro%04d.tga", Frame);
&nbsp;&nbsp; system(comando);
}</PRE>
----------------------8&lt;----------------------------------------------&nbsp;</TD>
</TR>
</TABLE></CENTER>
&nbsp;
<H3>
<A NAME="3D"></A>Aspectos 3D&nbsp;</H3>
Hay una serie de operaciones 3D que podemos efectuar sobre un onjeto.&nbsp;

<P>Ademas los objetos se pueden agrupar de forma que resulte un objeto
compuesto sobre el que podemos operar globalmente para trasladarlo, girarlo,
o escalarlos.&nbsp;
<H4>
<A NAME="3DPOS"></A>Posicion&nbsp;</H4>
La posici&oacute;n de un objeto viene determinada por sus coordenadas&nbsp;
&lt;x,y,z> o mejor es adpotar un mismo patr&oacute;n de referencia para
orientarnos m&aacute;s comodamente en nuestros dise&ntilde;os.&nbsp;
<BR>Yosuelo situar siempre que puedo el objeto en el centro de coordenadas.&nbsp;

<P>Cualquier punto puede ser posicionado en un determinado punto indicando
sus coordenadas&nbsp; &lt;x,y,z> . Los datos expresados en estaforma se
llaman vectores. Se utilizan mucho en Povray. Una forma abreviada de expresar
un vector cuando todos sus componentes son iguales es&nbsp; con un solo
numero entre corchetes angulares :
<BR>&lt;24, 24, 24>&nbsp; = &lt;24>
<BR>Otra forma abreviada es multiplicar un escalar por un vector. Hay tres
vectores predefinidos en el lenguaje que son x=&lt;1,0,0>
<BR>y=&lt;0,1,0> y z=&lt;0,0,1>. Por ello los vectores siguientes son equivalentes.&nbsp;
3*y = &lt;0,3,0>&nbsp; -2*x = &lt;-2,0,0>

<P>Muchas veces es necesario trabajar con lapiz, papel para situar correctamente
los objetos.&nbsp;

<P>Otra forma es colocarlos de forma aproximada y refinar las posiciones
mediante prueba y error. Para estas pruebas es conveniente utilizar baja
resoluci&oacute;n y baja calidad para obtener resultados r&aacute;pidos.

<P>&nbsp;

<P>Existen una serie de operaciones de transformaci&oacute;n. Esta son:

<P>&nbsp; rotate &lt;VECTOR>
<BR>&nbsp; scale &lt;VECTOR>
<BR>&nbsp; translate &lt;VECTOR>

<P>Los movimientos de traslaci&oacute;n y giros tienen utilidad en animaciones
asi como para la comoda colocaci&oacute;n de los componentes de un objeto.&nbsp;
<BR>&nbsp;
<H4>
<A NAME="3DTRANS"></A>Traslaci&oacute;n&nbsp;</H4>
Cualquier objeto puede ser trasladado a otro punto sumandole un vector
de traslaci&oacute;n.&nbsp;
<BR>Esto quiere decir que la nueva posici&oacute;n ser&aacute; la suma
de los vectores de posici&oacute;n actual y el vector traslacion.
<BR>Ejemplo:

<P>sphere { &lt;2, 2, 2>, 10
<BR>&nbsp;&nbsp;&nbsp; pigment { White }
<BR>&nbsp;&nbsp;&nbsp; translate &lt;-3>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
//&nbsp; Recuerde &lt;-3> = &lt;-3, -3, -3>
<BR>&nbsp; }

<P>El resultado ser&iacute;a una esfera de 10 de radio con el centro situado
en la posici&oacute;n&nbsp; &lt;-1,-1,-1>

<P>&nbsp;
<H4>
<A NAME="3DGIRO"></A>Giro&nbsp;</H4>
Cualquier objeto puede ser girado y los giros se realizan respecto al centro
de coordenadas.&nbsp;
<BR>Los objetos que van a ser girados sobre si mismos suelen definirse
situados en el centro del sistema de coordenados porque primero hay que
girarlos y luego trasladarlos. Si lo que deseamos es que giren respecto
a un eje distante lo situaremos a esa distancia y luego lo giraremos.&nbsp;
<BR>Para girar un objeto definimos un eje y un angulo de giro respecto
a ese eje.&nbsp;

<P>Para recordar el sentido de giro usaremos la regla de la mano izquierda.&nbsp;
<BR>Imagine que toma un eje con su mano izquierda y deja el pulgar estirado
en la direcci&oacute;n positiva del eje. La direcci&oacute;n de giro positivo
viene dada por la direcci&oacute;n y la curva de los dedos restantes en
su recorrido desde las bases de los dedos hasta las u&ntilde;as.&nbsp;

<P>Existen dos formas sint&aacute;cticas de definir un giro.&nbsp;
<BR>Eje * grados o tres n&uacute;meros&nbsp; &lt;n,n,n>&nbsp; que representan
respectivamente los giros al rededor de los ejes X, Y, y Z.&nbsp;
<BR>Podremos algunos ejemplos.&nbsp;

<P>rotate x * 45 = rotate &lt;45, 0, 0>&nbsp;
<BR>rotate &lt;45, -30, 20> = rotate x*45 rotate y*-30 rotate z*20&nbsp;
<BR>rotate 20*z = rotate z*20&nbsp;
<BR>rotate y*90 x*90 = rotate &lt;0, 90, 0> rotate &lt;90, 0, 0>&nbsp;
<BR>rotate y*90 x*90 != rotate &lt;90, 90, 0>&nbsp;

<P>El &uacute;ltimo ejemplo no es una equivalencia sino un caso que se
presta a confusi&oacute;n. El orden en que se realizan los giros es importante.
Cuando usamos la notaci&oacute;n de &lt;n,n,n> los giros siempre se realizan
en el orden X, Y, Z y cuando se necesita otro orden hay que desglosar la
orden en varias instrucciones de rotaci&oacute;n distintas.&nbsp;
<BR>Nosotros usaremos preferentemente la notacion eje*grados (tambien grados*eje)
Si desea usar radianes puede usar la funci&oacute;n radians.&nbsp;
<BR>Existen muchas funciones aritm&eacute;ticas en Povray que facilitan
los c&aacute;lculos matem&aacute;ticos. Especialmente utiles son las funciones
trigonom&eacute;tricas, pero no entraremos en este tema.&nbsp;
<BR>&nbsp;
<H4>
<A NAME="3DESCAL"></A>Escalado&nbsp;</H4>
El tama&ntilde;o de los objetos puede ser variados.&nbsp;
<BR>Se utlizan tres n&uacute;meros para multiplicar las dimensiones x,
y, z de un objeto. Esto permite aumentar, disminuir, estrirar y achatar
objetos.&nbsp;
<BR>&nbsp;Esto puede servir para construir un elipsoide apartir de una
esfera
<BR>&nbsp;
<BR>sphere { &lt;0,0,0>, 10
<BR>&nbsp;&nbsp;&nbsp; pigment { White }
<BR>&nbsp;&nbsp;&nbsp; scale &lt;1,4,10>
<BR>&nbsp; }
<BR>&nbsp;
<H4>
<A NAME="3DOBS"></A>Observaciones finales sobre las operaciones 3D.</H4>
Las operaciones de traslacion y escalado pueden hacer en cuanquier orden
pero si interviene uno o m&aacute;s giros en las operaciones el resultado
final suele variar totalmente dependiendo del orden de las operaciones..
Veremos un ejemplo sencillo para que el lector aprecie en que orden deben
efectuarse las operaciones.Se trata de un cuerpo esf&eacute;rico de color
azul oribitando sobre si mismo y al rededor de otro punto. El eje de giro
sobre si mismo esta inclinado lligeramente respecto a la perpendicular
del plano de la orbita.&nbsp; (El caso es que este ejemplo me recuerda
algo pero no caigo)&nbsp;
<BR>&nbsp;
<BR>&nbsp;

<P><!(anexo.4)>
<CENTER><TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#FFFFCC" NOSAVE >
<TR>
<TD>----------------------------------8&lt;------------------------------&nbsp;
<BR>#include "colors.inc"&nbsp;
<BR>#include "textures.inc"&nbsp;
<BR>//##### se recomienda usar ######&nbsp;
<BR>//# pov LF2-PlanetBue 4 9 1 100 1 360 #&nbsp;
<BR>//###############################&nbsp;
<BR>#declare RY1 = clock * 5&nbsp;
<BR>#declare RZ1 = 25&nbsp;
<BR>#declare T1 = &lt;5 ,0 ,0 >&nbsp;
<BR>#declare RY2 = clock&nbsp;

<P>camera {&nbsp;
<BR>&nbsp;&nbsp;&nbsp; location &lt; -5, 5, 15>&nbsp;
<BR>&nbsp;&nbsp;&nbsp; look_at &lt; 0, -2, 0>&nbsp;
<BR>}&nbsp;

<P>light_source { &lt;-15, 15, 15> color White}&nbsp;

<P>sphere { &lt;0, 0, 0> 4&nbsp;
<BR>&nbsp;&nbsp;&nbsp; texture { Shadow_Clouds }&nbsp;
<BR>&nbsp;&nbsp;&nbsp; rotate y * RY1&nbsp;
<BR>&nbsp;&nbsp;&nbsp; rotate z * RZ1&nbsp;
<BR>&nbsp;&nbsp;&nbsp; translate T1 rotate y * RY2&nbsp;
<BR>}&nbsp;
<BR>----------------------------------8&lt;------------------------------&nbsp;</TD>
</TR>
</TABLE></CENTER>
Para obtener la animaci&oacute;n lo lanzamos seg&uacute;n la recomendaci&oacute;n
en el fuente. Usamos nuestra nueva versi&oacute;n de la herramienta 'pov'.&nbsp;
Usaremos el comando siguiente:&nbsp;

<P>pov LF2-PlanetBue 4 9 1 100 1 360&nbsp;

<P>El significado de los par&aacute;metros utilizados es:&nbsp;
<BR>&nbsp;
<OL>
<LI>
Usamos como fuente $HOME/dat/pov/LF2-PlanetBue/LF2-PlanetBue.pov&nbsp;</LI>

<LI>
Tama&ntilde;o 4 = (266x200)&nbsp;</LI>

<LI>
Calidad 9 (La m&aacute;s alta)&nbsp;</LI>

<LI>
Fotograma inicial = 1&nbsp;</LI>

<LI>
Fotograma final = 100&nbsp;</LI>

<LI>
Valor inicial de clock = 1&nbsp;</LI>

<LI>
Valor final de clock = 360&nbsp;</LI>
</OL>
Mostraremos unos pocos fotogramas para que se aprecie el resultado.&nbsp;
<BR>Vemos una bola azul orbitando en circulo y girando sobre su propio
eje que esta inclinado 25 grados.&nbsp;

<P>Como modelo real del planeta tierra no sirve pero met&aacute;fora si.&nbsp;

<P>Ejemplo ../../common/May1998/planetblue.jpg&nbsp;
<BR>&nbsp;
<CENTER><A HREF="../../common/May1998/planetblue.jpg"><IMG SRC="../../common/May1998/planetblue-small.jpg" ALT="Planeta Azul"></A></CENTER>

<H3>
<A NAME="LUZ"></A>Luz</H3>
La luz se define como un punto infinitesimal en el espacio.&nbsp;
<BR>Se trata de un punto invisible en el sentido que una c&aacute;mara
enfocada sobre este punto no es detectable. Un foco de luz solo se percibe
por su efecto sobre los objetos que ilumina.&nbsp;
<BR>Por defecto este punto irradia luz en todas las direcciones, aunque
es posible definir conos de luz .&nbsp;
<BR>Por defecto se asume luz blanca pero puede ser coloreada y puede ser
amortiguada en intensidad.&nbsp;

<P>Se puede definir m&aacute;s de una fuente de luz para obtener determinados
efectos de luces y sombras.&nbsp;

<P>Hay que tener en cuanta que al aumentar el n&uacute;mero de fuentes
de luz repercute proporcionalmente en la cantidad de tiempo CPU consumida
para generar la imagen.&nbsp;

<P>La luz puede ser definida por su posici&oacute;n y color pero tambien
hay opciones avanzadas para utilizar fuentes a modo de focos.&nbsp;
<BR>De momento nos conformamos con las opciones m&aacute;s corrientes.
En todos nuestros ejemplos usamos almenos una fuente de luz y una c&aacute;mara.&nbsp;
<H3>
<A NAME="CAMARA"></A>C&aacute;mara</H3>
La c&aacute;mara es un objeto que puede ser orientado para apuntar a un
determinado objeto. Se puede definir el &aacute;ngulo de visi&oacute;n
de la c&aacute;mara. Tambi&eacute;n se puede girar la la c&aacute;mara
en cualquier direcci&oacute;n.&nbsp;
<BR>Existen distintas formas para definir una c&aacute;mara pero la forma
que estamos usando resulta muy flexible y f&aacute;cil de usar. No todas
las formas de definir una c&aacute;mara son igual de &uacute;tiles. Otras
formas menos intuitivas se usan por razones de portabilidad con versiones
anteriores.&nbsp;
<BR>El &aacute;ngulo de apertura de la c&aacute;mara afecta al efecto de
perspectiva sobre la imagen.&nbsp;
<BR>Perd&oacute;n si aveces parece esto una fotonovela pero veremos ejemplos
de distintas perspectivas sobre un ejemplo en el pr&oacute;ximo art&iacute;culo.&nbsp;
<BR>No se lo pierda.&nbsp;
<BR>&nbsp;

<P>
<HR size=2 noshade>
<A HREF="../../common/src/9805pov.tar.gz">Fuentes de los programas de este artículo (3342 bytes)</FONT></A>
<P align="right"><I>Art&iacute;culo original en Castellano</I></P>

 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 Antonio Castro</B></FONT><BR>
    <FONT color="#ffffff">Páginas web mantenidas por
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>




<BR></TBODY><!-- <TBODY> --><!--   <TR> --><!--     <TD colspan="2"> --><!--     <B>For more information</B>:<BR> --><!--     <UL> --><!--       <LI>Read <A href="">other articles in this series</A>. </LI> --><!--       <LI>Consult <A href="">the respective HOWTO</A>.</LI>  --><!--       <LI>Read <A href="">other articles by the same author</A>.</LI>  --><!--      <UL><BR><BR> --><!--     <TD> --><!--   </TR> --><!-- </TBODY> --><B><FONT FACE="Helvetica,Arial"><FONT COLOR="#FFFFFF">&copy;
1998 Antonio Castro</FONT></FONT></B>&nbsp;
<BR><FONT COLOR="#FFFFFF">P&aacute;ginas web mantenidas por <A HREF="mailto:angel@mercury.chem.pitt.edu">Miguel
A Sepulveda</A></FONT>.&nbsp;</TD>
</TR>
</TABLE>
&nbsp;</TD>
</TR>
</TABLE>
&nbsp;
</BODY>
</HTML>
