<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"> 
<HTML lang="en"> 
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1"> 
 <TITLE> Creando Texto con GIMP</TITLE> 
 <META name="Author" CONTENT="Phil Ross"> 
 <META name="Keywords" CONTENT=" "> 
 <META name="Description" CONTENT=" "> 
 <META name="Translator" CONTENT="Hugo Lastras"> 
 <META name="Date" CONTENT="1998-02-91T00:00:00Z"> 
 
</HEAD> 
 
<BODY bgcolor="#FFFFFF" text="#000000" link="#ff0033" vlink="#FF3333"> 
 
  <MAP name="navegator"> 

 <area shape="rect" coords="0, 0, 65, 28" href="../" alt="Hogar">
      <area shape="rect" coords="66, 0, 124, 28" href="../indice.html" alt="Índice">
      <area shape="rect" coords="125, 0, 193, 28" href="../search.html" alt="Búsquedas">
      <area shape="rect" coords="194, 0, 260, 28" href="../links.html" alt="Enlaces">
      <area shape="rect" coords="261, 0, 350, 28" href="../aboutus.html" alt="Acerca de">
  </MAP> 
 
 
 
 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0"> 
 
 <THEAD> 
   <TR align="center"> 
      <TD colspan="2"><IMG src="../../common/May1998/border-short.jpg" alt="[LinuxFocus Image]" width="407" height="88"></TD> 
   </TR> 
 
   <TR align="center"> 
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/May1998/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28" alt="[Navegation Bar]"></TD> 
   </TR> 
 
   <TR align="center"> 
     <TD colspan="2">      
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5"> 
		<TR bgcolor="#000000"> 
		   <TD align="center"> 
  <a href="../News/"><font color="#ffffff"><b>&nbsp; Noticias</b></font></a>
		  <a href="../Archives/"><font color="#ffffff"><b>&nbsp; Archivos</b></font></a>
		  <a href="../Companies/"><font color="#ffffff"><b>&nbsp; Compañías</b></font></a>
		  <a href="../Tips/"><font color="#ffffff"><b>&nbsp; Consejos&nbsp;</b></font></a> 

               </TD> 
            </TR> 
             
		<TR> 
            <!--   Here goes the Title of the article, authors name and abstract --> 
		   <TD align="center"> 
 			<FONT face="Helvetica,Arial" color="#660066"><H1>Creando Texto con The Gimp</H1></FONT> 
 			<FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:phil@ryoko.cis.pitt.edu">
                                 <FONT color="#000000">Phil Ross</FONT></A></H3></FONT> 
                  <HR size="2" noshade> 
	         </TD> 
            </TR> 
 
           </TABLE> 
 
     </TD> 
   </TR> 
 
 </THEAD> 
 
 
 
 <TBODY> 
   
 <TR> 

     <TD align="center"> 
	<TABLE border="0" width="80%" cellspacing="0" cellpadding="0"> 
	   <TR> 
	   <TD> 
 


<CENTER><TABLE>

<TR><TD><P>Hola de nuevo, artistas del Gimp. Aqu&iacute; teneis el segundo 
art&iacute;culo de Linux Focus sobre GIMP. En este n&uacute;mero Manuel se
ha concentrado en el uso de capas en Photoshop para crear algunos bonitos
efectos con texto. Afortunadamente GIMP ha sido ampliamente desarrollado 
durante el &uacute;ltimo a&ntilde;o, y su habilidad para manipular capas
es uno de sus puntos fuertes. Y mientras tenga la suerte, me gustar&iacute;a
poder conectar con un sitio web muy bueno que me permite mantenerme al 
d&iacute;a de las versiones m&aacute;s recientes de GIMP: 
<A HREF="http://freshmeat.unreal.org">http://freshmeat.unreal.org</A>.
Cada vez que sale una nueva versi&oacute;n de GIMP, GTK o cualquier otro 
software de Linux, freshmeat lo menciona casi inmediatamente. Es un sitio
bien organizado y clasificado con una gran utilidad. &iexcl;Lanza tu navegador
y &eacute;chale un vistazo!</P></TD></TR>

<TR><TD><P>As&iacute; pues, sin m&aacute;s pre&aacute;mbulos, veamos qu&eacute;
herramientas de GIMP se pueden usar para hacer lo mismo que ha hecho Manuel con
Photoshop en su art&iacute;culo.</P></TD></TR>

<TR><TD><P>En nuestro &uacute;ltimo art&iacute;culo de GIMP intentamos
familiarizarnos con la caja de di&aacute;logo de Layers & Channels 
(capas y canales). Esta caja de di&aacute;logo es lo que usaremos para 
conseguir nuestros efectos. Ya mencionamos la &uacute;ltima vez c&oacute;mo
llegar a esta caja de di&aacute;logo y, un poco en general, cu&aacute;l 
era su aspecto, pero lo repetiremos brevemente para refrescarnos la memoria.
</P></TR></TD>

<TR><TD><P><IMG ALIGN=RIGHT BORDER=0 SRC="./../../common/May1998/LayersAndChannels.jpg">
Bien, arriba tenemos el men&uacute; Imagen. En GIMP, cuando tienes m&aacute;s
de una imagen abierta, puedes usar este men&uacute; para elegir qu&eacute; 
imagen manipular&aacute; la caja de Capas y Canales.. Debajo del men&uacute;
Imagen tenemos dos pesta&ntilde;as separadas, la pesta&ntilde;a de Capas y 
la pesta&ntilde;a de Canales. La pesta&ntilde;a de Canales nos permite ver 
y manipular canales de color separados, mientras que la pesta&ntilde;a de 
Capas es lo que usaremos para manipular las capas de nuestra imagen. No 
mencionaremos m&aacute;s la pesta&ntilde;a de canales en este art&iacute;culo
ya que no la usaremos (Te animamos a experimentas con ella por ti mismo).</P>

<P>Miremos ahora la pesta&ntilde;a de Capas. En la secci&oacute;n superior
de la pesta&ntilde;a de Capas vemos el men&uacute; de Modo. Es un men&uacute;
desplegable que nos proporciona un mont&oacute;n de maneras de operar en una
capa concreta. Puedes ser muy entretenido experimentar con este men&uacute;.
El bot&oacute;n "Keep Trans." (mantener transparencia) es para mantener la 
transparencia de una capa mientras se manipula. La barra de desplazamiento 
"Opacity" (Opacidad), como ya vimos en el &uacute;ltimo art&iacute;culo, 
controla la opacidad de la capa, o en otras palabras, controla hasta qu&eacute;
grado la imagen es transparente. Mira el art&iacute;culo del &uacute;ltimo 
n&uacute;mero para una explicaci&oacute;n completa. Bajo estos es donde nuestras
capas se muestran. En la parte izquierda de esta lista hay unos iconos con
forma de ojo. Estos controlan si una capa es visible o no. Si el icono 
aparece, la capa es visible, si el icono no aparece, la capa es invisible.
A su lado, a la derecha, pueden aparecer iconos con una cruz de cuatro flechas.
Por defecto no aparecen en ninguna capa, pero pulsando con el rat&oacute;n en
el espacio en blanco del medio los har&aacute; aparecer. Estos iconos controlan
qu&eacute; capas se mover&aacute;n durante una operaci&oacute;n de movimiento.
A su lado, hay una mini vista de la capa. La puedes usar para ver m&aacute;s 
o menos que aspecto tiene la capa. A su derecha est&aacute; el t&iacute;tulo
de la capa. Puedes cambiar el t&iacute;tulo haciendo doble click en el 
t&iacute;tulo: aparece una nueva ventana que te permite cambiarlo. En el 
&uacute;ltimo art&iacute;culo ya discutimos el men&uacute; de la caja de
di&aacute;logo de Capas y Canales. Puedes llegar a ese men&uacute; pulsando
con el bot&oacute;n derecho del rat&oacute;n en el t&iacute;tulo de una 
capa.</P></TD></TR>

<TR><TD><P>Y ahora que nos hemos familiarizado con la caja de di&aacute;logo
de Capas y Canales, juguemos con algunas capas. Abre una imagen nueva con un 
fondo blanco. Elige el color negro y escribe alg&uacute;n texto. Entonces abre 
la caja de di&aacute;logo de Capas y Canales y pulsa con el bot&oacute;n derecho
del rat&oacute;n en el t&iacute;tulo para obtener el men&uacute;. Elige 
Duplicate Layer (duplicar capa) del men&uacute;. Esto simplemente crear&aacute;
otra capa en la imagen que contenga lo mismo. Veamos ahora que puede hacer el
men&uacute; Modo por nosotros. Haz click en la capa superior de la lista de capas
y ves a la caja de la imagen y usa los men&uacute;s para elegir 
Image->Colors->Invert (Imagen, Colores, Invertir). Esto invertir&aacute; todos
los colores de la capa. Ahora tenemos dos capas que son opuestas una de la otra.
Usemos los men&uacute;s para elegir Filters->Blue->Gaussian Blur(IIR) 
(Filtros, Azul, Desenfoque Gaussiano(IIR)) y usa un valor de 3 o 4 para el
desenfoque.</P></TD></TR>

<TR><TD><P>Ahora que tenemos dos capas que son opuestas una de la otra, y una
de ellas est&aacute; ligeramente difuminada, volvemos a la caja de 
di&aacute;logo de Capas y Canales para probar algunas de las opciones de Modo.
Cada capa puede tener su propia opci&oacute;n de Modo, y la opci&oacute;n 
de modo de la capa controla c&oacute;mo se mezcla con el resto de capas bajo 
ella. El valor por defecto es NORMAL que simplemente toma la capa y la pone
sobre las capas bajo ella. El modo NORMAL solo permite que se vean las 
capas inferiores a trav&eacute;s de los p&iacute;xels transparentes de la capa 
actual (o aquellos con opacidad inferior a 100%). As&iacute; pues lo que queremos 
hacer es hacer click en la capa superior de la lista para controlar c&oacute;mo
se mezcla esta capa con la de debajo.</P></TD></TR>

<TR><TD><P>Si experimentas y pruebas diferentos modos del men&uacute;, 
ver&aacute;s c&oacute;mo cada modo cambia la operaci&oacute;n utilizada para 
mezclar las capas. No voy a explicar exactamente qu&eacute; hace cada modo, 
ya que ocupar&iacute;a mucho. Aqu&iacute; es donde conocer la teor&iacute;a 
del color te ayudar&aacute;. Estos son ejemplos de algunos modos:

<CENTER><TABLE BORDER=1>
<TR><TD>Addition (suma):<BR><IMG BORDER=0 SRC="./../../common/May1998/OperationAddition.jpg"></TD>
<TD>Darken Only (solo oscuro):<BR><IMG BORDER=0 SRC="./../../common/May1998/OperationDarkenOnly.jpg"></TD>
<TD>Difference (diferencia):<BR><IMG BORDER=0 SRC="./../../common/May1998/OperationDifference.jpg"></TD>
</TR>
<TR>
<TD>Lighten Only (solo luminoso):<BR><IMG BORDER=0 SRC="./../../common/May1998/OperationLightenOnly.jpg"></TD>
<TD>Multiply (multiplicaci&oacute;n):<BR><IMG BORDER=0 SRC="./../../common/May1998/OperationMultiply.jpg"></TD>
<TD>Subtract (substracci&oacute;n):<BR><IMG BORDER=0 SRC="./../../common/May1998/OperationSubtract.jpg"></TD>
</TR>
</TABLE></CENTER>

<P>Algunos de estos resultados pueden parecer el mismo, pero si los miras con
atenci&oacute;n ver&aacute;s que son todos diferentes. En al art&iacute;culo de
Manuel menciona la operaci&oacute;n Soft Light (luz suave) de Photoshop. La
operaci&oacute;n Lighten Only (solo luminoso) de GIMP es muy similar a esta. Si 
usas el modo Lighten Only obtendr&aacute;s un resultado similar al logo de Linux
Focus en blanco y negro difuminado del art&iacute;culo de Manuel.</P></TD></TR>

<TR><TD><P>
<IMG ALIGN=RIGHT BORDER=0 SRC="./../../common/May1998/DuplicateLayer.jpg">
Podemos a a&ntilde;adir el colorido amarillento con unos pocos pasos m&aacute;s.
Vamos a la caja de di&aacute;logo de Capas y Canales, activamos la capa que 
tiene el texto negro y el fondo blanco. Pulsamos con el bot&oacute;n derecho
en el t&iacute;tulo para obtener el men&uacute; y elegimos Duplicate Layer 
(duplicar capa) y creamos un duplicado. Activamos este duplicado y usamos la
opci&oacute;n Raise Layer (elevar capa) del men&uacute; para moverla a la 
primera posici&oacute;n de la lista.</P></TD></TR>

<TR><TD><P>Ahora que tenemos una capa para a&ntilde;adirle color, volvemos
a la caja de la imagen y seleccionamos Select->By Color para obtener la caja
de di&aacute;logo de selecci&oacute;n por color. Seleccionamos el modo 
Replace (sustituci&oacute;n) y movemos la barra de desplazamiento de Fuzziness
Threshold (umbral de difuminado) a 175.0 aproximadamente. Ahora hacemos 
click en la caja en una de las letras. Tu caja deber&iacute;a estar 
completamente negra, pero al pulsar dentro de ellas las letras 
aparecer&aacute;n. Puedes entonces hacer click en una de las letras, 
con lo que seleccionar&aacute;s todos los p&iacute;xels de la pantalla 
que sean del mismo color que el p&iacute;xel que has seleccionado.
Realmente, como hemos incrementado el umbral de difuminado, los p&iacute;xels
que sean de un color parecido tambi&eacute;n ser&aacute;n seleccionados.
De esta manera, podemos seleccionar todas las letras.
<TABLE><TR><TD VALIGN=CENTER><IMG BORDER=0 SRC="./../../common/May1998/SelectBy-1.jpg"></TD>
<TD><IMG BORDER=0 SRC="./../../common/May1998/SelectBy-2.jpg"></TD></TR></TABLE>

</P></TD></TR>

<TR><TD><P><IMG ALIGN=RIGHT BORDER=0 SRC="./../../common/May1998/AddYellow.jpg">
Tenemos una regi&oacute;n de la capa seleccionada, por lo que ahora podemos
a&ntilde;adir el color. Vamos a la caja de herramientas y usamos la paleta 
para elegir un color amarillento. Cogemos el pote de pintura de la caja
de herramientas, vamos a la caja de la imagen y pulsamos en cualquier lugar
dentro. La regi&oacute;n seleccionada, que deber&iacute;an ser solo las 
letras del texto, se debe pintar de amarillo. Si no es as&iacute;, es que 
has hecho algo mal, como no tener activada la capa correcta en la caja de 
Capas y Canales. Comprueba que la capa activada es la superior... igual
no la has puesto bien!!</P></TD></TR>

<TR><TD><P>Cuando tenemos esta capa con las letras coloreadas de amarillo,
<IMG ALIGN=RIGHT BORDER=0 SRC="./../../common/May1998/YellowishGimp.jpg">
volvemos a la caja de Capas y Canales y elegimos el modo MULTIPLY (multiplicar)
para la capa del texto amarillo. Si todas las capas son visibles, la caja de la 
imagen deber&iacute;a mostrar nuestro texto con un coloreado amarillento en 
el centro con un borde suavemente oscurecido. Podemos ir a la caja de Capas y 
Canales, desplegar el men&uacute; de cualquier capa y elegir Merge 
Visible Layers (mezclar capas visibles) . Esto combinar&aacute; todas las capas
en una capa y pondr&aacute; el modo de esta nueva capa a NORMAL. Si quieres
deshacerte del fondo blanco y hacerlo transparente, usa la caja de di&aacute;logo
de selecci&oacute;n por color para seleccionar el texto de nuevo, invierte
la selecci&oacute;n y selecciona Edit->Clear para borrar la regi&oacute;n 
seleccionada. Esto te dejar&aacute; con el texto en un fondo 
transparente.</P></TD></TR>

<TR><TD><P>Para un efecto realmente bonito, en lugar de usar una capa superior
con un color s&oacute;lido, es mejor usar una textura. As&iacute; es como
hice la m&iacute;a. He estado usando tres capas en mi demostraci&oacute;n de 
m&aacute;s arriba. La de abajo ten&iacute;a un fondo blanco con el texto negro.
La de en medio ten&iacutea un fondo negro con un texto blanco, y estaba 
ligeramente desenfocada. La de arriba ten&iacute;a el fondo blanco y el
texto amarillo. Activ&eacute; la capa superior y la dupliqu&eacute;. Eleg&iacute;
el duplicado superior y seleccion&eacute; Filters->Render->Plasma del men&uacute;
de la caja de la imagen y us&eacute; una semilla (seed) de 5 y una turbulencia 
de 2.
<IMG ALIGN=RIGHT BORDER=0 SRC="./../../common/May1998/YellowTexture.jpg">
Esto traz&oacute; una textura en la capa superior. Activ&eacute; la capa con 
el fondo blanco y el texto amarillo, seleccion&eacute; la caja de la imagen 
entera y us&eacute; el pote de pintura para poner la capa entera a un color 
s&oacute;lido. Eleg&iacute; entonces Filters->Map->BumpMap del men&uacute; 
de la caja de la imagen para abrir la caja de di&aacute;logo de Bump Map. 
Eleg&iacute; la capa con el plasma dibujado como bump map y jugu&eacute; con 
las otras opciones hasta que obtuve una capa con textura bonita, y puls&eacute;
OK. Esto cambi&oacute; mi capa de amarillo s&oacute;lido a una capa de amarillo
con textura. Fui a la caja de Capas y Canales, puls&eacute; con el bot&oacute;n 
derecho en el t&iacute;tulo de la capa de plasma y eleg&iacute; borrar para
eliminar esta capa... no la necesitaba m&aacute;s.
<IMG ALIGN=RIGHT BORDER=0 SRC="./../../common/May1998/Textured.jpg">
Entonces puls&eacute; con el bot&oacute;n derecho en la capa de la textura 
amarilla y eleg&iacute; Add Layer Mask (a&ntilde;adir m&aacute;scara de capa).
En las opciones de a&ntilde;adir m&aacute;scara dej&eacute; las opciones 
por defecto en Blanco (opacidad completa). Activ&eacute; entonces la capa
con el fondo negro y el texto blanco. Eleg&iacute; Edit->Copy del men&uacute;
de la imagen, activ&eacute; la capa de la textura amarilla can la m&aacute;scara
y eleg&iacute; Edit->Paste en el men&uacute; de la imagen. Eleg&iacute; 
Layers->Anchor Layer del men&uacute; de la imagen para poner la capa pegada
bajo la capa con la m&aacute;scara. Me asegur&eacute; que la capa con la textura
amarilla estaba activada y seleccion&eacute; Apply Layer Mask de la caja de 
Capas y Canales para aplicar la capa, que ocult&oacute; todo menos el texto
con textura. Todo lo que qued&oacute; por hacer fue elegir Merge Visible Layers
de la caja de Capas y Canales. Todo esto parece mucho trabajo, &iexcl;pero es muy 
sencillo si lo practicas!</P></TD></TR>

<TR><TD><P>Podemos usar unas pocas herramientas de GIMP para crear el mismo
efecto luminoso que Manuel hizo usando un procedimiento casi id&eacute;ntico.
Usamos la selecci&oacute;n por color con un alto umbral para seleccionar todo
el fondo (incluso dentro de letras como P y O), y usamos Select->Shrink 
(contracci&oacute;n) para llevar la regi&oacute;n seleccionada lejos del 
borde del texto. Us&eacute; un valor de contracci&oacuten de solo 2 porque no
quer&iacute;a que se separase mucho. Usamos entonces Select->Feather (aligerar)
para difuminar la selecci&oacute;n (us&eacute; un valor de feather de 5). 
Elegimos un color rojizo de la paleta y el pote de pintura de la caja de
herramientas. Pulsamos dentro de la imagen y la regi&oacute;n seleccionada se
pintar&aacute; con este color rojo. Ahora queremos reducir la regi&oacute;n
seleccionada y aligerarla de nuevo. Usamos los mismo valores de shrink y feather
que antes. Los valores posiblemente tienen que ser diferentes, dependiendo 
del grosor de tu fuente de texto y tus preferencias personales. Puede ser bueno
poner un valor de niveles de Deshacer alto, para que puedas probar todos estos
pasos, juzgar el resultado y, si no te gusta, puedes usar el comando Deshacer
hasta el principio. El n&uacute;mero de niveles de Deshacer se puede cambiar en
File->Preferences, en la pesta&ntilde;a de Interface.</P>

<P><IMG ALIGN=RIGHT BORDER=0 SRC="./../../common/May1998/Illuminated.jpg">
Finalmente, usamos Edit->Clear para eliminar todo el exceso de rojo en el fondo.
Esto te dejar&aacute; con un halo iluminado ligeramente alrededor del texto...
paro hay un paso m&aacute;s. Desgraciadamente, como puedes ver en la imagen, 
cuando comprim&iacute;amos, la regi&oacute;n seleccionada se alejaba del
borde de la imagen, por lo que tenemos que borrar el exceso de rojo alrededor
del borde de la imagen. &iexcl;&iexcl;Afortunadamente, has aprendido 
bastante por ahora para ser capaz de hacerlo tu solito!!

</TABLE></CENTER>



          </TD> 
        </TR> 
	 </TABLE> 
 
     <HR size=2 noshade> 
<p align="right">Traducido por <A href="mailto:lastras@writeme.com"><FONT color="#000000">Hugo Lastras Membrive</font></A></I> </P>
    </TD> 
 
 </TR> 
 
 </TBODY> 
 
<TBODY> 
  <TR> 
    <TD colspan="2"> 
    <B>Para m&aacute;s informaci&oacute;n</B>:<BR> 
    <UL> 
    <LI>Otros art&iacute;culos de la serie:
       <A HREF="../March1998/article34.html">
            Fotocomposici&oacute;n Gr&aacute;fica con GIMP</A>
    <UL><BR><BR> 
    <TD> 
  </TR> 
</TBODY> 
 
 <TR bgcolor="#660033"> 
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B> 
         &copy; 1998 Phil Ross</B></FONT><BR> 
    <FONT color="#ffffff">Páginas web mantenidas por
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>. 
   </TD> 
 </TR> 
 
 
 
</TABLE> 
 
 
</BODY> 
</HTML> 
 
 
 
 
 
 
