<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"> 
<HTML lang="es"> 
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1"> 
 <TITLE> GLUT: Utilizando Men&uacute;s </TITLE> 
 <META name="Author" CONTENT="Miguel Angel Sepulveda "> 
 <META name="Keywords" CONTENT="GLUT menu GUI "> 
 <META name="Description" CONTENT="GLUT tutorial "> 
 <META name="Copyright" CONTENT="&copy; 1998 LinuxFocus"> 
 <META name="Translator" CONTENT="Jose M. Laveda Molina"> 
 <META name="Date" CONTENT="1998-02-91T00:00:00Z"> 
 
</HEAD> 
 
<BODY bgcolor="#FFFFFF" text="#000000" link="#ff0033" vlink="#FF3333"> 
 
  <MAP name="navegator"> 
 <AREA shape="rect" coords="0, 0, 65, 28" alt="Ir al Hogar" href="../">
      <AREA shape="rect" coords="66, 0, 124, 28" alt="Ver &Iacute;ndice" href="../indice.html">
      <AREA shape="rect" coords="125, 0, 193, 28" alt="Buscar" href="../search.html">
      <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
      <AREA shape="rect" coords="261, 0, 350, 28" alt="Acerca de nosotros" href="../aboutus.html">
  </MAP> 
 
 
 
 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0"> 
 
 <THEAD> 
   <TR align="center"> 
      <TD colspan="2"><IMG src="../../common/May1998/border-short.jpg" alt="[LinuxFocus Image]" width="407" height="88"></TD> 
   </TR> 
 
   <TR align="center"> 
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/May1998/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28" alt="[Navegation Bar]"></TD> 
   </TR> 
 
   <TR align="center"> 
     <TD colspan="2">      
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5"> 
		<TR bgcolor="#000000"> 
		   <TD align="center"> 
 		  <A href="../News/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Noticias</B></FONT></A>
		  <A href="../Archives/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Archivos</B></FONT></A>
		  <A href="../Companies/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Compa&ntilde;&iacute;as</B></FONT></A>
		  <A href="../Tips/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Consejos&nbsp</B></FONT></A> 
               </TD> 
            </TR> 
             
		<TR> 
            <!--   Here goes the Title of the article, authors name and abstract --> 
		   <TD align="center"> 
 			<FONT face="Helvetica,Arial" color="#660066"><H1>GLUT: Utilizando Men&uacute;s</H1></FONT> 
 			<FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#000000">Miguel Angel Sep&uacute;veda</FONT></A></H3></FONT> 
                  <HR size="2" noshade> 
	         </TD> 
            </TR> 
 
           </TABLE> 
 
     </TD> 
   </TR> 
 
 </THEAD> 
 
 
 
 <TBODY> 
   
 <TR> 
    <TD valign="top" align="center"> 

    </TD> 
    
    <TD align="center"> 
       <TABLE border="0" width="80%" cellspacing="0" cellpadding="0"> 
	  <TR> 
          <TD> 

	 <P> Este art&iacute;culo es el tercero de la serie dedicada a
	 la  <I>   GL Utility  Toolkit    (GLUT)</I> escrito por  Mark
	 Kilgard.  GLUT   es  una  herramienta   muy &uacute;til  para
	 desarrolladores con OpenGL porque abstrae en un API simple de
	 aprender  y utilizar la parte  dependiente de la arquitectura
	 de la aplicaci&oacute;n OpenGL.</P>

         <P> Como se ha mencionado en art&iacute;culos anteriores, las
         razones por razones de  desarrollo OpenGL s&oacute;lo incluye
         directivas para la parte  independiente de la arquitectura de
         un  API 3D avanzado. Abrir  ventanas, manejo de la entrada de
         teclado, etc..  son muy    dependientes de la   plataforma  y
         est&aacute;  fuera    del alcance de  OpenGL.    GLUT   es la
         respuesta a   este    problema:  GLUT  ofrece   un   interfaz
         com&uacute;n para m&uacute;ltiples plataformas para el manejo
         de  cosas  como  ventanas,  buffers, renderizaci&oacute;n  de
         texto, entrada por el teclado y men&uacute;s. <P>

         <P>Hoy  exploraremos  el uso  de  menus  dentro  de  nuestras
         aplicaciones OpenGL. Un  men&uacute; es  una forma m&aacute;s
         de comunicaci&oacute;n  con el    usuario  por parte  de   la
         aplicaci&oacute;n.   En  nuestro  art&iacute;culo  previo (<A
         HREF="../March1998/article29.html">Manejo
         de  Ventanas</A>)  demostramos   otra  t&eacute;cnica para la
         entrada del usuario, teclas r&aacute;pidas.  GLUT captura los
         eventos  de entrada de  teclado tan bien  como los eventos de
         rat&oacute;n     y    nos    deja      introducir   funciones
         (<i>callbacks</i>)  para    manejar   estos  incidentes.   La
         desventaja  de   las  "teclas   r&aacute;pidas"  es  que  son
         invisibles, requieren que el usuario lea un manual o recuerde
         que tecla hace tal cosa. Los men&uacute;s, por otra parte son
         mucho   m&aacute;s flexibles porque   son gr&aacute;ficos   y
         muestran   las     opciones    de     usuario     disponibles
         actualmente. </P>

	 <P>Como ejemplo he aqu&iacute;  el c&oacute;digo fuente de un
	 programa                       ejemplo                    (<A
	 HREF="../../common/May1998/example1.tar.gz">../../common/May1998/example1.tar.gz</A>).  Este   programa
	 es una  modificaci&oacute;n  del   programa mostrado   en  el
	 art&iacute;culo                    anterior                <A
	 HREF="../March1998/article29.html">Manejo
	 de Ventanas</A>. Obtenga  el programa  y compilelo utilizando
	 el Makefile suministrado. </P>


         <A HREF="../../common/May1998/glut3.jpg"><IMG SRC="../../common/May1998/glut5.jpg" WIDTH="305" HEIGHT="313" BORDER="1" ALIGN="left" HSPACE="10"></A>

         <P>  La compilaci&oacute;n requiere la librer&iacute;a OpenGL
         (Mesa,   por    ejemplo)  y   la   biblioteca    GLUT.  Ambas
         librer&iacute;as    son  f&aacute;cilmente obtenibles       y
         est&aacute;n  incluidas de   una  forma   u otra en    muchas
         distribuciones    de  Linux.    Tras  la   compilaci&oacute;n
         obtenemos     el    fichero       ejecutable,    <tt>example1
         </tt>. Ejec&uacute;telo  y podr&aacute; ver una nueva ventana
         con  un tri&aacute;ngulo en   color de  v&eacute;rtices rojo,
         verde y azul (ver figura de la izquierda).</P>

         <P>El &aacute;rea   contiene una ventana principal  con fondo
         negro y  un tri&aacute;ngulo en el  centro  y una sub-ventana
         con fondo gris con texto  escrito en ella. Nuestro ejemplo es
         realmente una animaci&oacute;n en  tiempo real por lo  que el
         campo   de  tiempo   en       la  sub-ventana     debe    ser
         incrementado. </p>

	 <P>Mueva    el rat&oacute;n  al &aacute;rea    de  la ventana
	 principal, mantenga   pulsado el bot&oacute;n  izquierdo  del
	 rat&oacute;n.  Este evento es manejado  por nuestro ejemplo y
	 debe abrir el siguiente men&uacute;: </P>

         <IMG SRC="../../common/May1998/glut1.jpg" WIDTH="124" HEIGHT="68" BORDER="0" ALIGN="left" HSPACE="10">

         <P>El  men&uacute; contiene  tres opciones (rotar, trasladar,
         cambiar      color)  y     una final      para  terminar   la
         aplicaci&oacute;n. Mientras mantenga pulsado el  bot&oacute;n
         izquierdo    del   rat&oacute;n,  mu&eacute;vase      a  cada
         opci&oacute;n y pruebe lo que ocurre. </P>

	 <P>Seleccionando    "Rotation   On"      el  tri&aacute;ngulo
	 rotar&aacute;   alrededor   de  su centro  de    gravedad, la
	 opci&oacute;n        "Translation     On"   mover&aacute;  el
	 tri&aacute;ngulo horizontalmente    a  trav&eacute;s de    la
	 ventana y lo  ocultar&aacute; cuando el  final  de la ventana
	 sea alcanzado. La opci&oacute;n "Change Color" lanzar&aacute;
	 un sub-men&uacute; nuevo con estas nuevas opciones: </P>


          <IMG SRC="../../common/May1998/glut2.jpg" WIDTH="50" HEIGHT="68" BORDER="0" ALIGN="left" HSPACE="10">
          <UL>
	  <LI><B>Red</B> Representa el tri&aacute;ngulo en rojo</LI> 
	  <LI><B>Blue</B> Representa el tri&aacute;ngulo en azul</LI> 
	  <LI><B>Green</B> Representa el tri&aacute;ngulo en verde</LI> 
	  <LI><B>RGB</B> Representa el tri&aacute;ngulo en rojo, verde y azul</LI> 
          </UL>


          <P>Este es un ejemplo muy  simple del uso de men&uacute;s en
          una  aplicaci&oacute;n OpenGL. La apariencia de men&uacute;s
          y  sub-men&uacute;s es    dependiente de  la  plataforma. El
          aspecto  mostrado aqu&iacute; es   el  del GLUT para  Linux,
          compilado y ejecutado  bajo Windows  95/NT tendr&aacute; una
          apariencia diferente.    Lo  que   importa    es que    esta
          funcionalidad es   portable  si  utiliza la  librer&iacute;a
          GLUT. </P>

          <P>Note  que   el men&uacute;    principal tiene  dos  tipos
          diferentes  de   entradas.   El primer   tipo  (Rotation On,
          Translation On)     cambia    cuando  la   acci&oacute;n  es
          ejecutada.     Esto   significa  que    tras      lanzar  el
          tri&aacute;ngulo   en  modo     de  rotaci&oacute;n,      la
          pr&oacute;xima   vez  que   vea    el men&uacute;  principal
          aparecer&aacute; "Rotation  Off".  La otra clase  de entrada
          en el men&uacute; permanece  siempre constante, como "Change
          Color", "Red", "Blue" y "Green".</p>

	  <P>Existen   unas   algunas   cosas   interesantes   que  me
	  gustar&iacute;a   advertir antes  de  continuar describiendo
	  como programar  estos men&uacute;s. ¿Recuerda que  esta demo
	  tiene      dos       teclas       r&aacute;pidas?        (<A
	  HREF="../March1998/article29.html">Manejo
	  de Ventanas</A>).   Estas  teclas son "q"  para  salir y "i"
	  para activar  o  desactivar la informaci&oacute;n.   Intente
	  utilizarlas de nuevo, todav&iacute;a funcionan. </p>

		  
	  <P>Mientras    que   el  mensaje  con     informaci&oacute;n
	  est&aacute;  activado (sub-ventana),   mueva  el  cursor   a
	  cualquier  lugar dentro de  la regi&oacute;n gris y pulse el
	  bot&oacute;n    izquierdo     del  rat&oacute;n.  ¡Sorpresa!
	  Ver&aacute; este otro men&uacute;:</P>

	  <CENTER>
          <IMG SRC="../../common/May1998/glut4.jpg" WIDTH="160" HEIGHT="20" BORDER="0" ALIGN="center">
          </CENTER>

           <P>Esto demuestra  que los  men&uacute;s no s&oacute;lo son
           relacionados   con   eventos  (bot&oacute;n izquierdo   del
           men&uacute;) sino  que   son utilizados de  acuerdo con  el
           actual contexto OpenGL.  Tambi&eacute;n hemos mencionado en
           nuestro  pasado  art&iacute;culo  que una sub-ventana  GLUT
           incorpora su propio  contexto  OpenGL,  aqu&iacute; podemos
           ver otra consecuencia de este  hecho.  Dos men&uacute;s han
           sido relacionados con  el  mismo evento pero  en diferentes
           contextos.  El desarrollador  tiene una herramienta potente
           para escribir  un interfaz de  usuario sofisticado  para su
           aplicaciones. </P>

          <P>Todav&iacute;a m&aacute;s  interesante es el hecho que si
          desactiva el mensaje  informativo utilizando la  tecla "i" y
          mueve  el  cursor   ala   parte superior    del &aacute;rea,
          ser&aacute; incapaz de volver a la entrada  "This is a dummy
          entry".  ¿Porque?,  porque  cuando oculta  la sub-ventana el
          contexto  general (incluyendo los men&uacute;s incorporados)
          con ocultados tambi&eacute;n.</P>



          <P>A continuaci&oacute;n vamos  a  empezar  a  describir  el
          contenido del  programa. Asumo   que el   lector est&aacute;
          familiarizado con el  material GLUT  y OpenGL presentado  en
          los      art&iacute;culos        previos.    El  &aacute;rea
          <tt>main()</tt> contiene diferentes secciones, <em>¡el orden
          es importante!</em>:</P>

          <UL>
	  <LI><B>Inicializaci&oacute;n de GLUT</B>. Abre una ventana, pasa argumentos de la l&iacute;nea de comandos, fija el modo de visualizaci&oacute;n y opciones.</LI>
	  <LI><B>Creaci&oacute;n de la Ventana Principal</B>. Crea la ventana principal, fija las funciones (<i>callbacks</i>) principales asociadas con la ventana, define la funci&oacute;n <tt>idle</tt> </LI>
	  <LI><B>Crear un Sub-menu</B>. Este sub-men&uacute; maneja la opci&oacute;n "Change Color", y ser&aacute; incluida dentro del men&uacute; principal posteriormente.</LI>
          <LI><B>Crear Men&uacute; Principal</B>. Construye el men&uacute; principal, a&ntilde;ade los &iacute;tems y el sub-men&uacute; previamente definido, finalmente asocia este men&uacute; al bot&oacute;n izquierdo del rat&oacute;n. N&oacute;tese que todav&iacute;a estamos en el contexto de la ventana principal.</LI>
          <LI><B>Crear lista de "llamadas GL" </B>. Este es un punto avanzado de OpenGL que no trataremos aqu&iacute; exhaustivamente. Es suficiente con saber que una lista de llamandas es una forma de construir y encapsular objetos OpenGL en tiempo de ejecuci&oacute;n para su posterior invocaci&oacute;n. Invocando un elemento "GL call list", en oposici&oacute;n a construir el objeto una y otra vez es mucho m&aacute;s eficiente para invocaciones posteriores. En esta demo hay cuatro elementos de este tipo: un tri&aacute;ngulo rojo, uno azul, uno verde y uno RGB.</LI>
          <LI><B>Creaci&oacute;n de una sub-ventana </B>. Crea una sub-ventana, salva un manejador, asocia las correspondientes funciones. Despu&eacute;s que la sub-ventana es creada un nuevo contexto se activa.</LI>
          <LI><B>Creaci&oacute;n del Men&uacute; Principal para la sub-ventana</B>. Exactamente como hicimos anteriormente, creamos un nuevo men&uacute;, a&ntilde;adimos entradas y lo asociamos al bot&oacute;n izquierdo del men&uacute;. Ahora, el men&uacute; estar&aacute; asociado al contexto de la sub-ventana.</LI>
          </UL>


          <P>Excepto  para la  creaci&oacute;n del men&uacute;,  todas
          las  otras secciones deben  ser  familiares al lector.   Una
          r&aacute;pida  inspecci&oacute;n del c&oacute;digo para   la
          creaci&oacute;n de men&uacute;s  revela cuan simple  es. Los
          men&uacute;s    son  creados    por la    directiva  <tt>int
          glutCreateMenu( void (f*)(int)   ) </tt>, la  funci&oacute;n
          <tt>f</tt>  es   de   tipo   <i>callback</i>  que  toma   el
          n&uacute;mero  devuelto por la opci&oacute;n del men&uacute;
          escogida y  realiza  la acci&oacute;n pertinente.   El valor
          devuelto por la funci&oacute;n <tt>glutCreateMenu</tt> es un
          identificador entero para la nueva ventana creada.</P>

          <P>Las funciones  utilizadas  para   manejo de  eventos   de
          men&uacute;      son    muy  simples.    Examine    <tt>void
          mainMenu(int)</tt>                 o                <tt>void
          subMenu(int)</tt>. B&aacute;sicamente utilizan una sentencia
          <tt>switch</tt>  que procesa el  &iacute;tem del men&uacute;
          escogido. </P>

          <P>Tras crear  el  men&uacute; nuestro  c&oacute;digo  a&ntilde;ade
          entradas a &eacute;ste utilizando la funci&oacute;n <tt>void
          glutAddMenuEntry(char  *s,  int nr)</tt>,  donde  "s" es  el
          texto a escribir en el campo de la entrada en el men&uacute;
          y "nr" es el  identificador  de la funci&oacute;n  a  llamar
          cuando  este   &iacute;tem  sea  escogido.  Obviamente evite
          utilizar identificadores iguales para entradas diferentes en
          el mismo men&uacute;.</P>

         <P>Los Sub-menus son a&ntilde;adidos de una forma similar utilizando
         la    funci&oacute;n  <tt>void glutAddSubMenu(char   *s,  int
         nr)</tt>.

         <P>Finalmente, tras completar  el men&uacute;, es  asociado a
         un   evento    de   entrada    (bot&oacute;n   izquierdo  del
         rat&oacute;n)             con       la         funci&oacute;n
         <tt>glutAttachMenu</tt>.  Esta  funci&oacute;n tambi&eacute;n
         puede     tomar     los       valores      GLUT_RIGHT_BUTTON,
         GLUT_MIDDLE_BUTTON.</P>


	 <P>Las entradas en los  men&uacute;s pueden ser cambiadas  en
	 cualquier    momento    gracias     al    comando    <tt>void
	 glutChangeToMenuEntry(int  entry,  char *s,  int value)</tt>,
	 que cambia la entrada en el men&uacute; "entry" de la ventana
	 actual  por otra que tiene la  etiqueta <tt>s</tt> y devuelve
	 <tt>value</tt>   a la funci&oacute;n   la  invoca. En nuestro
	 ejemplo hemos utilizado

<PRE>
   glutChangeToMenuEntry(2, "Translation On", 2);
</PRE>

        para cambiar    la entrada n&uacute;mero   2  del  men&uacute;
        principal, y as&iacute; para los otros casos.</P>
         

         <P>GLUT   permite    m&aacute;s  posibilidades:   cambiar una
         opci&oacute;n de men&uacute; por un  sub-menu de tipo cascada
         y viceversa, destruir  men&uacute;s, eliminar opciones de  un
         men&uacute;, y m&aacute;s.  No las exploraremos porque pienso
         que el ejemplo expuesto es suficientemente simple y funcional
         para satisfacer  las    necesidades de  muchos usuarios.   Si
         necesita capacidades   extra por  favor  consulte   el manual
         m&aacute;s reciente sobre GLUT.</P>

          </TD> 
        </TR> 
	 </TABLE> 
 
     <HR size=2 noshade> 
	    <P align="right"><i>Traducido por <A href="mailto:jmlm@ctv.es"><FONT color="#000000">Jose M. Laveda Molina</font></A></I> 
 </I></p>
 
    </TD> 
 
 </TR> 
 
 </TBODY> 
 
<TBODY> 
  <TR> 
    <TD colspan="2"> 
    <B>Para m&aacute;s informaci&oacute;n</B>:<BR> 
    <UL> 
      <LI>Lea otros art&iacute;culos de esta serie: <A HREF="../January1998/article16.html">Ventanas y Animaciones</A>, <A HREF="http://www.linuxfocus.org/English/March1998/article29.html">Manejo de Ventanas</A>. </LI> 
      <LI>Consulte el manual incluido con los fuentes.</LI>  
     <UL><BR><BR> 
    <TD> 
  </TR> 
</TBODY> 
 
 <TR bgcolor="#660033"> 
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B> 
         &copy; 1998 Miguel Angel Sep&uacute;veda</B></FONT><BR> 
    <FONT color="#ffffff">P&aacute;ginas web mantenidas por
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sep&uacute;veda</FONT></A></FONT>. 
   </TD> 
 </TR> 
 
 
 
</TABLE> 
 
 
</BODY> 
</HTML> 
 
 
 
 
 
 
