<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.34">
 <META NAME="LFCATEGORY" CONTENT="KernelCorner">
 <link rel="icon" href="../../common/images/lf-16.png" type="image/png">
 <TITLE>lf252, KernelCorner: Compila tu propio n&uacute;cleo de Linux</TITLE>
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-family:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; 
           border-style:none; border-width:medium; border-color:#FFD700; 
           padding:0.5cm;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; 
          border-style:none; border-width:medium; border-color:#aedbe8; 
          padding:0.1cm;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; 
          border-width:medium; border-color:#AAAAAA; padding:0.5cm ; 
          margin-top:0.1cm; margin-right:1cm; margin-left:1cm; 
          text-align:center }
 .mark  { background-color:#e6e6ff }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- this is used by a number of tools:
 =LF=AUTHOR: Philip de Groot
 =LF=CAT___: KernelCorner
 =LF=TITLE_: Compila tu propio n&uacute;cleo de Linux
 =LF=NUMBER: 252
 =LF=ANAME_: article252.html
 -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE summary="topbar_1" cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE summary="topbar_1_logo" cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="319"><IMG src="../../common/images/logolftop_319x45.gif"
           alt="[LinuxFocus-icon]" width="319" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE summary="topbar_1_links" width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="2">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="2">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="2">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="2">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE summary="topbar_2" cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE summary="topbar_3" cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE summary="topbar_3_links" cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="190" summary="about the author">
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4 summary="pda download"> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<img src="../../common/images/PhilipGroot.jpg" alt=
    "[Photo of the Author]" height="102" width="79">
<BR>por  Philip de Groot <br> <small>&lt;philipg(at)authors.linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<!-- aboutauthor_start -->
<p>Espero recibir mi doctorado de la <a href=
    "http://www.kun.nl">Universiteit van Nijmegen</a> durante este
    a&ntilde;o. Mi tesis es sobre lo que llamamos <a href=
    "http://www.sci.kun.nl/cac/index.html">chemometrics</a>. Actualmente
    trabajo en tecnolog&iacute;a inform&aacute;tica aplicada a la biolog&iacute;a, en
    el Centro M&eacute;dico Acad&eacute;mico en Amsterdam, Holanda. Adem&aacute;s
    mantengo mi propia <a href=
    "http://linux.loostad.com">p&aacute;gina para novatos de Linux (en
    holand&eacute;s)</a>: es una de las muchas iniciativas de y para la
    comunidad linnuxera. Me encanta trabajar con Linux y habitualmente
    escribo mis experiencias.</p>
<!-- aboutauthor_stop -->
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Javier G&oacute;mez Sierras <small>&lt;jgomsi(at)obelix.umh.es&gt;</small>
<br>
<!--
 =LF=TRANSTO=es: Javier G&oacute;mez Sierras
-->
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#252lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#252lfindex1">Instalando el c&oacute;digo fuente del n&uacute;cleo</A></LI>
  <LI><A HREF="#252lfindex2">Configurando el n&uacute;cleo</A></LI>
  <LI><A HREF="#252lfindex3">Compilando el n&uacute;cleo</A></LI>
  <LI><A HREF="#252lfindex4">Configurando lilo</A></LI>
  <LI><A HREF="#252lfindex5">Usando loadlin</A></LI>
  <LI><A HREF="#252lfindex6">SuSE y los drivers de sonido de ALSA</A></LI>
  <LI><A HREF="#252lfindex7">Soporte para pcmcia (port&aacute;tiles)</A></LI>
  <LI><A HREF="#252lfindex8">Instalando 'modutils'</A></LI>
  <LI><A HREF="#252lfindex9">&iquest;Funciona el n&uacute;cleo correctamente?</A></LI>
  <LI><A HREF="#252lfindex10">Conclusi&oacute;n</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=252">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<table border="0"><tr><td>
<H2>Compila tu propio n&uacute;cleo de Linux</H2>
 <img src="../../common/images/illustration209.gif" hspace="30"
    width="241" height="249" alt="[illustratie]">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<!-- articleabstract_start -->
<p>Dentro de poco averiguar&aacute;s que t&uacute; tambi&eacute;n puedes obtener, configurar,
    compilar, e instalar tu propio n&uacute;cleo.</p>
<!-- articleabstract_stop -->

<br><!-- HR divider --><center><font color="#8282e0"><b>_________________ _________________ _________________</b></font></center><br>
</td></tr></table>
<!-- BODY OF THE ARTICLE -->


    <A NAME="252lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

    &iquest;Y por qu&eacute; vas a querer compilar e instalar un nuevo n&uacute;cleo t&uacute; solito?
    Algunas posibles razones son:

    <ul>
      <li>El nuevo n&uacute;cleo tiene un mejor soporte de hardware.</li>

      <li>El nuevo n&uacute;cleo ofrece ciertas ventajas, como un mejor
      soporte para m&aacute;quinas con m&uacute;ltiples procesadores (SMP) o soporte
      para USB. Esto se aplica a los n&uacute;cleos 2.4.x.</li>

      <li>El nuevo n&uacute;cleo carece de antiguos fallos (bugs).</li>

      <li>Tu propio n&uacute;cleo carece de elementos sup&eacute;rfluos y es
      por lo tanto m&aacute;s r&aacute;pido y estable.</li>
    </ul>
    Es un problema que compilar tu propio n&uacute;cleo
    requiera un elevado conocimiento inform&aacute;tico. Por lo tanto un nuevo
    usuario de Linux no intentar&aacute; compilar el n&uacute;cleo a la ligera.
    Este art&iacute;culo muestra capturas de pantalla del m&eacute;todo para
    compilar el n&uacute;cleo usando el comando 'make xconfig'. Con este
    comando interactua con el n&uacute;cleo a trav&eacute;s de un GUI, una
    Interfaz Gr&aacute;fica de Usuario, y el rat&oacute;n. Hay alrededor de 40
    capturas de pantalla, que clarifican por qu&eacute; o por qu&eacute; no debes
    escoger ciertas opciones en situaciones particulares. Hablar de
    estas 40 capturas puede parecer excesivo, pero es la mejor manera
    de clarificar el funcionamiento interno del n&uacute;cleo y el c&oacute;mo y por
    qu&eacute; de ciertas opciones del n&uacute;cleo. Las capturas de pantalla est&aacute;n
    basadas en el n&uacute;cleo 2.4.6. El n&uacute;cleo m&aacute;s reciente es actualmente
    el 2.4.19, pero a parte de algunas opciones extras en los men&uacute;s
    (p. ej., soporte para nuevo hardware) las capturas son las mismas
    y el proceso de compilar el n&uacute;cleo tambi&eacute;n. Un consejo: imprime
    esta p&aacute;gina antes de empezar, &iexcl;para que as&iacute; siempre tengas acceso a
    la informaci&oacute;n necesaria!

    <p>El art&iacute;culo est&aacute; estructurado como sigue. Primero habla de
    d&oacute;nde puedes encontras el c&oacute;digo fuente en Internet, y c&oacute;mo
    instalar el c&oacute;digo fuente, seguido de la configuraci&oacute;n gr&aacute;fica
    usando las capturas de pantalla. Una vez que el n&uacute;cleo est&aacute;
    configurado debe ser compilado, pero incluso un n&uacute;cleo recien
    compilado no est&aacute; todav&iacute;a listo para usar. Primero, el nuevo
    n&uacute;cleo debe ser instalado con el gestor de arranque 'lilo', y
    antes de usar 'lilo'  tienes que crear el fichero
    '/etc/lilo.conf'. Tambi&eacute;n puedes copiar el n&uacute;cleo compilado a una
    partici&oacute;n desde la que puedas arrancar Linux con un programa para
    DOS/Windows llamado 'loadlin'. Adem&aacute;s hay un mont&oacute;n de puntos
    espec&iacute;ficos que deben ser tratados, como el soporte para PCMCIA ya
    que es necesario para port&aacute;tiles. Las PCMCIA, unas peque&ntilde;as tarjetas
    para insertar parecidas a una tarjeta de cr&eacute;dito de gran grosor y
    que a menudo se encargan de la conexi&oacute;n a la red, est&aacute;n soportadas
    por el n&uacute;cleo internamente desde los n&uacute;cleos de la serie
    2.4.x. Antiguos n&uacute;cleos pueden soportar tarjetas PCMCIA a trav&eacute;s
    de una compilaci&oacute;n e instalaci&oacute;n distinta. SuSE tiene otro
    problema, el soporte para sonido a trav&eacute;s de los drivers
    ALSA. Estos drivers no son parte del n&uacute;cleo y deben ser compilados
    e instalados por separado, porque los drivers originales
    habitualmente ya no funcionan. Para poner peor las cosas, cambiar
    de una serie del n&uacute;cleo a otra, digamos de la 2.2 a la 2.4, puede
    venir acompa&ntilde;ado de problemas con ciertas utilidades del n&uacute;cleo,
    las llamadas 'modutils'. Estas contienen el c&oacute;digo necesrio para
    cargar un m&oacute;dulo del n&uacute;cleo: La figura 3 explica que es un
    m&oacute;dulo. Algunas veces el nuevo n&uacute;cleo no sabe qu&eacute; hacer con las
    viejas 'modutils', por lo que tienes que compilar e instalar una
    versi&oacute;n m&aacute;s reciente de modutils. Problemas como estos son raros
    pero ocurren, y es necesario mencionarlos con antelaci&oacute;n.</p>

    <p>Pero, si sigues fielmente el prodimiento de este art&iacute;culo
    no hay casi nada que pueda fallar. Se a&ntilde;ade el nuevo n&uacute;cleo
    a 'lilo', o se copia a la partici&oacute;n de 'loadlin'.
    Por lo tanto, en caso de emergencia, todav&iacute;a puedes reiniciar con
    el n&uacute;cleo original. Entonces, trabajando con el n&uacute;cleo original
    puedes intentar solventar el problema con el nuevo n&uacute;cleo. Incluso
    aunque pudieses tener problemas con las nuevas 'modutils' del
    n&uacute;cleo todav&iacute;a ser&iacute;a posible reiniciar con el antiguo n&uacute;cleo y
    entonces arreglar el problema compilando e instal&aacute;ndolas por
    separado: todas las nuevas versiones de 'modutils' son
    compablibles hacia atr&aacute;s con las antiguas versiones del n&uacute;cleo,
    por lo que las nuevas 'modutils' funcionan bien con antiguos n&uacute;cleos.</p>

    <p></p>

    <A NAME="252lfindex1">&nbsp;</A>
<H2>Instalando el c&oacute;digo fuente del n&uacute;cleo</H2>

    Todo lo que vas a hacer ahora requiere privilegios de root, as&iacute;
    que debes comenzar entrado a una sesi&oacute;n como root. Lo primero y
    m&aacute;s importante es instalar el c&oacute;digo fuente del n&uacute;cleo, p. ej.,
    desde el CD de instalaci&oacute;n. En SuSE dicho c&oacute;digo se encuentra en
    la parte 'd' (de 'desarrollo') como el paquete 'lx_kernel'. Es
    recomendable instalar el c&oacute;digo fuente del n&uacute;cleo que viene con tu
    distribuci&oacute;n, porque as&iacute; se instalan automaticamente tambi&eacute;n
    varios de los GUIs. Una vez que has hecho esto el tarball con el
    n&uacute;cleo de Linux m&aacute;s reciente, p. ej., el fichero
    'linux-2.4.6.tar.bz2' se puede descargar de <a href=
    "http://www.kernel.org/pub/linux/kernel/v2.4/">(http://www.kernel.org/pub/linux/kernel/v2.4/)</a>
    y ser instalado. Las modutils correspondientes est&aacute;n en <a href=
    "http://www.kernel.org/pub/linux/utils/kernel/modutils/v2.4/">http://www.kernel.org/pub/linux/utils/kernel/modutils/v2.4/</a>.
    Ten en cuenta que los n&uacute;meros de la versi&oacute;n de 'modutils' no
    tienen que coincidir con los del n&uacute;cleo: simplemente descargar la
    versi&oacute;n m&aacute;s reciente. La compilaci&oacute;n e instalaci&oacute;n de modutils se
    detalla m&aacute;s tarde, en el ep&iacute;grafe &Iacute;nstalando modutils'. Pero
    primero lo haremos con el propio n&uacute;cleo.

    <p>El c&oacute;digo fuente del n&uacute;cleo qeu est&aacute; en t&uacute; m&aacute;quina ahora mismo
    se encuentra en el directorio '/usr/src/linux/'. Es una buena idea
    poner este c&oacute;digo fuente en particular a salvo, por ejemplo
    renombrando el directorio linux as&iacute;:</p>
<pre>
<strong>cd /usr/src
mv linux linux-2.2.19 (si es el c&oacute;digo fuente original del 2.2.19).
</strong>
</pre>
    <br>
    S&oacute;lo despu&eacute;s de haber guardado de manera segura el nucleo original
    has de desempaquetar el nuevo n&uacute;cleo: comprobar&aacute;s que el fichero
    linux-2.4.6.tar.bz2 descomprime su contenido por defecto en el
    directorio 'linux'. Si ya exist&iacute;a el directorio se sobreescribir&aacute; lo
    que hab&iacute;a, y entonces tendr&aacute;s problemas: ya no podr&aacute;s recompilar el
    n&uacute;cleo antiguo, habr&aacute;s perdido la configuraci&oacute;n original, etc. En
    este ejemplo renombro el directorio 'linux' creando el directorio
    'linux-2.4.6'. La ventaja de este procedimiento es que puedes ver
    la versi&oacute;n del n&uacute;cleo actual inmediatamente. Adem&aacute;s es f&aacute;cil
    instalar una actualizaci&oacute;n del n&uacute;cleo. Los comandos son (recuerda,
    como root):<br>
<pre>
<strong>cd /usr/src
cp ~/linux-2.4.6.tar.bz2 ( asumiento que el tarball lo descargaste  )
                         ( a tu directorio personal ('~')           )
bzip2 -d linux-2.4.6.tar.bz2 (puede que tarde un rato               )
tar -xvf linux-2.4.6.tar
mv linux linux-2.4.6
ln -s /usr/src/linux-2.4.6 /usr/src/linux
</strong>
</pre>
    <br>
     Una vez que has hecho esto vas al directorio del n&uacute;cleo, y haces:<br>
<pre>
<strong>cd /usr/src/linux
make xconfig (ver Figura 1)</strong>
</pre>
    <br>
     <a href="../../common/images/article252/make_xconfig.gif"><img
     src="../../common/images/article252/make_xconfig_th.gif"
     width="550" height="282" alt="La interfaz gr&aacute;fica para definir tu
     n&uacute;cleo de Linux despu&eacute;s del comando 'make xconfig'." align="middle"></a><br>

    <table>
      <tr>
        <td valign="top"><b>Figura 1:</b></td>

        <td><b>La interfaz gr&aacute;fica para definir tu
     n&uacute;cleo de Linux despu&eacute;s del comando 'make xconfig'.</b> </td>
      </tr>
    </table>

    <p>Este es el men&uacute; principal usado para definir el n&uacute;cleo. Para
    hacer esto debes pulsar en las diferenctes opciones. Pulsar en
    'Save and Exit' guarda tus opciones al disco, y una vez que hayas
    terminado puedes finalmente compilar e instalar el n&uacute;cleo (como en
    la Figura 40). Pero a&uacute;n no hemos llegado.</p>

    <p></p>

    <A NAME="252lfindex2">&nbsp;</A>
<H2>Configurando el n&uacute;cleo</H2>

    Debajo reproduzco varias capturas de pantalla con mis opciones
    marcadas. Cada pantalla se acompa&ntilde;a de una explicaci&oacute;n del porqu&eacute;
    e elegido estas opciones. Si lees cuidadosamente estos ejemplos
    podr&aacute;s entender las razones de mis elecciones, y tambi&eacute;n
    comprender&aacute;s mejor qu&eacute; opci&oacute;n deber&iacute;as coger en tu caso
    concreto. La opci&oacute;n 'help' te da una informaci&oacute;n similar. Puedes
    ver el bot&oacute;n 'help' haciendo tu propio 'make xconfig' para tu
    distribuci&oacute;n de Linux. Y despu&eacute;s pulsa 'Help'. El texto que
    aparece habitualmente recomienda qu&eacute; opci&oacute;n deber&iacute;as escoger.

    <p>Los ejemplos, por supuesto, pueden no comprender todo el
    hardware que puedas tener. Sin embargo, deber&iacute;an clarificar c&oacute;mo
    manejar tu hardware en concreto, y c&oacute;mo buscar en el propio n&uacute;cleo
    para averiguar si tu hardware est&aacute; soportado.</p>

    <p><img src=
    "../../common/images/article252/code_maturity_level_options.gif"
     width="578" height="166" alt=
    "Selecci&oacute;n de 'code maturity level options'." align=
    "middle"><br>
    </p>

    <table>
      <tr>
        <td valign="top"><b>Figura 2:</b></td>

        <td><b>Selecci&oacute;n de 'code maturity level
        options'.</b></td>
      </tr>
    </table>
    En esta secci&oacute;n puedes permitir el uso de las opciones
    experimentales de n&uacute;cleo. Algunas veces son necesarias, por
    ejemplo para el soporte de nuevos tipos de tarjetas. Sin embargo,
    en la mayor&iacute;a de casos no marcamos esta opci&oacute;n ya que el c&oacute;digo
    experimental genera un n&uacute;cleo menos estable. En la Figura 1 se ven
    las opciones &Iacute;EEE 1394 (FireWire) support' y 'Bluetooth support'
    en gris. Con las opciones marcadas no se puede seleccionar estas
    dos porque el c&oacute;digo correspondiente es todav&iacute;a experimental.

    <p><a href=
    "../../common/images/article252/loadable_module_support.gif"><b>
    Figura 3: Support for loadable modules</b></a>.<br>
    (de ahora en adelante las capturas de pantalla estar&aacute;n enlazadas,
    puedes abrirlas en una ventana nueva para echarles un vistazo)<br>
     Los m&oacute;dulos son trozos del c&oacute;digo del n&uacute;cleo, p. ej., drivers,
    que se compilan por separado pero idealmente al mismo tiempo que
    se compila el propio n&uacute;cleo. Por lo tanto, este c&oacute;digo no es parte
    del n&uacute;cleo, pero se puede cargar y por lo tanto estar disponible
    cuando lo necesitas. La recomendaci&oacute;n general es compilar el
    c&oacute;digo del n&uacute;cleo como m&oacute;dulo siempre que sea posible, porque esto
    da lugar a un n&uacute;cleo peque&ntilde;o y estable. Una advertencia: nunca
    compiles el sistema de ficheros como un n&uacute;cleo, ver Figura 32. Si
    cometes este error y compilas el sistema de ficheros como un
    m&oacute;dulo, el n&uacute;cleo que obtengas no podr&aacute; leer su propio sistema de
    ficheros. Entonces, el n&uacute;cleo no podr&aacute; siquiera cargar sus propios
    ficheros de configuraci&oacute;n, algo que es obviamente un prerequisito
    para arrancar correctamente linux. Puedes comprobar que
    escasamente uso los m&oacute;dulos: me gusta que mi n&uacute;cleo pueda hablar
    directamente con todo el hardware sin tener que cargar m&oacute;dulos,
    pero esta es s&oacute;lo mi preferencia.</p>

    <p><a href=
    "../../common/images/article252/processor_type_and_features.gif">
    <b>Figura 4: Seleccionando processor type and features</b></a>.<br>
    Aqu&iacute; tienes que elegir el tipo de procesador que tienes, e indicar
    si hay que aplicar varias opciones. En general las opciones
    '/dev/cpu' son bastante avanzadas y no deber&iacute;ar ser seleccionadas
    por la mayor&iacute;a de usuarios. 'High Memory Support' es necesario
    s&oacute;lo si tu ordenador tiene m&aacute;s de 1 gigabyte de RAM (no espacio de
    disco). La mayor&iacute;a de ordenadores tienen de 64 a 512 megabytes de
    ram (y de 8 a 60 Gb de disco duro), por lo que 'High Memory
    Support' no se marca habitualmente. Tienes que activar la opci&oacute;n
    'Math Emulation' si usas linux en un equipo 386 o 486SX. Estos
    antiguos equipos carecen del coprocesador matem&aacute;tico que linux les
    supone, por lo que en este caso debes seleccionar 'Math
    Emulation'. Virtualmente todo los procesadores modernos tienen un
    coprocesador incluido, por lo que habitualmente puedes dejar esta
    opci&oacute;n sin marcar. La opci&oacute;n 'MRTT' permite una comunicaci&oacute;n m&aacute;s
    r&aacute;pida entre un bus PCI y uno AGP. Puesto que todos los equipos
    modernos tienen su tarjeta de video en un bus AGP o PCI deber&iacute;as
    marcar 'MTRR': en cualquier caso, siempre es seguro habilitar esta
    opci&oacute;n incluso si tu equipo no usa el bus PCI o AGP para la
    tarjeta de v&iacute;deo. Symmetric multi-processing support (SMP)
    [soporte para multiproceso sim&eacute;trico] se
    aplica &uacute;nicamente a las placas base con dos procesarores Pentium
    II. SMP se asegura de que el n&uacute;cleo carga ambos procesadores
    optimamente. La &uacute;ltima opci&oacute;n (APIC) tambi&eacute;n se aplica
    habitualmente a los sistemas multiprocesador, y normalmente no se
    activa.</p>

    <p><a href=
    "../../common/images/article252/general_setup.gif"><b>Figura 5:
    General Kernel Options [Opciones generales del n&uacute;cleo]</b></a>.<br>
    Aqu&iacute; se le especifican ciertas opciones generales al n&uacute;cleo.
    Todo el mundo siempre selecciona &Ntilde;etworking support' porque
    siempre se necesita, p.ej., para Internet. Linux est&aacute; fuertemente
    orientado a Internet y no puede funcionar correctamente sin las
    redes. Adem&aacute;s, el soporte para redes tambi&eacute;n se necesita para
    muchas otras acciones que no parecen tener mucho que ver con las
    redes. Es incluso posible que el n&uacute;cleo no compile sin el soporte
    para redes. Resumiendo: incluye el soporte para redes. Todos los
    equipos modernos usan el bus PCI, por lo que selecionamos estas
    opciones tambi&eacute;n. El texto en gris 'PCMCIA/CardBus support'
    muestra que esta opci&oacute;n no est&aacute; disponible, porque antes hemos
    indicado que no queremos usar c&oacute;digo experimental (ver Figura
    2.). Si usas un port&aacute;til necesitas el soporte para PCMCIA/CardBus
    en el n&uacute;cleo para permitir el uso de la red o un m&oacute;dem (ver
    tambi&eacute;n m&aacute;s abajo bajo el nombre 'pcmcia support
    (laptops)'). 'System V IPC' permite a los programas comunicarse y
    sincronizarse, 'BSD process accounting' guarda p.ej., el c&oacute;digo de
    error cuando los procesos terminan, y 'Sysctl support' permite a
    los programas modificar ciertas opciones del n&uacute;cleo sin tener que
    recompilar el n&uacute;cleo o reniciar el sistema. Estas opciones se
    sueler dejar activadas. Las distribuciones modernas de linux tiene
    su 'kernel core (/proc/kcore/) format' seleccionado como &Eacute;LF':
    este es el formato est&aacute;ndar de varias librer&iacute;as de sistema, p.ej.,
    c&oacute;digo que est&aacute; disponible para el sistema y usado por
    programas. &Eacute;LF' es el sucesor del obsoleto formato &aacute;.out', y
    similar a los ficheros .dll de windows. Todas los programas
    modernos de linux usan las librer&iacute;as ELF, pero desafortunadamente
    algunos programas m&aacute;s antiguos tambi&eacute;n precisan de soporte para el
    formato &aacute;.out'. Un ejemplo es 'Word Perfect 8 para XWindows':
    esta aplicaci&oacute;n nativa de XWindows/Linux s&oacute;lo est&aacute; disponible en
    el formato &aacute;.out', as&iacute; que 'xwp' simplemente no funcionar&aacute; sin el
    soporte para el formato &aacute;.out'. Incluye &aacute;.out' como m&oacute;dulo. En
    principio no lo uso, pero resulta &uacute;til tener el c&oacute;digo disponible
    si eres un usuario habitual de java, python, o el emulador de DOS
    DOSEMU. He seleccionado 'Power Management support' y &Aacute;dvanced
    Power Management BIOS support' (no se muestran en la Figura
    5). Estas dos opciones son lo m&iacute;nimo que se necesita en una
    placa base ATX moderna para permitir al n&uacute;cleo apagar el ordenador
    automaticamente cuando se cierre linux. Las otras funciones de
    control de energ&iacute;a se desactivan porque no suelen funcionar bajo
    XWindows (que es lo que uso cuando estoy en linux). KDE y Gnome
    tienen sus propias funciones de gesti&oacute;n est&aacute;ndar de energ&iacute;a que
    puedes seleccionar.</p>

    <p><a href=
    "../../common/images/article252/Memory_Technology_Devices.gif"><b>
    Figura 6: Configurando Memory Technology Devices</b></a>.<br>
    Necesitas esta opci&oacute;n para hacer que linux pueda leer por ejemplo
    tarjetas flash. Las tarjetas flash se usan habitualmente en
    c&aacute;maras digitales. Con esta opci&oacute;n linux puede leer tarjetas flash
    (desde el hardware necesario) y copiar las fotos como ficheros
    .jpg al disco. A menos que sepas que lo necesitas yo no marcar&iacute;a
    esta opci&oacute;n: si descubres que la necesitas siempre la puedes
    a&ntilde;adir m&aacute;s tarde</p>

    <p><a href=
    "../../common/images/article252/parallel_port_support.gif"><b>Figura
    7: Configurando el parallel port [puerto paralelo]</b></a>.<br>
    Antes de que exisitiese la tecnolog&iacute;a USB el puerto paralelo se
    usaba comunmente para conectar impresoras y esc&aacute;ners al
    ordenador. Mi impresora se conecta al puerto paralelo, as&iacute; que
    quiero que este puerto est&eacute; disponible en linux. Ten en cuenta que
    configurar el puerto paralelo no es lo mismo que configurar el
    sistema de impresi&oacute;n: esto se hace despu&eacute;s, en la Figura 28.</p>

    <p><a href=
    "../../common/images/article252/plug_and_play_configuration.gif">
    <b>Figura 8: Configurando Plug &amp; Play</b></a>.<br>
    Casi todo el mundo tiene un sistema 'Plug &amp; Play' y por lo
    tanto y quiere soporte para ello. Activar esta opci&oacute;n permite al
    n&uacute;cleo configurar los dispositivos 'Plug &amp; Play' y que est&eacute;n
    disponibles en el sistema. Algunas veces es necesario activar la
    opci&oacute;n 'Plug &amp; Play OS' en la BIOS, porque de otra manera
    linux (y tambi&eacute;n Windows) no pueden configurar los dispositivos
    'Plug &amp; Play'. La opci&oacute;n &Iacute;SA Plug &amp; Play support' se
    refiere a las tarjetas ISA que son 'Plug &amp; Play' pero usan el
    bus ISA. Un ejemplo es la sound blaster AWE64. El bus ISA nunca
    tuvo un est&aacute;ndar 'Plug &amp; Play', lo que hace dif&iacute;cil configurar
    estas tarjetas. Hace tiempo, antes del n&uacute;cleo 2.4.x, los usuarios
    de linux ten&iacute;an que llamar al programa &iacute;sapnp' (paquete
    isapnptools, rpm -qil isapnptools para ver los ficheros) durante
    el proceso de arranque.
    &iacute;sapnp' leia el fichero '/etc/isapnp.conf'. Este fichero conten&iacute;a
    todos los puertos, direcciones e interrupciones usadas por las
    diferentes tarjetas. Si la informaci&oacute;n en '/etc/isapnp.conf' no
    era correcta, o si no se hac&iacute;a la llamada a &iacute;sapnp', la tarjeta
    no estaba accesible para linux y el modem, tarjeta de red o
    tarjeta de sonido no funcionaba. Al seleccionar la opci&oacute;n &Iacute;SA
    Plug &amp; Play support' se reemplaza el antiguo procedimiento: el
    fichero '/etc/isapnp.conf' ya no se usa. En vez de esto, las
    configuraciones se detectan automaticamente. En la SuSE 7.1 tuve
    que renombrar el fichero '/etc/isapnp.conf' a p.ej.,
    '/etc/isapnp.conf.old' despu&eacute;s de compilar el 2.4.x, porque tanto
    el n&uacute;cleo como &iacute;sapnp' reclamaban los mismo recursos, con
    desastrosas consecuencias. El problema es que SuSE 7.1 (y
    versiones antiguas) activan automaticamente &iacute;sapnp' durante el
    arranque, incluso aunque el n&uacute;cleo ya tenga el soporte
    necesario. Esto sin embargo es &uacute;nicamente relevante para equipos
    Linux antiguos, los nuevos no usan isapnp por defecto.

</p>

    <p><a href=
    "../../common/images/article252/block_devices.gif"><b>Figura 9:
    Configurando block devices</b></a>.<br>
    Virtualmente todo el mundo querr&aacute; usar la disquetera, as&iacute; que la
    opci&oacute;n de arriba est&aacute; activada (o, en mi caso, seleccionada como
    un m&oacute;dulo). En las peticiones para acceder a la disquetera el
    n&uacute;cleo carga automaticamente el m&oacute;dulo necesario, siempre y cuando
    el fichero '/etc/modules.conf' o '/etc/conf.modules' est&eacute;
    correctamente configurado en tu distribuci&oacute;n como es
    habitual. Como usuario no deber&iacute;as tener ning&uacute;n problema si has
    seleccionado las opciones correctas en la Figura 3. Para acceder a
    la disquetera el n&uacute;cleo debe ser, por supuesto, capaz de leer el
    sistema de archivos del disquete. Por lo tanto tambi&eacute;n debes
    copiar la Figura 32 correctamente. Las otras opciones pueden ser
    importantes si usas un sistema de almacenamiento IDE a trav&eacute;s del
    puerto paralelo, pero normalmente est&aacute;n desactivadas. Una posible
    excepci&oacute;n es 'loopback device support'. Antes de grabar CDs en
    linux usualmente se hace una im&aacute;gen del CD, y el 'loopback device'
    es necesario para mirar el contenido de la imagen. He seleccionado
    esta opci&oacute;n (quinta l&iacute;nea desde abajo) como un m&oacute;dulo (no aparece
    en la Figura 9).</p>

    <p><a href=
    "../../common/images/article252/multi_device_support.gif"><b>Figura
    10: Configurando multiple devices</b></a>.<br>
    Los usuarios comunes de linux normalmente no necesitan soporte
    para raid o LVM. 'Raid' implica que el sistema utiliza dos o m&aacute;s
    discos para guardar la informaci&oacute;n en paralelo. Si un disco se
    rompe el otro sigue en marcha, y el sistema sigue en
    funcionamiento. LVM hace posible a&ntilde;adir un disco duro de forma que
    una partici&oacute;n existente parece que se agrande. En la pr&aacute;ctica esto
    significa que no tienes que reparticionar o copiar una partici&oacute;n
    peque&ntilde;a a una m&aacute;s grande. Las rutas a ficheros siguen siendo las
    mismas tambi&eacute;n. Esta posibilidad es muy &uacute;til, pero habitualmente
    la mayor&iacute;a de usuarios comunes no la necesitar&aacute;n.</p>

    <p><a href=
    "../../common/images/article252/networking_options.gif"><b>Figura
    11: Configurando networking options</b></a>.<br>
    Necesitas la opci&oacute;n 'Packet Socket' para comunicarte con los
    elementos de red sin implementar un protocolo de red en el
    n&uacute;cleo. Aqu&iacute; puedo ser escueto: seleccionala siempre. La mayor&iacute;a
    del resto de opciones no hay que activarlas, a menos que necesites
    su soporte especifico. Por ejemplo, he seleccionado &Ntilde;etwork
    packet filtering (replaces ipchains)' porque uso el cortafuegos
    est&aacute;ndar de SuSE. Un cortafuegos proteje tu ordenador de ataques
    del exterior, p.ej., a trav&eacute;s de Internet, al menos cuando has
    configurado el cortafuegos correctamente. Protecci&oacute;n de
    cortafuegos a nivel de n&uacute;cleo es obviamente algo muy
    ventajoso. Otras opciones para configurar &ntilde;etwork packet
    filtering' se explican en la Figura 12. Necesitas &Uacute;nix domain
    sockets' para establecer conexiones de red, pero tambi&eacute;n a otras
    aplicaciones: XWindows usa automaticamente sockets Unix, as&iacute; que
    no puedes usar XWindows sin esta opci&oacute;n. Act&iacute;vala siempre. 'TCP/IP
    networking' contiene los protocolos necesarios para Internet, y
    tambi&eacute;n para las redes internas. Normalmente vas a necesitar
    activar el soporte para TCP/IP. En caso de duda al seleccionar
    alguna opci&oacute;n en particular, prueba con los textos de ayuda. Si no
    consigues aclararte siempre es posible incluir el soporte, y
    entonces quitarlo m&aacute;s tarde durante las pruebas. Compilar ciertas
    opciones como m&oacute;dulos es tambi&eacute;n una buena posibilidad.</p>

    <p><a href=
    "../../common/images/article252/IP_netfilter_configuration.gif">
    <b>Figura 12: Configurando IP netfilter
    (cortafuegos)</b></a>.<br>
    Para el funcionamiento correcto de su cortafuegos SuSE Linux
    necesita compatibilidad hacia atr&aacute;s para ipchains. De esta manera,
    para SuSE selecciono esta opci&oacute;n. Si usas un cortafuegos en otras
    distribuciones o instalaciones, consulta el manual.</p>

    <p><a href=
    "../../common/images/article252/telephony_support.gif"><b>Figura
    13: Configurando telephony support</b></a>.<br>
    Esto s&oacute;lo lo necesitas si tienes una tarjeta telef&oacute;nica en tu
    ordenador, p.ej., para hacer llamadas a trav&eacute;s de Internet. La
    mayor&iacute;a de usuarios comunes no necesitan esta opci&oacute;n.</p>

    <p><a href=
    "../../common/images/article252/ATA_IDE_MFM_RLL_support.gif"><b>
    Figura 14: Configurando ATA, IDE, MFM, RLL support
    (protocolos de comunicaci&oacute;n para discos duros)</b></a>.<br>
    Casi todo el mundo necesita estos protocolos, con la &uacute;nica
    excepci&oacute;n de aquellos pocos sistemas que s&oacute;lo tienen discos SCSI
    y ning&uacute;n otro tipo de disco. Por lo tanto, la mayor&iacute;a de usuarios
    deben elegir esta opci&oacute;n. Pulsando el la l&iacute;nea de debajo aparece
    un sub men&uacute; con otra serie de opciones. De estas hablamos m&aacute;s
    abajo. Debido a su importantcia no hay una sino tres capturas de
    pantalla. Selecciona con cuidado: tienen una importancia extrema.</p>

    <p><a href=
    "../../common/images/article252/ATA_IDE_MFM_RLL_block_devices_1.gif">
    <b>Figura 15: Configurando ATA, IDE, MFM, RLL support:
    captura 1</b></a>.<br>
    La opci&oacute;n superior es necesaria para todos aquellos que
    interactuen con su hardware a trav&eacute;s del interfaz IDE/ATAPI. Esto
    incluye los discos duros, pero tambi&eacute;n unidades de cinta,
    discos ZIP, y lectores y grabadores de CD. Basicamente, todos los
    ordenadores modernos usan el interfaz IDE/ATAPI, y por lo tanto
    esta opci&oacute;n est&aacute; activada. La opci&oacute;n &iacute;nclude IDE/ATA-2 DISK
    support' se necesita para soportar el disco duro del equipo. Por
    eso, esta opci&oacute;n tambi&eacute;n tienes que estar activada, excepto si
    tienes un equipo s&oacute;lo con SCSI.</p>

    <p><a href=
    "../../common/images/article252/ATA_IDE_MFM_RLL_block_devices_2.gif">
    <b>Figura 16: Configurando ATA, IDE, MFM, RLL support:
    captura 2</b></a>.<br>
    La opci&oacute;n &iacute;nclude IDE/ATAPI CDROM support' se selecciona
    habitualmente si tienes un dispositivo CDROM ATAPI. Sin embargo,
    a las grabadoras de CD ATAPI se accede mediante la emulaci&oacute;n
    SCSI. La emulaci&oacute;n SCSI se puede usar para acceder tanto al lector
    de CD como a la grabadora. Sin embargo, puedes tener problemas si
    montas tus CDs a trav&eacute;s de la emulaci&oacute;n SCSI, como mensajes de
    error al montar el CD, o al iniciar el reproductor de CD para
    escuchar un CD de m&uacute;sica. La mejor soluci&oacute;n es activar ambas
    opciones &iacute;nclude IDE/ATAPI CDROM support' y 'SCSI emulation
    support' como se muestra en la Figura 16. El dispositivo que
    necesita emulaci&oacute;n SCSI, habitualmente la grabadora, se puede
    definir en '/etc/lilo.conf' a&ntilde;adiendo la l&iacute;nea
    &aacute;ppend="hdd=ide-scsi"': de esto hablamos m&aacute;s abajo bajo la
    cabecera 'Configuraci&oacute;n de Lilo'. Como tengo una unidad ZIP
    interno que se comunica con la placa base a trav&eacute;s del interfaz
    ATAPI, he seleccionado la opci&oacute;n &iacute;nclude IDE/ATAPI FLOPPY
    support'. Se necesita la misma opci&oacute;n para acceder a otros
    dispositivos similares a disqueteras, como una unidad LS120. La
    mayor&iacute;a de las placas base utilizan 'PCI IDE' para acceder a los
    discos duros, CDROMs y disqueteras, y por lo tanto esta opci&oacute;n
    est&aacute; activada habitualmente. De la misma manera las dos
    posibilidades de activar DMA. DMA le da a tu hardware acceso
    directo a la memoria interna del ordenador, sin la intervenci&oacute;n
    del procesador. Como resultado de esto se puede acceder a los
    discos IDE m&aacute;s r&aacute;pido. Activa esta opci&oacute;n. La opci&oacute;n 'sharing PCI
    IDE interrupts support' est&aacute; desactivada porque lo m&aacute;s normal es
    que no la necesites. Cierto, algunas controladoras IDE permiten
    compartir interrupciones con otro dispositivo del ordenador, por
    ejemplo con una tarjeta de red ex&oacute;tica. Desafortunadamente,
    compartir interrupciones IDE disminuye el rendimiento de los
    discos compartidos, por lo que normalmente s&oacute;lo quieres compartir
    interrupciones cuando es la &uacute;nica manera de solucionar ciertos
    problemas serios de hardware.</p>

    <p><a href=
    "../../common/images/article252/ATA_IDE_MFM_RLL_block_devices_3.gif">
    <b>Figura 17: Configurando ATA, IDE, MFM, RLL support:
    screenshot 3</b></a>.<br>
    Mi placa base tiene un chipset Pentium II e Intel, por lo que por
    supuesto quiero usar el soporte espec&iacute;fico para este chipset
    particular. Cuando configures las opciones de tu propio n&uacute;cleo
    ver&aacute;s otros chipsets que no se muestran en la Figura 17.</p>

    <p><a href=
    "../../common/images/article252/SCSI_support.gif"><b>Figura 18:
    Configurando SCSI support</b></a>.<br>
    Si tienes una tarjeta SCSI debes seleccionar, por supuesto, las
    opciones que necesitas. La captura s&oacute;lo muestra las opciones que
    necesitas para tu grabadora ATAPI si has seleccionado 'SCSI
    emulation support' (Figura 16).</p>

    <p><a href=
    "../../common/images/article252/I2O_device_support.gif"><b>Figura
    19: Configurando I2O device support</b></a>.<br>
    Debes seleccionar esta opci&oacute;n si tienes un interfaz I2O en tu
    ordenador. La mayor&iacute;a de gente no lo tiene, y si este es tu caso
    simplemente desactiva la opci&oacute;n.</p>

    <p><a href=
    "../../common/images/article252/network_device_support.gif"><b>Figura
    20: Configurando network device support</b></a>.<br>
    Nunca he sido capaz de compilar un n&uacute;cleo sin network
    device support (soporte para dispositivos de red). Por lo tanto
    deber&iacute;as seleccionar esta opci&oacute;n. Tambi&eacute;n deber&iacute;as seleccionar el
    driver dummy (dummy = falso), como parte del n&uacute;cleo o como
    m&oacute;dulo. Linux necesita un driver falso incluso aunque en realidad
    la red f&iacute;sica no existea, como es el caso de muchos usuarios
    caseros. Incluso cuando hay una red linux usa frecuentemente el
    driver dummy. En este men&uacute; puedes seleccionar el tipo de red y la
    tarjeta de red, como se muestra en el ejemplo de la Figura 21. Ten
    en cuenta que hay que hacer otras cosas aparte si quieres acceder
    a internet a trav&eacute;s de un m&oacute;dem: debes activar el soporte ppp
    eligiendo 'PPP support for async serial ports' (para puertos COM)
    o 'PPP support for sync tty ports' (para conexiones r&aacute;pidas a
    trav&eacute;s de p.ej, un adaptador SyncLink). Si olvidas hacer esto el
    n&uacute;cleo te dir&aacute; que el m&oacute;dulo ppp no existe, aunque lo hayas
    creado, un mensaje de error que no ayuda a encontrar el problema
    real. Puedes elegir ambos m&eacute;todos de compresi&oacute;n sin problemas: si
    el n&uacute;cleo los necesita se usar&aacute;n, si no los necesita, no.</p>

    <p><a href=
    "../../common/images/article252/ethernet_10_or_100_Mbit.gif"><b>
    Figura 21: Configurando ethernet device</b></a>.<br>
    Mi tarjeta ethernet es una tarjeta 3COM /100 MBit que usa el
    chipset 3c509/3c529. Como no tengo ninguna conexi&oacute;n f&iacute;sica con una
    red (tengo una tarjeta de red, pero estoy conectado a la red a
    trav&eacute;s de un m&oacute;dem) compilo este driver como un m&oacute;dulo, por si
    acaso necesito la tarjeta en un futuro. Por supuesto debes
    seleccionar el tipo de red y tarjeta de tu equipo. Adem&aacute;s, debes
    configurar la conexi&oacute;n de red con un programa de configuraci&oacute;n de
    linux, como puede ser 'yast2' en SuSE.</p>

    <p><a href=
    "../../common/images/article252/amateur_radio_support.gif"><b>Figura
    22: Configurando amateur radio support</b></a>.<br>
    Selecciona esta opci&oacute;n si quieres usar el soporte para
    radioaficionado, y activa el driver necesario. La mayor&iacute;a de gente
    no usa esta opci&oacute;n.</p>

    <p><a href=
    "../../common/images/article252/IrDA_infrared_support.gif"><b>Figura
    23: Configurando support for infrared (wireless)
    communication</b></a>.<br>
    Activa la opci&oacute;n de comunicaci&oacute;n infrarroja si tienes un
    dispositivo inal&aacute;mbrico, p.ej., un rat&oacute;n inal&aacute;mbrico o un teclado
    inal&aacute;mbrico. La mayor&iacute;a de ordenadores de escritorio no los tienen
    y no necesitan la opci&oacute;n.</p>

    <p><a href=
    "../../common/images/article252/ISDN_subsystem.gif"><b>Figura
    24: Configurando ISDN support</b></a>.<br>
    Aqu&iacute; tienes que seleccionar el soporte para la tarjeta ISDN que
    tengas en tu equipo. Es importante conocer qu&eacute; tarjeta tienes,
    incluido el chipset: necesitas esta informaci&oacute;n para seleccionar
    el driver correcto.</p>

    <p><a href=
    "../../common/images/article252/old_CDROM_drivers.gif"><b>Figura
    25: Configurando old CDROM drivers</b></a>.<br>
    En los antiguos equipos 486 e incluso 386 el CDROM no se conectaba
    a trav&eacute;s de la controladora del disco duro IDE (ATAPI), sino a
    trav&eacute;s de una tarjeta de sonido o una tarjeta especial. Al usar estos
    antiguos CDs es necesario seleccionar el driver
    correspondiente. Esta opci&oacute;n ha sido reemplazada en los equipos
    modernos, y por lo tanto es sup&eacute;rflua.</p>

    <p><a href=
    "../../common/images/article252/input_core_support.gif"><b>Figura
    26: Configurando input core support</b></a>.<br>
    Esta opci&oacute;n se refiere a una de las novedades m&aacute;s importantes de
    la serie 2.4.x del n&uacute;cleo: el soporte para USB. Input core support
    es la capa entre el n&uacute;cleo y algunos dispositivos USB. La Figura
    38 muestra varios dispositivos USB que puedes seleccionar, y el
    texto de ayuda de alguno de estos indica los que necesitan &iacute;nput
    core support': ver Figura 38. Debes activar aqu&iacute; &iacute;nput core support'
    si uno de tus dispositivos USB lo necesita. Todas las placas base
    modernas tienen una conexi&oacute;n USB, as&iacute; que por norma deber&iacute;as
    activarlo. Pero, para ser honesto, se que no necesitar&eacute; soporte
    USB en mi sistema por lo que lo he desactivado.</p>

    <p><a href=
    "../../common/images/article252/character_devices_1.gif"><b>Figura
    27: Configurando character devices: captura 1</b></a>.<br>
    La opci&oacute;n de arriba ('virtual terminal') activa la posibilidad de
    abrir un xterm (usando XWindows) o usar el modo texto para
    entrar. Normalmente esta opci&oacute;n est&aacute; siempre activada. La segunda
    opci&oacute;n ('support for console on virtual terminal') le dice al
    n&uacute;cleo d&oacute;nde deber&iacute;a enviar los mensajes, como avisos sobre la
    falta de un m&oacute;dulo o su funcionamiento incorrecto, problemas con
    el propio n&uacute;cleo, y mensajes de inicio. Bajo XWindows nomalmente
    se habilita una ventana especial a parte para los mensajes del
    n&uacute;cleo, pero en el modo texto van tipicamente al primer terminal
    virtual ('CTRL+ALT+F1'). Deja esta opci&oacute;n activada. Tambi&eacute;n puedes
    elegir enviar estos mensajes al puerto serie, p.ej., a la
    impresora o a otro terminal (la cuarta opci&oacute;n). Para enviar los
    menajes a la impresora debes activar tambi&eacute;n el puerto mediante
    la tercera opci&oacute;n. De igual manera, debes activar este puesto si
    quieres usarlo para un 'serial mouse' (rat&oacute;n serie). De nuevo,
    normalmente la tercera opci&oacute;n ('standard/generic (8250/16550 and
    compatible UARTs) serial support') est&aacute; activada. En mi equipo he
    elegido compilar esto como un m&oacute;dulo. La raz&oacute;n es que durante el
    arranque SuSE se queja de la falta del m&oacute;dulo 'serial support', e
    incluir el soporte como m&oacute;dulo es una manera elegante de evitar el
    mensaje asegur&aacute;ndonos que el m&oacute;dulo existe. Configurar los
    'character devices' es extremadamente importante. Si no lo haces
    correctamente puedes acabar con un sistema que no funcione. Por lo
    tanto las figuras de la 28 a la 30 ahondan en una cuantas opciones
    m&aacute;s.
    </p>

    <p><a href=
    "../../common/images/article252/character_devices_2.gif"><b>Figura
    28: Configurando  los 'character devices': caputura
    2</b></a>.<br>
    Si quieres usar un xterm en tu m&aacute;quina o desde una remota, por
    ejemplo a trav&eacute;s de 'telnet' o 'ssh', debes activar la opci&oacute;n
    &uacute;nix98 PTY support'. Puede parecer que un escritorio que no tiene
    conexi&oacute;n no necesita esta opci&oacute;n, pero varios procesos en segundo
    plano tambi&eacute;n usan esta opci&oacute;n. Por lo tanto, es una buena idea
    activar esta opci&oacute;n en cualquier caso, aunque s&oacute;lo sea para evitar
    los mensajes de error (al menos en SuSE) durante el inicio. Todo
    el mundo que conecte una impresora a trav&eacute;s del puerto paralelo
    necesita por supuesto 'Parallel printer support'. De todas formas,
    no todo el mundo necesita el puerto paralelo: las modernas
    impresoras USB no lo necesitan.
    Los mensajes del n&uacute;cleo tambi&eacute;n pueden ir a la impresora en el
    puerto paralelo activando la opci&oacute;n 'Support for console on line
    printer': habitualmente, no lo usar&aacute;s. Necesitas la opci&oacute;n
    'support for user-space parallel port device drivers' si tienes
    ciertos dispositivos que cuelgan del puerto paralelo, pero no es
    muy habitual. De igual manera, habitualmente no necesitas &Iacute;2C
    support': es necesario para ciertas tarjetas que manejan video,
    pero si descubres que lo necesitas siempre puedes a&ntilde;adirlo al
    n&uacute;cleo m&aacute;s tarde, una vez que sabes que el n&uacute;cleo funciona
    correctamente. Selecciona soporte para rat&oacute;n y joystick cuando los
    uses, pero no todos los ratones usan este driver (ver m&aacute;s abajo,
    en la Figura 29). Las grabadoras de CD de hoy en d&iacute;a han dejado
    obsoletas a las unidades de cinta que necesitan 'QIC-02 Tape
    support', por lo tanto esta opci&oacute;n est&aacute; habitualmente desactivada.</p>


    <p><a href=
    "../../common/images/article252/character_devices_Mice.gif"><b>Figura
    29: Configurando los 'character devices': Rat&oacute;n</b></a>.<br>
    No necesitas nada de esta opci&oacute;n si tienes un rat&oacute;n de puerto
    serie, pero para todos los dem&aacute;s tipos de ratones debes configurar
    ciertos par&aacute;metros aqu&iacute;. Si usas un rat&oacute;n bus ORIGINAL debes
    seleccionar la opci&oacute;n de arriba, y debajo de ella el
    correspondiente tipo o marke del rat&oacute;n bus. Muchos ordenadores hoy
    en d&iacute;a tienen otros tipo de ratones, normalmente (y erroneamente)
    llamados 'rat&oacute;n bus (busmouse)' o ' rat&oacute;n PS/2'. Estos ratones se
    conectan frecuentemente a '/dev/aux' y se conectan al equipo a
    trav&eacute;s de un peque&ntilde;o conector similar al los que se usan para
    los teclados. A menudo este tipo de rat&oacute;n usa el teclado para
    conectarse al ordenador. Para hacer que estos ratones funcionen
    correctamente debes seleccionar las opciones mostradas en la
    Figura 29, 'mouse support (not serial and bus mice)' y 'PS/2 mouse
    (aka "auxiliary device" support)'.</p>

    <p><a href=
    "../../common/images/article252/character_devices_3.gif"><b>Figura
    30: Configurando los 'character devices': captura
    3</b></a>.<br>
    Las opciones para configurar el n&uacute;cleo entre la de la Figura 28 y
    la Figura 30 no se discuten aqu&iacute;. Normalmente est&aacute;n
    desactivadas. La opci&oacute;n 'Ftape, the floppy tape device driver' se
    refiere al soporte para las unidades de cinta conectadas a trav&eacute;s
    de la controladora de disquetera. Incluso aunque tengas tal
    unidad de cinta no es esencial compilar su soporte, al menos
    no la primera vez. Las otras opciones se refieren a las tarjetas
    de video 3D modernas. Si tienes una tarjeta de video que se
    conecta a trav&eacute;s de un bus AGP, puedes activar el soporte para
    AGP, y tambi&eacute;n el driver espec&iacute;fico para tu tarjeta de video (bajo
    '/dev/agpgart (AGP support)'). Ten en cuenta que es posible tener
    un n&uacute;cleo que funcione correctamente si estas opciones, &iexcl;pero no
    necesariamente! La gente que tenga una tarjeta de video integrada
    en su placa base, como el chipset intel i815, &iexcl;DEBEN usar el
    driver del n&uacute;cleo! Si no, XWindows 4.0 o superiores (usadas en la
    mayor&iacute;a de distribuciones m&aacute;s recientes) no funcionar&aacute;. Mi equipo
    tiene una tarjeta AGP, una NVidia TNT2, pero esta tarjeta no est&aacute;
    soportada por un m&oacute;dulo espec&iacute;fico del n&uacute;cleo (NVidia se niega a
    compartir las especificaciones hardware, necesarias para
    desarrollar estos drivers).
    Desafortunadamente, en mi caso no tiene por lo tanto mucho sentido
    activar el soporte para AGP. A pesar de este problema particular,
    puedo usar XWindows 4.0 sin el driver del n&uacute;cleo. 'Direct
    rendering support' es para una opci&oacute;n XWindows desde la versi&oacute;n
    4.0 para acelerar el rendimiento de los gr&aacute;ficos a trav&eacute;s del
    n&uacute;cleo. Para hacer uso de esta opci&oacute;n tu tarjeta de video
    espec&iacute;fica debe estar soportada, y debes usar XFree86 4.0 o
    superior. Adem&aacute;s debes activar tambi&eacute;n &Aacute;GP support'. De toda
    maneras, puedes no seleccionar estas opciones con toda
    tranquilidad y obtener un n&uacute;cleo de linux que funcione correctamente.</p>

    <p><a href=
    "../../common/images/article252/multimedia_devices.gif"><b>Figura
    31: Configurando los 'multimedia devices</b></a>.<br>
    Esta opci&oacute;n est&aacute; activada si tienes una tarjeta que maneja video o
    radio. Como antes, esta opci&oacute;n no es esencial para el
    funcionamiento correcto del n&uacute;cleo.</p>

    <p><a href=
    "../../common/images/article252/file_systems_1.gif"><b>Figura
    32: Configurando los 'file systems': captura 1</b></a>.<br>
    Aqu&iacute; puedes especificar los sistemas de ficheros que pueden ser
    leidos por el n&uacute;cleo de linux. Quiz&aacute; quieras hacer un n&uacute;cleo de
    linux que pueda leer discos y disquetes de Windows, pero debes
    asegurarte de que el n&uacute;cleo pueda leer el propio sistema de
    ficheros de linux, ext2, o el nuevo sistema de ficheros
    ReiserFS. Linux no podr&aacute; ni arrancar si no lo haces, porque
    entonces el n&uacute;cleo no puede leer su propio disco de arranque (como
    se coment&oacute; antes cerca de la Figura 3). Para leer disquetes y
    discos DOS/Windows necesitas activar la opci&oacute;n 'DOS FAT support':
    sin embargo, para leer discos de Windows NT/Windows 2000 necesitas
    un driver espec&iacute;fico de solo lectura que se puede seleccionar
    posteriormente en este men&uacute;. Para leer y tambi&eacute;n escribir discos y
    disquetes DOS/Windows necesitas la opci&oacute;n 'MSDOS fs
    support'. Virtualmente todo el mundo necesita esto, as&iacute; que la
    mayor&iacute;a de gente activa estas opciones. 'VFAT' es para el soporte
    de nombres de ficheros largos en Windows 95 o 98. Mi equipo es lo
    que se llama un equipo de arranque dual, en el cual puedo arrancar
    tanto Windows 98 como linux (usando el gestor de arranque de linux
    lilo, ver 'Configuring lilo'). Por lo tanto he activado
    'VFAT'. Necesitas incluir soporte para ISO 9660 leer CDs en
    formato est&aacute;ndar. Bajo esta est&aacute; la opci&oacute;n 'Joliet extensions',
    que permite nombres de ficheros m&aacute;s largos que los de MS-DOS 8.3
    que es el l&iacute;mite en el est&aacute;ndar ISO 9660. Casi todo el mundo
    quiere leer los CDs de hoy en d&iacute;a, as&iacute; que estas opciones
    normalmente est&aacute;n activadas. La Figura 33 clarifica algunas
    opciones adicionales, entre las que est&aacute; el sistema de ficheros
    ext2 de linux.</p>

    <p><a href=
    "../../common/images/article252/file_systems_2.gif"><b>Figura
    33: Configurando los file systems: captura 2</b></a>.<br>
    Los ficheros en el directorio '/proc' contienen informaci&oacute;n sobre
    el estado del sistema, p.ej., qu&eacute; interrupciones est&aacute;n siendo
    usadas. Normalmente siempre se activa esta opci&oacute;n. 'Second extended
    fs support' es la opci&oacute;n relacionada con el sistema de ficheros est&aacute;ndar
    (todav&iacute;a) de linux. DEBES compilar est&aacute; opci&oacute;n en el n&uacute;cleo (&iexcl;NUNCA
    como un m&oacute;dulo!). Las Figuras 32 y 33 no muestran la opci&oacute;n
    'ReiserFS' que tambi&eacute;n puede ser seleccionada aqu&iacute;: el sucesor
    bendecido de ext2, ReiserFS gestiona mucho mejor el da&ntilde;o producido en
    el sistema de ficheros debido a fallos en el suminitro el&eacute;ctrico y
    problemas similares. En este momento ReiserFS est&aacute; todav&iacute;a bajo
    desarollo y por lo tanto marcado como c&oacute;digo experimental. Aun as&iacute;
    la mayor&iacute;a de distribuciones recientes ya soportan el uso de
    ReiserFS, pero incluso aunque ReiserFS se supone que reemplazar&aacute; a
    &eacute;xt2' en el futuro no lo recomendar&iacute;a como un sistema de ficheros
    para todas las particiones ahora mismo. Necesitas el &Uacute;DF file
    system support' si usas (bajo Windows) el programa 'packetCD', que
    permite copiar ficheros de un CD al vuelo as&iacute; como desde un disco
    duro lento. Es muy &uacute;til para intercambiar datos con otros
    PCs. Tambi&eacute;n es posible leer estos "packet CDs" bajo linux
    montandolos con el sistema de ficheros &uacute;df', p.ej., con un
    comando como 'mount -t udf /dev/scd0 /cdrom'. Esta parte tambi&eacute;n
    contiene elementos como &Ntilde;etwork file systems' (sistemas de
    ficheros de red), 'partition types' (tipos de particiones) y
    &Ntilde;ative language support' (soporte para lenguaje nativo). No
    necesitas &Ntilde;etwork File Systems' a menos que tu ordenador sea
    parte de una red grande, en cuyo caso necesitas activar &Ntilde;FS File
    System Support' y quiz&aacute; tambi&eacute;n 'SMB file support', pero para un
    ordenador aislado no necesitas estas opciones. La opci&oacute;n
    'Partition Types' es bastante avanzada pero no necesaria para un
    uso efectivo del n&uacute;cleo de linux. Es mejor desactviarla. Las
    Figuras 35 y 35 explican con m&aacute;s detalle &Ntilde;ative Language
    Support'.</p>

    <p><a href=
    "../../common/images/article252/native_language_support_1.gif"><b>
    Figura 34: Configurando &ntilde;ative language support': captura
    1</b></a>.<br>
    En este men&uacute; seleccionas qu&eacute; tabla de c&oacute;digos debe usar linux para
    manejar los nombres de ficheros de DOS y Windows. Las tablas de
    c&oacute;digos de la figura 34 son los usuales para nombres de ficheros
    de DOS. Las tablas NLS de la figura 35 son necesarios para usar
    nombres de ficheros largos. La opci&oacute;n superior de la figura 34,
    'Default NLS option', determina qu&eacute; s&iacute;mbolos ser&aacute;n los est&aacute;ndar en
    linux. La figura 35 representa y explica la opci&oacute;n &iacute;so8859-15'.</p>

    <p><a href=
    "../../common/images/article252/native_language_support_2.gif"><b>
    Figure 35: Configurando &ntilde;ative language support': captura
    2</b></a>.<br>
    Necesitas la opci&oacute;n &Ntilde;LS ISO 8859-15' para reproducir
    correctamente FAT de Windows y las extensiones Joliet de los
    sistemas de ficheros de los CDs, algo que es siempre una buena
    idea. La selecci&oacute;n &Ntilde;LS ISO 8859-15' es apropiada para las lenguas
    occidentales, e incluye el s&iacute;mbolo del euro. Por lo tanto esta
    tabla de c&oacute;digos se compila casi siempre con el n&uacute;cleo. La tabla
    &Ntilde;LS ISO 8859-1' es la tabla anterior de las lenguas occidentales
    pero sin el soporte para el s&iacute;mbolo del euro.</p>

    <p><a href=
    "../../common/images/article252/console_drivers.gif"><b>Figura
    36: Configurando los console drivers (drivers de consola)</b></a>.<br>
    La opci&oacute;n 'VGA text console' permite habilitar el modo texto con
    una resoluci&oacute;n VGA. Casi todo el mundo necesita esta opci&oacute;n, as&iacute;
    que esta opci&oacute;n casi siempre est&aacute; activada. S&oacute;lo unos pocos de los
    antiguos ordenadores 386 carecen de una tarjeta VGA compatible,
    mientras que los ordenadores modernos no tienen ni el m&aacute;s ligero
    problema con esta elecci&oacute;n. La segunda opci&oacute;n, 'video mode
    selection support', hace posible seleccionar la resoluci&oacute;n del
    modo texto durante el proceso de arranque. Esto es realmente &uacute;til
    si quieres tener m&aacute;s letras por l&iacute;nea, pero normalmente se deja
    desactivada. Las dos opciones finales son experimentales, y te
    aconsejo que nos las selecciones.</p>

    <p><a href="../../common/images/article252/sound.gif"><b>Figura
    37: Sound configuration (configuraci&oacute;n del sonido)</b></a>.<br>
    En esta secci&oacute;n se configura la tarjeta de sonido. Si tu
    distribuci&oacute;n usa los drivers de sonido ALSA (como SuSE 6.3 y
    superiores), sobra con seleccionar 'sound card support' como
    M&Oacute;DULO. Los drivers ALSA se compilar y linkan m&aacute;s tarde (ver m&aacute;s
    abajo bajo el ep&iacute;grafe 'SuSE y los drivers de sonido ALSA'). Si tu
    distribuci&oacute;n usa los drivers de sonido est&aacute;ndars del n&uacute;cleo debes
    seleccionar ahora el adecuado para tu tarjeta de
    sonido. Virtualmente todas las marcas de tarjetas de sonido se
    nombran aqu&iacute;, as&iacute; que en principio la selecci&oacute;n del driver
    adecuado no es problema. Si tu tarjeta de sonido funciona con el
    n&uacute;cleo est&aacute;ndar de tu distribuci&oacute;n puedes usar tambi&eacute;n programas
    de configuraci&oacute;n (como el 'yast2' de SuSE) para averiguar qu&eacute;
    driver necesita especificamente tu tarjeta de sonido. Es
    tranquilizador saber que el sonido no es cr&iacute;tico: te quedas sin
    sonido si algo va mal aqu&iacute;, pero el n&uacute;cleo en s&iacute; funciona perfectamente.</p>

    <p><a href=
    "../../common/images/article252/USB_support.gif"><b>Figura 38:
    Configurando &Uacute;SB support'</b></a>.<br>
    Mi placa base tiene un puerto USB, pero no lo uso. Sin embargo, si
    desactivo el soporte para USB SuSE me da un mensaje de error
    durante el arranque. Por supuesto SuSE soporta USB y por lo tanto
    intenta cargar los m&oacute;dulos necesarios, por eso he seleccionado
    'Support for USB' como un m&oacute;dulo. Aunque este mensaje de error no
    es importante para m&iacute;, lo soluciono de una manera elegante
    compilando el driver necesario para los puertos USB de mi
    placa. Para hacer esto la opci&oacute;n m&iacute;nima es poner 'y' en 'Preliminary
    USB device filesystem' y cargar el driver espec&iacute;fico de
    USB. Puesto que mi placa Pentium II es bastante antigua he
    seleccionado el driver &Uacute;HCI (Intel PIIX4, VIA, ...)' como un
    m&oacute;dulo. Pero, si tienes una placa base reciente con el chipset
    Intel debes seleccionar el m&oacute;dulo &Uacute;HCI Alternate Driver (JE)
    support', mientras que p. ej., en un ordenador Compaq deber&iacute;as
    elegir &Oacute;HCI support' como m&oacute;dulo. En principio s&oacute;lo necesitas uno
    de estos tres m&oacute;dulos, pero en caso de duda puedes elegir los
    tres. Tu distribuci&oacute;n de linux descubrir&aacute; cu&aacute;l de los tres
    necesita, y cargar&aacute; automaticamente el correcto.</p>

    <p>Habilitar simplemente los puertos USB de tu placa base no es
    suficiente, necesitas especificar tambi&eacute;n los drivers (m&oacute;dulos)
    del perif&eacute;rico USB que est&aacute; conectado a tu ordenador. La lista que
    aparece bajo &Uacute;SB Device Class drivers' tiene varias opciones. Lo
    que sigue es bastante sencillo y poco puede fallar: de todas
    maneras, en caso de duda lee la ayuda.</p>

    <p><a href=
    "../../common/images/article252/kernel_hacking.gif"><b>Figura
    39: Configurando 'kernel hacking'</b></a>.<br>
    Esta es f&aacute;cil: &iexcl;NO la selecciones!. Es una opci&oacute;n &uacute;til para
    programadores que quieren encontrar la raz&oacute;n por la que el n&uacute;cleo
    fall&oacute; o para leer la cach&eacute; del disco duro: la opci&oacute;n no sirve de
    nada para un usuario com&uacute;n.</p>

    <p><img src="../../common/images/article252/save_and_exit.gif"
    width="441" height="199" alt="Save and Exit." align=
    "middle"><br>
    </p>

    <table>
      <tr>
        <td valign="top"><b>Figura 40:</b></td>

        <td><b>Save and Exit (guardar y salir).</b></td>
      </tr>
    </table>
    Pffft, lo conseguimos. Lo que queda es compilar e instalar el
    n&uacute;cleo como se muestra m&aacute;s abajo.

    <p><br>
    </p>

    <A NAME="252lfindex3">&nbsp;</A>
<H2>Compilando el n&uacute;cleo</H2>

    Pulsando en 'Save and Exit' (Guardar y Salir) guardas tus opciones
    de configuraci&oacute;n en el fichero './.config' (o
    '/usr/src/linux/.config' si compilas en /usr/src/linux).
    Adem&aacute;s, es muy &uacute;til guardar este fichero y copiarlo al nuevo
    directorio del c&oacute;digo fuente del n&uacute;cleo si haces una actualizaci&oacute;n
    peque&ntilde;a, del n&uacute;cleo 2.4.5 al 2.4.6 por ejemplo. De esta manera
    puedes (habitualmente) conservar todas tus antiguas opciones de
    configuraci&oacute;n, que te pueden ahorrar mucho trabajo.
    De manera similar puedes comenzar usando el fichero de
    configuraci&oacute;n del n&uacute;cleo &eacute;st&aacute;ndar' de tu distribuci&oacute;n, que en
    algunas ditros est&aacute; en /boot/config (copialo a ./.config para
    empezar a usarlo).
    Pero, si actualizaste el c&oacute;digo fuente de tu n&uacute;cleo y aparecen
    problemas extra&ntilde;os al compilar el n&uacute;cleo &iexcl;este es por supuesto el
    primer fichero que debes borrar! Doy por hecho por tu bien
    que has anotado y guardado cuidadosamente la
    configuraci&oacute;n del n&uacute;cleo que funciona correctamente. El proceso
    para compilar el n&uacute;cleo es el siguiente:
<pre>
<strong>make dep
make clean (para n&uacute;cleos antiguos)
make bzImage
make modules
make modules_install</strong>
</pre>
    La figura 40 ya indic&oacute; la necesidad del comando 'make dep'. Por
    supuesto ejecutamos estos comandos en el directorio del c&oacute;digo
    fuente de linux, normalmente '/usr/src/linux'. Los n&uacute;cleos de la
    serie 2.0.x o anteriores tambi&eacute;n necesitaban el comando 'make
    clean', que borraba ficheros antiguos antes de la compilaci&oacute;n de
    un nuevo n&uacute;cleo. El comando 'make clean' imped&iacute;a extra&ntilde;os mensajes
    de error que eran dif&iacute;ciles de solucionar, pero que estaban
    causados presumiblemente por ficheros objeto (.o) antiguos que no
    eran sobreescritos. El comando 'make bzImage' compila el nuevo
    n&uacute;cleo, pero todav&iacute;a no lo instala. Tambi&eacute;n puedes compilar el
    n&uacute;cleo con otros comandos 'make', p.ej., 'make bzlilo' o 'make
    zImage', pero estos comandos pueden darte problemas
    inesperados. La mayor&iacute;a de los n&uacute;cleos son demasiado grandes como
    para permitir un 'make zImage' ejecutado correctamente: obtienes
    un mensaje de error durante la compilaci&oacute;n, y acabas sin un
    n&uacute;cleo. Con el comando 'make bzlilo' todo debe estar configurado
    correctamente el ficheros como '/etc/lilo.conf', pero este no es
    siempre el caso. Por lo tanto es m&aacute;s seguro evitar estos &uacute;ltimos
    comandos. El comando 'make modules' compila los m&oacute;dulos: se
    instalan con el comando 'make modules_install'. Este comando pone
    los m&oacute;dulos en el directorio '/lib/modules/2.4.6/' si la versi&oacute;n
    actual de n&uacute;cleo es la 2.4.6: cambia cuando compilas otra versi&oacute;n
    del n&uacute;cleo. De esta manera los m&oacute;dulos correspondientes a una
    versi&oacute;n en concreto del n&uacute;cleo acaban automaticamente en un
    directorio espec&iacute;fico, por lo tanto evitando conflictos con
    m&oacute;dulos obsoletos y problemas similares. Durante el arranque el
    n&uacute;cleo de linux sabe en qu&eacute; directorio puede encontrar los m&oacute;dulos
    correctos. Pero, los ficheros en '/lib/modules/2.4.6/' son
    sobreescritos y m&oacute;dulos antiguos permanecen si ya hab&iacute;as compilado
    el n&uacute;cleo 2.4.6 antes y lo recompilas de nuevo. Entonces, puede
    que antiguos m&oacute;dulos sigan estando por ah&iacute; aunque ya no sean
    necesarios en el nuevo n&uacute;cleo. Normalmente esto no es un problema,
    pero es siempre una buena idea tomarse el tiempo necesario para
    borrar los m&oacute;dulos antiguos antes de instalar los nuevos.

    <p>Para evitar problemas al instalar el n&uacute;cleo tambi&eacute;n te debes
    asegurar de que la configuraci&oacute;n de lilo '/etc/lilo.conf' es la
    correcta, y debes copiar el n&uacute;cleo y el fichero 'System.map' en el
    lugar correcto. Despu&eacute;s de todo esto tambi&eacute;n tienes que ejecutar
    el comando 'lilo'. Una alternativa es el uso de 'loadlin', que
    permite arrancar un n&uacute;cleo de linux bajo Dos/Windows. Ambas
    opciones son comentadas m&aacute;s abajo.</p>


    <A NAME="252lfindex4">&nbsp;</A>
<H2>Configurando lilo</H2>

    Puedes encontrar el fichero de configuraci&oacute;n de lilo en el
    directorio '/etc' con el nombre '/etc/lilo.conf'. &Aacute;brelo con un
    editor de texto ASCII sencillo: puede que tengas instalado un
    editor "de verdad" como XEmacs (entonces, usa 'xemacs
    /etc/lilo.conf &amp;'), un editor de texto sencillo a pantalla
    completa como kedit o gedit (entonces, usa 'k(g)edit
    /etc/lilo.conf') o un primitivo editor lineal como pico o nano
    (entonces usa 'pico /etc/lilo.conf'). El fichero lilo.conf ser&aacute;
    algo como esto:
<pre>
<strong>
boot    = /dev/hda
vga     = normal
read-only
menu-scheme = Wg:kw:Wg:Wg
lba32
prompt
timeout = 300
message = /boot/message

  other  = /dev/hda1
  label  = win98

  image  = /boot/bzImage
  label  = linux-2.4.6
  root   = /dev/hda3
  append = "parport=0x378,7 hdd=ide-scsi"

  image  = /boot/vmlinuz.suse
  label  = suse
  root   = /dev/hda3
  append = "hdd=ide-scsi"
  initrd = /boot/initrd.suse
</strong>
</pre>
    <p>
    El contenido detallado del fichero lilo.conf puede diferir del que
    se muestra arriba tanto entre equipos como distribuciones. Por lo
    tanto no voy a comentar paso a paso este fichero. Las 8 l&iacute;neas
    superiores est&aacute;n correctamente configuradas y no es necesario que
    las modifiques, normalmente. El comando 'boot' en la primera l&iacute;nea
    indica el disco duro f&iacute;sico del que se arranca, esto es, 'boot'
    apunta a donde se encuentra el 'master boot record'. En mi caso
    arranco de /dev/hda, el primer disco duro f&iacute;sico. La opci&oacute;n 'vga'
    indica que el arranque usa el modo texto est&aacute;ndar VGA, con 80x25
    caracteres. La opci&oacute;n 'read-only' significa que el proceso de
    arranque primero monta la partici&oacute;n de linux como s&oacute;lo
    lectura. Durante el arranque de linux se requean las particiones
    en busca de errores: s&oacute;lo despu&eacute;s de esto se vuelven a montar con
    las opciones de lectura y escritura. La l&iacute;nea 'menu-scheme'
    establece los colores del men&uacute; de arranque de 'lilo' en modo
    texto. Con 'lda32' se posibilita el arrancar el sistema operativo
    despu&eacute;s del cilindro 1024, siempre y cuando esto est&eacute; soportado
    por la BIOS. Todos los equipos modernos suportan
    'lba32'. Los problemas con esta opci&oacute;n se pueden solucionar
    mediante una actualizaci&oacute;n de la BIOS, algo que es casi una
    necesidad con los grandes discos duros disponibles hoy en d&iacute;a. El
    comando 'prompt' fuerza a 'lilo' a mostrar un prompt que permite
    al usuario elegir el sistema operativo deseado. La opci&oacute;n
    'timeout' establece el n&uacute;mero de milisegundos que 'lilo' espera a
    que se teclee algo en el prompt antes de arrancar el sistema
    operativo por defecto. Si 'lilo.conf' no estable un sistema
    operativo por defecto, como en el ejemplo, el proceso de arranque
    inicia el primer sistema operativo que encuentra. En mi caso este
    es Windows98, as&iacute; que la gente que no conoce linux todav&iacute;a
    al final obtendr&aacute;n un entorno Windows. La opci&oacute;n 'message' muestra
    un mensaje mientras se ejecuta 'lilo'. En SuSE es Tux, el
    estupendo ping&uuml;ino mascota de linux, con (por supuesto) el texto
    'SuSE Linux 7.1'. Puedes ver este mensaje escribiendo 'xv
    /boot/message' o 'gv /boot/message' (algunas veces incluso 'gimp
    /boot/message') : 'xv' y 'gv' (ghostview) son programas shareware
    con los que puedes ver varios tipos de formatos de im&aacute;genes.
    Ten siempre en cuenta que el fichero /boot/message no existe en
    los sistemas que no tienen una pantalla de login gr&aacute;fica
    (p.ej. distribuciones antiguas), en este caso el 'boot message' es
    simplemente un mensaje de texto.
    En principio es posible mostrar tu propia imagen favorita durante
    el arranque, pero no he probado todav&iacute;a esta posibilidad. Todas
    las opciones de 'lilo' est&aacute;n por supuesto documentadas en las
    p&aacute;ginas man, a las que puedes acceder a trav&eacute;s de los comandos
    'man lilo' y 'man lilo.conf'.
</p>
    <p>Las otras opciones gestionan el arranque de varios sistemas
    operativos. Como mucho puedes arrancar dieciseis sistemas
    operativos o n&uacute;cleos distintos. Normalmente esto es
    suficiente. Seleccionas el sistema operativo con la l&iacute;nea
    'label='. Lo normal con Windows98 (y tambi&eacute;n anteriores versiones
    de Windows y DOS, pero no Windows NT o Windows 2000) es tenerlo en
    la primera partici&oacute;n primaria. Por lo tanto estos sistemas
    operativos &uacute;nicamente necesitan una l&iacute;nea &oacute;ther' y una l&iacute;nea
    'label'. La segunda secci&oacute;n, desde &iacute;mage=/boot/bzImage', inicia
    el nuevo n&uacute;cleo con la etiqueta (label) 'linux-2.4.6'. Mi
    directorio raiz de linux es '/dev/hda3'. La l&iacute;nea &aacute;ppend =
    "parport=0x378,7 hdd=ide-scsi"' le dice al n&uacute;cleo la
    direcci&oacute;n y la interrupci&oacute;n para el puerto paralelo (port 0x378,
    interrupt 7), y especifica que mi grabadora 'hdd' debe ser
    manejada mediante emulaci&oacute;n SCSI. El nombre de la grabadora
    depende del equipo: en el mio est&aacute; en 'hdd', pero en el tuyo puede
    ser otro nombre. El uso de una interrupci&oacute;n es mayormente cuesti&oacute;n
    de gustos personales. Una interrupci&oacute;n acelera la impresi&oacute;n, pero
    puedes no incluir este comando si no tienes una interrupci&oacute;n
    disponible para el puerto paralelo (impresora). Por defecto en
    linux se usa el lento m&eacute;todo de 'polling', que permite al n&uacute;cleo
    usar el puerto paralelo sin una interrupci&oacute;n. La &uacute;ltima secci&oacute;n,
    desde &iacute;mage = /boot/vmlinuz.suse', contiene la configuraci&oacute;n de
    lilo que se realiz&oacute; durante el proceso de configuraci&oacute;n de SuSE:
    he a&ntilde;adido la l&iacute;nea append="hdd=ide-scsi" a mano. El fichero
    'boot/vmlinuz.suse' es el n&uacute;cleo est&aacute;ndar que viene con la
    distribuci&oacute;n. Preferiblemente, deber&iacute;as guardar este n&uacute;cleo
    SIEMPRE para las emergencias. La l&iacute;nea &iacute;nitrd =
    /boot/initrd.suse' afecta &uacute;nicamente a la instalaci&oacute;n est&aacute;ndar del
    n&uacute;cleo: especifica la carga de lo que se conoce como imagen
    'ramdisk', un disco virtual que se carga en memoria (o memoria de
    acceso aleatorio - random access memory -, RAM). El 'ramdisk'
    contiene los m&oacute;dulos necesarios para el arranque correcto de
    linux: un n&uacute;cleo de una distribuci&oacute;n tiene, por supuesto, que ser
    capaz de acceder a una enorme  variedad de hardware, algo que es
    s&oacute;lo posible usando muchos m&oacute;dulos.</p>

    <p>Espero que ahora est&eacute; claro d&oacute;nde debes guardar el nuevo n&uacute;cleo
    antes de ejecutar lilo. En este ejemplo, los comandos exactos son:</p>
<pre>
<strong>cp /usr/src/linux/arch/i386/boot/bzImage /boot
cp /usr/src/linux/System.map /boot/System.map-2.4.6
lilo</strong>
</pre>
    En SuSE 7.3 tambi&eacute;n puedes ejecutar el segundo comando as&iacute;:
<pre>
<strong>cp /usr/src/linux/System.map /boot
</strong>
</pre>
    ( el System.map original ya ha sido renombrado ) <br>
    Si ya tienes un n&uacute;cleo con el nombre 'bzImage' y quieres mantener
    este n&uacute;cleo, puedes copiar el n&uacute;cleo nuevo a '/boot/bzImage-2.4.6'
    y hacer el correspondiente cambio en /etc/lilo.conf: cambia
    /boot/bzImage por /boot/bzImage-2.4.6. La compilaci&oacute;n siempre
    recrea el fichero System.map, que contiene los nombres y la
    configuraci&oacute;n de importantes variables del n&uacute;cleo. El comando
    'depmod -a' crea un fichero que contiene todas las dependencias de
    los m&oacute;dulos del n&uacute;cleo, esto es, la distintas relaciones entre el
    n&uacute;cleo y los m&oacute;dulos, entre los propios m&oacute;dulos, y tambi&eacute;n la
    informaci&oacute;n en el fichero '/etc/modules.conf'. La mayor&iacute;a de
    distribuciones de linux, incluida SuSE, comprueban que 'depmod -a'
    se ejecuta durante el arranque, pero es un buena idea asegurarse
    explicitamente que el fichero /boot/System.map existe, y que
    corresponde con la versi&oacute;n correcta del n&uacute;cleo. El comando 'lilo'
    instala las nuevas configuraciones de un n&uacute;cleo antiguo, o el
    nuevo n&uacute;cleo. Si ya ten&iacute;as un fichero '/boot/bzImage' que
    sobreescribes con un nuevo n&uacute;cleo pero sin ejecutar lilo, acabar&aacute;s
    con un nuevo n&uacute;cleo que no podr&aacute; arrancar. El antiguo n&uacute;cleo
    original de la distribuci&oacute;n que guardaste de manera segura todav&iacute;a
    funciona, porque no ha sido sobreescrito. Guardar el antiguo
    n&uacute;cleo nos permite compilar y probar nuevos n&uacute;cleos de una manera
    responsable.

    <p></p>

    <A NAME="252lfindex5">&nbsp;</A>
<H2>Usando loadlin</H2>

    Si usas 'loadlin' para arrancar linux sin duda ya sabes como
    encontrar este &uacute;til programa, a saber, en C:\loadlin. Virtualmente todas
    las distribuciones de linux tienen 'loadlin' en el primer CD en el
    directorio 'dosutils'. Tambi&eacute;n debes copiar el n&uacute;cleo nuevo al
    disco duro en 'C:\loadlin', quiz&aacute; con un nombre &uacute;nico. Arrancando
    primero Windows98 en modo DOS puedes despu&eacute;s arrancar linux con el
    comando:

    <div style="margin-left: 2em">
      <strong>loadlin bzImage</strong>
    </div>
    Bajo circunstancias normales la mayor&iacute;a de configuraciones que se
    guardan en el propio n&uacute;cleo, como la localizaci&oacute;n de la partici&oacute;n
    raiz, son correctas si has compilado tu propio n&uacute;cleo, y en este
    caso es suficiente el comando de arriba es suficiente para
    arrancar linux sin problemas. Escribiendo (en DOS) el comando
    'loadlin | more' obtendr&aacute;s una pantalla de ayuda que incluye un
    enlace a un 'loadlin-HowTo' en Internet. Con 'loadlin' puedes
    probar un nuevo n&uacute;cleo compilado incluso aunque seas reticente
    trabajar con 'lilo': a saber, 'loadlin' y 'bzImage'
    juntos caben en un disquete de 1.44 MB. No hay nada que pueda
    fallar si arrancas primero DOS con un disquete de arranque (con
    soporte para EMM386), y despu&eacute;s arrancas linux desde el disquete
    con 'loadlin' y 'bzImage'. Pero, por supuesto debes tener un
    disquete de arranque de DOS.

    <p></p>

    <A NAME="252lfindex6">&nbsp;</A>
<H2>SuSE y los drivers de sonido de ALSA</H2>

    SuSE usa los drivers de sonido est&aacute;ndar ALSA (Advanced Linux Sound
    Architecture). Estos drivers son de mejor calidad que los drivers
    del proyecto OSS que son los est&aacute;ndar en el n&uacute;cleo. Si te tomas
    enserio el sonido bajo linux sin duda deber&iacute;as usar los drivers de
    ALSA. Estos drivers no son parte del (antiguo) c&oacute;digo fuente del
    n&uacute;cleo, lo que implica que los drivers deben ser compilados e
    instalados de manera independiente. El c&oacute;digo fuente de los
    drivers de ALSA se localiza en la parte 'zq' de la distribuci&oacute;n
    SuSE: sigue leyendo si no sabes lo que significa esto. Instala
    ALSA a trav&eacute;s de YaST o YaST2 para que puedas tener el c&oacute;digo
    fuente disponible en el directorio '/usr/src/packages/'. Para
    compilar e instalar los drivers de ALSA haz lo siguiente:
<pre>
<strong>rpm -bb /usr/src/packages/SPECS/alsa.spec
cd /usr/src/packages/BUILD/alsa/alsa-driver-&lt;version number&gt;/
./configure
make install</strong>
</pre>
    La primera l&iacute;nea instala el c&oacute;digo fuente, incluidos los drivers,
    en el directorio '/usr/src/packages/BUILD/'. Adem&aacute;s las librer&iacute;as
    de ALSA y las utilidades se compilan directamente como ficheros
    rpm. Desafortunadamente, los drivers no se compilan por
    defecto. Debes compilarlos e instalarlos por separado a mano
    usando los dos comandos de arriba. El comando './configure'
    encuentra las configuraciones y ficheros necesarios en tu sistema
    y los pone en un fichero de configuraci&oacute;n. El comando 'make
    install' compila todos los drivers de ALSA y los instala a la vez
    para que puedan ser usados por el n&uacute;cleo en el directorio
    '/lib/modules/2.4.6/misc/'. Ahora, al arrancar SuSE el driver de
    sonido deseado se instala automaticamente. Tengo que admitir que
    el procedimiento sugerido aqu&iacute; es algo cutre, pero debes saber
    exactamente lo que estas haciendo para encontrar los drivers
    necesarios e incluir el soporte de sonido en un nuevo n&uacute;cleo de
    manera m&aacute;s directa.

    <p>Si no usas SuSE, o si quieres usar una verci&oacute;n m&aacute;s reciente de
    los drivers de ALSA, puedes descargar estos drivers y las
    librer&iacute;as y utilidades correspondientes de <a href=
    "http://www.alsa-project.org">http://www.alsa-project.org</a>.
    La p&aacute;gina de inicio de este sitio muestra las &uacute;ltimas noticias
    sobre el proyecto ALSA (p.ej., la integraci&oacute;n en febrero de 2002
    de los drivers de ALSA con la rama de c&oacute;digo fuente oficial de la
    serie 2.5 del n&uacute;cleo) y enlaces a varios ficheros para su
    descarga. Abajo mostrar&eacute; c&oacute;mo compilar los drivers de ALSA: puedes
    seguir los mismos pasos para las librer&iacute;as y las
    utilidades. Desempaqueta los drivers en un directorio conveniente,
    p.ej., '/usr/local/'. Entra en este directorio, en este caso
    '/usr/local/alsa-driver-&lt;version-number&gt;/' y ejecuta los
    comandos de arriba empezando por './configure'. Es posible que
    tengas que realizar algunos pasos adicionales para que los drivers
    funcionen si tu distribuci&oacute;n no usa los drivers de ALSA como
    est&aacute;ndar. Desafortunadamente, estos problemas est&aacute;n fuera del
    alcance de este bastante extenso documento, pero puedes encontrar
    m&aacute;s ayuda en la FAQ (Frequently Asked Questions - Preguntas
    Frecuentes) de ALSA que tambi&eacute;n puedes descargar.</p>

    <p></p>

    <A NAME="252lfindex7">&nbsp;</A>
<H2>Soporte para pcmcia (port&aacute;tiles)</H2>

    El soporte para pcmcia es est&aacute;ndar desde los n&uacute;cleos 2.4.x en
    adelante. Sin embargo, el PCMCIA HOWTO oficial discute que la
    versi&oacute;n del n&uacute;cleo de PCMCIA deber&iacute;a perferentemente no
    usarse. Por ahora, los fuentes de pcmcia, incluidos los scripts y
    los drivers pueden funcionar con todos las ramas del n&uacute;cleo: 2.0,
    2.2, y 2.4. Mi experiencia me dice que los drivers pcmcia dejan de
    funcionar despu&eacute;s de recompilar el n&uacute;cleo, y que deben ser
    recompilados tambi&eacute;n. Hay dos soluciones dependiendo de tu
    distribuci&oacute;n. La primera es usar el c&oacute;digo fuente que viene con la
    distribuci&oacute;n. Instalar y compilar el c&oacute;digo fuente a un fichero
    rpm te proporciona un fichero que puedes instalar. La otra
    soluci&oacute;n es descargar, desempaquetar, compilar, e instalar la
    versi&oacute;n m&aacute;s reciente de pcmcia de <a href=
    "http://sourceforge.net/projects/pcmcia-cs/">http://sourceforge.net/projects/pcmcia-cs/</a>),
    as&iacute;:<br>
<pre>
<strong>cp /etc/rc.d/pcmcia /etc/rc.d/pcmcia.SuSE
cp ~/pcmcia-cs-3.1.?.tar.gz /usr/src
cd /usr/src
tar -zxf ./pcmcia-cs-3.1.?.tar.gz
make config
make all
make install
cp /etc/rc.d/pcmcia.SuSE /etc/rc.d/pcmcia
</strong>
</pre>
    La primera y la &uacute;ltima l&iacute;nea solucionan un problema espec&iacute;fico de
    SuSE. El script de inicializaci&oacute;n de pcmcia de SuSE es borrado con
    el comando 'make install', lo que hace que el script falle en
    SuSE. El problema se soluciona copiando el original de nuevo
    despu&eacute;s del 'make install'. Si has sobreescrito por error el
    script original de SuSE debes reinstalar el paquete pcmcia de
    nuevo empezando con la parte &aacute;1', copiar el script original a
    otro fichero, executar 'make install' otra vez, y finalmente
    reemplazar el fichero con el script original.

    <p>Para obtener el nuevo fichero rpm para el soporte para pcmcia
    en SuSE debes hacer lo siguiente:<br>
    </p>
<pre>
<strong>rpm -i /cdrom/suse/zq1/pcmcia-3.1.?.spm
cd /usr/src/packages
rpm -bb ./SPECS/pcmcia-3.1.?.spec
cd /RPMS/i386/
rpm -i --force ./pcmcia-3.1.?.rpm
SuSEconfig
</strong>
</pre>
    En la primera l&iacute;nea asumo que instalar&aacute;s los drivers pcmcia desde
    el sexto o s&eacute;ptimo CD y que el lector de CD ya est&aacute; montado en
    /cdrom. El comando 'rpm -i' instala el c&oacute;digo fuente y el comando
    'rpm -bb' compila el fichero rpm pcmcia. Despu&eacute;s instala este
    fichero en particular como haces con todos los ficheros
    rpm. F&iacute;jate que tienes que usar la opci&oacute;n '--force' porque de otra
    manera el programa rpm te dir&aacute; (correctamente) que 'pcmcia' ya
    est&aacute; instalado, y por lo tanto ignorar&aacute; el nuevo fichero. Como
    siempre, tienes que ejecutar el programa SuSEconfig (ten en cuenta
    las MAY&Uacute;SCULAS y las min&uacute;sculas) cuando has instalado ficheros rpm
    a mano en SuSE, para activar los cambios de la configuraci&oacute;n. Lo
    &uacute;ltimo lo realizan automaticamente los programas de configuraci&oacute;n
    de SuSE YaST o YaST2 despu&eacute;s de haber instalado o modificado
    nuevos paquetes. Entonces, ya no es necesario hacer la activaci&oacute;n
    a mano.

    <p>Para poder usar el soporte pcmcia correctamente debes activar
    &ntilde;etwork support' durante la compilaci&oacute;n, pero debes desactivar
    todos los otros drivers para tarjetas de red. Y, como ya ha sido
    comentado con la figura 11, debes, por supuesto, activar tambi&eacute;n
    'TCP/IP support' si quieres usar Internet.</p>

    <p></p>

    <A NAME="252lfindex8">&nbsp;</A>
<H2>Instalando 'modutils'</H2>

    Como ya he mencionado el n&uacute;cleo usa los peque&ntilde;os programas de
    'modutils' para gestionar los m&oacute;dulos del n&uacute;cleo. Estos programas
    incluyen:
<pre>
<strong>insmod (que instala un m&oacute;dulo),
rmmod  (que borra un m&oacute;dulo, y)
lsmod  (mostar todos los m&oacute;dulos en uso),
</strong>
</pre>
    entre muchos otros. Con comandos como 'man lsmod' puedes averiguar
    c&oacute;mo funcionan los distintos comandos, algo que no voy a tratar
    aqu&iacute;.

    <p>Compilar e instalar 'modutils' es algo sencillo.
    Simplemente haz:</p>
<pre>
<strong>cd /usr/src
cp ~/modutils-2.4.6.tar.bz2 . ( asumiendo que el fichero est&aacute; en tu )
                              ( directorio personal, '~'            )
bzip2 -d modutils-2.4.6.tar.bz2 ( unzip: puede tardar un poco       )
tar -xvf modutils-2.4.6.tar
cd modutils-2.4.6 ( ir al directorio en el que 'modutils' ha        )
                  ( sido desempaquetado                             )
./configure (encontrar la configuraci&oacute;n espec&iacute;fica del sistema      )
make ( compilar 'modutils': puesto que es peque&ntilde;o la compilaci&oacute;n    )
     ( puede ser sorprendentemente r&aacute;pida                           )
make install (instalar 'modutils' en el directorio '/sbin/'         )
</strong>
</pre>
    Esto es todo lo que tienes que hacer para tener 'modutils'
    listo. F&iacute;jate de nuevo que en este ejemplo 'modutils' tiene el
    mismo n&uacute;mero de versi&oacute;n que el n&uacute;mero del n&uacute;cleo, pero esto no
    siempre es el caso.

    <p></p>

    <A NAME="252lfindex9">&nbsp;</A>
<H2>&iquest;Funciona el n&uacute;cleo correctamente?</H2>

    Ya has configurado, compilado, y probablemente instalado a trav&eacute;s
    de lilo el nuevo n&uacute;cleo. Reinicias el sistema y te preguntas:
    &iquest;c&oacute;mo puedo averiguar si el nuevo n&uacute;cleo funcionar&aacute; correctamente?
    Encontrar&aacute;s con facilidad hardware que no funciona cuando lo
    pruebas, pero adem&aacute;s el n&uacute;cleo muestra much&iacute;sima informaci&oacute;n &uacute;til
    en la pantalla durante el arranque, incluso antes de que se inicie
    el modo gr&aacute;fico. Esta informaci&oacute;n contiene cosas como las
    configuraciones que se detectan automaticamente (puertos, IRQs,
    etc.), pero tambi&eacute;n mensajes de error en caso de que determinado
    driver con haya podido ser inicializado directamente, ni como
    m&oacute;dulo ni como parte del n&uacute;cleo. Ver estos mensajes nos permite
    estar avisados sobre ciertos problemas. En SuSE linux esto es muy
    f&aacute;cil: cada parte del n&uacute;cleo que arranca pone en el lado derecho
    de la pantalla un mensaje (verde) de 'hecho' si todo funcion&oacute;
    correctamente, o 'fall&oacute;' si algo fue mal. Ya que los mensajes
    puede que aparezcan por pantalla a gran velocidad, cualquier
    mensaje de error se muestra en un resumen encima del login
    prompt. El login prompt aparece pulsando
    '&lt;Ctrl&gt;+&lt;Alt&gt;+F1' si en tu caso aparece la pantalla de
    login gr&aacute;fico automaticamente. De esta manera tienes al menos una
    pista sobre d&oacute;nde ocurren los problemas si verdaderamente el
    mensaje de error es relevante para t&iacute;. Los mensajes de error que son
    parecidos a 'Cannot find module' o 'Cannot load module'
    normalmente indican que no has incluido ciertas partes que
    deber&iacute;an estar. Arreglar la configuraci&oacute;n del n&uacute;cleo y recompilar
    suele solucionar el problema. Ten en cuenta que no es necesario
    recompilar el n&uacute;cleo entero. Si simplemente te olvidaste de
    algunos m&oacute;dulos es suficiente con reejecutar 'make modules' y
    'make modules_install'. Incluso no es un problema si tienes que
    recompilar todo el n&uacute;cleo. La mayor&iacute;a del c&oacute;digo del n&uacute;cleo ya
    est&aacute; compilado, y las &uacute;nicas partes que necesitan ser recompiladas
    son las que faltaban. En resumen, simplemente modificar el
    n&uacute;cleo un poquito y recompilarlo es algo muy r&aacute;pido, en contraste
    con la compilaci&oacute;n inicial del n&uacute;cleo. En este caso, puedes irte a
    hacerte un caf&eacute; tranquilamente.

    <p>Otra forma de inspeccionar los mensajes de arranque del n&uacute;cleo
    es con el comando 'dmesg'. Simplemente ejecutando este comando se
    muestran los mensajes que aparecieron (y desaparecieron) por
    pantalla anteriormente. Enviarlos a un fichero, con 'dmesg &gt;
    temp', te permite leer los mensajes de error a tu ritmo (con 'more
    temp', o tu editor favorito).</p>

    <p></p>

    <A NAME="252lfindex10">&nbsp;</A>
<H2>Conclusi&oacute;n</H2>

    Con esta gu&iacute;a en tus manos puedes empezar tu experimentaci&oacute;n con
    el n&uacute;cleo de una forma razonablemente sensata. Afortunadamente el
    umbral para empezar a jugar con el n&uacute;cleo se reduce lo suficiente
    para que est&eacute;s impaciente por comenzar. La mayor&iacute;a del tiempo lo
    dedicar&aacute;s a decidir la configuraci&oacute;n correcta del n&uacute;cleo, mientras
    que durante la compilaci&oacute;n puedes jugar sin problemas al
    'freecell' o hacer otra cosa con el ordenador.

    <p>Si todav&iacute;a tuvieses problemas y no supieses como solucionarlos,
     podr&iacute;as usar varias de las listas y sitios web sobre linux donde
     puedes realizar preguntas. Estos existen en diferentes idiomas,
     no solo en ingl&eacute;s. Despu&eacute;s de un tiempo razonablemente corto
     normalmente obtienes una respuesta que te permite solucionar tu
     problema. La mejor manera de encontrar estas listas y sitios web
     es con un buscador.</p>

    <p></p>
  



<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1" summary="tb-button-outerpart">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1" summary="tb-button">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=252"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%" summary="footer">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Philip de Groot, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
</TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE summary="translators">
  <tr><td><font size="2">nl --&gt; -- : Philip de Groot <small>&lt;philipg(at)authors.linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">nl --&gt; en: Nino R. Pereira &lt;pereira(at)speakeasy.org&gt;</font></td></tr>
  <tr><td><font size="2">en --&gt; es: Javier G&oacute;mez Sierras &lt;jgomsi(at)obelix.umh.es&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2003-03-17, generated by lfparser version 2.34</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
