<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.6">
 <TITLE>C&Oacute;MO configurar los ajustes de v&iacute;deo en XFree86: Interpretando las especificaciones b&aacute;sicas.</TITLE>
 <LINK HREF="XFree86-Config-COMO-6.html" REL=next>
 <LINK HREF="XFree86-Config-COMO-4.html" REL=previous>
 <LINK HREF="XFree86-Config-COMO.html#toc5" REL=contents>
</HEAD>
<BODY>
<A HREF="XFree86-Config-COMO-6.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-4.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc5">Índice general</A>
<HR>
<H2><A NAME="specs"></A> <A NAME="s5">5.</A> <A HREF="XFree86-Config-COMO.html#toc5">Interpretando las especificaciones b&aacute;sicas.</A></H2>


<P>Esta secci&oacute;n explica qu&eacute; quieren decir las especificaciones de m&aacute;s arriba, y algunas
otras cosas que usted necesitar&aacute; saber.  Primero, algunas definiciones.  Al lado
de cada una, entre par&eacute;ntesis, se encuentra el nombre de variable que utilizaremos
para ellas cuando hagamos c&aacute;lculos</P>
<P>
<DL>
<DT><B>frecuencia de sincronizaci&oacute;n horizontal (FSH).</B><DD><P>Barridos horizontales por segundo (ver m&aacute;s arriba). </P>

<DT><B>frecuencia de sincronizaci&oacute;n vertical (FSV).</B><DD><P>Barridos verticales por segundo (ver m&aacute;s arriba). Es muy importante
el valor m&aacute;ximo de esta variable.</P>

<DT><B>dot clock (FRTV).</B><DD><P>M&aacute;s correctamente, `frecuencia de reloj de la tarjeta de v&iacute;deo';
La frecuencia del reloj interno de su tarjeta de v&iacute;deo --- el m&aacute;ximo
n&uacute;mero de puntos que puede emitir.</P>

<DT><B>ancho de banda de v&iacute;deo (ABV).</B><DD><P>La frecuencia m&aacute;s alta a la que puede enviar datos a la entrada de v&iacute;deo
del monitor y todav&iacute;a esperar distinguir algo en la pantalla. Si su 
tarjeta de v&iacute;deo produce un patr&oacute;n alternativo encendido/apagado, la
frecuencia m&aacute;s baja ser&aacute; la mitad de la FRTV, por lo que en teor&iacute;a el
ancho de banda comienza a tener sentido para valores mayores que FRTV/2.
Para una visi&oacute;n muy rica en peque&ntilde;os detalles, no puede ponerse muy por
debajo de la mayor FRTV, y preferiblemente por encima de este valor.</P>

<DT><B>Longitud de la imagen (LIH, LIV).</B><DD><P>La longitud de imagen horizontal (LIH) es el n&uacute;mero de pulsaciones del
reloj de la tarjeta de v&iacute;deo que el ca&ntilde;&oacute;n de electrones de su monitor 
necesita para recorrer una l&iacute;nea horizontal, <EM>incluyendo los bordes
inactivos izquierdo y derecho</EM>. La longitud de imagen vertical (LIV)
es el n&uacute;mero de l&iacute;neas recorridas en la imagen <EM>completa</EM>, incluyendo
los bordes inactivos superior e inferior.</P>

<DT><B>Tasa de refresco de la pantalla (TR).</B><DD><P>Es el n&uacute;mero de veces que la pantalla se redibuja por segundo. Cuanto mayor
sea, mejor, ya que ello reduce el parpadeo. 60Hz es bueno, el est&aacute;ndar VESA
es 72Hz o mejor. Puede hallarlo con:
<BLOCKQUOTE><CODE>
<PRE>
        TR = FRTV / (LIH * LIV)
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>D&eacute;se cuenta de que el producto del denominador <EM>no</EM> es 
justo la resoluci&oacute;n visible del monitor, sino que es normalmente
algo mayor. Detallaremos esto m&aacute;s abajo.</P>
<P>Las tasas de refresco con las que se especifican los modos entrelazados
(como por ejemplo, 87Hz entrelazado) son en realidad las tasas de refresco
de media imagen: una imagen completa parece tener esa frecuencia de 
refresco pero en realidad cada l&iacute;nea se renueva la mitad de veces.</P>
<P>En materia de c&aacute;lculos nos referiremos a una imagen entrelazada con la tasa
de refresco de toda la imagen, por ejemplo: 43,5Hz. La calidad de un modo
entrelazado es mejor que la de un modo no entrelazado con la misma tasa 
de refresco de imagen completa, pero definitivamente peor que la del modo
no entrelazado correspondiente a media tasa de refresco.</P>
</DL>
</P>

<H2><A NAME="ss5.1">5.1 Acerca del ancho de banda.</A>
</H2>


<P>A los fabricantes de monitores les gusta anunciar un gran ancho de banda
porque ello supone agudeza en la intensidad y en los cambios de color de
la pantalla. Un gran ancho de banda significa detalles visibles m&aacute;s 
peque&ntilde;os.</P>
<P>Su monitor utiliza se&ntilde;ales electr&oacute;nicas para mostrar una imagen ante sus
ojos.  Esas se&ntilde;ales llegan en forma de onda una vez que se convierten 
a un formato anal&oacute;gico a partir de un formato digital. Pueden ser 
consideradas como combinaciones de muchas funciones de onda simples, 
cada una con su frecuencia propia, muchas de ellas en el rango de los
MHz, como por ejemplo 20MHz, 40MHz, o incluso 70MHz.  El ancho de banda
de su monitor es, en efecto, la mayor frecuencia de se&ntilde;al anal&oacute;gica que
puede manejar sin distorsi&oacute;n.</P>
<P>Para nuestros prop&oacute;sitos, lo importante del ancho de banda de 
v&iacute;deo es que marca el punto l&iacute;mite aproximado de la mayor frecuencia
de reloj de la tarjeta de v&iacute;deo (dot clock) que puede utilizar.</P>

<H2><A NAME="ss5.2">5.2 Frecuencias de Sincronizaci&oacute;n y Tasa de Refresco:</A>
</H2>


<P>Cada l&iacute;nea horizontal barrida es s&oacute;lo la parte visible de la longitud de
la anchura de la pantalla.  En todo momento s&oacute;lo existe un punto 
realmente activo en la pantalla, pero con una velocidad de refresco 
suficiente la "inercia" de visi&oacute;n de su ojo le permite percibir la imagen
completa.</P>
<P>Observe estas figuras:</P>
<P>
<PRE>
     _______________________
    |                       |     La frecuencia de sinc. horizontal
    |                       |     es el n&uacute;mero de veces por
    |                       |     segundo que el rayo de electrones
    |---------------------->|     del monitor puede trazar
    |                       |     un patr&oacute;n como &eacute;ste.
    |                       |
    |                       |
    |                       |
    |_______________________|    
     _______________________
    |        ^              |     La frecuencia de sinc. vertical
    |       ^ |             |     es el n&uacute;mero de veces por
    |       | v             |     segundo que el rayo de
    |       ^ |             |     electrones del monitor puede
    |       | |             |     trazar un patr&oacute;n como &eacute;ste.
    |       ^ |             |
    |       | v             |
    |       ^ |             |
    |_______|_v_____________|    
</PRE>
</P>
<P>Recuerde que el camino de dibujo de la pantalla es una l&iacute;nea de zig-zag
muy tensa: el rayo de electrones se mueve de izquierda a derecha y de
arriba a abajo al mismo tiempo.</P>
<P>Ahora podemos ver c&oacute;mo se relacionan el dot clock y el tama&ntilde;o de imagen con
la tasa de refresco.  Por definici&oacute;n, un hercio (Hz) es un ciclo por segundo.
Por lo tanto, si su longitud horizontal de imagen es LHI y su longitud vertical
de imagen es LVI, entonces para cubrir toda la pantalla son necesarios 
LHI x LVI se&ntilde;ales.  Ya que su tarjeta emite FRTV se&ntilde;ales por segundo por 
definici&oacute;n, entonces l&oacute;gicamente el ca&ntilde;&oacute;n de electrones de su monitor puede
barrer la pantalla de izquierda a derecha y vuelta y de arriba a abajo y
vuelta FRTV / (LHI x LVI) veces por segundo. Esa es la velocidad de refresco
de su pantalla, ya que indica las veces que su pantalla puede ser actualizada
(esto es, <EM>refrescada</EM>) por segundo.</P>
<P>Usted debe entender este concepto para dise&ntilde;ar una configuraci&oacute;n que optimice
la resoluci&oacute;n frente al parpadeo en cualquier modo que se ajuste a sus 
necesidades.</P>
<P>Para aquellos que entiendan mejor los gr&aacute;ficos que el texto, aqu&iacute; va uno:</P>
<P>
<PRE>
        TR                                     ABV
         |   m&iacute;n FSH                     m&aacute;x FSH |
         |    |             R1        R2  |      |
m&aacute;x FSV -+----|------------/----------/---|------+----- m&aacute;x FSV
         |    |:::::::::::/::::::::::/:::::\     |
         |    \::::::::::/::::::::::/:::::::\    |
         |     |::::::::/::::::::::/:::::::::|   |
         |     |:::::::/::::::::::/::::::::::\   |
         |     \::::::/::::::::::/::::::::::::\  |
         |      \::::/::::::::::/::::::::::::::| |
         |       |::/::::::::::/:::::::::::::::| |
         |        \/::::::::::/:::::::::::::::::\| 
         |        /\:::::::::/:::::::::::::::::::|
         |       /  \:::::::/::::::::::::::::::::|\
         |      /    |:::::/:::::::::::::::::::::| |
         |     /     \::::/::::::::::::::::::::::| \
min FSV -+----/-------\--/-----------------------|--\--- min FSV
         |   /         \/                        |   \
         +--/----------/\------------------------+----\- FRTV
           R1        R2  \                       |     \
                          min FSH                |    max FSH
                                                ABV
</PRE>
</P>
<P>Este es el gr&aacute;fico de un modo de monitor gen&eacute;rico. El eje de las x
del gr&aacute;fico muestra la tasa de pulsos de reloj (FRTV), el eje de 
las y representa la tasa de refresco (TR). La regi&oacute;n rellena del
gr&aacute;fico describe las capacidades del monitor: cada punto de esta
regi&oacute;n es un posible modo de v&iacute;deo.</P>
<P>Las l&iacute;neas etiquetadas 'R1' y 'R2' representan resoluciones fijas (tales
como 640x480); quieren ilustrar c&oacute;mo una resoluci&oacute;n puede llevarse a
cabo con m&uacute;ltiples combinaciones de dot clock y tasa de refresco. La 
l&iacute;nea R2 representar&iacute;a una resoluci&oacute;n mayor que R1.</P>
<P>Los l&iacute;mites superior e inferior de la regi&oacute;n permitida son s&oacute;lo l&iacute;neas
horizontales que representan los valores l&iacute;mite para la frecuencia
de sincronizaci&oacute;n vertical.  El ancho de banda de v&iacute;deo es un l&iacute;mite
superior a la velocidad de reloj y en la gr&aacute;fica se representa como una
l&iacute;nea vertical que limita la regi&oacute;n de resoluciones posibles por la derecha.</P>
<P>Bajo el ep&iacute;grafe 
<A HREF="XFree86-Config-COMO-15.html#cplot">Capacidades de dibujo del monitor</A>) 
usted encontrar&aacute; un programa que le ayudar&aacute; a dibujar un diagrama como este
(pero mucho m&aacute;s bonito, con gr&aacute;ficos X) para su propio monitor. Esa secci&oacute;n
tambi&eacute;n trata el interesante tema acerca de la derivaci&oacute;n de los bordes 
resultantes de los l&iacute;mites de la frecuencia de sincronizaci&oacute;n horizontal.</P>

<HR>
<A HREF="XFree86-Config-COMO-6.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-4.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc5">Índice general</A>
</BODY>
</HTML>
