<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.6">
 <TITLE>C&Oacute;MO configurar los ajustes de v&iacute;deo en XFree86: Calculando tama&ntilde;os de imagen.</TITLE>
 <LINK HREF="XFree86-Config-COMO-9.html" REL=next>
 <LINK HREF="XFree86-Config-COMO-7.html" REL=previous>
 <LINK HREF="XFree86-Config-COMO.html#toc8" REL=contents>
</HEAD>
<BODY>
<A HREF="XFree86-Config-COMO-9.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-7.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc8">Índice general</A>
<HR>
<H2><A NAME="frame"></A> <A NAME="s8">8.</A> <A HREF="XFree86-Config-COMO.html#toc8">Calculando tama&ntilde;os de imagen.</A></H2>


<P>Atenci&oacute;n: este m&eacute;todo ha sido desarrollado para monitores multifrecuencia.
Probablemente funcione tambi&eacute;n en monitores con frecuencias fijas, pero no
hay una completa seguridad acerca de ello.</P>
<P>Comience dividiendo FRTV entre la mayor FSH disponible para conseguir una
longitud de imagen horizontal.</P>
<P>Por ejemplo: supongamos que usted tiene una SVGA Sigma Legend con una velocidad
de reloj de 65MHz, y su monitor tiene una frecuencia de barrido horizontal de
55KHz. El valor de (FRTV / FSH) es entonces 1181 (65MHz = 65000KHz; 
65000/55 = 1181). </P>
<P>Ahora un primer truco de magia oscura. Necesita redondear esta cifra al m&uacute;ltiplo
de 8 m&aacute;s cercano.  Esto tiene que ver con los controladores hardware VGA utilizados
por las tarjetas SVGA y S3; utiliza un registro de 8 bits. Otras tarjetas como la
ATI 8514/A no tienen este requerimiento, pero no estamos seguros y esa correcci&oacute;n
puede ser err&oacute;nea. Por lo tanto, disminuimos la longitud de imagen horizontal &uacute;til
redondeando hacia el valor de 1176.</P>
<P>Esta cifra (FRTV / FSH redondado a un m&uacute;ltiplo de 8) es la m&iacute;nima LHI que puede
utilizar.  Puede conseguir mayores LHI (y, posiblemente, m&aacute;s puntos horizontales
en la pantalla) ajustando el pulso de sincronizaci&oacute;n para producir una FSH m&aacute;s
baja.  Pero esto se ver&aacute; penalizado con un parpadeo m&aacute;s lento y visible.</P>
<P>Como regla general, el 80% de la longitud horizontal de imagen est&aacute; disponible 
para la resoluci&oacute;n horizontal, la parte visible de la l&iacute;nea de barrido horizontal
(esto da, aproximadamente, para los bordes y el tiempo de retorno de barrido -- 
esto es, el tiempo que necesita el rayo para moverse desde el borde derecho hasta
el borde izquierdo de la siguiente l&iacute;nea de barrido).  En este ejemplo, son
944 pulsos.</P>
<P>Ahora bien, para conseguir la raz&oacute;n de pantalla normal de 4:3, ajuste su 
resoluci&oacute;n vertical a 3/4 partes de la resoluci&oacute;n horizontal que ha calculado.
Para este ejemplo, son 708 pulsos.  Para conseguir su LVI real, multipl&iacute;quelo
por 1,05 para conseguir 743 pulsos.</P>
<P>El 4:3 no es t&eacute;cnicamente m&aacute;gico; nada le impide utilizar otras razones
de proporci&oacute;n alto-ancho que no guarden proporci&oacute;n &aacute;urea si eso le permite
aprovechar mejor su pantalla.  Esa proporci&oacute;n se alcanza calculando la 
altura y anchura de imagen a partir de la diagonal conveniente, simplemente
multiplicando la diagonal por 0,8 para conseguir la anchura y por 0,6 para
conseguir la altura.</P>
<P>Por lo tanto, LHI=1176 y LVI=743.  Dividiendo 65MHz entre este producto nos
da una saludable y fant&aacute;stica tasa de refresco de 74,4Hz. Es incluso mejor
que el est&aacute;ndar VESA.  Y se obtiene una resoluci&oacute;n 944x708, mejor que la
de 800x600 que se esperaba. No est&aacute; nada mal.</P>
<P>Se puede todav&iacute;a mejorar la tasa de refresco hasta casi 76 Hz, utilizando el
hecho de que los monitores pueden sincronizar horizontalmente a 2KHz o m&aacute;s de
su frecuencia nominal, y disminuyendo la LVI un poco (esto es, tomando menos del
75% de 944 en el ejemplo anterior).  Pero antes de intentar esta maniobra de
"forzado", si la hace, <EM>aseg&uacute;rese</EM> de que el ca&ntilde;&oacute;n de electrones de su
monitor puede llegar a sincronizar a 76Hz en vertical.  (el popular NEC 4D, por
ejemplo, no puede.  S&oacute;lo llega hasta 75 Hz de FSV). (Vea la secci&oacute;n 
<A HREF="XFree86-Config-COMO-11.html#overd">Forzando su monitor</A> para m&aacute;s informaci&oacute;n acerca de esta
materia. )</P>
<P>Ya est&aacute;, y la mayor&iacute;a de cosas son s&oacute;lo operaciones aritm&eacute;ticas simples y b&aacute;sicas
acerca de dispositivos de raster. ¡Casi nada de magia negra!.</P>

<HR>
<A HREF="XFree86-Config-COMO-9.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-7.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc8">Índice general</A>
</BODY>
</HTML>
