<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.6">
 <TITLE>C&Oacute;MO configurar los ajustes de v&iacute;deo en XFree86: Utilizando modos entrelazados.</TITLE>
 <LINK HREF="XFree86-Config-COMO-13.html" REL=next>
 <LINK HREF="XFree86-Config-COMO-11.html" REL=previous>
 <LINK HREF="XFree86-Config-COMO.html#toc12" REL=contents>
</HEAD>
<BODY>
<A HREF="XFree86-Config-COMO-13.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-11.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc12">Índice general</A>
<HR>
<H2><A NAME="inter"></A> <A NAME="s12">12.</A> <A HREF="XFree86-Config-COMO.html#toc12">Utilizando modos entrelazados.</A></H2>


<P>(Esta secci&oacute;n se debe a la colaboraci&oacute;n de David Kastrup
<CODE>
<A HREF="mailto:dak@pool.informatik.rwth-aachen.de">dak@poll.informatik.rwth-aachen.de</A></CODE>). </P>
<P>A una frecuencia fija de pixel, una pantalla entrelazada va a tener
considerablemente menos parpaedo que una pantalla no entrelazada, si
la circuiter&iacute;a vertical de su monitor es capaz de dar soporte a ese
modo de manera estable. Es a causa de que estos modos entrelazados se
inventaron en primer lugar.</P>
<P>Los modos entrelazados alcanzaron su mala reputaci&oacute;n debido a que son 
inferiores que los modos no entrelazados a la misma frecuencia vertical
FSV (que es la dada normalmente en los anuncios). Pero son definitivamente
superiores a la misma frecuencia de barrido horizontal, y ah&iacute; es donde
radican los l&iacute;mites decisivos de su monitor/tarjeta gr&aacute;fica.</P>
<P>A una <EM>tasa de refresco</EM> fija (o a media tasa de imagen, o FSV)
la visualizaci&oacute;n entrelazada parpadear&aacute; m&aacute;s: una representaci&oacute;n 
entrelazada a 90Hz ser&aacute; inferior a otra representaci&oacute;n no entrelazada
a 90Hz. Sin embargo, s&oacute;lo necesitar&aacute; la mitad de ancho de banda de
video y la mitad de frecuencia de sincronizaci&oacute;n horizontal. Si 
se compara con un modo no entrelazado que tenga la misma frecuencia
de p&iacute;xel y las mismas tasas de barrido, ser&aacute; muy superior: no entrelazado
a 45Hz es intolerable. He trabajado durante a&ntilde;os con mi
Multisync 3D (a 1024x768) con modo entrelazado a 90Hz y estoy muy
satisfecho. Y creo que necesitar&iacute;a al menos una representaci&oacute;n a 
70Hz no entrelazada para conseguir un &iacute;ndice de comodidad similar.</P>
<P>Sin embargo, debe vigilar algunos puntos: utilice modos entrelazados
s&oacute;lo con altas resoluciones, de modo que las l&iacute;neas iluminadas
alternativamente est&eacute;n cercanas unas de otras. Puede desear jugar
con las anchuras y posiciones de los pulsos de sincronizaci&oacute;n
para conseguir las posiciones de l&iacute;nea m&aacute;s estables. Si hay l&iacute;neas
alternadas brillantes y oscuras, el entrelazado har&aacute; que 
<EM>salten</EM> unas en otras. Poseo una aplicaci&oacute;n que escoge un
fondo de ese tipo para los men&uacute;s (XCept) (afortunadamente ninguna
otra aplicaci&oacute;n que conozca hace lo mismo). Cambio a 800x600 para
utilizar XCept porque s&iacute; termina haciendo da&ntilde;o a los ojos.</P>
<P>Por la misma raz&oacute;n, utilice al menos fuentes 100dpi, u otras fuentes
en las que los trazos horizontales sean, al menos, de dos puntos de
ancho (de todos modos, son las &uacute;nicas que pueden escogerse para altas
resoluciones de manera sensata).</P>
<P>Y por supuesto, nunca utilice un modo entrelazado cuando su hardware
podr&iacute;a dar soporte a un modo no entrelazado con la misma tasa de
refresco.</P>
<P>Si, sin embargo, encuentra que para alguna resoluci&oacute;n usted 
est&aacute; llevando tanto al monitor como a la tarjeta de video a sus 
l&iacute;mites m&aacute;s altos, y consiguiendo una visi&oacute;n con un parpadeo 
insatisfactorio o borroso (ancho de banda excedido), puede intentar
utilizar la misma resoluci&oacute;n con un modo entrelazado. Por supuesto
esto no es aplicable si la FSV de su monitor est&aacute; ya cerca de sus
l&iacute;mites.</P>
<P>Dise&ntilde;ar modos entrelazados es f&aacute;cil: h&aacute;galo como un modo no 
entrelazado. S&oacute;lo deben hacerse dos consideraciones: usted
necesita un n&uacute;mero total impar de l&iacute;neas verticales (el &uacute;ltimo
n&uacute;mero en la l&iacute;nea de modo), y despu&eacute;s de especificar la opci&oacute;n
"interlace", la FSV real de su monitor se duplica. Su monitor necesita
ser capaz de proporcionar una tasa de 90Hz si el modo especificado, ignorando
la etiqueta "Interlace", fuera de 45Hz.</P>
<P>Como ejemplo, aqu&iacute; est&aacute; mi l&iacute;nea de modo para 1024x768 entrelazado:
mi Multisync 3D es capaz de llegar a 90Hz vertical y 38KHz horizontal.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
ModeLine "1024x768" 45 1024 1048 1208 1248 768 768 776 807 Interlace
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Ambos l&iacute;mites est&aacute;n roz&aacute;ndose en este modo. Especificar el mismo modo,
pero sin la etiqueta "Interlace", todav&iacute;a est&aacute; casi al l&iacute;mite de la
capacidad horizontal del monitor (y hablando estrictamente, un poco
por debajo del l&iacute;mite m&iacute;nimo de tasa vertical), pero produce un
parpadeo de imagen insoportable.</P>
<P>Reglas b&aacute;sicas de dise&ntilde;o: si tiene dise&ntilde;ado un modo con menos de la
mitad de la capacidad vertical de su monitor, haga impar el n&uacute;mero total
de l&iacute;neas y a&ntilde;ada la opci&oacute;n "Interlace". La calidad de imagen se ver&aacute;
completamente mejorada en la mayor parte de los casos.</P>
<P>Si tiene un modo no entrelazado que casi agota las especificaciones de
su monitor en el que la FSV est&aacute; un 30% o m&aacute;s por debajo del m&aacute;ximo de
su monitor, el dise&ntilde;ar un modo entrelazado (posiblemente con una 
resoluci&oacute;n algo mayor) podr&iacute;a conseguir resultados superiores, pero
no puedo prometerlo.</P>

<HR>
<A HREF="XFree86-Config-COMO-13.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-11.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc12">Índice general</A>
</BODY>
</HTML>
