<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.6">
 <TITLE>C&Oacute;MO configurar los ajustes de v&iacute;deo en XFree86: Regateos al configurar su sistema.</TITLE>
 <LINK HREF="XFree86-Config-COMO-7.html" REL=next>
 <LINK HREF="XFree86-Config-COMO-5.html" REL=previous>
 <LINK HREF="XFree86-Config-COMO.html#toc6" REL=contents>
</HEAD>
<BODY>
<A HREF="XFree86-Config-COMO-7.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-5.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc6">Índice general</A>
<HR>
<H2><A NAME="trade"></A> <A NAME="s6">6.</A> <A HREF="XFree86-Config-COMO.html#toc6">Regateos al configurar su sistema.</A></H2>


<P>Otra manera de ver la f&oacute;rmula que utilizamos arriba es</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        FRTV = TR * LIH * LIV
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Esto es, su velocidad de reloj es fija.  Puede utilizar esos puntos por 
segundo para comparar tanto tasa de refresco, resoluci&oacute;n horizontal y
resoluci&oacute;n vertical.  Si uno de estos aumenta, al menos uno de los otros
dos debe disminuir.</P>
<P>F&iacute;jese, sin embargo, que su velocidad de refresco no puede ser mayor que
la m&aacute;xima velocidad de refresco de su monitor.  Esto es, para un monitor
dado a una frecuencia de reloj determinada, existe un producto m&iacute;nimo de
longitudes de imagen por debajo del cual usted no puede forzarlo.</P>
<P>Al escoger sus ajustes, recuerde: si establece TR demasiado bajo, ser&aacute; 
invadido por el parpadeo de la pantalla.</P>
<P>Probablemente no quiera poner la tasa de refresco por debajo de 50-60Hz. Esta
es la velocidad de parpadeo de los tubos fluorescentes; si usted es sensible
a estos, deber&aacute; llegar a los 72Hz, el est&aacute;ndar ergon&oacute;mico de VESA.</P>
<P>El parpadeo fatiga muchos los ojos, aunque los ojos humanos son muy adaptativos
y la tolerancia de la gente puede variar mucho.  Si usted observa su monitor 
con un &aacute;ngulo de 48º, est&aacute; utilizando un fondo oscuro y un buen color que 
contraste como primer plano, ajusta el brillo a un nivel medio o bajo, 
*podr&iacute;a* sentirse c&oacute;modo con solo 45Hz.</P>
<P>La prueba de fuego es &eacute;sta: abra un xterm con fondo blanco y texto negro 
utilizando <CODE>xterm -bg white -fg black</CODE> y h&aacute;galo tan grande que cubra
todo el &aacute;rea visible. Ponga su monitor a 3/4 de su brillo m&aacute;ximo, y gire su
cara mirando lejos del monitor.  Intente observar a su monitor de lado (utilizando
las c&eacute;lulas de visi&oacute;n perif&eacute;rica de la retina, mucho m&aacute;s sensibles). Si no siente
ning&uacute;n parpadeo es que la tasa de refresco es buena para usted.  Si no, ser&iacute;a 
mejor que configurara una tasa de refresco mayor, ya que ese parpadeo 
medio invisible fatigar&aacute; sus ojos y le causar&aacute; dolores de cabeza, incluso si la
pantala parece perfecta a una visi&oacute;n normal.</P>
<P>Para modos entrelazados, la cantidad de parpadeo depende de m&aacute;s factores como la
resoluci&oacute;n vertical y los contenidos de la pantalla en cada instante.  Experimente.
No desear&aacute; utilizar menos de 85Hz de tasa de media imagen.</P>
<P>Supongamos que ha escogido una velocidad aceptable m&iacute;nima de refresco.  Para
escoger su LHI y LVI a&uacute;n le quedar&aacute; bastante margen de maniobra.</P>

<HR>
<A HREF="XFree86-Config-COMO-7.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-5.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc6">Índice general</A>
</BODY>
</HTML>
