<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.6">
 <TITLE>C&Oacute;MO configurar los ajustes de v&iacute;deo en XFree86: Preguntas y Respuestas.</TITLE>
 <LINK HREF="XFree86-Config-COMO-14.html" REL=next>
 <LINK HREF="XFree86-Config-COMO-12.html" REL=previous>
 <LINK HREF="XFree86-Config-COMO.html#toc13" REL=contents>
</HEAD>
<BODY>
<A HREF="XFree86-Config-COMO-14.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-12.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc13">Índice general</A>
<HR>
<H2><A NAME="answe"></A> <A NAME="s13">13.</A> <A HREF="XFree86-Config-COMO.html#toc13">Preguntas y Respuestas.</A></H2>


<P>P. El ejemplo que se da en este documento no es un tama&ntilde;o de 
pantalla est&aacute;ndar. ¿Puedo utilizarlo?.</P>
<P>R. ¿Por qu&eacute; no?. No hay NINGUNA raz&oacute;n por la que usted deba utilizar 640x480,
800x600, o incluso 1024x768.  Los servidores XFree86 le permiten configurar su
hardware con total libertad. Suele llevar dos o tres intentos el conseguir la
configuraci&oacute;n correcta.  A lo que se debe intentar llegar es a una alta tasa
de refresco con un &aacute;rea de visi&oacute;n razonable, no a una alta resoluci&oacute;n bajo el 
precio de un parpadeo que ponga los ojos rojos.</P>
<P>P. ¿Es esta la &uacute;nica resoluci&oacute;n dadas la frecuencia de p&iacute;xel de 65MHz y
la FSH de 55KHz?.</P>
<P>R. ¡Claro que no!.  Desde aqu&iacute; animo a seguir el m&eacute;todo general y realizar algo
de ensayo-error para llegar a una configuraci&oacute;n que sea realmente de su agrado.
Experimentar con esto puede dar mucha diversi&oacute;n. La mayor parte de las configuraciones
s&oacute;lo dan una modesta configuraci&oacute;n de video, pero en la pr&aacute;ctica un monitor multifrecuencia
moderno no puede da&ntilde;arse f&aacute;cilmente. Aseg&uacute;rese, sin embargo, de que su monitor puede
dar soporte a las tasas de imagen de su modo antes de utilizarlo durante largos
periodos de tiempo.</P>
<P>Cuidado con los monitores de frecuencia fija.  Este tipo de trasteo puede
da&ntilde;arlos de manera r&aacute;pida. Aseg&uacute;rese de que utiliza tasas de refresco v&aacute;lidas
para <EM>cada</EM> experimento que realice.</P>
<P>P. Ha mencionado s&oacute;lo dos resoluciones est&aacute;ndar. En Xconfig, hay muchas 
resoluciones est&aacute;ndar disponibles. ¿Puede decirme si hay alg&uacute;n truco para 
apa&ntilde;ar configuraciones?.</P>
<P>R. ¡Claro!.  Tome, por ejemplo, el "est&aacute;ndar" 640x480 listado en el
Xconfig.  Utiliza una frecuencia de p&iacute;xel de 25Mhz, una LIH de 800 y una LIV
de 525, por lo que la tasa de refresco ronda los 59,5Hz. No est&aacute; mal.  Pero
28Mhz es una frecuencia de p&iacute;xel que suele estar disponible para muchas 
tarjetas SVGA.  Si la utilizamos para llevar un 640x480, siguiendo el 
procedimiento comentado m&aacute;s arriba, llegar&iacute;amos a longitudes de imagen de
812 (redondeado a 808) y 505.  Ahora la tasa de refresco ha aumentado hasta
68Hz, una mejora importante sobre el modo est&aacute;ndar.</P>
<P>P. ¿Puede resumir lo que ha comentado hasta ahora?.</P>
<P>R. En pocas palabras: </P>
<P>
<OL>
<LI>para cualquier frecuencia de p&iacute;xel fija, aumentar la resoluci&oacute;n m&aacute;xima 
disminuye la tasa de refresco y esto introduce m&aacute;s parpadeo.</LI>
<LI>si desea mayor resoluci&oacute;n y su monitor es capaz de mostrarla, intente
conseguir una tarjeta SVGA que proporcione una frecuencia de p&iacute;xel (FRTV)
concordante. Cuanto m&aacute;s alta sea, mejor.</LI>
</OL>
</P>

<HR>
<A HREF="XFree86-Config-COMO-14.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-12.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc13">Índice general</A>
</BODY>
</HTML>
