<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.6">
 <TITLE>C&Oacute;MO configurar los ajustes de v&iacute;deo en XFree86: Resumiendo.</TITLE>
 <LINK HREF="XFree86-Config-COMO-11.html" REL=next>
 <LINK HREF="XFree86-Config-COMO-9.html" REL=previous>
 <LINK HREF="XFree86-Config-COMO.html#toc10" REL=contents>
</HEAD>
<BODY>
<A HREF="XFree86-Config-COMO-11.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-9.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc10">Índice general</A>
<HR>
<H2><A NAME="synth"></A> <A NAME="s10">10.</A> <A HREF="XFree86-Config-COMO.html#toc10">Resumiendo.</A></H2>


<P>La tabla de modos de v&iacute;deo del fichero Xconfig contiene l&iacute;neas de n&uacute;meros, siendo
cada l&iacute;nea una especificaci&oacute;n completa para un modo de operaci&oacute;n del servidor X.
Los campos se agrupan en cuatro secciones: la secci&oacute;n de nombre, la de frecuencia
de reloj, la secci&oacute;n horizontal y la vertical.</P>
<P>La secci&oacute;n de nombre contiene un campo, el nombre del modo de v&iacute;deo especificado
por el resto de la l&iacute;nea.  Este nombre es el mencionado en los la l&iacute;nea "Modes"
de la secci&oacute;n de ajuste del controlador de gr&aacute;ficos del fichero Xconfig.  El
campo de nombre puede omitirse si el nombre de una l&iacute;nea anterior es el mismo 
que el de la l&iacute;nea actual.</P>
<P>La secci&oacute;n de frecuencia de reloj contiene s&oacute;lo el campo de frecuencia de reloj 
(lo que nosotros hemos llamado FRTV) de la l&iacute;nea de modo de v&iacute;deo.  El n&uacute;mero de
este campo especifica qu&eacute; frecuencia de reloj fue utilizada para generar los 
n&uacute;meros de las secciones posteriores.</P>
<P>La secci&oacute;n horizontal consta de cuatro campos que especifican c&oacute;mo debe
generarse cada l&iacute;nea horizontal de la imagen.  El primer campo de la secci&oacute;n
contiene el n&uacute;mero de puntos por l&iacute;nea que se iluminar&aacute;n para formar una imagen
(lo que llamamos RH).  El segundo campo de la secci&oacute;n (SH1) indica en qu&eacute; punto
comienza el pulso de sincronizaci&oacute;n horizontal.  El tercer campo (SH2) indica en
qu&eacute; punto termina el pulso de sincronizaci&oacute;n horizontal.  El cuarto campo 
especifica la longitud total de imagen horizontal (LIH).</P>
<P>La secci&oacute;n vertical tambi&eacute;n contiene cuatro campos. El primero contiene el n&uacute;mero
de l&iacute;neas visibles que aparecer&aacute;n en la pantalla (RV).  El segundo campo (SV1)
indica el n&uacute;mero de l&iacute;nea en el que comienza el pulso de sincronizaci&oacute;n vertical.
El tercer campo (SV2) especifica el n&uacute;mero de l&iacute;nea en el que finaliza el pulso 
de sincronizaci&oacute;n vertical.  El cuarto campo contiene la longitud total de 
imagen vertical (LIV).</P>
<P>Ejemplo: 
<BLOCKQUOTE><CODE>
<PRE>
     #Nombremodo  reloj   ajuste horizontales   ajustes verticales

     "752x564"     40      752 784  944 1088     564 567 569 611
                     44.5     752 792  976 1240     564 567 570 600
</PRE>
</CODE></BLOCKQUOTE>

(Nota: X11R5 no da soporte a frecuencias de reloj fraccionales)</P>
<P>Para Xconfig, todos los n&uacute;meros reci&eacute;n mencionados - el n&uacute;mero de puntos 
iluminados en cada l&iacute;nea, el n&uacute;mero de puntos que separan los puntos iluminados
del comienzo del pulso de sincronizaci&oacute;n, el n&uacute;mero de puntos que representa la
duraci&oacute;n del pulso, y el n&uacute;mero de puntos tras el final del pulso de sincronizaci&oacute;n - 
se van incrementando para producir el n&uacute;mero de puntos por l&iacute;nea.  El n&uacute;mero 
de puntos horizontales debe ser siempre divisible entre ocho.</P>
<P>Ejemplo de n&uacute;meros horizontales: 800 864 1024 1088</P>
<P>Esta l&iacute;nea de ejemplo tiene el n&uacute;mero de puntos iluminados (800) seguido por el
n&uacute;mero de punto en el que comienza el pulso de sincronizaci&oacute;n (864), seguido por
el n&uacute;mero de punto en el que termina (1024), seguido por el n&uacute;mero del &uacute;ltimo
punto de la l&iacute;nea horizontal (1088).</P>
<P>F&iacute;jese de nuevo en que todos los n&uacute;meros horizontales (800, 864, 1024 y 1088) son
divisibles entre 8. Esto no es requerido por los n&uacute;meros verticales.</P>
<P>El n&uacute;mero de l&iacute;neas desde la parte superior de la pantalla hasta la inferior forma
la imagen. La se&ntilde;al de tiempo b&aacute;sica para una imagen es la l&iacute;nea.  Una imagen 
estar&aacute; formada por un n&uacute;mero de l&iacute;neas.  Despu&eacute;s de que la &uacute;ltima l&iacute;nea iluminada
se haya mostrado, se produce un retardo de un n&uacute;mero de l&iacute;neas antes de que se 
genere un pulso vertical de sincronizaci&oacute;n.  Entonces el pulso de sincronizaci&oacute;n
durar&aacute; unas pocas l&iacute;neas, y finalmente se generar&aacute; el retardo requerido tras el 
pulso: las &uacute;ltimas l&iacute;neas de la imagen.  Los n&uacute;meros que especifican este modo
de funcionamiento se introducen de una manera similar a la del siguiente ejemplo.</P>
<P>Ejemlo de n&uacute;meros verticales: 600 603 609 630</P>
<P>Este ejemplo indica que hay 600 l&iacute;neas visibles en la pantalla, que el pulso 
vertical de sincronizaci&oacute;n comienza en la l&iacute;nea n&uacute;mero 603 y acaba en la 609, y
que se utiliza un total de 630 l&iacute;neas.</P>
<P>F&iacute;jese en que los n&uacute;meros verticales no tienen por qu&eacute; ser divisibles entre 8.</P>
<P>Volvamos al ejemplo con el que hemos estado trabajando.  Seg&uacute;n se ha mencionado
arriba, todo lo que tenemos que hacer de ahora en adelante es escribir nuestros
resultados en Xconfig tal y como aqu&iacute; se expone:
<BLOCKQUOTE><CODE>
<PRE>
&lt;nombre>   FRTV     RH  SH1 SH2   LIH   RV  SV1 SV2 LIV
</PRE>
</CODE></BLOCKQUOTE>

donde CH1 es la se&ntilde;al de comienzo del pulso de sincronizaci&oacute;n horizontal y SH2
la se&ntilde;al de su finalizaci&oacute;n; de manera similar, SV1 es la l&iacute;nea de comienzo
del pulso de sincronizaci&oacute;n vertical y SV2 la l&iacute;nea de su finalizaci&oacute;n.
<BLOCKQUOTE><CODE>
<PRE>
#Nombre modo  reloj   ajuste horizontales   ajustes verticales  opciones
        936x702  65      936 968 1200 1232     702 702 710 737
</PRE>
</CODE></BLOCKQUOTE>

No se necesita ninguna opci&oacute;n especial; este es un modo no entrelazado. Ahora
se puede decir que hemos acabado.</P>

<HR>
<A HREF="XFree86-Config-COMO-11.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-9.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc10">Índice general</A>
</BODY>
</HTML>
