<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.6">
 <TITLE>C&Oacute;MO configurar los ajustes de v&iacute;deo en XFree86: C&oacute;mo funcionan las pantallas de v&iacute;deo.</TITLE>
 <LINK HREF="XFree86-Config-COMO-4.html" REL=next>
 <LINK HREF="XFree86-Config-COMO-2.html" REL=previous>
 <LINK HREF="XFree86-Config-COMO.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="XFree86-Config-COMO-4.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-2.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc3">Índice general</A>
<HR>
<H2><A NAME="video"></A> <A NAME="s3">3.</A> <A HREF="XFree86-Config-COMO.html#toc3">C&oacute;mo funcionan las pantallas de v&iacute;deo.</A></H2>


<P>Saber c&oacute;mo funciona una pantalla es esencial para comprender
qu&eacute; n&uacute;meros colocar en los variados campos del fichero Xconfig. Esos 
valores son utilizados por el servidor XFree86 para controlar la pantalla
a bajo nivel.</P>
<P>La pantalla genera una imagen a partir de una serie de puntos.  Los puntos est&aacute;n
colocados de izquierda a derecha para formar l&iacute;neas.  Las l&iacute;neas est&aacute;n colocadas
de arriba a abajo para formar la imagen.  Los puntos emiten luz cuando son 
impactados por un rayo de electrones dentro de la pantala. Para hacer que el
rayo choque con cada punto durante un mismo periodo de tiempo, &eacute;ste se encuentra
continuamente desplaz&aacute;ndose por la pantalla seg&uacute;n un patr&oacute;n constante.</P>
<P>Este patr&oacute;n comienza en la esquina superior izquierda de la pantalla, 
cruza de la pantalla hacia la derecha en l&iacute;nea recta, y se detiene 
temporalmente en la parte derecha de la pantalla.  Entonces el rayo 
se coloca de nuevo en la parte izquierda de la pantalla, pero una 
l&iacute;nea m&aacute;s abajo.  La nueva l&iacute;nea es barrida de izquierda a derecha 
justo como se hizo en la primera. Este patr&oacute;n de movimiento se repite
hasta que la &uacute;ltima l&iacute;nea de la pantalla se ha barrido. Entonces, el rayo
se mueve desde la esquina inferior derecha hasta la superior izquierda, 
inici&aacute;ndose el proceso de nuevo.</P>
<P>Hay una variaci&oacute;n de este esquema que es conocida como entrelazado:
consiste en barrer s&oacute;lo las l&iacute;neas pares el primer recorrido de pantalla, y 
las impares durante el segundo.</P>
<P>Comenzar el rayo en la parte superior de la pantalla se conoce como el comienzo
de una imagen. La imagen termina cuando el rayo alcanza de nuevo la esquina 
superior izquierda al provenir de la esquina inferior derecha de la pantalla.
Una imagen se compone de todas las l&iacute;neas que el rayo traz&oacute; desde la parte
superior de la pantalla hasta la inferior.</P>
<P>Si el rayo de electrones estuviera activado todo el tiempo que est&aacute; barriendo
la imagen, todos los puntos de la pantalla se iluminar&iacute;an. La pantalla no tendr&iacute;a
borde negro. En los bordes la imagen se distorsionar&iacute;a a causa de que el rayo es
dif&iacute;cil de controlar ah&iacute;.  Para reducir la distorsi&oacute;n, los puntos que hay cerca
de los bordes de la pantalla no son iluminados por el rayo a&uacute;n cuando el rayo 
puede apuntarlos.  El area visible de la pantalla se reduce de esta manera.</P>
<P>Otra cosa importante que debe comprenderse es qu&eacute; es del rayo cuando no se
est&aacute; dibujando ning&uacute;n punto en el &aacute;rea visible.  El tiempo que en el que el
rayo dibujar&iacute;a los bordes laterales de la pantalla se utiliza para hacer volver
al rayo desde el borde derecho al izquierdo y para mover el rayo a la primera
l&iacute;nea.  El tiempo en el que el rayo deber&iacute;a estar iluminando los bordes superior
e inferior de la pantalla se utilizan para mover el rayo desde la esquina inferior
derecha de la pantalla a la esquina superior derecha.</P>
<P>Las tarjetas adaptadoras generan las se&ntilde;ales que hacen que la pantalla enfoque
el rayo de electrones a cada punto para generar una imagen.  La tarjeta tambi&eacute;n 
controla cu&aacute;ndo la pantalla mueve el rayo desde la parte derecha a la izquierda
bajando una l&iacute;nea generando una se&ntilde;al denominada pulso de sincronizaci&oacute;n (o de
refresco) horizontal (en ingl&eacute;s, horizontal sync pulse). Un pulso de sincronizaci&oacute;n 
horizontal ocurre al final de cada l&iacute;nea.  El adaptador tambi&eacute;n genera un 
pulso de sincronizaci&oacute;n (o de refresco) vertical que hace a la pantalla mover el rayo 
a la esquina superior izquierda. Cerca del final de cada imagen se genera 
un pulso de sincronizaci&oacute;n vertical.</P>
<P>El monitor requiere que haya cortos periodos de tiempo tanto antes como despu&eacute;s
de los pulsos de sincronizaci&oacute;n vertical y horizontal para que la posici&oacute;n del rayo de
electrones pueda estabilizarse. Si el rayo no puede estabilizarse, la imagen no
permanecer&aacute; en su sitio.</P>
<P>En una secci&oacute;n posterior, volveremos a estas bases con definiciones, f&oacute;rmulas y
ejemplos para ayudarle a utilizarlas.</P>

<HR>
<A HREF="XFree86-Config-COMO-4.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-2.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc3">Índice general</A>
</BODY>
</HTML>
