<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.6">
 <TITLE>C&Oacute;MO configurar los ajustes de v&iacute;deo en XFree86: Cosas b&aacute;sicas que ha de saber acerca de su pantalla y adaptador.</TITLE>
 <LINK HREF="XFree86-Config-COMO-5.html" REL=next>
 <LINK HREF="XFree86-Config-COMO-3.html" REL=previous>
 <LINK HREF="XFree86-Config-COMO.html#toc4" REL=contents>
</HEAD>
<BODY>
<A HREF="XFree86-Config-COMO-5.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-3.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc4">Índice general</A>
<HR>
<H2><A NAME="basic"></A> <A NAME="s4">4.</A> <A HREF="XFree86-Config-COMO.html#toc4">Cosas b&aacute;sicas que ha de saber acerca de su pantalla y adaptador.</A></H2>


<P>Hay algunas cosas fundamentales que necesita saber antes de trastear con una
entrada de Xconfig.  Estas son:</P>
<P>
<UL>
<LI>las opciones de frecuencia de sincronizaci&oacute;n horizontal y vertical de su monitor;</LI>
<LI>la frecuencia de su adaptador de v&iacute;deo ("dot clock");</LI>
<LI>el ancho de banda de su monitor.</LI>
</UL>

Las frecuencias de sincronizaci&oacute;n del monitor: </P>
<P>La frecuencia de sincronizaci&oacute;n horizontal es s&oacute;lo el n&uacute;mero de veces
por segundo que el monitor puede escribir una l&iacute;nea horizontal completa; es el
dato m&aacute;s importante de su monitor.  La frecuencia vertical de sincronizaci&oacute;n es
el n&uacute;mero de veces por segundo que el monitor puede cruzar su rayo verticalmente.  </P>
<P>Las frecuencias de sincronizaci&oacute;n suelen estar listadas en la p&aacute;gina de
especificaciones de su manual de monitor.  La frecuencia vertical de
sincronizaci&oacute;n suele estar normalmente medida en Hz (ciclos por segundo),
la horizontal en KHz (kilociclos por segundo).  Los rangos normales est&aacute;n 
entre 50 y 150Hz vertical, y entre 31 y 135KHz horizontal.</P>
<P>Si tiene un monitor multifrecuencia (multisync), estas frecuencias suelen 
darse como rangos. Algunos monitores, especialmente los de gama baja, tienen
m&uacute;ltiples frecuencias fijadas. Pueden tambi&eacute;n ser configurados, pero sus opciones
estar&aacute;n severamente limitadas por las caracter&iacute;sticas de serie del monitor.
Escoja el par m&aacute;s alto de frecuencias para mayor resoluci&oacute;n. Y tenga cuidado 
--- intentar fijar un monitor de frecuencias fijas a una velocidad mayor de
para la que est&aacute; dise&ntilde;ado puede da&ntilde;arlo f&aacute;cilmente.</P>
<P>Versiones anteriores de esta gu&iacute;a eran bastante atrevidas acerca de forzar
los monitores multifrecuencia, poni&eacute;ndolos m&aacute;s all&aacute; de su frecuencia vertical
nominal m&aacute;s alta para as&iacute; conseguir mayores prestaciones.  Ahora ya tenemos
algunas razones para ser algo m&aacute;s cautos al respecto; trataremos esto en la
secci&oacute;n 
<A HREF="XFree86-Config-COMO-11.html#overd">Forzando su Monitor</A>. </P>
<P>La frecuencia de la tarjeta controladora:</P>
<P>La p&aacute;gina de especificaciones del manual de su tarjeta de v&iacute;deo normalmente
le dar&aacute; el dot clock de su tarjeta (esto es, el n&uacute;mero total de
p&iacute;xeles por segundo que puede escribir en la pantalla).  Si usted no tiene
esta informaci&oacute;n, el servidor X se la proporcionar&aacute;. Incluso si X cuelga
su monitor, a&uacute;n emitir&aacute; una l&iacute;nea de reloj y otra informaci&oacute;n a la salida
est&aacute;ndar.  Si redirecciona esto a un fichero, esta informaci&oacute;n se guardar&aacute;
incluso si tiene que reinicializar el ordenador para hacer volver a la 
consola.  (Las &uacute;ltimas versiones de los servidores X dan soporte a la opci&oacute;n
--probeonly que imprime esta informaci&oacute;n y sale sin haber iniciado X ni 
haber cambiado el modo gr&aacute;fico.)</P>
<P>Su mensaje de inicializaci&oacute;n de X deber&iacute;a ser parecido a uno de los
siguientes ejemplos:</P>
<P>Si est&aacute; usando XFree86: </P>
<P>
<PRE>
Xconfig: /usr/X11R6/lib/X11/Xconfig
(**) stands for supplied, (--) stands for probed/default values
(**) Mouse: type: MouseMan, device: /dev/ttyS1, baudrate: 9600
Warning: The directory "/usr/andrew/X11fonts" does not exist.
         Entry deleted from font path.
(**) FontPath set to "/usr/lib/X11/fonts/misc/,/usr/lib/X11/fonts/75dpi/"
(--) S3: card type: 386/486 localbus
(--) S3: chipset:   924
                    ---
    Chipset -- este es el tipo exacto de chip; un nombre clave del 86C911

(--) S3: chipset driver: s3_generic
(--) S3: videoram:  1024k
                    -----
        Tama&ntilde;o del la memoria de v&iacute;deo para almacenar la imagen

(**) S3: clocks:  25.00  28.00  40.00   3.00  50.00  77.00  36.00  45.00
(**) S3: clocks:   0.00   0.00  79.00  31.00  94.00  65.00  75.00  71.00
                  ------------------------------------------------------
                           Posibles frecuencias de tarjeta en MHz

(--) S3: Maximum allowed dot-clock: 110MHz
                                    ------
                                 Ancho de Banda
(**) S3: Mode "1024x768": mode clock =  79.000, clock used =  79.000
(--) S3: Virtual resolution set to 1024x768
(--) S3: Using a banksize of 64k, line width of 1024
(--) S3: Pixmap cache:
(--) S3: Using 2 128-pixel 4 64-pixel and 8 32-pixel slots
(--) S3: Using 8 pages of 768x255 for font caching
</PRE>
</P>
<P>Si utiliza SGCS o X/Inside X: </P>
<P>
<PRE>
WGA: 86C911 (mem: 1024k clocks: 25 28 40 3 50 77 36 45 0 0 79 31 94 65 75 71)
---  ------       -----         --------------------------------------------
 |     |            |              Posibles frecuencias de tarjeta en MHz
 |     |            +-- Tama&ntilde;o de la memoria de v&iacute;deo para almacenar la imagen
 |     +-- Tipo de chip
 +-- Tipo de servidor
</PRE>
</P>
<P>Nota: haga esto con la m&aacute;quina sin carga (siempre y cuando sea posible). Ya que
X es una aplicaci&oacute;n, sus bucles de temporizaci&oacute;n pueden colisionar con la
actividad de disco, haciendo que los n&uacute;meros de arriba sean inexactos. Haga esto
bastantes veces y vigile los n&uacute;meros hasta su estabilizaci&oacute;n; si no lo consigue,
comience a matar procesos hasta que lo haga. Usuarios de SVr4: el proceso 
mousemgr es bastante proclive a liarlo todo.</P>
<P>Para evitar la inexactitud de la detecci&oacute;n, deber&iacute;a coger los tiempos de 
reloj y ponerlos en su fichero Xconfig como el valor de la propiedad Clocks ---
esto suprime el bucle de temporizaci&oacute;n y le da a X una lista exacta de los
valores de reloj con los que puede probar. Utilizando los datos del ejemplo
de arriba:</P>
<P>
<PRE>
wga
        Clocks  25 28 40 3 50 77 36 45 0 0 79 31 94 65 75 71
</PRE>
</P>
<P>En sistemas con una carga muy variable, esto puede ayudar a evitar fallos 
misteriosos en el arranque de X.  Es posible que X se inicie, consiguiendo sus
ajustes de manera err&oacute;nea debido a la carga del sistema, y no pueda ser capaz
de encontrar una frecuencia dot clock que se ajuste en su base de datos de 
configuraciones --- ¡o que encuentre una configuraci&oacute;n err&oacute;nea!.</P>

<H2><A NAME="ss4.1">4.1 El ancho de banda de v&iacute;deo del monitor.</A>
</H2>


<P>Si usted est&aacute; ejecutando XFree86, su servidor detectar&aacute; su tarjeta y le dir&aacute;
cu&aacute;l es su mayor dot clock disponible.</P>
<P>Si no, su mayor dot clock disponible ser&aacute;, aproximadamente, el ancho de
banda de v&iacute;deo del monitor.  Hay mucha elasticidad en este campo. Algunos 
monitores pueden funcionar como mucho al 30% de su ancho de banda nominal.
Los riesgos aqu&iacute; vienen de exceder la frecuencia m&aacute;xima de refresco vertical;
lo discutiremos con detalle m&aacute;s tarde.</P>
<P>Conocer el ancho de banda le permitir&aacute; realizar elecciones m&aacute;s inteligentes entre 
varias configuraciones posibles. Puede afectar a su calidad de visionado de la 
imagen (especialmente la agudeza de los detalles peque&ntilde;os).</P>
<P>El ancho de banda de su monitor deber&iacute;a estar incluido en la p&aacute;gina de
especificaciones de su manual. Si no, mire a la mayor resoluci&oacute;n de su monitor.
&Eacute;sta es una forma sencilla de averiguar, grosso modo, el ancho de banda 
de su monitor (y as&iacute; saber cu&aacute;l es el mayor dot clock que puede utilizar):</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        640x480                 25
        800x600                 36
        1024x768                65
        1024x768 interlaced     45
        1280x1024               110
        1600x1200               185
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Por cierto, no hay nada m&aacute;gico en esta tabla; estos n&uacute;meros son s&oacute;lo
los dot clocks m&aacute;s bajos para cada resoluci&oacute;n en los modos est&aacute;ndar de
la base de datos de XFree86 (excepto el &uacute;ltimo, que he hallado yo mismo).
El ancho de banda de su monitor puede en realidad ser mayor que el m&iacute;nimo
requerido para esta resoluci&oacute;n m&aacute;xima, por lo que no tema probar con un
dot clock unos pocos MHz superior.</P>
<P>Tambi&eacute;n sepa que el ancho de banda raramente se deduce de dot clocks menores
a 65MHz.  Con una tarjeta SVGA y con la mayor&iacute;a de monitores de alta resoluci&oacute;n,
usted puede conseguir cerca del l&iacute;mite del ancho de banda de su monitor.
Los siguientes son ejemplos: </P>

<P>
<BLOCKQUOTE><CODE>
<PRE>
        Brand                           Video Bandwidth
        ----------                      ---------------
        NEC 4D                          75Mhz
        Nano 907a                       50Mhz
        Nano 9080i                      60Mhz
        Mitsubishi HL6615               110Mhz
        Mitsubishi Diamond Scan         100Mhz
        IDEK MF-5117                    65Mhz
        IOCOMM Thinksync-17 CM-7126     136Mhz
        HP D1188A                       100Mhz
        Philips SC-17AS                 110Mhz
        Swan SW617                      85Mhz
        Viewsonic 21PS                  185Mhz
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Incluso los monitores de gama baja no tienen un ancho de banda terriblemente 
restringido a sus resoluciones.  El NEC Multisync II es un buen ejemplo --- no
puede mostrar ni siquiera 800x600 seg&uacute;n sus especificaciones.  S&oacute;lo puede mostrar
800x560.  Para tan bajas resoluciones no se necesitan altos dot clocks ni un 
gran ancho de banda; probablemente lo mejor que pueda seleccionar sea 32MHz o
36 MHz, ambos todav&iacute;a no muy lejos del ancho de banda indicado en el monitor
de 30 MHz.</P>
<P>Con estas frecuencias de muestra, la imagen de su pantalla no es tan aguda como
deber&iacute;a ser, pero definitivamente es de una calidad tolerable. Por supuesto que
ser&iacute;a mejor si el NEC Multisync II tuviera un ancho de banda de v&iacute;deo mayor que
36 MHz.  Pero esto no es cr&iacute;tico para funciones comunes tales como edici&oacute;n de
textos, en la que la diferencia no es tan grande para que cause una gran 
distorsi&oacute;n de imagen (sus ojos se dar&iacute;an cuenta enseguida si esto llegara a 
ocurrir).</P>

<H2><A NAME="ss4.2">4.2 Qu&eacute; controlan estos valores.</A>
</H2>


<P>Los rangos de frecuencia de sincronizaci&oacute;n de su monitor, junto con el dot clock
de su tarjeta de v&iacute;deo, determinan la mayor resoluci&oacute;n que puede emplear.  Pero
es el controlador software lo que puede limitar el potencial de su hardware. Una
combinaci&oacute;n de hardware superior sin un controlador de dispositivos eficiente es un
desperdicio de dinero.  Por otra parte, con un controlador de dispositivos vers&aacute;til,
pero con un hardware menos capaz, usted puede ensanchar el margen del hardware un
poquito.  Esta es la filosof&iacute;a de dise&ntilde;o de XFree86.</P>

<HR>
<A HREF="XFree86-Config-COMO-5.html">Página siguiente</A>
<A HREF="XFree86-Config-COMO-3.html">Página anterior</A>
<A HREF="XFree86-Config-COMO.html#toc4">Índice general</A>
</BODY>
</HTML>
