<HTML>
<HEAD>
<TITLE>Mini-COMO de Linux IP Masquerade, en ESPA&Ntilde;OL.: Otras caracter&iacute;sticas de IP Masquerade y soporte de programas. </TITLE>
</HEAD>
<BODY>
<A HREF="IP-Masquerade-Como-3.html">Anterior</A>
<A HREF="IP-Masquerade-Como-5.html">Siguiente</A>
<A HREF="IP-Masquerade-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Otras caracter&iacute;sticas de IP Masquerade y soporte de programas. </A></H2>



<H2><A NAME="problemas"></A> <A NAME="ss4.1">4.1 Problemas con IP Masquerade. </A> </H2>


<P>Algunos protocolos no funcionar&aacute;n adecuadamente con masquerading porque
presuponen cosas sobre n&uacute;meros de puerto; --o lo impiden datos cifrados en
sus cadenas de informaci&oacute;n sobre direcciones y puertos-- estos &uacute;ltimos
protocolos necesitan un proxy espec&iacute;fico en el c&oacute;digo masquerading para
que funcionen. </P>


<H2><A NAME="entradas"></A> <A NAME="ss4.2">4.2 Servicios de entrada. </A></H2>


<P>El Masquerading no puede manejar todos los servicios de entrada. Existen
formas de permitirlos, pero son completamente independientes de
masquerading, y son realmente parte de la pr&aacute;ctica est&aacute;ndar de
cortafuegos.</P>
<P>Si no requiere altos niveles de seguridad simplemente puede redireccionar
los puertos. Hay varias formas para hacer esto --Yo uso un programa
modificado llamado <CODE>redir</CODE> (espero que este disponible en sunsite y
r&eacute;plicas)--. Si desea tener alg&uacute;n nivel de autorizaci&oacute;n en conexiones
entrantes puede usar TCP wrappers o Xinetd sobre <CODE>redir</CODE> (0.7 o
superior) para permitir s&oacute;lo direcciones IP espec&iacute;ficas, o usar alguna otra
herramienta. <I>El TIS Firewall Toolkit</I> es un buen lugar para buscar
herramientas e informaci&oacute;n.</P>
<P>Se puede encontrar m&aacute;s detalles en <CODE>
<A HREF="http://ipmasq.home.ml.org">http://ipmasq.home.ml.org</A></CODE>.</P>


<H2><A NAME="soportados"></A> <A NAME="ss4.3">4.3 Programas cliente soportados y otras notas de configuraci&oacute;n. </A> </H2>


<P>La siguiente lista no ser&aacute; mantenida durante m&aacute;s tiempo. <BR>  Por favor,
rem&iacute;tase a <CODE>
<A HREF="http://masqapps.home.ml.org">http://masqapps.home.ml.org</A></CODE> para saber qu&eacute; aplicaciones
funcionan a trav&eacute;s de un servidor Linux con IP masquerading y a
<CODE>
<A HREF="http://ipmasq.home.ml.org/">http://ipmasq.home.ml.org/</A></CODE> para m&aacute;s detalles. </P>
<P>Generalmente, las aplicaciones que usan TCP y UDP deber&iacute;an de funcionar. 
Si tiene alguna sugerencia sobre aplicaciones que no son compatibles con
IP Masquerade, por favor env&iacute;eme correo electr&oacute;nico con el nombre del
cliente y una breve descripci&oacute;n. </P>

<H3>Clientes que funcionan</H3>


<P>Clientes Generales</P>
<P>
<DL>
<DT><B>HTTP</B><DD><P>todas las plataformas soportadas, navegadores web. </P>

<DT><B>POP &amp; SMTP</B><DD><P>todas las plataformas soportadas, clientes de
correo electr&oacute;nico. </P>

<DT><B>Telnet</B><DD><P>todas las plataformas soportadas, sesi&oacute;n remota. </P>

<DT><B>FTP</B><DD><P>todas las plataformas soportadas, con el m&oacute;dulo
<CODE>ip_masq_ftp.o</CODE> (no todos los servidores funcionan con ciertos
clientes; por ejemplo alg&uacute;n sitio puede no ser alcanzado usando
<CODE>ws_ftp32</CODE>, pero s&iacute; con Netscape) </P>

<DT><B>Archie</B><DD><P>todas las plataformas soportadas, buscador de archivos
(no todos los clientes archie son soportados).</P>

<DT><B>NNTP (USENET)</B><DD><P>todas las plataformas soportadas, cliente de
noticias USENET. </P>

<DT><B>VRML</B><DD><P>Windows (posiblemente soportado en todas las plataformas),
navegaci&oacute;n con realidad virtual.</P>

<DT><B>traceroute</B><DD><P>principalmente las plataformas basadas en UNIX,
algunas variantes pueden no funcionar.</P>

<DT><B>ping</B><DD><P>todas las plataformas, con el parche ICMP.</P>

<DT><B>todo lo basado en IRC</B><DD><P>todas las plataformas soportadas, con el
m&oacute;dulo <CODE>ip_masq_irc.o</CODE></P>

<DT><B>Clientes Gopher</B><DD><P>todas las plataformas soportadas.</P>

<DT><B>clientes WAIS</B><DD><P>todas las plataformas soportadas.</P>
</DL>
</P>
<P>Clientes Multimedia </P>
<P>
<DL>

<DT><B>Real Audio Player</B><DD><P>Windows, env&iacute;o de audio por red, con el m&oacute;dulo
<CODE>ip_masq_raudio</CODE> cargado.</P>

<DT><B>True Speech Player 1.1b</B><DD><P>Windows, env&iacute;o de audio por red. </P>

<DT><B>Internet Wave Player</B><DD><P>Windows, env&iacute;o de audio por red.</P>

<DT><B>Worlds Chat 0.9a</B><DD><P>Windows, programa Cliente-Servidor 3D de
conversaci&oacute;n.</P>

<DT><B>Alpha Worlds</B><DD><P>Windows, programa Cliente-Servidor 3D de conversaci&oacute;n.</P>

<DT><B>Internet Phone 3.2</B><DD><P>Windows, comunicaciones de audio de Igual-a-igual
(<I>Peer-to-peer</I>), la gente puede ponerse en contacto con Vd. si inicia
Vd. la conexi&oacute;n, pero no le pueden llamar.</P>

<DT><B>Powwow</B><DD><P>Windows, comunicaciones tipo <I>pizarra</I> de audio texto de
Igual-a-igual, la gente puede ponerse en contacto con Vd. si Vd. inicia la
llamada, pero ellos no pueden llamarle.</P>

<DT><B>CU-SeeMe</B><DD><P>todas las plataformas soportadas, con el m&oacute;dulo <CODE>cuseeme</CODE>
cargado, por favor mire en <CODE>
<A HREF="http://ipmasq.home.ml.org/">http://ipmasq.home.ml.org/</A></CODE> para los detalles.</P>

<DT><B>VDOLive</B><DD><P>Windows, con el parche <CODE>vdolive</CODE>. </P>
</DL>
</P>
<P>Nota: Algunos clientes como IPhone y Powwow pueden funcionar incluso si
Vd. no es el que inicia la llamada, si usa el paquete <CODE>ipautofw</CODE>
(mire la secci&oacute;n 
<A HREF="#ipautofw">ipautofw</A>)</P>
<P>Otros Clientes</P>
<P>
<DL>

<DT><B>NCSA Telnet 2.3.08</B><DD><P>DOS, un paquete que contiene telnet, ftp, ping,
etc. </P>

<DT><B>PC-anywhere para windows 2.0</B><DD><P>MS-Windows, control remoto de PCs sobre
TCP/IP, s&oacute;lo funciona si es cliente pero no servidor. </P>

<DT><B>Socket Watch</B><DD><P>usa ntp - protocolo de tiempo por red. </P>

<DT><B>Linux net-acct package</B><DD><P>Linux, paquete de administraci&oacute;n de cuentas de
red.</P>

</DL>
</P>

<H3>Clientes que NO funcionan</H3>

<P> </P>
<P>
<DL>

<DT><B>Intel Internet Phone Beta 2</B><DD><P>Conecta pero la voz viaja en una
direcci&oacute;n (sale) s&oacute;lo.</P>

<DT><B>Intel Streaming Media Viewer Beta 1</B><DD><P>No puede conectar con el
servidor.</P>

<DT><B>Netscape CoolTalk</B><DD><P>No puede conectar con el lado opuesto.</P>

<DT><B>talk, ntalk</B><DD><P>no funcionar&aacute;n - requieren que sea escrito un proxy en
el n&uacute;cleo. </P>

<DT><B>WebPhone</B><DD><P>No puede funcionar por el momento (asume direcciones no
v&aacute;lidas). </P>

<DT><B>X</B><DD><P>Sin probar, pero creo que no podr&aacute; funcionar a menos que alguien
construya un X proxy, el cual probablemente es un programa externo al
c&oacute;digo de masquerading. Una forma de hacer que esto funcione es usar un
<B>ssh</B> como el enlace y usar un X proxy interno ¡que haga funcionar
las cosas! </P>

</DL>
</P>

<H3>Plataformas/SO testeados como las OTRAS m&aacute;quinas.</H3>

<P> </P>
<P>
<UL>
<LI>Linux </LI>
<LI>Solaris</LI>
<LI>Windows 95 </LI>
<LI>Windows NT (ambos, workstation y server) </LI>
<LI>Windows para Trabajo En Grupo 3.11 (con el paquete TCP/IP) </LI>
<LI>Windows 3.1 (con el paquete Chameleon) </LI>
<LI>Novel 4.01 Server</LI>
<LI>OS/2 (incluido Warp v3) </LI>
<LI>Macintosh OS (con MacTCP u Open Transport) </LI>
<LI>DOS (con el paquete NCSA Telnet, el DOS Trumpet trabaja parcialmente)</LI>
<LI>Amiga (con AmiTCP o AS225-stack) </LI>
<LI>VAX Stations 3520 y 3100 con UCX (TCP/IP stack para VMS)</LI>
<LI>Alpha/AXP con Linux/Redhat</LI>
<LI>SCO Openserver (v3.2.4.2 y 5)</LI>
<LI>IBM RS/6000 con AIX</LI>
<LI>(¿Alguien lo ha intentado con otras plataformas?) </LI>
</UL>
</P>


<H2><A NAME="ipfwadm"></A> <A NAME="ss4.4">4.4 Administraci&oacute;n de cortafuegos IP con <CODE>ipfwadm</CODE>. </A> </H2>


<P>Esta secci&oacute;n proporciona una gu&iacute;a m&aacute;s exhaustiva del uso de <CODE>ipfwadm</CODE>.</P>

<P>Esta es una configuraci&oacute;n para un sistema de cortafuegos/masquerade detr&aacute;s
de un enlace PPP con la siguiente direcci&oacute;n PPP est&aacute;tica. El interfaz de
confianza es 192.168.255.1, el interfaz PPP ha sido cambiado para proteger
al culpable :). List&eacute; cada interfaz de entrada y salida individualmente
para capturar IP spoofing tambi&eacute;n como ruta relleno y/o masquerading.
¡Todo aquello no expl&iacute;citamente permitido esta prohibido! </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
#!/bin/sh
#
# /etc/rc.d/rc.firewall, define la configuracion del cortafuegos, invocado
# desde rc.local.
#

PATH=/sbin:/bin:/usr/sbin:/usr/bin

# comprobacion, espera un bit luego limpia toda norma del cortafuegos.
# descomente las siguientes lineas si quiere que el cortafuegos se 
# desconecte automaticamente pasados 10 minutos
#
# (sleep 600; \
# ipfwadm -I -f; \
# ipfwadm -I -p accept; \
# ipfwadm -O -f; \
# ipfwadm -O -p accept; \
# ipfwadm -F -f; \
# ipfwadm -F -p accept; \
# ) &

# Entrante, purga y establece la politica por defecto de denegar. La
# verdad es que la politica por defecto es irrelevante porque hay un
# cierre de  toda norma con denegar y anotar

ipfwadm -I -f
ipfwadm -I -p deny

# interfaz local, maquinas locales, van a cualquier sitio valido 
ipfwadm -I -a accept -V 192.168.255.1 -S 192.168.0.0/16 -D 0.0.0.0/0

# interfaz remota, reclamando ser maquinas locales, IP spoofing, perdido
ipfwadm -I -a deny -V su.direccion.ppp.estatica -S 192.168.0.0/16 -D 0.0.0.0/0 -o

# interfaz remota, cualquier origen, es valido ir a direcciones PPP permanentes
ipfwadm -I -a accept -V su.direccion.PPP.estatica -S 0.0.0.0/0 -D su.direccion.PPP.estatica/32

# el interfaz loopback es valido.
ipfwadm -I -a accept -V 127.0.0.1 -S 0.0.0.0/0 -D 0.0.0.0/0

# cierra toda norma, todas las otras entradas son denegadas y registradas.
# Lastima que no haya una opcion de registro, aunque esto hace el trabajo
# en su lugar

ipfwadm -I -a deny -S 0.0.0.0/0 -D 0.0.0.0/0 -o

# Saliente, purga y pone la politica por defecto de denegar. La verdad es
# que la politica por defecto es irrelevante porque hay un cierre de toda
# norma con  denegar y anotar

ipfwadm -O -f
ipfwadm -O -p deny

# interfaz local, cualquier origen con destino a la red local es valido 
ipfwadm -O -a accept -V 192.168.255.1 -S 0.0.0.0/0 -D 192.168.0.0/16

# saliente para la red local sobre el interfaz remoto , stuffed routing,
# denegado

ipfwadm -O -a deny -V su.direccion.PPP.estatica -S 0.0.0.0/0 -D 192.168.0.0/16 -o

# saliente desde la red local sobre el interfaz remoto, stuffed masquerading, 
# denegado

ipfwadm -O -a deny -V su.direccion.PPP.estatica -S 192.168.0.0/16 -D 0.0.0.0/0 -o

# saliente desde la red local sobre el interfaz remoto, stuffed masquerading, 
# denegado

ipfwadm -O -a deny -V su.direccion.PPP.estatica -S 0.0.0.0/0 -D 192.168.0.0/16 -o

# algo mas saliente sobre la interfaz remota es valido.

ipfwadm -O -a accept -V su.direccion.PPP.estatica -S su.direccion.PPP.estatica/32 -D 0.0.0.0/0

# el interfaz loopback es valido.

ipfwadm -O -a accept -V 127.0.0.1 -S 0.0.0.0/0 -D 0.0.0.0/0

# norma de capturar todo, todo lo otro saliente es denegado y anotado. 
# Lastima que no hay una opcion de registro en la politica pero esto
# hace  el trabajo en su lugar. 

ipfwadm -O -a deny -S 0.0.0.0/0 -D 0.0.0.0/0 -o

# Envios, purga y pone la politica por defecto de denegar. La verdad es
# que la politica por defecto es irrelevante porque hay una cierre de toda
# norma con  denegar y anotar. 

ipfwadm -F -f
ipfwadm -F -p deny

# Enmascaramiento (Masquerade) desde la red local sobre el interfaz local 
# hacia cualquier sitio.

ipfwadm -F -a masquerade -W ppp0 -S 192.168.0.0/16 -D 0.0.0.0/0

# norma de capturar todo, el resto de envios son denegados y anotados. 
# Lastima que no hay una opcion de registro en la politica, pero esto hace
# el trabajo en su lugar. 

ipfwadm -F -a deny -S 0.0.0.0/0 -D 0.0.0.0/0 -o
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Puede bloquear el tr&aacute;fico para un sitio en particular usando <CODE>-I</CODE>,
<CODE>-O</CODE> o <CODE>-F</CODE>. Recuerde que el conjunto de las normas son examinadas
desde arriba hacia abajo y <CODE>-a</CODE> significa "a&ntilde;adir" a los valores
existententes de la norma, as&iacute; cualquier restricci&oacute;n necesita venir antes
de las normas generales. Por ejemplo (sin probar):</P>
<P>Usando normas <CODE>-I</CODE>. Probablemente es la m&aacute;s r&aacute;pida pero s&oacute;lo detiene
las m&aacute;quinas locales, el cortafuegos puede todav&iacute;a acceder a sitios
"prohibidos". Por supuesto le puede interesar permitir esa combinaci&oacute;n.</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
... inicio de la norma -I ...
# rechaza y anota el interfaz local, las maquinas locales van a 204.50.10.13
ipfwadm -I -a reject -V 192.168.255.1 -S 192.168.0.0/16 -D 204.50.10.13/32 -o
# interfaz local, maquinas locales, ir a cualquier sitio es valido
ipfwadm -I -a accept -V 192.168.255.1 -S 192.168.0.0/16 -D 0.0.0.0/0
... fin de la norma -I ...
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Usando la norma <CODE>-O</CODE>. M&aacute;s lento porque los paquetes van primero a trav&eacute;s
de masquerading pero esta norma incluso detiene los accesos del
cortafuegos a los sitios prohibidos. </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
... inicio de la norma -O  ...
# deniega y anota las salidas a 204.50.10.13
ipfwadm -O -a reject -V su.direccion.PPP.estatica -S su.direccion.PPP.estatica/32 -D 204.50.10.13/32 -o
# cualquier otra salida sobre el interfaz remoto es valida 
ipfwadm -O -a accept -V su.direccion.PPP.estatica -S su.direccion.PPP.estatica/32 -D 0.0.0.0/0
... fin de la norma -O  ...
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Usando la norma <CODE>-F</CODE>. Probablemente m&aacute;s lento que <CODE>-I</CODE> y esto
todav&iacute;a solo detiene a las m&aacute;quinas enmascaradas (por ejemplo: las
internas), el cortafuegos puede todav&iacute;a acceder a sitios prohibidos</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
... inicio de  la norma -F  ...
# deniega y anota desde la red local sobre el interfaz PPP hacia 204.50.10.13.
ipfwadm -F -a reject -W ppp0 -S 192.168.0.0/16 -D 204.50.10.13/32 -o
# Enmascara (Masquerade) desde la red local sobre interfaces locales hacia
# cualquier sitio.
ipfwadm -F -a masquerade -W ppp0 -S 192.168.0.0/16 -D 0.0.0.0/0
... fin de la norma -F ...
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>No es necesario una norma especial para permitir a 192.168.0.0/16 para ir
a 204.50.11.0, est&aacute; cubierto por la norma global.</P>
<P>Hay m&aacute;s de una forma de codificar el interfaz en las normas de arriba. 
Por ejemplo en lugar de <CODE>-V 192.168.255.1</CODE> puede poner <CODE>-W eth0</CODE>, en
lugar de <CODE>-V su.direccion.PPP.estatica</CODE> y puede usar <CODE>-W ppp0</CODE>. La
elecci&oacute;n es m&aacute;s que otra cosa personal y de documentaci&oacute;n. </P>


<H2><A NAME="diald"></A> <A NAME="ss4.5">4.5 IP Masquerade y llamada bajo demanda (<I>Dial On Demand</I>).</A></H2>


<P>
<OL>
<LI>Si le gustar&iacute;a activar su red autom&aacute;ticamente para llamar a
Internet, el paquete de llamada bajo demanda <CODE>diald</CODE> le ser&aacute; de
gran utilidad.
</LI>
<LI>Para configurar <CODE>diald</CODE>, por favor mire en <CODE>
<A HREF="http://home.pacific.net.sg/~harish/diald.config.html">http://home.pacific.net.sg/~harish/diald.config.html</A></CODE>
</LI>
<LI>Una vez que <CODE>diald</CODE> e <CODE>ip_masq</CODE> hayan sido configurados, puede
ir a alguna de las m&aacute;quinas clientes e iniciar una sesi&oacute;n web, telnet o
ftp. 
</LI>
<LI><CODE>diald</CODE> detectar&aacute; peticiones entrantes, luego llamar&aacute; a su ISP y
establecer&aacute; la conexi&oacute;n.
</LI>
<LI>Hay un tiempo de espera que ocurrir&aacute; con la primera conexi&oacute;n. Esto
es inevitable si esta usando un m&oacute;dem anal&oacute;gico. El tiempo dado para
establecer el enlace entre el m&oacute;dem y la conexi&oacute;n PPP causar&aacute; que su
programa cliente termine. Esto puede ser evitado si esta usando un
conexi&oacute;n RDSI. Todo lo que necesita hacer es terminar el proceso actual en
el cliente y reiniciarlo.</LI>
</OL>
</P>


<H2><A NAME="ipautofw"></A> <A NAME="ss4.6">4.6 Reenv&iacute;o de paquetes <CODE>ipautofw</CODE>. </A></H2>


<P><CODE>
<A HREF="ftp://ftp.netis.com/pub/members/rlynch/ipautofw.tar.gz">ftp://ftp.netis.com/pub/members/rlynch/ipautofw.tar.gz</A></CODE> es un
transportador gen&eacute;rico de TCP y UDP para masquerading de Linux. 
Generalmente para utilizar un paquete que requiera UDP necesitar&aacute; cargar
un m&oacute;dulo espec&iacute;fico de <CODE>ip_masq</CODE>; <CODE>ip_masq_raudio</CODE>,
<CODE>ip_masq_cuseeme</CODE>, ... <CODE>ipautofw</CODE> act&uacute;a de una forma m&aacute;s gen&eacute;rica,
enviar&aacute; cualquier tipo de tr&aacute;fico inclu&iacute;do aquel que los m&oacute;dulos
espec&iacute;ficos no env&iacute;an. Esto puede crear un agujero de seguridad si no se
administra correctamente. </P>


<HR>
<A HREF="IP-Masquerade-Como-3.html">Anterior</A>
<A HREF="IP-Masquerade-Como-5.html">Siguiente</A>
<A HREF="IP-Masquerade-Como.html#toc4">Indice</A>
</BODY>
</HTML>
