<HTML>
<HEAD>
<TITLE>Mini-COMO de Linux IP Masquerade, en ESPA&Ntilde;OL.: Conceptos b&aacute;sicos.</TITLE>
</HEAD>
<BODY>
<A HREF="IP-Masquerade-Como-1.html">Anterior</A>
<A HREF="IP-Masquerade-Como-3.html">Siguiente</A>
<A HREF="IP-Masquerade-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Conceptos b&aacute;sicos.</A></H2>



<H2><A NAME="ss2.1">2.1 ¿Qu&eacute; es IP Masquerade?</A></H2>


<P>IP Masquerade es una capacidad de red de Linux en desarrollo. Si un
servidor Linux est&aacute; conectado a Internet con IP Masquerade habilitado, los
ordenadores conectados a &eacute;l (bien en la misma red local, bien por m&oacute;dem) 
tambi&eacute;n pueden conectarse a Internet, incluso aunque no tengan <EM>una
direcci&oacute;n IP oficial asignada</EM>.</P>
<P>Esto permite a un conjunto de m&aacute;quinas acceder <EM>transparentemente</EM>
a Internet ocultas tras la m&aacute;quina pasarela, la cual aparece como el &uacute;nico
sistema que est&aacute; usando Internet. Romper la seguridad de un sistema
configurado de forma correcta con IP Masquerade es considerablemente m&aacute;s
dif&iacute;cil que romper un buen filtro de paquetes basado en cortafuegos
(suponiendo que no existan fallos en ninguno).</P>


<H2><A NAME="ss2.2">2.2 Estado actual</A></H2>


<P>IP Masquerade est&aacute; todav&iacute;a en etapa experimental. De todas formas, los
n&uacute;cleos a partir del <CODE>1.3.x</CODE> tienen ya soporte interno incorporado. 
Muchos particulares y empresas lo est&aacute;n usando, con resultados
satisfactorios. </P>
<P>Se ha comprobado que los Navegadores de p&aacute;ginas web y telnet funcionan
bien sobre <CODE>ip_masq</CODE>. FTP, IRC y Real Audio funcionan con ciertos
m&oacute;dulos cargados. Otras variedades de audio por red como True Speech e
Internet Wave tambi&eacute;n funcionan. Algunos usuarios de la lista de correo
incluso lo intentaron con software de v&iacute;deo-conferencia. Incluso <CODE>ping</CODE>
funciona ahora, con el nuevo parche ICMP.</P>
<P>Por favor dir&iacute;jase a la secci&oacute;n 
<A HREF="IP-Masquerade-Como-4.html#soportados">soportados</A> para ver la lista
completa de programas soportados.</P>
<P>IP Masquerade funciona bien con 'm&aacute;quinas clientes' con diferentes
sistemas operativos y plataformas. Ha habido &eacute;xito con sistemas usando
Unix, Windows 95, Windows NT, Windows para Trabajo en Grupo (con el
paquete TCP/IP), OS/2, Sistemas Macintosh OS con Mac TCP, Mac Open
Transport, DOS con el paquete NCSA Telnet, VAX, Alpha con Linux, e incluso
Amiga con AmiTCP o AS225-stack. </P>


<H2><A NAME="ss2.3">2.3 ¿Qui&eacute;n puede beneficiarse de IP Masquerade?</A></H2>


<P>
<UL>
<LI>Si tiene un servidor Linux conectado a Internet, y  
</LI>
<LI>si tiene algunos ordenadores con TCP/IP conectados con esa m&aacute;quina
Linux en una subred local (LAN) , y/o
</LI>
<LI>si su servidor Linux tiene m&aacute;s de un m&oacute;dem y act&uacute;a como un servidor
PPP o SLIP conectando a otros,
</LI>
<LI>los cuales no tienen asignada una direcci&oacute;n IP oficial. (Estas
m&aacute;quinas son representadas por <B>OTRAS</B> m&aacute;quinas presentes). 
</LI>
<LI>Y por supuesto, si quiere que esas <B>OTRAS</B> m&aacute;quinas est&eacute;n en
Internet sin gastar dinero extra :) 
</LI>
</UL>
</P>


<H2><A NAME="ss2.4">2.4 ¿Qui&eacute;n NO necesita IP Masquerade?</A></H2>


<P>
<UL>
<LI>Si su m&aacute;quina es un servidor Linux aislado conectado a Internet,
entonces es in&uacute;til usar <CODE>ip_masq</CODE>, o
</LI>
<LI>si ya tiene direcciones asignadas a sus <B>OTRAS</B> m&aacute;quinas,
entonces no necesita IP Masquerade,
</LI>
<LI>y por supuesto, si no le gusta la idea de una salida gratuita a
Internet.
</LI>
</UL>
</P>


<H2><A NAME="ss2.5">2.5 ¿C&oacute;mo funciona IP Masquerade ?</A></H2>


<P>De la <I>PUF</I> de IP Masquerade por Ken Eves:</P>
<P>Representaci&oacute;n de la configuraci&oacute;n m&aacute;s simple :</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
     SLIP/PPP         +------------+                         +------------+
     al proveedor     |  Linux     |       SLIP/PPP          | OTRA       |
    &lt;---------- modem1|            |modem2 &lt;---------- modem |            |
      111.222.333.444 |            |           192.168.1.100 |            |
                      +------------+                         +------------+
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En el dibujo de arriba un servidor Linux con ip_masquerading instalado y
funcionando est&aacute; conectado a Internet v&iacute;a SLIP o PPP usando el
<CODE>modem1</CODE>. Tiene asignada la direcci&oacute;n IP 111.222.333.444. En esta
configuraci&oacute;n ese <CODE>modem2</CODE> permite a las personas que llaman entrar e
iniciar una conexi&oacute;n SLIP/PPP. </P>
<P>El segundo sistema (el cual no tiene porqu&eacute; usar Linux) llama al servidor
Linux e inicia una conexi&oacute;n SLIP o PPP. No tiene asignada una direcci&oacute;n IP
en Internet as&iacute; que usa 192.168.1.100 (ver abajo). </P>
<P>Con ip_masquerade y el rutado configurado adecuadamente la m&aacute;quina OTRA
puede interactuar con Internet como si estuviera realmente conectada (con
unas pocas excepciones).</P>
<P>Citando a Pauline Middelink: </P>
<P>No olvide mencionar que OTRA deber&iacute;a tener al servidor Linux como su
pasarela (si es la ruta por defecto o s&oacute;lo una subred no importa). Si la
OTRA no puede hacer esto, la m&aacute;quina Linux deber&iacute;a hacer un proxy arp para
todas las direcciones de rutado, pero la configuraci&oacute;n del proxy arp va
m&aacute;s all&aacute; del alcance del documento. </P>
<P>Lo siguiente es un extracto de un correo de <CODE>
<A HREF="news:comp.os.linux.networking">comp.os.linux.networking</A></CODE>
que se ha editado para corresponder los nombres usados en el ejemplo de
arriba:</P>
<P>
<UL>
<LI>Le digo a la m&aacute;quina OTRA que mi servidor Linux es su pasarela. 
</LI>
<LI>Cuando un paquete llega a la m&aacute;quina Linux desde OTRA, le asignar&aacute;
un nuevo n&uacute;mero de puerto origen, y pega su propia direcci&oacute;n IP en la
cabecera del paquete, guardando los originales. Entonces mandar&aacute; el
paquete modificado a Internet sobre el interfaz PPP/SLIP.
</LI>
<LI>Cuando un paquete viene desde Internet para la m&aacute;quina Linux, si el
n&uacute;mero de puerto es uno de esos asignados arriba, obtendr&aacute; el puerto
original y la direcci&oacute;n ip, repondr&aacute; la cabecera del paquete y lo enviar&aacute;
a OTRA.
</LI>
<LI>El servidor que env&iacute;a el paquete nunca notar&aacute; la diferencia. 
</LI>
</UL>
</P>
<P>&ensp; <BR></P>
<P>&ensp; <BR></P>
<P>&ensp; <BR></P>
<P>&ensp; <BR></P>
<P>&ensp; <BR></P>
<P>&ensp; <BR></P>
<P><B>Un ejemplo de IP Masquerading</B></P>
<P>el ejemplo t&iacute;pico se muestra en la siguiente figura:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
      +----------+
      |          |  Ethernet
      | ordenador|::::::
      |    A     |2    :192.168.1.x
      +----------+     :
                       :   +----------+   enlace
      +----------+     :  1|  Linux   |   ppp
      |          |     ::::| masq-gate|:::::::::// Internet
      | ordenador|::::::   |          |
      |    B     |3    :   +----------+
      +----------+     :
                       :
      +----------+     :
      |          |     :
      | ordenador|::::::
      |    C     |4
      +----------+

      &lt;- Red  Interna -&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>En este ejemplo hay 4 ordenadores que centran este documento. Tambi&eacute;n hay
algo al otro lado de su conexi&oacute;n IP que le suministra la informaci&oacute;n de
Internet y adem&aacute;s otros sistemas con los que est&aacute; interesado en
intercambiar informaci&oacute;n. </P>
<P>El sistema Linux <CODE>masq-gate</CODE> es la pasarela enmascarada para la red
interna de los ordenadores A, B y C que permite el acceso a Internet. La
red interna usa una de las direcciones de red privadas, en este caso la
red de clase C 192.168.1.0, donde la m&aacute;quina Linux
<SL>N. del T. <BR> 
Mejor dicho, el interfaz ethernet de la m&aacute;quina Linux</SL>
 tiene la
direcci&oacute;n 192.168.1.1 y los dem&aacute;s tienen direcciones de esa misma red. </P>
<P>Las tres m&aacute;quinas A, B y C (que pueden estar usando cualquier sistema
operativo, siempre que pueda "hablar IP", como Windows 95, Macintosh
MacTCP o incluso otro Linux) pueden conectarse a otras m&aacute;quinas de
Internet, ya que el sistema masquerade <CODE>masq-gate</CODE> enmascara todas
sus conexiones de tal forma que parezcan originadas en <CODE>masq-gate</CODE>,
y se encarga de que los datos que le devuelven en una conexi&oacute;n enmascarada
sean retransmitidos al sistema original. As&iacute; los sistemas de la red
interna ven una ruta directa a Internet y son incapaces de darse cuenta
que sus datos est&aacute;n siendo enmascarados.</P>


<H2><A NAME="ss2.6">2.6 Requerimientos para usar IP Masquerade en Linux <CODE>2.x</CODE></A></H2>


<P>Por favor dir&iacute;jase a <CODE>
<A HREF="http://ipmasq.home.ml.org/">http://ipmasq.home.ml.org/</A></CODE> para informaci&oacute;n m&aacute;s actualizada,
es dif&iacute;cil actualizar este COMO con frecuencia.</P>
<P>
<UL>
<LI>Fuentes del n&uacute;cleo <CODE>2.0.x</CODE>, disponibles en <CODE>
<A HREF="ftp://ftp.kernel.org/pub/linux/kernel/v2.0/">ftp://ftp.kernel.org/pub/linux/kernel/v2.0/</A></CODE>

(S&iacute;, tendr&aacute; que compilar su n&uacute;cleo con ciertos soportes... Se recomienda
el &uacute;ltimo n&uacute;cleo estable) 
</LI>
<LI>M&oacute;dulos cargables del n&uacute;cleo, preferiblemente <CODE>2.0.0</CODE> o superior
disponibles en <BR> <CODE>
<A HREF="http://www.pi.se/blox/modules/modules-2.0.0.tar.gz">http://www.pi.se/blox/modules/modules-2.0.0.tar.gz</A></CODE>

(<CODE>modules-1.3.57</CODE> es lo m&iacute;nimo requerido)
</LI>
<LI>Montar una red TCP/IP bien configurada, tema tratado en <CODE>
<A HREF="http://www.caldera.com/LDP/HOWTO/NET-2-HOWTO.html">http://www.caldera.com/LDP/HOWTO/NET-2-HOWTO.html</A></CODE>
y en <CODE>
<A HREF="http://linuxwww.db.erau.edu/NAG/">http://linuxwww.db.erau.edu/NAG/</A></CODE>, disponible en castellano en
<CODE>
<A HREF="http://www.infor.es/LuCAS">http://www.infor.es/LuCAS</A></CODE> como <I>GARL</I>, o <I>Gu&iacute;a del
Administrador de Redes Linux</I>.
</LI>
<LI>Conexi&oacute;n a Internet para su servidor Linux. 

Tratado en <BR> <CODE>
<A HREF="http://www.caldera.com/LDP/HOWTO/ISP-Hookup-HOWTO.html">http://www.caldera.com/LDP/HOWTO/ISP-Hookup-HOWTO.html</A></CODE>,
<I>PPP-Como</I>, disponible en <CODE>
<A HREF="http://www.insflug.org">http://www.insflug.org</A></CODE> y <CODE>
<A HREF="http://www.caldera.com/LDP/HOWTO/mini/PPP-over-ISDN">http://www.caldera.com/LDP/HOWTO/mini/PPP-over-ISDN</A></CODE>, as&iacute; como
para los que dispongan de Infov&iacute;a, el <I>Infobia-Como</I>, <CODE>
<A HREF="http://www.insflug.org">http://www.insflug.org</A></CODE>
</LI>
<LI>Ipfwadm 2.3 o m&aacute;s reciente, disponible en <BR> <CODE>
<A HREF="ftp://ftp.xos.nl/pub/linux/ipfwadm/ipfwadm-2.3.0.tar.gz">ftp://ftp.xos.nl/pub/linux/ipfwadm/ipfwadm-2.3.tar.gz</A></CODE> m&aacute;s
informaci&oacute;n sobre requerimientos de versiones en <CODE>
<A HREF="http://www.xos.nl/linux/ipfwadm/">http://www.xos.nl/linux/ipfwadm/</A></CODE>
</LI>
<LI>Puede opcionalmente aplicar parches de IP Masquerade para habilitar
otras funcionalidades. Dispone de m&aacute;s informaci&oacute;n acerca de esto en
<CODE>
<A HREF="http://ipmasq.home.ml.org/">http://ipmasq.home.ml.org/</A></CODE> (estos parches aplicados a todos
los n&uacute;cleos <CODE>2.0.x</CODE>)
</LI>
</UL>
</P>


<HR>
<A HREF="IP-Masquerade-Como-1.html">Anterior</A>
<A HREF="IP-Masquerade-Como-3.html">Siguiente</A>
<A HREF="IP-Masquerade-Como.html#toc2">Indice</A>
</BODY>
</HTML>
