<HTML>
<HEAD>
<TITLE>Noticias COMO: Programas de transporte de noticias</TITLE>
</HEAD>
<BODY>
<A HREF="Noticias-Como-3.html">Anterior</A>
<A HREF="Noticias-Como-5.html">Siguiente</A>
<A HREF="Noticias-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="s4">4. Programas de transporte de noticias</A></H2>


<P>Hoy en d&iacute;a hay dos paquetes principales de "transporte" de noticias para
*nix, <CODE>Cnews</CODE> e <CODE>INN</CODE>. El viejo "<CODE>Bnews</CODE>" ha sido declarado
oficialmente muerto y no soportado por sus autores.</P>
<P>El "transporte" de noticias se define aqu&iacute; como los programas que trabajan
detr&aacute;s de las c&aacute;maras para publicar y propagar los art&iacute;culos, as&iacute; como
para hacerlos disponibles a los lectores de noticias.</P>
<P>Puede Vd. configurar sus rutas como guste, siempre que UUCP tenga la ruta
absoluta a <CODE>rnews</CODE> en el fichero <CODE>Permissions</CODE>, y siempre que
configure sus lectores de forma que puedan encontrar "<CODE>inews</CODE>" y
"<CODE>mail</CODE>".</P>
<P>Importante - est&aacute; Vd. buscando problemas si intenta mezclar <CODE>CNews</CODE> e
<CODE>INN</CODE>. Escoja uno u otro. Es correcto a&ntilde;adir el servidor <CODE>NNTP</CODE>
"Reference Release"  a <CODE>Cnews</CODE>, ya que est&aacute;n pensados para
complementarse.</P>

<H2><A NAME="ss4.1">4.1 <I>Cnews Cleanup Release</I></A></H2>


<P>El est&aacute;ndar actual de facto en programas de noticias es <CODE>Cnews</CODE>. Lleva
funcionando unos cuantos a&ntilde;os; yo lo vi por primera vez alrededor de 1988. 
La versi&oacute;n actual en el momento de escribir estas l&iacute;neas se llama
"<I>Cnews Cleanup Release, with patch CR.G</I>".</P>
<P>La mayor ventaja de <CODE>Cnews</CODE> es su madurez. Funciona bajo cualquier *nix
que se pueda encontrar y hay literalmente miles de sistemas us&aacute;ndolo
alrededor del mundo. </P>
<P>Su mayor desventaja es que parece haber sido dise&ntilde;ado para conexiones UUCP
por m&oacute;dem, y por tanto requiere la adici&oacute;n de un servidor <CODE>NNTP</CODE> para
manejar transferencia en tiempo real de noticias por Internet.</P>
<P>A pesar de esto, el administrador novel deber&iacute;a probablemente usar
<CODE>Cnews</CODE> primero, ya que es muy estable, bien documentado, y es usado
por miles de administradores expertos que pueden contestar a sus
preguntas.</P>
<P>La '<I>Cleanup Release</I>' afirma que "el soporte para Overview ha sido
plenamente integrado y es m&aacute;s r&aacute;pido de lo que sol&iacute;a ser". El resultado es
que se puede usar el soporte NOV de <CODE>Cnews</CODE> en vez de usar programas
externos de ordenamiento en hebras, tales como <CODE>nn</CODE>, <CODE>tin</CODE> y
<CODE>trn</CODE>.</P>
<P>Todav&iacute;a no me he aclarado de c&oacute;mo implementar esta parte, ya que me cambi&eacute;
a <CODE>INN</CODE> en casa hace tiempo. Si alguien quiere darme alguna pista para
actualizar este documento, que por favor me deje unas l&iacute;neas por correo
electr&oacute;nico.</P>
<P>La distribuci&oacute;n <CODE>newspack</CODE> de sunsite contiene ficheros de
configuraci&oacute;n que funcionan en la <I>Cnews Cleanup Release bajo</I> Linux,
as&iacute; como un parche de un par de l&iacute;neas necesario para evitar algunos
problemas de <CODE>"doexplode"</CODE> con <CODE>bash1.12</CODE>. </P>
<P>B&aacute;sicamente, se ejecuta el nuevo script '<CODE>quiz</CODE>' y se aceptan las
opciones por defecto. Tendr&aacute; Vd. que acudir a su &aacute;rbol
<CODE>/usr/include</CODE> para contestar a algunas preguntas, pero es bastante
sencillo. </P>

<H3>Instalaci&oacute;n de <CODE>Cnews</CODE></H3>


<P>Instalar la Cleanup Release de <CODE>Cnews</CODE> es simplemente seguir los pasos
que se detallan en la documentaci&oacute;n. Simplemente obtenga las fuentes,
extr&aacute;igalas, y siga las instrucciones.</P>
<P>El fichero <CODE>quiz.def</CODE> de <CODE>newspack</CODE> fue generado al ejecutar
"<CODE>quiz</CODE>" la primera vez, simplemente verificando los ficheros de
<CODE>/usr/include</CODE> para obtener las respuestas correctas.</P>
<P>Necesitar&aacute; una versi&oacute;n reciente de '<CODE>bash</CODE>' para que <CODE>Cnews</CODE> pase
sus auto-tests. Teclee '<CODE>bash -version</CODE>' para saber qu&eacute; versi&oacute;n tiene.
La versi&oacute;n 1.14.2 definitivamente no es buena. La versi&oacute;n actual (mientras
se escribe esto) 1.14.5 parece mejor.</P>
<P>Steve Robbins ha averiguado que la reciente 'cleanup release' de
<CODE>Cnews</CODE> ha encontrado un error en el comando '<CODE>join</CODE>' de GNU de
<CODE>shellutils-1.9</CODE>. Hay algunos parches necesarios para solventar el
problema. Steve los puso en sunsite por petici&oacute;n m&iacute;a.</P>

<H3>Configuraci&oacute;n de <CODE>Cnews</CODE></H3>


<P>Como m&iacute;nimo, necesitar&aacute; editar o cuando menos echar un vistazo a los
siguientes ficheros. Todos deber&iacute;an estar en <CODE>/usr/local/lib/news</CODE>:</P>
<P>
<UL>
<LI><CODE>active</CODE>             - el fichero con los grupos activos</LI>
<LI><CODE>batchparms</CODE>         - par&aacute;metros de proceso por lotes</LI>
<LI><CODE>explist</CODE>            - configuraci&oacute;n de caducidad de los art&iacute;culos</LI>
<LI><CODE>mailname</CODE>           - nombre de su servidor</LI>
<LI><CODE>mailpaths</CODE>          - direcciones de los moderadores de grupos</LI>
<LI><CODE>organization</CODE>       - su organizaci&oacute;n</LI>
<LI><CODE>sys</CODE>                - control de lo que se pide y env&iacute;a</LI>
<LI><CODE>whoami</CODE>             - el nombre de su sistema para la l&iacute;nea <CODE>Path:</CODE></LI>
</UL>
</P>

<H3>Mantenimiento de un sistema con <CODE>Cnews</CODE></H3>


<P>Primeramente, una sencilla regla es no enredar a mano con los ficheros que
tienen utilidades para configurarlos. Particularmente, no edite
<CODE>newsfeeds</CODE> manualmente (ejecute "<CODE>addfeed</CODE>" en vez de eso), y
no enrede con el fichero <CODE>active</CODE> (use "<CODE>addgroup</CODE>"). En caso de
duda, lea y relea los documentos de la distribuci&oacute;n en los fuentes. </P>
<P>Todo lo dem&aacute;s puede hacerse v&iacute;a <CODE>cron</CODE>. Mi <CODE>crontab</CODE> para
"<CODE>news</CODE>" es como el siguiente: </P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
        # procesar los paquetes comprimidos que vienen de otros sistemas
        # y tambien publicar los articulos originados localmente
        20 *       * * * /usenet/sw/news/bin/input/newsrun  

        # crear los paquetes para enviar
        0 *        * * * /usenet/sw/news/bin/batch/sendbatches myfeedsite

        # borrar articulos caducados
        59 0       * * * /usenet/sw/news/bin/expire/doexpire 

        # vigilar el cotarro y avisar si es necesario
        10 5       * * * /usenet/sw/news/bin/newsdaily 
        00 5       * * * /usenet/sw/new/bin/newswatch 

        # desactivar el proceso de paquetes entrantes entre 6:30AM - 4:00 PM
        30 6       * * * /usenet/sw/news/bin/input/newsrunning off 
        00 16      * * * /usenet/sw/news/bin/input/newsrunning on 
</PRE>
</CODE></BLOCKQUOTE>
</P>


<H2><A NAME="ss4.2">4.2 InterNetNews (<CODE>INN</CODE>)</A></H2>


<P><CODE>INN</CODE> es un reci&eacute;n llegado a la escena, pero est&aacute; ganando popularidad
conforme madura. Su mayor ventaja es la velocidad y el hecho de que
contiene un servidor <CODE>NNTP</CODE> integrado. Su principal desventaja es que
es nuevo y no se instala y funciona necesariamente en todos los *nix
est&aacute;ndar todav&iacute;a.  Adem&aacute;s, opera con un demonio (el <CODE>innd</CODE>) siempre
funcionando. El trato parece ser memoria por velocidad. </P>

<P>He mantenido un servidor con una entrada de unos 5Mb por noche sobre UUCP
con <CODE>INN</CODE>, en un 386-33 con 8Mb (normalmente no se estaba ejecutando X
Window), a trav&eacute;s de un m&oacute;dem de 14.4Kb sin ning&uacute;n problema. </P>
<P>Los administradores de noticias noveles probablemente no deber&iacute;an intentar
instalar <CODE>INN</CODE> hasta que tengan experiencia con B-news o <CODE>Cnews</CODE>. A
pesar de ser r&aacute;pido y vers&aacute;til, est&aacute; pr&aacute;cticamente sin documentar para el
principiante (aunque en la pr&aacute;ctica es bastante sencillo una vez que te lo
imaginas).</P>
<P><CODE>INN</CODE> es muy quisquilloso con los permisos. No enrede con ellos.</P>
<P><CODE>INN</CODE> tambi&eacute;n es muy puntilloso con tener un protocolo TCP/IP "de
calidad"  con el que trabajar. Linux no cumple necesariamente este
requisito actualmente, as&iacute; que se recomienda obtener una distribuci&oacute;n de
<CODE>INN</CODE> espec&iacute;fica para Linux, en cualquier de los servidores de archivos
de Linux.</P>

<H3>Instalaci&oacute;n de <CODE>INN</CODE></H3>


<P>( por Arjan de Vet - <CODE>
<A HREF="mailto:devet@info.win.tue.nl">devet@info.win.tue.nl</A></CODE> ) </P>
<P>He hecho un parche + un paquete de configuraci&oacute;n para ejecutar <CODE>INN</CODE>
1.4 bajo Linux. Puede encontrarse en:</P>
<P><CODE>
<A HREF="ftp://ftp.win.tue.nl/pub/linux/ports/inn-1.4-linux.tar.gz">ftp://ftp.win.tue.nl/pub/linux/ports/inn-1.4-linux.tar.gz</A></CODE></P>
<P><CODE>INN</CODE> depende en gran medida de un buen sustituto para
<CODE>/bin/sh</CODE>. Yo uso una versi&oacute;n beta de <CODE>bash 1.13</CODE> que est&aacute;
disponible para Linux en los servidores de ficheros habituales. <CODE>bash
1.12</CODE> da algunos peque&ntilde;os problemas al no manejar correctamente los grupos
de noticias (puede que alg&uacute;n otro problema tambi&eacute;n, no recuerdo). </P>

<H3>Configuraci&oacute;n de <CODE>INN</CODE></H3>


<P>B&aacute;sicamente, siga las instrucciones de Arjan y el sistema estar&aacute; listo. 
Aqu&iacute; hay un sumario de qu&eacute; hacer.</P>
<P>
<OL>
<LI>En <CODE>config.data</CODE>, aseg&uacute;rese de que aparece
<CODE>"HAVE_UNIX_DOMAIN DONT"</CODE>
</LI>
<LI>A&ntilde;ada el nombre del sistema en el que funciona <CODE>innd</CODE> a
<CODE>hosts.nntp</CODE>. Si s&oacute;lo dispone de UUCP, ese es el nombre de su servidor</LI>
<LI>Aseg&uacute;rese de que no tiene una l&iacute;nea para <CODE>nntp</CODE> en
<CODE>/etc/inetd.conf</CODE>
</LI>
<LI>Aseg&uacute;rese de que <CODE>innshellvars</CODE> contiene <CODE>"HAVE_UUSTAT
DO"</CODE> en vez del "<CODE>DONT</CODE>" en este <CODE>config.data</CODE> de ejemplo si
tiene Vd. instalado <CODE>uustat</CODE> del paquete Taylor UUCP. Definir esto
incorrectamente resultar&aacute; en que no se procesen las noticias salientes. 
</LI>
<LI>Si usa Vd. <CODE>INN</CODE>, defina el <CODE>syslogd</CODE> tal como se
recomienda, porque es muy, muy &uacute;til. 
</LI>
</OL>
</P>
<P>Hay un FAQ
<SL><I>N. del
T.</I>/Preguntas de Uso Frecuente, (<I>PUF</I>s)</SL>
 
espectacular (!!!!) sobre <CODE>INN</CODE> que aparece mensualmente. 
B&uacute;squelo en <BR> <CODE>
<A HREF="ftp://rtfm.mit.edu/pub/usenet-by-hierarchy/news">ftp://rtfm.mit.edu/pub/usenet-by-hierarchy/news</A></CODE>. Se alegrar&aacute;
de hacerlo. </P>

<H3>Mantenimiento de un sistema con <CODE>INN</CODE></H3>


<P>He descubierto que un sistema Linux con <CODE>INN</CODE> no requiere pr&aacute;cticamente
ninguna atenci&oacute;n y mantenimiento mientras se tenga un <CODE>cron</CODE> adecuado.
B&aacute;sicamente, querr&aacute; Vd. un <CODE>crontab</CODE> parecido al siguiente:</P>
<P>
<PRE>
        # mantenimiento diario, asi como borrar articulos y ficheros
        # .overview caducados
        1 0 * * * /usenet/sw/inn/bin/news.daily expireover delayrm &lt; /dev/null

        # enviar articulos
        5 * * * * /usenet/sw/inn/lib/send-uucp
</PRE>
</P>
<P>( si usa Vd. <CODE>bash1.13</CODE>, el <CODE>"< /dev/null"</CODE> no es necesario )</P>


<H2><A NAME="ss4.3">4.3 Otros agentes de transporte de noticias</A></H2>


<P>A continuaci&oacute;n, una lista no exhaustiva de otros programas de transporte
de noticias que funcionan bajo Linux:</P>
<P>
<UL>
<LI><CODE>dynafeed</CODE></LI>
<LI><CODE>nntp1.5.11</CODE></LI>
<LI><CODE>slurp1.05</CODE></LI>
</UL>
</P>


<HR>
<A HREF="Noticias-Como-3.html">Anterior</A>
<A HREF="Noticias-Como-5.html">Siguiente</A>
<A HREF="Noticias-Como.html#toc4">Indice</A>
</BODY>
</HTML>
