<HTML>
<HEAD>
<TITLE>Noticias COMO: Preguntas frecuentes sobre Usenet (en c.o.l.* de todas formas)</TITLE>
</HEAD>
<BODY>
<A HREF="Noticias-Como-6.html">Anterior</A>
<A HREF="Noticias-Como-8.html">Siguiente</A>
<A HREF="Noticias-Como.html#toc7">Indice</A>
<HR>
<H2><A NAME="s7">7. Preguntas frecuentes sobre Usenet (en <CODE>c.o.l.*</CODE> de todas formas)</A></H2>



<H2><A NAME="ss7.1">7.1 ¿Por qu&eacute; no puedo publicar en grupos moderados?</A></H2>


<P>Probablemente porque el lector de noticias trata de usar
<CODE>/bin/mail</CODE> para enviar el correo y no le gusta. Sustituya el
<CODE>/bin/mail</CODE> de las viejas versiones de SLS con el
<CODE>mailx-5.5.tar.z</CODE> de una distribuci&oacute;n Slackware moderna, use el
<CODE>pkgtool</CODE> de Slackware para instalarlo y asunto arreglado. </P>
<P>Otra posibilidad es que tenga definido el grupo moderado como no moderado
en su sistema local, y que alguien en la red est&eacute; borrando silenciosamente
el art&iacute;culo (alg&uacute;n programa de proceso de noticias, no una persona).
Aseg&uacute;rese de ejecutar "<CODE>checkgroups</CODE>" siempre que el art&iacute;culo
<CODE>checkgroups</CODE> aparezca por <CODE>news.admin</CODE> cada pocas semanas.</P>


<H2><A NAME="ss7.2">7.2 ¿Por qu&eacute; tengo problemas que parecen estar relacionados con los</A>permisos? </H2>


<P>Porque lo est&aacute;n <CODE>:-)</CODE></P>
<P>Compruebe que sus permisos son correctos y que tiene un usuario y grupo
"<CODE>news</CODE>" en <CODE>/etc/passwd</CODE> y <CODE>/etc/group</CODE> que coincida con
la distribuci&oacute;n binaria que use. Parece ser que todav&iacute;a no existe una
norma com&uacute;n sobre las cuentas habituales en Linux. </P>
<P>Todo el material de <CODE>/usr/local/lib/news</CODE> deber&iacute;a ser
<CODE>news.news</CODE>, <BR> salvo <CODE>/usr/local/lib/news/setnewsids</CODE>, que
deber&iacute;a ser <I>setuid</I> <CODE>root</CODE>. </P>
<P>Puede Vd. usar el UID y GID que quiera para "<CODE>news</CODE>".</P>


<H2><A NAME="ss7.3">7.3 ¿Por qu&eacute; puedo publicar art&iacute;culos localmente, pero despu&eacute;s no</A>aparecen ni se env&iacute;an a otros servidores? </H2>


<P>Probablemente porque no se invoc&oacute; a <CODE>newsrun</CODE> desde <CODE>cron</CODE>. Puede
ser que editase Vd. el fichero <CODE>sys</CODE> y lo enredase. Puede ser que no
tenga el &aacute;rbol <CODE>/usr/spool/news/out.going</CODE> o similar. Puede ser
porque usa Vd. una distribuci&oacute;n con las versiones '<I>Performance</I>' o
'<I>Cleanup</I>' de <CODE>Cnews</CODE>, que necesitan que se ejecute '<CODE>newsrun</CODE>'
desde <CODE>cron</CODE> para procesar los lotes que se enviar&aacute;n a otros
servidores, y para hacer visibles los art&iacute;culos localmente. </P>
<P>No cree los grupos o servidores editando los ficheros <CODE>active</CODE> o
<CODE>sys</CODE>. Use las utilidades de <CODE>/usr/local/lib/news/bin/maint</CODE>
para hacerlo. </P>


<H2><A NAME="ss7.4">7.4 ¿Por qu&eacute; mi distribuci&oacute;n binaria no tiene <CODE>nntp</CODE>?</A></H2>


<P>Porque se supone que es muy f&aacute;cil de instalar en Linux y porque no quise
que el material para noticias de SLS fuese el doble de grande teniendo que
mantener versiones <CODE>nntp</CODE> y no <CODE>nntp</CODE> de los lectores y sistema de
transporte de noticias. Tambi&eacute;n porque se compila con informaci&oacute;n
espec&iacute;fica para cada sitio que no puede ser modificada en ning&uacute;n fichero
de configuraci&oacute;n una vez se ha compilado.</P>


<H2><A NAME="ss7.5">7.5 ¿Por qu&eacute; dice <CODE>doexpire</CODE> (o <CODE>relaynews</CODE>) que hay una "grave falta de espacio" cuando hay un mont&oacute;n de sitio?</A></H2>


<P>Porque no puede leer <CODE>/etc/mtab</CODE>. P&oacute;ngale permisos <CODE>644</CODE>. Esto
ocurre cuando se desmonta un sistema de archivos montado por <CODE>root</CODE> con una
m&aacute;scara que no permite al resto de los usuarios leer ficheros
pertenecientes a <CODE>root</CODE>. </P>


<H2><A NAME="ss7.6">7.6 ¿Por qu&eacute; todo parece normal, pero no se publican los art&iacute;culos?</A></H2>


<P>Las versiones viejas de Linux tienen un <CODE>sed</CODE> "roto" que <CODE>Cnews</CODE>
pone en evidencia. En particular, si se instal&oacute; sobre una SLS vieja,
aseg&uacute;rese de mirar <CODE>/bin</CODE> y <CODE>/usr/bin</CODE> y compruebe que s&oacute;lo
tiene una copia de <CODE>sed</CODE> y de que es moderna.</P>
<P>A partir de la '<I>Performance Release</I>' de alrededor de febrero de 1993,
es necesario ejecutar '<CODE>newsrun</CODE>' peri&oacute;dicamente desde <CODE>cron</CODE> para
procesar cosas. Esta es una prestaci&oacute;n que aparentemente sorprende a
alguna gente. </P>


<H2><A NAME="ss7.7">7.7 ¿Puedo integrar <I>news overview</I> (NOV) en <CODE>trn/tin/nn</CODE></A>para sustituir a las varias bases de datos independientes? </H2>


<P>S&iacute;. <CODE>trn</CODE>, <CODE>tin</CODE>, y la beta de <CODE>nn</CODE> ahora lo
soportan.</P>
<P>Puede integrarlo en las versiones <I>Performance</I> y <I>Cleanup</I> de 
<CODE>Cnews</CODE>, as&iacute; como en varios lectores de noticias.</P>
<P>La copia beta de <CODE>nn6.5</CODE> que tengo aqu&iacute; tiene soporte NOV y funciona
sin problemas en Linux. La uso aqu&iacute; y tengo <CODE>nn</CODE> ejecut&aacute;ndose sin tener
que ejecutar <CODE>nnmaster</CODE> (!). Busque en <CODE>
<A HREF="ftp://uniwa.uwa.edu.au">ftp://uniwa.uwa.edu.au</A></CODE> para
obtener una copia.</P>


<H2><A NAME="ss7.8">7.8 ¿Por qu&eacute; no podemos tener una distribuci&oacute;n binaria de <CODE>NNTP</CODE>?</A></H2>


<P>Porque una parte significativa de la informaci&oacute;n local debe especificarse
antes de la compilaci&oacute;n y no puede determinarse autom&aacute;gicamente en tiempo
de ejecuci&oacute;n. Si tanto lo necesita, por favor obtenga <CODE>INN</CODE> en vez de
intentarlo con <CODE>Cnews</CODE> m&aacute;s <CODE>NNTP</CODE>.</P>


<H2><A NAME="ss7.9">7.9 ¿C&oacute;mo configuro <CODE>NNTP</CODE> para permitir lectura/escritura alrededor</A>de la red *sin* almacenar ning&uacute;n art&iacute;culo o base de datos localmente?</H2>


<P>( <CODE>
<A HREF="mailto:mdw@sunsite.unc.edu">mdw@sunsite.unc.edu</A></CODE> (Matt Welsh) ) </P>
<P>
<OL>
<LI>Obtenga la "implementaci&oacute;n de referencia" de <CODE>nntp</CODE> y una copia
de <CODE>rn</CODE> de su dep&oacute;sito de archivos local. Si conectase con <CODE>
<A HREF="ftp://ftp.uu.net/networking/news/nntp/nntp.1.5.11.tar.Z">ftp.uu.net</A></CODE> obtendr&iacute;a:

<CODE>
<A HREF="ftp://ftp.uu.net/networking/news/nntp/nntp.1.5.11.tar.Z">nntp.1.5.11.tar.Z</A></CODE>
</LI>
<LI>Compile <CODE>nntp</CODE> como sigue:
<UL>
<LI>copie <CODE>common/conf.h.dist</CODE> a <CODE>common/conf.h</CODE>.</LI>
<LI>Edite <CODE>common/conf.h</CODE> para activar ciertas opciones:
Las &uacute;nicas que yo activ&eacute; fueron:
<UL>
<LI><CODE>DOMAIN</CODE>: indef&iacute;nalo (es decir, cambie la l&iacute;nea a <CODE>#undef
DOMAIN</CODE>). 
</LI>
<LI><CODE>REALDOMAIN</CODE>: Def&iacute;nalo. Busca el dominio usando las librer&iacute;as. 
</LI>
<LI><CODE>SERVER_FILE</CODE>: Def&iacute;nalo como el nombre del fichero que 
contendr&aacute;
el nombre de su servidor de noticias (p. ej. la m&aacute;quina a trav&eacute;s de la
cual leer&aacute; y publicar&aacute; noticias). Yo uso
"<CODE>/usr/local/lib/news/server</CODE>".
</LI>
<LI><CODE>PASSFILE</CODE>: Si su servidor de noticias requiere autorizaci&oacute;n
(p. ej. alg&uacute;n tipo de nombre de usuario y contrase&ntilde;a)  para publicar,
defina esto como el nombre del fichero que contiene el nombre de usuario y
la contrase&ntilde;a (descrito m&aacute;s abajo). Yo uso
"<CODE>/usr/local/lib/news/nntppass</CODE>". 
</LI>
<LI>Decid&iacute; guardar el resto del material de noticias en
<CODE>/usr/local/lib/news</CODE>. As&iacute; que configur&eacute; el resto de rutas del
archivo (p.  ej. <CODE>ACTIVE_FILE</CODE>, <CODE>NEWSGROUPS_FILE</CODE>,
etc.) para que usasen <CODE>/usr/local/lib/news</CODE>. Muchos de esos
ficheros son usados s&oacute;lo por el servidor <CODE>NNTP</CODE>, no por el cliente,
pero para asegurarme los cambi&eacute; todos para que apuntasen al directorio
correcto; simplemente aseg&uacute;rese de crear el directorio de forma acorde.
</LI>
</UL>
</LI>
</UL>

</LI>
<LI>Cree el usuario "<CODE>usenet</CODE>" si no lo ha hecho ya. El programa
<CODE>inews</CODE> se ejecuta perteneciendo a este usuario. Todo lo que se
necesita es un identificativo de usuario, no se necesita un directorio de
usuario o una shell ni nada de eso. Simplemente inserte la siguiente l&iacute;nea
en su <CODE>/etc/passwd</CODE>: 

<BLOCKQUOTE><CODE>
<PRE>
                                usenet:*:13:1::/:
</PRE>
</CODE></BLOCKQUOTE>


Aseg&uacute;rese de que el identificativo de usuario ("<CODE>13</CODE>" arriba) es &uacute;nico. El
grupo puede ser cualquiera; yo uso "<CODE>daemon</CODE>" (gid 1). 
</LI>
<LI>Cree el fichero <CODE>SERVER_FILE</CODE>. Por ejemplo, mi servidor de
noticias es "<CODE>wonton.tc.cornell.edu</CODE>", as&iacute; que cre&eacute; el fichero
<CODE>/usr/local/lib/news/server</CODE> conteniendo la siguiente l&iacute;nea: 

<BLOCKQUOTE><CODE>
<PRE>
                 wonton.tc.cornell.edu
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>Cree el fichero <CODE>PASSFILE</CODE>. Este fichero contiene l&iacute;neas de
la forma

<BLOCKQUOTE><CODE>
<PRE>
&lt;nombre del servidor&gt; &lt;nombre del usuario&gt; &lt;clave&gt;
</PRE>
</CODE></BLOCKQUOTE>


Supongamos que su servidor de noticias (el del fichero SERVER_FILE) 
es "<CODE>shoop.vpizza.com</CODE>", y que para publicar en esa m&aacute;quina se requiere
ser autorizado como usuario "<CODE>news</CODE>" con la contrase&ntilde;a "<CODE>floof</CODE>".
Por tanto, en el fichero <CODE>PASSFILE</CODE> (yo uso
<CODE>/usr/local/lib/news/nntppass</CODE>), se necesita la siguiente l&iacute;nea: 

<BLOCKQUOTE><CODE>
<PRE>
          shoop.vpizza.com news floof
</PRE>
</CODE></BLOCKQUOTE>

</LI>
<LI>¡Proteja este fichero! El programa <CODE>inews</CODE> se ejecuta
perteneciendo al usuario "<CODE>usenet</CODE>", as&iacute; que haga que este directorio
de noticias pertenezca a dicho usuario, as&iacute; como el fichero <CODE>nntppass</CODE>.

<BLOCKQUOTE><CODE>
<PRE>
        chown usenet /usr/local/lib/news 
        chmod 755 /usr/local/lib/news 
        chown usenet /usr/local/lib/news/nntppass 
        chmod 600 /usr/local/lib/news/nntppass 
</PRE>
</CODE></BLOCKQUOTE>


De forma que nadie m&aacute;s pueda leer este fichero. No, las contrase&ntilde;as no
est&aacute;n encriptadas. 
</LI>
<LI>Vuelva al directorio donde est&aacute;n las fuentes de <CODE>nntp.1.5.11</CODE> y
teclee "<CODE>make client</CODE>". En este punto se compilar&aacute; la versi&oacute;n <CODE>NNTP</CODE>
de <CODE>inews</CODE>, que es el &uacute;nico programa utilizado por el cliente
<CODE>NNTP</CODE>.

Cuando compil&eacute; <CODE>inews</CODE>, hab&iacute;a un error en la librer&iacute;a que causaba que
la funci&oacute;n <CODE>uname()</CODE> de <CODE>uname.c</CODE> se llamase a s&iacute; misma eternamente.
Esto probablemente ya haya desaparecido; sin embargo, si <CODE>inews</CODE> parece
colgarse y su sistema empieza a ralentizarse *un mont&oacute;n*, deber&iacute;a
renombrar la funci&oacute;n "<CODE>uname()</CODE>" de <CODE>uname.c</CODE> a algo como
"<CODE>mi_uname()</CODE>", y sustituir las llamadas a <CODE>uname()</CODE> por
llamadas a <CODE>mi_uname()</CODE> (en <CODE>inews.c</CODE>). 
Escr&iacute;bame
<SL>Nota de VDS - esto significa escribir a Matt, no a m&iacute;
<CODE>:-)</CODE></SL>
. si se encuentra con este problema. 
</LI>
<LI>Teclee "<CODE>make install_client</CODE>". Esto instalar&aacute; <CODE>inews</CODE>
y dem&aacute;s ficheros necesarios. Tambi&eacute;n, enlace
<CODE>/usr/local/lib/news/inews</CODE> con <CODE>/usr/local/bin/inews</CODE>.

Ahora deber&iacute;a ser capaz de publicar (a mano). Pruebe algo como esto:

<BLOCKQUOTE><CODE>
<PRE>
                $ inews -h &lt;&lt; EOF
                Newsgroups: misc.test
                From: yo@foo.bar.com
                Subject: Prueba
                Reply-To: mi-direcccion-real@cualquiera.edu

                Esto es una prueba
                EOF
</PRE>
</CODE></BLOCKQUOTE>


Si esto funciona, <CODE>inews</CODE> deber&iacute;a publicar el art&iacute;culo. Lo sabr&aacute; Vd. 
porque los programas autom&aacute;ticos de respuesta de <CODE>misc.test</CODE>
contestar&aacute;n a la direcci&oacute;n del campo <CODE>Reply-To</CODE>. Por favor, no publique
art&iacute;culos de prueba en grupos de verdad, como <CODE>c.o.l. :)</CODE> </LI>
</OL>
</P>


<HR>
<A HREF="Noticias-Como-6.html">Anterior</A>
<A HREF="Noticias-Como-8.html">Siguiente</A>
<A HREF="Noticias-Como.html#toc7">Indice</A>
</BODY>
</HTML>
