<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="Hardware">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Guido Socher
 =LF=CAT___: Hardware
 =LF=TITLE_: Contador de Frecuencia de 1Hz-100Mhz con visor LCD e interfaz RS232
 =LF=NUMBER: 253
 =LF=ANAME_: article253.html
 -->
 <TITLE>lf253, Hardware: Contador de Frecuencia de 1Hz-100Mhz con visor LCD e interfaz RS232</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Guido-S.gif" alt="[Photo of the Author]" height="164" width="173">
<BR>por  Guido Socher <a href="http://linuxfocus.org/~guido/"><font size="1">(homepage)</font></a>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Guido ama a Linux no solo porque es divertido descubrir las grandes posibilidades
de estos sistemas, sino tambi&eacute;n por la gente envuelta en su dise&ntilde;o.
</P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Mariano Candido Ucha <small>&lt;uchamariano(at)yahoo.com&gt;</small>
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#253lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#253lfindex1">Qu&eacute; usted necesita</A></LI>
  <LI><A HREF="#253lfindex2">Diagrama esquem&aacute;tico y placa</A></LI>
  <LI><A HREF="#253lfindex3">C&oacute;mo trabaja</A></LI>
  <LI><A HREF="#253lfindex4">El programa</A></LI>
  <LI><A HREF="#253lfindex5">Haciendo el circuito impreso</A></LI>
  <LI><A HREF="#253lfindex6">&iquest;C&oacute;mo construir una caja para el contador de frecuencia?</A></LI>
  <LI><A HREF="#253lfindex7">Montando la placa</A></LI>
  <LI><A HREF="#253lfindex8">Usando el contador</A></LI>
  <LI><A HREF="#253lfindex9">&iquest;Cuan exacto? </A></LI>
  <LI><A HREF="#253lfindex10">El contador en operaci&oacute;n</A></LI>
  <LI><A HREF="#253lfindex11">Para un estudio detallado</A></LI>
  <LI><A HREF="#253lfindex12">Referencias</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=253&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>Contador de Frecuencia de 1Hz-100Mhz con visor LCD e interfaz RS232</H2>
 <IMG src="../../common/images/article253/linuxfcount_topview_small.gif" width="200" height="205" alt="[Illustration]" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>
<P>
Este articulo continuamos con la serie de Microcontroladores AT90S4433. Les sugiero a ustedes que lean art&iacute;culos anteriores sobre los microcontroladores Atmel programando con cuidado:
<OL><LI>How to install and use the Linux AVR development environment and how to build the programmer hardware:
<A href="../March2002/article231.shtml">Marzo 2002, Programando el microcontrolador AVR con GCC</A><LI>How to make your own printed circuit board:
<A href="../May2002/article236.shtml">Mayo 2002, Un panel de control LCD para tu servidor Linux</A></OL>
Esta vez dise&ntilde;amos un contador de frecuencia el cual puede medir frecuencias de 1Hz a 100MHz. Como alternativa usted puede usarlo para contar eventos, tales como cuantas veces una persona cruza la calle (Lo que sea disponible en pulsos digitales). El contador tiene un visor LCD tambi&eacute;n como una interfase RS232 para leer los resultados del contador desde Linux.
</P></P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="253lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

<P>
La frecuencia de una onda senoidal o cuadrada es expresada como numero de oscilaciones por segundo. En orden de determinar la frecuencia de una se&ntilde;al continua una sola cosa es necesaria para contar esas oscilaciones. Este camino nos determina la frecuencia de la primera harm&oacute;nica de la se&ntilde;al continua oscilante. Para medir frecuencias que no son continuas "sonido" compuestas, necesitaremos un analizador de espectro. Este es si embargo una pieza diferente de hardware. Lo que hemos dise&ntilde;ado aqu&iacute; es un contador de frecuencia para se&ntilde;ales continuas oscilantes. Asumimos que la se&ntilde;al no cambia su frecuencia durante un intervalo dado donde muestreamos la se&ntilde;al.
</P>

<P>
Nuestro contador de frecuencia trabaja en 2 pasos:
<OL>
<LI>Saque cualquier compensaci&oacute;n de la C.C. de la se&ntilde;al y despu&eacute;s convi&eacute;rtala en una onda cuadrada usando un comparador del voltaje.
<LI>Cuente el n&uacute;mero de pulsos por vez y div&iacute;da por intervalo de tiempo.
</OL>
</P>

<A NAME="253lfindex1">&nbsp;</A>
<H2>Qu&eacute; usted necesita</H2>

<P>
Para construir el contador de la frecuencia usted necesita las siguientes piezas: <BR>
1 x Atmel At90S4433 Microcontrolador<BR>
1 x z&oacute;calo para CI 28pinos 7,25 mm <BR>
2 x z&oacute;calo para CI 16pinos<BR>
1 x z&oacute;calo para CI 1pin<BR>
1 x z&oacute;calo para CI 14pinos<BR>
No hay z&oacute;calo para CI en el MAX903 y el 74F74. Soldarlos directamente a la placa!<BR>
1 x MAX232<BR>
1 x Cristal 4,194304MHz<BR>
1 x LED (Verde)<BR>
1 x BC557 transistor PNP<BR>
4 x 1uF capacitor (polarizado)<BR>
2 x 27pF capacitor cer&aacute;mico<BR>
4 x 10nF mini capacitor cer&aacute;mico<BR>
3 x 100nF mini capacitor cer&aacute;mico<BR>
1 x 200nF mini capacitor cer&aacute;mico<BR>
1 x 0,47uF mini capacitor cer&aacute;mico<BR>
2 x resistor 470 Ohm<BR>
1 x resistor 470K<BR>
2 x resistor 100 Ohm<BR>
3 x resistor 1k<BR>
5 x resistor 10k<BR>
3 x resistor 47K<BR>
1 x resistor 220 Ohm<BR>
3 x resistor 4K7<BR>
1 x resistor 3k3<BR>
1 x resistor 2k2<BR>
1 x resistor 47 Ohm<BR>
1 x 4K7 potenci&oacute;metro (tan peque&ntilde;o como sea posible), si usted desea puede sustituir este potenci&oacute;metro por un par de resistores. Este potenci&oacute;metro se utiliza para fijar el contraste del LCD. Para mis visores LCD 100Ohm juntas con 1K da un buen contraste.<BR>
1 x diodo Zener 4.3V<BR>
2 x peque&ntilde;os botones de contacto<BR>
1 x 470uF capacitor (polarizado)<BR>
1 x 4,7uF capacitor (polarizado)<BR>
1 x diodo 1N4001 <BR>
1 x 74HC02 TTL IC<BR>
1 x 74F74 fast TTL IC<BR>
1 x 74HC390 TTL IC<BR>
1 x LM393 comparador de tensi&oacute;n<BR>
1 x MAX903 comparado de tensi&oacute;n de alta velocidad, 8 Pinos pl&aacute;sticos empaquetado DIP, usted puede pedirlo directamente de www.maxim-ic.com en caso de que su distribuidor local no lo tenga en la stock.<BR>
1 x 7805 regulador de 5V <BR>
1 x 2 lineas 20 caracteres visor LCD con compatibilidad a la interfase HD44780. Con o sin fondo luminoso (16 pinos o 14 pinos)<BR>
</P>

<P>
Todas los visores LCD que he visto siempre con 14 o 16 pinos en el conector eran compatibles con HD44780. Usted puede usar un visor de 3 o 4 l&iacute;neas pero deber&aacute; modificar el software un poquito.
</P>

<P>
Adem&aacute;s de &eacute;sa usted necesita algunos cables, conectores (BCD, alimentaci&oacute;n, RS232) y un transformador de 9V o alguna otra fuente de alimentaci&oacute;n AC o DC(150mA). Usted consigue a veces las fuentes de alimentaci&oacute;n muy baratas que entran directamente en el z&oacute;calo de pared y se utilizan para toda la clase de aparatos de electr&oacute;nica.
</P>

<A NAME="253lfindex2">&nbsp;</A>
<H2>Diagrama esquem&aacute;tico y placa</H2>

<P>
Utilic&eacute; <A href="http://www.cadsoftusa.com/">eagle</A> para Linux para dise&ntilde;ar el diagrama esquem&aacute;tico y la placa. El programa tiene algunos problemas para entender que todos los contactos diferentes de la fuente de alimentaci&oacute;n en los CI son 5V. Usted por lo tanto recibir&aacute; un error si activa la comprobaci&oacute;n de reglas el&eacute;ctricas. Sin embargo el dise&ntilde;o es correcto.
<BR>
El diagrama esquem&aacute;tico (presione para obtener una imagen mayor):
<BR>
<A href="../../common/images/article253/schematic_big.gif"><IMG src="../../common/images/article253/schematic_small.gif" width="400" height="236" alt="[Schematic]"></A>
<BR>
La placa (presione para obtener una imagen mayor):
<BR>
<A href="../../common/images/article253/board_big.gif"><IMG src="../../common/images/article253/board_small.gif"width="400" height="319" alt="[board]"></A>
<BR>
La placa es espec&iacute;ficamente dise&ntilde;ada para pasatiempos electr&oacute;nicos. Solo la capa azul da a entender que es para ser grabada al agua como una placa de circuito impreso. Las l&iacute;neas rojas son cables. Es mucho m&aacute;s f&aacute;cil y menos preciso se requiere para construir una sola placa de circuito impreso de solo lado. Usted puede poner los cables (rojos) tales que tenga una corta longitud. I could not do that in eagle.
<BR>
El dise&ntilde;o de la placa con fondo blanco para mejor impresi&oacute;n:
<A href="../../common/images/article253/board_white.gif">placa con fondo blanco</A>
<small>(Nota: &Eacute;ste no es el archivo que usted necesita hacer la placa de circuito impreso. )</small>
</P>

<P>
Los archivos del Eagle est&aacute;n todos incluidos junto con el programa (linuxfreqcount-0.4) el cual usted podr&aacute; bajar al final del articulo.
</P>

<A NAME="253lfindex3">&nbsp;</A>
<H2>C&oacute;mo trabaja</H2>

<P>
El microcontrolador AT90S4433 tiene dos contadores internos. Uno es de 16bit de ancho y uno de 8bit de ancho. utilizamos el contador de 8bit de ancho para generar base de tiempo precisa de la frecuencia de reloj del cristal del AT90S4433. Para este prop&oacute;sito usamos un cristal de 4194304Hz y da pulsos al contador de 8bit mediante un pre-escalador interno de 1/256 (v&eacute;ase la hoja de datos del AT90S4433, desc&aacute;rguela al final de este articulo). El contador de 8bit esta configurado para generar una interrupci&oacute;n ante un derrame. En otras palabras obtenemos 4194304Hz / (256 * 256) = 64Hz de base de tiempo. Por usar un lazo variable generamos de estas llamadas de funciones en intervalos de 1Hz o 64Hz.
</P>

<P>
Ahora tenemos una funci&oacute;n la cual es llamada a intervalos de 1Hz o 64Hz dependiendo del modo que nuestro programa contador esta corriendo. Todo lo que necesitamos hacer ahora es leer el contador de 16bit de ancho desde esta funci&oacute;n y mostrar el resultado. El contador de 16bit de ancho (contacto PD5 en el Microcontrolador) obtiene sus pulsos de se&ntilde;al de la se&ntilde;al que queremos medir.
</P>

<P>
El microcontrolador muestrea las se&ntilde;ales de entrada para sincronizarlo con su reloj interno. Seg&uacute;n el teorema de muestreo podemos por lo tanto medir se&ntilde;ales m&aacute;ximas arriba de la mitad de la frecuencia del cristal. Ese es el l&iacute;mite te&oacute;rico. En la practica podemos medir se&ntilde;ales arriba de 1,5MHz con el Microcontrolador.
</P>

<P>
Para medir frecuencia mas altas necesitamos un pre-escalador/divisor. Eso es lo que nos proporcionan los CI 74F74 y 74HC390. El 74F74 es usado como 1/4 divisor r&aacute;pido asincr&oacute;nico y el 74HC390 divisor de 1/25. No podemos utilizar directamente el 74HC390 como un divisor 1/100 porque puede manejar un m&aacute;ximo de 25MHz
</P>

<P>
El circuito prev&eacute; 2 entradas. Una por el divisor 1/100 y uno directo a la entrada. Dependiente en la frecuencia de la se&ntilde;al que usted desea medir use uno de esas l&iacute;neas de entrada (no ambas).
</P>

<P>
Si usted est&aacute; solamente interesado en frecuencias hasta 1.5Mhz (Ej. para establecer medidas para la respuesta de audio de un amplificador de audio) usted puede tambi&eacute;n construir una versi&oacute;n simplificada del contador y dejar afuera el MAX903, 74F74 y el 74hc390. Usted puede utilizar aun el mismo programa software y placa de circuito.
</P>

<P>
El prop&oacute;sito de los 2 comparadores de tensi&oacute;n (MAX903, alta velocidad y LM393) es amplificar las se&ntilde;ales y generar se&ntilde;ales cuadradas por ejemplo ondas senoidales.
</P>

<P>
El cuidado especial fue tomado durante el dise&ntilde;o y la disposici&oacute;n de la placa para evitar oscilaciones de los comparadores cerca del umbral. Observe usted que el MAX903 es realmente un comparador muy de alta velocidad. Si usted utiliza una se&ntilde;al de entrada ruidosa, imagine por ejemplo una se&ntilde;al modulada de 100KHz con 1MHz de ruido, entonces usted contara algunos pulso adicionales de 1MHz cuando la se&ntilde;al de 100KHz cruce el nivel de los cero voltios.
<BR>
El resistor de 220K en el MAX903 evita la influencia del ruido a un cierto grado proporcionando una regeneraci&oacute;n positiva. Usted debe sin embargo no alimentar el contador con se&ntilde;ales ruidosas.
</P>

<P>
El microcontrolador puede ser controlado v&iacute;a RS232 y v&iacute;a 2 botones de presi&oacute;n (bot&oacute;n de limpieza y bot&oacute;n de cambio del modo de conteo).
</P>

<P>
Los 2 canales de entrada son combinados v&iacute;a una compuerta O (74hc02). La compuerta O por supuesto suprimir&aacute; se&ntilde;ales de entrada di desconecta la entrada 1/100 mientras tengamos un "1" l&oacute;gico en las l&iacute;neas de salida del 74hc390. Por lo tanto el 74hc390 es desbloqueado (contacto 2) cuando usted cambia el modo de conteo o cuando presiona el bot&oacute;n de limpieza.
</P>

<A NAME="253lfindex4">&nbsp;</A>
<H2>El programa</H2>

<P>
El programa para el Microcontrolador establece 2 contadores en modo interrupci&oacute;n. Como esto es hecho es descrito muy bien en la hoja de datos del AT90S4433 (v&eacute;ase referencia). Usted tiene que fijar un n&uacute;mero de registros. Es importante pero preferentemente seco. Por lo tanto no lo repetir&eacute; aqu&iacute;. La mayor&iacute;a de la l&oacute;gica del contador es implementada en el archivo <a href="../../common/src/article253/linuxfreqcount_c.html">linuxfreqcount.c</a>. El resto de los archivos son "bibliotecas" para el LCD, el UART, el etc.... Cuando escriba el programa para el Microcontrolador usted debe tener cuidado de no usar mas de 128Bytes de RAM. Es todo lo que tenemos. Por lo tanto es mejor no haber jerarquizado llamadas de la funci&oacute;n con muchos de par&aacute;metros. Se prefieren el uso de banderas y variables globales.
</P>

<P>
Cuando los registros del contador se configuran correctamente entonces la funci&oacute;n SIGNAL(SIG_OVERFLOW0) ser&aacute; llamada en intervalos de 64Hz. Aqu&iacute; leemos el contador de 16bit y establecemos la bandera (hflag) para procesar el resultado del contador por otro lado, funci&oacute;n handlecounterresult(). Con 1Hz de frecuencia de puerta podemos usar directamente el resultado del contador pero con 1/64 seg. de abertura de puerta debemos multiplicar el resultado por 64. Las matem&aacute;ticas que usted puede hacer con el Microcontrolador son limitadas (no tenemos lindos n&uacute;meros enteros de 32bit como en las CPU Pentium). Multipl&iacute;quese afortunadamente por 64 es justo 6 veces desplazadas a la izquierda. Almacenamos el resultado final del contador en variables de 3x 8bit (counterval[3]).
</P>

<P>
Ahora tenemos el valor correcto del contador representado en 24bit. Para exhibirla, necesita ser convertida al ASCII decimal. Printf har&iacute;a normalmente esto pero no tenemos printf y exceder&iacute;a toda nuestra memoria. Haga do en la conversi&oacute;n binario decimal divida &eacute;l numero de 24bit por 10 con recordatorio. Los recordatorios son n&uacute;meros decimales. Nuestra CPU no puede hacer c&aacute;lculos de 24bit por lo tanto procesamos el n&uacute;mero en trozos de 8bit (funci&oacute;n divby10()). Agregando a cada digito el valor ASCII del cero nos provee finalmente con una representaci&oacute;n ASCII de nuestro n&uacute;mero (funci&oacute;n longtoascii()).
</P>

<P>
Esta cadena ASCII puede ser enviada a la l&iacute;nea RS232 y al visor LCD.
</P>

<A NAME="253lfindex5">&nbsp;</A>
<H2>Haciendo el circuito impreso</H2>

<P>
El paquete del programa contiene un archivo postscript (linuxfcount.ps) para la placa de circuito impreso. Personalmente encuentro que los cojines son siempre un poco m&aacute;s chicos. Por lo tanto recomiendo fuertemente agrandarlos un poquito con un marcador antes de grabar a agua fuerte la placa. El proceso c&oacute;mo hacer la placa en casa es descripto en: <A href="../May2002/article236.shtml">Mayo 2002, Un panel de control LCD para tu servidor Linux</A>. Algunos lectores me dijeron que el spray Kontakt Pausklar-21 esta dif&iacute;cil de conseguir. Usted puede usar petr&oacute;leo, como los usados para las l&aacute;mparas de petr&oacute;leo. Usted tiene que deslavar el petr&oacute;leo con un poco de jab&oacute;n antes de poner la placa dentro del desarrollador.
</P>

<A NAME="253lfindex6">&nbsp;</A>
<H2>&iquest;C&oacute;mo construir una caja para el contador de frecuencia?</H2>

<P>
<a href="../../common/images/article253/case_big.jpg"><img src="../../common/images/article253/case_small.jpg" width="236" height="169" align="left" alt="[final case, open]"></a>
<a href="../../common/images/article253/woodenframe.jpg">img src="../../common/images/article253/woodenframe_small.jpg" width="239" height="176" align="right" alt="[wooden frame]"></a>
Un grande problema para los pasatiempos electr&oacute;nicos es usualmente la caja o recept&aacute;culo para todos los lindos circuitos que usted construy&oacute;. Cajas de aluminio pre-construidas son generalmente caras. Exactas medidas de las hojas de metal son dif&iacute;ciles. Yo he encontrado una barata y profesional soluci&oacute;n viable. Yo use una madera de abeto para los costados y las esquinas, usted puede pintarlas un poco para que luzca mas caro. Use una pintura soluble, pintura para interiores. Para el frente, parte superior y la parte inferior yo use una hoja de metal y no necesitan plegarla. Solo c&oacute;rtenlas en las medidas exactas. Ustedes pueden ver en la figura de la derecha como los marcos de madera se parecen. En la izquierda usted ve en la ultima caja (La tapa de la parte superior esta perdida). normalmente recomiendo usar un z&oacute;calo para CI porque hace m&aacute;s f&aacute;cil el encuentro de errores problem&aacute;ticos de ''tiroteo'' pero para estos 2 CI no deber&iacute;as usar z&oacute;calos para reducir los efectos parasitarios no deseados
</P>

<A NAME="253lfindex7">&nbsp;</A>
<H2>Montando la placa</H2>

<P>
<a href="../../common/images/article253/circuitonly.jpg"><img src="../../common/images/article253/circuitonly_small.jpg" width="240" height="156" align="right" alt="[circuit]"></a>
Cuando suelde todas las partes de la placa usted deber&aacute; prestar atenci&oacute;n a la &aacute;rea de alta frecuencia (MAX903 y 74F74 con resistores y capacitores). Yo recomiendo normalmente usar z&oacute;calos para los CI porque hace m&aacute;s f&aacute;cil el encuentro de errores problem&aacute;ticos, pero para estos 2 CI no deber&iacute;as usar z&oacute;calos para reducir los efectos par&aacute;sitos. Para los capacitores de desacople entre tierra y la fuente de alimentaci&oacute;n usted deber&aacute; usar peque&ntilde;os capacitores cer&aacute;micos. El valor de estos capacitores puede ser cualquiera entre 10nF y 100nF.
</P>

<P>
Este es lejos el circuito m&aacute;s complejo que hemos dise&ntilde;ado en LinuxFocus. Recomiendo construirlo en etapas y comprobando mientras tanto que los diferentes componentes est&eacute;n funcionando:
<OL>
<LI>Soldar primero las necesarias de la fuente de alimentaci&oacute;n (7805 etc...) en la placa y comprobar que funcione.
<LI>Soldar todas las partes en la placa pero solo ponga el Microcontrolador en el z&oacute;calo.
<LI>El paquete linuxfreqcount-0.4 incluye un programa de comprobaci&oacute;n, avr_led_lcd_test.c, para comprobar el Microcontrolador, el LED y el LCD. C&aacute;rguelo. Una el cable del programador seg&uacute;n lo descrito en el primer art&iacute;culo del AVR (<A href="../March2002/article231.shtml">Marzo 2002, Programando el microcontrolador AVR con GCC</A>) y luego escriba "make testload" para cargar el programa avr_led_lcd_test del paquete linuxfreqcount-0.4. El LED debe parpadear y el LCD debe demostrar el texto "hola".
<LI>Ponga todos los CI en sus z&oacute;calos. Cargue el programa final (make load). Compruebe nuevamente primero la parte de baja frecuencia y despu&eacute;s la parte de alta frecuencia. Usted necesita una cierta clase de oscilador como fuente de frecuencia (preferentemente se&ntilde;al cuadrada de salida).
</OL>
</P>

<A NAME="253lfindex8">&nbsp;</A>
<H2>Usando el contador</H2>

<P>
El contador puede operar de diferentes modos:
<OL>
<LI>cuenta ascendente continua
<LI>Conteo de frecuencia con una frecuencia de disparo de 1Hz. En este modo usted puede medir frecuencia arriba del m&aacute;ximo del contador de 16bit, 65535Hz o 6553500Hz con el divisor 1/100.
<LI>conteo de frecuencia con una frecuencia de disparo de 64Hz. En este modo usted puede contar frecuencias arriba de 1,5 MHz o 100MHz con el divisor 1/100.
</OL>
<table border=0 align="right">
<tr><td>
<a href="../../common/images/article253/screenshoot.gif">
<img src="../../common/images/article253/screenshoot_small.jpg" width="150" height="157" alt="[ASCII commands via rs232]"></a>
</td><tr>
<tr><td>
<small>RS232 ASCII command interface. </small>
</td><tr>
<table>
Usted puede cambiar el modo v&iacute;a el bot&oacute;n de modo o v&iacute;a la interfaz RS232 con comandos ASCII. La interfaz de comandos ASCII RS232 trabaja como lo descrito en &eacute;l articulo <A href="../May2002/article236.shtml">Mayo 2002, Un panel de control LCD para tu servidor Linux</A>. Los comandos disponibles son descriptos en <a href="../../common/src/article253/README_commands.txt">README.commands</a> file.
</P>

<P>
El LED verde indica que la compuerta esta abierta. Esto es: los pulsos pueden entrar en el contador y ser contados ah&iacute;.
</P>

<P>
El segundo bot&oacute;n es el bot&oacute;n de limpieza. Este bot&oacute;n puede ser utilizado para limpiar el contador (principalmente para modo conteo ascendente) y para seleccionar cambios entre multiplicar por 100 y visualizaci&oacute;n normal. El multiplicar por 100 causa que el resultado mostrado sea multiplicado por 100. De esta forma usted no tendr&aacute; que hacer complicados c&aacute;lculos en su cabeza :-). Es &uacute;til cuando usted utiliza el divisor de 1/100.
</P>

<A NAME="253lfindex9">&nbsp;</A>
<H2>&iquest;Cuan exacto? </H2>

<P>
Cualquier contador electr&oacute;nico tiene un limite exactitud de +/-1. El ultimo digito siempre variar&aacute; un poco aun si ocurriera que usted tenga una se&ntilde;al muy estable de entrada. Si la frecuencia de compuerta es 64Hz entonces el resultado es internamente multiplicado por 64 lo que significa que la exactitud es de +/-64. De la misma forma el divisor 1/100 influye en la exactitud del resultado. Este contador sin embargo es muy bueno. El problema principal es el cambio de temperatura del cristal de 4194304Hz. Los cristales oscilan mas bajo cuando est&aacute;n calientes. Esto es f&iacute;sico lo podr&iacute;a eliminar solo controlando la temperatura exactamente.
</P>

<P>
Es posible calibrar el contador si usted encuentra una buena fuente de se&ntilde;al de referencia. Puede calibrarlo en el programa agregando peque&ntilde;os retrasos en la funci&oacute;n handlecounterresult(). Yo compare los resultados del contador contra una se&ntilde;al de referencia y encontr&eacute; que mi contador era casi preciso. Therefore the calibrate delays are currently commented out in the source code. Puedes bien influir en la frecuencia del cristal un poco cambiando un de los capacitores de 27pF (Tendr&aacute; que experimentar con 10pF, 50pF etc..).
</P>

<P>
Para uso normal en casa no deber&iacute;a ser nada calibrado. Los cristales est&aacute;ndares de 4194304Hz con muy precisos.

<A NAME="253lfindex10">&nbsp;</A>
<H2>El contador en operaci&oacute;n</H2>

<P>
Esta es una foto final del contador en operaci&oacute;n:
<center><a href="../../common/images/article253/inoperation.jpg"><img src="../../common/images/article253/inoperation_small.jpg" width="292" height="143" alt="[the frequency counter]"></a></center>
</P>

<A NAME="253lfindex11">&nbsp;</A>
<H2>Para un estudio detallado</H2>

<P>
En este articulo ning&uacute;n programa de aplicaci&oacute;n es provisto para evaluar autom&aacute;ticamente los resultados bajo Linux. Uno podr&iacute;a imaginar por ejemplo usarlo para contar frecuencia para medir la velocidad del viento en &aacute;reas remotas o alg&uacute;n otro evento que pudiera ser traducido en frecuencias digitales. No es dif&iacute;cil escribir programas bajo Linux para hacer mediciones por un largo tiempo. Usted puede por ejemplo modificar los programas en perl desde &eacute;l articulo <A href="../May2002/article236.shtml">Mayo 2002, Un panel de control LCD para tu servidor Linux</A>. Si usted esta solo interesado en anotar los resultados en un archivo podr&iacute;a usar simplemente estos comandos:
</P>
<p class="code">
ttydevinit /dev/ttyS0<br>
cat /dev/ttyS0 > your_logfile.txt<br>
</p>

<p>
Esto asume que el contador esta conectado en el COM1 (=ttyS0). <BR>
Es f&aacute;cil, o no :-)?
</p>

<A NAME="253lfindex12">&nbsp;</A>
<H2>Referencias</H2>

<UL>
<LI>The uisp AVR programmer software: <A href="http://www.amelek.gda.pl/avr/">www.amelek.gda.pl/avr/</A><br>
    local copy: <a href="../../common/src/article231/uisp-20011025.tar.gz">uisp-20011025.tar.gz</a>
<li> How to build the programmer hardware and install the AVR compiler:<br>
<A href="../March2002/article231.shtml">Marzo 2002, Programando el microcontrolador AVR con GCC</A>
<LI>The source code for this article <A href="../../common/src/article253/linuxfreqcount-0.4.tar.gz">linuxfreqcount-0.4.tar.gz</A>.
    The circuit diagram, the Eagle files and screen shoots are as well included.
<LI>All software (updates will be listed here) and documents :<A href="../../common/src/article253/">software/datasheets</A>
<LI>Datasheet for 74hc390 <A href="../../common/src/article253/74hc390.pdf">74hc390.pdf 48K</A>
<LI>Datasheet for 74f74 <A href="../../common/src/article253/sn54f74.pdf">sn54f74.pdf 84K</A>
<LI>Datasheet for LM393 <A href="../../common/src/article253/LM193.pdf">LM193.pdf 348K</A>
<LI>Datasheet for MAX903 <A href="../../common/src/article253/MAX900-MAX903.pdf">MAX900-MAX903.pdf 164K</A>
<LI>Datasheet for MAX232 <A href="../../common/src/article236/MAX220-MAX249.pdf">MAX220-MAX249.pdf 448K</A>
<LI>Datasheet for ST232, a cheap variant, often sold instead of the real MAX232
    <A href="../../common/src/article236/st232.pdf">st232.pdf 100K</A>
<LI>Datasheet for Atmel AT90S4433 <A href="../../common/src/article231/avr4433.pdf">avr4433.pdf 2356K</A>
<LI>The atmel website: <A href="http://www.atmel.com/">www.atmel.com/</A>
<LI>Eagle for Linux <A href="http://www.cadsoftusa.com/">cadsoftusa.com</A>
</UL>





<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=253&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Guido Socher, <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article253.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Guido Socher (<a href="http://linuxfocus.org/~guido/"><font size="1">homepage</font></a>)</font></td></tr>
  <tr><td><font size="2">en --&gt; es: Mariano Candido Ucha &lt;uchamariano(at)yahoo.com&gt;</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-08-27, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
