<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_2.21">
 <META NAME="LFCATEGORY" CONTENT="System Administration">
<!-- this is used by a number of tools:
 =LF=AUTHOR: Georges     Tarbouriech     
 =LF=CAT___: System Administration
 =LF=TITLE_: FreeBSD, una alternativa real
 =LF=NUMBER: 260
 =LF=ANAME_: article260.html
 -->
 <TITLE>lf260, System Administration: FreeBSD, una alternativa real</TITLE>
<!-- stylesheet added by lfparser: --> 
<style type="text/css">
<!--
 td.top {font-family: Arial,Geneva,Verdana,Helvetica,sans-serif; font-size:12 }
 pre { font-familiy:monospace,Courier }
 p.cl { color:#EE9500 }
 a.nodec { text-decoration:none }
 p.trans { font-size:8pt; text-align:right }
 p.clbox { width:50%; alignment:center; background-color:#FFD700; border-style:none; border-width:medium; border-color:#FFD700; padding:0.5cm ;  text-align:center }
 p.code { width:80%; alignment:center; background-color:#aedbe8; border-style:none; border-width:medium; border-color:#aedbe8; padding:0.1cm ;  text-align:left }
 p.foot { background-color:#AAAAAA; color:#FFFFFF; border-style:none; border-width:medium; border-color:#AAAAAA; padding:0.5cm ; margin-top:0.1cm; margin-right:1cm; margin-left:1cm; text-align:center }
-->
</style>
 
</HEAD>
<BODY bgcolor="#ffffff" text="#000000">
 <!-- this is generated html code. NEVER use this file for your
 translation work. Instead get the file with the same article number
 and .meta.shtml in its name. Translate this meta file and then
 use lfparser program to generate the final article -->
 <!-- lfparser can be obtained from http://www.linuxfocus.org/~guido/dev/lfparser.html -->

<!-- 2pdaIgnoreStart -->

<!-- start navegation bar -->
 <!-- top navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center" width="90%">
   <TR bgcolor="#2e2292">
     <TD class="top"><TABLE cellspacing="0" cellpadding="0" border="0" width=
       "100%">
         <TR><TD width="144"><IMG src="../../common/images/logolftop.gif"
           alt="[LinuxFocus-icon]" width="350" height="45" align="left" 
           border="0"></TD>

           <TD class="top">
             <TABLE width="100%">
               <TR align="right">
                 <TD class="top"><A class="nodec" href="../"><FONT color=
                 "#DDDDDD" size="-1">Hogar</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../map.html"><FONT color=
                 "#DDDDDD" size="-1">Mapa</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../indice.html"><FONT color=
                 "#DDDDDD" size="-1">Indice</FONT></A> &nbsp;|&nbsp; <A class=
                 "nodec" href="../Search/"><FONT color=
                 "#DDDDDD" size="-1">Busqueda</FONT></A> </TD>
               </TR>

               <TR align="right">
                 <TD class="top">
                   <HR width="100%" noshade size="1">
                 </TD>
               </TR>
             </TABLE>
           </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end top navegation bar -->
 <!-- blue bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="90%">
   <TR bgcolor="#00ffff">
     <TD><IMG src="../../common/images/transpix.gif" width="1" height=
     "2" alt=""></TD>
   </TR>
 </TABLE>
 <!-- end blue bar -->
 <!-- bottom navegation bar -->
 <TABLE cellspacing="0" cellpadding="0" border="0" align="center"
 width="94%">
   <TR bgcolor="#000000">
     <TD>
       <TABLE cellspacing="0" cellpadding="1" border="0" width=
       "100%">
         <TR align="center">
           <TD WIDTH="20%"><A class="nodec" href="../News/"><FONT color=
           "#FFFFFF">Noticias</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Archives/"><FONT color=
           "#FFFFFF">Arca</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../Links/"><FONT color=
           "#FFFFFF">Enlaces</FONT></A> </TD>
           <TD WIDTH="5%"><FONT color="#FFFFFF">|</FONT> </TD>
           <TD WIDTH="20%"><A class="nodec" href="../aboutus.html"><FONT color=
           "#FFFFFF">Sobre LF</FONT></A> </TD>
         </TR>
       </TABLE>
     </TD>
   </TR>
 </TABLE>
 <!-- end bottom navegation bar -->
<!-- stop navegation bar -->

<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SSI_INFO STOP -->
<!-- 2pdaIgnoreStop -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0  WIDTH="30%" >
<TR>
<TD>

<!-- 2pdaIgnoreStart -->
<!-- PALM DOC -->
<TABLE BORDER=0 hspace=4 vspace=4> <TR> <TD>
<font size=1> <img src="../../common/images/2doc.gif" width=34 align=left border=0 height=22 alt="convert to palm"><a href="http://cgi.linuxfocus.org/cgi-bin/2ztxt">Convert to GutenPalm</a><br>or <a href="http://cgi.linuxfocus.org/cgi-bin/2pda">to PalmDoc</a></font>
</TD> </TR> </TABLE>
<!-- END PALM DOC -->
<!-- 2pdaIgnoreStop -->
<br>
<IMG src="../../common/images/Georges-Tarbouriech.jpg" width=
    "115" height="124" alt="Georges Tarbouriech">
<BR>por  Georges Tarbouriech  <br> <small>&lt;georges.t(at)linuxfocus.org&gt;</small>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>Georges es un viejo usuario de Unix. El est&aacute; encari&ntilde;ado de las versiones libres de este
 gran sistema.
    </P>
<!-- TRANSLATED TO es -->
<BR><BR><I>Taducido al espa&ntilde;ol por:</I><BR>
Leo Trujillo  (<a href="http://leo.ciberlinea.com"><font size="1">homepage</font></a>)
<br>
<!-- TRANSLATED TO STOP -->
<BR><i>Contenidos</i>:
<UL>
  <LI><A HREF="#260lfindex0">&iquest;Porqu&eacute; FreeBSD ?</A></LI>
  <LI><A HREF="#260lfindex1">Obteniendo e instalando FreeBSD</A></LI>
  <LI><A HREF="#260lfindex2">Configurando FreeBSD</A></LI>
  <LI><A HREF="#260lfindex3">Afinando FreeBSD</A></LI>
  <LI><A HREF="#260lfindex4">Upgrading FreeBSD</A></LI>
  <LI><A HREF="#260lfindex5">Actualizando FreeBSD</A></LI>
  <LI><A HREF="#260lfindex6">Aplicaciones</A></LI>
  <LI><A HREF="#260lfindex7">Hardware</A></LI>
  <LI><A HREF="#260lfindex8">Seguridad</A></LI>
  <LI><A HREF="#260lfindex9">Comunicaciones</A></LI>
  <LI><A HREF="#260lfindex10">Documentaci&oacute;n</A></LI>
  <LI><A HREF="#260lfindex11">&iquest; Qu&eacute; sigue ?</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=260&amp;lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>

</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<br>&nbsp;
<H2>FreeBSD, una alternativa real</H2>
 <IMG src="../../common/images/illustration260.gif"  width="72" height="81" alt="freebsd" hspace="10">
<!-- ABSTRACT OF THE ARTICLE -->
<P><i>Resumen</i>:
<P>


    &iexcl; S&iacute;, usted est&aacute; leyendo LinuxFocus ! Sin embargo, existen otros Unixes libres y estos
   tienen muy interesantes y completas caracter&iacute;sticas. Este art&iacute;culo es una revisi&oacute;n de otro
   Unix Libre: <A href="http://www.freebsd.org">FreeBSD</A>.

    </P>
<HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="260lfindex0">&nbsp;</A>
<H2>&iquest;Porqu&eacute; FreeBSD ?</H2>

<p>
Cuando se habla acerca de los Unixes libres, la gente siempre "piensa en Linux". Ciertamente,
Linux est&aacute; muy esparcido y todos (o casi todos) han oido sobre &eacute;l. El n&uacute;mero de nuevos
usuarios se mantiene en crecimiento
y los medios (ya sean "especializados" o no) hacen mucho "ruido" alrededor del mismo. Una de las principales
razones de este &eacute;xito viene del hecho de que Linux funciona especialmente en m&aacute;quinas Intel, que es la
arquitectura de computadora m&aacute;s ampliamente conocida. Naturalmente, puede funcionar en muchos otros
procesadores, puesto que una de las ideas detr&aacute;s de Unix ha sido "nosotros no nos preocupamos acerca del
procesador". De tal forma, Linux probablemente no hubiera sido tan exitoso si se desarrollara para un
procesador m&aacute;s "confidencial", o al menos, esto hubiera tomado mucho m&aacute;s tiempo
<br>
Pero Unix Libre no est&aacute; limitado a Linux: la "familia" BSD tambi&eacute;n existe.
Hay tres sabores principales: FreeBSD, NetBSD y OpenBSD. BSD significa
Berkeley Software Distribution. Si desea m&aacute;s informaci&oacute;n acerca de la historia de Unix, puede hacer una
revisi&oacute;n en el <A href="../November2000/article176.shtml">art&iacute;culo 176</A>

(Se le advierte desde ahora que este art&iacute;culo no habla acerca de las diferencias entre BSD y System V: ser&iacute;a
necesario un libro para esto.)<br>
Cada sabor tiene algunas cosas espec&iacute;ficas: <ol>
	<li> <A href="http://www.netbsd.org">NetBSD</A> trabaja bajo todas las plataformas del planeta ( o
	casi todas), incluyendo las viejas computadoras: digamos que de entre 30 o 40 plataformas diferentes.
	NetBSD proporciona la evidencia que fue mencionada anteriormente:
Unix no se preocupa acerca de los procesadores. Es la elecci&oacute;n correcta si usted tiene una de esas viejas y
agradables "piezas chatarras" en casa o el trabajo (pero no solo eso, &iexcl; naturalmente !). Personalmente, yo lo
he usado por algunos a&ntilde;os en m&aacute;quinas Amiga o Intel y fu&iacute; muy feliz con &eacute;l.<br></li>
<li> <A href="http://www.openbsd.org">OpenBSD</A> es bien conocido como uno de los Unix m&aacute;s seguros.  Este es
ideal para servidores y, naturalmente, tambi&eacute;n para funcionar con diferentes procesadores. Es probablemente
uno de los sistemas m&aacute;s usados para servidores en Internet. Es poco problable encontrarlo en casa, sin
embargo, har&aacute; todo lo que &eacute;l/ella quieran... <br>
</li>
<li><A href="http://www.freebsd.org">FreeBSD</A> es una "mezcla" de los anteriores. Esta especialmente
dedicado a los procesadores Intel y Alpha y "hereda" una parte de la filosof&iacute;a de seguridad de OpenBSD.
Semejante a Linux, el hecho que funcione con procesadores Intel hace que sea uno de los BSD m&aacute;s ampliamente
conocido. Es una buena elecci&oacute;n para el usuario en casa. &iexcl; Esto no significa que no pueda usarlo en el trabajo
!
</ol>
Hay algo m&aacute;s relacionado a FreeBSD: esta gente "comparte" su trabajo con Apple para esa parte de software
libre de Mac OS X. Y, puesto que estoy muy encari&ntilde;ado con OS X... A prop&oacute;sito, no se confunda: a&uacute;n si OS X
est&aacute; basado en BSD, el kernel no tiene nada que ver con el de FreeBSD. Es un kernel Mach, que ya ha sido
usado en NeXTstep, "padre" de OS X: obviamente, dado que NeXTstep naci&oacute; a finales de los 80's, este kernel a
evolucionado un poco.<br>
Ahora que estamos satisfechos... vayamos un poco m&aacute;s en profundo.
</p>
<A NAME="260lfindex1">&nbsp;</A>
<H2>Obteniendo e instalando FreeBSD</H2>

<p>
Como mucho del software libre, FreeBSD puede ser descargado del sitio web de FreeBSD.
Obviamente, esto requiere una conexi&oacute;n r&aacute;pida. Pero no se preocupe: puede encontrar los CDs en
cualquier parte del Mundo.
<br>
La versi&oacute;n actual (al momento que escribir esto) es la 4.6. Este art&iacute;culo habla acerca de la versi&oacute;n para i386.
<br>
La instalaci&oacute;n de FreeBSD desde CD-ROM (o cualquier otro) es simple... &iexcl; a&uacute;n si no tiene una interfaz gr&aacute;fica !.
En su lugar usar&aacute; ncurses. Siga las instrucciones y finalmente tendr&aacute; a FreeBSD en su disco duro. Como es
usual, tendr&aacute; que particionar su disco duro, configurar algunas cosas tales como la red o a&uacute;n su kernel
(opcional).
A continuaci&oacute;n se encontrar&aacute; con sysinstall, una muy buena herramienta que hace mucho del trabajo de
instalaci&oacute;n, como lo indica su nombre. Ya sea que usted instale la totalidad de los paquetes o solamente
algunos de ellos seg&uacute;n su elecci&oacute;n. Puede agregarlos a ellos en cualquier momento, en todo caso.
<br>
La administraci&oacute;n de paquetes es tambi&eacute;n obvia. Puede usar los comandos pkg, como bajo Solaris, por ejemplo,
o puede preferir los ports. En breve, los comandos pkg son como los rpm's o deb's para Linux, en tanto que
los ports son archivos que ser&aacute;n compilados con make y make install. En otras palabras: nada complejo o
dif&iacute;cil.
<br>
Dado que hacemos comparaci&oacute;n con Linux, agregaremos que existe una compatibilidad con los paquetes de Linux
que usted deber&iacute;a instalar: le permitir&aacute; compilar y ejecutar aplicaciones de Linux.
<br>
Una vez m&aacute;s, todo es obvio y, un manual muy bueno se proporciona, explicando cada paso.
Adem&aacute;s este &uacute;ltimo existe en varias idiomas.
<br>
Por consiguiente, no hay ninguna necesidad de pasar demasiadas horas en este tema.
</p>
<A NAME="260lfindex2">&nbsp;</A>
<H2>Configurando FreeBSD</H2>

<p>
Como ya lo mencionamos, no estamos en la posibilidad como para mencionarlo todo. Lo m&aacute;s importante es saber
donde est&aacute;n los archivos esenciales. Y como es com&uacute;n, los encontrar&aacute; a ellos en el directorio /etc. Ellos son
llamados rc.algo y puede administrar muchas partes diversas:
configuraci&oacute;n en general, el corta fuego (firewall), la red, sysctl, etc.
<br>
Uno de esos archivos importantes es rc.conf, dado que, como su nombre lo dice, la configuraci&oacute;n
puede ser afinada all&iacute;. En este archivo puede decirle al sistema si debe iniciar o no
algunos demonios (sshd, sendmail, etc), el tipo de su firewall, si desea habilitar o no el
nivel seguro del kernel, si quiere habilitar IPv6 o no, etc.
Hay muchas opciones y puede verlas en el archivo por defecto, asombrosamente llamado
/etc/defaults/rc.conf. No se confunda: este archivo contiene los ejemplos de los ajustes por
defecto, no ejemplos. Es decir, /etc/rc.conf elimina estos ajustes de defecto. En otras
palabras, no copie /etc/rc.conf al archivo /etc/defaults/rc.conf ni intente cambiarlo.
Los cambios deben ser hechos en /etc/rc.conf.
<br>
Como informaci&oacute;n, las opciones hechas desde <em>sysinstall</em> son
autom&aacute;ticamente incluidas en /etc/rc.conf (configuraci&oacute;n de la tarjeta de red, hostname,
nivel de seguridad, etc).
<br>
Una nota muy importante: FreeBSD viene sin los servicios activados en
/etc/inetd.conf. Esto significa, en un principio, que los demonios administrados desde inetd est&aacute;n
desactivados por defecto. Em mi humilde opini&oacute;n, esto deber&iacute;a ser obligatorio en cada sistema Unix.
&iexcl; Buena idea, de cualquier manera!
<br>
Los dem&aacute;s archivos rc le permitir&aacute;n configurar ya sea el firewall o el sysctl
y muchos otros. Esto, desde luego, nos permite afinar FreeBSD.
</p>
<A NAME="260lfindex3">&nbsp;</A>
<H2>Afinando FreeBSD</H2>

<p>
Una de las mejores herramientas  para afinar es llamada sysctl (&iexcl;bajo Linux tambi&eacute;n!).
Usted puede utilizarla desde la l&iacute;nea de comandos para definir un valor espec&iacute;fico o puede
escribir un archivo sysctl.conf (recomendado a menos que utilice la l&iacute;nea de comando para
prop&oacute;sitos de prueba).
<br>
Por ejemplo, si su m&aacute;quina es usada como un gateway, sysctl puede permitir la expedici&oacute;n del
IP con el comando <em>sysctl -w net.inet.ip.forwarding=1</em>.
Para mayor seguridad puede comprobar que los paquetes que vienen a un interfaz tengan la
direcci&oacute;n IP correspondiente a esta interfaz con el comando
<em>sysctl -w net.inet.ip.check_interface=1</em>. Puede controlar mucho del comportamiento de
su sistema usando sysctl: compruebe la p&aacute;gina de man. Obviamente, si desea escribir &eacute;stos en
un archivo sysctl.conf, despu&eacute;s agregue los argumentos sin incluir el comando sysctl mismo.
El archivo utiliza el formato <em>variable = valor</em>. Los ejemplos antedichos entonces se convierten:<br>
net.inet.ip.forwarding=1<br>
net.inet.ip.check_interface=1<br>
&iexcl; Por supuesto, su propio archivo sysctl.conf se supone contendr&aacute; m&aacute;s de dos l&iacute;neas
puesto que puede controlar todo en nivel del n&uacute;cleo, bueno, casi !
<br>
Al principio de este art&iacute;culo, hablamos acerca de niveles de seguridad.
Hay cuatro distintos, desde <em>-1</em> hasta <em>3</em>. <em>-1</em> representa el
nivel inseguro y <em>3</em> representa el nivel m&aacute;s alto de seguridad.
Se recomienda entender lo que hace cada nivel antes de seleccionar uno. Usar niveles distintos
de -1 o de 0 puede conducir a un sistema incapaz de trabajar como usted espera.
La primera desventaja aparece en el nivel 1 puesto que puede evitar que  use
correctamente el servidor X. Ni puede ya sea cargar o descargar los m&oacute;dulos del n&uacute;cleo,
por ejemplo. &iexcl; Ya est&aacute; advertido !
<br>
Sin embargo, estos altos niveles de seguridad pueden ser &uacute;tiles para un servidor espec&iacute;fico que
necesita alta seguridad. Como un usuario casero deber&iacute;a mantener el nivel 0,
pero esto le corresponde a usted...
<br>
El comando <em>chflags</em> esta relacionado con los niveles de seguridad. Investige
este comando, lea la p&aacute;gina man: es bastante poderoso.
<br>
Continuar con esto har&iacute;a un art&iacute;culo sobre "seguridad en FreeBSD", por tanto. pasemos
al siguiente cap&iacute;tulo.
</p>
<A NAME="260lfindex4">&nbsp;</A>
<H2>Upgrading FreeBSD</H2>

<p>
Asumamos que usted acaba de comprar un conjunto de CDs de FreeBSD 4,5. Algunos d&iacute;as m&aacute;s adelante,
se lanza FreeBSD 4,6. &iexcl;Mala suerte!
<br>
No se preocupe: FreeBSD viene con un sistema de actualizaci&oacute;n v&iacute;a CVS. Puede utilizar CVS
an&oacute;nimo o CVSup. El primero es m&aacute;s f&aacute;cil de utilizar, mientras que el segundo es m&aacute;s eficiente.
Con estas herramientas, el trabajo consiste en conseguir el &aacute;rbol de la nueva fuente y sincronizarlo.
<br>
Despu&eacute;s, tendr&aacute; que compilar el nuevo conjunto completo usando <em>make buildworld</em>.
C&oacute;mo se hace &eacute;sto, est&aacute; absolutamente bien explicado en el manual proporcionado.
El punto importante es que &eacute;ste permite que usted tenga un sistema siempre actualizado.
<br>
Sin embargo, &eacute;ste no es el final de esto. Como siempre, por lo que al software libre concierne,
las vulnerabilidades se encuentran y se solucionan muy r&aacute;pidamente. A diferencia de muchos
sistemas propietarios donde una vulnerabilidad puede permanecer sin resolverse para siempre
(y un d&iacute;a), la gente implicada en software libre reacciona a la velocidad de la luz y provee
los remiendos. Obviamente, es su trabajo comprobar qu&eacute; todo esta correctamente. El sitio web de
FreeBSD tiene una secci&oacute;n de seguridad que mantiene advertencias por cada lanzamiento.
All&iacute; puede descargar los archivos .asc (archivos de texto) que le dicen lo que tiene que
saber: una descripci&oacute;n del problema y su soluci&oacute;n. Otros sitios de la web le proveen de esta
informaci&oacute;n. Mencionemos, por ejemplo, <a href="http://www.linuxsecurity.com">linuxsecurity</a>,
 <a href="http://www.cert.org">CERT</a> etc.
<br>
Esto significa, naturalmente, que actualiz&oacute; su sistema.
</p>
<A NAME="260lfindex5">&nbsp;</A>
<H2>Actualizando FreeBSD</H2>

<p>
Usted no desea mantener vulnerabilidades bien conocidas en su sistema, &iquest;O s&iacute;?
FreeBSD, como los otros Unixes libres, provee de parches. Obtenga estos parches y
apl&iacute;quelos. Para los usuarios de Linux, la diferencia principal viene del hecho de que
usted no consigue un paquete corregido sino  una fuente con el parche en su lugar.
Lo que significa, que tiene que recompilar el kernel despu&eacute;s que parchea el c&oacute;digo fuente, &eacute;sto
por supuesto, implicando que el c&oacute;digo fuente est&aacute; instalado en su m&aacute;quina.
Esto es verdad bajo Linux tambi&eacute;n, pero la gente descarga a menudo el RPM modificado
(por ejemplo), por lo menos para las aplicaciones corregidas, pero tambi&eacute;n para el n&uacute;cleo parcheado.
<br>
Una de las diferencias m&aacute;s importantes entre Linux y FreeBSD viene del n&uacute;cleo.
FreeBSD se basa en BSD 4.4 y no tiene varias versiones del n&uacute;cleo como el mundo Linux.
Esto significa que el n&uacute;cleo es estable, pero por supuesto llega a ser m&aacute;s grande con el tiempo,
 siendo algo monol&iacute;tico incluso si puede beneficiarse de m&oacute;dulos. La desventaja es que usted
tendr&aacute; que compilar su n&uacute;cleo m&aacute;s a menudo que bajo Linux si desea mantener su sistema tan
seguro como sea posible.
<br>
De todas formas, yo prefiero esta filosof&iacute;a que la de Linux, pero &eacute;sta es solamente mi opini&oacute;n.
No pienso que teniendo, digamos, 3 diversos n&uacute;cleos "en el trabajo" pueda conducir a la
estabilidad. Y a&uacute;n, sin mencionar las apliciones que deben ser "portadas" de una versi&oacute;n a otra,
 especialmente si nos centramos en la seguridad. Otro ejemplo podr&iacute;a ser el sistema de
filtraci&oacute;n de paquetes: &iexcl;3 versiones del n&uacute;cleo, 3 diferentes paquetes
de software de filtraci&oacute;n! Etc&eacute;tera.
<br>
Tengo mucho respeto por la gente que hace este gran trabajo, sin embargo, es la manera
correcta de hacer cosas. La mejora es siempre una necesidad pero, &iquest;es coherente  cambiar todo
a toda hora? &iexcl;No se preocupe!
<br>
Obviamente, tambi&eacute;n puede compilar un nuevo n&uacute;cleo para hacer que se acople a sus necesidades...
 y esta vez  es como bajo Linux. La manera de hacer esto est&aacute; detallado muy bien en el manual,
as&iacute; que vayamos a algo m&aacute;s.
</p>
<A NAME="260lfindex6">&nbsp;</A>
<H2>Aplicaciones</H2>

<p>
Como ya lo mencionamos, una basta variedad de aplicaciones de software libre (sino es que todas)
funcionan bajo FreeBSD. No necesita los ya mencionados ports o paquetes. Puede compilar muchos de los
archivos disponibles, dependiendo del tipo de software.
<br>
Para los adictos de los ambientes de escritorio, Gnome y KDE est&aacute;n disponibles...
y se incluyen en la distribuci&oacute;n. Igual para los administradores de ventanas. El gran marco
GNUstep tambi&eacute;n trabaja muy bien bajo FreeBSD. Para compilarlo, necesita una m&aacute;s reciente
versi&oacute;n de GCC que la que est&aacute; incluida en la distribuci&oacute;n: &iexcl;no hay problema!
Obtenga el archivo correspondiente y compile el nuevo compilador. Obviamente, las aplicaciones
tales como GNUMail.app, Gorm.app o ProjectBuider.app funcionar&aacute;n muy bien.
<br>
Realmente, todo el software de se ejecuta bajo Linux est&aacute; disponible para FreeBSD... &iexcl; y
existen muchos otros !
<br>
Por ejemplo, FreeBSD viene com much&iacute;simas herramientas relacionadas con la seguridad.
Herramienats de monitoreo, de administraci&oacute;n, etc, que son parte de la distribuci&oacute;n.
<br>
Corta Fuegos (Firewalls), proxies, exploradores de puertos, IDS, etc, est&aacute;n tambi&eacute;n
disponibles. As&iacute;, puede elegir entre IPsec o ipfw. Puede usar nessus, nmap, portsentry, etc.
De nuevo, muchos de ellos son parte de la distribuci&oacute;n y nada lo detiene para que obtenga
y compile las &uacute;ltimas versiones.
<br>
Hablamos ya de ambientes de escritorio o manejadores de ventanas, pero no dijimos una palabra
sobre lo que requieren para funcionar: el X Window System. XFree 4.* est&aacute; ahora por defecto.
Para su informaci&oacute;n, hasta FreeBSD 4,5, XFree 3. * estaba como defecto. Es decir, usted ten&iacute;a
XFree 4.* en la distribuci&oacute;n, pero el proceso de instalaci&oacute;n seleccionaba XFree 3.*.
Ahora, XFree 4.* es el defecto pero puede todav&iacute;a utilizar la versi&oacute;n 3.* si lo prefiere.
</p>
<A NAME="260lfindex7">&nbsp;</A>
<H2>Hardware</H2>

<p>
Puesto que estamos hablando de la versi&oacute;n i386, diremos que mucho del hardware disponible
trabajar&aacute; bajo FreeBSD, incluso cuando es un poco viejo. Por ejemplo una vieja tarjeta
3Com combo de red trabajar&aacute; muy bien tan pronto como usted defina el tipo de medio
en el comando ifconfig. Si utiliza una conexi&oacute;n BNC, basta con agregar el <em>media 10base2/BNC</em>
al final de la l&iacute;nea ifconfig en /etc/rc.conf.
<br>
Igual para algunas viejas tarjetas gr&aacute;ficas: usar XFree 4. * solucionar&aacute; la mayor&iacute;a de los
problemas. Esto es particularmente cierto para las tarjetas algo viejas ATI.
<br>
De cualquier modo, aseg&uacute;rese de consultar las notas de Hardware en el sitio web de FreeBSD.
</p>
<A NAME="260lfindex8">&nbsp;</A>
<H2>Seguridad</H2>

<p>
Mencionamos ya algunas herramientas tales como cortafuegos, exploradores de puertos, etc.
FreeBSD viene con muchas otras herramientas de seguridad. OpenSSH, OpenSSL, Kerberos, MD5,
etc, son parte de la distribuci&oacute;n. Como de costumbre, no puede vivir sin esas herramientas, y
por supuesto, otra vez, tiene que comprobar para saber si hay algunas vulnerabilidades
eventuales.
<br>
Un ejemplo reciente demuestra la importancia de ser muy cuidadoso. Digamos que le advierten
que una vulnerabilidad se ha descubierto en OpenSSH, por ejemplo. El comportamiento correcto
es ir a su sitio Web y descargar la versi&oacute;n corregida.
<br>
&iexcl;S&iacute;, pero si no es suficiente! Por favor, controle la suma de comprobaci&oacute;n (CheckSum) del paquete.
<br>
El ejemplo de OpenSSH no ha sido tomado arbitrariamente: hace algunas semanas, alguien
substituy&oacute; el archivo original por uno corrupto. Como de costumbre, la gente en OpenSSH
reaccion&oacute; r&aacute;pidamente. Sin embargo, los usuarios que descargaban el paquete en este lapso de
tiempo corto sin verificar la suma de comprobaci&oacute;n han instalado una versi&oacute;n "mala". Por lo
tanto, la necesidad de usar la suma de comprobaci&oacute;n... y la necesidad de controlarla.
<br>
Incluso si est&aacute; fuera del alcance de este art&iacute;culo, insistimos  que el tema de la seguridad,
es antes de todo un comportamiento.
</p>
<A NAME="260lfindex9">&nbsp;</A>
<H2>Comunicaciones</H2>

<p>
Las redes bajo FreeBSD se desenvuelven muy bien. La implementaci&oacute;n de IPv6 est&aacute; muy bien hecha.
Los nuevos medios de comunicaci&oacute;n no se dejan a un lado. Si usted utiliza  ADSL o los
cable modems, la configuraci&oacute;n es muy f&aacute;cil.
<br>
Muchos ISP usan hoy PPPoE. FreeBSD maneja esto de una manera muy simple:
Algunas l&iacute;neas en el archivo de ppp.conf har&aacute;n el truco. Para PPPoA (ATM), solamente el m&oacute;dem
Alcatel es soportado por el momento. Esto debe cambiar en un futuro cercano (quiz&aacute;s, ya existen
otros m&oacute;dems soportados).
</p>
<A NAME="260lfindex10">&nbsp;</A>
<H2>Documentaci&oacute;n</H2>

<p>
El manual proporcionado no es la &uacute;nica documentaci&oacute;n disponible. Puede tambi&eacute;n encontrar un FAQ,
una gu&iacute;a de instalaci&oacute;n, etc, en el sitio web de FreeBSD. Otra fuente importante de informaci&oacute;n
se puede encontrar en <a href="http://www.freebsd-howto.com">http://www.freebsd-howto.com.</a>
</p>
<A NAME="260lfindex11">&nbsp;</A>
<H2>&iquest; Qu&eacute; sigue ?</H2>

<p>
&Eacute;sta es una descripci&oacute;n muy corta de FreeBSD. Este sistema, como otros Unixes libres es muy
interesante. Tiene muchas grandiosas caracter&iacute;sticas y realmente merece un intento.
Desafortunadamente este art&iacute;culo no puede ser una revisi&oacute;n completa y las porciones de
caracter&iacute;sticas importantes incluso no se han mencionado.
<br>
FreeBSD requerir&aacute; m&aacute;s conocimiento de Unix que algunas distribuciones de "Windowish" Linux,
pero sigue siendo absolutamente f&aacute;cil utilizar.
<br>
Por supuesto, alguien sin el conocimiento de Unix puede estar en apuros, puesto que tiene que
recompilar el kernel frecuentemente despu&eacute;s de actualizar el sistema. Sin embargo,
esto es una buena manera de aprender, incluso si puede tomar un "cierto" tiempo.
La gente parece hoy haberse olvidado de que, en un principio, Unix fue hecho por
desarrolladores para desarrolladores, no para el usuario casero o el usuario normal.
<br>
Afortunadamente los Unixes libres y propietario han cambiado el acercamiento original.
Gracias a los muchos desarrolladores que hicieron esto posible. En los a&ntilde;os 80, la mayor&iacute;a de
los usuarios de Linux de hoy habr&iacute;an que ejecutar otra vez Unix, solamente debido al proceso
de instalaci&oacute;n. Las distribuciones ven&iacute;an en cintas y la fase de instalaci&oacute;n podr&iacute;a durar
un d&iacute;a laborable completo, el proceso de configuraci&oacute;n requer&iacute;a por lo menos otro d&iacute;a.
&iexcl;Por no mencionar la configuraci&oacute;n de aplicaciones! Y hoy, usted puede utilizar Unix
sin incluso saberlo, con sistemas como Mac OS X. Esto ya era cierto al principio de los a&ntilde;os 90
con el "padre" de OS X, NeXTstep.
<br>
&iexcl;&Eacute;ste puede verse como un off-topic, sin embargo, NeXTstep conduce el camino para
Unixes libres y propietarios... &iexcl; y algunos otros ! Traer Unix al usuario casero era un desaf&iacute;o y
por lo menos, sucedi&oacute;. Felicitaciones a toda la gente implicada en este desaf&iacute;o, si trabajaron
por dinero o para lo libre. Los que trabajaron para lo libre merecen una menci&oacute;n especial y
mucho m&aacute;s agradecimiento ;-)
<br>
El hecho de que FreeBSD "comparte" con Apple me parece muy bueno.
Cada uno se beneficia del otro de la manera correcta. El software Propietario utiliz&oacute; siempre software
libre... sin  "vociferarlo" muy ruidosamente. Apple dice abiertamente que utilizan software
libre y as&iacute; lo hace  SGI. Algunos otros parecen hacer lo mismo... pero con un motivo m&aacute;s
ulterior. De todas formas, mantengo el pensamiento de que hay "sitio" para todos... bien,
a excepci&oacute;n de los que deseen el "cuarto entero".
<br>
El "ruido" sobre Linux mantiene a los otros Unixes libres en la obscuridad: hasta ahora, es bueno.
Esto puede tener su lado brillante... y &eacute;sta es la raz&oacute;n principal por la que utilizo FreeBSD.
Por supuesto, contin&uacute;o usando Linux (y muchos otros): &iexcl; Me gusta la diversidad !
<br> si usted siente que le gustar&iacute;a probar FreeBSD, este art&iacute;culo no ser&aacute; en vano.
Pru&eacute;belo por s&iacute; mismo y descubrir&aacute; la gran cantidad de cosas no mencionadas aqu&iacute;.
<br>
Ya se lo he dicho: &iexcl; Vivimos una &eacute;poca maravillosa !
</p>
 


<!-- 2pdaIgnoreStart -->
<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=260&amp;lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="98%">
<TR><TD ALIGN=CENTER BGCOLOR="#9999AA" WIDTH="50%">
<A HREF="../../common/lfteam.html">Contactar con el equipo de LinuFocus</A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges     Tarbouriech     , <a href="../../common/copy.html">FDL</a> <BR><a href="http://www.linuxfocus.org">LinuxFocus.org</a></FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&amp;article=article260.html" target="_TOP">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</A><BR></TD>
<TD BGCOLOR="#9999AA">
<!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font>
<TABLE>
  <tr><td><font size="2">en --&gt; -- : Georges Tarbouriech  <small>&lt;georges.t(at)linuxfocus.org&gt;</small></font></td></tr>
  <tr><td><font size="2">en --&gt; es: Leo Trujillo  (<a href="http://leo.ciberlinea.com"><font size="1">homepage</font></a>)</font></td></tr>
</TABLE>
</TD>
</TR></TABLE></CENTER>
<p><font size=1>2002-09-17, generated by lfparser version 2.21</font></p>
<!-- 2pdaIgnoreStop -->
</BODY>
</HTML>
