<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_1.8">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Software Development">
 <TITLE>Software Development : Revisi&oacute;n de producto: SNiFF+ para Linux</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Guido-S.gif" ALT="[Photo of the Author]" HEIGHT=164 WIDTH=173>
<BR>por  <A HREF="mailto:guido.socher@linuxfocus.org">Guido Socher</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Guido es un fan de Linux desde hace tiempo. Su p&aacute;gina sobre Linux puede
encontrarse en
<a href="http://www.oche.de/~bearix/g/">www.oche.de/~bearix/g/</a>.
</P>
<P><FONT COLOR="#336633">Contenidos</FONT>:
<UL>
  <LI><A HREF="#lfindex0">&iquest;Qu&eacute; es SNiFF+ ?</A></LI>
  <LI><A HREF="#lfindex1">Instalaci&oacute;nn</A></LI>
  <LI><A HREF="#lfindex2">Documentaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex3">Principales componentes de SNiFF+</A></LI>
  <LI><A HREF="#lfindex4">Los inconvenientes&nbsp;</A></LI>
  <LI><A HREF="#lfindex5">Conclusi&oacute;n</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=140&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Revisi&oacute;n de producto: SNiFF+ para Linux</H2>
 <IMG SRC="../../common/images/article140/illustration140.gif" ALT="[Illustration]" HSPACE=10 HEIGHT=80 WIDTH=159><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
<P>
SNiFF+ de <EM>takefive software</EM> es un entorno integrado de desarrollo
disponible para Linux. Takefive ofrece una versi&oacute;n descargable gratuita en
<a href="http://www.takefive.com/penguin">http://www.takefive.com/penguin</a>.
El software revisado aqu&iacute; viene de un CD de demostraci&oacute;n, y parece id&eacute;ntico
a la versi&oacute;n descargable. La restriccio&oacute;n en ambas versiones es que tienen
un l&iacute;mite de 200 ficheros. Esta revisi&oacute;n corresponde a la versi&oacute;n 3.2 de
SNiFF+, y ha sido probada bajo Redhat Linux 6.0.
</P></P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>&iquest;Qu&eacute; es SNiFF+ ?</H2>


<p>
SNiFF+ es un entorno integrado de desarrollo para los lenguajes C, C++,
Java, IDL, Fortran77, Fortran90 y ADA. SNiFF+ te da la posibilidad de
entender el c&oacute;digo de forma gr&aacute;fica. Los usuarios de otros sistemas
operativos importantes posiblemente hayan usado entornos de desarrollo
similares, por lo que estar&aacute;n muy contentos de ver un entorno de estas
caracter&iacute;sticas disponible para Linux.
</p>

<p>
SNiFF+ y los entornos de desarrollo integrados suelen ser &uacute;tiles cuando
se trabaja con c&oacute;digos muy grandes y en aquellos casos en que es necesario
realizar cambios a c&oacute;digo que no ha sido completamente escrito por uno mismo.
SNiFF+ soporta varias herramientas de control de versiones, como RCS,
CVS, clearcase, etc... Esto lo hace ideal para equipos involucrados en
grandes proyectos.
</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>Instalaci&oacute;nn</H2>

<p>
SNiFF+ para Linux viene con un script de instalaci&oacute;n. Este script te
lleva a un modo de di&aacute;logo. No tuve ning&uacute;n problema al usarlo. SNiFF+
a&uacute;n no est&aacute; disponible en formatos empaquetados como rpm o deb, pero
esto no es un problema, ya queSNiFF+ no se reparte por todo el arbol
de directorios. El script instala todo bajo un &uacute;nico directorio (yo
eleg&iacute; /opt/sniff) y es por tanto muy sencillo de desinstalar con
posterioridad. Debajo se muestra el comienzo del script de instalaci&oacute;n
con las diferentes plataformas UNIX para las que SNiFF+ est&aacute; disponible.
<CENTER><TABLE BORDER=0 WIDTH="60%" BGCOLOR="#000000" >
<TR>
<TD>
<font color="#FFFFFF" size="-1" >
<br>&nbsp;
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;SNiFF+&nbsp;3.2&nbsp;installation&nbsp;procedure
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Copyright&nbsp;(c)&nbsp;1993-1999&nbsp;TakeFive&nbsp;Software&nbsp;GmbH.
<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;All&nbsp;rights&nbsp;r
eserved.
<br>&nbsp;
<br>&nbsp;Please&nbsp;select:
<br>&nbsp;
<br>&nbsp;&nbsp;&nbsp;[A]&nbsp;&nbsp;&nbsp;Install&nbsp;SNiFF+&nbsp;binaries
<br>&nbsp;&nbsp;&nbsp;[B]&nbsp;&nbsp;&nbsp;Install&nbsp;GNU&nbsp;binaries
<br>&nbsp;&nbsp;&nbsp;[C]&nbsp;&nbsp;&nbsp;Install&nbsp;FlexLM&nbsp;binaries
<br>&nbsp;
<br>&nbsp;&nbsp;&nbsp;[X]&nbsp;&nbsp;&nbsp;Exit&nbsp;installation
<br>&nbsp;
<br>&nbsp;Your&nbsp;selection:&nbsp;a
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;SNiFF+&nbsp;can&nbsp;be&nbsp;installed&nbsp;for&nbsp;multiple&nbsp;platforms&nbsp;in&nbsp;one&nbsp;directory.&nbsp;It&nbsp;is&nbsp;also
<br>&nbsp;possible&nbsp;to&nbsp;install&nbsp;a&nbsp;SNiFF+&nbsp;kit&nbsp;for&nbsp;a&nbsp;platform&nbsp;which&nbsp;is&nbsp;not&nbsp;the&nbsp;installation
<br>&nbsp;platform.&nbsp;Therefore,&nbsp;please&nbsp;select&nbsp;first&nbsp;the&nbsp;target&nbsp;platforms
<br>&nbsp;and&nbsp;then&nbsp;the&nbsp;installation&nbsp;platform.
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;Enter&nbsp;the&nbsp;platform(s)&nbsp;for&nbsp;which&nbsp;you&nbsp;want&nbsp;to&nbsp;install&nbsp;SNiFF+:
<br>&nbsp;
<br>&nbsp;sunos&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;for&nbsp;Sun&nbsp;SPARC&nbsp;machines&nbsp;running&nbsp;SunOS4&nbsp;(Solaris&nbsp;1.x)
<br>&nbsp;solaris&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;for&nbsp;Sun&nbsp;SPARC&nbsp;machines&nbsp;running&nbsp;SunOS5&nbsp;(Solaris&nbsp;2.x)
<br>&nbsp;aix&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;for&nbsp;IBM&nbsp;Risc&nbsp;machines&nbsp;running&nbsp;AIX&nbsp;4.x
<br>&nbsp;hpux&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;for&nbsp;HP&nbsp;9000/7XX&nbsp;machines&nbsp;running&nbsp;HP-UX&nbsp;10.x/11.x
<br>&nbsp;decalpha&nbsp;&nbsp;&nbsp;&nbsp;for&nbsp;DEC/alpha&nbsp;machines&nbsp;running&nbsp;Digital&nbsp;UNIX&nbsp;3.x/4.x
<br>&nbsp;irix&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;for&nbsp;SGI&nbsp;machines&nbsp;running&nbsp;IRIX&nbsp;5.3&nbsp;or&nbsp;later
<br>&nbsp;unixware&nbsp;&nbsp;&nbsp;&nbsp;for&nbsp;PC's&nbsp;running&nbsp;SCO&nbsp;Unixware&nbsp;7.x/2.x&nbsp;or&nbsp;OpenServer&nbsp;5.x
<br>&nbsp;linux-glibc&nbsp;for&nbsp;PC's&nbsp;running&nbsp;Linux&nbsp;2.x&nbsp;based&nbsp;on&nbsp;GNU&nbsp;glibc&nbsp;2.1&nbsp;(like&nbsp;RedHat&nbsp;6.x)
<br>&nbsp;sinix&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;for&nbsp;SNI&nbsp;RM&nbsp;machines&nbsp;running&nbsp;Reliant&nbsp;Unix&nbsp;5.4x
<br>&nbsp;
<br>&nbsp;Enter&nbsp;one&nbsp;name&nbsp;at&nbsp;a&nbsp;time&nbsp;(Leave&nbsp;empty&nbsp;to&nbsp;finish&nbsp;the&nbsp;selection).
<br>&nbsp;
<br>&nbsp;Target&nbsp;platform&nbsp;number&nbsp;1&nbsp;:&nbsp;linux-glibc
<br>&nbsp;Target&nbsp;platform&nbsp;number&nbsp;2&nbsp;:
<br>&nbsp;
<br>&nbsp;....the&nbsp;script&nbsp;continues&nbsp;here&nbsp;with&nbsp;more&nbsp;questions.....
</font>
</TD>
</TR>
</TABLE></CENTER>
</p>

<p>
Uno de los errores que comet&iacute; durante la instalaci&oacute;n fue en el di&aacute;logo
que me permit&iacute;a instalar "Vim 5.0 Vi Improved por Bram Moolenar". Puesto
que ya lo ten&iacute;a en mi disco duro, decid&iacute; no instalar Vim. Esto se mostr&oacute;
como un error, y me v&iacute; obligado a instalarlo m&aacute;s tarde. La versi&oacute;n de
Vim que viene con SNiFF+ es especial. Tiene la capacidad de comunicarse
con otras herramientas del entorno de desarrollo. Por tanto, si pretentes
usar vi, has de instalar este Vim especial.
</p>

<p>
SNiFF+ se puede instalar en cualquier parte. Por ello, es necesario hacer
dos cosas despu&eacute;s de completar la instalaci&oacute;n:
<ol>
<li>fijar la variable de entorno SNIFF_DIR al lugar en el que se ha
instalado SNiFF+ (/opt/sniff en mi caso).
<li>ampliar el PATH para que incluya el directorio binario de SNIFF_DIR
(/opt/sniff/bin en mi caso).
</ol>
Seg&uacute;n el shell que usemos, tendremos que editar /etc/profile y
~/.bashrc para bash o /etc/csh.cshrc y .tcshrc para tcsh o el que sea
el fichero rc correspondiente a tu shell. Si no quieres editar los ficheros
rc de tu shell, puedes usar este peque&ntilde;o script que llamo startsniff:
<pre>
#!/bin/sh
PATH="$PATH:/opt/sniff/bin"
export PATH
MANPATH="$MANPATH:/opt/sniff/man"
export MANPATH
SNIFF_DIR=/opt/sniff
export SNIFF_DIR
#start sniff now:
sniff
</pre>
</p>

<A NAME="lfindex2">&nbsp;</A>
<H2>Documentaci&oacute;n</H2>


<p>
<a href="../../common/images/article140/help.gif"><img src=../../common/images/article140/helpthumb.gif alt="tutorial in netscape" align=right></a>
SNiFF+ viene con un sistema de documentaci&oacute;n en html bastante agradable.
Parece existir la posibilidad de imprimir la documetaci&oacute;n desde ficheros
postscript, pero nunca sent&iacute; la necesidad de hacerlo, y la documentaci&oacute;n
en html es buena. Al arrancar SNiFF+ con el comando sniff aparece una
pantalla de bienvenida. Esta pantalla nos da la posibilidad de ir
directamente a la documentaci&oacute;n espec&iacute;fica para un lenguaje de programaci&oacute;n.
Al seleccionar este modo, se arranca netscape con el tutorial correspondiente.
Un vistazo, aunque sea r&aacute;pido, al tutorial es muy recomendable.
</p>

<A NAME="lfindex3">&nbsp;</A>
<H2>Principales componentes de SNiFF+</H2>

<p>
<a href="../../common/images/article140/launch.gif"><img src=../../common/images/article140/launchthumb.gif alt="launcher" align=right></a>
<b>El lanzador</b>
<BR>
Un proyecto es el principal elemento estructural de SNiFF+ para agrupar
ficheros y directorios. Al arrancar sniff, te aparece una peque&ntilde;a ventana
de lanzamiento. A partir de ella puedes crear nuevos proyectos, y puedes
revisar los ya existentes. Aqu&iacute; es donde se suele empezar a trabajar,
arrancando el editor de proyectos o el visualizador de s&iacute;mbolos.
</p>

<p>
<a href="../../common/images/article140/projecteditor.gif"><img src=../../common/images/article140/projecteditorthumb.gif alt="launcher" align=right></a>
<b>El editor de proyectos</b>
<BR>
Con el editor de proyectos puedes ver todos los ficheros de c&oacute;digo que pertenecen
a un proyecto. Puedes filtrar la lista, incluir/excluir subdirectorios, etc.
Tambi&eacute;n te muestra la informaci&oacute;n de versiones, y puedes a&ntilde;adir o quitar ficheros.
Una caracter&iacute;stica muy agradable es que se puede buscar en la lista de nombres
de fichero simplemente escribiendo el nombre del fichero. La funci&oacute;n de b&uacute;squeda
es incremental, buscando seg&uacute;n se escribe, de forma similar al isearch de emacs.
</p>

<p>
<a href="../../common/images/article140/symboleditor.gif"><img src=../../common/images/article140/symboleditorthumb.gif alt="launcher" align=right></a>
<b>El visualizador de s&iacute;mbolos</b>
<BR>
El visualizador de s&iacute;mbolos es similar al editor de proyectos, excepto que lo
que vemos son todos los s&iacute;mbolos y cuando se usan. A trav&eacute;s de un click del bot&oacute;n
derecho arrancamos el buscador de referencias (m&aacute;s abajo) y podemos ver cuando
se referencia un s&iacute;mbolo, y a que s&iacute;mbolos referencia a su vez. Por ejemplo,
que funciones usan una funci&oacute;n o variable particulares.
</p>

<p>
<b>El visualizador de clases</b>
<BR>
El visualizador de clases muestr los miembros definidos y heredados de una clase.
Permite varias posibilidades de filtrado en base a la herencia, visibilidad o tipo
de los miembros.
</p>

<p>
<a href="../../common/images/article140/hirarchy.gif"><img src=../../common/images/article140/hirarchythumb.gif alt="hierarchy" align=right></a>
<b>El visualizador de jerarqu&iacute;as</b>
<BR>
El visualizador de jerarqu&iacute;as muestra las relaciones de herencia entre clases.
</p>

<p>
<a href="../../common/images/article140/crossref.gif"><img src=../../common/images/article140/crossrefthumb.gif alt="crossref" align=right></a>
<b>El buscador de referencias (<em>cross referencer</em>)</b>
<BR>
Nos permite ver en qu&eacute; lugares aparece un s&iacute;mbolo determinado (funci&oacute;n,
variable, etc.), es usado o que funciones y/o clases se refieren a &eacute;l.
</p>

<p>
<a href="../../common/images/article140/include.gif"><img src=../../common/images/article140/includethumb.gif alt="include" align=right></a>
<b>El visualizador de <em>includes</em></b>
<BR>
Para ver qu&eacute; ficheros incluye un fichero .c, o cuando un fichero .h es usado.
</p>

<p>
<a href="../../common/images/article140/edit.gif"><img src=../../common/images/article140/editthumb.gif alt="edit" align=right></a>
<b>El editor de codigo</b>
<BR>
Sniff viene ocn un agradable editor para el c&oacute;digo. Resalta la sintaxis y permite
saltar r&aacute;pidamente entre funciones y clases. Tambi&eacute;n permite llamar a otros programas,
como el buscador de referencias, directamente desde el editor de c&oacute;digo.
<br>
El editor es muy avanzado, aunque carece de la potencia de vim o emacs. Por otra
parte, tanto vim como emacs requieren que los conozcas a fondo para usarlos realmente
bien. El editor de c&oacute;digo de sniff resulta una elecci&oacute;n muy recomendable si no
estas totalmente familiarizado con vim o emacs.
</P>

<p>
Aquellos que no quieren usar nada que no sea vim o emacs tambi&eacute;n pueden usar
estos editores con SNiFF+. Si quieres usar vim tendr&aacute;s que instalar la versi&oacute;n
especial que viene con SNiFF+, que incluye compilados algunos protocolos de
comunicaci&oacute;n que permiten a vim y a SNiFF+ comunicarse entre ellos.
Para usar emacs no necesitas instalar nada especial. El emacs que viene con la
mayor parte de las distribuciones de Linux deber&iacute;a funcionarte.
</p>

<p>
<a href="../../common/images/article140/shellcom.gif"><img src=../../common/images/article140/shellcomthumb.gif alt="shell" align=right></a>
<b>El shell de sniff</b>
<BR>
The shell window is mainly used during a compile run. You can see the error messages from the
compiler in that window. To jump to an error in the source code you
highlight the line of the error message in the shell and then you select
Edit->Show Error. This takes you in the source editor to the line where
the error happened.
This shell window is otherwise very simple. See also
<a href="#flyonthedarkside">further down</a>
for a description of problems that I had with this shell window.
</p>

<p>
<b>Otras herramientas</b>
<BR>
SNiFF+ includes also a couple of other programs which I have not used yet.
These are Documentation editor, DiffMerge and Configuration Manager.
DiffMerge seems to be merge tool to merge in changes from a branch and
Configuration Manager seems to be a program to create and manage branches.
</p>

<A NAME="lfindex4">&nbsp;</A>
<H2>Los inconvenientes<a name="flyonthedarkside">&nbsp;</a></H2>

<p>
SNiFF+ ha sido portado a Linux, y esto se hace evidente en m&uacute;ltiples ocasiones.
Afortunadamente, soporta los atajos habituales como Crtl-a (para ir al principio de
la l&iacute;nea), Crtl-e (ir al final), Crtl-k (borrar hasta el final), etc...
Pero no permite copiar y pegar usando el rat&oacute;n. Bajo Unix suele disponerse de un
rat&oacute;n de tres botones, seleccion&aacute;ndose texto con el bot&oacute;n izquierdo y peg&aacute;ndolo
con el bot&oacute;n central. Bajo Linux esto funciona con todos los programas y resulta
realmente molesto que no lo haga con SNiFF+. En su lugar, el cortado y pegado se
hace con una combinaci&oacute;n de letras que parece proceder de MS-Windows.
<br>
Por lo demas SNiFF+ es un buen producto, pero su incapacidad de cortar y pegar con
el rat&oacute;n no paraba de molestarme cada vez que lo usaba. Si tuviera que sugerir
una mejora prioritaria para SNiFF+ ser&iacute;a &eacute;sta.
</p>

<p>
Habitualmente uso colores en el prompt del shell, y tengo definido una alias para
convertir ls en <tt>ls --color=tty</tt>. Los xterm normales de linux,
gnome-term, kvt, etc. soportan estos colores:
<br>
<img src=../../common/images/article140/shell.gif alt="shell">
<br>
El shell que viene con sniff no lo hace, y el aspecto resulta ligeramente c&oacute;mico:
<br>
<img src=../../common/images/article140/shellsniff.gif alt="shell">
<br>
Afortunadamente no es complicado de solventar, aunque ser&iacute;a mucho m&aacute;s apropiado
que sniff soportara los c&oacute;digos de color ANSI color codes. Para fijar esto la
soluci&oacute;n m&aacute;s f&aacute;cil es comprobar que $TERM es igual a etterm (el nombre del
terminal sniff), eliminar el alias de ls y no usar colores en el promp.
<br>
Los usuarios de emacs probablemente sepan que el shell de emacs tiene el mismo
problema, y tengan alg&uacute;n arreglo en sus .bashrc o .tcshrc. Aqu&iacute; hay un trozo de
c&oacute;digo que los usuarios de tcsh pueden colocar en su .tcshrc:
<pre>
if ($?TERM) then
     # switch off color prompt for emacs and sniff
     if ("$TERM" == "dumb" || "$TERM" == "etterm") then
         # a color free prompt:
         set prompt='\n%n@%m[%d,%T]\n(%~) %# '
         alias cwdcmd '/bin/ls -F'
         alias ls '/bin/ls -F'
     endif
endif
</pre>
Los usuarios de bash pueden usar:
<pre>
# switch off color prompt for emacs and sniff
if [ "$TERM" = "etterm" -o "$TERM" = "dumb" ]; then
        PS1="[\u@\h \W]\\$ "
        alias ls="/bin/ls -F"
fi
</pre>
</p>
<p>
Otro problema de shell de sniff es el nombre del teminal. etterm no era conocido
para mi /etc/termcap. Esto produc&iacute;a el mensaje
<tt>&eacute;tterm': unknown terminal type</tt>.
</p>

<A NAME="lfindex5">&nbsp;</A>
<H2>Conclusi&oacute;n</H2>

<p>
SNiFF+ 3.2 es un buen producto. Proporciona la visualizaci&oacute;n y el comfort que
uno espera de un entorno integrado de desarrollo. Adem&aacute;s, SNiFF+ se mostr&oacute; muy
estable sobre mi Redhat 6.0. Lo he usado durante 3 semanas antes de escribir
este art&iacute;culo, y nunca se colg&oacute;. Las herramientas est&aacute;n hechas para un uso habitual,
y con excepci&oacute;n del molesto problema del
<a href="#flyonthedarkside">copiar/pegar</a> todas sus partes eran f&aacute;ciles de
usar. Personalmente, no comprendo que este software est&eacute; disponible para tantos
sistemas Unix sin soportar un simple copiado/pegado usando los botones del
rat&oacute;n.
</p>




<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=140&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Guido Socher <BR>LinuxFocus.org 2000</FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article140.html" target="_TOP"><FONT COLOR="#FFFFFF">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</FONT></A><BR></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:guido.socher@linuxfocus.org"><FONT COLOR="#FFFFFF">Guido Socher</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2000-10-04, generated by lfparser version 1.8</font></p>
</BODY>
</HTML>
