<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="es">
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <TITLE>LF vol. 2, Programando GLUT: Ventanas y Animaciones</TITLE>
 <META name="Author" CONTENT="Miguel Angel Sepulveda">
 <META name="Keywords" CONTENT="linux magazine opengl glut windows animation">
 <META name="Description" CONTENT="Free online magazine on Linux for users and developers">
 <META name="Copyright" CONTENT="&copy; 1998 LinuxFocus">
 <META name="Translator" CONTENT="">
 <META name="Date" CONTENT="1998-02-03T00:00:00Z">


</HEAD>

<BODY bgcolor="#FFFFFF" text="#000000" link="#ff0033" vlink="#FF3333">

  <MAP name="navegator">
  <AREA shape="rect" coords="0, 0, 65, 28" alt="Hogar" href="../">
  <AREA shape="rect" coords="66, 0, 124, 28" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="125, 0, 193, 28" alt="Busqueda" href="../search.html">
  <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
  <AREA shape="rect" coords="261, 0, 350, 28" alt="Sobre Nosotros" href="../aboutus.html">
  </MAP>



 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0">

 <THEAD>
   <TR align="center">
      <TD colspan="2"><IMG src="../../common/January1998/border-short.jpg" alt="[LinuxFocus Image]" width="407" height="88"></TD>
   </TR>

   <TR align="center">
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/January1998/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28" alt="[Navegation Bar]"></TD>
   </TR>

   <TR align="center">
     <TD colspan="2">     
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5">
		<TR bgcolor="#000000">
		   <TD align="center">
               <A href="../News/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Noticias</B></FONT></A>
               <A href="../Archives/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Archivos</B></FONT></A>
               <A href="../Companies/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Compa&ntilde;ias</B></FONT></A>
               <A href="../Tips/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Consejos y Trucos &nbsp;</B></FONT></A> 
               </TD>
            </TR>
            
		<TR>
            <!--   Here goes the Title of the article, authors name and abstract -->
		   <TD align="center">
 			<FONT face="Helvetica,Arial" color="#660066"><H1>Programando GLUT: Ventanas y Animaciones</H1></FONT>
 			<FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#000000">Miguel Angel Sep&uacute;lveda</FONT></A></H3></FONT>
                  <HR size="2" noshade>
	         </TD>
            </TR>

           </TABLE>

     </TD>
   </TR>

 </THEAD>



 <TBODY>
  
 <TR>
    <TD valign="top" align="center">
            <H4><A href="#introduction">Introducci&oacute;n</A></H4>
            <H4><A href="#initializations">Inicializationes</A></H4>
            <H4><A href="#event">Procesado de Eventos</A></H4>
            <H4><A href="#animation">Ejemplo de Animaci&oacute;n</A></H4>

            <BR><BR>
            <A HREF="http://reality.sgi.com/mjk/glut3/glut3.html">GLUT Homepage</A><BR>
	    <A HREF="http://reality.sgi.com/mjk">GLUT Author</A><BR>
            <A HREF="http://reality.sgi.com/mjk/glut3/glut3.html#2">GLUT-3.6 sources</A><BR>

    </TD>
   
    <TD align="center">
       <TABLE border="0" width="80%" cellspacing="0" cellpadding="0">
	  <TR>
          <TD>
	     <A name="introduction"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">Introducci&oacute;n</FONT></H3>



    <P>Por razones de diseño, la especificaci&oacute;n de OpenGL se aisl&oacute; de 
    cualquier dependencia de un sistema de ventanas concreto. El interface resultante
    es una librer&iacute;a de trazado en 2D y 3D portable y eficiente. Es trabajo del
    sistema de ventanas nativo el abrir y trazar ventanas. La librer&iacute;a de OpenGL
    se comunica con el sistema nativo a trav&eacute;s de librer&iacute;as adicionales
    auxiliares. Por ejemplo, la librer&iacute;a auxiliar GLX describe la 
    interacci&oacute;n entre OpenGL y el sistema <i>X Window System</i>.</P>


    <P>El kit de utilidades de OpenGL (OpenGL Utility Toolkit - GLUT) es un interface
    de programaci&oacute;n con bindings para ANSI C y FORTRAN para escribir programas
    OpenGL independientes del sistema de ventanas. Lo ha escrito Mark J. Kilgard y cubre
    un gran agujero dejado por la especificaci&oacute;n de OpenGL. Gracias a GLUT, los 
    desarrolladores pueden usar un inteface com&uacute;n para el sistema de ventanas
    independientemente de la plataforma empleada. Las aplicaciones de OpenGL que usan 
    GLUT se pueden portar f&aacute;cilmente entre plataformas sin tener que introducir
    muchos cambios en el c&oacute;digo fuente. En fin, GLUT simplifica la producci&oacute;n
    de c&oacute;digo OpenGL y complementa la librer&iacute;a de OpenGL.</P>


    <P>GLUT es relativamente pequeño y f&aacute;cil de aprender. Est&aacute; bien
    diseñado y su autor ha escrito una buena documentaci&oacute;n. Por eso, parece 
    redundante empezar una serie de art&iacute;culos aqu&iacute; en 
    Linux<i><font color="#ff0000">Focus</font></i>. Recomendamos a cualquier 
    desarrollador serio que lea la documentaci&oacute;n de Mark. Nuestro prop&oacute;sito
    escribiendo estas columnas de GLUT es introducir la librer&iacute;a GLUT y su uso
    paso por paso con ejemplos, como complemento a la lectura de la serie de OpenGL de 
    este magazine. Esperamos hacer una contribuci&oacute;n &uacute;til y como m&iacute;nimo
    motivar a alguno de vosostros a subiros al vag&oacute;n de Linux y OpenGL. De cualquier
    modo, obtener vuestra copia de la documentaci&oacute;n de Mark como referencia.</P>


    <P>La API de GLUT es una m&aacute;quina de estados, como OpenGL. Esto significa que 
    GLUT tiene una serie de variables de estado que duran toda la ejecuci&oacute;n de 
    la aplicaci&oacute;n. El estado inicial de la m&aacute;quina de GLUT se ha elegido
    razonablemente para ajustarse a la mayor parte de aplicaciones. El programa puede
    modificar los valores de las varibles de estado para ajustarlas a su gusto. Cuando
    se llama a una funci&oacute;n de GLUT, su acci&oacute;n se modifica de acuerdo a los 
    valores de las variables de estado. Las funciones de GLUT son simples, tienen pocos
    par&aacute;metros. Nunca devuelven punteros, y los &uacute;nicos punteros pasados 
    a las funciones de GLUT son punteros a cadenas de caracteres y manejadores de fuentes.
    </P>


    <P>Las funciones de GLUT se pueden clasificar en varias subAPIs seg&uacute;n su 
    funcionalidad:</P>
 

    <UL>

    <LI><B>Inicializaci&oacute;n</B>

    <LI><B>Inicio del procesado de eventos</B>

    <LI><B>Control de ventanas</B>

    <LI><B>Control de overlay</B>

    <LI><B>Control de men&uacute;s</B>

    <LI><B>Registro de funciones Callback</B>

    <LI><B>Control del mapa de colores</B>

    <LI><B>Obtenci&oacute;n del estado</B>

    <LI><B>Trazado de fuentes</B>

    <LI><B>Trazado de formas geom&eacute;tricas</B>

    </UL>



    <P>Es este art&iacute;culo exploraremos algunas de las funciones de 
    inicializaci&oacute;n, procesado de eventos y control de ventanas necesarias
    para empezar un sencillo programa en OpenGL.</P>




	     <A name="initializations"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">Initializations</FONT></H3>





    <P>Todo programa de OpenGL que utilice GLUT debe empezar inicializando el 
    estado de la m&aacute;quina de estados de GLUT. Las funciones de inicializaci&oacute;n
    de GLUT tienen el prefijo <tt>glutInit-</tt>. La rutina principal de 
    inicializaci&oacute;n es <tt>glutInit</tt>:</P>

    <tt><b>Uso</b>: <br>

    &nbsp; glutInit(int **<FONT COLOR="#ff0000">argcp</FONT>, 

                         char **<FONT COLOR="#ff0000">argv</FONT>);<BR>

    &nbsp; <FONT COLOR="#ff0000">argcp</FONT></tt> 

    <FONT SIZE=-1>es un puntero a la variable argc de la funci&oacute;n main (sin modificar).

    Al acabar la funci&oacute;n, el valor apuntado por argcp se actualiza, ya que glutInit
    extrae todas las opciones de la l&iacute;nea de comandos relevantes para la 
    librer&iacute;a GLUT. <i>Por ejemplo: bajo X Window System toda opci&oacute;n relevante
    para la ventana X asociada a la ventana GLUT.</i>.</FONT><BR>  

    <tt>&nbsp; <FONT COLOR="#ff0000">argv</FONT></tt> 

    <FONT SIZE=-1> es la variable argv de la funci&oacute;n main (sin modificar). </FONT>





    <P><tt>glutInit</tt> se encarga de modificar las variables de estado de GLUT y 
    negociar una sesi&oacute;n con el sistema de ventanas. Hay muy pocas funciones
    que pueden aparecer antes de <tt>glutInit</tt>; solo aquellas precedidas por 
    <tt>glutInit-</tt>. Estas rutinas se pueden usar para poner los estados de 
    inicializaci&oacute;n por defecto, por ejemplo:</P>


    <tt><b>Uso</b>: <br>

    &nbsp; glutInitWindowPosition(int <FONT COLOR="#ff0000">x</FONT>, 

                         int **<FONT COLOR="#ff0000">y</FONT>);<BR>

    &nbsp; glutInitWindowSize(int <FONT COLOR="#ff0000">width</FONT>, 

                         int **<FONT COLOR="#ff0000">height</FONT>);<BR>

    &nbsp; <FONT COLOR="#ff0000">x , y</FONT></tt> 

    <FONT SIZE=-1>posici&oacute;n en la pantalla en p&iacute;xels de la ventana 
                 (esquina superior izquierda)</FONT><BR>  

    <tt>&nbsp; <FONT COLOR="#ff0000">width, height</FONT></tt> 

    <FONT SIZE=-1> ancho y alto en p&iacute;xels de la ventana.</FONT>



    <P>Existe otra rutina de inicializaci&oacute;n ominpresente en toda aplicaci&oacute;n
    en OpenGL, <tt>glutInitDisplayMode()</tt>:</P>



    <tt><b>Uso</b>: <br>

    &nbsp; glutInitDisplayMode(unsigned int <FONT COLOR="#ff0000">mode</FONT>);<BR> 

    &nbsp; <FONT COLOR="#ff0000">mode</FONT></tt> 

    <FONT SIZE=-1>es el modo de display, un OR de los posibles valores de display, que
    son:</FONT><BR>

  

    <TABLE>

   

    <TR>

    <TD><FONT SIZE=-1> GLUT_RGBA </FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana en modo RGBA. Es el valor por defecto
      si no se indican ni GLUT_RGBA ni GLUT_INDEX.</FONT>

    </TD>

    </TR>



   

    <TR>

    <TD><FONT SIZE=-1> GLUT_RGB </FONT></TD>

    <TD><FONT SIZE=-1> Lo mismo que GLUT_RGBA.</FONT>

    </TD>

    </TR>



    <TR>

    <TD><FONT SIZE=-1> GLUT_INDEX </FONT></TD>

    <TD><FONT SIZE=-1> Seleciona una ventana en modo de &iacute;ndice de colores. 
      Se impone sobre GLUT_RGBA.</FONT>

    </TD>

    </TR>



    <TR>

    <TD><FONT SIZE=-1> GLUT_SINGLE </FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana en modo buffer simple. Es el valor por
      defecto.</FONT>

    </TD>

    </TR>





    <TR>

    <TD><FONT SIZE=-1> GLUT_DOUBLE </FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana en modo buffer doble. Se impone sobre
       GLUT_SINGLE.</FONT>

    </TD>

    </TR>



    <TR>

    <TD><FONT SIZE=-1> GLUT_ACCUM </FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana con un buffer acumulativo.</FONT>

    </TD>

    </TR>



    <TR>

    <TD><FONT SIZE=-1> GLUT_ALPHA </FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana con una componente alpha del buffer de 
      color.</FONT>

    </TD>

    </TR>



    <TR>

    <TD><FONT SIZE=-1> GLUT_DEPTH </FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana con un buffer de profundidad.</FONT>

    </TD>

    </TR>



    <TR>

    <TD><FONT SIZE=-1> GLUT_STENCIL </FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana con un buffer de estarcido.</FONT>

    </TD>

    </TR>



    <TR>

    <TD><FONT SIZE=-1> GLUT_MULTISAMPLE </FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana con soporte multimuestra.</FONT>

    </TD>

    </TR>



  

    <TR>

    <TD><FONT SIZE=-1> GLUT_STEREO</FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana est&eacute;reo.</FONT>

    </TD>

    </TR>



    <TR>

    <TD><FONT SIZE=-1> GLUT_LUMINANCE</FONT></TD>

    <TD><FONT SIZE=-1> Selecciona una ventana con un modelo de color de "luminancia".</FONT>

    </TD>

    </TR>

   </TABLE>

 

    <P>Si alguna de estas propiedades no te es familiar, no te preocupes, m&aacute;s tarde
    o m&aacute;s pronto escribiremos sobre ellas. Veamos un par de ejemplos, primero una
    inicializaci&oacute;n simple para una aplicaci&oacute;n de trazado en un paso:</P>


    <tt>

    #include &lt;GL/glut.h&gt;<BR>

    <BR>

    void main(int argcp, char **argv){<BR>

    <BR>

    /* Poner el tamaño y posición de la ventana */<BR>

    glutInitWindowSize(640, 480);<BR>

    glutInitWindowPosition(0, 0);<BR>

    <BR>

    /* Seleccionar el tipo de modo de display: <BR>

    &nbsp;&nbsp; Buffer simple y color RGBA */<BR>

    glutInitDisplayMode(GLUT_RGBA | GLUT_SINGLE);<BR>

    <BR>

    /* Inicializar el estado de GLUT */<BR>

    glutInit(&argcp, argv);   <BR>

    <BR> 

    .....más código<BR>

    <BR>

    <BR>

    };<BR>

    </tt>



    <P>Ahora un ejemplo de un programa de animaci&oacute;n:</P>

    

    <tt>

    #include &lt;GL/glut.h&gt;<BR>

    <BR>

    void main(int argcp, char **argv){<BR>

    <BR>


    /* Poner el tamaño y posición de la ventana */<BR>

    glutInitWindowSize(640, 480);<BR>

    glutInitWindowPosition(0, 0);<BR>

    <BR>

    /* Seleccionar el tipo de modo de display:<BR>

    &nbsp;&nbsp; Buffer doble y color RGBA */<BR>

    glutInitDisplayMode(GLUT_RGBA | GLUT_DOUBLE);<BR>

    <BR>

    /* Inicializar el estado de GLUT */<BR>

    glutInit(&argcp, argv);   <BR>

    <BR> 

    .....más código<BR>

    <BR>

    <BR>

    };<BR>

    </tt>



    <P>Volveremos a estos dos ejemplos a medida que aprendamos m&aacute;s sobre GLUT.
    La principal diferencia es que en el segundo caso el display se inicializa en modo
    de doble buffer, ideal para animaciones porque elimina el parpadeo cuando cambia
    la imagen en la secuencia de animaci&oacute;n.</P>




	     <A name="event"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">Procesado de Eventos</FONT></H3>


    <P>Como hemos dicho antes, GLUT es una m&aacute;quina de estados. Ahora veremos
    que tambi&eacute;n est&aacute; diseñada como un motor dirigido por eventos. Esto 
    significa que hay un "timer" o bucle continuo que comienza despu&eacute;s de la 
    inicializaci&oacute;n correspondiente y que procesa uno por uno todos los eventos 
    declarados a GLUT durante la inicializaci&oacute;n. Los eventos son: un bot&oacute;n
    del rat&oacute;n que se ha pulsado, una ventana que se cierra, una ventana que se 
    redimensiona, un cursor que se mueve, unas teclas del teclado que se han pulsado,
    un curioso evento "idle", esto es, no pasa nada. Cada uno de los posibles eventos
    se debe registrar en una de las variables de estado de GLUT para que el "timer"
    o bucle de proceso de eventos de GLUT mire peri&oacute;dicamente si este evento ha
    sido activado por el usuario.<P>


    <P>Por ejemplo, podemos registrar "pulsar bot&oacute;n del rat&oacute;n" como
    un evento para GLUT. Los eventos se registran mediante rutinas de <I>registro
    callback</I>. Todas tienen la sintaxis <tt>glut[algunEvento]Func</tt>, en el caso
    del click del rat&oacute;n ser&aacute; <tt>glutMouseFunc</tt>. Un registro de callback
    le dice a la m&aacute;quina de GLUT que funci&oacute;n definida por el usuario se debe
    llamar si el correspondiente evento es activado. As&iacute; pues, si escribo mi rutina 
    <tt>MyMouse</tt> que especifica qu&eacute; hacer cuando se pulsa el bot&oacute;n 
    izquierdo del rat&oacute;n, o el bot&oacute;n derecho, etc.. entonces registrar&eacute; 
    mi funci&oacute;n callback despu&eacute;s de <tt>glutInit()</tt> en main() usando
    la sentencia "<tt>glutMouseFunc(MyMouse);</tt>" .</P>



    <P>Dejemos para m&aacute;s tarde qu&eacute; funciones callback y qu&eacute; eventos
    est&aacute;n permitidos en GLUT. Lo importante ahora es señalar que despu&eacute;s de 
    registrar todos los eventos importantes de nuestra aplicaci&oacute;n debemos invocar
    la rutina de procesado de eventos de GLUT, que es <tt>glutMainLoop()</tt>. Esta 
    funci&oacute;n nunca vuelve, nuestro programa b&aacute;sicamente comienza un bucle
    infinito. Ir&aacute; llamando, cuando sea necesario, las funciones callback que hayan
    sido previamente registradas. Toda funci&oacute;n main() de una aplicaci&oacute;n OpenGL
    debe pues terminar en una sentencia <tt>glutMainLoop()</tt>. As&iacute; pues, en el caso 
    de nuestra plantilla de una animaci&oacute;n: </P>




    <tt>

    #include &lt;GL/glut.h&gt;<BR>

    <BR>

    void main(int argcp, char **argv){<BR>

    <BR>

    /* Inicializar el estado de GLUT */<BR>
    glutInit(&argcp, argv);   <BR>

    glutInitWindowSize(640, 480);<BR>

    glutInitWindowPosition(0, 0);<BR>

    <BR>

    /* Abrir una ventana */<BR>

    glutCreateWindow("My OpenGL Application");<BR>

    <BR>

    /* Seleccionar el tipo de modo de display:<BR>
    &nbsp;&nbsp; Buffer doble y color RGBA */<BR>
    glutInitDisplayMode(GLUT_RGBA | GLUT_DOUBLE);<BR>

    <BR>

    <BR> 

    /* Registrar funciones Callback */<BR>

    .....<BR>

    <BR>

    /* Iniciar el procesado de eventos */<BR>

    glutMainLoop();<BR>

    };<BR>

    </tt>



    <P>Notad que he añadido un c&oacute;digo que no he mencionado antes. Es una de las
    funciones de control de ventanas de GLUT, <tt>glutCreateWindow(char **name)</tt>. 
    Esto es lo que me gusta de la filosof&iacute;a de diseño de OpenGL y GLUT, est&aacute;
    muy claro lo que hace la rutina solo mirando el nombre!. S&iacute;, se encarga de 
    pasar la orden al sistema de ventanas subyacente de abrir una ventana para nuestra
    aplicaci&oacute;n de OpenGL. La ventana tendr&aacute; el nombre "name", pasado como
    una cadena de caracteres. En el entorno de X Window este nombre se escribe en la esquina
    superior izquierda de la ventana. La secci&oacute;n de control de ventanas de GLUT
    tiene muchas otras funciones que iremos estudiando poco a poco. Por hoy, esta es 
    suficiente. Tambi&eacute;n he reordenado las funciones de inicializaci&oacute;n para
    mostrar que se pueden poner despu&eacute;s de <tt>glutInit()</tt></P>



    <P>Volvamos a los eventos... En el presente art&iacute;culo quiero introducir
    dos funciones de registro de callback que son fundamentales en cualquier programa
    de animaci&oacute;n. La funci&oacute;n <tt>glutDisplayFunc</tt>, que registra la 
    funci&oacute;n de display para la ventana actual y la funci&oacute;n 
    <tt>glutIdleFunc</tt>, que registra la funci&oacute;n "idle". Ambas rutinas
    de registro esperan una funci&oacute;n del tipo <tt>void *(void)</tt>. Supongamos
    que escribimos dos funciones callback adicionales en nuestra plantilla de 
    animaci&oacute;n, <tt>void MyDisplay(void)</tt> que se encarga de invocar las 
    instrucciones OpenGL que dibujan nuestra escena en la ventana, y 
    <tt>void MyIdle(void)</tt> que es una funci&oacute;n que es llamada cuando no 
    hay entradas del usuario, esto es, cada vez que el procesador de eventos de GLUT
    da una vuelta al bucle infinito (<tt>glutMainLoop()</tt>) y no encuentra ning&uacute;n
    nuevo evento activado, procesa <tt>MyIdle</tt>. ¿Por qu&eacute; necesito registrar
    una funci&oacute;n callback "idle" en un programa de animaci&oacute;n? Porque si
    quiero modificar cada una de las im&aacute;genes mostradas durante la animaci&oacute;n
    independientemente de la entrada del usuario, debe existir una funci&oacute;n (la
    funci&oacute;n callback "idle") que se llame muy a menudo durante la ejecuci&oacute;n 
    del programa y cambie las im&aacute;genes antes de que se dibujen en pantalla por 

    <tt>Mydisplay()</tt>.</p>












	     <A name="animation"></A>
           <H3><FONT face="Helvetica,Arial" color="#660033">Animation Example</FONT></H3>



    <P>Finalmente aqu&iacute; tenemos una simple plantilla para un programa de 
    animaci&oacute;n:</P>


    <tt>

    #include &lt;GL/glut.h&gt;<BR>

    <BR>

    void MyIdle(void){<BR>

    /* Código para modificar las variables que definen la próxima imagen */<BR>

    ....<BR>

    };<BR>

    <BR>

    void MyDisplay(void){<BR>

    /* Código OpenGL que dibuja una imagen */<BR>

    ....<BR>

    /* Después de dibujar la imagen, intercambiar los buffers */<BR>

    glutSwapBuffers();<BR>

    };<BR>

    <BR>

    void main(int argcp, char **argv){<BR>

    <BR>

    /* Inicializar el estado de GLUT */<BR>
    glutInit(&argcp, argv);   <BR>

    glutInitWindowSize(640, 480);<BR>

    glutInitWindowPosition(0, 0);<BR>

    <BR>

    /* Abrir una ventana */<BR>
    glutCreateWindow("My OpenGL Application");<BR>

    <BR>

    /* Seleccionar el tipo de modo de display:<BR>
    &nbsp;&nbsp; Buffer doble y color RGBA */<BR>
    glutInitDisplayMode(GLUT_RGBA | GLUT_DOUBLE);<BR>

    <BR>

    <BR> 

    /* Registrar funciones Callback */<BR>
    glutDisplayFunc(MyDisplay)<BR>

    glutIdleFunc(MyIdle)<BR>

    <BR>

    /* Iniciar el procesado de eventos */<BR>
    glutMainLoop();<BR>

    };<BR>

    </tt>





    <P>Nota que al final de <tt>MyDisplay</tt> he añadido una nueva rutina
    GLUT, <tt>glutSwapBuffers()</tt>. Es muy &uacute;til en animaciones.

    Estamos usando una ventana en modo de DOBLE buffer, uno que se muestra y otro

    oculto. Las instrucciones de dibujo de OpenGL en este caso siempre trazan en el 
    buffer oculto. La llamada a <tt>glutSwapBuffers</tt> intercambia los buffers, 

    mostrando en la ventana de golpe todo lo que hemos dibujado. Esta t&eacute;cnica 
    es com&uacute;n en animaciones por ordenador porque previene que el ojo humano vea
    como se construye la imagen l&iacute;nea por l&iacute;nea.</P>





    <P>Ya tenemos suficiente material para empezar a escribir aplicaciones OpenGL,
    lo &uacute;nico que falta son las instrucciones OpenGL en <tt>MyDisplay</tt>

    que realizan el dibujo... pero esto es otra historia ;-).</P>


    <P>En el pr&oacute;ximo art&iacute;culo de programaci&oacute;n en GLUT 
    exploraremos m&aacute;s profundamente las funcionalidades disponibles en la 
    secci&oacute;n de control de ventanas de GLUT como abrir multiples escenas
    dentro de la misma ventana. Tambi&eacute;n aprenderemos c&oacute;mo usar men&uacute;s
    y sus pros y contras en cuanto a portabilidad.</P>


          </TD>
        </TR>
	 </TABLE>

     <HR size=2 noshade>
    <P ALIGN=RIGHT><I>Traducido por Hugo Lastras</I></P>


    </TD>

 </TR>

 </TBODY>

<TBODY>
  <TR>
    <TD colspan="2">
    <B>Para m&aacute;s informaci&oacute;n</B>:<BR>
    <UL>
      <LI>Lea <A href="article18.html">La Tarjeta Gr&aacute;fica 3Dfx</A>. </LI>
      <LI>Consulte <A href="http://www.opengl.org/">http://www.opengl.org/</A>.</LI> 
      <LI>Lea otros art&iacute;culos por el mismo autor:<A href="article15.html">Qu&eacute; es OpenGL?</A>, <A href="article17.html">Programando OpenGL: Trazado de Poligonos Simples</A>.</LI> 
     <UL><BR><BR>
    <TD>
  </TR>
</TBODY>

 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 Miguel Angel Sep&uacute;lveda</B></FONT><BR>
    <FONT color="#ffffff">Esta p&aacute;gina est&aacute; mantenida por
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>



</TABLE>


</BODY>
</HTML>






