<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML lang="es">
<HEAD><META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <TITLE>LF vol. 2, Tarjeta Gr&aacute;fica 3Dfx</TITLE>
 <META name="Author" CONTENT="Phillip Ross">
 <META name="Keywords" CONTENT="linux opengl 3dfx graphics card hardware">
 <META name="Description" CONTENT="3Dfx Hardware Review article">
 <META name="Copyright" CONTENT="&copy; 1998 LinuxFocus">
 <META name="Translator" CONTENT="">
 <META name="Date" CONTENT="1998-02-03T00:00:00Z">


</HEAD>

<BODY bgcolor="#FFFFFF" text="#000000" link="#ff0033" vlink="#FF3333">

  <MAP name="navegator">
  <AREA shape="rect" coords="0, 0, 65, 28" alt="Hogar" href="../">
  <AREA shape="rect" coords="66, 0, 124, 28" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="125, 0, 193, 28" alt="Busqueda" href="../search.html">
  <AREA shape="rect" coords="194, 0, 260, 28" alt="Enlaces" href="../links.html">
  <AREA shape="rect" coords="261, 0, 350, 28" alt="Sobre Nosotros" href="../aboutus.html">
  </MAP>



 <TABLE border="0" width="100%" cellspacing="0" cellpadding="0">

 <THEAD>
   <TR align="center">
      <TD colspan="2"><IMG src="../../common/January1998/border-short.jpg" alt="[LinuxFocus Image]" width="407" height="88"></TD>
   </TR>

   <TR align="center">
      <TD colspan="2" bgcolor="#660033"><IMG src="../../common/January1998/Navegator-bar.gif" ismap usemap="#navegator" border="0" width="351" height="28" alt="[Navegation Bar]"></TD>
   </TR>

   <TR align="center">
     <TD colspan="2">     
           <TABLE  border="0" width="75%" cellspacing="0" cellpadding="5">
		<TR bgcolor="#000000">
		   <TD align="center">
               <A href="../News/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Noticias</B></FONT></A>
               <A href="../Archives/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Archivos</B></FONT></A>
               <A href="../Companies/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Compa&ntilde;ias</B></FONT></A>
               <A href="../Tips/"><FONT face="Helvetica,Arial" color="#ffffff"><B>&nbsp; Consejos y Trucos &nbsp;</B></FONT></A> 
               </TD>
            </TR>
            
		<TR>
            <!--   Here goes the Title of the article, authors name and abstract -->
		   <TD align="center">
 			<FONT face="Helvetica,Arial" color="#660066"><H1>Tarjeta Gr&aacute;fica 3Dfx</H1></FONT>
 			<FONT face="Helvetica,Arial" color="#000000"><H3>por <A href="mailto:phil@ryoko.cis.pitt.edu"><FONT color="#000000">Phillip Ross</FONT></A></H3></FONT>
                  <HR size="2" noshade>
	         </TD>
            </TR>

           </TABLE>

     </TD>
   </TR>

 </THEAD>



 <TBODY>
  
 <TR>
    <TD valign="top" align="center">
           <H4><A href="#introduction">Introducci&oacute;n</A></H4>
           <H4><A href="#limitations">Limitaciones del 3D <BR>en tarjetas de video</A></H4>
           <H4><A href="#voodoo">Capacidades del <BR> Voodoo 3Dfx Chip</A></H4>
           <H4><A href="#voodoo2">Limitaciones del chip <BR> Voodo 3Dfx </A></H4>
           <H4><A href="#oem">OEM Fabricantes <BR>usan 3Dfx</A></H4>
           <H4><A href="#voodoo3">Dentro del Voodoo 3Dfx</A></H4>
           <H4><A href="#3dfx">Programando 3Dfx</A></H4>
           <H4><A href="#mesa">Usando Mesa con 3Dfx</A></H4>
    </TD>
   
    <TD align="center">
       <TABLE border="0" width="80%" cellspacing="0" cellpadding="0">
	  <TR>
          <TD>

    <A NAME="introduction">  </A>
    <B><FONT FACE="Arail, Helvetica" SIZE=3>Introducci&oacute;n</FONT></B><BR><BR>
    
    <P>Hace aproximadamente un a&ntilde;o, una compa&ntilde;&iacute;a llamada <i>3Dfx
Interactive</i> anunci&oacute; su nuevo chipset 3D que cambiar&iacute;a el concepto
que los usuarios de PCs tienen de los gr&aacute;ficos en 3D. Antes del
lanzamiento de esta tarjeta de 3Dfx, no hab&iacute;a ninguna alternativa
razonablemente econ&oacute;mica para disponer de gr&aacute;ficos 3D de altas
prestaciones en un ordenador de uso dom&eacute;stico. Los gr&aacute;ficos de alto
nivel solo se pod&iacute;an encontrar en caras estaciones de trabajo como las
de SGI y Sun, con un costoso hardware especializado. Los fabricantes
de tarjetas de video para PC, como Number Nine, Diamond Multimedia y
Matrox, ten&iacute;an tarjetas asequibles en el mercado con reconocidas
capacidades 3D, pero eran muy limitadas en comparaci&oacute;n con el hardware
costoso de las estaciones de trabajo.</P>

   <P>Con el lanzamiento de la tarjeta de 3Dfx, bautizada como la
<i>Voodoo 3Dfx</i>, los gr&aacute;ficos 3D de altas prestaciones se hicieron
asequibles para el usuario medio. El rendimiento de este chip es
indudablemente un punto de refenrencia en la infinita tarea de traer los
gr&aacute;ficos de alto nivel al ordenador de sobremesa. Hasta ahora, la
capacidad 3D de otras tarjetas de video estaban limitados al
z-buffering y al sombreado gouraud (algunas menos primitivas soportaban
un mapeado limitado de texturas) pero estas prestaciones estaban con
frecuencia limitadas a unas determinadas resoluciones o a una
profundidad de color. Desafortunadamente, se necesitaba much&iacute;simo la
intervenci&oacute;n de la CPU para conseguir poner en marcha alguna de estas
prestaciones para que funcione con alguna aplicaci&oacute;n.</P>

     <A NAME="limitations"></A>
    <B><FONT FACE="Arail, Helvetica" SIZE=3>Limitaciones del 3D
en las tarjetas de video</FONT></B><BR><BR>

   <P>Aqu&iacute; tenemos un ejemplo de c&oacute;mo una tarjeta de video podr&iacute;a
quedar limitada en sus prestaciones. Podr&iacute;a asegurar que soporta
z-buffering, pero s&oacute;lo puede tener c&oacute;digo en los video drivers que
almacena las the z-coordinates of pixels en areas de memoria de video
que de otro modo no se usar&iacute;an. Este z-buffering solamente podr&iacute;a ser
usado a bajas resoluciones y con poca profundidad de color debido a
que los modos superiores necesitan mucha m&aacute;s memoria. En los modos
superiores no habr&iacute;a suficiente memoria para permitir almacenar las
coordenadas-z. Incluso con el almacenamiento de estas coordenadas en
memoria, la aplicaci&oacute;n a&uacute;n necesitar&iacute;a usar la CPU para comparar las
coordenadas-z de nuevos pixels con el contenido de la memoria de
video. Ya que estas comparaciones requieren una importante capacidad
de proceso en la CPU para llevarlo a cabo, la capacidad de z-buffering
en la tarjeta de video no est&aacute; en realidad eliminando el cl&aacute;sico
cuello de botella del z-buffer. Si esto le suena demasiado complejo no
se preocupe... en realidad es s&oacute;lo una explicaci&oacute;n t&eacute;cnica de por qu&eacute;
ni siquiera es comparable la tarjeta 3Dfx con aquellas tarjetas que
aseguran ofrecer soporte 3D.</P>

     <A NAME="voodoo"></A>
    <B><FONT FACE="Arail, Helvetica" SIZE=3>Prestaciones de la tarjeta
Voodoo 3Dfx</FONT></B><BR><BR>

   <P>Es suficiente decir que la Voodoo 3Dfx tiene capacidades 3D muy
avanzadas que no ha conseguido ning&uacute;n otro fabricante por ese
precio. El chip se jacta de ofrecer prestaciones 3D tales como
sombreado gouraud,buffer de profundidad (tanto z-buffering como
w-buffering), mezclado-alpha, niebla, chroma-keying, y
dithering. Tambien es capaz de proveer verdadera correccion de perspectiva en
el mapeo de texturas, mipmapping trilineal, iluminacion de texturas, 
correccion de sub-pixeles y decompresion en el espacio de texturas.
Todas estas tareas se realizan en su
totalidad desde el hardware de la Voodoo sin pr&aacute;cticamente
intervenci&oacute;n de la aplicaci&oacute;n.

<P>La aplicaci&oacute;n es &uacute;nicamente responsable de preparar el entorno
gr&aacute;fico 3D y las coordenadas. Actualmente la Voodoo no soporta la
inicializaci&oacute;n de coordenadas, pero esto no es normalmente un problema
ya que las CPUs modernas pueden ofrecer amplia capacidad de proceso
para estos c&aacute;lculos. F&iacute;jese que aunque la pr&oacute;xima generaci&oacute;n 3Dfx,
bautizada como Voodoo2, s&iacute; que tendr&aacute; esta capacidad e incluso con a&uacute;n
m&aacute;s velocidad gr&aacute;fica; los actuales modelos de pruebas de tarjetas de
video usando el chip Voodoo2 est&aacute;n rompiendo todos los records de
velocidad. Y m&aacute;s importante a&uacute;n, la relaci&oacute;n precio/prestaciones del
chip Voodoo actual es la caracter&iacute;stica m&aacute;s sobresaliente.</P>


    <A NAME="voodoo2"></A>
    <B><FONT FACE="Arail, Helvetica" SIZE=3>Limitaciones del chip
Voodoo 3Dfx</FONT></B><BR><BR>

   <P>Desafortunadamente, el chip Voodoo 3Dfx tambi&eacute;n tiene por
supuesto sus limitaciones. La principal es que s&oacute;lo puede hacer
rendering a pantalla completa, y que el chip no puede ser usado de
forma efectiva como &uacute;nico adaptador de video de un ordenador. Las
tarjetas de video que usen el chip 3Dfx necesitan tener otro adaptador
independiente trabajando junto a &eacute;l. La tarjeta con el chip 3Dfx
trabaja codo con codo junto al otro adaptador. Funciona de forma que
el sistema operativo usa la tarjeta de video normal, pero cuando una
aplicaci&oacute;n necesita hacer uso de la capacidad 3D, accede al driver de
la tarjeta para inicializarla. El 3Dfx entonces arranca y empieza a
dar servicio de acuerdo con las funciones Glide invocadas por la
aplicaci&oacute;n.</P>

     <P>En una configuraci&oacute;n normal sin un adaptador 3Dfx, la tarjeta
tradicional se sit&uacute;a en su propia ranura de la placa madre, y con su
salida conectada al monitor donde visualiza el resultado. Tarjetas de
video 3Dfx tales como la Monster3D y Pure3D usan un sistema
"pass-through" que permite a ambas tarjetas, la tradicional y la 3Dfx,
usar el mismo monitor. Una configuraci&oacute;n de este tipo consiste en
tener ambas tarjetas de video en sendas ranuras de la placa madre. La
salida de la tarjeta convencional se conecta a la entrada de la 3Dfx a
trav&eacute;s de un cable pass-through normalmente incluido con la 3Dfx. En
los modos normales de funcionamiento, la tarjeta convencional produce
su se&ntilde;al normal de video que inyecta en la entrada de la tarjeta 3Dfx,
que a su vez la pasa al monitor. Cuando una aplicaci&oacute;n pide al driver
3D inicializar la 3Dfx, la tarjeta 3D desactiva la propagaci&oacute;n de la
se&ntilde;al convencional que ya no llegar&aacute; al monitor, comenzando a enviar
su propia se&ntilde;al al monitor, hasta que la aplicaci&oacute;n genere una orden
de parada del driver 3D y restaure el env&iacute;o de la se&ntilde;al de video
convencional al monitor.</P>

     <P>Desafortunadamente, con una configuraci&oacute;n pass-through la
salida de video normal no es visible lo que puede convertirse en un
problema para aplicaciones corriendo en sistemas de ventanas tales
como <i>Xwindows</i>, donde se quiera obtener el resultado 3D dentro
de una ventana. Para ello hay otro m&eacute;todo soportado por los
adaptadores 3Dfx que puede ser mejor para aplicaciones de este tipo,
pero que requiere un monitor adicional. Si tiene dos monitores, puede
conectar uno a la salida de la tarjeta convencional y otro a la salida
del adaptador 3Dfx. De esta forma, un monitor siempre visualiza la
se&ntilde;al de la tarjeta de video convencional, y el otro permanece
inactivo hasta que inicialice la tarjeta 3Dfx. Entonces, una vez que
arranque la 3Dfx, puede usar un monitor para su sistema de ventanas
normal, y el otro para dar la salida de la 3Dfx a pantalla
completa.</P>

    <P>3Dfx ha creado un nuevo chip llamado 3Dfx RUSH, que es capaz de
producir en una ventana. Las tarjetas de video con este chip tambien
traen incorporado un chip 2D y comparten una memoria intermedia
&uacute;nica. Ya que no hay actualmente soporte de este tipo para Linux no
podemos comentarlo aqu&iacute;, pero ya est&aacute; en marcha su desarrollo.</P>

    <P>Otra limitaci&oacute;n del chip 3Dfx es que no puede alcanzar
resoluciones m&aacute;s altas que las que consiguen las tarjetas
convencionales de hoy en d&iacute;a, que mientras que &eacute;stas &uacute;ltimas est&aacute;n ya
alcanzando resoluciones de 1280x1024, 1600x1200, o incluso superiores,
los adaptadores 3Dfx generalmente no van m&aacute;s all&aacute; de los 640x480,
aunque no es tanta limitaci&oacute;n como se podr&iacute;a pensar, ya que con las
t&eacute;cnicas de anti-aliasing avanzado y filtrado de texturas de la 3Dfx,
un gran n&uacute;mero de objetos se pueden visualizar dentro de los 640x480
de resoluci&oacute;n sin que pr&aacute;cticamente no se observe la pixelizaci&oacute;n. De
hecho es con frecuencia dificil identificar la resoluci&oacute;n que est&eacute;
usando una aplicaci&oacute;n 3Dfx s&oacute;lo mirando a la pantalla.</p>

    <P>Las tarjetas b&aacute;sicas 3Dfx m&aacute;s comunes, como la Monster3D
solamente alcanzan los 640x480. Creo que algunas pueden elevar su
resoluci&oacute;n hasta los 800x600, pero seg&uacute;n tengo entendido a esta
resoluci&oacute;n la tarjeta pierde la capacidad de hacer buffering de profundidad
y alfa ya que la memoria que normalmente se usar&iacute;a para estos
buffers se consume dedicada a alcanzar esta resoluci&oacute;n mayor. Las
tarjetas de gama alta, como la Quantum3D, puede soportar 800x600 sin
perder esas otras capacidads.</P>

    <A NAME="oem"></A>
    <B><FONT FACE="Arail, Helvetica" SIZE=3>Fabricantes OEM usan 3Dfx
</FONT></B><BR><BR>

    <P>3Dfx Interactive es el fabricante de este chip 3D de alto
rendimiento. Sin embargo no fabrican las tarjetas de video que usan
este chip. Otras compa&ntilde;&iacute;as como Diamond Multimedia, Orchid Technology
y Canopus Corporation usan todas ellas este chip en las tarjetas de
video que ellos producen. Diamond tiene la Monster3D, Orchid la
Righteous3D y Canopus la Pure3D. Una compa&ntilde;&iacute;a con el nombre de Quantum
3D se segreg&oacute; de 3Dfx y ofrece tarjetas de video que hacen uso de
configuraciones avanzadas de la Voodoo (unidades PixelFX y TexelFX),
m&aacute;s memoria para cuadros o texturas, etc. Estos modelos son conocidos
como los Obsidian 3D. Visite el web de 3Dfx Interactive en (<A
HREF="http://www.3dfx.com">www.3dfx.com</A>) para consultar un listado
completo de fabricantes que producen tarjetas de video que usan el
chip 3Dfx.</P>

     <A NAME="voodoo3"></A>
    <B><FONT FACE="Arail, Helvetica" SIZE=3>Dentro del Voodoo 3Dfx</FONT></B><BR><BR>
 
    <P>El chip Voodoo en realidad puede ser concebido como un sistema
avanzado y flexible de generaci&oacute;n de gr&aacute;ficos, formado por subsistemas
Voodoo separados que pueden combinarse de diferentes formas, pero la
m&aacute;s simplista ser&iacute;a aquella formada por un &uacute;nico Voodoo. Cada
subsistema a su vez est&aacute; formado por procesadores independientes
conocidos como unidades PixelFX y TexelFX. PixelFX es la unidad
responsable de operaciones por pixel tales como buffering de
profundidad de color y sombreado gouraud. La unidad TexelFX es la
responsable de operaciones con filtrado de texturas y
proyecciones. Juntas, estas unidades pueden trabajar para producir
efectos tales como texturas iluminadas. Cada una tiene adem&aacute;s su
propia memoria de video, usada para sus operaciones especializadas. La
PixelFX usa su memoria para almacenar pixels para la memoria
intermedia de cuadros, y la TexelFX para almacenar texturas.</P>

    <P>Cada configuraci&oacute;n de subsistema Voodoo contiene una unidad
PixelFX, pero puede haber m&aacute;s subsistemas configurados con una, dos o
tres unidades TexelFX independientes para aumentar la velocidad del
mapeado de texturas.  Incluso yendo m&aacute;s lejos, un sistema Voodoo se
puede configurar con m&uacute;ltiples subsistemas y usar entrelazados para
doblar de forma efectiva la tasa de renderizaci&oacute;n. Estas
configuraciones avanzadas son capaces de propocionar rendimientos
superiores incluso que las estaciones de trabajo SGI de gama alta. Por
supuesto estas configuraciones avanzadas son bastante m&aacute;s costosas que
las tarjetas Voodoo simples, que cubren con creces el uso medio de la
mayor&iacute;a de usuarios.</P>

     <A NAME="3dfx"></A>
    <B><FONT FACE="Arail, Helvetica" SIZE=3>Programaci&oacute;n con
3Dfx</FONT></B><BR><BR>

    <P>3Dfx Interactive no publica documentaci&oacute;n relativa a la
programaci&oacute;n de sus chips a nivel de registros por temor a facilitar
el plagio de su hardware mediante ingenier&iacute;a inversa. En su lugar,
distribuyen un kit de desarrollo llamado Glide que act&uacute;a como una
microcapa de software para acceder al hardware. Glide es un conjunto
de funciones organizadas en forma de biblioteca que oculta las
especificaciones de los registros a la vez que proporciona un interfaz
de programaci&oacute;n relativamente sencillo. Las bibliotecas se portan a
cada plataforma (inclu&iacute;do Linux) que 3Dfx elija para dar soporte,
junto con una documentaci&oacute;n muy detallada del interfaz. Los
desarrolladores pueden entonces usar el interfaz para desarrollar sus
propias aplicaciones con la 3Dfx. Glide es una biblioteca gr&aacute;fica de
muy bajo nivel, no como OpenGL o Direct3D. No proporciona ninguna
capacidad gr&aacute;fica de alto nivel como mostrar listas o funciones de
transformaci&oacute;n. Tan solo proporciona una peque&ntilde;a abstracci&oacute;n de los
registros hardware y unas funciones por software que acceden a las
rutinas implementadas directamente en el hardware. He podido hablar
con la persona que port&oacute; Glide a Linux, que indica que la biblioteca
es muy simple. B&aacute;sicamente, dice que solamente debe pasar los
par&aacute;metros correctos a las funciones de Glide, que se limitan a
pasarlos a los registros de la tarjeta e indicar a la 3Dfx que
renderize.</p>

   <P>Esto no quiere decir que los desarrolladores con OpenGL o
Direct3D no puedan desarrollar aplicaciones 3Dfx. Los drivers de
OpenGL y Direct3D han sido escritos para usar Glide, para que los
desarrolladores puedan usar los interfaces de ambos entornos y los
drivers traducir&aacute;n las funciones de alto nivel a llamadas espec&iacute;ficas
a Glide, el que a su vez ejecuta 3Dfx. Este es un m&eacute;todo muy r&aacute;pido y
eficiente para el desarrollo.</P>

    <A NAME="mesa"></A>
    <B><FONT FACE="Arail, Helvetica" SIZE=3>Usando Mesa con
3Dfx</FONT></B><BR><BR>

   <P>Se ha escrito un driver que interact&uacute;a entre Mesa (la
implementaci&oacute;n libre de OpenGL que corre sobre muchos sistemas
operativos) y Glide, para permitir la ejecuci&oacute;n de aplicaciones OpenGL
sobre Linux y Windows95 con soporte hardware. Linux es libre, los
compiladores para Linux lo son, Mesa lo es, y el kit de desarrollo
Glide de 3Dfx lo es. &iexcl;Toda esta combinaci&oacute;n proporciona un sistema de
desarrollo de increiblemente bajo coste y a la vez de muy altas
prestaciones! Desafortunadamente, no hay a&uacute;n kit de desarrollo Glide
para linux en sistemas Alpha o Sparc, por lo que por ahora se limita a
la plataforma Intel x86.</P>

   <P>A la hora de escribir estas l&iacute;neas, la &uacute;ltima versi&oacute;n de Mesa es
la 2.5, y ya est&aacute; disponible la 2.6 en fase beta, en pruebas. El
driver Mesa est&aacute; muy avanzado y es capaz de acelerar la renderizaci&oacute;n
de puntos, l&iacute;neas y pol&iacute;gonos con sombras planas y sombras gouraud,
adem&aacute;s de mapeado de texturas, depth buffering, fogging y
blending. Aunque mencion&eacute; antes que el chip Voodoo 3Dfx no era capaz
de nada excepto renderizaci&oacute;n a pantalla completa, es posible
conseguir renderizaci&oacute;n dentro de una ventana gracias a un peque&ntilde;o
truco en el driver Mesa, que toma los datos de la memoria intermedia
de cuadros y la transfiere por el bus PCI a la memoria de video de la
tarjeta convencional. Incluso aunque no es tan r&aacute;pido como la
renderizaci&oacute;n a pantalla completa, es a&uacute;n mucho m&aacute;s r&aacute;pido que la
renderizaci&oacute;n por software de Mesa en solitario.</P>

<P>Mesa est&aacute; disponible para descargarlo del servidor ftp de Mesa en
<A HREF="ftp://iris.ssec.wisc.edu/pub/Mesa">
ftp://iris.ssec.wisc.edu/pub/Mesa</A>. Mesa se distribuye en dos
paquetes separados: uno contiene la biblioteca principal y los
ficheros de cabecera, y comienza con el nombre MesaLib, mientras que
el otro archivo es s&oacute;lo de ejemplos demostrativos, y comienza con el
nombre MesaDemos. Para instalarlo simplemente desempaquete el archivo
en formato <i>tar</i>, cambie al directorio creado durante el proceso,
y a partir de aqu&iacute; dispone de varias alternativas para construir
Mesa. Desde Mesa 2.5 hubo unas cuantas rutinas de transformacion
reescritas en lenguaje ensamblador de intel x86 para optimizar la
velocidad. Por desgracia no est&aacute;n del todo libre de errores, pero ya
corregios en las versiones beta de Mesa 2.6. Para compilar Mesa con
soporte 3Dfx pero sin las rutinas en ensamblador, s&oacute;lo teclear&iacute;a la
orden "make linux-glide" (por supuesto sin las comillas). Para
compilarlo con 3Dfx e incluyendo las rutinas, teclear&iacute;a "make
linux-386-glide". A partir de Mesa 2.6 se han escrito optimizaciones
en el <i>makefile</i> que permiten al compilador producir c&oacute;digo que
optimizar&aacute; Mesa para usarlo con los famosos juegos GlQuake and
QuakeII. Si quiere optimizaci&oacute;n GlQuake usar&iacute;a "make
linux-386-quake-glide" para compilar Mesa.</p>

    <P>Una vez compilado Mesa, hay varias formas de instalarlo.  Una
alternativa podr&iacute;a ser colocar los ficheros de cabecera y bibliotecas
respectivamente en los directorios /usr/include y /usr/lib, o quiz&aacute;s
en /usr/local/include y /usr/local/lib. O bien puede colocarlos en
cualquier directorio siempre que el cargador din&aacute;mico de Linux pueda
encontrarlos, seg&uacute;n se le indique en el fichero de configuraci&oacute;n
/etc/ld.so.conf. Ya que Mesa se desarrolla con rapidez y me gusta
probar las betas a medida que se publican, conservo copias en
directorios separados para cada version. Cualquiera que sea la versi&oacute;n
que quiera usar, cambio mi fichero ld.so.conf para incluir ese
directorio incluyendo la versi&oacute;n deseada. Sin embargo, es muy
importante no olvidar el paso de cambiar adecuadamente el fichero
ld.so.conf y ejecutar la utilidad ldconfig, para ajustar correctamente
los enlaces simb&oacute;licos en los directorios con biblioteclas entre otras
tareas. Si desea ver qu&eacute; bibliotecas conoce exactamente su sistema,
puede usar la opci&oacute;n -p de ldconfig: cuando quiero saber qu&eacute; versi&oacute;n
de Mesa usar&aacute; una aplicaci&oacute;n, tecleo la orden siguiente para mostrar
la revisi&oacute;n de la biblioteca Mesa actualmente en uso</P>:
<TT>ldconfig -p | grep Mesa</tt>

<P>Una vez instalado Mesa ya est&aacute; listo para comenzar. Para usar una
aplicaci&oacute;n Mesa que use 3Dfx debe ejecutarla como root, y debe tener
preparado el servidor Xwindow con una profundidad de color de 16 bits
por pixel. Si descarg&oacute; y desempaquet&oacute; el paquete de demos, se habr&aacute;n
compilado junto a Mesa y ya puede probarlos. Cuando use Mesa, hay tres
diferentes formas de ejecutar una aplicaci&oacute;n. Lo primero, puede
hacerlo todo con software de renderizaci&oacute;n que no use 3Dfx para
nada. Esta es la opci&oacute;n inicialmente por defecto. Para hacer que la
aplicaci&oacute;n use 3Dfx debe definir una variable de entorno. Para hacer
que se ejecute la aplicaci&oacute;n con 3Dfx a pantalla completa debe
definir</P> <TT>MESA_GLX_FX=fullscreen </TT><BR><BR> <P>y el programa
usar&aacute; 3Dfx en consecuencia. Sin embargo usar un programa Mesa dentro
de Xwindows puede necesitar ciertos trucos. Cuando ejecute un programa
Mesa, el servidor X no sabe en realidad si 3Dfx existe siquiera. Lo
que sucede es que inicializa y abre una ventana, y 3Dfx es
inicializado y puede empezar a renderizar. Si el cursor del rat&oacute;n se
sale de la ventana en el servidor X, el programa Mesa no ser&aacute; capaz
desde ese momento de aceptar entrada de teclado o eventos de
rat&oacute;n. Por tanto, si no est&aacute; usando m&aacute;s que un monitor, es aconsejable
usar la colocaci&oacute;n interactiva de ventanas si el gestor lo soporta, o
de lo contrario cuando arranque la aplicaci&oacute;n Mesa, 3Dfx entrar&aacute; en
funcionamiento y no ser&aacute; capaz de ver su escritorio en el servidor X
para colocar el cursor del rat&oacute;n de nuevo dentro de la ventana. S&iacute; que
es posible escribir un programa Mesa para interceptar el movimiento
del cursor de forma que una vez entra el rat&oacute;n en la ventana no pueda
salir, que al alcanzar el borde de la ventana sea colocado de nuevo en
el centro de la ventana.</P>

<P>Para hacer que una aplicaci&oacute;n use 3Dfx para renderizar dentro de
una ventana tiene que definir otras variables de entorno:</p>

<TT>SST_VGA_PASS=1<BR>
    SST_NOSHUTDOWN=1
    MESA_GLX_FX=window</TT>

<P>Una vez fijadas estas variables y ejecutado el programa, deber&iacute;a
obtener mejor rendimiento durante la renderiziaci&oacute;n que la resultante
con m&eacute;todos por software.</P>



          </TD>
        </TR>
	 </TABLE>

     <HR size=2 noshade>
     <P align="right"><I>Traducido por Gonzalo Garcia Agullo</I></P>

    </TD>

 </TR>

 </TBODY>

<TBODY>
  <TR>
    <TD colspan="2">
    <B>Para m&aacute;s informaci&oacute;n</B>:<BR>
    <UL>
      <LI>Visite <A href="http://www.3dfx.com">3Dfx Interactive</A>.</LI> 
     <UL><BR><BR>
    <TD>
  </TR>
</TBODY>

 <TR bgcolor="#660033">
   <TD colspan="2" align="center"><FONT face="Helvetica,Arial" color="#FFFFFF"><B>
         &copy; 1998 Phillip Ross</B></FONT><BR>
    <FONT color="#ffffff">Esta p&aacute;gina est&aacute; mantenida por 
    <A href="mailto:angel@mercury.chem.pitt.edu"><FONT color="#ffffff">Miguel A Sepulveda</FONT></A></FONT>.
   </TD>
 </TR>



</TABLE>


</BODY>
</HTML>






