<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>RAID-Software C&Oacute;MO: Asuntos hardware</TITLE>
 <LINK HREF="Software-RAID-Como-4.html" REL=next>
 <LINK HREF="Software-RAID-Como-2.html" REL=previous>
 <LINK HREF="Software-RAID-Como.html#toc3" REL=contents>
</HEAD>
<BODY>
<A HREF="Software-RAID-Como-4.html">Página siguiente</A>
<A HREF="Software-RAID-Como-2.html">Página anterior</A>
<A HREF="Software-RAID-Como.html#toc3">Índice general</A>
<HR>
<H2><A NAME="s3">3. Asuntos hardware</A></H2>

<P>
<P>Esta secci&oacute;n mencionar&aacute; algunos de los asuntos hardware involucrados en el
funcionamiento de un RAID software. 
<P>
<H2><A NAME="ss3.1">3.1 Configuraci&oacute;n IDE</A>
</H2>

<P>
<P>En efecto, es posible hacer funcionar un RAID sobre discos IDE. Tambi&eacute;n se
puede obtener un rendimiento excelente. De hecho, el precio actual de los
discos y las controladoras IDE hacen de IDE algo a tener en cuenta cuando
se montan nuevos sistemas RAID. 
<P>
<UL>
<LI><B>Estabilidad f&iacute;sica:</B> tradicionalmente, los discos IDE han
sido de peor calidad mec&aacute;nica que los discos SCSI. Incluso hoy en d&iacute;a, la
garant&iacute;a de los discos IDE es t&iacute;picamente de un a&ntilde;o, mientras que, a
menudo, es de 3 a 5 a&ntilde;os en los discos SCSI. Aunque no es justo decir que
los discos IDE son por definici&oacute;n de menor calidad, uno deber&iacute;a ser
consciente de que los discos IDE de <EM>algunas</EM> marcas
<EM>pueden</EM> fallar con m&aacute;s frecuencia que los discos SCSI similares.
Sin embargo, otras marcas usan exactamente la misma estructura mec&aacute;nica
tanto para los discos SCSI como para los discos IDE. Todo se reduce a:
todos los discos fallan, tarde o temprano, y uno deber&iacute;a estar preparado
para ello. 
</LI>
<LI><B>Integridad de los datos:</B> al principio, IDE no ten&iacute;a forma
de asegurar que los datos enviados a trav&eacute;s del bus IDE eran los mismos
que los datos escritos realmente en el disco. Esto se debi&oacute; a la falta
total de paridad, sumas de verificaci&oacute;n (<I>checksums</I>), etc. Ahora, con
el est&aacute;ndar <I>UltraDMA</I>, los dispositivos IDE realizan una suma de
verificaci&oacute;n sobre los datos que reciben y por eso es altamente improbable
que los datos se corrompan. 
</LI>
<LI><B>Rendimiento:</B> no voy a escribir aqu&iacute; sobre el rendimiento de
IDE de forma detallada. Una historia realmente breve ser&iacute;a: 

<UL>
<LI>Los dispositivos IDE son r&aacute;pidos (12 MB/s y m&aacute;s)</LI>
<LI>IDE tiene una mayor sobrecarga de CPU que SCSI (pero, ¿a qui&eacute;n le
preocupa?) 
</LI>
<LI>S&oacute;lo usa <B>un</B> disco IDE por bus, los discos esclavos
deterioran el rendimiento.
</LI>
</UL>
</LI>
<LI><B>Resistencia a los fallos:</B> la controladora IDE normalmente
sobrevive a un dispositivo IDE que ha fallado. La capa RAID marcar&aacute; el
disco como defectuoso y, si est&aacute; trabajando con un RAID de nivel 1 o
superior, la m&aacute;quina deber&iacute;a trabajar igual de bien hasta que la
desconecte para su mantenimiento. 
</LI>
</UL>
<P>Es <B>muy</B> importante que s&oacute;lo use <B>un</B> disco IDE por bus IDE. 
Dos discos no s&oacute;lo arruinar&iacute;an el rendimiento sino que, tambi&eacute;n, el fallo
de un disco a menudo garantiza el fallo del bus y, por tanto, el fallo de
todos los discos de ese bus. En una configuraci&oacute;n RAID tolerante a fallos
(RAID de niveles 1, 4, 5) el fallo de un disco se puede manejar, pero el
fallo de dos discos (los dos discos del bus que ha fallado debido a
uno de ellos) dejar&aacute; el array inutilizable. Tambi&eacute;n, el
dispositivo esclavo o la controladora IDE de un bus pueden confundirse de
manera horrible cuando el dispositivo maestro del bus falla. Un bus, un
disco, esa es la regla. 
<P>Existen controladoras IDE PCI baratas. A menudo puede obtener 2 o 4 buses
por unos 80 d&oacute;lares. Considerando el precio mucho m&aacute;s bajo de los discos
IDE respecto a los discos SCSI, dir&iacute;a que un array de discos IDE podr&iacute;a
ser una soluci&oacute;n realmente buena si uno puede vivir con los relativamente
pocos discos (unos 8 probablemente) que se pueden conectar a un sistema
t&iacute;pico (a menos que, naturalmente, tenga muchas ranuras PCI para dichas
controladoras IDE). 
<P>
<H2><A NAME="ss3.2">3.2 Cambio de discos en caliente (<I>Hot-Swap</I>)</A>
</H2>

<P>
<P>&Eacute;ste ha sido un tema de actualidad en la lista linux-kernel durante alg&uacute;n
tiempo. Aunque el intercambio en caliente de los dispositivos est&aacute;
soportado hasta cierto punto, todav&iacute;a no es algo que se pueda hacer
f&aacute;cilmente. 
<P>
<H3>Intercambio en caliente de dispositivos IDE</H3>

<P>
<P><B>¡No lo haga!</B> IDE no soporta en modo alguno el intercambio en
caliente.  Seguro, puede funcionar para usted si compila el soporte IDE
como m&oacute;dulo (s&oacute;lo posible en la serie <CODE>2.2.x</CODE> del n&uacute;cleo) y lo vuelve a
cargar despu&eacute;s de que haya reemplazado el dispositivo. Pero tambi&eacute;n puede
terminar perfectamente con una controladora IDE frita y observar&aacute; que el
per&iacute;odo de dicho sistema fuera de servicio ser&aacute; mucho mayor que habiendo
reemplazado el dispositivo con el sistema apagado. 
<P>El principal problema, aparte de los aspectos el&eacute;ctricos que pueden
destruir su hardware, es que se debe reexplorar el bus IDE despu&eacute;s de que
se hayan intercambiado los discos. El manejador IDE actual no puede hacer
eso. Si el nuevo disco es 100% id&eacute;ntico al antiguo (geometr&iacute;a, etc.)
<EM>puede</EM> que funcione incluso sin volver a explorar el bus pero,
cr&eacute;ame, aqu&iacute; est&aacute; caminando por <I>el filo de la navaja</I>. 
<P>
<H3>Intercambio en caliente (<I>Hot-Swap</I>) de dispositivos SCSI</H3>

<P>
<P>El hardware SCSI normal tampoco es capaz de soportar intercambios en
caliente. Sin embargo, <EM>puede</EM> que funcione. Si su manejador SCSI
soporta la reexploraci&oacute;n del bus y la conexi&oacute;n y desconexi&oacute;n de
dispositivos, puede ser capaz de intercambiar dispositivos en caliente.
Sin embargo, en un bus SCSI normal probablemente no deber&iacute;a desenchufar
dispositivos mientras su sistema est&eacute; todav&iacute;a encendido. Pero, le repito,
puede que funcione simplemente (y tambi&eacute;n puede terminar con su hardware
frito). 
<P>La capa SCSI <B>deber&iacute;a</B> sobrevivir si un disco muere, pero no todos
los manejadores SCSI soportan esto todav&iacute;a. Si su manejador SCSI muere
cuando un disco cae, su sistema caer&aacute; con &eacute;l y la conexi&oacute;n en caliente no
ser&aacute; verdaderamente interesante entonces. 
<P>
<H3>Intercambio en caliente con SCA</H3>

<P>
<P>Con SCA deber&iacute;a ser posible conectar dispositivos en caliente. Sin
embargo, no poseo el hardware para probar esto y no he o&iacute;do de nadie que
lo haya probado, por lo que verdaderamente no puedo dar ninguna receta de
c&oacute;mo hacer esto. 
<P>De todos modos, si quiere jugar con esto, deber&iacute;a conocer los aspectos
internos de SCSI y de RAID. Por tanto, no voy a escribir aqu&iacute; nada que no
pueda comprobar que funciona. En cambio, s&iacute; puedo proporcionarle algunas
pistas:
<P>
<UL>
<LI>Busque la cadena <CODE>remove-single-device</CODE> en
<CODE>linux/drivers/scsi/scsi.c</CODE></LI>
<LI>Eche un vistazo a <CODE>raidhotremove</CODE> y <CODE>raidhotadd</CODE></LI>
</UL>
<P>No todos los manejadores SCSI soportan la conexi&oacute;n y desconexi&oacute;n de
dispositivos. En la serie 2.2 del n&uacute;cleo, al menos los manejadores de la
controladoras Adaptec 2940 y Symbios NCR53c8xx parecen soportarlo,
mientras que otras puede que s&iacute; o puede que no. Agradecer&iacute;a que alguien me
pasara m&aacute;s informaci&oacute;n sobre esto... 
<P>
<HR>
<A HREF="Software-RAID-Como-4.html">Página siguiente</A>
<A HREF="Software-RAID-Como-2.html">Página anterior</A>
<A HREF="Software-RAID-Como.html#toc3">Índice general</A>
</BODY>
</HTML>
