<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>RAID-Software C&Oacute;MO: Introducci&oacute;n</TITLE>
 <LINK HREF="Software-RAID-Como-2.html" REL=next>

 <LINK HREF="Software-RAID-Como.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Software-RAID-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Software-RAID-Como.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>

<P>
<P>Este C&Oacute;MO ha sido escrito por Jakob &Oslash;stergaard bas&aacute;ndose en un gran
n&uacute;mero de mensajes de correo entre el autor, Ingo Molnar (<CODE>
<A HREF="mailto:mingo@chiara.csoma.elte.hu">mingo@chiara.csoma.elte.hu</A></CODE>) 
-- uno de los desarrolladores de RAID --,
la lista de correo linux-raid (<CODE>
<A HREF="mailto:linux-raid@vger.rutgers.edu">linux-raid@vger.rutgers.edu</A></CODE>) y diversas personas.
<P>La raz&oacute;n por la que se ha escrito este C&Oacute;MO, a pesar de existir ya un
RAID-Software C&Oacute;MO es que el anterior describe el estilo antiguo de RAID
por software, presente en los n&uacute;cleos existentes. Este C&Oacute;MO describe el
uso del «nuevo estilo» de RAID que se ha desarrollado m&aacute;s recientemente.
&Eacute;ste nuevo estilo de RAID tiene muchas caracter&iacute;sticas no presentes en el
anterior. 
<P>Parte de la informaci&oacute;n de este C&Oacute;MO le puede parecer trivial si es un
entendido en RAID. S&aacute;ltese esas partes. 
<P>
<H2><A NAME="ss1.1">1.1 Renuncia de responsabilidad</A>
</H2>

<P>
<P>La declinaci&oacute;n obligatoria de responsabilidades:
<P>Aunque el c&oacute;digo RAID tratado aqu&iacute; me ha parecido ser estable, y para
muchas otras personas, puede no funcionar para Usted. Si pierde todos sus
datos, su trabajo, es golpeado por un cami&oacute;n o cualquier otra cosa, no
ser&aacute; culpa m&iacute;a ni de los desarrolladores. ¡Conci&eacute;ncese de que usa el
software RAID y esta informaci&oacute;n por su cuenta y riesgo!. No hay ning&uacute;n
tipo de garant&iacute;a de que ning&uacute;n software ni esta informaci&oacute;n sean correctos
en modo alguno, ni adecuados para cualquier tipo de uso en particular.
Haga copia de seguridad de sus datos antes de experimentar con esto. M&aacute;s
vale prevenir que lamentarse. 
<P>
<H2><A NAME="ss1.2">1.2 Requisitos</A>
</H2>

<P>
<P>Este C&Oacute;MO asume que est&aacute; usando alguna de las &uacute;ltimas versiones <CODE>2.2.x</CODE>
o <CODE>2.0.x</CODE> del n&uacute;cleo con un parche <CODE>raid0145</CODE> acorde y la versi&oacute;n
<CODE>0.90</CODE> del paquete <CODE>raidtools</CODE>. Ambos se pueden encontrar en
<CODE>
<A HREF="ftp://ftp.fi.kernel.org/pub/linux/daemons/raid/alpha">ftp://ftp.fi.kernel.org/pub/linux/daemons/raid/alpha</A></CODE>. El
parche RAID, el paquete <CODE>raidtools</CODE> y el n&uacute;cleo deben concordar tanto
como sea posible. En ocasiones puede ser necesario usar un n&uacute;cleo antiguo
si no hay parches raid disponibles para el &uacute;ltimo. 
<P>
<HR>
<A HREF="Software-RAID-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Software-RAID-Como.html#toc1">Índice general</A>
</BODY>
</HTML>
