<HTML>
<HEAD>
<TITLE>Cortafuegos COMO: Configuraci&oacute;n Avanzada</TITLE>
</HEAD>
<BODY>
<A HREF="Cortafuegos-Como-5.html">Anterior</A>
<A HREF="Cortafuegos-Como-7.html">Siguiente</A>
<A HREF="Cortafuegos-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Configuraci&oacute;n Avanzada</A></H2>


<P>Hay una configuraci&oacute;n que me gustar&iacute;a mostrar antes de dar por terminado
este documento. La que acabo de comentar bastar&aacute; seguramente para la
mayor&iacute;a de la gente. Sin embargo, pienso que el pr&oacute;ximo ejemplo mostrar&aacute;
una m&aacute;s avanzada que puede resolver algunas dudas.  Si tienes preguntas
que trascienden lo cubierto hasta aqu&iacute;, o simplemente est&aacute;s interesado/a
en la versatilidad de los servidores proxy y los cortafuegos, sigue
leyendo. </P>

<H2><A NAME="ss6.1">6.1 Una gran red con &eacute;nfasis en la seguridad</A></H2>


<P>Digamos, por ejemplo, que eres el l&iacute;der de la <EM>Vig&eacute;simo Tercera
Hermandad de la Discordia de Milwaukee</EM>. Te gustar&iacute;a poner una red. 
Tienes 50 ordenadores y una subred de 32 (5 bites) direcciones IP
(reales). Hay varios niveles de acceso. Se dicen cosas distintas a los
disc&iacute;pulos seg&uacute;n el nivel en que est&aacute;n. Obviamente, querr&aacute;s proteger
ciertas partes de la red de los disc&iacute;pulos que no est&aacute;n en ese nivel. </P>
<P><EM>Renuncia de Responsabilidad:</EM> No soy miembro de la Hermandad de la
Discordia. No conozco su terminolog&iacute;a, ni me importa. Solo los estoy
usando como ejemplo.  Por favor, mandad todos los frutos de vuestros
arrebatos de ira a</P>
<P>Los niveles son:</P>
<P>
<OL>
<LI><B>El nivel externo</B>. &Eacute;ste es el nivel que se ense&ntilde;a a
cualquiera.  B&aacute;sicamente es un rollo patatero sobre Eris, Diosa de la
Discordia, y un mont&oacute;n de chorradas m&aacute;s. 
</LI>
<LI><B>Iniciado</B>. Este es el nivel para la gente que ha pasado del
nivel externo. Aqu&iacute; es donde se les dice que la discordia y la estructura
son realmente una, y que Eris es tambi&eacute;n Jehov&aacute;. 
</LI>
<LI><B>Adepto</B>. Aqu&iacute; es donde se encuentra el <EM>verdadero</EM>
plan. En este nivel se guarda toda la informaci&oacute;n de c&oacute;mo la Sociedad de
la Discordia va a dominar el mundo gracias a un diab&oacute;lico, aunque jocoso,
plan que implica a Newt Gingrich, los Cereales Wheaties, O.J. Simpson, y
quinientos cristales de cuarzo err&oacute;neamente etiquetados como de 6,5 MHz. </LI>
</OL>
</P>

<H3>Configuraci&oacute;n de la Red</H3>


<P>Las direcciones IP se disponen as&iacute;:</P>
<P>
<UL>
<LI>Una direcci&oacute;n es 192.168.2.255, que es la de difusi&oacute;n y por lo tanto
no utilizable. </LI>
<LI>23 de las 32 direcciones IP se asignan a las 23 m&aacute;quinas accesibles
desde la Internet. </LI>
<LI>Una direcci&oacute;n IP extra es para una m&aacute;quina LiNUX en esa red.</LI>
<LI>Una direcci&oacute;n IP extra es para otra m&aacute;quina LiNUX en esa red.</LI>
<LI>Dos direcciones IP son para el router que los conecta con la Internet.</LI>
<LI>Cuatro se dejan sin usar, pero se les asignan los nombres paul,
ringo, john, y george, s&oacute;lo para confundir las cosas un poco. </LI>
<LI>Las dos redes protegidas tienen direcciones del tipo 192.168.2.xxx .</LI>
</UL>
</P>
<P>Entonces se instalan dos redes, cada una en una habitaci&oacute;n separada.  Se
utilizan Ethernets de infrarrojos, de tal manera que son completamente
invisibles desde la habitaci&oacute;n exterior. Por suerte, la Ethernet de
infrarrojos funciona como la normal (o eso creo), de modo que podemos
pensar en ellas como si fueran Ethernets normales. </P>
<P>Cada una de esas redes se conecta a una de las m&aacute;quinas LiNUX a las que se
asignaron las direcciones IP extras. </P>
<P>Hay un servidor de ficheros que conecta las dos redes protegidas. Esto se
debe a que los planes para dominar el mundo implican a algunos de los
iniciados de mayor nivel. El servidor de ficheros tiene la direcci&oacute;n
<CODE>192.168.2.17</CODE> para la red de iniciados, y la <CODE>192.168.2.23</CODE>
para la de adeptos. Tiene que tener dos direcciones dado que tiene dos
tarjetas Ethernet. Tiene <B>deshabilitado</B> el reenvio de paquetes IP. </P>
<P>El reenvio de paquetes IP tambi&eacute;n est&aacute; deshabilitado en los dos LiNUXes.
El router no encaminar&aacute; paquetes con destino 192.168.2.xxx a menos que se
le diga expl&iacute;citamente, as&iacute; que la Internet en ning&uacute;n caso podr&iacute;a acceder
al interior. La raz&oacute;n para deshabilitar el reenvio de paquetes IP aqu&iacute; es
para que los paquetes de la red de adeptos no lleguen a la de iniciados y
viceversa. </P>
<P>El servidor de NFS puede ser configurado para ofrecer diferentes ficheros
a las diferentes redes. Esto puede venir al pelo, y unos pocos trucos con
enlaces simb&oacute;licos pueden hacer que se compartan los ficheros comunes
entre todos. Con esta configuraci&oacute;n y otra tarjeta Ethernet, el mismo
servidor de ficheros puede dar servicio a las tres redes. </P>

<H3>El Servidor Proxy</H3>

<P> </P>
<P>Dado que los tres niveles quieren rastrear la Internet para sus propios y
diab&oacute;licos prop&oacute;sitos, los tres necesitan tener acceso a ella. La red
externa est&aacute; conectada directamente a la Internet, luego no tenemos que
hacer nada. Las redes de adeptos e iniciados est&aacute;n detr&aacute;s de sendos
cortafuegos, luego es necesario instalar servidores proxy para ellas. </P>
<P>Las dos redes se configurar&aacute;n de forma muy parecida. Ambas tienen las
mismas direcciones IP asignadas. A&ntilde;adir&eacute; un par de requisitos para hacerlo
m&aacute;s interesante: </P>
<P>
<OL>
<LI>No se debe poder usar el servidor de ficheros para acceder a la
Internet Esto le expone a virus y otras cosas desagradables, y es bastante
importante. 
</LI>
<LI>No permitiremos a los Iniciados acceso al World Wide Web. Est&aacute;n
form&aacute;ndose, y la adquisici&oacute;n de ese tipo de informaci&oacute;n podr&iacute;a resultar
da&ntilde;ina. 
</LI>
</OL>
</P>
<P>As&iacute;, el fichero <CODE>sockd.conf</CODE> en el LiNUX de los iniciados tendr&aacute; esta
l&iacute;nea:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
deny 192.168.2.17 255.255.255.255
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y en la m&aacute;quina de los adeptos:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
deny 192.168.2.23 255.255.255.255
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Y, el LiNUX de los iniciados tendr&aacute; esta l&iacute;nea</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
deny 0.0.0.0 0.0.0.0 eq 80
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Que dice que se deniegue a todas las m&aacute;quinas el acceso al puerto igual
(<EM>eq</EM>) a 80, el puerto del http. Esto a&uacute;n permitir&aacute; el acceso a
otros servicios, s&oacute;lo impedir&aacute; el acceso al Web. </P>
<P>Adem&aacute;s, ambos ficheros contendr&aacute;n:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
permit 192.168.2.0 255.255.255.0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>para permitir a todos los ordenadores de la red 192.168.2.xxx usar este
servidor proxy, excepto aquello que ya ha sido prohibido (esto es:
cualquier acceso desde el servidor de ficheros y el acceso al Web desde la
red de iniciados) </P>
<P>El fichero <CODE>sockd.conf</CODE> de los iniciados ser&aacute; m&aacute;s o menos:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
deny 192.168.2.17 255.255.255.255
deny 0.0.0.0 0.0.0.0 eq 80
permit 192.168.2.0 255.255.255.0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>y el de los adeptos ser&aacute; m&aacute;s o menos:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
deny 192.168.2.23 255.255.255.255
permit 192.168.2.0 255.255.255.0
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Con esto todo deber&iacute;a estar configurado correctamente. Cada red est&aacute;
aislada como corresponde, con el grado apropiado de interacci&oacute;n. Todo el
mundo deber&iacute;a estar contento. Ahora, <EM>cuidado con los cristales de 6,5
MHz...</EM></P>


<HR>
<A HREF="Cortafuegos-Como-5.html">Anterior</A>
<A HREF="Cortafuegos-Como-7.html">Siguiente</A>
<A HREF="Cortafuegos-Como.html#toc6">Indice</A>
</BODY>
</HTML>
