<HTML>
<HEAD>
<TITLE>Cortafuegos COMO: Software para Cortafuegos </TITLE>
</HEAD>
<BODY>
<A HREF="Cortafuegos-Como-3.html">Anterior</A>
<A HREF="Cortafuegos-Como-5.html">Siguiente</A>
<A HREF="Cortafuegos-Como.html#toc4">Indice</A>
<HR>
<H2><A NAME="soft"></A> <A NAME="s4">4. Software para Cortafuegos </A></H2>



<H2><A NAME="ss4.1">4.1 Paquetes disponibles</A></H2>


<P>Un cortafuegos en sentido estricto no necesita ning&uacute;n software aparte del
n&uacute;cleo de LiNUX y los programas b&aacute;sicos de red (inetd, telnetd y telnet,
ftpd y ftp). Pero un cortafuegos as&iacute; es extremadamente restrictivo y no
muy &uacute;til. </P>
<P>As&iacute; que la gente ha hecho programas para aumentar la utilidad de los
cortafuegos. El que examinaremos con mayor detalle es un paquete llamado
"<EM>socks</EM>", que implementa un <CODE>servidor proxy</CODE>. Sin embargo,
existe otro par de programas que hay que tomar en consideraci&oacute;n. Ahora les
daremos un r&aacute;pido repaso. </P>


<H2><A NAME="ss4.2">4.2 El juego de herramientas para cortafuegos de TIS</A></H2>


<P><EM>TIS</EM> ha sacado una colecci&oacute;n de programas para facilitar la
realizaci&oacute;n de cortafuegos. B&aacute;sicamente, los programas hacen lo mismo que
el paquete <EM>Socks</EM>, pero tiene una estrategia de dise&ntilde;o diferente.
Mientras que <CODE>Socks</CODE> tiene un &uacute;nico programa que cubre todas las
operaciones de la Internet, <CODE>TIS</CODE> provee un programa para cada
utilidad que quiera usar el cortafuegos. </P>
<P>Para compararlos mejor, veamos el ejemplo del acceso al <EM>Web</EM> y por
<EM>Telnet</EM>.  Con <CODE>Socks</CODE>, hay que hacer un fichero de
configuraci&oacute;n y poner en marcha un demonio. Mediante ese fichero y ese
demonio se activan tanto el <CODE>Telnet</CODE> como el <CODE>Web</CODE>, as&iacute; como
cualquier otro servicio que no se haya desactivado expl&iacute;citamente. </P>
<P>Con las <CODE>herramientas TIS</CODE>, se arranca un demonio para el
<CODE>Web</CODE> y otro para el <CODE>Telnet</CODE>, y se escribe un fichero de
configuraci&oacute;n para cada uno. Despu&eacute;s de haber hecho eso, el resto de
formas de acceso a Internet siguen prohibidas hasta que se configuren
expl&iacute;citamente. Si no existe un demonio especial para una determinada
utilidad (por ejemplo, para talk), hay un demonio <EM>"para todo"</EM>
pero no es ni tan flexible, ni tan f&aacute;cil de configurar como las otras
herramientas. </P>
<P>Esto puede parecer una diferencia menor, pero en realidad es una gran
diferencia. <CODE>Socks</CODE> permite ser desidioso. Con un servidor de
<CODE>Socks</CODE> mal configurado la gente de dentro tiene m&aacute;s acceso a la
Internet del que se quer&iacute;a. Con las herramientas <CODE>TIS</CODE>, la gente
del interior tiene solamente el acceso que el administrador del sistema
quiera que tengan. </P>
<P><CODE>Socks</CODE> es m&aacute;s f&aacute;cil de configurar, m&aacute;s f&aacute;cil de compilar, y
permite una mayor flexibilidad. El <CODE>juego de herramientas de TIS</CODE>
es mas seguro si se quiere controlar a los usuarios <EM>de dentro</EM>.
<B>Los dos proporcionan una protecci&oacute;n absoluta del exterior</B>. </P>


<H2><A NAME="ss4.3">4.3 El Limitador de TCP (TCP Wrapper)</A></H2>


<P>El limitador de TCP no es una utilidad de cortafuegos, pero sirve para
algo parecido. Usando el limitador de TCP podemos controlar qui&eacute;n tiene
acceso a nuestra m&aacute;quina y a qu&eacute; servicios, as&iacute; como registrar las
conexiones. Tambi&eacute;n ofrece detecci&oacute;n b&aacute;sica de impostores. </P>
<P>El limitador de TCP no se cubre de manera m&aacute;s extensa aqu&iacute; por un par de
razones: </P>
<P>
<UL>
<LI>No es un verdadero cortafuegos.</LI>
<LI>Para utilizarlo se tiene que estar directamente conectado a la
Internet, es decir, se tiene que tener una direcci&oacute;n IP.</LI>
<LI>S&oacute;lo controla la m&aacute;quina en la que est&aacute; instalado, y por lo tanto no
sirve para una red. Los cortafuegos pueden proteger todas las m&aacute;quinas
cualquiera que sea su arquitectura. El limitador de TCP no funciona en
Macintoshes ni en MS G&uuml;indouses. </LI>
</UL>
</P>


<HR>
<A HREF="Cortafuegos-Como-3.html">Anterior</A>
<A HREF="Cortafuegos-Como-5.html">Siguiente</A>
<A HREF="Cortafuegos-Como.html#toc4">Indice</A>
</BODY>
</HTML>
