<HTML>
<HEAD>
<TITLE>Cortafuegos COMO: Configuraci&oacute;n</TITLE>
</HEAD>
<BODY>
<A HREF="Cortafuegos-Como-2.html">Anterior</A>
<A HREF="Cortafuegos-Como-4.html">Siguiente</A>
<A HREF="Cortafuegos-Como.html#toc3">Indice</A>
<HR>
<H2><A NAME="s3">3. Configuraci&oacute;n</A></H2>



<H2><A NAME="ss3.1">3.1 Requerimientos de Hardware</A></H2>


<P>Para nuestro ejemplo, el ordenador es un 486-DX66 con 8 Megas de RAM, una
partici&oacute;n para Linux de 500 Megas, y una conexi&oacute;n PPP a un proveedor de
Internet a trav&eacute;s de un m&oacute;dem de 14.400 bps . Ese es nuestro linux b&aacute;sico.
Para convertirlo en un cortafuegos le a&ntilde;adimos una tarjeta Ethernet
NE2000. Con ella queda conectado a tres PC'es con G&uuml;indous 3.1 y Trumpet
Winsock, y a dos Sun'es con SunOs. La raz&oacute;n de elegir este escenario es
que son las dos plataformas con las que estoy familiarizado. Imagino que
gran parte de lo que cuento aqu&iacute; es factible con Mac'es pero, dado que no
uso Mac'es con suficiente asiduidad, lo cierto es que no lo s&eacute;. </P>


<H2><A NAME="ss3.2">3.2 Configurando el Software</A></H2>


<P>As&iacute;, que ahora tenemos un LiNUX conectado a Internet por una linea PPP de
14.400 . Adem&aacute;s tenemos una red Ethernet que conecta el LiNUX y el resto
de los ordenadores. Lo primero, debemos recompilar el n&uacute;cleo con las
opciones apropiadas. En este momento yo echar&iacute;a un vistazo al
<I>Kernel-Como</I>, al <I>Ethernet-HOWTO</I>, y al
<I>NET-3-HOWTO</I>.  Luego teclear&iacute;a <CODE>"make config"</CODE>: </P>
<P>Las opciones requeridas son:</P>
<P>
<OL>
<LI>Habilitar el Soporte de Red</LI>
<LI>Habilitar la opci&oacute;n de red TCP/IP (TCP/IP Networking)</LI>
<LI>Deshabilitar el reenvio de paquetes IP (CONFIG_IP_FORWARD)</LI>
<LI>Habilitar la opci&oacute;n de Cortafuegos IP (IP Firewalling)</LI>
<LI>Probablemente, habilitar las cuentas IP (IP Accounting). Parece
razonable, dado que estamos configurando un dispositivo de seguridad</LI>
<LI>Habilitar el Soporte de Dispositivos de Red (Networking Device Support)</LI>
<LI>Habilitar el soporte de PPP y Ethernet, aunque esto depende del
tipo de interfaces que se tenga en cada caso</LI>
</OL>
</P>
<P>Ahora, recompilamos y reinstalamos el n&uacute;cleo y rearrancamos la m&aacute;quina.
Las interfaces deber&iacute;an ser reconocidas en la secuencia de arranque para
que todo estuviera bien. Si no, habr&iacute;a que repasar los Howtos antes
mencionados y volverlo a intentar hasta que funcionase. </P>


<H2><A NAME="ss3.3">3.3 Las Direcciones de Red</A></H2>


<P>Esta es la parte interesante. Dado que no queremos que la Internet tenga
acceso a nuestras m&aacute;quinas, no necesitamos usar direcciones reales. Una
buena elecci&oacute;n es el rango de direcciones de clase C 192.168.2.xxx, que
est&aacute; designado como rango para pruebas. Es decir, nadie lo usa, y no
entrar&aacute; en conflicto con ninguna petici&oacute;n al exterior. De modo que, en
esta configuraci&oacute;n, s&oacute;lo se necesita una direcci&oacute;n IP real. Las otras se
pueden elegir libremente y de ninguna manera afectar&aacute;n a la red. </P>
<P>Asignamos la direcci&oacute;n IP real al puerto serie del <CODE>cortafuegos</CODE>
que usamos para la conexi&oacute;n PPP. Asignamos 192.168.2.1 a la tarjeta
Ethernet del <CODE>cortafuegos</CODE>. Asignamos a las otras m&aacute;quinas de la
red protegida cualquier direcci&oacute;n del rango anterior. </P>


<H2><A NAME="ss3.4">3.4 Pruebas</A></H2>


<P>Lo primero es hacer ping a la internet desde el <CODE>cortafuegos</CODE>. Yo
antes usaba <CODE>nic.ddn.mil</CODE> como punto de prueba. No deja de ser una
buen sitio, pero ha demostrado ser menos fiable de lo que esperaba. Si no
funciona a la primera, probaremos a hacer pings a otro par de sitios que
no est&eacute;n conectados a nuestra red local. Si no funciona es que el PPP est&aacute;
mal configurado. Tendr&iacute;amos que volver a leer el <I>Net-3-HOWTO</I> y a
probar. </P>
<P>Ahora probaremos a hacer pings entre las m&aacute;quinas de la red protegida.
Todas deben ser capaces de hacer ping a las dem&aacute;s. Si no fuera as&iacute;, habr&iacute;a
que leer de nuevo el <I>Net-3-HOWTO</I> y trabajar en la red un poco
m&aacute;s. </P>
<P>Ahora, todas las m&aacute;quinas de la red protegida deben ser capaces de hacer
pings al <CODE>cortafuegos</CODE>. Si no, vuelta atr&aacute;s. Recuerda: deber&iacute;an ser
capaces de hacer ping a la 192.168.2.1, no a la direcci&oacute;n PPP. </P>
<P>Entonces probaremos a hacer ping a la direcci&oacute;n PPP del
<CODE>cortafuegos</CODE> desde dentro de la red protegida. <EM>No debe
funcionar</EM>. Si funciona es que no hemos deshabilitado el <EM>Reenvio
del Paquetes IP</EM> y habr&aacute; que recompilar el n&uacute;cleo. Al haber asignado a
la red protegida la direcci&oacute;n 192.168.2.0 ning&uacute;n paquete ser&aacute; encaminado a
ella por la Internet, pero, en cualquier caso, es m&aacute;s seguro tener el
reenv&iacute;o de paquetes IP deshabilitado. Esto deja el control en nuestras
manos, no en las manos de nuestro proveedor de PPP. </P>
<P>Finalmente, haremos ping a todas las m&aacute;quinas de la red protegida desde el
<CODE>cortafuegos</CODE>. Llegados a este punto, no deber&iacute;a haber problemas. </P>
<P>Ya tenemos una disposici&oacute;n de cortafuegos b&aacute;sica.</P>


<H2><A NAME="ss3.5">3.5 Seguridad para el Cortafuegos</A></H2>


<P>El cortafuegos no sirve si lo dejamos vulnerable a los ataques.  Primero
echaremos un vistazo al /etc/inetd.conf. Este es el fichero de
configuraci&oacute;n del as&iacute; llamado "superservidor" (inetd), que arranca un buen
n&uacute;mero de demonios servidores cuando les llega una petici&oacute;n. </P>
<P>Entre ellos:</P>
<P>
<UL>
<LI>Telnet</LI>
<LI>Talk</LI>
<LI>FTP</LI>
<LI>Daytime</LI>
</UL>
</P>
<P>Se debe desactivar todo lo que no se necesite. No dudaremos en desactivar
netstat, systat, tftp, bootp, y finger. Seguramente querremos desactivar
telnet, y dejar s&oacute;lo rlogin, o viceversa.</P>
<P>Para desactivar un servicio basta con poner un # al comienzo de la
linea que se refiera a &eacute;l.  Despu&eacute;s hay que mandar una se&ntilde;al SIG-HUP al
proceso inetd tecleando "<CODE>kill -HUP &lt;pid&gt;</CODE>", donde
<CODE>&lt;pid&gt;</CODE> es el n&uacute;mero de proceso de inetd. Esto har&aacute; que inetd
relea su fichero de configuraci&oacute;n (<CODE>inetd.conf</CODE>) y se reinicie. Lo
comprobaremos haciendo un telnet al puerto 15 del <CODE>cortafuegos</CODE>, el
puerto de netstat. Si aparece la respuesta de netstatd, no hemos
reiniciado inetd correctamente.</P>


<HR>
<A HREF="Cortafuegos-Como-2.html">Anterior</A>
<A HREF="Cortafuegos-Como-4.html">Siguiente</A>
<A HREF="Cortafuegos-Como.html#toc3">Indice</A>
</BODY>
</HTML>
