<HTML>
<HEAD>
<TITLE>Cortafuegos COMO: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Cortafuegos-Como-2.html">Siguiente</A>
<A HREF="Cortafuegos-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>


<P>Los cortafuegos han adquirido gran popularidad de un tiempo a esta parte
como el &uacute;ltimo grito en seguridad en la Internet. Como la mayor&iacute;a de las
cosas que la adquieren, con la popularidad han llegado los malentendidos. 
En este <I>Howto</I> se cubrir&aacute;n las bases de lo que es un
<B>cortafuegos</B>, c&oacute;mo configurar uno, qu&eacute; <B>servidores proxy</B>
hay, c&oacute;mo configurarlos, y las aplicaciones de esta tecnolog&iacute;a fuera del
campo de la seguridad. </P>


<H2><A NAME="ss1.1">1.1 Realimentaci&oacute;n</A></H2>


<P>Todo apoyo o cr&iacute;tica a este documento ser&aacute; bienvenido. Estoy buscando con
especial inter&eacute;s cr&iacute;ticas de la gente que usa Macintoshes, ya que la
informaci&oacute;n que tengo de ellos es escasa. <B>¡¡¡POR FAVOR, COMUNICADME
CUALQUIER INEXACTITUD EN ESTE DOCUMENTO!!!</B> Soy humano, y puedo
cometer errores. Si encontr&aacute;is alguno, me interesar&aacute; mucho conocerlo.
Intentar&eacute; contestar a todo el correo, pero estoy ocupado; as&iacute; que, que
nadie se ofenda si no lo hago.</P>
<P>Mi direcci&oacute;n de correo electr&oacute;nico es <CODE>
<A HREF="mailto:drig@execpc.com">drig@execpc.com</A></CODE></P>


<H2><A NAME="ss1.2">1.2 Renuncia de Responsabilidad </A></H2>


<P>Este documento intenta ser una introducci&oacute;n al funcionamiento de los
cortafuegos y servidores proxy. No soy, ni pretendo ser, un experto en
seguridad. Soy simplemente un tipo que ha le&iacute;do mucho y al que le gustan
los ordenadores m&aacute;s que al resto de la gente. NO SOY RESPONSABLE DE NING&Uacute;N
DA&Ntilde;O PRODUCIDO POR ACCIONES CON BASE EN ESTE DOCUMENTO. Por favor, escribo
esto para ayudar a la gente a entender el tema, no estoy preparado para
hacer depender mi vida de la exactitud de lo que hay aqu&iacute;. </P>
<P>
<SL><B>Nota del Traductor:</B> y yo menos. <BR>
(es decir, suscribo el p&aacute;rrafo anterior, excepto donde dice escribir,
que debe leerse traducir. Y donde dice experto en seguridad l&eacute;ase
traductor experto).</SL>
</P>


<H2><A NAME="ss1.3">1.3 Propiedad Intelectual</A></H2>


<P>A no ser que se indique de otra manera, los Howtos de LiNUX son propiedad
intelectual de sus respectivos autores. Los Howtos de LiNUX pueden ser
reproducidos y distribuidos en todo o en parte, por cualquier medio f&iacute;sico
o electr&oacute;nico, siempre que este anuncio de copyright se mantenga en todas
las copias. La redistribuci&oacute;n comercial est&aacute; permitida y se anima a ella. 
No obstante, al autor le gustar&iacute;a ser informado de cualquiera de tales
distribuciones. </P>
<P>Todas las traducciones, trabajos derivados, o trabajos de recopilaci&oacute;n que
incorporen cualquier Howto de LiNUX, deben estar cubiertos por este
copyright. Esto es, no se puede producir ning&uacute;n trabajo derivado de un
Howto e imponer restricciones adicionales a su distribuci&oacute;n.  Pueden ser
autorizadas excepciones a estas reglas bajo ciertas condiciones. Por
favor, contacte con el coordinador de los Howtos de LiNUX en la direcci&oacute;n
que se da m&aacute;s abajo. </P>
<P>Resumiendo, queremos promover la diseminaci&oacute;n de esta informaci&oacute;n a trav&eacute;s
de todos los cauces posibles. No obstante, deseamos mantener la propiedad
intelectual de los Howtos, y nos gustar&iacute;a ser advertidos de cualquier
proyecto de redistribuci&oacute;n de los Howtos. </P>
<P>Para cualquier pregunta, por favor, contacte con David Rudder <CODE>
<A HREF="mailto:drig@execpc.com">drig@execpc.com</A></CODE></P>


<H2><A NAME="ss1.4">1.4 Las Razones para Escribir Esto</A></H2>


<P>Hubo muchos art&iacute;culos en comp.os.linux.* a lo largo de, m&aacute;s o menos, el
a&ntilde;o pasado pidiendo ayuda sobre cortafuegos. Parec&iacute;a como si nadie fuera a
contestarlos. Supuse que la raz&oacute;n era que nadie sab&iacute;a c&oacute;mo.  As&iacute; que
dediqu&eacute; cierto tiempo a jugar con cortafuegos y a aprender.  Este
documento existe como respuesta a aquellas peticiones. </P>


<H2><A NAME="ss1.5">1.5 Por Hacer</A></H2>


<P>
<UL>
<LI>Aprender c&oacute;mo hacer esto en un Macintosh</LI>
<LI>Aprender sobre diferentes paquetes de TCP/IP para G&uuml;indous</LI>
<LI>Encontrar un buen servidor proxy de UDP que funcione con LiNUX</LI>
</UL>
</P>


<H2><A NAME="ss1.6">1.6 Lecturas de Inter&eacute;s</A></H2>


<P>
<UL>
<LI>La documentaci&oacute;n del juego de herramientas de TIS</LI>
<LI>El Howto del NET-2</LI>
<LI>PPP-Como</LI>
<LI>El Howto de la Ethernet</LI>
<LI>El MINIHowto de las M&uacute;ltiples Ethernets</LI>
<LI>Networking with LiNUX</LI>
<LI>La gu&iacute;a del administrador de red TCP/IP de O'Reilly and Associates</LI>
</UL>
</P>
<P><EM>Las herramientas para cortafuegos de TIS</EM> traen una colecci&oacute;n de
documentos que se encuentran entre los mejores que he le&iacute;do sobre
cortafuegos y asuntos relacionados. En la secci&oacute;n 
<A HREF="Cortafuegos-Como-4.html#soft">soft</A> se habla
m&aacute;s de las <I>herramientas de TIS</I>. </P>


<HR>
Anterior
<A HREF="Cortafuegos-Como-2.html">Siguiente</A>
<A HREF="Cortafuegos-Como.html#toc1">Indice</A>
</BODY>
</HTML>
