<HTML>
<HEAD>
<TITLE>Linux UUCP COMO: Introducci&oacute;n </TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="UUCP-Como-2.html">Siguiente</A>
<A HREF="UUCP-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n </A></H2>


<P>El prop&oacute;sito de este documento es contestar algunas de las cuestiones y
comentarios que m&aacute;s aparecen en las <I>Frequently Asked
Questions</I>
<SL> <I>P.U.F.</I>s, <I>Preguntas de Uso Frecuente</I></SL>
 sobre el software <CODE>UUCP</CODE> bajo Linux en general y la versi&oacute;n
en las distribuciones de Linux <I>SLS</I> y <I>Slackware</I> en particular.</P>
<P>Este documento junto con los correspondientes documentos ``HOWTO'' de Mail y
News sustituyen el <I>UUCP-NEWS-MAIL-FAQ</I> que anteriormente ha sido
publicado en <CODE>comp.os.linux.announce</CODE>.</P>

<H2><A NAME="ss1.1">1.1 Nuevas versiones de este documento </A></H2>


<P>Nuevas versiones de este documento ser&aacute;n publicadas peri&oacute;dicamente en
<CODE>comp.os.linux.announce</CODE>, <CODE>comp.answers</CODE>, y <CODE>news.answers</CODE>. 
Tambi&eacute;n se a&ntilde;aden a varios sistemas de ftp an&oacute;nimos que acogen este tipo
de informaci&oacute;n, incluyendo <CODE>
<A HREF="ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO">ftp://sunsite.unc.edu/pub/Linux/docs/HOWTO</A></CODE>. </P>
<P>Adem&aacute;s, generalmente se puede encontrar este documento en la p&aacute;gina
principal del WorldWideWeb de Linux en <CODE>
<A HREF="http://sunsite.unc.edu/mdw/linux.html">http://sunsite.unc.edu/mdw/linux.html</A></CODE>. </P>


<H2><A NAME="ss1.2">1.2 Comentarios</A></H2>


<P>Estoy interesado en cualquier comentario por correo electr&oacute;nico, positivo
o negativo, respecto a este documento. Por descontado escr&iacute;bame si
encuentra errores u omisiones obvias. </P>
<P>Leo, pero no necesariamente contesto, todo el correo que recibo. Las
peticiones para mejorar ser&aacute;n consideradas en funci&oacute;n de la combinaci&oacute;n de
tiempo disponible, el m&eacute;rito de la petici&oacute;n, y la presi&oacute;n sangu&iacute;nea que
tenga ese d&iacute;a :-) </P>
<P>No se preocupe, los insultos ir&aacute;n tranquilamente a <CODE>/dev/null</CODE>. </P>
<P>En particular, el est&aacute;ndar del sistema de directorios de Linux est&aacute; en
continua evoluci&oacute;n. Todos los ejemplos de este documento est&aacute;n basados en
el est&aacute;ndar utilizado en el momento en que esa parte del documento fue
escrita y en el sistema de directorios utilizados en las distribuciones y
<I>kits</I> que personalmente vi. Por favor consulte su particular distribuci&oacute;n
de Linux para comprobar los directorios que utiliza. </P>
<P>Los comentarios concernientes al actual formato del documento deben dirigirse
al coordinador de los <I>HOWTO</I> <BR> Greg Hankins - (<CODE>
<A HREF="mailto:gregh@sunsite.unc.edu">gregh@sunsite.unc.edu</A></CODE>).</P>


<H2><A NAME="ss1.3">1.3 Informaci&oacute;n del Copyright</A></H2>


<P>El <I>UUCP-HOWTO</I> es copyright (c)1994 de Vince Skahan.</P>
<P>Copias exactas pueden ser reproducidas o distribuidas por cualquier medio
f&iacute;sico o electr&oacute;nico sin el permiso del autor. Las traducciones son
igualmente permitidas sin el permiso expreso del autor si incluyen
informaci&oacute;n sobre qui&eacute;n hizo la traducci&oacute;n. </P>
<P>Citas cortas pueden ser utilizadas sin el consentimiento previo del autor. 
Los trabajos y distribuciones derivados del <I>UUCP-HOWTO</I> deben ser
acompa&ntilde;ados con una copia exacta de este documento o con una indicaci&oacute;n de
d&oacute;nde encontrarlo.</P>
<P>Las redistribuciones comerciales son permitidas y alentadas; no obstante,
el autor agradecer&aacute; ser notificado de cada una de las distribuciones (como
cortes&iacute;a). </P>
<P>Resumiendo, queremos promover la divulgaci&oacute;n de esta informaci&oacute;n a trav&eacute;s
de todos los medios que sea posible. Aunque deseamos conservar el
copyright de los documentos <I>HOWTO</I>.</P>
<P>Queremos que TODA la informaci&oacute;n que incorporan los <I>HOWTO</I> tenga la
m&aacute;xima divulgaci&oacute;n posible. Si tiene preguntas, por favor dir&iacute;jase a Greg
Hankins, el coordinador de los <I>HOWTO</I> de Linux, en <CODE>
<A HREF="mailto:gregh@sunsite.unc.edu">gregh@sunsite.unc.edu</A></CODE></P>


<H2><A NAME="ss1.4">1.4 Renuncia de responsabilidad.</A></H2>


<P>Por supuesto, rechazo cualquier responsabilidad potencial por el contenido
de este documento. La utilizaci&oacute;n de conceptos, ejemplos y/o otro
contenido de este documento es completamente bajo su propio riesgo. </P>


<H2><A NAME="ss1.5">1.5 Otras fuentes de informaci&oacute;n</A></H2>



<H3>Documentos HOWTO de Linux</H3>


<P>Hay cantidad de material excepcional proporcionado en otros documentos
HOWTO de Linux y en el Linux DOC project. En particular, puede querer
echar una mirada a lo siguiente: </P>
<P>
<UL>
<LI>el <I>Serial Communications HOWTO</I></LI>
<LI>el <I>Ethernet HOWTO</I></LI>
<LI>el <I>Linux Networking Administrators' Guide</I>
<SL>Disponible 
en castellano, (<I>GARL</I>) ver secci&oacute;n 
<A HREF="UUCP-Como-8.html#Grupos">Grupos</A></SL>

</LI>
</UL>
</P>

<H3>USENET</H3>


<P><CODE>comp.mail.uucp</CODE> puede responder muchas de sus preguntas sobre <CODE>UUCP</CODE>.</P>

<H3>Listas de Correo </H3>


<P>Existe una lista de correo sobre el Taylor <CODE>UUCP</CODE>.  Para inscribirse (o
borrarse) de la lista, env&iacute;e un mail a</P>
<P><CODE>
<A HREF="mailto:taylor-uucp-request@gnu.ai.mit.edu">taylor-uucp-request@gnu.ai.mit.edu</A></CODE></P>

<H3>Libros</H3>


<P>Las versiones <CODE>HDB</CODE> y <CODE>V2</CODE> de <CODE>UUCP</CODE> est&aacute;n tratadas en la
documentaci&oacute;n de cada vendedor as&iacute; como en la mayor&iacute;a de libros sobre
comunicaciones en *nix.</P>
<P>Los ficheros de configuraci&oacute;n de Taylor actualmente s&oacute;lo est&aacute;n
documentados en los ficheros de configuraci&oacute;n proporcionados con los
fuentes (y supuestamente en la distribuci&oacute;n de SLS). Para leerlos de forma
m&aacute;s ``agradable''  puede obtener el programa ``<CODE>infosrc</CODE>'' de los discos ``s''
de SLS y compilarlo. </P>
<P>Lo que sigue es un conjunto de  diferentes libros que le ayudar&aacute;n.</P>
<P>
<UL>
<LI> <I>``Managing UUCP and USENET'' </I> de <I>O'Reilly and
Associates</I> es en mi opini&oacute;n el mejor libro que hay para comprender los
programas y protocolos involucrados en las entra&ntilde;as de un servidor USENET.
</LI>
<LI> <I>``Unix Communications'' </I> de <I>The Waite Group</I> contiene
una buena descripci&oacute;n de todas las partes (y m&aacute;s), y de c&oacute;mo trabajan
juntas.
</LI>
<LI> <I>``Practical Unix Security'' </I> de <I>O'Reilly and Associates</I>
tiene una buena discusi&oacute;n de c&oacute;mo hacer seguro el <CODE>UUCP</CODE> en general.
</LI>
<LI> <I>``The Internet Complete Reference'' </I> de <I>Osborne</I> es un
cuidado libro de referencia que explica los diferentes servicios
disponibles en Internet y es una gran fuente de informaci&oacute;n sobre news,
correo, y otros recursos disponibles en Internet.
</LI>
<LI> <I>``The Linux Networking Administrators'Guide
<SL>Ver secci&oacute;n
mencionada anteriormente.</SL>
'' </I> de Olaf Kirch, del Linux Doc
Project est&aacute; disponible en la red y tambi&eacute;n publicado por (al menos)
O'Reilly y SSC. Hay gran cantidad de informaci&oacute;n para aprender sobre todo
lo que pueda imaginar que necesita conocer sobre las redes Unix.
</LI>
</UL>
</P>


<H2><A NAME="ss1.6">1.6 D&oacute;nde <B>NO</B> buscar ayuda.</A></H2>


<P>No hay nada ``especial'' sobre la configuraci&oacute;n y ejecuci&oacute;n de <CODE>UUCP</CODE>
bajo Linux.  Por consiguiente, casi seguro que <B>NO</B> necesita hacer
preguntas sobre el <CODE>UUCP</CODE> en general en los grupos de noticias
<CODE>comp.os.linux.*</CODE> .</P>
<P>A no ser que su pregunta sea realmente espec&iacute;fica de Linux (p.ej.
``<I>por favor decidme qu&eacute; fichero de configuraci&oacute;n est&aacute; soportado por los
binarios de Taylor uucp v1.04 en la SLS v1.02</I>''), seguramente deber&aacute;
dirigir sus preguntas a <CODE>comp.mail.uucp</CODE> o a la lista de correo de
Taylor <CODE>UUCP</CODE> indicada anteriormente.</P>
<P>D&eacute;jeme repetir esto. </P>
<P>Virtualmente, no existe ninguna raz&oacute;n para enviar nada referente a
<CODE>uucp</CODE> a la jerarqu&iacute;a de <CODE>comp.os.linux</CODE>. Existen grupos de noticias
en la jerarqu&iacute;a de <CODE>comp.mail.*</CODE> para dejar <B>TODAS</B> sus preguntas.</P>
<P><EM>SI ENV&Iacute;A A COMP.OS.LINUX.* CONSULTAS NO ESPEC&Iacute;FICAS DE LINUX, EST&Aacute;
BUSCANDO AYUDA EN EL LUGAR EQUIVOCADO. LOS EXPERTOS SOBRE UUCP SE MUEVEN
EN LOS GRUPOS INDICADOS ANTERIORMENTE Y GENERALMENTE NO UTILIZAN LINUX. </EM></P>
<P><EM>ENVIAR A LA JERARQU&Iacute;A DE LINUX CONSULTAS NO ESPEC&Iacute;FICAS DE LINUX MALGASTA
SU TIEMPO Y EL DE TODOS LOS DEM&Aacute;S Y NORMALMENTE RETRASA LA OBTENCI&Oacute;N DE SU
RESPUESTA. </EM></P>


<HR>
Anterior
<A HREF="UUCP-Como-2.html">Siguiente</A>
<A HREF="UUCP-Como.html#toc1">Indice</A>
</BODY>
</HTML>
