<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 2.0 Level 2//EN">

<html>
  <head>
    <title>FAQ de CervanTeX</title>
  </head>
  <body>
    <h1>FAQ de CervanTeX</h1>
    Esta es la lista de preguntas y respuestas frecuentes del grupo de usuarios hispanoparlantes de TeX/LaTeX CervanTeX. Est&aacute; basada en las preguntas que se repiten con frecuencia en los distintos foros y en algunas contribuciones adicionales interesantes. Aunque todas ellas son preguntas razonables, especialmente para un ne&oacute;fito, resulta un poco repetitivo verlas aparecer continuamente en los distintos foros de discusi&oacute;n sobre TeX/LaTeX. Por esta raz&oacute;n se han intentado reunir en esta FAQ. Se ruega echarla un vistazo antes de preguntar en la lista de correo o en el grupo de noticias cosas que ya se han preguntado y respondido m&uacute;ltiples veces y que est&aacute;n en esta FAQ. 
    <p>
    Para que nadie se crea discriminado, esta FAQ se ofrece en una amplia variedad de formatos:
    <p>
    <ul>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.html">La versi&oacute;n HTML de la FAQ</a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.sgml"> El original de la FAQ en formato SGML</a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.tex">La versi&oacute;n tex de la FAQ</a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.dvi">La versi&oacute;n dvi de la FAQ</a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.ps">La versi&oacute;n postscript de la FAQ</a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.pdf">La versi&oacute;n pdf de la FAQ</a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.txt">La versi&oacute;n texto de la FAQ</a> en latin1 con c&oacute;digos de control para negritas y similares. S&oacute;lo para dispositivos que lo soportan</li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.latin1">La versi&oacute;n texto de la FAQ para una p&aacute;gina de c&oacute;digos <tt>latin1</tt></a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.applemac">La versi&oacute;n texto de la FAQ para una p&aacute;gina de c&oacute;digos <tt>applemac</tt></a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.cp850">La versi&oacute;n texto de la FAQ para una p&aacute;gina de c&oacute;digos <tt>cp850</tt></a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.cp437">La versi&oacute;n texto de la FAQ para una p&aacute;gina de c&oacute;digos <tt>cp437</tt></a></li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.ms-ansi">La versi&oacute;n texto de la FAQ para una p&aacute;gina de c&oacute;digos <tt>ansinew</tt></a> Pr&aacute;cticamente similar a latin1, pero con el toque de incompatibilidad de la casa y los retornos de carro ajustados</li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.lyx">La versi&oacute;n de la FAQ para lyx</a>. esta conversi&oacute;n funciona bastante mal y est&aacute; incompleta.</li>
      <li><a HREF="FAQ-CervanTeX/FAQ-CervanTeX.rtf">La versi&oacute;n de la FAQ en rtf</a>(rich text format). Necesita tambi&eacute;n <a HREF="FAQ-CervanTeX/FAQ-CervanTeX-0.rtf">este archivo</a></li>
    </ul>
Para m&aacute;s informaci&oacute;n acerca del grupo de usuarios hispanohablantes, existe <a HREF="http://apolo.us.es/CervanTeX/"> esta p&aacute;gina web</a>.
  </body>
</html>

