<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.02b7 [en] (X11; I; Linux 2.0.29 i586) [Netscape]">
</HEAD>
<BODY>
<FONT SIZE=+2><B>ZOMBIS</B></FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>PREG></FONT>
<BR><FONT SIZE=+2>Bueno la pregunta es est&aacute;, como mato un proceso
zombi son necesarios, valen para algo.</FONT>
<BR><FONT SIZE=+2>Es que tengo uno aqui que no se deja ni con el noveno
grado. kill -9 16340</FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>RESP></FONT>
<BR><FONT SIZE=+2>En Unix, cuando un proceso acaba, deja cierta informaci&oacute;n
en el sistema, para que el proceso que lo cre&oacute;, pueda recuperar
informaci&oacute;n sobre de que forma muri&oacute;. Esto es el estado zombie
de un proceso. Cuando dicha informaci&oacute;n se recupera, el proceso
deja el estado zombie y desaparece definitivamente del sistema. Normalmente
no deber&iacute;as encontrarte procesos zombies permanentes, por lo que
si aparecen, se deben a anomal&iacute;as y no hay problema en eliminarlos.
Ademas aunque los elimines ten en cuenta que lo &uacute;nico que haces
es impedir que el proceso que lo creo pueda recuperar el estado en que
muri&oacute;, esta informaci&oacute;n normalmente es importante para poder
indicar con m&aacute;s precisi&oacute;n la causa por la que se ha producido
un error en los mensajes de error de toda buena aplicaci&oacute;n, es decir
no es demasiado importante para nosotros. La raz&oacute;n por la que no
puedes eliminarlo quiza sea que dicho proceso lo intentes eliminar con
un usuario que no es el mismo que el que lo creo. Entra como root en el
sistema y eliminalo con la misma orden. Existe otra raz&oacute;n por la
cual un proceso que recibe un kill -9 no termine inmediatamente. El proceso
antes de terminar debe cerrar los ficheros que mantiene abiertos. Supongamos
que cerrar un fichero supone rebobinar totalmente una cinta. En este caso
el proceso esperara a que la cinta termine de rebobinar. Esto ocurre en
el kernel. Concretamente en el driver de cinta. Aun asi si no hay fallos
en el driver el dispositivo terminar&aacute; cerrando y el proceso morir&aacute;.&nbsp;
Si un proceso zombie no puede ser eliminado con kill -9 y no responde a
alguna de las causas anteriores convendr&iacute;a investigar o probar a
subir la versi&oacute;n del kernel por si se tratara de alg&uacute;n driver
defectuoso.</FONT><FONT SIZE=+2></FONT>

<P><FONT SIZE=+2>&nbsp;<A HREF="admin.htm">Vuelta al Indice de Faq Admin</A></FONT>
<BR><FONT SIZE=+2></FONT>&nbsp;
</BODY>
</HTML>
