<HTML>
<HEAD>
<TITLE>NIS(YP)/NIS+/NYS COMO: Introducci&oacute;n</TITLE>
</HEAD>
<BODY>
<A HREF="Nis-Como-1.html">Anterior</A>
<A HREF="Nis-Como-3.html">Siguiente</A>
<A HREF="Nis-Como.html#toc2">Indice</A>
<HR>
<H2><A NAME="s2">2. Introducci&oacute;n</A></H2>

<P>Cada vez m&aacute;s y m&aacute;s m&aacute;quinas Linux est&aacute;n siendo instaladas como parte de una 
red de computadoras. Para simplificar la administraci&oacute;n de la red, la 
mayor parte de las redes (sobre todo, redes basadas en m&aacute;quinas Sun) 
ejecutan el <I>Network Information Service</I>. Las m&aacute;quinas Linux pueden sacar
gran partido a los servicios NIS existentes o proveer servicio NIS por s&iacute; 
mismas. Pueden incluso (con la librer&iacute;a NYS) actuar como un cliente NIS+ 
limitado.</P>
<P>Este documento intenta responder cuestiones sobre la configuraci&oacute;n de 
NIS(YP) en tu m&aacute;quina Linux. No habla sobre c&oacute;mo configurar NIS+. No 
olvides leer la secci&oacute;n 
<A HREF="Nis-Como-5.html#puertosrpc">puertosrpc</A></P>



<H2><A NAME="ss2.1">2.1 Nuevas Versiones de Este Documento (En ingl&eacute;s)</A></H2>


<P>Nuevas versiones de este documento ser&aacute;n enviadas peri&oacute;dicamente 
(aproximadamente, cada mes) a los newsgroups <CODE>comp.os.linux.announce</CODE> y 
<CODE>comp.os.linux.misc</CODE>. Este documento se encuentra archivado en varios 
FTP 
sites, incluyendo <CODE>sunsite.unc.edu</CODE> en el directorio 
<CODE>/pub/Linux/docs/HOWTO</CODE>.</P>



<H2><A NAME="ss2.2">2.2 Nota de Renuncia</A></H2>


<P>Aunque este documento ha sido recogido con lo mejor de nuestros 
conocimientos, puede contener, y probablemente contendr&aacute;, errores. Por 
favor, l&eacute;ete todos los ficheros <CODE>README</CODE> adjuntos a cualquiera de los 
varios paquetes de software descritos en este documento para obtener una 
informaci&oacute;n m&aacute;s detallada y precisa. Nosotros intentaremos mantener este 
documento tan libre de errores como sea posible.</P>



<H2><A NAME="ss2.3">2.3 FeedBack</A></H2>

<P>Si tienes alg&uacute;n comentario, preguntas o sugerencias, por favor, 
envi&aacute;melas por e-mail a <CODE>Erwin Embsen &lt;erwin@nioz.nl></CODE>. Y si 
encuentras errores u omisiones obvias, definitivamente debes contactar 
con &eacute;l
<SL>Aunque me temo que no sabe castellano, as&iacute; que cu&eacute;ntale lo 
que sea en ingl&eacute;s...</SL>
. </P>



<H2><A NAME="ss2.4">2.4 Agradecimientos</A></H2>


<P>Nos gustar&iacute;a agradecer a toda la gente que ha contribuido (directa o 
indirectamente) a la realizaci&oacute;n de este documento. En orden alfab&eacute;tico:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
Andrea Dell'Amico &lt;adellam@di.unipi.it&gt;
Mitchum DSouza    &lt;Mitch.Dsouza@Dubai.Sun.COM&gt;
Erwin Embsen      &lt;erwin@nioz.nl&gt;
Byron A Jeff      &lt;byron@cc.gatech.edu&gt;
Peter Eriksson    &lt;pen@lysator.liu.se&gt;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Theo de Raadt <CODE>&lt;deraadt@fsa.ca></CODE> es responsable del c&oacute;digo original 
de 
los yp-clients. Swen Thuemmler <CODE>&lt;swen@uni-paderborn.de></CODE> port&oacute; el 
c&oacute;digo de los yp-clients y de las yp-routines en la libc (de nuevo, 
bas&aacute;ndose en el trabajo de Theo).</P>



<HR>
<A HREF="Nis-Como-1.html">Anterior</A>
<A HREF="Nis-Como-3.html">Siguiente</A>
<A HREF="Nis-Como.html#toc2">Indice</A>
</BODY>
</HTML>
