<HTML>
<HEAD>
<TITLE>NIS(YP)/NIS+/NYS COMO: Glosario</TITLE>
</HEAD>
<BODY>
Anterior
<A HREF="Nis-Como-2.html">Siguiente</A>
<A HREF="Nis-Como.html#toc1">Indice</A>
<HR>
<H2><A NAME="s1">1. Glosario</A></H2>

<P>En este documento se han usado muchos acr&oacute;nimos. Aqu&iacute; se listan los m&aacute;s 
importantes junto a una breve explicaci&oacute;n:</P>
<P>
<DL>
<DT><B>DBM</B><DD><P><I>DataBase Management</I>, una librer&iacute;a de funciones que mantiene 
pares clave-contenido en una base de datos.</P>

<DT><B>DLL</B><DD><P><I>Dynamically Linked Library</I>, una librer&iacute;a enlazada a un programa 
ejecutable en tiempo de ejecuci&oacute;n.</P>

<DT><B>domainname</B><DD><P>Un nombre "clave" que es usado por clientes NIS para ser 
capaces de localizar un servidor NIS adecuado que sirve a esa clave 
domainname. Notar que esto no tiene nada que ver necesariamente con el 
"dominio" (nombre de m&aacute;quina) DNS de la(s) m&aacute;quina(s).</P>

<DT><B>FTP</B><DD><P><I>File Transfer Protocol</I>, un protocolo usado para transferir 
ficheros entre dos ordenadores.</P>

<DT><B>libnsl</B><DD><P><I>Name services library</I>, una librer&iacute;a de llamadas a servicios
de nombres (<CODE>getpwnam, getservbyname,</CODE> etc...) en Unixes SVR4.</P>

<DT><B>libsocket</B><DD><P><I>Socket services library</I>, una librer&iacute;a para llamadas a 
servicios de sockets (<CODE>socket, bind, listen,</CODE> etc...) en Unixes SVR4.</P>

<DT><B>NIS</B><DD><P><I>Network Information Service</I>, un servicio que proporciona 
informaci&oacute;n, que tiene que ser conocida por toda la red, a todas las 
m&aacute;quinas de la red. Hay soporte para NIS en la librer&iacute;a est&aacute;ndar de 
Linux <CODE>libc</CODE>, y a la que en el texto nos referiremos como 
"NIS tradicional".</P>

<DT><B>NIS+</B><DD><P><I>Network Information Service</I> (Plus :-), es esencialmente un NIS con 
``esteroides''. NIS+ fue dise&ntilde;ado por <I>Sun Microsystems Inc.</I> como 
un 
sustituto de NIS, con una mejor seguridad y un mejor manejo de 
_grandes_ instalaciones.</P>

<DT><B>NYS</B><DD><P>Este es el nombre de un proyecto que viene de NIS+,YP y Switch y 
que est&aacute; organizado por Peter Eriksson <CODE>&lt;pen@lysator.liu.se></CODE>. 
Contiene, 
entre otras cosas, una completa reimplementaci&oacute;n del c&oacute;digo del NIS (=YP) 
usando la funcionalidad del <I>Name Services Switch</I> de la librer&iacute;a NYS.</P>

<DT><B>RPC</B><DD><P><I>Remote Procedure Call</I>. Las rutinas RPC permiten a los programas 
en C realizar llamadas a procedimientos en otras m&aacute;quinas a trav&eacute;s 
de la red. Cuando la gente habla de RPC, normalmente se refiere 
a la variante SunRPC.</P>

<DT><B>YP</B><DD><P><I>Yellow Pages(tm)</I>, P&aacute;ginas Amarillas en Ingl&eacute;s, es una marca registrada 
en el Reino Unido por la <I>British Telecom plc.</I> (la telef&oacute;nica 
inglesa, vamos).</P>

<DT><B>TCP-IP</B><DD><P><I>Transmission Control Protocol/Internet Protocol</I>. Es un 
protocolo de comunicaci&oacute;n de datos usado a menudo en m&aacute;quinas Unix.</P>
</DL>
</P>


<H2><A NAME="ss1.1">1.1 Algo de Informaci&oacute;n General</A></H2>

<P>Las siguientes l&iacute;neas est&aacute;n sacadas del <I>Sun(tm) System &amp; Network 
Administration Manual</I>:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
    &quot;NIS se llamaba en un principio Sun Yellow Pages (YP)
     pero el nombre Yellow Pages(tm) es una marca registrada
     en el Reino Unido por la British Telecom plc y no 
     puede ser usado sin permiso.&quot;
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>NIS viene de <I>Network Information Service</I>. Su prop&oacute;sito es proveer 
informaci&oacute;n, que tiene que ser conocida a lo largo de la red, a todas las 
m&aacute;quinas de la red. La informaci&oacute;n m&aacute;s indicada para ser distribuida por 
NIS es:</P>
<P>
<UL>
<LI>nombres de login/passwords/directorios home (<CODE>/etc/passwd</CODE>)</LI>
<LI>informaci&oacute;n de grupos (<CODE>/etc/group</CODE>)</LI>
</UL>
</P>
<P>As&iacute; que, por ejemplo, si la entrada de tu password est&aacute; grabada en la base 
de datos <CODE>passwd</CODE> de NIS, ser&aacute;s capaz de entrar en todas las m&aacute;quinas de la 
red que tengan corriendo los programas clientes NIS.</P>
<P>Sun es una marca registrada de <I>Sun Microsystems, Inc.</I> licenciada a 
<I>SunSoft, Inc.</I></P>



<HR>
Anterior
<A HREF="Nis-Como-2.html">Siguiente</A>
<A HREF="Nis-Como.html#toc1">Indice</A>
</BODY>
</HTML>
