<HTML>
<HEAD>
<TITLE>Accesibilidad COMO: Temas generales de programaci&oacute;n</TITLE>
</HEAD>
<BODY>
<A HREF="Accesibilidad-Como-5.html">Anterior</A>
<A HREF="Accesibilidad-Como-7.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc6">Indice</A>
<HR>
<H2><A NAME="s6">6. Temas generales de programaci&oacute;n</A></H2>


<P>La mayor&iacute;a de los puntos que merecen tener en cuenta son los mismos cuando
se escribe software dise&ntilde;ado para ser de utilidad para la accesibilidad
que cuando se intenta seguir un buen dise&ntilde;o. </P>

<H2><A NAME="ss6.1">6.1 Intente proporcionar m&uacute;ltiples interfaces</A></H2>


<P>Si su software es utilizable s&oacute;lo mediante una interfaz gr&aacute;fica, puede
llegar a ser muy dif&iacute;cil usarlo por alguien que no ve. Si es utilizable
s&oacute;lo mediante l&iacute;nea de comando, alguien que no pueda teclear tendr&aacute; muchos
problemas. </P>
<P>Proporcione atajos de teclado as&iacute; como el uso del puntero X normal
(generalmente el rat&oacute;n). Entonces puede estar casi seguro de que los
usuarios podr&aacute;n generar pulsaciones de teclado de un modo u otro. </P>


<H2><A NAME="ss6.2">6.2 Haga el software configurable.</A></H2>


<P>Si es sencillo cambiar las fuentes, entonces las personas podr&aacute;n
cambiarlas a una que puedan leer. Si se puede cambiar el esquema de
colores, ser&aacute; m&aacute;s probable que la gente que tenga problemas para
distinguirlos pueda usarlo. Si se pueden cambiar las fuentes f&aacute;cilmente,
entonces los personas con discapacidades visuales encontrar&aacute;n su software
m&aacute;s &uacute;til. </P>


<H2><A NAME="ss6.3">6.3 Pruebe el software con los usuarios</A></H2>


<P>Si un cierto n&uacute;mero de personas cada una con diferentes tipos de problemas
de accesibilidad prueban su software, ser&aacute; m&aacute;s f&aacute;cil se&ntilde;alar fallos
espec&iacute;ficos. Obviamente, esto no ser&aacute; pr&aacute;ctico para todo el mundo, pero
siempre puede valer como indicaci&oacute;n. </P>


<H2><A NAME="ss6.4">6.4 Diferencie la salida</A></H2>


<P>En la medida de lo posible, haga que cada parte del programa sea
claramente identificable. D&eacute; un formato espec&iacute;fico a los mensajes de error
para poder identificarlos. Bajo X, aseg&uacute;rese de que cada parte de su
ventana tenga un nombre de forma que cualquier software lector de pantalla
pueda identificarlo. </P>


<H2><A NAME="ss6.5">6.5 Licencias</A></H2>


<P>Parte del software para Linux (aunque ninguno de los programas clave) 
tiene licencia del tipo 'no para uso comercial'. Esto puede ser bastante
malo para una persona que comienza a utilizar el software para uso
personal, y entonces empieza a ser capaz de realizar un trabajo que de
otro modo no podr&iacute;a. Esto podr&iacute;a posibilitarle una liberaci&oacute;n sobre las
dependencias econ&oacute;micas y de otros tipos que tiene respecto a otras
personas. Incluso si el autor del software es favorable a hacer
excepciones, esto hace al usuario vulnerable tanto a cambios en las
condiciones comerciales (que alguna compa&ntilde;&iacute;a compre los derechos) como al
rechazo de la gente para la que pudiera trabajar (algunas compa&ntilde;&iacute;as son
demasiado paranoicas en lo que se refiere a las licencias). Es mucho mejor
evitar este tipo de licencias en la medida de lo posible. Se puede obtener
protecci&oacute;n frente a un abuso comercial mediante licencias m&aacute;s espec&iacute;ficas
como la Licencia P&uacute;blica de GNU, o la Licencia Art&iacute;stica. </P>


<HR>
<A HREF="Accesibilidad-Como-5.html">Anterior</A>
<A HREF="Accesibilidad-Como-7.html">Siguiente</A>
<A HREF="Accesibilidad-Como.html#toc6">Indice</A>
</BODY>
</HTML>
