<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_1.8">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Software Development">
 <TITLE>Software Development : REBOL el rebelde</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/Georges-Tarbouriech.jpg" ALT="[Photo of the Author]" HEIGHT=147 WIDTH=126>
<BR>por  <A HREF="mailto:georges.t@linuxfocus.org">Georges Tarbouriech</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Georges es un usuario viejo de Unix (comercial y libre). Es un "fan" de
Rebol desde su aparici&oacute;n. Si leen Franc&eacute;s pueden echar un vistazo al primer
art&iacute;culo que escribi&oacute; sobre Rebol hace unos dos a&ntilde;os yendo a
<a href="http://www.amiganews.com/ANN/no117/rebol.shtml">http://www.amiganews.com/ANN/no117/rebol.shtml</a></P>
<P><FONT COLOR="#336633">Contenidos</FONT>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Presentaci&oacute;n</A></LI>
  <LI><A HREF="#lfindex2">Rebol/Core</A></LI>
  <LI><A HREF="#lfindex3">Rebol/View</A></LI>
  <LI><A HREF="#lfindex4">Futuro</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=169&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>REBOL el rebelde</H2>
 <IMG SRC="../../common/images/article169/rebol_small.gif" ALT="[Illustration]" HSPACE=10 HEIGHT=31 WIDTH=256><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
<P>
Podr&iacute;amos decir que REBOL es un lenguage de mensajer&iacute;a, aunque es mucho
m&aacute;s. En cualquier caso, est&aacute; particularmente preparado para las comunicaciones
e internet. REBOL significa Relative Expression-Based Object Language.
Desde http://www.rebol.com pueden descargar la &uacute;ltima versi&oacute;n (2.3) de
Rebol/Core para unas 40 plataformas.  Rebol tambi&eacute;n est&aacute; disponible en algunas
distribuciones de Linux, pero con versiones m&aacute;s antiguas.
Una de las novedades se llama Rebol/View del que pueden bajar una versi&oacute;n beta
con el n&uacute;mero 0.9.
<BR>
Esta es una de las grandes mejoras de Rebol. En este art&iacute;culo,
trataremos de analizar brevemente las numerosas caracter&iacute;sticas de Rebol.
</p></P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

<p>
La idea detr&aacute;s de Rebol era crear un lenguage sencillo semejante a
lenguages humanos, como una especie de dialecto.
Carl Sassenrath, el fundador de
Rebol es algui&eacute;n muy conocido en el mundo de la inform&aacute;tica dado que ha
trabajado para Apple, Commodore, HP... La comunidad Amiga, por ejemplo, le
debe mucho.
¿Por qu&eacute; hablar del Amiga? Porque la principal caracter&iacute;stica
del AmigaSO es la compacidad.
La &uacute;ltima versi&oacute;n del SO (3.5), pesa menos de 20 Mb. Esto puede
parecer extra&ntilde;o a los reci&eacute;n llegados, que han empezado a trabajar con
SO (o algo as&iacute;) que pesan entre 200 y 600 Mb.
</p>

<p>
Eso para explicar que la gente ha olvidado los tama&ntilde;os cuando
se trata del desarrollo. Las herramientas disponibles son muy numerosas y
los lenguages de script muy &uacute;tiles. Sin embargo, implican muy a menudo muchas
lineas de c&oacute;digo, para cualquier cosa que se quiera hacer con ellos.
Normalmente, estos lenguages se utilizan para tareas espec&iacute;ficas. Por
ejemplo, Perl o Rexx son muy apreciados por los administradores de sistemas.
Claro que se puede hacer mucho m&aacute;s que administraci&oacute;n de redes
con lenguages como Perl pero, hablando de versatilidad o compacidad, Rebol
es un modelo.
Podr&iacute;amos decir que pueden hacer todo con Rebol. Las limitaciones no
vienen del lenguage sino de la imaginaci&oacute;n del usuario.
</p>

<p>
Hagamos una breva visita.
</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>Presentaci&oacute;n</H2>


<p>
Como hemos mencionado antes, Rebol est&aacute; disponible para unas 40 plataformas,
en lo que respecta a Rebol/Core, el programa principal. Rebol/Core es una
herramienta capaz de desarrollar cualquier tipo de applicaci&oacute;n, aunque su
&aacute;rea de mayor dominio sea internet.
Con Rebol/Core se pueden manejar comunicaciones web, ftp, email
y scripts cgi. Pueden manipular texto, html... Pero tambi&eacute;n pueden escribir
mandos de sistemas o programas mucho m&aacute;s sofisticados. 
</p>

<p>
La versi&oacute;n actual es la 2.3 y pesa alrededor de los 350/400 Kb
(descomprimida) seg&uacute;n la plataforma. Consta de un ejecutable
y dos ficheros de configuraci&oacute;n: rebol.r and user.r. El &uacute;ltimo no
existe cuando se baja el arca, sino que ser&aacute; creado al primer arranque.
Y no hay que decir respecto a la instalaci&oacute;n, puesto que s&oacute;lo
tienen que poner estos ficheros en un directorio llamado rebol (por
ejemplo) y copiarlo a donde quieran.
Aunque, normalmente, tendr&aacute;n que definir una variable de entorno para
localizar el directorio que acaban de crear. 
En el arca encontrar&aacute;n m&aacute;s ficheros: dos scripts y dos documentos html.
Uno de los scripts puede ser utilizado para el feedback (de ah&iacute; su nombre)
y el otro, llamado rebdoc.r sirve para generar la documentaci&oacute;n
(palabras clave) en html. Los dos ficheros html contienen informaciones de
instalaci&oacute;n y notas. Hay m&aacute;s documentaci&oacute;n disponible en el
site de Rebol.
</p>

<p>
Despu&eacute;s, ya pueden descargar Rebol/View. Brevemente, podemos decir que es el 
interf&aacute;z gr&aacute;fico de Rebol. Mas tarde vermos que es
¡MUCHO MAS! En el momento de &eacute;ste art&iacute;culo, Rebol/View est&aacute; disponible
solamente para Amiga, FreeBSD, Linux y las cosas de Microsoft. Las versiones
BeOS R5, Irix, HP-UX, AIX y Solaris Sparc tendr&iacute;an que aparecer muy
pronto. Rebol/View es un simple ejecutable poco m&aacute;s o menos del mismo
tama&ntilde; que Rebol/Core. Podemos a&ntilde;adir que es una versi&oacute;n
beta (0.9.9 release 4.1). Pueden ponerlo a donde quieren y al primer arranque
pedir&aacute; algunos par&aacute;metros de red. Ya hay documentaci&oacute;n adicional
y una FAQ est&aacute;n disponibles en el site de Rebol.
</p>

<p>
A t&iacute;tulo informativo, existen otros dos productos: Rebol/Command y
Rebol/Apache.
Rebol/Command aparecer&aacute; muy pronto y ser&aacute; un producto comercial
dedicado al acceso de DLL, applicaciones y base de datos.
Rebol/Apache ser&aacute; un modulo de plug-in para Apache.
</p>

<p>
Y ahora, ¿qu&eacute; podemos hacer con eso?
</p>

<A NAME="lfindex2">&nbsp;</A>
<H2>Rebol/Core</H2>


<p>
Para descubrir Rebol (o no!), lo mejor es bajar los ejemplos. Son alrededor de
200! Para arrancar un script, depende de la m&aacute;quina. Bajo SO con shell 
(o que pareacan tener shell...) entran algo como "rebol test.r". El sufijo .r
indica un script Rebol. Para probar, tambi&eacute;n pueden escribir "do %test.r".
Bajo SO sin shell, tal como MacOS (excepto MacOS X, claro!) basta con soltar el
icono del script en el icono del ejecutable Rebol. ¡Eso es todo!. Y funciona
tambi&eacute;n en las cosas de Microsoft, por ejemplo.
</p>

<p>
Y ahora, ¡entramos en el coraz&oacute;n de la bestia!
</p>

<p>
Aqu&iacute; est&aacute; un script Rebol de los ejemplos llamado mailsend.r.
<strong><pre>
REBOL [
    Title: "Email Message Sender"  File: %mailsend.r
    Date:  10-Sep-1999
    Purpose: {A very simple way to send an email.}
    Note:{The TRIM function below is used to remove the blank
    lines from the head of the email, so that the first
    line of text gets used as the subject.}
    Category: [email net 1] 
]
send luke@rebol.com trim {
Hi there.
Just wanted to send you an email message from REBOL.
-Friend
}
</pre></strong>
</p>

<p>
De hecho, ¡s&oacute;lo hay UNA linea de c&oacute;digo! Todo lo que
se encuentra desde el primer REBOL hasta el cierre "]" puede ser
considerado como un "header", aunque tenga que figurar en cada script Rebol.
La &uacute;ltima parte es el contenido del mensaje y entre ambas partes est&aacute;
el c&oacute;digo Rebol:
<br>
"send luke@rebol.com trim"
<br>
Lo que significa puede ser leido en la parte "note" del "header", y basta con
eso para mandar un mail si la m&aacute;quina est&aacute; correctamente
configurada. Si conocen un medio para hacerlo m&aacute;s corto, ¡avisenos!
</p>

<p>
Los scripts Rebol son interpretados y se comunican por puertos (un poco como lo
hace Rexx) y, puesto que son de tama&ntilde;o muy peque&ntilde;o resulta que
son muy rapidos, lo que no es una sorpresa para los que conocen Rebol desde
sus comienzos. Sin embargo, a partir de la versi&oacute;n 2, tiene m&aacute;s
funcionalidades... Basta con echar un vistazo a los ejemplos para notar las
mejoras. Todo lo relacionado con comunicaciones ftp, web, mail, etc. puede
ser realizado muy f&aacute;cilmente con Rebol. Con unas l&iacute;neas de c&oacute;digo
pueden bajar ficheros desde un servidor ftp, recuperar una p&aacute;gina web
en cualquier sitio. Y tambi&eacute;n manipular texto, html... ¡Un ejemplo de 2083
bytes ense&ntilde;a c&oacute;mo convertir texto en html!
</p>

<p>
Los scripts cgi tambi&eacute;n se pueden manejar. Por ejemplo, es posible crear un
formulario cgi y el formulario html asociado. Otra funcionalidad permite
insertar un script Rebol en una p&aacute;gina html con una baliza "script".
Desafortunadamente, muy pocos navegadores parecen capaces de manejar
correctamente &eacute;sta baliza. Una soluci&oacute;n es de utilizar Rebol como
cgi para crear contenido din&aacute;mico. ¡Un sorprendente ejemplo de 
1827 bytes crea un servidor web! Y para los que no pueden vivir sin tel&eacute;fono
celular, hay un script que permite mandar mensajes a un tel&eacute;fono GSM...
</p>

<p>
Con Rebol es posible encriptar, comprimir o descomprimir ficheros. Incluso,
pueden autoextractar estos ficheros comprimidos. Den un vistazo a los scripts
autoextract.r y encrypt.r. Como pueden ver, &eacute;stos ejemplos son una mina de oro.
Estudienlos y no echar&aacute;n de menos el tiempo empleado (aparte de que es
imposible mencionarlos todos en &eacute;ste art&iacute;culo).
</p>

<p>
Podemos decir que Rebol es estupendo. Rebol/Core es una muy buena
evoluci&oacute;n, que justifica el cambio a la nueva versi&oacute;n ... o el
empezar con ella. Respecto a Rebol/View, no podemos hablar de evoluci&oacute;n:
es una REVOLUCION! (o, porqu&eacute; no, una reBoluci&oacute;n).
</p> 

<A NAME="lfindex3">&nbsp;</A>
<H2>Rebol/View</H2>


<p>
Aquellos que no conozcan Rebol/View tendr&iacute;an que sentarse y relajarse.
Rebol/View tiene las mismas funcionalidades que Rebol/Core... y m&aacute;s
mucho m&aacute;s. Tan s&oacute;lo una palabra para resumir: ¡INCREIBLE!
Empezamos con un ejemplo y aqu&iacute;  est&aacute; un script llamado lftest.r.
<strong><pre>
REBOL [
    Title: "New way to access LF languages"
    File: %lftest.r
    Date: 28-Jul-2000
    Purpose: {Shows how easy to create buttons.}
    Category: [view VID 1]
]
view layout [
    title "LF the multilingual magazine"
    across
    button "English" button "Fran&ccedil;ais" button "Castellano" return
    button "Deutsch" button "Nederlands" button "Italiano"
]
</pre></strong>
Aqu&iacute; tienen el resultado, que pord&iacute;a ser la nueva forma de elegir
los idiomas en Linux<font color="red">Focus</font>...
<br>
<IMG SRC="../../common/images/article169/lftest.jpg" ALT="lftest.jpg" ALIGN=TEXTTOP></A></TD>
</p>

<p>
Sigamos. Un script de 1413 bytes crea un editor de texto gr&aacute;fico.
¿No lo creen? Bueno, aqu&iacute; lo tienen:
<br>
<a href="../../common/images/article169/textedth.jpg">
<IMG SRC="../../common/images/article169/textedth.jpg" ALT="texted.jpg" ALIGN=TEXTTOP></A></TD>
<br>
Con <a href="../../common/src/article169/text-edit.r">TODO
EL SCRIPT</a> adentro 
</p>

<p>
Quieren m&aacute;s? El script <a href="../../common/src/article169/image-sort.r">image-sort.r</a>
 crea una herramienta para visualizar y clasificar imagenes: pesa 3443 bytes! Miren: 
<br>
<a href="../../common/images/article169/imedth.jpg">
<IMG SRC="../../common/images/article169/imedth.jpg" ALT="imed.jpg" ALIGN=TEXTTOP></A></TD>
<br>
Imagen ofrecida por cortes&iacute;a de NeXTstep(TM).
</p>

<p>
Hasta ahora, s&oacute;lo hemos visto la incre&iacute;ble compacidad del
c&oacute;digo y las grandes funcionalidades de Rebol/View. Una pregunta
podr&iacute;a ser "¿pueden hacer eso con otro lenguage con tan pocas
lineas de c&oacute;digo?" y a&uacute;n m&aacute;s, sin necesitar del uso de
una tortuga con frenos para compilarlo... (saben, &eacute;sa cosa llamada JIT!).
No se enfaden, es broma... (bueno, no lo es, pero es mi opini&oacute;n... ¡y la
comparto!). De todos modos, como dice mi compadre ATif: TIMTOWDI (there
is more than one way to do it, es decir hay m&aacute;s de una manera de
hacerlo). Claro que su lengua materna es perl. Y ahora, Se&ntilde;oras y
Se&ntilde;ores, algo totalmente differente.
</p>

<p>
Durante los a&ntilde;os 80, nos conect&aacute;bamos a los BBS con herramientas
m&aacute;s o menos avanzadas seg&uacute;n los SO. Los a&ntilde;os 90 nos han
proporcionado los navegadores. Los navegadores graficos se han puesto m&aacute;s y
m&aacute;s gordos y ahora se han vuelto "f&aacute;bricas" (por lo menos, los
m&aacute;s conocidos). Los sites web usan m&aacute;s y m&aacute;s Java
(perd&oacute;n, lo siento!) y navegar en el web a veces se transforma en una
pesadilla, incluso con conexiones r&aacute;pidas. Depende de la m&aacute;quina
de la conexi&oacute;n, pero tambi&eacute;n del navegador. Aqu&iacute; llega la manera
de navegar en el web en el siglo XXI... ¡o el Reb! Rebol/View permite navegar
en el reb ¡sin navegador!. Con Rebol/View pueden conectar a alg&uacute;n site
y hacer lo que har&iacute;n con un navegador: bajar ficheros, navegar en el
sites, poner al d&iacute;a software... Adem&aacute;s, no tienen problemas porque el
navegador no aguanta tal versi&oacute;n de tal producto, o ,a&uacute;n peor,
porque el site no aguanta tal SO! De todos modo, un ejemplo vale m&aacute;s
que un discurso.
</p>

<p>
<IMG SRC="../../common/images/article169/connex.jpg" ALT="connex.jpg" ALIGN=TEXTTOP></A></TD>
<br>
Es una conexi&oacute;n de verdad. Pueden probarlo... conectando a los sites Reb 
con Rebol/View. Otro ejemplo, el que sigue es el indice de Linux<font color="red">Focus</font> del
n&uacute;mero de Julio. El script pesa 2197 bytes y funciona. Es decir,
pinchando un bot&oacute;n les lleva al art&iacute;culo correspondiente... pero
abriendo el navegador. 
<br>
<a href="../../common/images/article169/lfissue.jpg"><IMG
SRC="../../common/images/article169/lfissueth.jpg" ALT="lfissue.jpg" ALIGN=TEXTTOP></A></TD>
<br>
Ser&iacute;a un poco m&aacute;s largo para poder leer los art&iacute;culos en 
Rebol/View. aunque aqu&iacute; tienen la
<a href="../../common/src/article169/lfissue.txt">fuente</a> por si acaso
quieren probar el ejemplo. Si visitan los sites Reb con Rebol/View pueden
bajar el c&oacute;digo de cada ejemplo. Eso ense&ntilde; c&oacute;mo funciona.
</p>

<p>
Otro lugar para encontrar informaci&oacute;n, es el directorio public creado
por Rebol. Cada conexi&oacute;n crea un subdirectorio llamado como la URL.
Desde &eacute;ste subdirectorio pueden obtener c&oacute;digo fuente, imagenes...
Claro que hay mucho que decir de esta herramienta y necesitar&iacute;amos un
libro en vez de un art&iacute;culo. Como hemos dicho antes, Rebol parece no
tener limitaciones y lo que puede limitar es la imaginaci&oacute;n del usuario.
Unas notas: para este art&iacute;culo, Rebol/Core ha sido probado bajo AmigaOS 3.5, 
BeOS 5, MacOS 7.1 (perd&oacute;n, es el &uacute;nico que ten&iacute;a!), Solaris Sparc 2.6, 
Irix 6.5.7, No Terminado 4.0 y claro Linux (RH 6.2). 
Rebol/View ha sido probado bajo AmigaOS, NT and Linux. Versiones experimentales
han sido probadas bajo Irix, BeOS 5 and Solaris 2.6.
Los scripts y fotos de pantallas fueron hecho bajo Linux, pero probados en las 6
plataformas. Hablando de los scripts, han funcionado igual en cada plataforma
probada (excepto con algunas versiones experimentales de Rebol/View lo que se puede
entender f&aacute;cilmente).
La &uacute;nica diferencia radica en la velocidad puesto que las
m&aacute;quinas utilizadas van de 25 Mhz hasta 400 Mhz! Aunque la frecuencia
de la CPU no lo hace todo... seg&uacute;n la ley del embudo (otra vez, gracias
a mi compadre Javi que es un gr&aacute;n fil&oacute;sofo, ¡aunque cambi&eacute; el
sentido de su teor&iacute;a!). Es decir: Sr. Intel, ha notado que si tiene una
CPU de 1 GHz y un bus de 100 MHz (o incluso 133 MHz), el lado peque&ntilde;o
del embudo se vuelve a&uacute;n m&aacute;s peque&ntilde;o?
<br>
Perd&oacute;n por la digresi&oacute;n!!!
</p>

<p>
Volviendo a Rebol/View, podemos decir que es realmente r&aacute;pido. Navegar en
el reb con Rebol/View es m&aacute;s r&aacute;pido que navegar de la manera
corriente. Usar Rebol como herramienta de desarrollo tambi&eacute;n es muy
impresionante. Si no sientes ganas de probar este gran software, no debes ser
demasiado curioso.
</p>

<A NAME="lfindex4">&nbsp;</A>
<H2>Futuro</H2>

<p>
Primeramente, podemos esperar la versi&oacute;n 1.0 de Rebol/View y, como ya hemos
mencionado, otros productos que se desarrollan ahora mismo. Pero no hemos hablado
del "porvenir". Rebol trabaja en un producto muy gordo llamado Rebol/Express. 
Ser&aacute; un producto comercial totalmente dedicado a las comunicaciones.
Podemos llamarlo un software de internet. Pueden aprender m&aacute;s en &eacute;ste
producto desde
<A href="http://www.rebol.com/products.html">http://www.rebol.com/products.html</a>
Rebol/Express puede ser un competidor para Backweb o Marimba. ¡Qu&eacute;dense a
mirar! Pero conociendo la eficacia de la gente de Rebol podemos esperar otro
gr&aacute;n software.
</p>

<p>
Quiz&aacute;s han notado que no hab&iacute;mos dado informaci&oacute;n sobre licencias.
Rebol es gratuito pero no est&aacute; bajo licencia GPL. Y otra cosa. La gente de
Rebol se parece a sus productos: ¡son extraordinarios! Siempre toman en cuenta
el feedback, que piden a trav&eacute;s del script feedback.r encontrado en el arca.
Contestan las preguntas y proveen documentaci&oacute;n y FAQ. ¡Todo eso GRATUITO!
Tambi&eacute;n podemos tener confianza en las mejoras constantes de los productos. 
Creo de verdad que Rebol se volver&aacute; uno de los actores principales en
comunicaciones durante los proximos a&ntilde;os.
</p>

<p>
Lo &uacute;ltimo que podemos a&ntilde;adir es: prueben los productos Rebol.
No s&oacute;lo vivimos una &eacute;poca estupenda, ¡ tambi&eacute;n va mejorando!
</p>




<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=169&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Georges Tarbouriech <BR>LinuxFocus.org 2000</FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article169.shtml" target="_TOP"><FONT COLOR="#FFFFFF">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</FONT></A><BR></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:georges.t@linuxfocus.org"><FONT COLOR="#FFFFFF">Georges Tarbouriech</FONT></a></font></td>
</tr>
<tr><td><font size=2>es</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2000-09-21, generated by lfparser version 1.8</font></p>
</BODY>
</HTML>
