<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_1.8">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Webdesign">
 <TITLE>Webdesign : Revisi&oacute;n de libros: Professional PHP Programming</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/John-Perr.gif" ALT="[Photo de l&aacute;uteur]" HEIGHT=147 WIDTH=122>
<BR>por  <A HREF="mailto:johnperr@abul.org">John Perr</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Usuario de Linux desde 1994, es uno de los editores de Linux<font color="red">Focus</font> en franc&eacute;s.
</P>
<P><FONT COLOR="#336633">Contenidos</FONT>:
<UL>
  <LI><A HREF="#lfindex0">Introducci&oacute;n</A></LI>
  <LI><A HREF="#lfindex1">Primer contacto</A></LI>
  <LI><A HREF="#lfindex2">PHP y alrededores</A></LI>
  <LI><A HREF="#lfindex3">Casos pr&aacute;cticos</A></LI>
  <LI><A HREF="#lfindex4">Ap&eacute;ndices</A></LI>
  <LI><A HREF="#lfindex5">Conclusiones</A></LI>
  <LI><A HREF="#lfindex6">Enlaces</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=167&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Revisi&oacute;n de libros: Professional PHP Programming</H2>
 <IMG SRC="../../common/images/illustration167.jpg" ALT="[Illustration]" HSPACE=10 HEIGHT=50 WIDTH=96><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
<P>
Esta es una revisi&oacute;n del libro <EM>Professional PHP Programming</EM> editado
por WROX press. PHP es un lenguaje de scripting ejecutado en servidor
para crear p&aacute;ginas web din&aacute;micas.
</P></P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>Introducci&oacute;n</H2>

<P>
El libro <EM>Professional PHP Programming</EM> editado por WROX es una referencia para
programadores. Est&aacute; escrito tanto para usuarios ocasionales de PHP como para programadores
habituales. Es apropiado para todos aquellos que conf&iacute;en en el lenguaje PHP a la hora de
construir un sitio web con contenido din&aacute;mico, algo que est&aacute; m&aacute;s all&aacute; de las capacidades del
HTML puro. La edici&oacute;n revisada era la Inglesa. La edici&oacute;n francesa deber&iacute;a salir a lo largo
de Septiembre, y la coreana ya est&aacute; disponible
<CENTER>
<IMG SRC="../../common/images/image167-1.gif" ALT="[image167-1.gif]" HEIGHT=151 WIDTH=120>
</CENTER>
</P>

<A NAME="lfindex1">&nbsp;</A>
<H2>Primer contacto</H2>

<P>
A primera vista, este libro de 900 p&aacute;ginas es bastante impresionante y parece serio. El
claro objetivo de los autores es explicar la programaci&oacute;n en PHP, sin dejarse en el tintero
ninguno de los aspectos del lenguaje. El libro est&aacute; estructurado en tres partes principales:
<OL>
<LI>El lenguaje PHP y su entorno
<LI>Casos pr&aacute;cticos de diferentes aplicaciones de PHP
<LI>Siete ap&eacute;ndices
</OL>
</P>

<A NAME="lfindex2">&nbsp;</A>
<H2>PHP y alrededores</H2>

<P>
La primera parte es la mayor del libro (alrededor del 60%). El primer cap&iacute;tulo detalla la
instalaci&oacute;n y configuraci&oacute;n de PHP. Tambien compara posibles alternativas a PHP. La lectura
del libro nos conduce a la conclusi&oacute;n que que PHP es la mejor alternativa. Explica la historia
de la mayor parte de las soluciones para programaci&oacute;n de sitios web din&aacute;micos, el concepto del
software libre, as&iacute; como la instalaci&oacute;n de Apache y PHP bajo sistemas operativos comerciales.
</P>

<P>
A continuaci&oacute;n, el lenguaje PHP se presenta a trav&eacute;s de un ejemplo pr&aacute;ctico que se va
completando a lo largo de los cap&iacute;tulos. Se deja claro en las primeras p&aacute;ginas del libro
que el lector debe tener conocimientos de programaci&oacute;n. Esto se evidencia nada m&aacute;s llegar
a los primeros conceptos del libro, aunque los autores hacen esfuerzos para proporcionar
una base. Elementos de programaci&oacute;n como variables, operadores o funciones son presentados.
EL cap&iacute;tulo 9, dedicado a programaci&oacute;n orientada a objetos deber&iacute;a haberse colocado despu&eacute;s
del cap&iacute;tulo 11 para mantener la agradable y suave progresi&oacute;n en el nivel que va alcanzando
el lector. De esta forma se habr&iacute;a mantenido de forma continua a lo largo de los cap&iacute;tulos el
ejemplo de la &quot;Tienda de bicicletas&quot;, puesto que el cap&iacute;tulo 9 trata con una
aplicaci&oacute;n diferente.
</P>

<P>
La primera parte revisa todas las caracter&iacute;sticas cl&aacute;sicas de programaci&oacute;n del lenguaje PHP.
Los siguientes cap&iacute;tulos se dedican a la descripci&oacute;n de interfaces espec&iacute;ficos para algunas
de las herramientas con las que puede trabajar PHP:
<UL>
<LI>Acceso a bases de datos SQL (se usa MySQL como ejemplo)
<LI>Manipulaci&oacute; de im&aacute;genes
<LI>XML
<LI>LDAP: El protocolo ligero de acceso a directorios
<LI>SMTP e IMAP: Enviando y recibiendo correo
<LI>Conectividad: Acceso directo a los sockets de red
<LI>Cookies.
<LI>Seguridad.
</UL>
</P>

<P>
Cada uno de estos cap&iacute;tulos podr&iacute;a constituir un libro por s&iacute; solo. En cualquier caso, cada uno
de los cap&iacute;tulos presenta la materia con detalle suficiente como para permitir al lector afrontar
la programaci&oacute;n PHP3 en la vida real.
<BR>
Tambi&eacute;n hay un cap&iacute;tulo dedicado al tratamiento de errores y al uso del depurador. Esta es
una herramienta realmente &uacute;til en cuanto uno se topa con la programaci&oacute;n de una aplicaci&oacute;n
medianamente seria.
</P>

<A NAME="lfindex3">&nbsp;</A>
<H2>Casos pr&aacute;cticos</H2>

<P>
La segunda parte del libro nos confirma de forma definitiva que est&aacute; escrito para aquellos
que realmente quieren programar en PHP3. Cuatro casos pr&aacute;cticos se estudian a fondo:
<OL>
<LI>Carta de compra: Programar un sitio donde se puede vender cualquier cosa (y boicotear a Amazon, ya que nos ponemos :-).
<LI>Una aplicaci&oacute;n para un foro de discusi&oacute;n.
<LI>Aplicacion de correo electr&oacute;nico: Beat hotmail.
<LI>Visualizador de bases de datos.
</OL>
Las cuatro aplicaciones son completamente funcionales, y su reutilizaci&oacute;n en nuestro propio servidor
es directa, excepto por algunos detalles sobre la configuraci&oacute;n. Esto se ve con mayor claridad
tomando un ejemplo. El primer caso pr&aacute;ctico (la carta de compra) no puede emplearse en la vida
real a menos que Apache se transforme en un servidor seguro incorporando SSL. En este ejemplo
la descuidada seguridad es una elecci&oacute;n intencionada de los autores, para mantener el tama&ntilde;o
de la aplicaci&oacute;n en un tama&ntilde;o razonable y accesible al lector. Un cap&iacute;tulo posterior llamado 
&quot;seguridad&quot; explica los aspectos necesarios en un servidor del mundo real. De esta
forma, construir una aplicaci&oacute;n de carta de compra segura es cuesti&oacute;n de ensamblar juntos los
ladrillos adecuados. Lo que no debe suponer un problema para los programadores.
</P>

<P>
M&aacute;s a&uacute;n, todas las fuentes de los casos pr&aacute;cticos pueden descargarse del servidor web de Wrox (ver
m&aacute;s abajo), lo que resulta muy &uacute;til dado el tama&ntilde;o de los listados y la cantidad de errores
tipogr&aacute;ficos que podr&iacute;an cometerse de otra forma. Puede argumentarse que un CD-ROM empaquetado
con el libro ser&iacute;a una soluci&oacute;n mejor. Por otra parte, para tomar PHP en consideraci&oacute;n, se necesita
acceso a internet, y con las fuentes en el servidor del editor se facilitan las actualizaciones y
correcciones que pudieran ser necesarias despu&eacute;s de la publicaci&oacute;n del libro.
</P>

<A NAME="lfindex4">&nbsp;</A>
<H2>Ap&eacute;ndices</H2>

<P>
El tama&ntilde;o de los ap&eacute;ndices es m&aacute;s bien impresionante. 200 p&aacute;ginas dedicadas a:
<OL>
<LI>funciones PHP
<LI>PHP4 y Zend
<LI>Referencia HTML
<LI>peticiones y respuestas de HTTP
<LI>Expresiones regulares
<LI>Software de c&oacute;digo abierto
<LI>Recursos, soporte, &iacute;ndices ...
</OL>
Todos estos temas se encuentran cubiertos a lo largo del libro, pero los ap&eacute;ndices hacen una
diferencia real porque son a la vez una referencia &uacute;til para PHP, el lenguaje HTML y el protocolo
HTTP. Esta concentraci&oacute;n de informaci&oacute;n no es habitual en un &uacute;nico libro. Si el programador PHP
quiere tener un s&oacute;lo libro, probablemente prefiera &eacute;ste. No faltan enlaces hacia la pol&eacute;mica del
c&oacute;digo abierto. Se pueden encontrar argumentos para convertir a los superiores  al software
libre, por si se sienten tentados por alguna alternativa menos razonable.
</P>

<A NAME="lfindex5">&nbsp;</A>
<H2>Conclusiones</H2>

<P>
A pesar de la r&aacute;pida evoluci&oacute;n del mundo del software libre e internet,
<EM>Professional PHP Programming</EM> es un libro adecuado a las necesidades de los programadores
de sitios web. PHP4 no estaba disponible en el momento en que se edit&oacute; el libro, pero las
pre-versiones fueron suficientes para que los autores pudieran explicar las diferencias entre
PHP3 y PHP4 cuando era necesario. Est&aacute; muy claro que el libro ha sido escrito por programadores
para programadores, tal y como reza el nombre de la colecci&oacute;n en la que se ha publicado.
Los numerosos ap&eacute;ndices se mostrar&aacute;n de gran valor durante el trabajo diario.
</P>

<P>
Definitivamente, <EM>Professional PHP Programming</EM> es un libro para recomendar a todos
aquellos que desean programar de forma PHP de forma eficiente. Los ejemplos y casos pr&aacute;cticos
son de especial inter&eacute;s dado que son concretos y funcionales. Todo el mundo ser&aacute; capaz de
construir su propia aplicaci&oacute;n sin excesivo esfuerzo tras la lectura del libro. Esta es la
mayor ventaja para un programador que pretende construir de forma r&aacute;pida una aplicaci&oacute;n que
funcione de verdd. La forma en que se presenta PHP es clara y pedag&oacute;gica. Seguro que ser&aacute; un
placer para todos aquellos que busquen una forma eficiente de aprender a programar en PHP.
Pueden encontrarse tutoriales sobre PHP en la web, pero ni tan completos ni tan exhaustivos
como este libro.
</P>

<A NAME="lfindex6">&nbsp;</A>
<H2>Enlaces</H2>

<P>
M&aacute;s detalles en:
<UL>
<LI><A HREF="http://www.wrox.com/">Ediciones WROX</A>
<LI><A HREF="http://www.wrox.com/Consumer/Store/Details.asp?ISBN=1861002963"><EM>Professional PHP Programming</EM></A>
<LI><A HREF="http://www.php.net/">php.net</A>
<LI><A HREF="http://www.phpbuilder.com/">PHPBuilder</A>
<LI><A HREF="http://www.apache.org/">Apache</A>
</UL>
</P>




<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=167&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; John Perr <BR>LinuxFocus.org 2000</FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article167.html" target="_TOP"><FONT COLOR="#FFFFFF">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</FONT></A><BR></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:johnperr@abul.org"><FONT COLOR="#FFFFFF">John Perr</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2000-09-14, generated by lfparser version 1.8</font></p>
</BODY>
</HTML>
