<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//ES">
<HTML>
<HEAD>
 <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 <META NAME="GENERATOR" CONTENT="lfparser_1.8">
 <!-- lfparser can be obtained from http://www.linuxfocus.org/developer/Guido/lfparser.html -->
 <META NAME="LFCATEGORY" CONTENT="Community">
 <TITLE>Community : Como informar sobre errores en Debian 2.2</TITLE>
 
</HEAD>
<BODY bgcolor="#ffffff"  text="#000000" alink="#336633" link="#336633" vlink="#336633">
<MAP name="top">
  <AREA shape="rect" coords="367,9,418,30" alt="Hogar" href="../">
  <AREA shape="rect" coords="423,9,457,30" alt="Mapa" href="../map.html">
  <AREA shape="rect" coords="463,9,508,30" alt="Indice" href="../indice.html">
  <AREA shape="rect" coords="514,9,558,30" alt="Busqueda" href="../Search/">
</MAP>
<MAP name="bottom">
  <AREA shape="rect" coords="78,0,163,15" alt="Noticias" href="../News/">
  <AREA shape="rect" coords="189,0,284,15" alt="Arca" href="../Archives/">
  <AREA shape="rect" coords="319,0,395,15" alt="Enlaces" href="../Links/">
  <AREA shape="rect" coords="436,0,523,15" alt="Sobre LF" href="../aboutus.html">
</MAP>
<!-- IMAGE HEADER -->
<CENTER>
  <IMG src="../../common/images/Topbar-es.gif" width="600" height="40" border="0" alt="[Top bar]" ismap usemap="#top" ><BR>
  <IMG src="../../common/images/Bottombar-es.gif" width="600" height="21" border="0" alt="[Bottom bar]" ismap usemap="#bottom">
</CENTER>
<!-- SSI_INFO -->

<!--#include virtual="../../dynahead.shtml" -->

<!-- SHORT BIO ABOUT THE AUTHOR -->
<TABLE ALIGN=LEFT BORDER=0 hspace=4 vspace=4 WIDTH="30%" >
<TR>
<TD><IMG SRC="../../common/images/EgonWillighagen.jpg" ALT="[Photo of the Author]" HEIGHT=102 WIDTH=79>
<BR>por  <A HREF="mailto:egon.w@linuxfocus.org">Egon Willighagen</A>
<BR><BR>
<I>Sobre el autor:</I><BR>
<P>
Se incorpor&oacute; al equipo holandes de Linux<font color="red">Focus</font> en 1999, y se convirti&oacute; en
segundo editor a comienzos de este a&ntilde;o. Estudia informational chemistry
en la Universitdad de Nijmegen. Le gusta caminar y jugar al baloncesto.
</P>
<P><FONT COLOR="#336633">Contenidos</FONT>:
<UL>
  <LI><A HREF="#lfindex0">La comunidad Debian</A></LI>
  <LI><A HREF="#lfindex1">Encontrando errores</A></LI>
  <LI><A HREF="#lfindex2">C&oacute;mo informar de los errores en Debian 2.2?</A></LI>
  <LI><A HREF="#lfindex3">&iquest;Qu&eacute; es lo siguiente?</A></LI>
  <LI><A HREF="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=171&lang=es">Formulario de "talkback" para este art&iacute;culo</A></LI>
</UL>
</P>
</TD></TR></TABLE>
<!-- HEAD OF THE ARTICLE -->
<H2>Como informar sobre errores en Debian 2.2</H2>
 <IMG SRC="../../common/images/illustration171.jpg" ALT="[Illustration]" HSPACE=10 HEIGHT=100 WIDTH=100><P><FONT COLOR="#336633">Resumen</FONT>:
<P>
<P>
Este art&iacute;culo explica qu&eacute; deben hacer los usuarios de Debian por su
comunidad: informar sobre los errores que encuentren. Se explica c&oacute;mo
puede hacerse, y por qu&eacute; es necesario informar sobre ellos.
</P></P><HR size="2" noshade align="right"><BR>
<!-- BODY OF THE ARTICLE -->


<A NAME="lfindex0">&nbsp;</A>
<H2>La comunidad Debian</H2>


<a href="http://www.debian.org/">Debian</a> es ante todo una distribuci&oacute;n
Linux, pero es tambi&eacute;n una comunidad que intenta hacer el mejor sistema
operativo (SO) totalmente libre. Pero, &iquest;Qui&eacute;n forma parte de esta
comunidad? Por supuesto, los desarrolladores son elementos importantes,
pero los usuarios tambi&eacute;n lo son. Si Debian no se usara, los desarrolladores
parar&iacute;an su trabajo. &iquest;Donde est&aacute; la gracia de hacer un software que
nadie usa?
</p>

<p>
Sin embargo, estos desarrolladores son voluntarios. Al contrario de lo
que sucede con los desarrolladores de Red&nbsp;Hat y Suse, que son
empleados de una empresa (RH y Suse), los desarrolladores de Debian no
perciben salario alguno. Y esto quiere decir que no disponen de tiempo
ni recursos ilimitados. "De acuerdo", puedes pensar, "pero &iquest;eso qu&eacute; tiene
que ver conmigo?". Como usuario, puedes echar una mano a estos
desarroladores informando los errores que encuentres.
</p>

<p>
Los paquetes Debian pueden tener dos clases de errores. Uno es un error
de software real. Puesto que el desarrollador Debian a menudo no es el
autor del software (s&oacute;lo crea el paquete Debian para el mismo), puede
intentarlos arreglar el mismo, aunque frecuentemente se lo env&iacute;a al autor
del software.
</p>

<p>
El segundo tipo de error consisten en un error del paquete Debian o un
error en la instalaci&oacute;n del paquete en un sistema Debian. Estos errores
son resueltos por el desarrollador Debian. Y encontrarlos es una tarea
que lleva mucho tiempo.
</p>

<A NAME="lfindex1">&nbsp;</A>
<H2>Encontrando errores</H2>


<p>
Los errores son muy comunes en el software. Pero los desarrolladores
pretenden conseguir un sistema Debian estable, y los errores no son
parte del mismo. Aunque no son f&aacute;cilmente encontrables. De otra forma
ya habr&iacute;an sido eliminados. Los errores pueden encontrarse de varias
formas:
<ul>
  <li>crash de software
  <li>comportamientos inesperados
  <li>errores en la documentaci&oacute;n
</ul>
</p>

<p>
De entre ellos, los crash del sistema son los m&aacute;s faciles de encontrar,
y suelen ser los m&aacute;s dif&iacute;ciles de resolver. Pero el segundo tipo de
error es mucho m&aacute;s duro de encontrar. La raz&oacute;n es que el autor/desarrollador
no puede probar el software en todas sus posibilidades. Por ejemplo,
pensemos en un programa de c&aacute;lculo. El autor puede comprobar varias
cosas: 1+1 debe producir 2, 2*5 debe dar 10, etc. Pero no puede
comprobar todas las sumas y multiplicaciones posibles. Nunca comprobar&aacute;
3456733256677*77782882355.
</p>

<p>
Pero un usuario lo har&aacute;. Los usuarios hacen cosas con (y al) software
que el autor nunca pens&oacute;. Dado que el n&uacute;mero de usuarios es muy superior
al de autores de software y desarrolladores Debian, podemos esperar que
sean mucho m&aacute;s eficaces con estos errores. Pero muy pocos de ellos son
errores graves. Tu sistem&aacute; no parar&aacute; ni tus datos no se ver&aacute;n afectados.
En la mayor parte de los casos estos errores ni siquieran produciran
inconvenientes, puesto que en muchos casos pueden ser evitados.
</p>

<p>
Y como miembro de la comunidad tienes la casi obligaci&oacute;n moral de
comunicar el error al desarrollador Debian, para que se pueda hacer el
software cada vez m&aacute;s estable. Y este art&iacute;culo pretende ser un apoyo
hacia estas posturas (aunque no encontrar&aacute;s demasiados errores en
un sistema Debian :)
</p>

<A NAME="lfindex2">&nbsp;</A>
<H2>C&oacute;mo informar de los errores en Debian 2.2?</H2>


<p>
&iquest;Qu&eacute; hace tan especial de informar un error en Debian? Uno de los
aspectos es que Debian dispone de un completo sistema para informar
sobre errores. Los errores enviados se almacenan en un servidor central
de depuraci&oacute;n. El programa <tt>reportbug</tt> proporciona el mecanismo
para enviar los errores y otras herramientas &uacute;tiles.
</p>

<p>
Supongamos que encuentras un error en el programa
<a href="http://www.debian.org/">dia</a> (mi editor de diagramas
favorito). Sigamos el proceso de enviar un error en este paquete.
(El error encontrado no era un problema de Debian, sino que era
del propio software, por lo que espero que los desarrolladores
Debian se lo remitir&aacute;n a los autores).
</p>

<p>
Escrib&iacute; en la l&iacute;nea de comandos (no encontr&eacute; ning&uacute;n bonito GUI para
este programa):
<table BORDER=0 CELLSPACING=5 CELLPADDING=5 WIDTH="200" BGCOLOR="#F8DCA8" >
<tr><td><pre>
egonw > reportbug
Please enter the name of the package in which you have found a problem,
or type one of these bug categories:

base              General bugs in the base system
boot-floppies     Bugs in the boot and root disks
bugs.debian.org   The bug tracking system, @bugs.debian.org
ftp.debian.org    Problems with the main FTP site (or mirrors)
general           Widespread problems (e.g., that many man pages are mode 755)
kernel            Problems with the kernel in general (otherwise: kernel-image)
list archives      The mailing list archives.
lists.debian.org  The mailing lists (debian-*@lists.debian.org)
manual            Bugs in the manual
nonus.debian.org  Problems with the non-us FTP site (or mirrors)
project           Problems related to Project administration
www.debian.org    Problems with the website (or mirrors)

Enter a package:
</pre></td></tr></table>
</p>

<p>
Hagamos bien el trabajo y no usemos ninguna de estas categor&iacute;as, sino
el paquete. Para ello acabamos la sesion de <tt>reportbug</tt> con ^C
(ctrl-C). Necesitamos encontrar el paquete que conten&iacute;a el ejecutable
"dia". Lo hacemos con:
<table BORDER=0 CELLSPACING=5 CELLPADDING=5 WIDTH="200" BGCOLOR="#F8DCA8" >
<tr><td><pre>
egonw > whereis dia
dia: /usr/lib/dia /usr/X11R6/bin/dia /usr/bin/X11/dia /usr/share/dia
egonw > dpkg -S /usr/bin/X11/dia
dpkg: /usr/bin/X11/dia not found.
egonw > dpkg -S /usr/X11R6/bin/dia
dia: /usr/X11R6/bin/dia
</pre></td></tr></table>
</p>

<p>
El &uacute;ltimo comando nos muestra que el ejecutable ven&iacute;a en el paquete
dia (si no estas seguro, compruebalo con "dpkg -l dia"). Observamos
que whereis nos da cuatro ficheros. El primero es una librer&iacute;a. El &uacute;ltimo
es un directorio y los otros dos son ejecutables. El paquete dia s&oacute;lo
proporciona el segundo de los ejecutables, y el origen del primero me
resulta desconocido.
</p>

<p>
Ahora que hemos identificado el paquete con el problema, podemos
comprobar r&aacute;pidamente de donde bajamos el paqute (ftp/http) o de qu&eacute;
medio (CD/floppy) con el comando:
<table BORDER=0 CELLSPACING=5 CELLPADDING=5 WIDTH="200" BGCOLOR="#F8DCA8" >
<tr><td><pre>
egonw > apt-cache showpkg dia
Versions: 0.86-helix1(/var/state/apt/lists/spidermonkey.helixcode.com_dis
ributions_debian_dists_unstable_main_binary-i386_Packages)(/var/lib/dpkg/
tatus),0.83-2(/var/state/apt/lists/ftp.nl.uu.net_pub_linux_debian_dists_s
able_main_binary-i386_Packages),
Reverse Depends:
  task-helix-gnome,dia
Dependencies:
0.86-helix1 - gdk-imlib1 (2 1.9.8.1) libart2 (2 1.2.0) libaudiofile0 (0
(null)) libc6 (2 2.1.2) libdb2 (2 1:2.4.14-7) libesd0 (18 0.2.16)
libesd-alsa0 (2 0.2.16) libgdk-pixbuf2 (0 (null)) libglib1.2 (2 1.2.0)
libgnome32 (2 1.2.0) libgnomesupport0 (2 1.2.0) libgnomeui32 (2 1.2.0)
libgtk1.2 (2 1.2.0) libpng2 (0 (null)) libpopt0 (0 (null)) libxml1 (0
(null)) xlib6g (2 3.3.6-4) zlib1g (2 1:1.1.3) gsfonts-x11 (0 (null))
0.83-2 - gdk-imlib1 (2 1.9.8-2) libc6 (2 2.1.2) libglib1.2 (2 1.2.0)
libgtk1.2 (2 1.2.6-1) libpopt0 (0 (null)) libxml1 (0 (null)) libz1 (0
(null)) xlib6g (2 3.3.5) gsfonts-x11 (0 (null))
Provides:
0.86-helix1 -
0.83-2 -
Reverse Provides:
</pre></td></tr></table>
</p>

<p>
Con esto vemos que la versi&oacute;n actual (0.86-helix1) se instal&oacute; desde
<a href="http://www.helixcode.com">HelixCode</a> (Para instalar
HelixGnome, escribe
&eacute;cho "#HelixGnome Update\ndeb  http://spidermonkey.helixcode.com/distrib
tions/debian unstable main" >> /etc/apt/sources.list; apt-get update;
apt-get install task-helix-gnome').
Este error no deber&iacute;a enviarse al desarrollador Debian, sino al
empaquetador de Debian HelixGnome que <i>no</i> existe en la herramienta
reportbug. Para el prop&oacute;sito de este art&iacute;culo, asumamos que la versi&oacute;n
0.83-2 se instal&oacute; con el paquete Debian 2.2 de dia y (en mi caso) se
descarg&oacute; desde un mirror FTP en Holanda.
</p>

<p>
De modo que sabemos que el error est&aacute; en el paquete dia-0.83-2.deb
que fue descargado desde un sitio FTP de Debian. Ahora continuamos
enviando el error. Si no estamos en l&iacute;nea podemos a&ntilde;adir la opci&oacute;n '-b',
de modo que el programa no usar&aacute; el sistema de trazado de errores (BTS)
de Debian. Comprobando el BTS se puede saber si el mismo error ha sido
informado con anterioridad, por lo que comprobar el BTS es muy recomendable.
</p>

<p>
Una vez introducido el nombre del paquete y consultado el BTS, se
comprobar&aacute;n las dependencias del mismo. Comprobar las dependencias es
importante, puesto que el softare necesita ciertas librer&iacute;as, y los
errores pueden tener su origen en un conflicto entre versiones.
De hecho, esta es la mayor fuente de errores. No es necesaria ninguna
entrada del usuario para realizar esta comprobaci&oacute;n.
</p>

<p>
La siguiente pregunta que nos har&aacute; es pedirnos una breve descripci&oacute;n
del error. Esta descripci&oacute;n ser&aacute; usada como t&iacute;tulo, y debe ser a la
vez completa y breve. M&aacute;s tarde podremos describir el error en mayor
detalle. En mi caso el t&iacute;tulo era "dia file format incorrectly uses dia
namespace" (el formato de ficheros de dia usa de forma incorrecta el
espacio de nombres de dia). Los detalles y la explicaci&oacute;n vienen despu&eacute;s.
</p>

<p>
Ahora debemos dar una categor&iacute;a al error. Hay cinco clases disponibles:
<table bgcolor="black">
<tr><td>
<table>
  <tr bgcolor="green" align="center" fgcolor="white">
    <td>importancia</td><td>descripci&oacute;nn</td>
  </tr><tr bgcolor="white">
    <td>cr&iacute;tica</td>
    <td><i>produce problemas m&aacute;s all&aacute; del propio software del sistema:
     p&eacute;rdidas de datos importantes, ca&iacute;das o agujeros de seguridad que
     afectan a todo el sistema.</i></td>
  </tr><tr bgcolor="white">
    <td>grave</td>
    <td><i>convierte al paquete en no usable (o casi), p&eacute;rdidas de datos,
      o crea agujeros de seguridad en las cuentas de los usuarios del
      paquete.</i></td>
  </tr><tr bgcolor="white">
    <td>importante</td>
    <td><i>cualquier otro error que haga el paquete inadecuado para su
      uso normal.</i></td>
  </tr><tr bgcolor="white">
    <td>normal</td>
    <td><i>el valor por defecto, para errores 'benignos'.</i></td>
  </tr><tr bgcolor="white">
    <td>petici&oacute;n</td>
    <td><i>para solicitar nuevas caracter&iacute;sticas, pero tambi&eacute;n &uacute;til para
       errores dif&iacute;ciles de fijar debido a consideraciones de dise&ntilde;o
       del software.</i></td>
  </tr>
</table>
</td></tr>
</table>
</pre>
</p>

<p>
Decidimos un nivel de severidad apropiado. Normal es el valor por defecto,
y la mayor parte de los errores de Debian 2.2 tendr&aacute;n esta severidad.
Esto se debe a que Debian usa m&uacute;ltiples y exhaustivos ciclos de pruebas
en los que el sistema al completo es chequeado antes de ser liberado
al p&uacute;blico. Notemos que tambi&eacute;n se pueden expresar deseos usando
reportbug, aunque claramente no se trate de errores.
</p>

<P>
Una vez seleccionada la categor&iacute;a, aparece un editor con toda la
informaci&oacute;n recopilada hasta el momento:
<table BORDER=0 CELLSPACING=5 CELLPADDING=5 WIDTH="200" BGCOLOR="#F8DCA8" >
<tr><td><pre>
Subject: dia file format incorrectly uses dia namespace
Package: dia
Version: 0.86-helix1
Severity: normal

-- System Information
Debian Release: 2.2
Architecture: i386
Kernel: Linux george 2.2.17 #1 Sun Jun 25 09:24:41 EST 2000 i586

Versions of packages dia depends on:
ii  gdk-imlib1            1.9.8.1-helix4     Gdk-Imlib is an imaging
library fo
ii  libart2               1.2.4-helix3       The Gnome canvas widget
ii  libaudiofile0         0.1.9-0.1          The Audiofile Library
ii  libc6                 2.1.3-10           GNU C Library: Shared
libraries an
ii  libdb2                2:2.4.14-2.7.7.1.c The Berkeley database
routines (ru
ii  libesd0               0.2.17-7           Enlightened Sound Daemon -
Shared
ii  libgdk-pixbuf2        0.8.0-helix2       The GNOME GdkPixBuf
library.
ii  libglib1.2            1.2.8-helix1       The GLib library of C
routines
ii  libgnome32            1.2.4-helix3       The Gnome libraries
ii  libgnomesupport0      1.2.4-helix3       The Gnome libraries
</pre>
</td>
</tr>
</table>
</p>

<p>
En este momento es cuando podemos elaborar el t&iacute;tulo que introdujimos
con anterioridad. Entre las l&iacute;neas "Severity: normal" y
"-- System Information" podemos a&ntilde;adir m&aacute;s detalles sobre las condiciones
en que se produjo el error. Intentaremos reproducir el error, y describir
cuidadosamente los pasos que dimos para llegar a &eacute;l. Esto ayuda a los
desarrolladores a trazar el error hasta una parte del c&oacute;digo que no
funcione correctamente. En situadiones m&aacute;s complejas tal vez tambi&eacute;n
quieras informar del comportamiento que se esperaba.
</p>

<p>
Por &uacute;ltimo, el programa te preguntar&aacute; si quieres que el error se env&iacute;e
a la lista de errores. Al enviarlo acaba el proceso por ahora. Y t&uacute;
hiciste algo en beneficio de la comunidad.
</p>

<A NAME="lfindex3">&nbsp;</A>
<H2>&iquest;Qu&eacute; es lo siguiente?</H2>


<p>
Puedes averiguar en qu&eacute; estado se encuentra el error visitando el
<a href="http://www.debian.org/Bugs/">Sistema de trazamiento de errores
de Debian</a> y seleccionando el paquete del que informaste del error.
No esperes que aparezca antes de 24 horas. Luego, s&oacute;lo queda esperar y,
con un poco de paciencia, los errores acabar&aacute;n por ser fijados.
</p>

<p>
No es demasiado bueno que a&uacute;n no exista interfaz gr&aacute;fico para reportbug
pero en estos momentos cualquier usuario Debian puede informar sobre
errores, independientemente de la funcionalidad del sistema. Y un
interfaz es se hace con bastante rapidez en estos tiempos, por lo que
probablemente podemos esperar ver uno pronto.
</p>



<A NAME="talkback">&nbsp;</a>
<h2>Formulario de "talkback" para este art&iacute;culo</h2>
Cada art&iacute;culo tiene su propia p&aacute;gina de "talkback". A trav&eacute;s de esa p&aacute;gina puedes enviar un comentario o consultar los comentarios de otros lectores
<center>
<table border="0"  CELLSPACING="2" CELLPADDING="1">
 <tr BGCOLOR="#C2C2C2"><td align=center>
  <table border="3"  CELLSPACING="2" CELLPADDING="1">
   <tr BGCOLOR="#C2C2C2"><td align=center>
    <A href="http://cgi.linuxfocus.org/cgi-bin/lftalkback?anum=171&lang=es"><b>&nbsp;Ir a la p&aacute;gina de "talkback"&nbsp;</b></a>
   </td></tr></table>
</td></tr></table>
</center>

<HR size="2" noshade>
<!-- ARTICLE FOOT -->
<CENTER><TABLE WIDTH="95%">
<TR><TD ALIGN=CENTER BGCOLOR="#777777">
<A HREF="../../common/lfteam.html"><FONT COLOR="#FFFFFF">Contactar con el equipo de LinuFocus</FONT></A>
<BR><FONT COLOR="#FFFFFF">&copy; Egon Willighagen <BR>LinuxFocus.org 2000</FONT>
<BR><a href="http://cgi.linuxfocus.org/cgi-bin/lfcomment?lang=es&article=article171.html" target="_TOP"><FONT COLOR="#FFFFFF">Pinchar aqu&iacute; para informar de alg&uacute;n problema o enviar comentarios a LinuxFocus</FONT></A><BR></TD>
<TD BGCOLOR="#777777"><!-- TRANSLATION INFO -->
<font size=2>Informaci&oacute;n sobre la traducci&oacute;n:</font><TABLE>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>--</font></td>
    <td><font size=2><a href="mailto:egon.w@linuxfocus.org"><FONT COLOR="#FFFFFF">Egon Willighagen</FONT></a></font></td>
</tr>
<tr><td><font size=2>en</font></td>
    <td><font size=2>-&gt;</font></td>
    <td><font size=2>es</font></td>
    <td><font size=2><a href="mailto:javier.pb@linuxfocus.org"><FONT COLOR="#FFFFFF">Javier Palacios</FONT></a></font></td>
</tr>
</TABLE></TD>
</TR></TABLE></CENTER>
<p><font size=1>2000-10-14, generated by lfparser version 1.8</font></p>
</BODY>
</HTML>
