<HTML>
<HEAD>
<TITLE>FAQ del Grupo Español de Usuarios de Linux (SLUG): Algunas direcciones &uacute;tiles </TITLE>
</HEAD>
<BODY>
<A HREF="slugfaq1.htm">Anterior</A>
<A HREF="slugfaq3.htm">Siguiente</A>
<A HREF="slugfaq.htm#toc2">Contenidos</A>
<HR>
<H2><A NAME="s2">2. Algunas direcciones &uacute;tiles </A></H2>

<P>Linux es hijo de la Internet. El propio Linus Torvalds ha afirmado
en muchas ocasiones que de no haber existido la Red, su proyecto
de sistema operativo no habr&iacute;a pasado de ser una 'chapucilla' para
uso estrictamente personal. Es por ello que el lugar natural para
buscar todo lo relacionado con dicho sistema sea la propia Red.
Para facilitar la b&uacute;squeda al no iniciado aqu&iacute; van una lista de
recursos disponibles.</P>

<H2><A NAME="ss2.1">2.1 Documentaci&oacute;n de Linux (en Castellano y en ingl&eacute;s)</A></H2>

<P>Existen numerosos documentos sobre Linux, desde varias lineas a
libros completos. De especial relevancia son los producidos bajo
los auspicios del Proyecto de Documentaci&oacute;n de Linux (Linux
Documentation Project o LDP), un conjunto de documentos disponibles
a trav&eacute;s de la Red y traducidos a varios idiomas. </P>
<P>Estos documentos
tienen un Copyright bastante liberal, que permite que sean redistribuidos
o copiados, en todo o en parte, en soporte electr&oacute;nico o papel, mientras
se cumplan una serie de normas simples, como son mantener el Copyright
original o solicitar el permiso por escrito del autor original para 
cualquier modificaci&oacute;n o traducci&oacute;n. (La distribuci&oacute;n comercial de copias 
impresas est&aacute; sujeta a otras restricciones que conviene consultar en cada
caso). Actualmente existen en España diversos grupos dedicados a la 
traducci&oacute;n de esta documentaci&oacute;n.</P>
<P>Estos documentos se dividen en dos categor&iacute;as:</P>
<H3>Linux HOWTOs (o Linux COMOs)</H3>

<P>Documentos cortos que explican de un modo pr&aacute;ctico como llevar a cabo
tareas comunes, como pueden ser configurar las impresoras bajo Linux,
conectarse a la Red via telef&oacute;nica, configurar el correo electr&oacute;nico,
etc. </P>
<P>Se pueden encontrar en varios formatos, entre ellos ASCII, htm (para
verlos a trav&eacute;s del Web) o PostScript (listo para imprimir), adem&aacute;s
de su formato fuente, linuxdoc-SGML.</P>
<P>Adem&aacute;s en esta categor&iacute;a tambien se incluyen documentos de
apenas unas pocas p&aacute;ginas que cubren temas muy espec&iacute;ficos como 
pueden ser como compartir un disco duro entre Linux, DOS y Windows 95
o que son los BogoMIPS. A estos documentos se les denomina mini-HOWTOs,
y suelen no estar disponibles en todos los formatos.</P>
<P>Todos estos documentos se pueden encontrar en su versi&oacute;n original en
los 
<A HREF="#mirrors-LDP">mirrors del LDP</A>. Normalmente la
versi&oacute;n original ser&aacute; en ingl&eacute;s.</P>
<P>En la distribuci&oacute;n Debian, en el paquete doc-linux vienen todos los
HOWTOs y mini-HOWTOs en formato ASCII. Si has instalado ese paquete
los encontrar&aacute;s en el directorio <CODE>/usr/doc/HOWTO/</CODE>. El fichero
<CODE>INDEX.gz</CODE> contiene una lista de todos los documentos disponibles.
<CODE>(N. del A.: ¿Donde se encuentran en las dem&aacute;s distribuciones?)</CODE></P>
<P>Actualmente se est&aacute; llevando a cabo la traducci&oacute;n de los HOWTOs al
Castellano por el grupo INSFLUG. En la
<A HREF="http://www.insflug.nova.es/">p&aacute;gina Web del INSFLUG</A>
se puede encontrar informaci&oacute;n sobre el estado actual de las traducciones,
como colaborar, adem&aacute;s de las versiones ya traducidas.
Pr&oacute;ximamente (¿ya?) tambi&eacute;n se podr&aacute;n encontrar las traducciones en
cualquiera de los 
<A HREF="#mirrors-LDP">mirrors del LDP</A>. </P>
<H3>Libros del LDP</H3>

<P>Ademas de los HOWTOs, el LDP tambi&eacute;n ha producido algunos libros en
formato electr&oacute;nico. Cada uno cubre un conjunto m&aacute;s amplio de temas que
un HOWTO, aunque a menudo no llegan al grado de detalle de estos. 
Adem&aacute;s, dado su tamaño, se actualizan con menos frecuencia. Aun as&iacute;
son el punto de referencia obligado para obtener una visi&oacute;n general
y bastante completa de los distintos aspectos de un sistema Linux y
algunos de ellos se pueden encontrar en las librer&iacute;as, con meras
diferencias 'est&eacute;ticas' con respecto a la versi&oacute;n electr&oacute;nica.</P>
<P>Algunos de los manuales publicados hasta el momento son:
<UL>
<LI><CODE>Installation and Getting Started</CODE> (Instalaci&oacute;n y Primeros Pasos)
de Matt Welsh</LI>
<LI><CODE>Network Administrator's Guide</CODE> (Gu&iacute;a del Administrador de Redes)
de Olaf Kirch</LI>
<LI><CODE>System Administrator's Guide</CODE> (Gu&iacute;a del Administrador de 
Sistemas) de Lars Wirzenius </LI>
</UL>
</P>
<P>La traducci&oacute;n de los libros del LDP al Castellano se est&aacute; llevando a cabo
en el marco del 
<A HREF="http://www.infor.es/LuCAS">proyecto LuCAS</A>.
Est&aacute; disponible la traducci&oacute;n del "Instalaci&oacute;n y Primeros Pasos" y
en breve aparecer&aacute; la versi&oacute;n beta de la "Gu&iacute;a del Administrador de Redes".</P>
<H3><A NAME="mirrors-LDP"></A> Mirrors del LDP</H3>

<P>Todos los documentos del LDP se encuentran disponibles en una gran
cantidad de nodos que mantienen copias id&eacute;nticas del archivo principal,
que se encuentra en la Universidad de Carolina del Norte, en EEUU.
En España podemos encontrar copias en las siguientes direcciones:
<UL>
<LI>
<A HREF="http://slug.ctv.es/pub/mirror/LDP/">Web del SLUG: http://slug.ctv.es/pub/mirror/LDP/</A></LI>
<LI>
<A HREF="http://www.cs.us.es/archive/">Universidad de Sevilla: http://www.cs.us.es/archive/</A></LI>
<LI>
<A HREF="http://www.etsimo.uniovi.es/linux/">Universidad de Oviedo: http://www.etsimo.uniovi.es/linux/</A></LI>
<LI>
<A HREF="http://www.gui.uva.es/linux/">Universidad de Valencia: http://www.gui.uva.es/linux/</A></LI>
<LI>
<A HREF="http://www.virtualsw.es/linux/sunsite/LPD/">virtualsw: http://www.virtualsw.es/linux/sunsite/LPD/</A></LI>
</UL>
</P>
<H3>Otra documentaci&oacute;n.</H3>

<P>Si bien aqu&iacute; he puesto &eacute;nfasis en la documentaci&oacute;n del LDP conviene recordar
que la mayor&iacute;a de las aplicaciones que instalemos tienen su propia 
documentaci&oacute;n, bien en forma de 'p&aacute;ginas de manual' (man-pages) accesibles
con el comando <CODE>man</CODE>, bien en forma de 'p&aacute;ginas de informaci&oacute;n (GNU)'
(info-pages) accesibles con el comando <CODE>info</CODE>, bien en forma de
documentaci&oacute;n electr&oacute;nica en formato ASCII, PostScript, htm o cualquier
otro, que se instala conjuntamente con la aplicaci&oacute;n. De especial relevancia
son los ficheros <CODE>README</CODE>.</P>
<P>En la distribuci&oacute;n Debian, la documentaci&oacute;n disponible para cada 
aplicaci&oacute;n se instala en el directorio <CODE>/usr/doc/</CODE><EM>aplicaci&oacute;n</EM>. 
<CODE>(N. del A.: ¿Y en las dem&aacute;s distribuciones?)</CODE></P>
<P>La traducci&oacute;n de las 'p&aacute;ginas del manual' correspondientes a las utilidades
m&aacute;s comunes las est&aacute; llevando a cabo <CODE>(N. del A.: Buscando el URL correspondiente)</CODE></P>

<H2><A NAME="ss2.2">2.2 Listas de correo de Linux (en Castellano y en ingl&eacute;s)</A></H2>



<H2><A NAME="ss2.3">2.3 Grupos de News (en Castellano y en ingl&eacute;s)</A></H2>



<H2><A NAME="ss2.4">2.4 Distribuciones de Linux (¿D&oacute;nde?)</A></H2>



<H2><A NAME="ss2.5">2.5 ¿D&oacute;nde puedo encontrar el programa X?</A></H2>



<H2><A NAME="ss2.6">2.6 Linux en el Web</A></H2>



<HR>
<A HREF="slugfaq1.htm">Anterior</A>
<A HREF="slugfaq3.htm">Siguiente</A>
<A HREF="slugfaq.htm#toc2">Contenidos</A>
</BODY>
</HTML>
