<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="SGML-Tools 1.0.9">
 <TITLE>Reescritura de direcciones con sendmail mini-COMO: Introducci&oacute;n</TITLE>
 <LINK HREF="Reescritura-Direcciones-En-Sendmail-Como-2.html" REL=next>

 <LINK HREF="Reescritura-Direcciones-En-Sendmail-Como.html#toc1" REL=contents>
</HEAD>
<BODY>
<A HREF="Reescritura-Direcciones-En-Sendmail-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Reescritura-Direcciones-En-Sendmail-Como.html#toc1">Índice general</A>
<HR>
<H2><A NAME="s1">1. Introducci&oacute;n</A></H2>

<P>
<P>Dar&eacute; por sentado que tiene el tipo de acceso a Internet que parece ser
com&uacute;n en las universidades y en los proveedores de servicios de Internet
hoy en d&iacute;a: usted se conecta con la red de su proveedor utilizando PPP
sobre una conexi&oacute;n serie. Su correo entrante se almacena temporalmente en
el servidor POP o IMAP de su proveedor, mientras que el correo saliente se
env&iacute;a mediante SMTP. No tiene un nombre de dominio propio, por lo que todo
debe usar <I>una</I> direcci&oacute;n.
<P>Asumir&eacute; tambi&eacute;n que ya ha instalado una versi&oacute;n bastante reciente de
<CODE>sendmail</CODE>, realizado por Eric Allman (la versi&oacute;n m&aacute;s reciente, al
escribir estas l&iacute;neas, era la <CODE>8.8.8</CODE> 
<BLOCKQUOTE>Nota del editor: a d&iacute;a
de la revisi&oacute;n, la &uacute;ltima versi&oacute;n disponible es la <CODE>8.9.3</CODE>; deber&iacute;a
actualizarse.  De hecho, si hay un programa que tendr&iacute;a que mantener
actualizado, es &eacute;ste...  </BLOCKQUOTE>
 y con ella deber&iacute;a funcionar bien).
<P>Este documento se refiere particularmente a propiedades espec&iacute;ficas de los
sistemas Debian GNU/Linux; los usuarios de otras distribuciones deber&iacute;an
tener algo de cuidado.
<P>Aseg&uacute;rese de tener esta informaci&oacute;n a mano:
<P>
<UL>
<LI>El servidor de correo de su proveedor de servicios Internet.</LI>
<LI>Su direcci&oacute;n de correo electr&oacute;nico.</LI>
</UL>
<P>La configuraci&oacute;n que planeamos tiene dos metas principales:
<P>
<OL>
<LI>Debe ser posible enviar correo entre los usuarios locales.
</LI>
<LI>El resto del planeta debe ver las direcciones de los usuarios del
proveedor de servicios Internet, no las direcciones locales.</LI>
</OL>
<P>Para alcanzar esto, haremos uso del la opci&oacute;n <CODE>genericstable</CODE> de 
<CODE>sendmail</CODE>.
<P>
<HR>
<A HREF="Reescritura-Direcciones-En-Sendmail-Como-2.html">Página siguiente</A>
Página anterior
<A HREF="Reescritura-Direcciones-En-Sendmail-Como.html#toc1">Índice general</A>
</BODY>
</HTML>
